{"adult":false,"backdrop_path":"/tOT9uJTi93Fu5U72sTNUwHly5Kq.jpg","created_by":[],"episode_run_time":[45],"first_air_date":"2020-11-19","genres":[{"id":10759,"name":"Action & Adventure"},{"id":18,"name":"Drama"}],"homepage":"","id":100033,"in_production":false,"languages":["zh"],"last_air_date":"2021-01-09","last_episode_to_air":{"id":2180226,"name":"Episode 49","overview":"Unexpectedly, the wolf cub, who was not well versed in the world, was misunderstood as a murderer who murdered the important minister in order to save the young wolf.","vote_average":0,"vote_count":0,"air_date":"2021-01-09","episode_number":49,"episode_type":"finale","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null},"name":"The Wolf","next_episode_to_air":null,"networks":[{"id":2007,"logo_path":"/uBCIoV9AUGIdfXTrtJ6CRIxOZF6.png","name":"Tencent Video","origin_country":"CN"},{"id":1330,"logo_path":"/fNxBFqWr7eWEgNeBDvvCxsSItXx.png","name":"iQiyi","origin_country":"CN"},{"id":1419,"logo_path":"/jBWFMzbqiqAIJxplZ0lRvZDzzZK.png","name":"Youku","origin_country":"CN"}],"number_of_episodes":49,"number_of_seasons":1,"origin_country":["CN"],"original_language":"zh","original_name":"狼殿下","overview":"Towards the end of the Tang Dynasty, Zhu Wen usurped the throne and established the Liang Kingdom. A boy from the wild accidentally falls off a cliff while being pursued for saving wolf pups. He is rescued by Zhu Wen who adopts him as a son, and is renamed Zhu Youwen.\n\nTen years later, the young boy has been conferred the title Prince of Bo and he meets and falls in love with Zhaixing, the daughter of a governor. Zhaixing discovers that Zhu Youwen is kind and righteous in spite of his status and the two become embroiled in a struggle for power.","popularity":45.253,"poster_path":"/o1ykZNT8N82P9CSHg7HhledEbOx.jpg","production_companies":[{"id":130066,"logo_path":null,"name":"Chen Yu Shan (Lady and the Liar 千金女賊)","origin_country":""}],"production_countries":[{"iso_3166_1":"CN","name":"China"}],"seasons":[{"air_date":"2020-11-19","episode_count":49,"id":144462,"name":"Season 1","overview":"","poster_path":"/ceER6jrMu4alnGdvlB1IvSCKJOD.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Mandarin","iso_639_1":"zh","name":"普通话"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.706,"vote_count":17,"season_data":{"1":{"_id":"5e5f249e9b86160015fefa7f","air_date":"2020-11-19","episodes":[{"air_date":"2020-11-19","episode_number":1,"episode_type":"standard","id":2180155,"name":"Episode 1","overview":"Zhu Wen usurped the throne and proclaimed himself emperor, establishing the back beam. Ma Ying's daughter Ma met a wild boy who grew up in the mountains and forests since childhood. The inexperienced wild boy was hunted down to save the young wolf, fell off the cliff, and was accepted as a righteous son by Zhu Wen and was named Prince Bo.","production_code":"","runtime":44,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-19","episode_number":2,"episode_type":"standard","id":2180176,"name":"Episode 2","overview":"Ma Jiajun's deputy general Ma Feng Cheng was ordered to go up the mountain to round up the wolf cubs, but found that the wolf cubs were protecting the wolves and voluntarily submitting to them. Ma Feng Cheng lamented that if the wolf cubs did not commit crimes, their generals could bear heavy responsibility. At the same time, Winning Stars was worried about the wolf, and with the assistance of her daughter Xiao Feng, fled to Mafu to find the wolf. Ma Jiajun escorted the wolf cub back to Mafu.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-20","episode_number":3,"episode_type":"standard","id":2180177,"name":"Episode 3","overview":"Ma Jun used the copper bell for picking stars to round up the wolf cubs and the wolf pack first, and humiliated the wolf cubs. The wolf cub mistakenly thought that he was betrayed by the star, and counterattacked with the wolves. Ma Jun shot the wolves, and the wolves were killed and injured countless. When Star Reaching arrived, he begged Ma Jun to rush to save people, but Ma Jun injured his leg.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-20","episode_number":4,"episode_type":"standard","id":2180178,"name":"Episode 4","overview":"Xiaofeng accompanies Picking Stars on the street to relax. The two of them came to the restaurant to watch the shadow puppet stage that is about to be performed. Between the curtains of a shadow play, Picking Stars almost reunited with King Bo, who was disguised as staying in the restaurant, but they did not see each other. At this moment Ma Ying rushed back from the capital, King Bo ordered Ye Sha to monitor Ma Ying.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-21","episode_number":5,"episode_type":"standard","id":2180179,"name":"Episode 5","overview":"After Starcatcher regained consciousness, he suffered from loss of soul. On Wen Yan's suggestion, King Bo went to pick up the medicine for Starcatcher-Nucleus. When Wen Yan took care of Starcatcher alone, the young master of Tongzhou visited. The two sides risked a conflict due to misunderstanding.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-21","episode_number":6,"episode_type":"standard","id":2180180,"name":"Episode 6","overview":"Ma Jiajun approached Suyang City, and Yun Wang Chu Yougui tried to reassure him. Ma Jiajun insisted that Chu Kui show up and make an oath, otherwise he would break into the city. When the two sides were in danger, King Bo brought back the star picking in time. Under the guarantee and explanation of the star picking, Ma Jiajun said that he had misunderstood Chu Kui.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-26","episode_number":7,"episode_type":"standard","id":2180181,"name":"Episode 7","overview":"On the outskirts of the city, Guan Nu Lin Guang ventured away in order to meet his own son. The next day Chu Kui practiced arrows with King Bo. King Bo was upset because of the wedding period. Chu Kui ordered King Bo to make good use of the piece of star picking and treat it well, until she had no use value, and then abandoned it. On the way to Bowang Mansion, Star Reaching found Lin Guang who was hungry and cold and injured.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-26","episode_number":8,"episode_type":"standard","id":2180182,"name":"Episode 8","overview":"Chu Kui questioned everyone because of the assassin case. Yang Hou suspected that Lin Guang's affairs were not simple, and Jingxiang accused Lin Guang as an assassin. In the end, Chu Kui believed that the assassins appeared in King Bo’s Mansion were caused by Ma Qiexing’s self-assertion and King Bo’s ignorance.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-27","episode_number":9,"episode_type":"standard","id":2180183,"name":"Episode 9","overview":"Reaching the stars accepted the invitation of King Bo and went to the banquet happily. King Bo changed his previous unkindness and fought with the banquet to turn the stars into jade silk. The two pour out their hearts, and King Bo embraced the stars and embraced each other, invisibly forming affection for each other. Last night, Pickstar and King Bo fell asleep in the other hospital.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-27","episode_number":10,"episode_type":"standard","id":2180184,"name":"Episode 10","overview":"King Bo and Picking the Star returned to King Bo’s Mansion. Although the people of Bao Na had not arrived, the gifts came first. The paintings and objects sent showed her obsession with King Bo. Before leaving Yang, King Bo asked Bao Na to conceal the marriage contract, and King Bo reluctantly accepted. But he asked the star to cook and make fruit by himself as compensation.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-28","episode_number":11,"episode_type":"standard","id":2180185,"name":"Episode 11","overview":"Returning to the Bowang Mansion, Starcatcher heard that Bowang wanted to teach Baona to practice calligraphy, and suggested that the two men and women should go to the hall to practice. Bowang secretly liked to pick stars and got jealous, but Baona was unhappy, so she had to suggest two The man continued to stay in the study and departed sadly, but as soon as the star was picked, King Bo left on the grounds of official business.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-28","episode_number":12,"episode_type":"standard","id":2180186,"name":"Episode 12","overview":"When King Yun saw that Po Na was making a plan, he secretly sent a signal to the rush and bounty people. So fast, she kidnapped Po Na smoothly. King Bo rushed to where Po Na was attacked, and found that Po Na's whereabouts were unknown. In the court, Chu Kui learned of King Bo’s mistakenly borrowed troops and imprisoned King Bo in the sky prison, and ordered King Yun to quickly find Po Na.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-03","episode_number":13,"episode_type":"standard","id":2180187,"name":"Episode 13","overview":"You Wen rushed to the solitary village, gave the villagers supplies to survive the cold winter, and then sneaked into King Yun's mansion, implying how King Yun could get away and asking for more rewards. According to Ji Chong's words, Zhao Xing went to the mountain temple to arrest the real murderer.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-03","episode_number":14,"episode_type":"standard","id":2180188,"name":"Episode 14","overview":"Chu Kui ordered King Bo to go and let the star picker to accompany him. King Bo said bluntly that he hated star picking, and Chu Kui angrily rebuked him that it shouldn't be the case. When King Yun saw the rush, he ordered him to attack King Bo to avenge Jingxiang. So Ji Chong entered Bowang's travel team as Xiangma master. Before leaving, King Bo was jealous and was joking with the stars. Swiftly saw that the relationship between Star Reaching and King Bo has changed, he was confused and thought it was his poor performance, which caused King Bo to be unhappy.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-04","episode_number":15,"episode_type":"standard","id":2180189,"name":"Episode 15","overview":"The sad star-catching still worried about King Bo’s drinking and hurting himself, and he was about to deliver the anti-alcohol medicine to the room. King Bo saw that she was unwilling to give up, humiliated her, and even tried to take her. He was frustrated and regretted. Ji Chong learned that the star was wronged, but found that the star was missing.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-04","episode_number":16,"episode_type":"standard","id":2180190,"name":"Episode 16","overview":"King Bo only took Wen Yan and several Bojun troops to Fuhulin for the appointment on time, and Mo Xiao led the rest of the Bojun troops to Nanliao Pagoda to greet the Four Highnesses. Reaching the stars happened to meet Po Na, who was welcoming King Bo, and only then knew that Po Na had not sent an envoy to deliver the letter.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-05","episode_number":17,"episode_type":"standard","id":2180191,"name":"Episode 17","overview":"Po Na sent someone to bring Youzhen to the barracks in person. Youzhen has always been disliked by King Bo. After learning that Ji Chong had missed in Fuhulin, King Yun was furious and was accidentally heard by Chu Chu. Chu Chu begged King Yun to turn his head back to shore, but King Yun was confused.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-05","episode_number":18,"episode_type":"standard","id":2180192,"name":"Episode 18","overview":"Ji Chong and Bo Wang competed in archery in order to win stars. In order to win, he did not hesitate to use the sword as an arrow. Upon seeing this, King Bo clenched his sword and voluntarily abstained. Jichong won the game and got the Jade Butterfly. In the mass celebration, King Bo took advantage of the chaos to take away the star, just to care about her injury, the behavior of King Bo puzzled the star. King Bo did not admit that he cared about picking the stars out of love, and when he picked the stars, he was anxious to leave because he was afraid of expecting him again. Reaching the stars accidentally saw King Bo could find the sachet that was blowing away according to the direction of the wind. Reaching the stars was shocked. In this world, except for the wolf, who can see the wind?","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-10","episode_number":19,"episode_type":"standard","id":2180193,"name":"Episode 19","overview":"King Bo thought that it was dangerous to catch the stars, so he rushed to the cliff on the outskirts of the city in a hurry and heard the familiar copper bell. Reaching the stars stood on the edge of the cliff, and the situation was very dangerous, but there was no fear of taking the stars. She insisted on forcing King Bo to admit that he was a wolf boy, but King Bo refused to admit it.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-10","episode_number":20,"episode_type":"standard","id":2180194,"name":"Episode 20","overview":"King Bo and Zhao Xing returned to Kuizhou City. They met the old acquaintance shopkeeper Fang and his daughter Hong'er on the street. They found that Hong'er had become rebellious and rude, so they resolved Hong'er's knot together and accompanied him. To make her friends. Hong'er told his father that the man who accompanied the sister of Star Reaching was the elder brother who had booked the restaurant and told the story of the little wolf.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-11","episode_number":21,"episode_type":"standard","id":2180195,"name":"Episode 21","overview":"After picking the star and entering the palace, the doctor who treated her legs. From the mouth of Yao Ji, the doctor knew that King Bo and her were old acquaintances, but they had a knot between them. King Bo finished dealing with Hong'er and returned to the palace.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-11","episode_number":22,"episode_type":"standard","id":2180196,"name":"Episode 22","overview":"Uninvited guest Yao Ji was ordered by Chu Kui to ask the stars to prepare for the upcoming Zhu Zhen banquet. The stars were shocked to find that the death row among them turned out to be an old friend of his father.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-12","episode_number":23,"episode_type":"standard","id":2180197,"name":"Episode 23","overview":"King Bo couldn't find the star, and asked Yao Ji for someone. Yao Ji used wolf bone flower to make King Bo lose his mind. King Bo slashed himself, the pain made him wake up, and he saw Hong'er's body. King Bo asked Yao Ji why he killed someone, but Yao Ji said it was to prevent King Bo from making mistakes again and again.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-12","episode_number":24,"episode_type":"standard","id":2180198,"name":"Episode 24","overview":"Just when King Bo and Chou Xing were living sweetly, Ji Chong wandered to Kuizhou City with the black ring stones given by Chou Xing. Not long ago, he heard that the restaurant was on fire, but the treasurer Fang's body appeared in the river valley ten miles away.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-17","episode_number":25,"episode_type":"standard","id":2180199,"name":"Episode 25","overview":"Chu Kui told King Bo that Ma Jiajun was to blame for the death of King Bin that year. Only by destroying Ma Jiajun and Ma Zhaixing can he take advantage of King Bin's spirit in heaven. Regarding King Bin as his own hands and feet, King Bo obeyed Chu Kui's orders on the surface.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-17","episode_number":26,"episode_type":"standard","id":2180200,"name":"Episode 26","overview":"After learning the truth, Ma Fengcheng fell ill and died. Ma Jiajun knows that Ma Ying’s death was caused by Yang Guo. The Yang domestic traitor in the Majia military camp took the opportunity to fly a pigeon to inform Chu Kui. Fortunately, he was discovered by Ji Chong, but the news of the traitor letting Ma Jiajun rebellion still reached Chu Kui's ears.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-18","episode_number":27,"episode_type":"standard","id":2180201,"name":"Episode 27","overview":"Mo Xiao was ordered by King Bo to bring Star Reaching to King Bo’s Mansion, which is full of memories of her sweet love with King Bo, but now it is like a joke, but she just wants to cry, Reaching Star comes to Ye Sha, who has never been here before. Secret room, this was the first time she saw the cold King Bo. She couldn't help but wonder if he really loved herself?","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-18","episode_number":28,"episode_type":"standard","id":2180202,"name":"Episode 28","overview":"When Chu Kui learned of Ji Chong's true identity, he was anxious and threatened that even if King Bo gets Ma Jiajun, he may not have a chance of winning. Reaching the stars and others arrived at Bo Guotai Yuancheng. Ji Chong brought the stars to relax, and Chong was curious about the reason why Ji Chong abandoned the status of the prince son of Sichuan, but Ji Chong did not say clearly.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-19","episode_number":29,"episode_type":"standard","id":2180203,"name":"Episode 29","overview":"Under the influence and support of the star picking, King Bo opposed harsh government, helped the people, helped justice, and prevented brothers from fighting. In the process, the relationship between the two of them has been deepening. Although there have been disputes and misunderstandings since then, the two have always had a good heart, treated each other frankly, and never left. After going through many trials and tribulations, King Bo and Star Retriever have overcome various crises and challenges with kindness and justice, and finally reaped their own happiness.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-19","episode_number":30,"episode_type":"standard","id":2180204,"name":"Episode 30","overview":"Star Reaching apologizes to King Bo for her gaffe. King Min proposed to let the star-catching redeem the merits, that is, on behalf of the kingdom of Min, go to the celebration of the enthronement of King Bo and destroy the kingdom of Yang. Reaching the stars promised. She worked hard to improve her martial arts, preparing for revenge for the upcoming meeting with King Bo.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-24","episode_number":31,"episode_type":"standard","id":2180205,"name":"Episode 31","overview":"Bowang's bow and arrow shot through the sky, and the solar eclipse immediately faded, breaking the star-catching strategy. Po Na refused to accept King Bo, and went to make trouble with King Bo. She rushed to call Po Na back, confronted King Bo, and the two faced each other with swords until the star came to stop.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-24","episode_number":32,"episode_type":"standard","id":2180206,"name":"Episode 32","overview":"King Bo also tracked down that the painter Chu remembered the real appearance of Princess Pingxian, so Mo Xiao asked Chu Zhen to receive Zhu Zhen. It turned out that both Star Reaching and King Ming knew that this woman was named Liu Xin, and she was the personal court lady of Princess Pingxian.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-25","episode_number":33,"episode_type":"standard","id":2180207,"name":"Episode 33","overview":"Ji Chong used the portrait to prove that the star is the real daughter of the princess. Reaching the stars once again proved his life experience with his mother's relic-the three-color ring stone. So far, King Wang finally agrees that Reaching the Stars is the daughter of the benefactor, the only surviving former empire.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-25","episode_number":34,"episode_type":"standard","id":2180208,"name":"Episode 34","overview":"Chu Kui levied taxes and food for the campaign, and the emperors continued to be born. The third highness was defeated by the army, and the rumors that the fourth highness was seriously injured caused turmoil in the country and the outside. King Bo was tortured by illness and was still unconscious, and Yang Jun was uneasy. Chu Kui asked Yao Ji to treat King Bo with all his strength.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-26","episode_number":35,"episode_type":"standard","id":2180209,"name":"Episode 35","overview":"King Mo supported the title of the emperor, held a canonization ceremony for star-receiving, appeared quickly, and formally apologized to his father for years of rashness. Since then, Lu Guo has finally united as one. In Yang State, all the military marquis still did not see King Bo, and their military spirit was greatly lost, and they demanded that Chu Kui and King Bo divide the world equally.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-26","episode_number":36,"episode_type":"standard","id":2180210,"name":"Episode 36","overview":"Two days later, the wolf bone flower has been refined. For the upcoming battle, Li Jun has full confidence in the upcoming battle. He rejected King Bo’s proposal and rushed to be a surprise candidate. The battle of Bo Zhu will not only defeat King Bo, but must also Take down Chu Kui.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-31","episode_number":37,"episode_type":"standard","id":2180211,"name":"Episode 37","overview":"King Bo regretted that he couldn't break Chu Kui's conspiracy sooner, and that Ma Ying was killed. He made a great wish to General Ma Ying's Spirit of Heaven, hoping that the stars will survive the difficulties, and he will pay her back in the future. The abbot clearly saw the mood of King Bo. In order to win the stars, King Bo would rather lose his life. Reaching the stars finally woke up, saw the enemy King Bo, tried to resist, but failed.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-31","episode_number":38,"episode_type":"standard","id":2180212,"name":"Episode 38","overview":"Halfway, King Bo lost his mind due to the remaining wolf bone flower in his body. He was painful and depressed. He tried to prevent Star Reaching from discovering his unbearable side, but in the end he could not restrain himself and accidentally injured Star Reaching without consciousness.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-01","episode_number":39,"episode_type":"standard","id":2180213,"name":"Episode 39","overview":"Reaching the stars woke up and saw Ji Chong. Ji Chong said that he would retreat from the wounded King Bo, and he was also injured. In fact, the injury caused by the rush is what he did, otherwise, it would be difficult to get the trust of the star. Picking up the stars brought a lot of confusion to King Bo the night before, and rushed back to the country of Bo.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-01","episode_number":40,"episode_type":"standard","id":2180214,"name":"Episode 40","overview":"On the day before the wedding, Ma Jing mistakenly thought that Ji Chong and Kelang were looking for happiness, and told the story about Star , but Star was not jealous at all. Reaching the stars means Ma’s life, as a queen, she must be like this. At this moment, King Bo, who was in the prison, learned from Yao Ji that Star Reach was about to marry Ji Chong. On the day of the rejoicing of the stars, King Bo also came to execute his sentence.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-02","episode_number":41,"episode_type":"standard","id":2180216,"name":"Episode 41","overview":"Bu Jun Mieyang was blocked and reached a deadlock. Ji Chong offered to save King Bo and help Mie Yang, because King Bo knew Yang Jun best. Winning the stars for the sake of the people and peace in the world, accepted the rushing proposal.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-02","episode_number":42,"episode_type":"standard","id":2180218,"name":"Episode 42","overview":"Ji Chong concealed his true intentions to save King Bo, and used Liuer's identity to pretend to be a chaiman, and successfully entered the Qiannu Camp. Reaching the stars finally talked to King Bo, hoping to persuade King Bo to help Kuo overthrow the tyranny of Chu Yang and save the common people, but King Bo was reluctant to leave the Qiannu camp, let alone helping someone and Chu Kui contend for the world.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-07","episode_number":43,"episode_type":"standard","id":2180219,"name":"Episode 43","overview":"Liu'er suspected that Star Reaching and Ji Chong were not enemies with King Bo. Reaching Star admitted that she believed that Liu'er should not spread rumors and that rumors would kill people, but Liuer hated Chu Kui and vented all his hatred of Chu Kui.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-07","episode_number":44,"episode_type":"standard","id":2180220,"name":"Episode 44","overview":"King Bo and Liu'er settled down in Bo, King Bo told Liu'er about his past with Xing'er on Langshou Mountain. Winning the stars devotes herself wholeheartedly to the work of resettling the slaves of the Qian Slave camp, and has no intention to talk about love with the rush. Due to the existence of King Bo, the rush that was originally worried about getting the stars out of his body made him even more disturbed.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-08","episode_number":45,"episode_type":"standard","id":2180222,"name":"Episode 45","overview":"When Po Na heard that King Zhe was planning to entertain Chu Kui, she was so angry that she ran to the country to tell the big news about Star Reaching. King Bo decided to save people alone, but was stopped by everyone. In the end, Ji Chong, Star Reach, King Bo and Po Na decided to go to Zhanxian together to rescue Ye Sha.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-08","episode_number":46,"episode_type":"standard","id":2180223,"name":"Episode 46","overview":"Po Na was worried that Ji Chong was too sad, and went to comfort him. She didn't expect Ji Chong to be very open-minded and open-minded. She believed that her deeds were to set all three people free. Even if Ji Chong felt pain in her heart, he would let go of his feelings for star picking. The dashing and unrestrained manner deeply attracted Po Na.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-09","episode_number":47,"episode_type":"standard","id":2180224,"name":"Episode 47","overview":"In the two countries, righteousness and evil are opposed, and they are divided against rituals. Yang Wang Chukui fought vigorously, and the war was full of flames. The loyal King resisted Chu Kui and retreated to the north, raising his troops to wait for the day of attack. The intelligent and kind star picker met a wild boy on Langshou Mountain and named him Langzi.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-09","episode_number":48,"episode_type":"standard","id":2180225,"name":"Episode 48","overview":"The wolf cub grew up in the mountains and forests. Although he has not been educated, he has a simple nature and a pure heart.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-09","episode_number":49,"episode_type":"finale","id":2180226,"name":"Episode 49","overview":"Unexpectedly, the wolf cub, who was not well versed in the world, was misunderstood as a murderer who murdered the important minister in order to save the young wolf.","production_code":"","runtime":45,"season_number":1,"show_id":100033,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":144462,"poster_path":"/ceER6jrMu4alnGdvlB1IvSCKJOD.jpg","season_number":1,"vote_average":0}}}