{"adult":false,"backdrop_path":null,"created_by":[{"id":1231245,"credit_id":"5257fc6a19c29531db30fe09","name":"Russell Morash","gender":0,"profile_path":"/9o2NOx9P0ZUdBWnPKNUAL8OaKZf.jpg"}],"episode_run_time":[30],"first_air_date":"1989-01-07","genres":[],"homepage":"http://www.newyankee.com","id":10086,"in_production":false,"languages":["en"],"last_air_date":"2009-06-27","last_episode_to_air":{"id":2877913,"name":"Roll Top Desk (2)","overview":"Norm visits the Old Schwamb Mill in Arlington, Massachusetts. Built in 1860, the mill was purchased in 1864 by German immigrant woodworkers, Charles and Frederick Schwamb. The brothers did a brisk business crafting the oval picture frames which, at the time, were in demand to display photographs of Civil War soldiers. In the Schwamb Brother's old office, Norm spies a handsome, quarter-sawn oak roll top desk, which inspires him to build his version of this American classic. This is part 2 of 2. NOTE: This is the same project as Season 10, Episode 13 with a new introduction by Norm Abram.","vote_average":0,"vote_count":0,"air_date":"2009-06-27","episode_number":26,"episode_type":"finale","production_code":"0926","runtime":30,"season_number":21,"show_id":10086,"still_path":null},"name":"The New Yankee Workshop","next_episode_to_air":null,"networks":[{"id":14,"logo_path":"/hp2Fs7AIdsMlEjiDUC1V8Ows2jM.png","name":"PBS","origin_country":"US"}],"number_of_episodes":286,"number_of_seasons":21,"origin_country":["US"],"original_language":"en","original_name":"The New Yankee Workshop","overview":"The New Yankee Workshop is a woodworking program produced by WGBH Boston, which aired on PBS. Created in 1989 by Russell Morash, the program is hosted by Norm Abram, a regular fixture on Morash's This Old House. The series aired for 21 seasons before broadcasting its final episode on June 27, 2009.","popularity":10.411,"poster_path":"/g5LJpDN6DEwav6q4mJq1fawV9pO.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"1989-01-07","episode_count":13,"id":83013,"name":"Season 1","overview":"First Season of the Series.\n\nSeries host, Norm Abram, builds an oak medicine cabinet, an ash drop-leaf table, a pine blanket chest, a pine bedside table, an oak bathroom vanity, a cherry trestle table, a painted bookcase, a pine chest of drawers, a candle stand, a pine hutch, a maple slant-top writing desk, and a pine corner cupboard.\n\nFor \"shop tools and techniques\", he builds a workbench.","poster_path":"/vkdeSdzWLaSWjXD0uj5CSmhH6Ht.jpg","season_number":1,"vote_average":0},{"air_date":"1990-01-06","episode_count":13,"id":83014,"name":"Season 2","overview":"Norm builds an ash rocking horse, a cypress Adirondack chair, a mahogany butler's table, a pine kitchen dresser, a pine hearthside settle, a poplar pencil-post bed, a maple and poplar chair table, a pine kitchen worktable, an oak mission-style sofa, a Chippendale mirror, a cherry chest-on-chest, a teak English garden bench, and an armoire  entertainment center.","poster_path":"/z8aaBmBI9rezo5Rsyew3RKj0WWB.jpg","season_number":2,"vote_average":0},{"air_date":"1991-01-05","episode_count":13,"id":88342,"name":"Season 3","overview":"Norm builds a number of Shaker-inspired projects: step stools out of pine and cherry, a painted two-drawer blanket chest, a pine washstand, a walnut wall clock, a pine woodbox, and a cherry library table.  He also builds a picnic table and sawhorses out of 2x6 stock, a sandbox, a cherry harvest table, a redwood garden swing, a cricket table, a pie safe, and a mahogany standing mirror.","poster_path":"/mHkpXrwiyi5E1b5kXYzwKPaC0eO.jpg","season_number":3,"vote_average":0},{"air_date":"1992-01-04","episode_count":13,"id":88343,"name":"Season 4","overview":"Norm builds a cypress outdoor lidded bench, a child's wagon, a pallet-wood coffee table, a redwood gardener's work bench, a Shaker tall chest, white cedar colonial fences, a pine console table, an oak wheelbarrow, an oak umbrella stand, a maple and pine turned-post bed, a dove cote, and a cherry ladderback chair.\n\nFor \"shop tools and techniques\", he builds a rolling shop cabinet.","poster_path":"/aQ92fpzk6nsS9u0q4rv95GNAgCK.jpg","season_number":4,"vote_average":0},{"air_date":"1993-01-02","episode_count":13,"id":88344,"name":"Season 5","overview":"Norm builds a Victorian kitchen table out of pine, a plant stand out of pine, an oak Delft rack, an oak coffee table, cypress outdoor planters, a pantry table, a white oak sideboard, a pine hanging corner cupboard, a pine cupboard, a poplar and maple butcher block, a redwood arbor, a pine secretary desk, and a tall pine clock.","poster_path":"/sTNReLkTD7ZdNPHhIBa4W0zSbey.jpg","season_number":5,"vote_average":0},{"air_date":"1994-01-01","episode_count":13,"id":88345,"name":"Season 6","overview":"Norm builds a number of child-related projects, including an easel, a doll house, a maple and mahogany toy chest, a cradle out of cherry, a trundle bed, a marble roll, a rocking chair, an alphabet wagon, a high chair, and a playhouse.  He also builds storage units and a student's desk out of oak.","poster_path":"/85uX1MBHlpLwmMefGWIRns6ekGp.jpg","season_number":6,"vote_average":0},{"air_date":"1995-01-07","episode_count":13,"id":88346,"name":"Season 7","overview":"Norm tackles a number of larger projects including a Clancy boat and a Gazebo.  He also builds a cherry X-brace trestle table, a pine pergola, a mahogany TV tray table, an outdoor garden table and Lutyens bench out of teak, a cherry bathroom vanity, picture frames, a pine quilt rack, and a pine chimney cupboard.","poster_path":"/jShaeVrAlbfJjiRNaPanr2t2pp7.jpg","season_number":7,"vote_average":0},{"air_date":"1996-01-06","episode_count":13,"id":88347,"name":"Season 8","overview":"Norm takes a trip to California wine country. Inspired from his trip, he builds a chestnut coffee table, a pine paymaster's desk, a pine long table, a pine double dresser, a chestnut desk, an Irish hutch out of pine, and a redwood wine storage unit.  He also builds a bedside cupboard, turned table lamps, and a nest of drawers.  Finally, he builds a garden shed and recycling center.\n\nFor \"shop tools and techniques\", he builds a router table.","poster_path":"/g4sSHivpkoWheKkE9MCt44085M.jpg","season_number":8,"vote_average":0},{"air_date":"1997-01-04","episode_count":13,"id":88348,"name":"Season 9","overview":"Norm visits Savannah, Georgia. Inspired from the trip, he builds a pine planter's desk, a pine turkey table, a tiger maple washstand, a pine carousel table, and a mahogany 7-drawer chest.  He also builds a Nantucket settle out of cherry, a pine dough box,  a pine garden gate, cherry serving trays, a bent-wood hat rack, and a fireplace mantel.  Finally, he tackles a major project - building a greenhouse.","poster_path":"/aukQs3H9tnTM1GD3JKyDh62L1Zj.jpg","season_number":9,"vote_average":0},{"air_date":"1998-01-03","episode_count":13,"id":88349,"name":"Season 10","overview":"More from Norm's trip to Savannah, Georgia; he builds a pine linen press and a walnut table.  Norm also visits Arizona, where he gets ideas to build a white oak Morris chair and a mesquite bookcase.  Norm also visits Utah where he gets wood from an old railroad trestle and builds a chaise lounge.  He also builds a pine Irish table, a pine library ladder, a pine Irish bar, a barn cupola, a whirligig, and a roll-top desk.\n\nFor \"shop tools and techniques\", he builds a chop saw station.","poster_path":"/3BJeAsSV7W7lYba8yoRsiYZYX9N.jpg","season_number":10,"vote_average":0},{"air_date":"1999-01-02","episode_count":13,"id":88350,"name":"Season 11","overview":"Norm builds a number of kitchen-centric projects, including, a kitchen island, a kitchen pantry, a kitchen secretary, a bake center, classic kitchen cabinets, a sink base, a chef's table, and a grill cart.  He also builds an old pine hutch, a teak bar, a laundry center, and a press cupboard.\n\nFor \"shop tools and techniques\", he builds a table saw station.","poster_path":"/enXI6ecmXRv1K4YjUFmUQBjXFXD.jpg","season_number":11,"vote_average":0},{"air_date":"2000-01-01","episode_count":13,"id":88351,"name":"Season 12","overview":"Norm builds planter boxes and a bench out of cypress, a croquet set and bench, a hanging porch swing and outdoor patio table out of teak, a computer desk, a mahogany patio trolley, a chestnut desktop writing case, an English server, a jewelry case, and a breakfront cabinet.\n\nFor \"shop tools and techniques\", he spends two episodes assembling a garage workshop and builds a sharpening station.","poster_path":"/ztrlLqdgibFaMR1Eim2tXylhnpw.jpg","season_number":12,"vote_average":0},{"air_date":"2001-01-06","episode_count":13,"id":88352,"name":"Season 13","overview":"Norm builds a white oak hall seat, a pine CD storage case, a cypress garden armchair, an outdoor cupboard, a mahogany dressing table, a mailbox, a bath cupboard, a pine monastery table, and an oak barrister's bookcase.\n\nFor \"shop tools and techniques\", he spends two episodes demonstrating jigs and builds a hutch for the workshop.","poster_path":"/6DJUur411bXsXSgRm1lBDXJBHSO.jpg","season_number":13,"vote_average":0},{"air_date":"2002-01-05","episode_count":13,"id":88353,"name":"Season 14","overview":"Norm builds a chestnut steamer trunk, an Adirondack loveseat, a tiger maple canopy bed, a cherry shaving stand, a pedestal table and deck chair out of teak, a four-drawer chest, wooden bowls, a cherry and tiger maple nightstand, and a stepback cupboard.\n\nFor \"shop tools and techniques\", he builds a miter bench with storage, a work table, and a clamp cart.","poster_path":"/avFtDW20EhVPI6VRlKTXLE6rRNj.jpg","season_number":14,"vote_average":0},{"air_date":"2003-01-04","episode_count":13,"id":88354,"name":"Season 15","overview":"Norm makes a pine sheep shearing coffee table, a Queen Anne pedestal table, a cigar chair, a glass cupboard, a maple media press, a Douglas fir flagpole, a mahogany regency headboard, a painted corner hutch out of poplar, and a walnut French side table.\n\nFor \"shop tools and techniques\", he builds a deluxe router station and a wall-mounted tool chest.","poster_path":"/gK1Mw7fFDSmj4uUYEwBqZSDJxx8.jpg","season_number":15,"vote_average":0},{"air_date":"2004-01-03","episode_count":13,"id":88355,"name":"Season 16","overview":"Norm builds a butterfly table, a Shaker bookcase, and a lowboy out of cherry, a folding screen and dining table out of mahogany, a flower stand and gardener's dry sink out of cypress, a tall case oak clock, a decoratively-painted dower chest, a fan back Windsor chair, a painted pier table, and an oak mission-style desk.","poster_path":"/kqyIUCMGFdNEZK4d2FPXsO5BVtH.jpg","season_number":16,"vote_average":0},{"air_date":"2005-01-01","episode_count":13,"id":88356,"name":"Season 17","overview":"Norm visits Bermuda where he gets ideas to build a bench/table out of cypress and a chest out of mahogany.  He also builds an oak hall mirror, an upholstered ottoman, a federal-style game table, a side chair, a cherry tilt top table, a Queen Anne highboy out of tiger maple, yet another kitchen island, carved wooden signs, and the library modular bookshelf system.\n\nFor \"shop tools and techniques\", he demonstrates the basics of using the lathe.","poster_path":"/5DvGwAPnqqKE7qV6TaFYBFAN9Py.jpg","season_number":17,"vote_average":0},{"air_date":"2006-01-07","episode_count":13,"id":88357,"name":"Season 18","overview":"Norm builds a colonial-style mantel, plantation shutters, a poker table and wall-hung console out of mahogany, a walnut shop clock, a white oak corner table, a Greek revival bookcase, a storage shed, a cherry corner chair, and wall paneling.\n\nFor \"shop tools and techniques\", he spends two episodes demonstrating use of the router and he builds a roller stand, a stock cart, and a mobile tool stand.","poster_path":"/lNPurxKfe6rSIZN3xP3ahWKC4Gc.jpg","season_number":18,"vote_average":0},{"air_date":"2007-01-06","episode_count":13,"id":88358,"name":"Season 19","overview":"Norm builds a giltwood mirror, an entrance door and bowfront chest out of mahogany, an old pine dry sink, a cherry candlestand, a painted Dominy clock, a cowboy sideboard, a painted cupboard, a decoratively-painted taunton chest, a nest of tables, and an upholstered window bench.\n\nFor \"shop tools and techniques\", he spends two episodes demonstrating the use of the table saw.","poster_path":"/uj2piehgvS3EWulIG4AUq0WDDCO.jpg","season_number":19,"vote_average":0},{"air_date":"2008-01-05","episode_count":13,"id":88359,"name":"Season 20","overview":"Norm spends the first nine episodes performing a kitchen remodel for series creator, Russell Morash.  He also builds an Adirondack chair, table, and footrest, an all-weather loveseat, an upholstered lolling chair, and a Queen Anne-style tap table.","poster_path":"/5JWSZuM6yNVYqWQLuajPQPs98Ro.jpg","season_number":20,"vote_average":0},{"air_date":"2009-01-03","episode_count":26,"id":88360,"name":"Season 21","overview":"The Final Season. The episodes in this season are rebroadcasts from Seasons 9 and 10 with new introductions by Norm Abram.","poster_path":"/nM7CC8qSvs7wDfe8z9cbL15PuMI.jpg","season_number":21,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"585adc1492514122d2018612","air_date":"1989-01-07","episodes":[{"air_date":"1989-01-07","episode_number":1,"episode_type":"standard","id":1249328,"name":"Medicine Cabinet","overview":"After a tour of The New Yankee Workshop to preview the collection of furniture he will build in the first season, Norm visits a \"retiring room\" at the Hancock Shaker Village in western Massachusetts to find a model for a handcrafted medicine cabinet. Drawing inspiration from a looking glass and cabinet, Norm uses durable red oak and oak plywood to construct a medicine chest of his own design featuring box-joint joinery","production_code":"101","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-01-14","episode_number":2,"episode_type":"standard","id":1249329,"name":"Workbench","overview":"A good workshop begins with a well-equipped workbench, and master woodworker Norm uses one from his own shop as a model for the conveniently-sized and affordable workbench he builds in this episode. After a look at a workbench used 100 years ago by the craftsmen at Hancock Shaker Village in western Massachusetts, Norm builds a workbench featuring an oak-edged hardwood top, a bench vice, a recessed tool storage area on top and a shelf beneath.","production_code":"102","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-01-21","episode_number":3,"episode_type":"standard","id":1249330,"name":"Drop Leaf Table","overview":"Norm uses ash, a durable hardwood, to fashion a drop-leaf table featuring turned legs, a top and leaves made from glued up stock. Norm shows how to turn the table legs on a duplicating lathe and reveals a few tricks for making mortise and tenons joints. Using a router and two special bits, he shows how the drop-leaf joint is made.","production_code":"103","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-01-28","episode_number":4,"episode_type":"standard","id":1249331,"name":"Blanket Chest","overview":"Norm travels to the island of Nantucket off the Massachusetts coast to look at a handmade blanket chest in a sea captain's house dating from 1790. Incorporating elements of this antique in his own design, Norm builds a blanket chest of pine, lined with aromatic cedar panels.","production_code":"104","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-02-04","episode_number":5,"episode_type":"standard","id":1317356,"name":"Bedside Table","overview":"Norm constructs a bedside table inspired by one found at the Hancock Shaker Village in western Massachusetts. Norm's design, made from pine, features a shallow drawer, table legs tapered on the inner sides and a table top with a breadboard design (glued boards edged with wood on two ends).","production_code":"105","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-02-11","episode_number":6,"episode_type":"standard","id":1319115,"name":"Oak Bathroom Vanity","overview":"Norm demonstrates how to build a bathroom vanity with dovetailed joints. He uses oak and a laminate top with double doors and a flat panel outside and raised panel inside mimicking the Shaker style. The vanity dimensions are 34\" high x 38\" wide x 23\" deep.  Inspired by a dry sink he found at a 1790 Shaker house in Harvard, Norm's oak unit features dovetailed joints and a high-pressure laminate top.","production_code":"106","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-02-18","episode_number":7,"episode_type":"standard","id":1319116,"name":"Trestle Table","overview":"After a look at a pine trestle table in a Shaker house on the island of Nantucket off the Massachusetts coast, Norm constructs his own easily-disassembled trestle table of cherry, a hardwood which, if kiln-dried, resists twisting or shrinking over time. Norm shows how to glue up the boards that comprise the expansive table top and demonstrates how to make the two trestles and the stretcher which connects them.","production_code":"107","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-02-25","episode_number":8,"episode_type":"standard","id":1319117,"name":"Bookcase","overview":"Norm builds a free standing bookcase with a cornice detail, adjustable shelves, and a removable base. He uses pine for the base and birch plywood for the rest. The bookcase dimensions are 80\" high x 36\" wide x 12 1/2\" deep.","production_code":"108","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-03-04","episode_number":9,"episode_type":"standard","id":1319118,"name":"Chest of Drawers","overview":"Norm demonstrates how to build a chest of drawers using Ponderosa pine. He cuts and planes the wood, glues the boards fro the top and sides. He also illustrates how to build the drawers including the drawer case, the frames, and the base. The chest measures 42\" high x 41 1/2\" wide x 19\" deep.\n\nNorm makes his own design from Ponderosa pine, showing how to cut and plane the wood, glue the boards and build the drawers, frame and base.","production_code":"109","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-03-11","episode_number":10,"episode_type":"standard","id":1319119,"name":"Candle Stand","overview":"Norm travels to the Hancock Shaker Village in western Massachusetts to gather ideas for his own design for a candle stand. Returning to his workshop, Norm shows home woodworkers how to build an exact replica using power tools, including a lathe, router and band saw.","production_code":"110","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-03-11","episode_number":11,"episode_type":"standard","id":1319120,"name":"Hutch","overview":"Norm demonstrates how to build a hutch using knotty pine. The hutch consists of a base cabinet that has raised panel doors and an open shelf section. It measures 81 1/2\" high x 56\" wide x 18\" deep.\n\nIn the kitchen of the Fitch house at Old Stourbridge, Norm shows us an early American `hutch' then builds his own pine version back at the workshop.","production_code":"111","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-03-25","episode_number":12,"episode_type":"standard","id":1319121,"name":"Writing Desk","overview":"Norm builds a writing desk with a slanted top that is constructed mostly of maple. The desk features a shallow drawer, a nest of small drawers, and a open bins in the top. The dimensions are 42\" high x 36\" wide x 20\" deep.\n\nMade mostly of maple, this desk is one of the more complicated projects ever tackled by Norm.","production_code":"112","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-04-01","episode_number":13,"episode_type":"finale","id":1319122,"name":"Corner Cupboard","overview":"Norm constructs a corner cupboard of pine and plywood. His design employees a top section that is enclosed by glass paned doors and a base cabinet with raised panel doors. The cupboard dimensions are 86 1/2\" high x 42\" wide x 30\" deep.\n\nNorm makes his own corner cupboard from pine and plywood, incorporating a top section with glass doors and a base cabinet with raised panel doors.","production_code":"113","runtime":30,"season_number":1,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"First Season of the Series.\n\nSeries host, Norm Abram, builds an oak medicine cabinet, an ash drop-leaf table, a pine blanket chest, a pine bedside table, an oak bathroom vanity, a cherry trestle table, a painted bookcase, a pine chest of drawers, a candle stand, a pine hutch, a maple slant-top writing desk, and a pine corner cupboard.\n\nFor \"shop tools and techniques\", he builds a workbench.","id":83013,"poster_path":"/vkdeSdzWLaSWjXD0uj5CSmhH6Ht.jpg","season_number":1,"vote_average":0},"2":{"_id":"585adc36c3a3682f5807a523","air_date":"1990-01-06","episodes":[{"air_date":"1990-01-06","episode_number":1,"episode_type":"standard","id":1319114,"name":"Rocking Horse","overview":"After a look at a collection of wooden toys at Old Sturbridge Village, a \"living history\" museum in central Massachusetts, Norm builds a child's rocking horse from ash- a durable hardwood.","production_code":"201","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-01-13","episode_number":2,"episode_type":"standard","id":1319785,"name":"Adirondack Chair","overview":"Norm designs his own version of the rustic Adirondack chair out of cypress, an excellent wood that needs no preservatives or treatment.","production_code":"202","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-01-20","episode_number":3,"episode_type":"standard","id":1319786,"name":"Butler's Table","overview":"Norm visits Kingscote, an elegant Gothic Revival house in Newport, Rhode Island, for a look at a mahogany butler's table with four leaves that fold down on solid brass hinges. For his version of this stylish antique, Norm demonstrates the technique of biscuit joinery to glue together the boards for the tray, crafts mortise-and-tenon joints to connect the rails of the base, uses a molding head cutter on his table saw to add a decorative bead to the rails, and shows how to mount the tray's special hinges.","production_code":"203","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-01-27","episode_number":4,"episode_type":"standard","id":1319787,"name":"Kitchen Dresser","overview":"After a look at an early 18th-century kitchen cupboard at Old Sturbridge Village, a \"living history\" museum in Sturbridge, Massachusetts, Norm constructs his own version from pine featuring open shelves above a base cabinet whose door sports an antique-style hinge. He shows a pattern to draw the curved outline of the side pieces, then uses a hand-held saber saw to make the cut, saving the cut-out portions to make shelves. Using a molding head cutter on his table saw, Norm demonstrates how to add a decorative bead to the shelves.","production_code":"204","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-01-03","episode_number":5,"episode_type":"standard","id":1319788,"name":"Hearthside Settle","overview":"Norm travels to the Massachusetts harbor of Gloucester to look at a high-backed, curved hearthside settle at Beauport, the home of tarry 20th-century interior decorator and antiquarian Henry Sleeper. The house is now a museum run by the Society for the Preservation of New England Antiquities. Norm's version of this pine piece closes in the area beneath the seat to create a storage space and adds an access hatch in the seat. Norm shows how to cut the settle's curved cross-members and shaped side pieces, how to join the back boards with tongue-and-groove joints, and how to bend the back base board along the bottom of the frame.","production_code":"205","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-02-10","episode_number":6,"episode_type":"standard","id":1319789,"name":"Pencil-Post Bed","overview":"Norm visits the Shelbourne Museum in Burlington, Vermont to examine an antique pencil-post bed with a rope support system and a hay-filled mattress. Norm then adapts this design to accommodate a standard full-size mattress and box spring, and builds his pencil-post bed of poplar featuring mortise and tenon joints in the construction. The bedposts are tapered on the two inner sides, then beveled on all four corners to produce eight-sided, asymmetrically tapered posts.","production_code":"206","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-02-17","episode_number":7,"episode_type":"standard","id":1319790,"name":"Chair Table","overview":"Norm drops in on the Fitch House in Old Sturbridge Village, central Massachusetts' \"living history\" museum, to look at a chair table, with a tabletop that pivots back to form a back rest and a seat with a drawer underneath. Norm's version of this unusual but comfortable and serviceable piece features hardwood (maple) where needed - on the tabletop, arms and feet - and poplar for the sides, seat and drawer front. Norm cuts the shaped side pieces and curved arms and feet on the band saw, shows how to create a sliding dovetail joint to attach the seat and drawer support to the sides, and demonstrates a trick for cutting the large circular tabletop by mounting a specially made jig on the band saw.","production_code":"207","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-02-24","episode_number":8,"episode_type":"standard","id":1319791,"name":"Kitchen Worktable","overview":"Norm constructs a kitchen table that functions equally well as a dining table or a worktable. Built of pine, the table features tapered legs and storage drawers, with a center rail joining the pairs of legs. Norm employs a specially made tapering jig to fashion the legs and uses mortise-and-tenon joints to put the table together.","production_code":"208","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-03-03","episode_number":9,"episode_type":"standard","id":1319792,"name":"Mission Style Sofa","overview":"In a departure from the traditional New England-style furniture usually featured on The New Yankee Workshop, Norm draws inspiration from the furniture craftsmen of the southwestern United States to constructs mission-style sofa whose signature simple lines and oak frame allow for cushions. Despite its distinctive regional flavor, Norm's design for this project features the same woodworking techniques - including mortise-and-tenon joinery - he employs in creating his other pieces.","production_code":"209","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-03-10","episode_number":10,"episode_type":"standard","id":1319793,"name":"Chippendale Mirror","overview":"In a change of pace, Norm shows how to build picture and mirror frames, emphasizing tools and clamps designed specifically for this purpose. Norm uses a mitre box and a table saw outfitted with a jig to cut frames and demonstrates a variety of techniques to fasten corners.","production_code":"210","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-03-17","episode_number":11,"episode_type":"standard","id":1319795,"name":"Chest on Chest","overview":"With this eight-drawer, cherry chest-on-chest Norm simplifies a complicated project that may, at first glance, seem daunting to the home woodworker. Norm demonstrates techniques of biscuit joinery on the side panels and dovetail joinery on the drawers and cross-rails, then shows how to craft sculpted, contoured feet for the base using a band saw, table saw, template and router.","production_code":"211","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-03-24","episode_number":12,"episode_type":"standard","id":1319796,"name":"English Garden Bench","overview":"Norm leaves his trademark plaid shirt and jeans at home and dons a stylish suit and derby when he visits London for a look at an authentic English garden bench. Norm constructs his version from teak. The bench is assembled entirely with mortise and tenon joinery and pegs to ensure its strength and durability. Norm shows how to shape the bench's many curved pieces on the band saw, demonstrates how to create tenons with a tenoning jig mounted on the table saw, and reveals a trick for cutting angled mortises on the drill press.","production_code":"212","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-03-31","episode_number":13,"episode_type":"finale","id":1319797,"name":"Armoire (Entertainment Center)","overview":"Norm winds up The New Yankee Workshop's second season with an armoire based on classic designs but adapted to contemporary use: it can double as a home entertainment center. Norm's version is constructed largely of veneer plywood and features raised panel doors. In building the project, Norm demonstrates many of the joinery techniques he's employed throughout the season, including dado, dovetail and mortise-and-tenon joints - and shows how to use a shaper to create moldings for the piece.","production_code":"213","runtime":30,"season_number":2,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"Norm builds an ash rocking horse, a cypress Adirondack chair, a mahogany butler's table, a pine kitchen dresser, a pine hearthside settle, a poplar pencil-post bed, a maple and poplar chair table, a pine kitchen worktable, an oak mission-style sofa, a Chippendale mirror, a cherry chest-on-chest, a teak English garden bench, and an armoire  entertainment center.","id":83014,"poster_path":"/z8aaBmBI9rezo5Rsyew3RKj0WWB.jpg","season_number":2,"vote_average":0},"3":{"_id":"5917ab9092514159c1039256","air_date":"1991-01-05","episodes":[{"air_date":"1991-01-05","episode_number":1,"episode_type":"standard","id":1320032,"name":"Shaker Step Stools","overview":"Norm builds a three-step version of the classic Shaker step stool and a more elaborate two-step version of it. He uses hand held power tools and hand tools to build the three-step stool form Pine. He uses a sophisticated dovetail jig to craft the joinery for the two-step stool, which is made of Cherry. The two-step stool is 25 1/4\" high x 16\" wide x 11 5/8\" deep. The three-step stool is 25 1/4\" high x 17 3/4\" wide x 13 1/2\" deep.","production_code":"301","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-01-12","episode_number":2,"episode_type":"standard","id":1320033,"name":"Picnic Table and Saw Horses","overview":"Norm builds a basic sawhorse crafted Spruce and Plywood and a one-piece picnic table. The sawhorse dimensions are 26\" high x 20 1/2\" wide x 36\" long and the picnic table dimensions are 29 3/4\" high x 68\" wide x 71\" long.","production_code":"302","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-01-19","episode_number":3,"episode_type":"standard","id":1320034,"name":"Shaker Two Drawer Blanket Chest","overview":"Norm builds a Shaker style blanket chest using pine. He uses an acrylic latex paint to finish the outside and clear urethane on the inside. He adds two storage drawers to the chest base. The chest measures 36 1/4\" high x 41 1/2\" wide x 19\" deep.","production_code":"303","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-01-26","episode_number":4,"episode_type":"standard","id":1320035,"name":"Shaker Washstand","overview":"Norm uses Pine to build a classic Shaker washstand with dovetail joinery in the flared top section, a drawer, and raised panel doors in the lower section. The washstand measures 37 1/2\" high x 27\" wide x 19 1/2\" deep.","production_code":"304","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-02-02","episode_number":5,"episode_type":"standard","id":1320036,"name":"Shaker Wall Clock","overview":"Based on a clock built by Shaker craftsman, Isaac Young, Norm crafts a wall clock from Walnut and adds a modern-day quartz timepiece to it. The clock dimensions are 33 3/16\" high x 11 1/8\" wide x 4 5/16\" deep.","production_code":"305","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-02-09","episode_number":6,"episode_type":"standard","id":1320037,"name":"Sandbox","overview":"Norm builds a sandbox modeled after one built for his sister and him by their father. He uses Cedar and pressure-treated lumber to construct it and adds an awning made from weather-resistant cloth. The sandbox measures 55\" high x 49 1/2\" wide x 49 1/2\" deep.","production_code":"306","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-02-16","episode_number":7,"episode_type":"standard","id":1320038,"name":"Harvest Table","overview":"Norm builds a harvest table from Cherry. It has turned legs and a hand-rubbed Danish oil finish. The drop leaves allow chairs to be pushed under the table when they are in the down position. The table dimensions are 30\" high x 39\" wide x 71 3/4\" long.","production_code":"307","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-02-23","episode_number":8,"episode_type":"standard","id":1320039,"name":"Shaker Woodbox","overview":"Norm builds a wood box with storage space for kindling in an upper section and firewood in the lower section. The fireplace tools are stored on pegs mounted to the sides. He uses milk paint to seal the Pine box. The box dimensions are 33 1/4\" high x 22 3/4\" wide x 17 1/2\" deep.","production_code":"308","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-03-02","episode_number":9,"episode_type":"standard","id":1320040,"name":"Library Table","overview":"Norm crafts a Cherry library table. He demonstrates how to match the grain on the front of the two overlaid drawers. The table measures 30\" high x 16\" wide x 48\" long.","production_code":"309","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-03-09","episode_number":10,"episode_type":"standard","id":1320041,"name":"Garden Swing","overview":"Norm builds a two-seat swing using Redwood and a swinging mechanism that uses common off-the-shelf hardware. The swing dimensions are 92 1/2\" high x 83 1/2\" wide x 85\" deep.","production_code":"310","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-03-16","episode_number":11,"episode_type":"standard","id":1320042,"name":"Cricket Table","overview":"Norm's hardwood cricket table is crafted with complex angled mortise and tenon joinery. He uses a set of jigs to ensure that the pieces fit together properly. The table is 27\" high with a 29\" diameter top.","production_code":"311","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-03-23","episode_number":12,"episode_type":"standard","id":1320043,"name":"Pie Safe with Punched Tin Front","overview":"Norm's two-door pie safe has multiple shelves and is put together using mortise and tenon joints. He uses a punched-tin front that he fabricates in the workshop. The pie safe measures 60\" high x 38 3/4\" wide x 17 3/8\" deep.","production_code":"312","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-03-30","episode_number":13,"episode_type":"finale","id":1320044,"name":"Standing Mirror","overview":"Norm uses a band saw to aid his in constructing a Mahogany frame for a full-length standing mirror. He uses a router to give the piece a softer edge. The frame measures 68 1/4\" high x 27 1/4\" wide x 20\" deep.","production_code":"313","runtime":30,"season_number":3,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"Norm builds a number of Shaker-inspired projects: step stools out of pine and cherry, a painted two-drawer blanket chest, a pine washstand, a walnut wall clock, a pine woodbox, and a cherry library table.  He also builds a picnic table and sawhorses out of 2x6 stock, a sandbox, a cherry harvest table, a redwood garden swing, a cricket table, a pie safe, and a mahogany standing mirror.","id":88342,"poster_path":"/mHkpXrwiyi5E1b5kXYzwKPaC0eO.jpg","season_number":3,"vote_average":0},"4":{"_id":"5917abad925141580d03a4ad","air_date":"1992-01-04","episodes":[{"air_date":"1992-01-04","episode_number":1,"episode_type":"standard","id":1322226,"name":"Rolling Shop Cabinet","overview":"Norm builds a rolling shop cabinet using several construction techniques and materials he hasn't used previously. He chooses veneer plywood with a high-pressure laminate top and lockable swivel casters. It measures 34 1/2\" high x 32\" wide x 26 1/2\" deep","production_code":"401","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-01-11","episode_number":2,"episode_type":"standard","id":1322227,"name":"Outdoor Lidded Bench","overview":"Norm fashions an outdoor lidded bench from Cypress. The bench measurements are 55 1/4\" high x 36\" wide x 18 1/4\" deep.","production_code":"402","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-01-18","episode_number":3,"episode_type":"standard","id":1322228,"name":"Child's Wagon","overview":"Norm builds a child's wagon with threaded rod axles with aluminum braces. He uses non toxic fire-engine red enamel paint for the finish and steel wheels with rubber tires. The wagon measures 19\" high x 16\" wide x 42\" long.","production_code":"403","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-01-25","episode_number":4,"episode_type":"standard","id":1322229,"name":"Coffee Table","overview":"Norm uses recycled pallet wood to build a unique and rustic coffee table. He demonstrates how to prepare the slats by planing them. The table dimensions are 16 1/4\" high x 19\" wide x 40\" long.","production_code":"404","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-02-01","episode_number":5,"episode_type":"standard","id":1322263,"name":"Gardener's Workbench","overview":"Norm's gardener's workbench is constructed of Redwood. It has open shelves for pot storage and the potting surface is an overlay top that is moisture resistant. It also features storage for stakes, markers, and gardening tools. The bench dimensions are 72\" high x 37 1/4\" wide x 34\" deep.","production_code":"406","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-02-08","episode_number":6,"episode_type":"standard","id":1322264,"name":"Shaker Tall Chest","overview":"Norm designs a tall Shaker style chest modeled after one he viewed at Hancock Shaker Village. The chest measures 78 3/4\" high x 45 1/4\" wide x 18 5/8\" deep.","production_code":"406","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-02-15","episode_number":7,"episode_type":"standard","id":1322265,"name":"Colonial Fences","overview":"Norm demonstrates how to build four versions of a fence. He uses Eastern White Cedar to build a 6' garden, a 4' 4\" flame, a 3' 6\" diamond, and a 3' 2\" mortised fence.","production_code":"407","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-02-22","episode_number":8,"episode_type":"standard","id":1322266,"name":"Console Table","overview":"Norm builds a simple, yet elegant, console table with a half-round top using knotty Pine. He crafts curved legs using a band saw. The table measures 29 1/2\" high x 44 3/8\" wide x 22 1/2\" deep.","production_code":"408","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-02-29","episode_number":9,"episode_type":"standard","id":1322267,"name":"Wheelbarrow","overview":"Norm uses Oak to build a wheelbarrow. It features a pneumatic tire, removable sides and a medium density plywood bed. The wheelbarrow measures 25\" high x 25\" wide x 60\" long.","production_code":"409","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-03-07","episode_number":10,"episode_type":"standard","id":1322268,"name":"Umbrella Stand","overview":"Norm's umbrella stand is built from light Oak and features a mirror and clay pot holders to catch the water from umbrellas. He achieves the \"burnt\" effect by fuming the piece in an airtight chamber he fashioned for this purpose. The stand measures 80 1/2\" high x 35\" wide x 11 1/8\" deep.","production_code":"410","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-03-14","episode_number":11,"episode_type":"standard","id":1322269,"name":"Turned Post Bed","overview":"Norm uses Maple and Pine to build a four-poster single bed. It features robust turnings on the posts and the headboard is decorated with scrolled and serpentine cut-outs. The bed measures 54\" high x 46\" wide x 81\" long.","production_code":"411","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-03-21","episode_number":12,"episode_type":"standard","id":1322270,"name":"Dove Cote","overview":"Norm builds a dovecote modeled after an elaborate one found in Colonial Williamsburg. Smaller than the original, it measures 60\" high x 54\" wide x 42\" deep.","production_code":"412","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-03-28","episode_number":13,"episode_type":"finale","id":1322271,"name":"Ladder-back Chair","overview":"Norm builds a ladder-back chair using Cherry and demonstrates how to weave the seat. The chair measures 42\" high x 19\" wide x 14\" deep.","production_code":"413","runtime":30,"season_number":4,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"Norm builds a cypress outdoor lidded bench, a child's wagon, a pallet-wood coffee table, a redwood gardener's work bench, a Shaker tall chest, white cedar colonial fences, a pine console table, an oak wheelbarrow, an oak umbrella stand, a maple and pine turned-post bed, a dove cote, and a cherry ladderback chair.\n\nFor \"shop tools and techniques\", he builds a rolling shop cabinet.","id":88343,"poster_path":"/aQ92fpzk6nsS9u0q4rv95GNAgCK.jpg","season_number":4,"vote_average":0},"5":{"_id":"5917abb8925141061e0332dc","air_date":"1993-01-02","episodes":[{"air_date":"1993-01-02","episode_number":1,"episode_type":"standard","id":2876128,"name":"Victorian Kitchen Table","overview":"Norm builds his version of a perennial favorite, the Victorian kitchen table, using a design that combines the best features of three tables he studied in Britain.  Made of century-old \"sinker\" pine salvaged from river bottoms in the southeastern United States, the table has a deep storage drawer that extends halfway under the table.  Norm demonstrates how to incorporate this drawer into the table's design and how to turn the table's sturdy legs on a lathe.","production_code":"501","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-01-09","episode_number":2,"episode_type":"standard","id":2876136,"name":"Plant Stand","overview":"This tall English country plant stand is perfect for a temperamental fern. The trick to this relatively-simple project is tapering its long thin legs. Norm demonstrates how to make a jig to do just that. This straight-grained sugar pine stand protects ferns, ivies or other delicate plants that resent touching.","production_code":"502","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-01-16","episode_number":3,"episode_type":"standard","id":2876137,"name":"Delft Rack","overview":"Norm visits a private collection in an English castle and discovers a Delft rack from 1780. The Delft rack - an oak rack that is the ideal way to display china and figurines-has a cornice molding built up from up five different-shaped pieces of wood that fool the eye and \"read\" as one. Norm demonstrates how to mill the fluted casings, and how to use patterns to create decorative cutouts and fretwork that embellish this piece.","production_code":"503","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-01-23","episode_number":4,"episode_type":"standard","id":2876138,"name":"Oak Coffee Table","overview":"Americans are mad for coffee tables! Norm's version of this feature of modern life is inspired by the English country look (there's no such thing as an English country coffee table) and by the rugged appeal of an antique workbench. Norm instructs viewers how to use a v-groove to give the table's top a thick plank-like look.","production_code":"504","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-01-30","episode_number":5,"episode_type":"standard","id":2876139,"name":"Outdoor Planters","overview":"Norm creates two outdoor planters: one that's square with raised panels and a second that's simpler, larger and rectangular, with vertical slats. The master woodworker demonstrates how to craft the small planter's raised panels on a table saw and turn its finials on a lathe. (Both planters are \"sinker\" cypress, an excellent outdoor wood that weathers to an attentive silver-gray.)","production_code":"505","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-02-06","episode_number":6,"episode_type":"standard","id":2876140,"name":"Pantry Table","overview":"This simple, versatile English country pantry table needn't be confined to the pantry: it can serve as a bedside table, writing desk and more. Norm uses a table saw to craft this piece and explains how to taper its legs and form the delicate bead detail around the drawer front. Norm adds a breadboard edge to this classic's top - for extra stability.","production_code":"506","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-02-13","episode_number":7,"episode_type":"standard","id":2876141,"name":"Sideboard","overview":"We call these buffets, huntboards or servers in America, but they're sideboards in England, and some are up to nine feet long. Norm's smaller white oak version has three drawers, fiddle-shaped legs and a pot board (a large open shelf between the legs for storage). Norm guides viewers in cutting the curves of the piece on a scroll saw.","production_code":"507","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-02-20","episode_number":8,"episode_type":"standard","id":2876148,"name":"Hanging Corner Cupboard","overview":"After searching London's renowned King's Road, Norm uncovers this unusual piece. He then teaches viewers how to make a curved door from flat boards using a table saw and biscuit joinery for this bow-front hanging corner cupboard. The four-shelf piece, inspired by an 18th-century original, is built from hard sinker pine but has a plywood carcass to bolster stability.","production_code":"508","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-02-27","episode_number":9,"episode_type":"standard","id":2876150,"name":"Pine Cupboard","overview":"Norm teaches viewers how to make flat panel doors as well as glass panel doors for the display area of this English country cupboard. Made of soft #2 pine with knots to impart added character, the practical piece has tongue-and-groove backing.","production_code":"509","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-03-06","episode_number":10,"episode_type":"standard","id":2876151,"name":"Butcher Block","overview":"Norm's version of the indispensable kitchen staple, the butcher block, features a hard endgrain maple top instead of the usual parallel grain. The base of this English country piece is sturdy poplar. Norm demonstrates how to cut the endgrain carefully, thus avoiding excess sanding of this tough wood.","production_code":"510","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-03-13","episode_number":11,"episode_type":"standard","id":2876152,"name":"Redwood Arbor","overview":"Although Norm researched arbors in old England, the one that he builds is inspired by versions from the New England island of Nantucket. Norm's arbor, meant for sitting and enjoying the beauty of the garden, is built from redwood and presents the challenge of fashioning an arch out of segments of wood fixed together with a new water-resistant glue. Norm also tackles making diamond-shaped lattice panels for this project.","production_code":"511","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-03-20","episode_number":12,"episode_type":"standard","id":2876154,"name":"Secretary Desk","overview":"Norm builds a secretary writing desk out of pine. Viewers can learn how to craft breadboard corners for this English country favorite, the most elegant and elaborate project of the season, with its four drawers, pigeonholes and stepped interior.","production_code":"512","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-03-27","episode_number":13,"episode_type":"finale","id":2876157,"name":"Tall Pine Clock","overview":"Norm suspects that the original of this English country clock found on London's King's Road, with its tapered profile, may have been built by the village coffin maker. Norm builds up its mouldings from a combination of off-the-shelf mouldings and others made at the workshop, and selects an inexpensive quartz movement.","production_code":"513","runtime":30,"season_number":5,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"Norm builds a Victorian kitchen table out of pine, a plant stand out of pine, an oak Delft rack, an oak coffee table, cypress outdoor planters, a pantry table, a white oak sideboard, a pine hanging corner cupboard, a pine cupboard, a poplar and maple butcher block, a redwood arbor, a pine secretary desk, and a tall pine clock.","id":88344,"poster_path":"/sTNReLkTD7ZdNPHhIBa4W0zSbey.jpg","season_number":5,"vote_average":0},"6":{"_id":"5917abbdc3a368426903d5f7","air_date":"1994-01-01","episodes":[{"air_date":"1994-01-01","episode_number":1,"episode_type":"standard","id":2876477,"name":"Easel","overview":"Norm has thought of everything for this classic easel, combining his favorite elements from several commercial versions with a sturdy, timeless design that's all his own. The piece features a chalkboard on one side and paper-holding frame on the other, plus a drawer to keep the supplies together with the easel. Norm uses biscuit joinery - no screws, no nails - to join the parts of the leg assembly. The unique paper roll design allows children a continuous supply of new drawing surface.","production_code":"601","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-01-08","episode_number":2,"episode_type":"standard","id":2876479,"name":"Doll House","overview":"Adult viewers may be as excited about this doll house as the children it is intended for when Norm creates a true-to-scale replica of his now-famous workshop. Norm gets some ideas from a late-Victorian example located in the Barrett House in New Hampshire, but his final design is less gender-specific, with the familiar great room that is the home of The New Yankee Workshop as well as two stories of smaller rooms and a garage - all features never before seen on camera. With some custom accessorizing, this doll house can easily be rendered appropriate for boys or girls or both. The project involves extensive work with the table saw and router.","production_code":"602","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-01-15","episode_number":3,"episode_type":"standard","id":2876480,"name":"Toy Chest","overview":"Combining functionality with simple fun, Norm's toy chest features a top with an inlaid checkerboard made of maple and mahogany, and even a compartment in which to store the checkers. Incorporating through dovetails cut on the dovetailing jig, the chest is as handsome as it is sturdy. Norm also demonstrates valuable marquetry techniques for the checkerboard. As always, safety is a primary concern, and Norm's toy chest includes an ingenious closing device that insures that the lid will never slam on a child's fingers.","production_code":"603","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-01-22","episode_number":4,"episode_type":"standard","id":2876481,"name":"Cradle","overview":"Norm visits Old Sturbridge Village in Sturbridge, Massachusetts for the inspiration behind this Early American hooded cradle, one of the most commonly requested projects on The New Yankee Workshop. The construction includes finger joints and a sliding dovetail for the rocker. Norm's choice of durable cherry is rendered particularly rich with a Danish oil finish. With its distinctive hood and graceful lines, this piece is destined to become an heirloom.","production_code":"604","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-01-29","episode_number":5,"episode_type":"standard","id":2876482,"name":"Trundle Bed","overview":"A useful space-saving piece of furniture, the trundle bed is perfect for sleep-overs. The top bed is low enough for kids to climb onto easily, while the trundle rolls out smoothly on casters. Constructing the bed presents an opportunity for Norm to demonstrate a variety of mortise and tenon joinery techniques. Once built, he paints the curved-headboard frame, made of poplar and plywood, with a non-toxic latex enamel, sealing the maple features with a satin polyurethane for a natural wood accent.","production_code":"605","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-02-05","episode_number":6,"episode_type":"standard","id":2876483,"name":"Marble Roll","overview":"Norm considers a historic example of the classic marble roll, as well as a huge mechanical version located at Boston's Museum of Science. His own design emphasizes safety, proportioned for marbles too large for a child to swallow, while the entire unit is small enough to be portable. It is a relatively simple project, made primary on the table saw, that can often be constructed from workshop scraps.","production_code":"606","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-02-12","episode_number":7,"episode_type":"standard","id":2876484,"name":"Storage Units: Bureau/Cupboard and Bookcase","overview":"The storage units are essentially three projects in one: a chest of drawers, base cabinet and matching bookcase. All three pieces are constructed from 3/4\" oak plywood, making them particularly sturdy yet portable. The plywood is edged with solid oak, which lends the handsome finish that all of Norm's projects share. These pieces that will last for years, potentially traveling with their owners to dorm room or apartment.","production_code":"607","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-02-19","episode_number":8,"episode_type":"standard","id":2876487,"name":"Student's Desk","overview":"Norm builds this project for the \"A\" student in the house - a desk inspired by the memory of his own version from high school. The durable laminate panels provide a smooth desktop surface for writing that will still look great after years of use. Norm demonstrates how to apply high-pressure laminates and uses mortise and tenon joinery for the stylish oak frames. The oak is sealed with polyurethane for durability.","production_code":"608","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-02-26","episode_number":9,"episode_type":"standard","id":2876488,"name":"Rocking Chair","overview":"Children always want a chair that is their own size. Norm's is one they might someday pass on to their own children. The beauty is in the details with this challenging project, as the master woodworker turns the legs on a lathe and forms the curved backrest by laminating three pieces of cherry together. The holes for the arms, legs and stretchers are bored on the drill press using a series of homemade jigs with tapered angles and wedges. This rocking chair is perfectly proportioned and likely to become the favorite in any child's room.","production_code":"609","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-03-05","episode_number":10,"episode_type":"standard","id":2876491,"name":"Alphabet Wagon","overview":"Norm builds an \"Alphabet\" wagon.","production_code":"610","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-03-12","episode_number":11,"episode_type":"standard","id":2876495,"name":"High Chair","overview":"Norm builds a high chair.","production_code":"611","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-03-19","episode_number":12,"episode_type":"standard","id":2876501,"name":"Playhouse (1)","overview":"Norm's blockbuster project for the sixth season is a playhouse that boys and girls alike will love. He begins work by building the floor platform and prefabricating the walls, then assembling the frame in the backyard. Perfect for tea parties and secret meetings, this playhouse is also a handsome addition to any yard. Norm continues work on his playhouse, concentrating on the wood shingle roof and the many details that he refers to as \"goodies,\" from the window box to the Dutch door. This is the project that Norm's younger viewers are likely to be clamoring for loudest of all.  This is part 1 of 2.","production_code":"612","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-03-26","episode_number":13,"episode_type":"finale","id":2876502,"name":"Playhouse (2)","overview":"Norm's blockbuster project for the sixth season is a playhouse that boys and girls alike will love. He begins work by building the floor platform and prefabricating the walls, then assembling the frame in the backyard. Perfect for tea parties and secret meetings, this playhouse is also a handsome addition to any yard. Norm continues work on his playhouse, concentrating on the wood shingle roof and the many details that he refers to as \"goodies,\" from the window box to the Dutch door. This is the project that Norm's younger viewers are likely to be clamoring for loudest of all.  This is part 2 of 2.","production_code":"613","runtime":30,"season_number":6,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"Norm builds a number of child-related projects, including an easel, a doll house, a maple and mahogany toy chest, a cradle out of cherry, a trundle bed, a marble roll, a rocking chair, an alphabet wagon, a high chair, and a playhouse.  He also builds storage units and a student's desk out of oak.","id":88345,"poster_path":"/85uX1MBHlpLwmMefGWIRns6ekGp.jpg","season_number":6,"vote_average":0},"7":{"_id":"5917abc392514105da031939","air_date":"1995-01-07","episodes":[{"air_date":"1995-01-07","episode_number":1,"episode_type":"standard","id":2876505,"name":"X-Brace Trestle Table","overview":"Norm visits Old Sturbridge Village, a \"living history\" museum in Sturbridge, Massachusetts, to investigate colonial life and furnishings and returns to the workshop with a period design for an X-brace trestle table. The handsome sturdiness of this versatile cherry piece makes it a welcome addition to any room, whatever the decor.","production_code":"701","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-14","episode_number":2,"episode_type":"standard","id":2876506,"name":"Pergola","overview":"What better way to enjoy a hot summer day than from the shade of a graceful arbor? A perfect complement to any garden or deck, Norm's elegant pergola will look great draped in wisteria and is constructed of durable pressure-treated southern yellow pine.","production_code":"702","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-21","episode_number":3,"episode_type":"standard","id":2876507,"name":"TV Tray Table","overview":"True to its name, this handsome mahogany piece is actually a tray and table in one: the tray features simple, sturdy handles that allow it to he used independently of its stand. Inspired by the TV tray tables of the 1950s and '60's, Norm's design seamlessly joins form with function.","production_code":"703","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-28","episode_number":4,"episode_type":"standard","id":2876508,"name":"Outdoor Garden Table","overview":"It's been next to impossible to find an outdoor side or coffee table - until now. Norm builds a low round, slat-topped model out of durable teak that fits the bill perfectly.","production_code":"704","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-02-04","episode_number":5,"episode_type":"standard","id":2876509,"name":"Cherry Bathroom Vanity","overview":"Norm builds a cherry bathroom vanity based on one he designed for his own home, guiding the woodworker through the details of constructing the vanity's raised panel doors using only a router. Norm also explains the techniques involved in forming the piece's solid-surface top.","production_code":"705","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-02-11","episode_number":6,"episode_type":"standard","id":2876510,"name":"Lutyens Bench","overview":"Norm finds his inspiration for this piece in the garden furniture designed by renowned English architect Sir Edwin Lutyens. Constructed entirely of teak, this faithful reproduction is built to last and age gracefully.","production_code":"706","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-02-18","episode_number":7,"episode_type":"standard","id":2876511,"name":"Picture Frames","overview":"Norm visits Old Schwamb Mill, the oldest operating custom frame factory in the country. Back at the workshop, he uses both stock moulding and several original designs to demonstrate the techniques used in making picture and mirror frames. Norm also offers step-by-step instructions on how to create mattes for the artwork.","production_code":"707","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-02-25","episode_number":8,"episode_type":"standard","id":2876512,"name":"Clancy Boat (1)","overview":"A visit to the Center for Wooden Boats in Seattle, Washington launches this challenging and exciting project which is modeled after a \"class boat\" known as the \"Clancy.\" Back at the workshop, Norm builds the lightweight boat from scratch using 3' x 10' lengths of marine veneer mahogany plywood and an epoxy and fiberglass system to make the craft watertight. With the final coat of epoxy sanded and the last strokes of paint and waterproof finish applied, host Norm puts the SS New Yankee 1 and 2 to the test! Norm and This Old House host, Steve Thomas, take the workshop-built Clancy boats for a sail.  This is part 1 of 2.","production_code":"708","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-03-04","episode_number":9,"episode_type":"standard","id":2876513,"name":"Clancy Boat (2)","overview":"A visit to the Center for Wooden Boats in Seattle, Washington launches this challenging and exciting project which is modeled after a \"class boat\" known as the \"Clancy.\" Back at the workshop, Norm builds the lightweight boat from scratch using 3' x 10' lengths of marine veneer mahogany plywood and an epoxy and fiberglass system to make the craft watertight. With the final coat of epoxy sanded and the last strokes of paint and waterproof finish applied, host Norm puts the SS New Yankee 1 and 2 to the test! Norm and This Old House host, Steve Thomas, take the workshop-built Clancy boats for a sail.  This is part 2 of 2.","production_code":"709","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-03-11","episode_number":10,"episode_type":"standard","id":2876514,"name":"Gazebo (1)","overview":"Norm begins work on one of the most ambitious projects ever attempted at The New Yankee Workshop. Brilliantly conceived and executed, Norm's intimate octagonal, screened gazebo reflects several popular Victorian styles and features a cedar deck, clever, collar-tied rafters, and a unusual tapered, cedar-shingled roof, the project's most challenging element. Norm offers useful tips on how to build screens as he creates the screen door and panels for his gazebo. The final decorative touches are applied as the Victorian latticework is assembled and mounted and the copper finial takes its place atop this storybook garden pavilion. This is part 1 of 2.","production_code":"710","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-03-18","episode_number":11,"episode_type":"standard","id":2876515,"name":"Gazebo (2)","overview":"Norm begins work on one of the most ambitious projects ever attempted at The New Yankee Workshop. Brilliantly conceived and executed, Norm's intimate octagonal, screened gazebo reflects several popular Victorian styles and features a cedar deck, clever, collar-tied rafters, and a unusual tapered, cedar-shingled roof, the project's most challenging element. Norm offers useful tips on how to build screens as he creates the screen door and panels for his gazebo. The final decorative touches are applied as the Victorian latticework is assembled and mounted and the copper finial takes its place atop this storybook garden pavilion. This is part 2 of 2.","production_code":"711","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-03-25","episode_number":12,"episode_type":"standard","id":2876516,"name":"Quilt Racks","overview":"Norm returns to Old Sturbridge Village in Sturbridge, Massachusetts to research the colonial custom of using blanket frames or racks. What results are stylish displays for prized quilts as Norm reinterprets these pieces in both Victorian and Shaker styles. While the mahogany Victorian rack features a curved top and turned legs, its simple pine counterpart boasts flat braces and a trestle foot.","production_code":"712","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-04-01","episode_number":13,"episode_type":"finale","id":2876517,"name":"Chimney Cupboard","overview":"Salvaged wide pine boards, some more than 200 years old, are the material of choice for Norm's version of this free-standing Shaker-inspired cabinet. More than seven feet tall and featuring a flat-paneled door and five interior shelves, this versatile piece proves an ideal kitchen pantry, linen or sweater chest.","production_code":"713","runtime":30,"season_number":7,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"Norm tackles a number of larger projects including a Clancy boat and a Gazebo.  He also builds a cherry X-brace trestle table, a pine pergola, a mahogany TV tray table, an outdoor garden table and Lutyens bench out of teak, a cherry bathroom vanity, picture frames, a pine quilt rack, and a pine chimney cupboard.","id":88346,"poster_path":"/jShaeVrAlbfJjiRNaPanr2t2pp7.jpg","season_number":7,"vote_average":0},"8":{"_id":"5917ad80c3a36842c103c234","air_date":"1996-01-06","episodes":[{"air_date":"1996-01-06","episode_number":1,"episode_type":"standard","id":2876519,"name":"Bedside Cupboard","overview":"Based on a piece he finds at a California vineyard, Norm builds a bedside cupboard out of pine.","production_code":"801","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-01-13","episode_number":2,"episode_type":"standard","id":2876520,"name":"Chestnut Coffee Table","overview":"Built of recycled chestnut barn timber, this generously sized coffee table is a reproduction pine table displayed at the Grace Family Vineyards in St. Helena. Featuring large turned legs and a natural oil finish, this table is as individual as the limited edition Cabernet Grace the vineyard is famous for.","production_code":"802","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-01-20","episode_number":3,"episode_type":"standard","id":2876521,"name":"Paymaster's Desk","overview":"The owners of this unusual table, Jack and Jamie of Schramsberg Vineyards in Calistoga, California, told Norm that it was originally a Mexican paymaster's table, carried on horseback, and used to pay groups of laborers on site. Built of recycled pine, the desk functions quite well today as an end table - and conversation piece. The desk has splayed legs with a stretcher and a two-sided pull-through drawer once used for holding money.","production_code":"803","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-01-27","episode_number":4,"episode_type":"standard","id":2876522,"name":"Long Table","overview":"Norm finds the quintessential gathering table - it's 10 feet long - in the wine tasting room at the Myacamas Vineyards in Napa Valley. He fully demonstrates his master craftsmanship by reproducing this impressive piece of furniture, destined to become a family heirloom. To add to the integrity and value of this piece, he uses two different types of recycled pine that are peppered with interesting wood knots, buckshot and other natural irregularities.","production_code":"804","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-02-03","episode_number":5,"episode_type":"standard","id":2876523,"name":"Double Dresser","overview":"Norm spies this beautifully proportioned double dresser in a private collection of antique pine furniture in Napa Valley. This six-drawer desk is long but narrow, making it versatile enough for a hallway and other small spaces, as well as for a bedroom. Norm crafts his version of the design out of recycled pine, complete with recessed side panels, banded drawer fronts and wooden knobs.","production_code":"805","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-02-10","episode_number":6,"episode_type":"standard","id":2876524,"name":"Chestnut Desk","overview":"Another piece found in a private collection in wine country, this elegantly simple desk has an expansive surface, a single center pencil drawer and nicely turned legs. The original was made of pine, but for his version, Norm uses a harder chestnut that is better for writing surfaces. As straight forward and unpretentious as the best American antiques - or wines this desk can easily double as a table.","production_code":"806","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-02-17","episode_number":7,"episode_type":"standard","id":2876525,"name":"Irish Hutch","overview":"One of the most impressive pieces Norm discovers during the course of his travels in wine country is a 200-year-old Irish Hutch owned by the Trevorses of Myacamas Vineyards. This pine hutch features two flat paneled doors and two large dovetailed drawers at its base. Atop the base is a plate rack with simple ornamentation and cornice molding. Lovingly detailed, with plenty of room for displaying china or collectibles, this is one of the most ambitious projects Norm makes this season.","production_code":"807","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-02-24","episode_number":8,"episode_type":"standard","id":2876526,"name":"Wine Storage Unit","overview":"In keeping with the wine-country theme, this project is much more than just a wine rack. It is the perfect system for people who take wine collecting seriously. Made of redwood and designed as a four-sided display, this storage unit holds 10 cases of wine while providing additional storage for glasses, corkscrews and oversized bottles, plus a platform for serving. No wine aficionado will want to return from a tasting tour of Napa Valley to anything less.","production_code":"808","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-03-02","episode_number":9,"episode_type":"standard","id":2876527,"name":"Three Turned Table Lamps","overview":"Norm designs three natural wood lamps made from recycled materials to complement his collection of wine country furniture. The largest, 20 inches high, is a massive turning of heart pine that has been laminated. The second, 17 inches high, is turned from two pieces of mahogany. The third, another piece of heart pine, is sixteen inches high.","production_code":"809","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-03-09","episode_number":10,"episode_type":"standard","id":2876528,"name":"Garden Shed and Recycling Center (1)","overview":"Norm builds a handsome and practical storage shed outside The New Yankee Workshop. The 12-by-8-foot shed with an attached recycling and rubbish center has plenty of room for the lawn mower, snow blower and other lawn and garden tools. Four windows let in the light, and a large door welcomes over-sized equipment. The recycling center has enough covered space for sorting and for holding rubbish barrels. The building is finished with Western red cedar clapboards, shingles and galvanized hardware to resist the elements. This is part 1 of 2.","production_code":"810","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-03-16","episode_number":11,"episode_type":"standard","id":2876529,"name":"Garden Shed and Recycling Center (2)","overview":"Norm builds a handsome and practical storage shed outside The New Yankee Workshop. The 12-by-8-foot shed with an attached recycling and rubbish center has plenty of room for the lawn mower, snow blower and other lawn and garden tools. Four windows let in the light, and a large door welcomes over-sized equipment. The recycling center has enough covered space for sorting and for holding rubbish barrels. The building is finished with Western red cedar clapboards, shingles and galvanized hardware to resist the elements. This is part 2 of 2.","production_code":"811","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-03-23","episode_number":12,"episode_type":"standard","id":2876530,"name":"Nest of Drawers","overview":"Here is a practical project that harks back to the first half of the season: the design for this nest of drawers is based on an antique found in a Nantucket shop. A 10-drawer storage unit built of recycled pine, this versatile piece will be equally coveted by the handy person, who will want it for the workshop, and the decorator, who will want to display it on a table or hang it on a wall. The compartments are perfect for storing odds and ends like stamps, hardware or craft supplies.","production_code":"812","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-03-30","episode_number":13,"episode_type":"finale","id":2876531,"name":"Router Table","overview":"Norm builds a router table. An improved version of this project can be found in Season 15, Episode 1.","production_code":"813","runtime":30,"season_number":8,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"Norm takes a trip to California wine country. Inspired from his trip, he builds a chestnut coffee table, a pine paymaster's desk, a pine long table, a pine double dresser, a chestnut desk, an Irish hutch out of pine, and a redwood wine storage unit.  He also builds a bedside cupboard, turned table lamps, and a nest of drawers.  Finally, he builds a garden shed and recycling center.\n\nFor \"shop tools and techniques\", he builds a router table.","id":88347,"poster_path":"/g4sSHivpkoWheKkE9MCt44085M.jpg","season_number":8,"vote_average":0},"9":{"_id":"5917ad8692514156f503ba9d","air_date":"1997-01-04","episodes":[{"air_date":"1997-01-04","episode_number":1,"episode_type":"standard","id":2876619,"name":"Planter's Desk","overview":"Norm begins his search for low-country furniture projects in Savannah's famed Monterey Square at the home of antique map and print dealers, Virginia and John Duncan. On their veranda, Norm discovers a quintessential piece of the Old South, a planter's desk. Once used by cotton and tobacco farmers for bookkeeping, the desk can function quite well today as a compact, home office. Featuring nicely tapered legs, a hinged desktop, and plenty of shelves, it also has enough room to accommodate a small computer. Back East in the New Yankee Workshop, Norm builds this piece out of recycled pine and finishes it with a new pastel stain to give it a \"pickled\" look.","production_code":"901","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-01-11","episode_number":2,"episode_type":"standard","id":2876620,"name":"Turkey Table","overview":"While touring Savannah, Norm found the inspiration for this unique piece in Marty Johnson's antique collection. Though its name remains a mystery, there's no question that its graceful three-leaf-clover design makes it an attractive and practical accent table. Norm brings a little bit of Georgia back to the New Yankee Workshop when he creates the table out of Southern heart pine.","production_code":"902","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-01-18","episode_number":3,"episode_type":"standard","id":2876621,"name":"Nantucket Settle","overview":"On a sojourn to the quaint New England island of Nantucket, Norm found a wonderful lidded settle that can double as extra storage space and a hallway showpiece. Norm crafts a rendition out of beautiful cherry wood and, in the process, demonstrates a variety of intermediate woodworking techniques including spindle-turning and how to make framed panels.","production_code":"903","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-01-25","episode_number":4,"episode_type":"standard","id":2876622,"name":"Tiger Maple Washstand","overview":"This lovely washstand is true to the circa 1830 original found in the antique collection of Stanley and Jacqueline Levine of Savannah, Georgia. Featuring elegant scroll work, turned legs, and a generous shelf drawer, this vintage design can be used today as a night stand. Norm produces this piece out of fine tiger maple, making it one of the most sophisticated pieces in his collection of low-country furniture.","production_code":"904","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-02-01","episode_number":5,"episode_type":"standard","id":2876744,"name":"Dough Box","overview":"In the 1800s, a dough box provided a warm hiding place for bread dough to rise. When Norm crafts his version of this simple design out of antique pine and adds a hinge to the lid, he turns it into a great-looking, modern-day, chest-on-legs.","production_code":"905","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-02-08","episode_number":6,"episode_type":"standard","id":2876745,"name":"Garden Gate","overview":"Norm couldn't resist bringing the romantic design of this garden gateway back from a visit to a historic New England village. This ambitious outdoor project features a spindled gateway and is complemented by a pergola and a trellis that frames the garden view. Norm builds this outdoor project out of common, pressure-treated pine to ensure that it will last through years of sunshine, rain, and snow. In the process, he demonstrates how to join wood segments together with splines to form the elegant archway.","production_code":"906","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-02-15","episode_number":7,"episode_type":"standard","id":2876746,"name":"Serving Trays","overview":"Norm takes viewers in to his favorite antique haunt on the quaint New England island of Nantucket where he discovers two distinctive wooden trays. Deeming them the perfect weekend woodworking projects, Norm crafts the more primitive fruit tray out of recycled pine, and, for the first time on The New Yankee Workshop, introduces the craft of metal-smithing when he fashions the cherry tray's hardware out of brass.","production_code":"907","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-02-22","episode_number":8,"episode_type":"standard","id":2876747,"name":"Carousel Table","overview":"It's a great family gathering table and perfect for playing games with the kids, Norm claimed when he discovered the original in a private collection in Savannah. The ingenious design of this table features a lazy Susan centerpiece which can easily be removed for more formal gatherings. While building this piece out of salvaged pine, Norm shares his secrets for creating the spindle centerpiece with minimal hardware.","production_code":"908","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-03-01","episode_number":9,"episode_type":"standard","id":2876748,"name":"Seven Drawer Chest","overview":"Norm spied this regal nineteenth-century English mahogany, seven-drawer chest in the back room of Alex Raskin's renowned antique shop on Monterey Square in Savannah. This well-proportioned, chest-on-chest features period brass hardware pulls, edge banding, and dovetail drawers.","production_code":"909","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-03-08","episode_number":10,"episode_type":"standard","id":2876750,"name":"Hat Rack","overview":"Norm introduces viewers to the seventeenth-century craft of wood steaming when he creates this charming hat rack out of oak. To learn the proper techniques, Norm pays a visit to craftsman Mike Dunbar, a well-known Windsor chair builder and teacher.","production_code":"910","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-03-15","episode_number":11,"episode_type":"standard","id":2876751,"name":"Greenhouse (1)","overview":"He may be America's favorite master carpenter, but Norm readily admits that he's a \"brown thumb,\" when it comes to gardening. This greenhouse is the perfect project for the serious backyard gardener (or someone who knows one) who is \"workshop bound\" for the winter. Norm fabricates this design out of redwood and polycarbonate panels. Built to withstand even the toughest weather conditions, this greenhouse provides enough insulation and light to sustain plants during the long winter months. This is part 1 of 2.","production_code":"911","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-03-22","episode_number":12,"episode_type":"standard","id":2876752,"name":"Greenhouse (2)","overview":"He may be America's favorite master carpenter, but Norm readily admits that he's a \"brown thumb,\" when it comes to gardening. This greenhouse is the perfect project for the serious backyard gardener (or someone who knows one) who is \"workshop bound\" for the winter. Norm fabricates this design out of redwood and polycarbonate panels. Built to withstand even the toughest weather conditions, this greenhouse provides enough insulation and light to sustain plants during the long winter months. This is part 2 of 2.","production_code":"912","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-03-29","episode_number":13,"episode_type":"finale","id":2876753,"name":"Fireplace Mantle","overview":"Between shooting The New Yankee Workshop and This Old House, Norm rarely has time to build anything for himself. And, like the rest of us, he readily admits his own home is \"a work in progress.\" So, Norm is taking this woodworking project home. With his own Rumford fireplace awaiting adornment, Norm takes the opportunity to design this classic Colonial fireplace mantel and builds it using a variety of woods and moldings readily available at home centers nationwide.","production_code":"913","runtime":30,"season_number":9,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"Norm visits Savannah, Georgia. Inspired from the trip, he builds a pine planter's desk, a pine turkey table, a tiger maple washstand, a pine carousel table, and a mahogany 7-drawer chest.  He also builds a Nantucket settle out of cherry, a pine dough box,  a pine garden gate, cherry serving trays, a bent-wood hat rack, and a fireplace mantel.  Finally, he tackles a major project - building a greenhouse.","id":88348,"poster_path":"/aukQs3H9tnTM1GD3JKyDh62L1Zj.jpg","season_number":9,"vote_average":0},"10":{"_id":"5917ad8cc3a368371b02c063","air_date":"1998-01-03","episodes":[{"air_date":"1998-01-03","episode_number":1,"episode_type":"standard","id":2876754,"name":"Irish Table","overview":"Viewers find Norm celebrating the tenth anniversary season of The New Yankee Workshop on the quaint New England island of Nantucket in an antique shop that specializes in Irish country furniture. There, he spies what he calls \"the perfect occasional table,\" an antique Celtic pine table with a thirty-six-inch round atop four graceful, tapered legs. Back in The New Yankee Workshop, Norm fashions his own version using recycled pine, and in the process demonstrates mortise-and-tenon joinery techniques and shows how to make a tapering jig.","production_code":"9801","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-01-10","episode_number":2,"episode_type":"standard","id":2876755,"name":"Linen Press","overview":"Norm asks, \"Have you ever noticed that most armoires and linen presses are too big to fit in today's rooms and look just right?\" However, in a private collection in Savannah, Georgia, he finds a beautiful antique linen press whose three-foot by six-foot size make it versatile enough to fit in almost any room. Featuring streamlined, raised-panel double doors with detail beading, its simple design seems almost modern. Back in The New Yankee Workshop, Norm recreates this piece out of recycled pine to give it a vintage look.","production_code":"9802","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-01-17","episode_number":3,"episode_type":"standard","id":2876756,"name":"Walnut Table","overview":"Norm travels to Savannah, Georgia, to meet Greg Guenther, a respected local craftsman known for his skills at making period furniture and for his restoration work of Historic Savannah mansions. In Guenther's private collection of period pieces, Norm spies a stunning nineteenth-century, black walnut, drop-leaf dining table with graceful turned legs. Before heading back to The New Yankee Workshop to recreate this heirloom piece, Norm joins Guenther in his workshop for a lesson on how to master a high-gloss finishing technique that enhances the natural beauty of wood.","production_code":"9803","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-01-24","episode_number":4,"episode_type":"standard","id":2876757,"name":"Library Ladder","overview":"Though a gardener friend uses his handsome antique library ladder to display a collection of vintage watering cans, Norm vows that it can also be used for more utilitarian purposes. He builds this intermediate woodworking project out of recycled, long leaf Southern yellow pine and in the process, demonstrates how to craft its defining feature - splayed legs joined by a hinged crossbar.","production_code":"9804","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-01-31","episode_number":5,"episode_type":"standard","id":2876759,"name":"Old Pine Bar","overview":"Norm builds his version of an antique Irish bar out of recycled pine and gives it a high gloss finish so indestructible that he dares any woodworker who builds it to \"leave a frosty mug on it.\"","production_code":"9805","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-02-07","episode_number":6,"episode_type":"standard","id":2876760,"name":"Morris Chair","overview":"In Arizona, Norm goes on a search for Arts and Crafts-style furniture in Tucson's Historic Arts District. Responding to the many viewer requests he receives each season to build more of the ever-popular Arts and Crafts-style projects, Norm ventures into the F.L. Wright Furniture Gallery where he finds a virtuoso example of the era-a classic, reclining Morris chair. Norm recreates this vintage design out of quarter-sawn white oak and in the process, shares his secrets for mastering the techniques required to build the chair's reclining back.","production_code":"9806","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-02-14","episode_number":7,"episode_type":"standard","id":2876761,"name":"Cupola","overview":"In a surprise twist, Norm opens this New Yankee Workshop from This Old House's recent job site in Milton, Massachusetts. While building a new \"dream workshop\" on the footprint of the old barn's demolished shell, Norm decides to replicate a version of the antique cupola that once adorned its roof back in The New Yankee Workshop. With help from coppersmith Larry Stearn, Norm recreates a copper-roofed version of the original design. Calling it a \"true carpentry project which entails every mitre box application,\" Norm expertly crafts the cupola's louvers and hip roof.","production_code":"9807","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-02-21","episode_number":8,"episode_type":"standard","id":2876762,"name":"Mesquite Bookcase","overview":"Norm's expedition to Arizona in search of Arts and Crafts-style furniture projects to build in The New Yankee Workshop leads him to Arroyo Design, a small custom furniture company in Tucson, where he spies a beautiful, glass-front bookcase inspired by the famous Greene Brothers. Featuring divided pane windows and the Greene Brothers' trademark square-peg detailing, its true artisan qualities make it one of the most sophisticated pieces in this season's collection. To ensure its heirloom value, Norm crafts this project out of mesquite and in the process educates viewers on how to work with this native Sonoran desert hardwood.","production_code":"9808","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-02-28","episode_number":9,"episode_type":"standard","id":2876764,"name":"Chop Saw Station","overview":"For any woodworker who aspires to have a home version of The New Yankee Workshop, Norm builds a portable chop saw station, an accessory that he promises will \"make your power mitre box much more versatile.\" This station can be used in the workshop or can be carted out to a job site to trim a house or to the backyard to build a deck.","production_code":"9809","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-03-07","episode_number":10,"episode_type":"standard","id":2876768,"name":"Whirligig","overview":"On a recent sojourn to Nantucket, Norm is invited to view a local antique dealer's private collection of children's toys and whimsical whirligigs. Inspired by their endearing humor, Norm decides to build his own mechanized version of The New Yankee Workshop's logo, featuring Norm, himself, working at the table saw.","production_code":"9810","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-03-14","episode_number":11,"episode_type":"standard","id":2876769,"name":"Chaise Lounge","overview":"Norm takes viewers on an adventure to Utah to witness the dismantling of a twelve-mile long railway trestle which was built at the turn of the century. Eventually progress and better engineering in the 1950s replaced this causeway, and the massive trestlewood pilings which once provided the means by which Southern Pacific was able to cross the Great Salt Lake were all but abandoned. Over years of disuse, the trestlewood, which is comprised of Douglas fir and redwood, eventually became so pickled by lake brine that its grain began to develop an unusual array of colors. Norm acquires some of this trestle wood to build his own outdoor chaise lounge design and in the process, learns quite a bit about current initiatives to harvest this unusual building material.","production_code":"9811","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-03-21","episode_number":12,"episode_type":"standard","id":2876770,"name":"Roll Top Desk (1)","overview":"Norm visits the Old Schwamb Mill in Arlington, Massachusetts. Built in 1860, the mill was purchased in 1864 by German immigrant woodworkers, Charles and Frederick Schwamb. The brothers did a brisk business crafting the oval picture frames which, at the time, were in demand to display photographs of Civil War soldiers. In the Schwamb Brother's old office, Norm spies a handsome, quarter-sawn oak roll top desk, which inspires him to build his version of this American classic. This is part 1 of 2.","production_code":"9812","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-03-28","episode_number":13,"episode_type":"finale","id":2876771,"name":"Roll Top Desk (2)","overview":"Norm visits the Old Schwamb Mill in Arlington, Massachusetts. Built in 1860, the mill was purchased in 1864 by German immigrant woodworkers, Charles and Frederick Schwamb. The brothers did a brisk business crafting the oval picture frames which, at the time, were in demand to display photographs of Civil War soldiers. In the Schwamb Brother's old office, Norm spies a handsome, quarter-sawn oak roll top desk, which inspires him to build his version of this American classic. This is part 2 of 2.","production_code":"9813","runtime":30,"season_number":10,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"More from Norm's trip to Savannah, Georgia; he builds a pine linen press and a walnut table.  Norm also visits Arizona, where he gets ideas to build a white oak Morris chair and a mesquite bookcase.  Norm also visits Utah where he gets wood from an old railroad trestle and builds a chaise lounge.  He also builds a pine Irish table, a pine library ladder, a pine Irish bar, a barn cupola, a whirligig, and a roll-top desk.\n\nFor \"shop tools and techniques\", he builds a chop saw station.","id":88349,"poster_path":"/3BJeAsSV7W7lYba8yoRsiYZYX9N.jpg","season_number":10,"vote_average":0},"11":{"_id":"5917ad91925141061e03347c","air_date":"1999-01-02","episodes":[{"air_date":"1999-01-02","episode_number":1,"episode_type":"standard","id":2876772,"name":"Kitchen Island","overview":"It's a little known secret that when Norm is not in The New Yankee Workshop or on a This Old House job site, he can be found in his own kitchen cooking for friends and family. Viewers who share his interest in the culinary arts were the top of his mind when Norm created this Kitchen Island.","production_code":"9901","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-01-09","episode_number":2,"episode_type":"standard","id":2876773,"name":"Kitchen Pantry","overview":"Meant to meet the demand for more storage space, Norm's custom designed kitchen pantry promises to be valued even more as a decorative showpiece and as an example of his superb craftsmanship. Built out of antique chestnut with punched copper double doors, its geometric detailing and traditional beauty are illuminated by interior accent lighting. Inside, six melamine storage shelves can store a shop full of pantry items. Watch and learn how to work with recycled wood, fabricate melamine shelves, create punched-copper door panels, and install accent lighting.","production_code":"","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-01-16","episode_number":3,"episode_type":"standard","id":2876774,"name":"Kitchen Secretary","overview":"Norm's kitchen secretary solves the problem of creating a work space in the kitchen that still allows you to keep tabs on the dinner that's cooking on the stove and to take part in family conversation. Built out of mahogany, the ingenuity of its design can be found in its efficient use of space. Hung from the wall, this handsome piece features adjustable shelves to store cookbooks or a small TV and cubby holes for organizing recipes, bills, or correspondence. Below that there's a hinged desk front which folds down and offers enough space to accommodate a laptop computer. Watch and learn how to: create raised panels and intricate shelving work, and mortise and tenon joinery.","production_code":"9903","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-01-23","episode_number":4,"episode_type":"standard","id":2876775,"name":"Old Pine Hutch","overview":"In each season of The New Yankee Workshop, Norm crafts at least one woodworking project whose beautiful design and detailing ensures that it will become a cherished heirloom. This season it is unquestionably the hutch he crafts out of 200 year-old pine. Featuring two glass front doors, a drawer for storing linens, and a lower cabinet with raised panel doors, the beauty of the old wood is accented by Norm's use of high-end, vintage looking brass hardware and wonderful moulding. Watch and learn how to: make glass cabinet doors, construct dovetail drawers, select and apply appropriate mouldings and vintage hardware.","production_code":"9904","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-01-30","episode_number":5,"episode_type":"standard","id":2876776,"name":"Teak Bar","overview":"Woodworkers who entertain are going to love making Norm's attractive, custom-designed teak bar. Featuring great-looking, nautical-inspired brass hardware and stunning louver doors, the bar promises to hold everything a party giver needs. The interior of the wall-mounted upper cabinet features a traditional mirror back, two glass shelves, and accent lighting to showcase a prized glass or crystal collection. The bottom cabinet unit features a durable teak countertop with a hammered-brass service sink and spout for easy cleaning. Underneath, a divided cabinet features a roll-out tray for storing spirits and snacks on one side and enough space to accommodate an ice maker on the other. Though Norm admits its louver and sliding doors make it a more complex woodworking project, its decorative appeal and utilitarian value justify the challenge.","production_code":"9905","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-02-06","episode_number":6,"episode_type":"standard","id":2876777,"name":"Laundry Center","overview":"This is a Norm original, inspired by his need to sort his bright plaids, pastel plaids, and even a few white shirts for the laundry. Entirely constructed of durable, easy-to-clean white melamine, Norm designed this laundry center to work as both a sorting station and as a place to fold clothes and hold laundry supplies. It's a large scale project, that employs a number of basic, cabinetry-making skills. Watch and learn: constructing with and joining together the man-made material melamine, edge-band detailing, heat-sensitive bonding techniques, installing pivot hinges and full slides.","production_code":"9906","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-02-13","episode_number":7,"episode_type":"standard","id":2876779,"name":"Bake Center","overview":"Viewers who share his interest in the culinary arts were on Norm's mind when he designed several woodworking projects exclusively for the family chef. For the pastry chef, he consulted with good friend Chef Marian Morash of the Victory Garden.","production_code":"9907","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-02-20","episode_number":8,"episode_type":"standard","id":2876781,"name":"Table Saw Station","overview":"Most woodworkers and homeowners own at least a portable light weight table saw for a variety of projects, but are limited to the size of wood they can cut due to the shortcomings of its design and a lack of accessory work surface. Always looking to expand the versatility of common tools, Norm created this season's home workshop accessory to expand the function of the common table saw. Using basic construction techniques, he shows how to build this station out of melamine and wood and to how to make an auxiliary fence, feather board, and push stick which will allow the home woodworker to safely cut and rip large pieces of lumber for more ambitious projects. Watch and learn: basic construction techniques, how to build a sawhorse, how to make essential saw accessories such as a panel cutter, feather board, and push stick.","production_code":"9908","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-02-27","episode_number":9,"episode_type":"standard","id":2876782,"name":"Classic Kitchen Cabinets","overview":"The universal carpentry and cabinetry lessons that woodworkers will learn while making these classic kitchen cabinets will enable them to build any kind, says Norm. This two-unit piece consists of a wall-mounted, upper cabinet with double-glass doors and a bottom unit with raised paneled doors for storage. Its classic look comes from its basic cabinetry style, cornice moulding, soapstone countertop, and vintage-looking cafe hardware made of brushed nickel. Watch and learn: basic cabinetry making skills, how to create glass and raised paneled doors, drawer construction, and techniques for making adjustable shelves.","production_code":"9909","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-03-06","episode_number":10,"episode_type":"standard","id":2876783,"name":"Sink Base","overview":"Host Norm Abram shows how to build a sink base.","production_code":"9910","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-03-13","episode_number":11,"episode_type":"standard","id":2876784,"name":"Press Cupboard","overview":"Norm found the inspiration for this simple press cupboard in a Nantucket house he vacationed in last summer and was convinced that the antique original's modest size offered just the right amount of space to store linens and serving utensils for entertaining. Featuring streamlined flat-paneled doors, an upper drawer, and turned feet, its simple design seems almost modern. Norm crafts this piece out of recycled pine to give it a vintage look. Watch and learn: how to create flat-paneled doors, making shelves, using the lathe to create turned feet.","production_code":"9911","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-03-20","episode_number":12,"episode_type":"standard","id":2876785,"name":"Chef's Table","overview":"True gourmets will appreciate Norm's more sophisticated butcher block-topped chef's table which has both great style and utilitarian value. Featuring a poplar base with graceful tapered legs, it includes a built-in knife rack, towel racks, and pull-through drawers which can be accessed whether working at the stove or by the sink, as well as a large shelf for storing stock pots. Watch and learn: how to prepare rough-cut lumber, making blanks to create tapered legs, mortise and tenon joinery techniques, finger joint construction.","production_code":"9912","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-03-27","episode_number":13,"episode_type":"finale","id":2876786,"name":"Grill Cart","overview":"For the outdoor chef, Norm offers a solution to the shortcomings of modern barbecue grills-extra counter space-with a rolling grill cart made of weather-friendly redwood and cedar. Cart also features a pullout drawer, towel racks, hooks for utensils, and a large bottom shelf.","production_code":"9913","runtime":30,"season_number":11,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 11","overview":"Norm builds a number of kitchen-centric projects, including, a kitchen island, a kitchen pantry, a kitchen secretary, a bake center, classic kitchen cabinets, a sink base, a chef's table, and a grill cart.  He also builds an old pine hutch, a teak bar, a laundry center, and a press cupboard.\n\nFor \"shop tools and techniques\", he builds a table saw station.","id":88350,"poster_path":"/enXI6ecmXRv1K4YjUFmUQBjXFXD.jpg","season_number":11,"vote_average":0},"12":{"_id":"5917ad97c3a36840aa035e99","air_date":"2000-01-01","episodes":[{"air_date":"2000-01-01","episode_number":1,"episode_type":"standard","id":2876787,"name":"Garage Workshop (1)","overview":"If only I had a workshop like Norm's, I could build anything. Norm puts an end to this common viewer lament when he shows how to turn an average garage bay into a great home workshop. Using common building materials and hardware, he builds all the elements needed to make a workshop functional cabinetry, storage units, and a portable chop station. The genius of Norm's original design, however is that each element can be put away to make room for the family car when not in use or easily transported to any space a woodworker decides to set up shop. At the conclusion of this ambitious two-part project, Norm gives his list of must-have bench top power tools to ensure that every home craftsman will be able to utilize the workshop to its fullest. This is part 1 of 2.","production_code":"0001","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-08","episode_number":2,"episode_type":"standard","id":2876789,"name":"Garage Workshop (2)","overview":"If only I had a workshop like Norm's, I could build anything. Norm puts an end to this common viewer lament when he shows how to turn an average garage bay into a great home workshop. Using common building materials and hardware, he builds all the elements needed to make a workshop functional cabinetry, storage units, and a portable chop station. The genius of Norm's original design, however is that each element can be put away to make room for the family car when not in use or easily transported to any space a woodworker decides to set up shop. At the conclusion of this ambitious two-part project, Norm gives his list of must-have bench top power tools to ensure that every home craftsman will be able to utilize the workshop to its fullest. This is part 2 of 2.","production_code":"0002","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-15","episode_number":3,"episode_type":"standard","id":2876790,"name":"Planter Boxes and Bench","overview":"Norm crafts modular outdoor planters and a bench that are so versatile, they can be used to transform any deck or patio. Crafted out of river-recovered antique cypress wood, the planters and benches can be joined together and configured in a variety of ways to create different effects and outdoor living spaces.","production_code":"0003","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-22","episode_number":4,"episode_type":"standard","id":2876797,"name":"Croquet Set and Bench","overview":"Following a trip to Newport, Rhode Island to learn the finer points of the game, Norm builds his own special croquet mallet and a bench in which to store all the equipment. Sad to say his game is not good.","production_code":"0004","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-29","episode_number":5,"episode_type":"standard","id":2876798,"name":"Hanging Porch Swing","overview":"Norm discovers a beautiful antique porch swing that has been delighting fans for generations and decides we must have one too. His is made from plantation grown teak and looks like it will quickly become an heirloom.","production_code":"0005","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-05","episode_number":6,"episode_type":"standard","id":2876799,"name":"Computer Desk","overview":"Bowing to numerous requests from fans, Norm designs and builds a complex of clever spaces for the home office that will accommodate the family computer and all its peripherals.","production_code":"0006","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-12","episode_number":7,"episode_type":"standard","id":2876800,"name":"Patio Trolley","overview":"This handsome trolley is just the thing to roll around the patio when there are beverages and food to serve. Norm builds this useful outside dining accessory of long lasting mahogany.","production_code":"0007","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-19","episode_number":8,"episode_type":"standard","id":2876801,"name":"Desk Top Writing Case","overview":"After looking through the offerings of a country store, Norm finds the inspiration to build a small lock-and-key style writing desk which was popular 200 hundred years ago. Any viewer who has ever struggled with box joints or dovetails won't want to miss this program. These fine woodworking details are what give this simple piece its elegant character. Norm crafts two versions of this piece-one out of antique chestnut and one out of cherry-to ensure that viewers at home will be able to master these woodworking techniques.","production_code":"0008","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-26","episode_number":9,"episode_type":"standard","id":2876802,"name":"Outdoor Patio Table","overview":"Norm adds to his growing collection of outdoor furniture projects when he builds this round, teak patio table that is big enough to for six to enjoy a summer lunch. Measuring 51-inches across, the table seems like a big project but it can easily be built in any home workshop.","production_code":"0009","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-04","episode_number":10,"episode_type":"standard","id":2876803,"name":"English Server","overview":"Norm wanders into a country European antique shop and walks out with a treasure, a low English server, also commonly known as a sideboard. Simple in its design, the long antique pine boards are what give this piece its stunning character. Norm crafts his version of this piece out of some surprising distressed antique boards and proves that its natural beauty could earn it a place in any room of the house. The result will leave viewers hard-pressed to tell which is the antique and which is the reproduction.","production_code":"0010","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-11","episode_number":11,"episode_type":"standard","id":2876804,"name":"Sharpening Station","overview":"You can't do the work, unless the tools are sharp... is the mantra of woodworkers everywhere. Norm celebrates this sentiment with a with a sharpening station that features enough space for a grind wheel and water baths, and plenty of drawers to store blades and other tools. In the process of building this workshop accessory, Norm enlists an expert to offer a range of advice and techniques on how to properly sharpen common woodworking tools.","production_code":"0011","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-18","episode_number":12,"episode_type":"standard","id":2876805,"name":"Jewelry Case","overview":"Norm shops for a perfect gift for a loved one, discovers an exquisite jewelry case, and decides to replicate it back in The New Yankee Workshop. He improves upon its original design and makes it even more useful when he adds flip-up mirror and secret compartment to store treasures. But viewers will just have to tune in to see this secret revealed.","production_code":"0012","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-25","episode_number":13,"episode_type":"finale","id":2876806,"name":"Breakfront Cabinet","overview":"Home woodworkers, who look to The New Yankee Workshop for ideas in creating attractive storage spaces, will love Norm's breakfront cabinet. Featuring an upper glass case to display a china collection and a lower cupboard case to store linens, this project offers a great opportunity to learn how to create paneled doors with wood and glass.","production_code":"0013","runtime":30,"season_number":12,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 12","overview":"Norm builds planter boxes and a bench out of cypress, a croquet set and bench, a hanging porch swing and outdoor patio table out of teak, a computer desk, a mahogany patio trolley, a chestnut desktop writing case, an English server, a jewelry case, and a breakfront cabinet.\n\nFor \"shop tools and techniques\", he spends two episodes assembling a garage workshop and builds a sharpening station.","id":88351,"poster_path":"/ztrlLqdgibFaMR1Eim2tXylhnpw.jpg","season_number":12,"vote_average":0},"13":{"_id":"5917ad9dc3a3683a930389f1","air_date":"2001-01-06","episodes":[{"air_date":"2001-01-06","episode_number":1,"episode_type":"standard","id":2876807,"name":"Jigs (1)","overview":"Norm celebrates the 13th season of The New Yankee Workshop with jigs. Proclaiming them \"as important for the workshop as any power tool,\" Norm devotes the new season to building a variety of these useful devices, which will allow home woodworkers everywhere to build their projects with greater efficiency and accuracy. In part one, he shows how to create a panel cutting jig for cutting wide panels on the table saw, a tapering jig useful for tapering table legs, a circle cutting jig for the band saw, and a feather board for safely holding stock in place at the saw or at the router. Part two includes a jig which accurately guides a plunge router for making adjustable shelf pin holes, an ingenuous jig for mortising louvered doors and shutters, a circle cutting jig for a router, a hinge mortising jig, and a simple device for making box joints. This is part 1 of 2.","production_code":"0101","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-01-13","episode_number":2,"episode_type":"standard","id":2876808,"name":"Jigs (2)","overview":"Norm celebrates the 13th season of The New Yankee Workshop with jigs. Proclaiming them \"as important for the workshop as any power tool,\" Norm devotes the new season to building a variety of these useful devices, which will allow home woodworkers everywhere to build their projects with greater efficiency and accuracy. In part one, he shows how to create a panel cutting jig for cutting wide panels on the table saw, a tapering jig useful for tapering table legs, a circle cutting jig for the band saw, and a feather board for safely holding stock in place at the saw or at the router. Part two includes a jig which accurately guides a plunge router for making adjustable shelf pin holes, an ingenuous jig for mortising louvered doors and shutters, a circle cutting jig for a router, a hinge mortising jig, and a simple device for making box joints. This is part 2 of 2.","production_code":"0102","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-01-20","episode_number":3,"episode_type":"standard","id":2876809,"name":"Hall Seat","overview":"A visit to the historic Grove Park Inn in North Carolina's Blue Ridge Mountains provides the inspiration for this project when Norm spies a handsome Arts and Crafts-style hall seat among its stunning collection of antique furniture. Back in The New Yankee Workshop, he crafts his rendition out of quarter-sawn white oak. Nicely sized to fit in even the narrowest hallway, its tall back features a mirror and period brass hat hooks, while its hinged seat offers ample storage for boots and other accessories.","production_code":"0103","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-01-27","episode_number":4,"episode_type":"standard","id":2876810,"name":"CD Storage Case","overview":"Norm's CD storage case promises to fool the casual observer with its handsome looks, and capacity to store and display over 200 titles. Resembling an old-fashioned library card catalogue, it features six drawers with antique brass drawer pulls and labels to identify the contents. Crafted out of recycled \"heart\" pine, the drawers come with full extension slides, making it possible to find the right CD easily. This well-proportioned, modular piece can fit easily on a desktop or bookcase and can be added to-to house a growing collection of CD titles.","production_code":"0104","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-03","episode_number":5,"episode_type":"standard","id":2876811,"name":"Garden Armchair","overview":"Norm adds to his growing collection of outdoor furniture a handsome garden armchair that has generously-sized arms for resting a glass of ice tea while lounging with a book or enjoying garden views. Built of sturdy and beautiful recycled cypress, this comfortable chair promises to withstand all weather conditions for decades.","production_code":"0105","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-10","episode_number":6,"episode_type":"standard","id":2876812,"name":"Workshop Hutch","overview":"When Norm felt it time to remodel The New Yankee Workshop, he seized the opportunity to build an ingenuous workshop hutch that promises to be a must-have for every home woodworker. It features a backbench with a system of adjustable shelves that offers endless options for organizing the tools and materials every woodworker needs to have at his fingertips. The hutch also has a renewable bench top complete with electrical outlets, and roomy pullout drawers to store and keep a serious collection of power tools dust-free.","production_code":"0106","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-17","episode_number":7,"episode_type":"standard","id":2876813,"name":"Outdoor Cupboard","overview":"Norm designs a clever outdoor cupboard that's versatile enough to be prized by everyone from the backyard barbecue chef and gardener to the handyman and would-be flower arranger. This attractive storage piece has everything under one roof and then some, including a divided interior with adjustable shelves on one side, a chamber for storing tall garden tools on the other, and plenty of hooks for outdoor gear. Its exterior is sheathed with weather resistant cedar paneling and features a garden trellis and hinged work shelf that can be pulled out and used as a potting bench as needed.","production_code":"0107","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-24","episode_number":8,"episode_type":"standard","id":2876814,"name":"Dressing Table (1)","overview":"Norm visits the fabulous Biltmore Estate in Asheville, North Carolina. Built in 1880 by George Washington Vanderbilt, the 250-room French Renaissance-inspired chateau boasts a stunning collection of fine furniture including original Sheraton and Chippendale. Among the collection, Norm discovers a sophisticated mahogany dressing table with a foldaway mirror and graceful turned legs that he decides to replicate in The New Yankee Workshop. In the second of two episodes devoted to the making of an heirloom-quality dressing table found among the famed Biltmore Estate's collection, viewers find Norm in a national forest in North Carolina. There he learns how the U.S. Forest Service regulates the flow of timber to end users. Afterwards he goes behind-the-scenes at a plywood mill in nearby Asheville to see how high-quality plywood is made. This is part 1 of 2.","production_code":"0108","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-03","episode_number":9,"episode_type":"standard","id":2876815,"name":"Dressing Table (2)","overview":"Norm visits the fabulous Biltmore Estate in Asheville, North Carolina. Built in 1880 by George Washington Vanderbilt, the 250-room French Renaissance-inspired chateau boasts a stunning collection of fine furniture including original Sheraton and Chippendale. Among the collection, Norm discovers a sophisticated mahogany dressing table with a foldaway mirror and graceful turned legs that he decides to replicate in The New Yankee Workshop. In the second of two episodes devoted to the making of an heirloom-quality dressing table found among the famed Biltmore Estate's collection, viewers find Norm in a national forest in North Carolina. There he learns how the U.S. Forest Service regulates the flow of timber to end users. Afterwards he goes behind-the-scenes at a plywood mill in nearby Asheville to see how high-quality plywood is made. This is part 2 of 2.","production_code":"0109","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-10","episode_number":10,"episode_type":"standard","id":2876818,"name":"Mailbox","overview":"Like most of us, Norm has a mailbox he purchased from a local home center that now shows all the wear and tear of harsh New England winters. Determined to do something about its sorry state, he designs and builds a beautiful replacement complete with ornamental finial, chamfered post, and even a newspaper slot. It promises to signal to passersby, \"a craftsman lives here.\"","production_code":"0110","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-17","episode_number":11,"episode_type":"standard","id":2876819,"name":"Bath Cupboard","overview":"Like the term \"coffee table\" there is no such thing as a \"bath cupboard\" in furniture history, nevertheless Norm finds one at a favorite antique store in Cambridge, Massachusetts. There he discovers how a clever craftsman took a charming antique cabinet door and built a cupboard around it using beautifully aged timbers and period hardware. Back in The New Yankee Workshop, Norm takes the concept one step further when he lines the cabinet with painted plywood shelves, adds a full length dressing mirror to the interior of the door, and crowns it with some custom moulding.","production_code":"0111","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-24","episode_number":12,"episode_type":"standard","id":2876821,"name":"Monastery Table","overview":"Norm puts down his fork long enough to appreciate the craftsmanship of the handcrafted monastery table upon which he dines in one of Tuscany, Italy's, finest inns. Rescued from an ancient monastery, the table features all of the characteristics that one would expect to find in a piece of furniture that has endured years of hard use by the brothers. To replicate its charm, Norm spends some time hunting for the right timber and discovers a cache of Southern yellow pine still dripping with resin. Back at The New Yankee Workshop he fashions his version of this piece using a lathe and table saw.","production_code":"0112","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-31","episode_number":13,"episode_type":"finale","id":2876822,"name":"Barrister Bookcase","overview":"Among Norm's personal collection of furniture, is an old oak barrister's bookcase that safely showcases his collection of handcrafted glasses, pottery, and books. Comprised of three separate units that nest on top of each other, each features a glass-front door with hinged sliders that allows it to \"disappear\" out of site. Believing it to be a versatile piece that everyone would want for their own collections, Norm shows viewers how to build one back in The New Yankee Workshop. While he keeps true to most of the details of the original, he does refine its overall design by combining the three modular units into one singular unit.","production_code":"0113","runtime":30,"season_number":13,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 13","overview":"Norm builds a white oak hall seat, a pine CD storage case, a cypress garden armchair, an outdoor cupboard, a mahogany dressing table, a mailbox, a bath cupboard, a pine monastery table, and an oak barrister's bookcase.\n\nFor \"shop tools and techniques\", he spends two episodes demonstrating jigs and builds a hutch for the workshop.","id":88352,"poster_path":"/6DJUur411bXsXSgRm1lBDXJBHSO.jpg","season_number":13,"vote_average":0},"14":{"_id":"5917ada2925141583c03a2d5","air_date":"2002-01-05","episodes":[{"air_date":"2002-01-05","episode_number":1,"episode_type":"standard","id":2876823,"name":"Miter Bench and Storage (1)","overview":"A well-equipped workshop will need a bench for a miter saw. In this two part project, Norm builds a useful model with extensions on both sides of the saw, an adjustable stop block, an auxiliary guide for use with an adjacent radial saw table, and much more. The bench base is fully equipped with pull-out drawers sized to house Norm's most-used power tools and accessories. One of those, the \"dedicated\" mortiser, has its own pull-out shelf with a bench-top fixture that secures the tool and provides extension to support and stabilize longer stock. This will be a popular project to anyone who wants to build useful organized storage in the workshop. This is part 1 of 2.","production_code":"0201","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-12","episode_number":2,"episode_type":"standard","id":2876824,"name":"Miter Bench and Storage (2)","overview":"A well-equipped workshop will need a bench for a miter saw. In this two part project, Norm builds a useful model with extensions on both sides of the saw, an adjustable stop block, an auxiliary guide for use with an adjacent radial saw table, and much more. The bench base is fully equipped with pull-out drawers sized to house Norm's most-used power tools and accessories. One of those, the \"dedicated\" mortiser, has its own pull-out shelf with a bench-top fixture that secures the tool and provides extension to support and stabilize longer stock. This will be a popular project to anyone who wants to build useful organized storage in the workshop. This is part 2 of 2.","production_code":"0202","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-19","episode_number":3,"episode_type":"standard","id":2876825,"name":"Steamer Trunk","overview":"Long after the last steamship sailed its last voyage, Norm sets out to build a New Yankee Workshop version of the rounded-top steamer trunk. Once used to store clothes for ship passengers, these trunks are still very popular among antique collectors. Today they are much admired by those who use them at the foot of beds for blanket and linen storage. Norm built his from antique chestnut and hammered iron strips that mimic the original trunk hardware.","production_code":"0203","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-26","episode_number":4,"episode_type":"standard","id":2876826,"name":"Adirondack Loveseat","overview":"One of the all-time most popular projects ever built in The New Yankee Workshop was the Adirondack chair Norm built years ago. Now, with this Adirondack loveseat, Norm has the chance to revisit his original design and make improvements not possible when the original was built. For example, a new generation of weather proof adhesives are now available to secure the various parts to one another. Elsewhere Norm makes refinements in joining the various elements with all weather screws and conceals them with plugs. What results from these improvements, the Adirondack loveseat, is an extremely comfortable double seated version of our all-time favorite project.","production_code":"0204","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-02","episode_number":5,"episode_type":"standard","id":2876827,"name":"Canopy Bed","overview":"The main business of Leonard's Antiques, a group of highly respected antique stores located in the Northeast, is the making and selling of reproduction beds. Using both old original elements salvaged from the past and newly created parts necessary to meet modern bed dimensions, the craftsmen at Leonard's know all about beds. Norm pays Leonard's a visit and meets the owner, Jeff Jenkins, for a behind the scenes look at how the beds are made. Then he returns to the workshop and creates a beautiful tiger maple version sized to fit a queen. The four turned posts and a handsome headboard lend distinction to a good night's sleep.","production_code":"0205","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-09","episode_number":6,"episode_type":"standard","id":2876828,"name":"Shaving Stand","overview":"While visiting Palm Beach, Florida, Norm discovers an attractive maple shaving stand in the Flagler Museum. Norm recreates this unique piece of Americana using cherry to form the mirror surround, the drawer, and to form the gracefully cut legs. At first glance, you might wonder why Norm (with his full beard) would ever need a piece of furniture like this, but he will be ready in case fashions change.","production_code":"0206","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-16","episode_number":7,"episode_type":"standard","id":2876829,"name":"Work Table and Clamp Cart","overview":"Surely one of the most useful projects Norm's ever built for the shop is this work table. It's a light weight, yet sturdy, assembly table that is easily raised up on casters to move around the shop as necessary. The mechanism for the caster assembly was borrowed from a nearby scenic shop where mobility is essential. Also with the table, Norm creates a storage cart for his collection of woodworker's clamps. When he needs several clamps, he can easily wheel over his collection to make his choice.","production_code":"0207","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-23","episode_number":8,"episode_type":"standard","id":2876830,"name":"Pedestal Table","overview":"Norm visits an antique shop and spots a small round pedestal table that the dealer tells him may have originated in Indonesia. Maybe that's why it was built from teak, a popular wood in that region. Norm likes the choice of the wood, for it means that the table can be used either inside or out. The tricky part of making a pedestal table is connecting the legs to the pedestal. After the pedestal is turned, and while it is still in the lathe, Norm uses a clever technique with a jig and a router to accurately cut the mortises.","production_code":"0208","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-02","episode_number":9,"episode_type":"standard","id":2876831,"name":"Four Drawer Chest","overview":"If you've been looking for a small elegant chest of drawers then this Chippendale-inspired beauty is for you. Locating one is not easy, so Norm was delighted to find an original in an antique store. Norm's version is built of high quality mahogany veneer plywood and fitted with period reproduction hardware. This four drawer classic is perfect for a small space or next to a bed.","production_code":"0209","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-09","episode_number":10,"episode_type":"standard","id":2876832,"name":"Wooden Bowls","overview":"Norm makes wooden bowls.","production_code":"0210","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-16","episode_number":11,"episode_type":"standard","id":2876833,"name":"Nightstand","overview":"An antique cherry nightstand, circa 1840, found in a friend's house on Nantucket Island, is inspiration for Norm to build his version in The New Yankee Workshop. This square-topped, single drawer nightstand has 4 handsomely turned legs. Norm uses cherry for the body of the piece, and fashions the drawer front from tiger maple as a distinctive contrast. The simple elegance of this nightstand assures its place as a family heirloom.","production_code":"0211","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-23","episode_number":12,"episode_type":"standard","id":2876834,"name":"Deck Chair","overview":"It used to be when you cruised the ocean on a liner you would be offered a comfortable place to read and relax on a sun deck. A deckhand would show you to your wooden lounge chair, often made of teak, fitted with brass and combined with a footrest. Today you can enjoy the same comfort with Norm?s version, made of plantation grown teak and specialized brass hardware designed to withstand the elements.","production_code":"0212","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-30","episode_number":13,"episode_type":"finale","id":2876835,"name":"Stepback Cupboard","overview":"When Norm finds this early cupboard in a Nantucket antique shop, he can't be sure of what he has found. There are questions about the paint, the overall height (it seems low), and the decoration may have been added at a later time. Nevertheless, it's a simple rustic classic, just perfect for The New Yankee Workshop collection. Norm makes his from recycled pine and predicts this piece will be popular with woodworkers.","production_code":"0213","runtime":30,"season_number":14,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 14","overview":"Norm builds a chestnut steamer trunk, an Adirondack loveseat, a tiger maple canopy bed, a cherry shaving stand, a pedestal table and deck chair out of teak, a four-drawer chest, wooden bowls, a cherry and tiger maple nightstand, and a stepback cupboard.\n\nFor \"shop tools and techniques\", he builds a miter bench with storage, a work table, and a clamp cart.","id":88353,"poster_path":"/avFtDW20EhVPI6VRlKTXLE6rRNj.jpg","season_number":14,"vote_average":0},"15":{"_id":"5917ada6925141572303b956","air_date":"2003-01-04","episodes":[{"air_date":"2003-01-04","episode_number":1,"episode_type":"standard","id":2876836,"name":"Deluxe Router Station","overview":"Norm's original router station is the most popular shop project he's ever done. So why change it? Well, in the years since he built the first one, he's been thinking up ways to improve it. Now comes the deluxe edition of Norm's router station with an improved storage system, a more stable and easier-to-use fence, an improved top, and updated electrical hookups. These small changes add up to a more useful and versatile upgrade on the original.","production_code":"0301","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-11","episode_number":2,"episode_type":"standard","id":2876839,"name":"Sheep Shearing Coffee Table","overview":"How about a coffee table that once served as a portable platform to shear the wool from sheep? We're not sure how well it worked at that task, but Norm reinvents it as a handsome platform for books, plants, puzzles, canapes, and all the other things that clutter today's coffee tables. This is definitely a conversation piece. Made of recycled pine, this unusual table is easy to make and comes with a good story.","production_code":"0302","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-18","episode_number":3,"episode_type":"standard","id":2876842,"name":"Queen Anne Table","overview":"It would be hard to imagine a more graceful dining table than Norm's new Queen Anne pedestal table. The beautiful round solid cherry top sits on a sturdy turned pedestal and is supported by three elegant legs. This is a perfect size for an animated dinner table conversation. Woodworkers will enjoy the challenge of building this heirloom of tomorrow.","production_code":"0303","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-25","episode_number":4,"episode_type":"standard","id":2876846,"name":"Cigar Chair (1)","overview":"Norm happened to mention to a reporter that he had never made an upholstered piece of furniture. This led to an invitation to partner with Lee Industries of Newton, North Carolina, one of America's most highly regarded furniture makers. In the first of a special two-part program, Norm visits the Lee Industries factory to understand how upholstered chairs and sofas are made. He gets a tour with Norman Coley whose family has been making furniture in North Carolina for 40 years. Coley suggests Norm try making a \"cigar\" chair, which can be made without sewing and stitching. Back at the shop Norm starts by building the hard maple frame, the skeleton underneath this handsome chair. This is part 1 of 2.","production_code":"0304","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-01","episode_number":5,"episode_type":"standard","id":2876847,"name":"Cigar Chair (2)","overview":"Norm happened to mention to a reporter that he had never made an upholstered piece of furniture. This led to an invitation to partner with Lee Industries of Newton, North Carolina, one of America's most highly regarded furniture makers. In part two, Norm cuts the leather using patterns and tackles the padding and other steps before showing his new-found skill at applying the rich looking leather to the frame. It's all about stretching, tacking, stretching, and re-tacking until the desired look is achieved. This is part 2 of 2.","production_code":"0305","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-08","episode_number":6,"episode_type":"standard","id":2876848,"name":"Beveled Glass Cupboard","overview":"This jewel of a display cupboard will provide attractive storage for any bathroom. The top of the cabinet, with its beveled glass panels and adjustable shelves, is a perfect place to display attractive objects in a protected space. The display top sits on a closed cabinet for more useful storage accessed by means of a flat paneled door. Painted a glistening white and conveniently sized for limited space, this project is a winner.","production_code":"0306","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-15","episode_number":7,"episode_type":"standard","id":2876849,"name":"Media Press (1)","overview":"Organizing today's electronics is a challenge with ever-larger televisions, DVD's, amplifiers, speakers, CD collections and all sorts of other paraphernalia. Finding useable storage for everything can be difficult. Norm is inspired by a beautiful antique cupboard his friend Jeff Jenkins of Leonard's Antiques shows him. In this special two-part program he builds a large media cupboard made of maple and outfits it with swing-away doors, adjustable shelves, and four roomy drawers below that should answer just about every need for a home media center. The project includes finishing steps using aniline dyes and polyurethane to protect and enhance the beauty of the piece. This is part 1 of 2.","production_code":"0307","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-22","episode_number":8,"episode_type":"standard","id":2876850,"name":"Media Press (2)","overview":"Organizing today's electronics is a challenge with ever-larger televisions, DVD's, amplifiers, speakers, CD collections and all sorts of other paraphernalia. Finding useable storage for everything can be difficult. Norm is inspired by a beautiful antique cupboard his friend Jeff Jenkins of Leonard's Antiques shows him. In this special two-part program he builds a large media cupboard made of maple and outfits it with swing-away doors, adjustable shelves, and four roomy drawers below that should answer just about every need for a home media center. The project includes finishing steps using aniline dyes and polyurethane to protect and enhance the beauty of the piece. This is part 2 of 2.","production_code":"0308","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-01","episode_number":9,"episode_type":"standard","id":2876851,"name":"Flagpole","overview":"Years ago on This Old House we featured the installation of a wooden flagpole on our Napa, California project. Now Norm has taken up the challenge on making one in The New Yankee Workshop. Made of strong Douglas fir, glued with epoxy, painted with marine paint and mounted on a welded steel ground anchor designed by master welder Bob Diorio, this flagpole is easy to maintain because the whole pole can be lowered to the ground whenever necessary. Be the first in your neighborhood to make your own flagpole.","production_code":"0309","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-08","episode_number":10,"episode_type":"standard","id":2876852,"name":"Regency Headboard","overview":"In lieu of a great bedstead, sometimes all you need is a headboard. On this program Norm builds a beauty out of mahogany that will lend substance and elegance to a simple metal frame with a mattress and box spring. Again with help from Leonard's Antiques and Jeff Jenkins, Norm finds some interesting variations on this popular alternative to a full bed frame. Norm builds this headboard, sized for a king-sized bed, from top grade mahogany veneer plywood and uses solid mahogany to form the posts and mouldings.","production_code":"0310","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-15","episode_number":11,"episode_type":"standard","id":2876853,"name":"Painted Corner Hutch","overview":"This narrow corner cupboard will be extremely useful in today's home where space is sometimes limited. The top section of the cupboard has several shelves behind a glass-fronted door, perfect for decorative china or glassware. The sturdy lower section houses additional storage behind closed doors. Made of poplar and fashioned with interesting detail, this cupboard can be painted to match any decor.","production_code":"0311","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-22","episode_number":12,"episode_type":"standard","id":2876854,"name":"French Side Table","overview":"Norm finds a handsome dark wood French side table in a private collection on Nantucket. Made of dark hardwood, probably walnut, this single drawer original is straightforward to make; even the curved legs are easily managed in a well-equipped shop. Best of all, its elegant style and good proportions will fit nicely in any room of your home and suit many purposes.","production_code":"0312","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-29","episode_number":13,"episode_type":"finale","id":2876855,"name":"Wall Mounted Tool Chest","overview":"You can find Norm using hand tools in The New Yankee Workshop, but we are not proud of the way they are stored. That's about to change when Norm builds a woodworker's hanging tool chest. But it won't be like the one he finds in a private collection in Wisconsin. There he discovers one of the most magnificent examples of a wall mounted tool chest ever made, so impressive in fact, that it has been displayed in the Smithsonian Museum. Returning to the shop, Norm builds his version of a hanging storage chest for the hand tools he regularly uses.","production_code":"0313","runtime":30,"season_number":15,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 15","overview":"Norm makes a pine sheep shearing coffee table, a Queen Anne pedestal table, a cigar chair, a glass cupboard, a maple media press, a Douglas fir flagpole, a mahogany regency headboard, a painted corner hutch out of poplar, and a walnut French side table.\n\nFor \"shop tools and techniques\", he builds a deluxe router station and a wall-mounted tool chest.","id":88354,"poster_path":"/gK1Mw7fFDSmj4uUYEwBqZSDJxx8.jpg","season_number":15,"vote_average":0},"16":{"_id":"5917adabc3a368423c03b41f","air_date":"2004-01-03","episodes":[{"air_date":"2004-01-03","episode_number":1,"episode_type":"standard","id":2876856,"name":"The Butterfly Table","overview":"Norm revisits Old Sturbridge Village and discovers an old table built by a colonial furniture maker more than 200 years ago. The \"Butterfly\" table gets its name from the graceful drop leaves and the wing-like supports that hold the tabletop straight. This versatile table can also be used with the leaves dropped or even with just one lowered to allow placement next to a wall. The table is built of cherry, stained with a dark stain, and protected by a polyurethane finish.","production_code":"0401","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-10","episode_number":2,"episode_type":"standard","id":2876857,"name":"The Folding Screen","overview":"The folding room screen is an attractive alternative to divide a room or to seal off an unwanted view of a computer, a TV set, or perhaps a heating radiator. This handsome three-fold hinged screen is built of traditional raised panels. Norm uses mahogany, which is stained to enhance the beautiful wood grain and then sealed with hard-wearing polyurethane.","production_code":"0402","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-17","episode_number":3,"episode_type":"standard","id":2876858,"name":"The Flower Stand","overview":"The flower stand is a woodworker's interpretation of the flower vendor's classic three-tiered display shelf. Norm built his version with hard-wearing medium density overlay plywood, a material favored by highway sign makers, and edged with decay resistant cypress. A twocoat paint job results in a handsome \"black/green\" garden finish, perfect for displaying a varied collection of plants and flowers.","production_code":"0403","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-24","episode_number":4,"episode_type":"standard","id":2876859,"name":"The Shaker Bookcase","overview":"This bookcase will surprise many fans because it is unlike most Shaker designs. Elder Green built the original unusual cupboard in 1898 to contain a particular selection of documents in the Shaker Community library in Sabbathday Lake, Maine. Green built his bookcase of butternut and walnut and included a complicated cornice, built of several mouldings. Norm revised the original, making it somewhat shorter and narrower and built his of cherry.","production_code":"0404","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-31","episode_number":5,"episode_type":"standard","id":2876861,"name":"The Tall Case Oak Clock","overview":"From hobbyists building a clock out of a kit to professionals building one from scratch, clock building seems to be a popular woodworking pastime. Over the years, thousands of clocks have been made and a surprising number have survived. Nowhere is there a more interesting collection of old clocks than that of the National Watch and Clock Museum in Columbia, Pennsylvania. Norm pays a visit to their collection for ideas for his version of a grandfather's clock. Inspired, he combines an Arts & Crafts-style case and some delightful sounding chimes into what is sure to become a family heirloom.","production_code":"0405","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-07","episode_number":6,"episode_type":"standard","id":2876862,"name":"The Dower Chest","overview":"Pennsylvania Dutch is an endearing style created by early furniture makers. Many pieces of this delightful furniture, painted with a colorful primitive design, can be found at the Winterthur estate, in Delaware, Henry DuPont's fabulous treasure house of American antiques. With curator Greg Landry, Norm tours the collection and finds an interesting dower chest dating back to 1840. Norm builds his own of tulip poplar and calls on a decorative painter to recreate typical Pennsylvania Dutch artwork.","production_code":"0406","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-14","episode_number":7,"episode_type":"standard","id":2876863,"name":"The Windsor Chair (1)","overview":"The Lancaster County \"Fan Back\" Windsor chair is perhaps the most challenging woodworking project of the 16th season. Norm pays a visit to chair makers Bill and Sally Wallick in Wrightsville, Pennsylvania for some invaluable help in building his \"Fan Back\". Bill teaches Norm how to start with carving a seat, then turning the legs, then fitting the steam bent maple \"crest\" rail, and adding the delicate, but strong spindles. Then Sally Wallick takes over to show how she is able to add instant age to their new chairs, giving them a realistic patina of antiquity that will fool even an expert. This is part 1 of 2.","production_code":"0407","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-21","episode_number":8,"episode_type":"standard","id":2876864,"name":"The Windsor Chair (2)","overview":"The Lancaster County \"Fan Back\" Windsor chair is perhaps the most challenging woodworking project of the 16th season. Norm pays a visit to chair makers Bill and Sally Wallick in Wrightsville, Pennsylvania for some invaluable help in building his \"Fan Back\". Bill teaches Norm how to start with carving a seat, then turning the legs, then fitting the steam bent maple \"crest\" rail, and adding the delicate, but strong spindles. Then Sally Wallick takes over to show how she is able to add instant age to their new chairs, giving them a realistic patina of antiquity that will fool even an expert. This is part 2 of 2.","production_code":"0408","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-28","episode_number":9,"episode_type":"standard","id":2876865,"name":"The Lowboy","overview":"Lowboy's are similar to the lower case of a classic highboy. Sometimes called a dressing table, they often come with two small drawers, one slightly larger with carved decoration and one long thin drawer under the top. Norm finds an early version of this classic at the Concord Museum in Concord, MA. Norm decides to embellish his with \"Ball & Claw\" type legs he gets from a company in Vermont who specialize in period decorative legs for furniture makers. With factory made legs and a plan for a Chippendale Lowboy in mind, Norm builds his version of the antique classic from solid cherry and carves a distinctive shell for the middle drawer.","production_code":"0409","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-06","episode_number":10,"episode_type":"standard","id":2876866,"name":"The Pier Table","overview":"A pier table is a small table that is meant to be located between two windows. Norm finds a beautiful example of one at GKS Bush Antiques on Nantucket, Massachusetts. Made of poplar and beautifully painted with classic designs and a faux marble top, the original is stunning. Norm builds a copy and has it painted to match the original.","production_code":"0410","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-13","episode_number":11,"episode_type":"standard","id":2876867,"name":"The Dining Table","overview":"Norm visits an antique dealer who commissions reproduction English antique furniture for his shop on Nantucket, Massachusetts. At the shop Norm finds an extension table, which should be perfect for \"dinner for 10 or more\" and yet collapses down to 6 feet for non-feast days. Norm makes his own out of mahogany with an elegant two-leaved top that sits on a pair of Queen Anne period pedestals giving diners ample legroom under the table.","production_code":"0411","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-20","episode_number":12,"episode_type":"standard","id":2876869,"name":"The Mission Style Desk","overview":"Prowling through an arts and crafts shop of highly collectable Stickley and other Mission style period furniture, Norm discovers a wonderful oak desk he hopes to use for a small computer. It is an original 1910 Oak Knee Hole Desk made by L&JG Stickley. Made of oak and finished in the appropriate color and glaze, Norm will be using this sturdy desk for his own home.","production_code":"0412","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-27","episode_number":13,"episode_type":"finale","id":2876870,"name":"The Gardener's Dry Sink","overview":"Here is a place to organize your horticultural life. Meant to go outdoors or in, this hard working bench provides a place to work on plants, repot them, and to store the numerous items plant lovers use. It's built of cypress for resistance to decay and is finished with a dry sink lined with copper.","production_code":"0413","runtime":30,"season_number":16,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 16","overview":"Norm builds a butterfly table, a Shaker bookcase, and a lowboy out of cherry, a folding screen and dining table out of mahogany, a flower stand and gardener's dry sink out of cypress, a tall case oak clock, a decoratively-painted dower chest, a fan back Windsor chair, a painted pier table, and an oak mission-style desk.","id":88355,"poster_path":"/kqyIUCMGFdNEZK4d2FPXsO5BVtH.jpg","season_number":16,"vote_average":0},"17":{"_id":"5917adb1925141572303b967","air_date":"2005-01-01","episodes":[{"air_date":"2005-01-01","episode_number":1,"episode_type":"standard","id":2876872,"name":"Hall Mirror","overview":"Every family needs one of these. An assembly point for the family keys, hats, and mail, with the added bonus of a large mirror that gets you ready before you leave the house. This Arts and Crafts style hall mirror, framed in oak and fitted with reproduction antique hardware, is an ideal woodworking project.","production_code":"0501","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-08","episode_number":2,"episode_type":"standard","id":2876873,"name":"Bermuda Bench/Table","overview":"Every time Norm does an outside project it is an instant hit. This will be no exception. It's a useful all-weather convertible bench/table. He found it in an old house in Saint Georges, Bermuda and thought it would be perfect for a New Yankee Workshop project. Made of rot-resistant cypress, this will only get more beautiful with age.","production_code":"0502","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-15","episode_number":3,"episode_type":"standard","id":2876876,"name":"Ottoman","overview":"Encouraged by his success in building the upholstered cigar chair in Season 15, Norm partners once again with furniture guru Norman Coley to build an oversized ottoman that today's decorators simply must have. Norm visits the semi-annual world famous Chapel Hill, North Carolina furniture market to select the model he will build in the New Yankee Workshop. While he is at it, he adds a leather-covered footstool to go with his cigar chair.","production_code":"0503","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-22","episode_number":4,"episode_type":"standard","id":2876878,"name":"Bermuda Chest","overview":"Bermudans call themselves \"Onions\" perhaps because of those succulent pungent bulbs they have grown for hundreds of years. But onions also appear as wooden buns, or feet, to keep their blanket chests off the damp floors of that seaside nation. Norm, on his trip to Bermuda, finds a historic example in the form of a well-proportioned solid mahogany chest which he is able to reproduce faithfully back at the shop.","production_code":"0504","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-29","episode_number":5,"episode_type":"standard","id":2876881,"name":"Federal-Style Game Table","overview":"With no television and few newspapers to read, our ancestors had plenty of time for card games thus, game tables were very popular. They often featured circular tops that were hinged and could be folded, designed to be stored against the wall when not in use. When needed, the top flipped down on a hinged gate leg and was suitable for four card players. Norm discovered an example in historic Deerfield, Massachusetts, which he used as inspiration for his piece.","production_code":"0505","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-05","episode_number":6,"episode_type":"standard","id":2876882,"name":"Lathe 101","overview":"Lathe 101 is the first in a series of programs featuring the skills required to master a single shop tool. In this first installment, Norm tackles the wood lathe and shows the basic techniques necessary to learn spindle turning, showing several examples of lathes and the tools required to achieve professional results. A self-taught turner himself, Norm then turns a regulation sized baseball bat and even gets a member of the current Red Sox baseball team to try it out in Fenway Park. You'll see the results and you'll learn how to improve your lathe skills on this long awaited program.","production_code":"0506","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-12","episode_number":7,"episode_type":"standard","id":2876883,"name":"Side Chair","overview":"Norm has said many times that chairs are the most challenging projects a woodworker can attempt. Not only do they have to be strong enough to support the heavy twisting action of a human body, they also have to be attractive enough to take their place at the table. Norm visits historic Deerfield in central Massachusetts where he discovers, amid the vast collection of antique furniture, a comfortable, handsome, American-built side chair of the early 1800's. Norm makes a faithful reproduction back in the workshop and upholsters it in a modern fabric that should stand up well to the rigors of time.","production_code":"0507","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-19","episode_number":8,"episode_type":"standard","id":2876885,"name":"Tilt Top Table","overview":"One classic furniture form that Norm has long admired is the tilt top table. Graceful Chippendale feet support a central pedestal, which in turn supports the tilting mechanism and a glorious cherry top, which is fashioned in a \"hanker chief\" outline. When stored in the \"up\" position it provides a dramatic backdrop, and when it is down it is a comfortable and useful table for four. Norm finds the original at the historic Harrison Gray house on Boston's Beacon Hill.","production_code":"0508","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-26","episode_number":9,"episode_type":"standard","id":2876886,"name":"Highboy (1)","overview":"Never in the history of The New Yankee Workshop has there been a more challenging project. This bonnet-topped Queen Anne-legged tiger maple highboy is a classic in every sense of the word. Even the reproduction hardware is rare. Joining Norm in the search for a suitable highboy that Norm can reproduce are Leigh and Leslie Keno, much respected furniture experts from the PBS show \"FIND.\" They take Norm to Leigh's gallery in New York City and show him a glorious original they believe was built in Wethersfield, Connecticut in the early 19th century. It takes Norm two programs to complete the magnificent project and those who have seen it say it is well worth his time and effort. This is part 1 of 2.","production_code":"0509","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-05","episode_number":10,"episode_type":"standard","id":2876887,"name":"Highboy (2)","overview":"Never in the history of The New Yankee Workshop has there been a more challenging project. This bonnet-topped Queen Anne-legged tiger maple highboy is a classic in every sense of the word. Even the reproduction hardware is rare. Joining Norm in the search for a suitable highboy that Norm can reproduce are Leigh and Leslie Keno, much respected furniture experts from the PBS show \"FIND.\" They take Norm to Leigh's gallery in New York City and show him a glorious original they believe was built in Wethersfield, Connecticut in the early 19th century. It takes Norm two programs to complete the magnificent project and those who have seen it say it is well worth his time and effort. This is part 2 of 2.","production_code":"0510","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-12","episode_number":11,"episode_type":"standard","id":2876888,"name":"Kitchen Island","overview":"Largely unknown in grandmother's time, kitchen islands have become indispensable in today's modern home. Used to house sinks, cook tops, storage for pots and pans, recyclables, and barstools, they often become the most valuable work surface in a busy kitchen. Norm builds this one out of poplar and birch plywood for a painted finish and lines it with hard wearing factory-applied finishes intended to give this island a long career of heavy use. Along with the high-tech plywood, Norm uses state of the art drawer slides and period pulls to complete this useful project.","production_code":"0511","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-19","episode_number":12,"episode_type":"standard","id":2876889,"name":"Carved Wooden Signs","overview":"Norm makes carved wooden signs.","production_code":"0512","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-26","episode_number":13,"episode_type":"finale","id":2876890,"name":"The Library System","overview":"Is there a homeowner out there who doesn't yearn for more shelf space for his books and display items, says Norm at the beginning of The Library System program, which concludes the 17th season of New Yankee Workshop projects. Recognizing the need for a good bookcase design that can be used in any suitable room and added to as needed to fill out a wall of books leads Norm to design a modular system that can be adjusted to go around existing windows or doors. It looks like expensive \"custom\" built-ins, yet the elements are actually built in the shop where cutting and routing large pieces of plywood and dealing with the resulting dust is easy. Norm is betting that when wood workers learn some of his tips on this project, lots of Library Systems will be built.","production_code":"0513","runtime":30,"season_number":17,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 17","overview":"Norm visits Bermuda where he gets ideas to build a bench/table out of cypress and a chest out of mahogany.  He also builds an oak hall mirror, an upholstered ottoman, a federal-style game table, a side chair, a cherry tilt top table, a Queen Anne highboy out of tiger maple, yet another kitchen island, carved wooden signs, and the library modular bookshelf system.\n\nFor \"shop tools and techniques\", he demonstrates the basics of using the lathe.","id":88356,"poster_path":"/5DvGwAPnqqKE7qV6TaFYBFAN9Py.jpg","season_number":17,"vote_average":0},"18":{"_id":"5917adb7c3a368371b02c0a7","air_date":"2006-01-07","episodes":[{"air_date":"2006-01-07","episode_number":1,"episode_type":"standard","id":2877725,"name":"Colonial Style Mantel","overview":"After tackling more pressing projects, Norm is finally getting around to building a mantelpiece for the master bedroom in his home. Though his home is filled with the beautiful furniture he has made over the years at the New Yankee Workshop, somehow he never took the time to complete the most defining architectural element in his bedroom - the fireplace mantel. Now, instead of waking up to an unfinished brick and plaster wall, he looks at a beautiful Colonial mantelpiece that frames the master bedroom's fireplace. The project involves using the router table to produce the frames to receive the m.d.o. plywood panels and make a moulding, some precise work with the mitre saw, and installation of the completed mantelpiece. As always, Norm makes this project seem within reach of most average woodworkers.","production_code":"0601","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-14","episode_number":2,"episode_type":"standard","id":2877729,"name":"Plantation Shutters","overview":"If you've priced plantation shutters lately, you know how expensive they can be, costing several hundred dollars per opening. Not surprisingly, Yankee ingenuity and thrift get the better of Norm and he creates some stunning shutters in the workshop. As his admirers have come to expect, he first builds a collection of jigs, which are necessary to drill holes, set staples, and mortise hinges.  Then he shapes the individual bass wood slats, mounts them on a control rod, and positions the whole assembly into a frame of poplar that then gets spray-painted. You'll be impressed at how well these interior shutters look and operate when he installs them in a room he's been working on for some time.","production_code":"0602","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-21","episode_number":3,"episode_type":"standard","id":2877732,"name":"Workshop Helpers","overview":"Everybody knows Norm likes to work alone. Although he does get some help finishing the projects, Norm does the wood working all by himself. Sometimes that's not easy, so Norm finally decided to enlist the help of some workers who never show up for work late, never get tired, and are willing to work until the job is done. Meet them.\n\nRoller Stand: a sturdy, height adjustable, rugged stand for use as an out feed appliance for the table saw, the band saw, or the drill press. It even comes to work ready with its own homemade, self-storing crank.\n\nStock Cart: a lightweight, very strong, wheeled wagon that comes with five shelves to organize the parts needed to complete a project and travels from machine to machine, carrying the parts as needed.\n\nMobile Tool Stand: a shop-built table to support bench top tools like planers, small saws, and jointers that, when combined with a mobile base, can add versatility and convenience to any shop.","production_code":"0603","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-28","episode_number":4,"episode_type":"standard","id":2877735,"name":"Poker Table","overview":"Poker is the game to be playing right now and Norm has a special project in mind for its legions of fans when he sets out to find and build the ideal table. To find out what the locals are using, Norm interrupts a neighborhood poker game for a look at their table and comes away unimpressed. Although the one he finds supports eight players, their chips, their drinks, and the cards, it is profoundly ugly and shaky. Norm decides to build an improved version.\n\nNorm creates his eight-sided table of mahogany and mahogany veneer plywood and places it on a sturdy pedestal. Rethinking the traditional felt covering typically used on these tables, Norm chooses a state-of-the-art synthetic fabric that offers a much-improved covering. He even finds brass cup holders, which are recessed into the top for holding beverages. The finished table is a winner.","production_code":"0604","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-04","episode_number":5,"episode_type":"standard","id":2877739,"name":"New Yankee Shop Clock","overview":"Over the years, Norm has created several clocks for The New Yankee Workshop, most notably the tall case oak clock with an imported eight day movement (Item #0405) he built a couple of years ago. Now his interest turns to a shorter cased clock with a key wind spring movement that is housed in a walnut case. But the big difference is the painted glass panel that adorns the clock face and the clockworks below. Norm asks his project partner, the Klockit Company of Lake Geneva, Wisconsin, to come up with a facsimile of the famous New Yankee logo, which will be painted on the glass and through which the clock pendulum can be seen. The results are stunning and just the finishing touch for a workshop or any room in the house. Everybody who has seen it wants one.","production_code":"0605","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-11","episode_number":6,"episode_type":"standard","id":2877769,"name":"Router 101 (1)","overview":"A continuation of a series of tool-specific episodes that provide instruction and techniques for using a particular shop tool, this time, the router. This is part 1 of 2.","production_code":"0606","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-18","episode_number":7,"episode_type":"standard","id":2877774,"name":"Router 101 (2)","overview":"A continuation of a series of tool-specific episodes that provide instruction and techniques for using a particular shop tool, this time, the router. This is part 2 of 2.","production_code":"0607","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-25","episode_number":8,"episode_type":"standard","id":2877777,"name":"Corner Table","overview":"This project involves some considerable effort. At the suggestion of a friend who, with his colleagues, is trying to restore a historic river, Norm agrees to paddle a canoe over some rapids in search of some unusual white oak that's been submerged there for nearly 150 years. The oak Norm wants was used as a dam on Virginia's mighty Rappahannock River. Today it sits as a pile of salvage on the river's edge just hoping a woodworker floats by to rescue some of it for furniture projects.\n\nNorm engages Bill Jewell, a local sawyer of historical trees, to prepare this timber for the purpose of making a drop-leaved corner table, which Norm finds at nearby Kenmore House, a noted Fredericksburg mansion that was once owned by George Washington's sister.\n\nAfter Norm gets the wood to his shop, he spends considerable effort turning it into suitable pieces to make a copy of the original table - including the challenging turned legs that add so much style to this particular piece.","production_code":"0608","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-03-04","episode_number":9,"episode_type":"standard","id":2877781,"name":"Greek Revival Bookcase","overview":"While prowling a designer show house, Norm discovers a handsome collection of bookcases built in the Greek Revival tradition. Although they are made of plywood, every detail gives the appearance of solid tablets of white stone. The shelves resemble slabs of marble and the cornice on the tall case might have been carved from stone in the manner of a Greek temple. Glass doors enclose the lower bookcase element and swing on concealed European hinges. No mere bookcases here; they are worthy of your finest volumes and your most valued treasures.","production_code":"0609","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-03-11","episode_number":10,"episode_type":"standard","id":2877785,"name":"Storage Shed","overview":"Taking his cue from a pool house he finds on Nantucket, Norm creates a relatively simple, multipurpose structure so coveted by today's homeowners. It could be a garden shed, a place to store the outdoor furniture for the winter, a pool house, or a home for the family bicycles and yard machines. This 96-square foot building is the perfect size for many backyards and \"features\" low-maintenance materials that are expected to hold paint and resist weather. Best of all, it is attractive to look at and relatively easy to build.","production_code":"0610","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-03-18","episode_number":11,"episode_type":"standard","id":2877786,"name":"Wall Hung Console","overview":"We first found this item in a decorator show house and were impressed with its functionality and beauty. No more than a shelf really, it is fastened to the wall with massive decorative brackets. It is a perfect solution for displaying vases, candles, lamps, and other objects in a narrow space. Norm builds his out of mahogany.","production_code":"0611","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-03-25","episode_number":12,"episode_type":"standard","id":2877788,"name":"Corner Chair","overview":"Corner chairs go way back in the history of furniture. Some say their early popularity had to do with the convenience of those wearing swords who could sit on such a chair comfortably. During a visit to Historic New England, a preservation society, Norm is shown a number of variations on this classic form. Norm decides to build his chair out of cherry.","production_code":"0612","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-04-01","episode_number":13,"episode_type":"finale","id":2877793,"name":"Wall Paneling","overview":"In this program, Norm demonstrates how easy it can be to panel a wall. Norm begins by showing some wonderful examples of wall paneling techniques in a home restored several years ago by This Old House. At one end of the spectrum, Norm shows how simple moulding applied to a plain wall can create a paneled effect. Then, he moves back to the Workshop to show classic bead board paneling, raised panel systems and, finally, elegant mahogany paneling using veneer hardwood plywood and solid custom mouldings and trim.","production_code":"0613","runtime":30,"season_number":18,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 18","overview":"Norm builds a colonial-style mantel, plantation shutters, a poker table and wall-hung console out of mahogany, a walnut shop clock, a white oak corner table, a Greek revival bookcase, a storage shed, a cherry corner chair, and wall paneling.\n\nFor \"shop tools and techniques\", he spends two episodes demonstrating use of the router and he builds a roller stand, a stock cart, and a mobile tool stand.","id":88357,"poster_path":"/lNPurxKfe6rSIZN3xP3ahWKC4Gc.jpg","season_number":18,"vote_average":0},"19":{"_id":"5917adbcc3a368371b02c0b6","air_date":"2007-01-06","episodes":[{"air_date":"2007-01-06","episode_number":1,"episode_type":"standard","id":2877794,"name":"Giltwood Mirror","overview":"One of the most challenging projects ever attempted on The New Yankee Workshop comes when Norm tries his hand at reproducing a Federal-style Giltwood Mirror. It isn't the woodworking that is particularly difficult. Norm makes that part seem easy. It's trying to gild the mirror with gold leaf and make the frame appear as solid gold that takes time, patience, and lots of skill. Norm picks up the history of Giltwood and sees some remarkable examples when antiques expert Gary Sullivan discusses his collection. Then, Norm visits Linda Abrams a gilder and reverse painter for an understanding of what it takes to turn wood into gold.","production_code":"0701","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-13","episode_number":2,"episode_type":"standard","id":2877795,"name":"Entrance Door","overview":"It would be hard to think of a more important element of a home's appeal than its entranceway. But all too often, modern doors are an unremarkable (yet necessary) feature quickly forgotten by those who pass through them. Not so with this custom-made, mahogany beauty that Norm creates in The New Yankee Workshop. He designs and builds it from scratch for an old house that cries out for a new door. Along the way, he is able to find a pair of antique looking \"Bulls Eye\" glass inserts and a handsome brass knob and lock to set off this masterpiece.","production_code":"0702","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-20","episode_number":3,"episode_type":"standard","id":2877796,"name":"Old Pine Dry Sink","overview":"Arlington House sits high above the National Cemetery in Virginia as an imposing witness to historic events. Once the home of Robert E. Lee, it survives today under the watchful care of the National Park Service and is brimming with antiques of the Civil War era. Historic records prove that, at one time, the estate owned 63 slaves, some of whom worked in the kitchen. Lots of the tools and everyday objects they would have used still take up residence in the house, including a painted Old Pine Dry Sink. Norm notices it immediately and decides to build one himself out of recycled pine. However, the only water Norm's dry sink will ever see is from tending the houseplants he intends to display on its copper top.","production_code":"0703","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-27","episode_number":4,"episode_type":"standard","id":2877797,"name":"Martha's Candlestand","overview":"To see Martha Washington's bedroom, you'll have to talk to the Ladies of Mount Vernon, who look after the first President's mansion near the Potomac River. Although not officially on the tour of Mount Vernon, the Ladies agree to take Norm to parts of the old house that the public rarely sees. In one such room, the third floor bedroom that Martha took after George died, Norm comes across a handsome candlestand that sits near the bed. Upon further inspection, he discovers that it is a diminutive, wellcrafted stand complete with a wooden \"birdcage\" element that allows the tabletop to rotate and flip up for storage. Before he leaves Mount Vernon, Norm works with a sawyer of historic wood, William Jewell, to obtain some cherry (what else?) harvested from one of the estate's fallen trees.","production_code":"0704","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-02-03","episode_number":5,"episode_type":"standard","id":2877798,"name":"Dominy Clock","overview":"Without dispute, one of the greatest collections of American antiques resides at the Winterthur Museum in Delaware. One of the Museum's most popular displays, the original workshops of the Dominy family, quickly draws Norm's attention. The Dominys were clock and cabinetmakers who worked in eastern Long Island from the 1730s to the 1830s, creating high-quality clocks and furniture. Norm visits the exhibit and selects a clock, circa 1821, from the Dominy collection to reproduce back in the Workshop. Inspired by the Dominy clock, and up for the woodworking challenge, Norm builds his own simple tall case clock out of poplar and paints it to resemble the original.","production_code":"0705","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-02-10","episode_number":6,"episode_type":"standard","id":2877799,"name":"Cowboy Sideboard","overview":"Wyoming antiques dealer Terry Winchell wants everybody to know about the remarkable work of furniture designer Thomas Molesworth. In the 1930s, from his base in Cody, Wyoming, Molesworth created \"Cowboy\"-style furnishings made from peeled Douglas fir logs, stretched red leather, and routed out images of Indian teepees, animal tracks, and shooting irons. Dwight Eisenhower was a fan of this particularly distinctive dude ranch furniture, as was Thomas Yawkey (once the owner of Norm's beloved Red Sox). Today, Molesworth is very collectible, as Norm finds out when he visits Winchell at his operation in Jackson Hole. The ultimate New England craftsman brings a little bit of Western sensibility into his Yankee workshop when he decides to take on a Molesworth-style sideboard for his own collection.","production_code":"0706","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-02-17","episode_number":7,"episode_type":"standard","id":2877804,"name":"Painted Cupboard","overview":"Little is known about the handsome Painted Cupboard, which resides in one of the period rooms in the elegant country estate at the Winterthur Museum in Delaware. On a guided tour with Director of Conservation Gregory Landrey, Norm discovers the cupboard and is drawn to its scale, the unusual arched top door, and the \"pinched\" cornice that towers above the case. Norm will build his own version to the same dimensions back at The New Yankee Workshop and even matches the green blue paint on the exterior and the wine red color used for the interior.","production_code":"0707","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-02-24","episode_number":8,"episode_type":"standard","id":2877807,"name":"Table Saw 101 (1)","overview":"As with his previous programs dedicated to a single tool, Norm takes viewers on a special two-part program that explores the usefulness of the table saw. He begins by showing various table saws and what they can do and goes on to describe and demonstrate adjustments to make them more accurate. In the first program, he concentrates on the most common task a table saw will be asked to do - ripping. Norm discusses how to do it safely and accurately. He demonstrates his technique for cutting large panels and shows a safe way to handle narrow stock. He completes show number one by building an ingenious \"out feed\" table -- so clever every saw owner will want one.  This is part 1 of 2.","production_code":"0708","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-03-03","episode_number":9,"episode_type":"standard","id":2877808,"name":"Table Saw 101 (2)","overview":"As with his previous programs dedicated to a single tool, Norm takes viewers on a special two-part program that explores the usefulness of the table saw. He begins by showing various table saws and what they can do and goes on to describe and demonstrate adjustments to make them more accurate. In the second part of Table Saw 101, Norm goes on to demonstrate dadoing, setting up stacked dado cutters, the making of rabbets, and the building of a sacrificial fence. Then he turns to evaluating miter gauges and shows how they may be used to make precision miters. He demonstrates the process of making accurate tenons with a factory-built jig. In the same program, he builds a cross cut sled and a stop block that extends any table saw's potential. This is part 2 of 2.","production_code":"0709","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-03-10","episode_number":10,"episode_type":"standard","id":2877809,"name":"Taunton Chest","overview":"The Museum of Fine Arts, Boston is a treasure house of the first order that boasts remarkable collections of early American furniture, including some incomparable pieces by Goddard and Townsend, the famous Colonial-era Rhode Island furniture makers.\n\nNorm is drawn to a simple chest that is undergoing laboratory investigation at the museum. Known as the Taunton Chest, the piece was named for the Massachusetts town where Robert Crosman (1710-1799) built it nearly three hundred years ago. This highly decorated small chest is one of only a handful of Crosman originals that remain intact today. One like it was offered by Christie's Auction House not long ago and went for the amazing sum of close to three million.\n\nNorm builds his version out of poplar and calls on decorative artist Natalie Gardner to precisely copy the paintwork of the original design.","production_code":"0710","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-03-17","episode_number":11,"episode_type":"standard","id":2877810,"name":"Bowfront Chest","overview":"Recently, Norm, who is a trustee of the Old Sturbridge Village museum, asked the curators to put a stunning Bowfront Chest they had in storage on display in one of the Village's historic homes, the Salem Towne House, to inspire his New Yankee viewers. The stunning Bowfront four-drawer chest was built by Alden Spooner working in nearby Athol, Massachusetts in 1807. Spooner, like many furniture makers of the time, was probably well aware of pattern books and high-style designs being made in Europe and America, and this chest may well have been inspired by furniture brought here from Great Britain. Norm builds his version of mahogany and is challenged to form the French feet and the dovetailed Bowfront drawers. While not a project for a beginner, the Bowfront Chest will be of great interest to serious woodworkers.","production_code":"0711","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-03-24","episode_number":12,"episode_type":"standard","id":2877811,"name":"Nest of Tables","overview":"Prowling antiques stores for a suitable project for his own living room, Norm encounters Matt Buckley, an appraiser and antiques expert, who shows him an interesting Nest of Tables. Unlike anything else he has built on the show, Norm is intrigued by these three small mahogany tables that store into one another to form a \"nest\". The example that Matt shows Norm are likely to be English circa 1920 and are derived from the \"Chippendale\" style. Norm decides to build his own versions from walnut and mahogany and he reproduces the fine inlay details of the original.","production_code":"0712","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-03-31","episode_number":13,"episode_type":"finale","id":2877812,"name":"Window Bench","overview":"Gary Sullivan, an antiques expert and an old friend of The New Yankee Workshop, shows Norm an antique Window Bench probably built in the early 19th century. Although it doesn't appear to be in good condition with it's tattered upholstery, Gary tells Norm he wouldn't consider restoring this \"rare\" example of what he believes is a \"museum quality\" bench. \"You don't expect to see more than a handful of these in a lifetime,\" he explains to Norm. The simple bench is little more than an upholstered seat with two rolled arms on dark wooden legs. Such benches are meant to be used at a window to frame the view or, perhaps, at the end of a bed to sit and relax. Norm calls upon the experts at Lee Industries, the fine furniture manufacturers, who come up from their base in North Carolina to help Norm upholster his version of the Window Bench. The result is handsome and very comfortable.","production_code":"0713","runtime":30,"season_number":19,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 19","overview":"Norm builds a giltwood mirror, an entrance door and bowfront chest out of mahogany, an old pine dry sink, a cherry candlestand, a painted Dominy clock, a cowboy sideboard, a painted cupboard, a decoratively-painted taunton chest, a nest of tables, and an upholstered window bench.\n\nFor \"shop tools and techniques\", he spends two episodes demonstrating the use of the table saw.","id":88358,"poster_path":"/uj2piehgvS3EWulIG4AUq0WDDCO.jpg","season_number":19,"vote_average":0},"20":{"_id":"5917adc1c3a368423c03b433","air_date":"2008-01-05","episodes":[{"air_date":"2008-01-05","episode_number":1,"episode_type":"standard","id":2877813,"name":"Kitchen Cabinet Basics (1)","overview":"Norm remodels Russell Morash's kitchen. Here he gives the basics on kitchen cabinets. This is part 1 of 2.","production_code":"0801","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-12","episode_number":2,"episode_type":"standard","id":2877814,"name":"Kitchen Cabinet Basics (2)","overview":"Norm remodels Russell Morash's kitchen. Here he gives the basics of kitchen cabinets. This is part 2 of 2.","production_code":"0802","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-19","episode_number":3,"episode_type":"standard","id":2877815,"name":"The Hot Wall","overview":"Norm remodels Russell Morash's kitchen. Here he explains how to set up the \"hot wall\".","production_code":"0803","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-26","episode_number":4,"episode_type":"standard","id":2877816,"name":"The Wet Wall","overview":"Norm remodels Russell Morash's kitchen. Here he explains the basics of the \"wet wall\".","production_code":"0804","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-02","episode_number":5,"episode_type":"standard","id":2877817,"name":"The Pantry","overview":"Norm remodels Russell Morash's kitchen. Here he builds the pantry.","production_code":"0805","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-09","episode_number":6,"episode_type":"standard","id":2877818,"name":"The Kitchen Office","overview":"Norm remodels Russell Morash's kitchen. Here builds the \"kitchen office\".","production_code":"0806","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-16","episode_number":7,"episode_type":"standard","id":2877819,"name":"The Island","overview":"Norm remodels Russell Morash's kitchen. Here he builds the kitchen island.","production_code":"0807","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-23","episode_number":8,"episode_type":"standard","id":2877820,"name":"The Wet Bar","overview":"Norm remodels Russell Morash's kitchen. Here he constructs the wet bar.","production_code":"0808","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-01","episode_number":9,"episode_type":"standard","id":2877821,"name":"Finish and Install","overview":"Norm remodels Russell Morash's kitchen. Here he adds the finishing touches to the remodel and installs the appliances.","production_code":"0809","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-08","episode_number":10,"episode_type":"standard","id":2877822,"name":"Adirondack Trio","overview":"In the beginning of The New Yankee Workshop there was the Adirondack Chair (Season 2), a classic design updated by Norm. It became one of the most popular projects he ever did. Later, Norm added an Adirondack Love Seat (Season 14) to his collection, using improved methods and materials. Now, in celebration of the show's twentieth anniversary, Norm builds a chair, a table, and a footrest to complete the set. To add to the fun, Norm invites a friend to build one of these classic chairs alongside the master.","production_code":"0810","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-15","episode_number":11,"episode_type":"standard","id":2877824,"name":"All-Weather Loveseat","overview":"A popular trend finds folks sitting in cushioned comfort on sofas and chairs that are able to withstand all kinds of weather. Protected by tough all-weather fabrics, these cushions provide much more comfort than wood alone. Norm finds a beautiful example built in traditional teak and complimented by stunning fabric to reproduce for the New Yankee Collection.","production_code":"0811","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-22","episode_number":12,"episode_type":"standard","id":2877825,"name":"Lolling Chair","overview":"When reading the Declaration of Independence, no doubt some of our founding fathers would have chosen to sit in a favorite \"lolling\" chair. This kind of chair, with an upholstered seat and back, was popular then and has come down to us today as a classic form still much used and much loved. Antiques expert Gary Sullivan helps Norm with his research, and a professional shows him what's involved in the upholstery.","production_code":"0812","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-29","episode_number":13,"episode_type":"finale","id":2877826,"name":"Tap Table","overview":"Norm visits historic Portsmouth, New Hampshire to track down a table he wants to build on The New Yankee Workshop. At the famed Antiques Gallery of Ronald Bourgeault, he finds exactly what he's looking for; a table referred to as a \"tap\" table (short for tap-room). With its turned maple legs and round pine top, this historic specimen might well have served tavern guests in the mid-18th century. This particular \"tap\" table, with dimensions of 28\" round and 26\" tall, has splayed legs that connect with a Queen Anne style apron, supporting a well-worn top. Norm hopes to reproduce his version of this useful table right down to the original painted patina.","production_code":"0813","runtime":30,"season_number":20,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 20","overview":"Norm spends the first nine episodes performing a kitchen remodel for series creator, Russell Morash.  He also builds an Adirondack chair, table, and footrest, an all-weather loveseat, an upholstered lolling chair, and a Queen Anne-style tap table.","id":88359,"poster_path":"/5JWSZuM6yNVYqWQLuajPQPs98Ro.jpg","season_number":20,"vote_average":0},"21":{"_id":"5917adcc925141585203b3c2","air_date":"2009-01-03","episodes":[{"air_date":"2009-01-03","episode_number":1,"episode_type":"standard","id":1322272,"name":"Planter's Desk","overview":"Norm begins his search for low-country furniture projects in Savannahs famed Monterey Square at the home of antique map and print dealers, Virginia and John Duncan. On their veranda, Norm discovers a quintessential piece of the Old South, a planters desk. Once used by cotton and tobacco farmers for bookkeeping, the desk can function quite well today as a compact, home office. Featuring nicely tapered legs, a hinged desktop, and plenty of shelves, it also has enough room to accommodate a small computer. Back East in the New Yankee Workshop, Norm builds this piece out of recycled pine and finishes it with a new pastel stain to give it a pickled look.  NOTE: This is the same project as Season 9, Episode 1 with a new introduction by Norm Abram.","production_code":"0901","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-10","episode_number":2,"episode_type":"standard","id":1322273,"name":"Turkey Table","overview":"While touring Savannah, Norm found the inspiration for this unique piece in Marty Johnsons antique collection. Though its name remains a mystery, theres no question that its graceful three-leaf-clover design makes it an attractive and practical accent table. Norm brings a little bit of Georgia back to the New Yankee Workshop when he creates the table out of Southern heart pine. NOTE: This is same project as Season 9, Episode 2 with a new introduction by Norm Abram.","production_code":"0902","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-17","episode_number":3,"episode_type":"standard","id":1322274,"name":"Nantucket Settle","overview":"On a sojourn to the quaint New England island of Nantucket, Norm found a wonderful lidded settle that can double as extra storage space and a hallway showpiece. Norm crafts a rendition out of beautiful cherry wood and, in the process, demonstrates a variety of intermediate woodworking techniques including spindle-turning and how to make framed panels. NOTE: This is the same project as Season 9, Episode 3 with a new introduction by Norm Abram.","production_code":"0903","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-24","episode_number":4,"episode_type":"standard","id":1322275,"name":"Tiger Maple Washstand","overview":"This lovely washstand is true to the circa 1830 original found in the antique collection of Stanley and Jacqueline Levine of Savannah, Georgia. Featuring elegant scroll work, turned legs, and a generous shelf drawer, this vintage design can be used today as a night stand. Norm produces this piece out of fine tiger maple, making it one of the most sophisticated pieces in his collection of low-country furniture. NOTE: This is the same project as Season 9, Episode 4 with a new introduction by Norm Abram.","production_code":"0904","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-31","episode_number":5,"episode_type":"standard","id":2877831,"name":"Dough Box","overview":"In the 1800s, a dough box provided a warm hiding place for bread dough to rise. When Norm crafts his version of this simple design out of antique pine and adds a hinge to the lid, he turns it into a great-looking, modern-day, chest-on-legs. NOTE: This is the same project as Season 9, Episode 5 with a new introduction by Norm Abram.","production_code":"0905","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-07","episode_number":6,"episode_type":"standard","id":2877837,"name":"Garden Gate","overview":"Norm couldn't resist bringing the romantic design of this garden gateway back from a visit to a historic New England village. This ambitious outdoor project features a spindled gateway and is complemented by a pergola and a trellis that frames the garden view. Norm builds this outdoor project out of common, pressure-treated pine to ensure that it will last through years of sunshine, rain, and snow. In the process, he demonstrates how to join wood segments together with splines to form the elegant archway. NOTE: This is the same project as Season 9, Episode 6 with a new introduction by Norm Abram.","production_code":"0906","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-14","episode_number":7,"episode_type":"standard","id":2877839,"name":"Serving Trays","overview":"Norm takes viewers in to his favorite antique haunt on the quaint New England island of Nantucket where he discovers two distinctive wooden trays. Deeming them the perfect weekend woodworking projects, Norm crafts the more primitive fruit tray out of recycled pine, and, for the first time on The New Yankee Workshop, introduces the craft of metalsmithing when he fashions the cherry tray's hardware out of brass. NOTE: This is the same project as Season 9, Episode 7 with a new introduction by Norm Abram.","production_code":"0907","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-21","episode_number":8,"episode_type":"standard","id":2877841,"name":"Carousel Table","overview":"It's a great family gathering table and perfect for playing games with the kids, Norm claimed when he discovered the original in a private collection in Savannah. The ingenious design of this table features a lazy Susan centerpiece which can easily be removed for more formal gatherings. While building this piece out of salvaged pine, Norm shares his secrets for creating the spindle centerpiece with minimal hardware. NOTE: This is the same project as Season 9, Episode 8 with a new introduction by Norm Abram.","production_code":"0908","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-28","episode_number":9,"episode_type":"standard","id":2877844,"name":"Seven Drawer Chest","overview":"Norm spied this regal nineteenth-century English mahogany, seven-drawer chest in the back room of Alex Raskin's renowned antique shop on Monterey Square in Savannah. This well-proportioned, chest-on-chest features period brass hardware pulls, edge banding, and dovetail drawers. NOTE: This is the same project as Season 9, Episode 9 with a new introduction by Norm Abram.","production_code":"0909","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-07","episode_number":10,"episode_type":"standard","id":2877846,"name":"Hat Rack","overview":"Norm introduces viewers to the seventeenth-century craft of wood steaming when he creates this charming hat rack out of oak. To learn the proper techniques, Norm pays a visit to craftsman Mike Dunbar, a well-known Windsor chair builder and teacher. NOTE: This is the same project as Season 9, Episode 10 with a new introduction by Norm Abram.","production_code":"0910","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-14","episode_number":11,"episode_type":"standard","id":2877847,"name":"Greenhouse (1)","overview":"He may be America's favorite master carpenter, but Norm readily admits that he's a \"brown thumb,\" when it comes to gardening. This greenhouse is the perfect project for the serious backyard gardener (or someone who knows one) who is \"workshop bound\" for the winter. Norm fabricates this design out of redwood and polycarbonate panels. Built to withstand even the toughest weather conditions, this greenhouse provides enough insulation and light to sustain plants during the long winter months. This is part 1 of 2. NOTE: This is the same project as Season 9, Episode 11 with a new introduction by Norm Abram.","production_code":"0911","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-21","episode_number":12,"episode_type":"standard","id":2877848,"name":"Greenhouse (2)","overview":"He may be America's favorite master carpenter, but Norm readily admits that he's a \"brown thumb,\" when it comes to gardening. This greenhouse is the perfect project for the serious backyard gardener (or someone who knows one) who is \"workshop bound\" for the winter. Norm fabricates this design out of redwood and polycarbonate panels. Built to withstand even the toughest weather conditions, this greenhouse provides enough insulation and light to sustain plants during the long winter months. This is part 2 of 2. NOTE: This is the same project as Season 9, Episode 12 with a new introduction by Norm Abram.","production_code":"0912","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-28","episode_number":13,"episode_type":"standard","id":2877850,"name":"Fireplace Mantle","overview":"Between shooting The New Yankee Workshop and This Old House, Norm rarely has time to build anything for himself. And, like the rest of us, he readily admits his own home is \"a work in progress.\" So, Norm is taking this woodworking project home. With his own Rumford fireplace awaiting adornment, Norm takes the opportunity to design this classic Colonial fireplace mantel and builds it using a variety of woods and mouldings readily available at home centers nationwide. NOTE: This is the same project as Season 9, Episode 13 with a new introduction by Norm Abram.","production_code":"0913","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-04","episode_number":14,"episode_type":"standard","id":2877858,"name":"Irish Table","overview":"Viewers find Norm on the quaint New England island of Nantucket in an antique shop that specializes in Irish country furniture. There, he spies what he calls \"the perfect occasional table,\" an antique Celtic pine table with a thirty-six-inch round atop four graceful, tapered legs. Back in The New Yankee Workshop, Norm fashions his own version using recycled pine, and in the process demonstrates mortise-and-tenon joinery techniques and shows how to make a tapering jig. NOTE: This is the same project as Season 10, Episode 1 with a new introduction by Norm Abram.","production_code":"0914","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-11","episode_number":15,"episode_type":"standard","id":2877862,"name":"Linen Press","overview":"Norm asks, \"Have you ever noticed that most armoires and linen presses are too big to fit in today's rooms and look just right?\" However, in a private collection in Savannah, Georgia, he finds a beautiful antique linen press whose three-foot by six-foot size make it versatile enough to fit in almost any room. Featuring streamlined, raised-panel double doors with detail beading, its simple design seems almost modern. Back in The New Yankee Workshop, Norm recreates this piece out of recycled pine to give it a vintage look. NOTE: This is the same project as Season 10, Episode 2 with a new introduction by Norm Abram.","production_code":"0915","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-18","episode_number":16,"episode_type":"standard","id":2877868,"name":"Walnut Table","overview":"Norm travels to Savannah, Georgia, to meet Greg Guenther, a respected local craftsman known for his skills at making period furniture and for his restoration work of Historic Savannah mansions. In Guenther's private collection of period pieces, Norm spies a stunning nineteenth-century, black walnut, drop-leaf dining table with graceful turned legs. Before heading back to The New Yankee Workshop to recreate this heirloom piece, Norm joins Guenther in his workshop for a lesson on how to master a high-gloss finishing technique that enhances the natural beauty of wood. NOTE: This is the same project as Season 10, Episode 3 with a new introduction by Norm Abram.","production_code":"0916","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-25","episode_number":17,"episode_type":"standard","id":2877873,"name":"Library Ladder","overview":"Though a gardener friend uses his handsome antique library ladder to display a collection of vintage watering cans, Norm vows that it can also be used for more utilitarian purposes. He builds this intermediate woodworking project out of recycled, long leaf Southern yellow pine and in the process, demonstrates how to craft its defining feature - splayed legs joined by a hinged crossbar. NOTE: This is the same project as Season 10, Episode 4 with a new introduction by Norm Abram.","production_code":"0917","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-02","episode_number":18,"episode_type":"standard","id":2877877,"name":"Old Pine Bar","overview":"Norm builds his version of an antique Irish bar out of recycled pine and gives it a high gloss finish so indestructible that he dares any woodworker who builds it to \"leave a frosty mug on it.\" NOTE: This is the same project as Season 10, Episode 5 with a new introduction by Norm Abram.","production_code":"0918","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-09","episode_number":19,"episode_type":"standard","id":2877882,"name":"Morris Chair","overview":"In Arizona, Norm goes on a search for Arts and Crafts-style furniture in Tucson's Historic Arts District. Responding to the many viewer requests he receives each season to build more of the ever-popular Arts and Crafts-style projects, Norm ventures into the F.L. Wright Furniture Gallery where he finds a virtuoso example of the era-a classic, reclining Morris chair. Norm recreates this vintage design out of quarter-sawn white oak and in the process, shares his secrets for mastering the techniques required to build the chair's reclining back. NOTE: This is the same project as Season 10, Episode 6 with a new introduction by Norm Abram.","production_code":"0919","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-16","episode_number":20,"episode_type":"standard","id":2877884,"name":"Cupola","overview":"In a surprise twist, Norm opens this New Yankee Workshop from This Old House's recent job site in Milton, Massachusetts. While building a new \"dream workshop\" on the footprint of the old barn's demolished shell, Norm decides to replicate a version of the antique cupola that once adorned its roof back in The New Yankee Workshop. With help from coppersmith Larry Stearn, Norm recreates a copper-roofed version of the original design. Calling it a \"true carpentry project which entails every mitre box application,\" Norm expertly crafts the cupola's louvers and hip roof. NOTE: This is the same project as Season 10, Episode 7 with a new introduction by Norm Abram.","production_code":"0920","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-23","episode_number":21,"episode_type":"standard","id":2877886,"name":"Mesquite Bookcase","overview":"Norm's expedition to Arizona in search of Arts and Crafts-style furniture projects to build in The New Yankee Workshop leads him to Arroyo Design, a small custom furniture company in Tucson, where he spies a beautiful, glass-front bookcase inspired by the famous Greene Brothers. Featuring divided pane windows and the Greene Brothers' trademark square-peg detailing, its true artisan qualities make it one of the most sophisticated pieces in this season's collection. To ensure its heirloom value, Norm crafts this project out of mesquite and in the process educates viewers on how to work with this native Sonoran desert hardwood. NOTE: This is the same project as Season 10, Episode 8 with a new introduction by Norm Abram.","production_code":"0921","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-30","episode_number":22,"episode_type":"standard","id":2877888,"name":"Chop Saw Station","overview":"For any woodworker who aspires to have a home version of The New Yankee Workshop, Norm builds a portable chop saw station, an accessory that he promises will \"make your power mitre box much more versatile.\" This station can be used in the workshop or can be carted out to a job site to trim a house or to the backyard to build a deck. NOTE: This is the same project as Season 10, Episode 9 with a new introduction by Norm Abram.","production_code":"0922","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-06","episode_number":23,"episode_type":"standard","id":2877889,"name":"Whirligig","overview":"On a recent sojourn to Nantucket, Norm is invited to view a local antique dealer's private collection of children's toys and whimsical whirligigs. Inspired by their endearing humor, Norm decides to build his own mechanized version of The New Yankee Workshop's logo, featuring Norm, himself, working at the table saw. NOTE: This is the same project as Season 10, Episode 10 with a new introduction by Norm Abram.","production_code":"0923","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-13","episode_number":24,"episode_type":"standard","id":2877890,"name":"Chaise Lounge","overview":"Norm takes viewers on an adventure to Utah to witness the dismantling of a twelve-mile long railway trestle which was built at the turn of the century. Eventually progress and better engineering in the 1950s replaced this causeway, and the massive trestle wood pilings which once provided the means by which Southern Pacific was able to cross the Great Salt Lake were all but abandoned. Over years of disuse, the trestle wood, which is comprised of Douglas fir and redwood, eventually became so pickled by lake brine that its grain began to develop an unusual array of colors. Norm acquires some of this trestle wood to build his own outdoor chaise lounge design and in the process, learns quite a bit about current initiatives to harvest this unusual building material. NOTE: This is the same project as Season 10, Episode 11 with a new introduction by Norm Abram.","production_code":"0924","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-20","episode_number":25,"episode_type":"standard","id":2877901,"name":"Roll Top Desk (1)","overview":"Norm visits the Old Schwamb Mill in Arlington, Massachusetts. Built in 1860, the mill was purchased in 1864 by German immigrant woodworkers, Charles and Frederick Schwamb. The brothers did a brisk business crafting the oval picture frames which, at the time, were in demand to display photographs of Civil War soldiers. In the Schwamb Brother's old office, Norm spies a handsome, quarter-sawn oak roll top desk, which inspires him to build his version of this American classic. This is part 1 of 2. NOTE: This is the same project as Season 10, Episode 12 with a new introduction by Norm Abram.","production_code":"0925","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-27","episode_number":26,"episode_type":"finale","id":2877913,"name":"Roll Top Desk (2)","overview":"Norm visits the Old Schwamb Mill in Arlington, Massachusetts. Built in 1860, the mill was purchased in 1864 by German immigrant woodworkers, Charles and Frederick Schwamb. The brothers did a brisk business crafting the oval picture frames which, at the time, were in demand to display photographs of Civil War soldiers. In the Schwamb Brother's old office, Norm spies a handsome, quarter-sawn oak roll top desk, which inspires him to build his version of this American classic. This is part 2 of 2. NOTE: This is the same project as Season 10, Episode 13 with a new introduction by Norm Abram.","production_code":"0926","runtime":30,"season_number":21,"show_id":10086,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 21","overview":"The Final Season. The episodes in this season are rebroadcasts from Seasons 9 and 10 with new introductions by Norm Abram.","id":88360,"poster_path":"/nM7CC8qSvs7wDfe8z9cbL15PuMI.jpg","season_number":21,"vote_average":0}}}