{
    "adult": false,
    "backdrop_path": "/kVI5PxYUg5zuLP9eeo4HuYKcu70.jpg",
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2020-03-09",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "https://www.smithsonianchannel.com/shows/secrets-unlocked/1006411",
    "id": 103066,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2020-06-15",
    "last_episode_to_air": {
        "id": 2329003,
        "name": "Tower of Babel",
        "overview": "The Tower of Babel is one of the most dramatic stories in the Bible, an apocalyptic tale of the construction of a mighty stairway to heaven that was destroyed by the wrath of God. Now, an incredible discovery suggests that this immense structure wasn't simply a work of fiction, but existed in the legendary city of Babylon. Host Adam Mastrelli examines the mysteries of this lost wonder of the ancient world, the legendary King Nebuchadnezzar II who built it, and his prisoners of war, who may have inspired the biblical tale.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2020-06-15",
        "episode_number": 30,
        "episode_type": "finale",
        "production_code": "",
        "runtime": null,
        "season_number": 1,
        "show_id": 103066,
        "still_path": null
    },
    "name": "Secrets Unlocked",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 658,
            "logo_path": "/meU2LRnHcSr0m0Upx5loxHWETqF.png",
            "name": "Smithsonian Channel",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 30,
    "number_of_seasons": 1,
    "origin_country": [],
    "original_language": "en",
    "original_name": "Secrets Unlocked",
    "overview": "Join host Adam Mastrelli as he brings us face-to-face with the puzzling treasures of remarkable relics that are full of secrets, written in stone, gold, and blood. Explore hidden corners of the world, decipher ancient documents, and apply groundbreaking research and forensic techniques in our quest to discover the truth about these fabled cities, monuments, and remnants.",
    "popularity": 2.226,
    "poster_path": "/6XQXW4QpC4vi2bRjxaLSqWCInHE.jpg",
    "production_companies": [
        {
            "id": 18894,
            "logo_path": null,
            "name": "Smithsonian Channel",
            "origin_country": "US"
        }
    ],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2020-03-09",
            "episode_count": 30,
            "id": 150008,
            "name": "Season 1",
            "overview": "",
            "poster_path": "/6XQXW4QpC4vi2bRjxaLSqWCInHE.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 8,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "5eb19ffccdbaff001cb485b6",
            "air_date": "2020-03-09",
            "episodes": [
                {
                    "air_date": "2020-03-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2258442,
                    "name": "Garden of Eden",
                    "overview": "The Garden of Eden, the Bible's most famous story, is considered by many to be an allegory about where humanity originated. But to some there is the possibility that this place exists on Earth. Now, the discovery of an archaeological wonder in southeast Turkey may hold the secret to the location of Adam and Eve's Paradise on Earth. Guided by host Adam Mastrelli, we investigate the oldest monumental structure ever built and see how it has revolutionized our understanding of prehistoric nomads.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/l5ZaFzx0wdlj2yPQB5p1rellCFW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-09",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2258460,
                    "name": "Jonah and the Whale",
                    "overview": "On a mission to erase history, ISIS obliterated the shrine of the biblical prophet Jonah in Mosul, Iraq and may have inadvertently revealed the historical reality behind one of the Old Testament's most mysterious stories. Discover how an opportunity born out of the destruction of war helped archaeologists unearth new truths about the tale of Jonah and the Whale. Once dismissed as fiction, new evidence suggests that the prophet, the wicked king he warned to repent, and the original \"Sin City\" of Nineveh, may have been real.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/r3MvcwJIvxtLK3SyNBNVXB3k20g.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-16",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2271591,
                    "name": "Shrunken Heads",
                    "overview": "Thousands of shrunken heads are in museums around the world, some on display, and others locked away. Shockingly, many of them are real human heads. But what is the true story behind this strange and disturbing phenomenon? Host Adam Mastrelli reveals how a team of anthropologists, historians, and scientists are answering these questions by using modern forensic science and advanced computer modeling. Join us as we uncover the dark tale behind this ancient ritual.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/sT3mWATA4z0cTfS4iKRENI1hqm4.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-16",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2271592,
                    "name": "Ark of the Covenant",
                    "overview": "The story of the Ark of the Covenant goes back many centuries. According to the Bible, it was built by the Israelites at God's command 3,000 years ago to hold stone tablets engraved with the original Ten Commandments, then vanished 500 years later from Jerusalem--and from history. Host Adam Mastrelli guides us through an international investigation, where teams sift through evidence and hunt for physical clues to prove if the ark was real and to determine if it still exists today.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/7kZQnmXLKnkaTNz8GPbPud1oy7C.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-23",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2271593,
                    "name": "The Copper Scroll",
                    "overview": "A team of archaeologists discovered a 2,000-year-old scroll in 1952 in a cave near the ruins of an ancient settlement, Qumran. It was classified as a Dead Sea Scroll, but with two distinct differences: it was made of copper and it did not contain biblical text. Instead, it gave clues to what may be the biggest hoard of treasure ever buried. A team of experts travels to the Holy Land to visit the cave where the metal scroll was discovered, investigate \"ghost\" inscriptions about the Colosseum, and determine if the riches were ever found.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/uYTrYdsl5zf1uPQfS9olNC2aHVi.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-23",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2271594,
                    "name": "The Turin Shroud",
                    "overview": "Few objects in history have been more closely studied or caused as much controversy as the Turin Shroud. Is it a hoax made by a master craftsman, or could it be the world's oldest photograph? Join host Adam Mastrelli as he follows two experts who are exploring two radically different theories, using groundbreaking research and archaeological expertise. Their theories may differ, but they share one goal: to decode a treasure that has been revered, rejected, and argued about for over 600 years.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/7DKyHnIpWjxb8Bu9jWtW1B5iBds.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-30",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2271595,
                    "name": "King Solomon's Mines",
                    "overview": "He was painted as a wise king who amassed a fortune in the Old Testament. His name was Solomon, and for centuries, historians have been on the hunt for the source of his legendary wealth. Now, recent discoveries in Israel's Timna Valley have revealed that the industrial-scale complex is actually 200 years younger and could have made King Solomon rich. Have archaeologists found proof that his mines are real? Host Adam Mastrelli takes us inside the state-of-the-art investigation.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/yoTUfpzU1FUIHtGk6FsOOPp7PZX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-30",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2271596,
                    "name": "Spear of Destiny",
                    "overview": "Before it landed in a museum in Vienna, the Spear of Destiny had a long and fascinating history...at least according to legend. Claims that it pierced Jesus' side, was carried into battle by Charlemagne, and was coveted by Hitler have made for captivating stories. But is there merit to any of them? Host Adam Mastrelli follows a team of experts as they examine ancient texts and scrutinize the spear, layer-by-layer, through x-ray fluorescence technology.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/eEdIofR3jpxJs4Cro5zPeZyr6zJ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-06",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2271598,
                    "name": "Plagues of Egypt",
                    "overview": "The Ten Plagues of Egypt, as detailed in the Bible's Book of Exodus, features rivers of blood, swarms of locusts, and days of darkness. Now, new discoveries suggest these supernatural events were real natural phenomena, all caused by one catastrophic disaster: a volcanic eruption in Santorini, Greece. Follow a team of archaeologists and scientists to the ruins of an ancient Egyptian temple and the crater of a colossal volcano as they unlock secrets of biblical proportions.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/h29OC6rwi7caxP3uQTqkiE5o5dK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-06",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2271600,
                    "name": "The Holy Grail",
                    "overview": "The quest for the Holy Grail has consumed knights and crusaders and inspired legendary tales and blockbuster films. Could the epic search finally be over? A church in Spain says they have found the sacred chalice, but some experts believe this is just the latest in a long line of false claims. Join host Adam Mastrelli as we trace the extraordinary story behind Christianity's ultimate relic, using forensic and historic analysis to help solve this 2,000-year-old mystery.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-13",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2271602,
                    "name": "Beasts of the Pharaohs",
                    "overview": "Hierakonpolis, one of the ancient world's forgotten cities, was only of passing interest to most archaeologists. That changed with the discovery of a prehistoric cemetery containing Egypt's first kings and the remains of wild and exotic animals. Follow scientists as they unlock the secrets of this 6,000-year-old cemetery, secrets that are redefining everything scholars thought they knew about Egypt in the time before the pharaohs.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-13",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 2271606,
                    "name": "Great Pyramid",
                    "overview": "The Great Pyramid of Giza is the oldest and largest tomb ever built in Egypt, the most ambitious construction project of the ancient world, and one of history's greatest mysteries. How was it built by a Bronze Age society that only had simple hand tools at their disposal? Follow Egyptologist Mark Lehner and engineer Peter James as they attempt to solve this puzzle, armed with a radical new approach and a 4,500-year-old diary that gives an eyewitness account of the monument's construction.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-20",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 2271610,
                    "name": "The Sphinx",
                    "overview": "The Sphinx is one of the largest, most iconic monuments of the ancient world--and one of the most puzzling. For thousands of years, the mythic statue, with the body of a lion and the head of a man, has captivated and confounded tourists, historians, and the Egyptian people themselves. Why was it built? When was it built? Who built it? Follow a team of investigators as they use the latest research and techniques in an attempt to solve the complex riddle of the Sphinx once and for all.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-20",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 2271612,
                    "name": "Nefertiti",
                    "overview": "Nearly one million visitors from around the world visit the Neues Museum in Berlin every year to see the bust of the ancient Egyptian Queen Nefertiti. Pulled from the ground in 1912, this object is one of the world's most famous works of art. But some experts believe it's a fake. Host Adam Mastrelli traces the history of the statue and the woman behind it. See how modern-day forensics and analysis are revealing new truths about the queen and the masterpiece she inspired.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-27",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 2271613,
                    "name": "Tut's Tomb",
                    "overview": "Since its discovery a century ago, archaeologists have been trying to unlock the secrets of King Tut's tomb, but many questions remain about whom the crypt was built for. Many of the 5,400 objects found inside seem to be made for a female, but who could this mystery woman be, and what was her relationship to the Boy King? Where do her remains lie? Experts journey to the Valley of the Kings and attempt to answer these puzzling mysteries.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-27",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 2271615,
                    "name": "Egypt's Lost Princess",
                    "overview": "In 2011, an astounding discovery was made in Egypt's Valley of the Kings: the first finding of a sealed burial since Tutankhamun's treasure trove nearly a century ago. But more remarkable than the discovery is what archaeologists found inside: a 3,000-year-old crime scene involving a dismembered princess and an additional coffin dated from a different era. Follow scientists as they use modern forensics to unearth the royal tomb's secrets and expose a hidden history of robberies and revolution.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-04",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 2271619,
                    "name": "Egypt's Lost City",
                    "overview": "Ramesses II was the most powerful pharaoh to rule Egypt, and his construction of a new capital city, Pi-Ramesses, was his crowning achievement. It was the biggest building program since the pyramids, but somehow, this metropolis completely vanished from history. What happened? Where did it go? And where was it built to begin with? Join host Adam Mastrelli as we follow the brilliant detective work that may have uncovered the mysterious fate of this magnificent city.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-04",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 2271626,
                    "name": "The Pharaoh in the Suburbs",
                    "overview": "Until recently, the Egyptian pharaoh known as Psamtik I was just a footnote in history. That all changed when archaeologists stumbled upon the remnants of a massive statue made in his honor in a Cairo suburb. Host Adam Mastrelli shows how this remarkable find has led to the rediscovery of a game-changing ruler, who rescued his crumbling country from vicious invaders and brought a new golden era to ancient Egypt. It's a discovery that has restored the great legacy of a forgotten pharaoh.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-04",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 2271631,
                    "name": "Riddle of Petra",
                    "overview": "What made Petra's people abandon their city after surviving Roman occupation, massive earthquakes, and a flood?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-11",
                    "episode_number": 20,
                    "episode_type": "standard",
                    "id": 2271632,
                    "name": "America's Lost Pyramid",
                    "overview": "What destroyed America's first great empire? Was it a drought? A civil war? Or a natural disaster of biblical proportions?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-11",
                    "episode_number": 21,
                    "episode_type": "standard",
                    "id": 2271633,
                    "name": "Stonehenge Mystery",
                    "overview": "Was Stonehenge built to be an observatory, a cathedral, or a mass grave?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-18",
                    "episode_number": 22,
                    "episode_type": "standard",
                    "id": 2271637,
                    "name": "Bog Bodies",
                    "overview": "From Ireland to Denmark, dozens of ancient bog bodies have been discovered, spread across hundreds of square miles of cold wetlands. These corpses tell a story of brutal death and mysterious rituals during Northern Europe's Iron Age. For decades, there were few explanations for why these people were so violently killed. Now, utilizing state-of-the-art techniques used by police to solve modern murders, archaeologists are starting to crack these 2,000-year-old cold cases, while discovering new insights into this enigmatic period of world history.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-18",
                    "episode_number": 23,
                    "episode_type": "standard",
                    "id": 2310238,
                    "name": "Headless Gladiators of York",
                    "overview": "In 2004, a grim discovery was made at an excavation site in the historic city of York, England: a mass grave containing dozens of young male skeletons, all ritualistically buried. Archaeologists believe they may have unearthed a cemetery of battle-hardened gladiators. If they're right, it will rewrite the history of the Romans in Britain. Join host Adam Mastrelli as we study the bones and remains found at the site and analyze their DNA in an attempt to reveal new insights about this dark side of the Roman Empire.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-25",
                    "episode_number": 24,
                    "episode_type": "standard",
                    "id": 2310239,
                    "name": "Easter Island",
                    "overview": "The stone giants of Easter Island are some of the most recognizable statues on Earth, and some of the least understood. How were hundreds of these enormous figures built, and why? And what sent them toppling to the ground? Join host Adam Mastrelli and a team of experts as they gather evidence on the island in an attempt to understand one of the most mysterious civilizations in the world. Then see how one statue carried away by treasure seekers may help researchers decode what really happened on Easter Island.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-25",
                    "episode_number": 25,
                    "episode_type": "standard",
                    "id": 2310240,
                    "name": "Hunt for Atlantis",
                    "overview": "Around 360 B.C., the Greek philosopher Plato recorded the legend of Atlantis, the great civilization swallowed by the sea. For centuries, adventurers and archaeologists have searched far and wide for the lost city. But now, an international team of experts has uncovered evidence of an epic catastrophe that wiped out a technically advanced and wealthy Mediterranean civilization 3,500 years ago. Could it be the fabled city of Atlantis? Host Adam Mastrelli details the cataclysmic event that changed history and inspired a myth.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": "/g37GaEEwPzzOOtSZcMsvcux1cb0.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-01",
                    "episode_number": 26,
                    "episode_type": "standard",
                    "id": 2310241,
                    "name": "Grave of the Vikings",
                    "overview": "In November 2012, in the small town of Fregerslev, Denmark, a discovery was made at a construction site that stunned the archaeological world. Hundreds of exquisitely decorated pieces from a thousand-year-old horse's bridle. Forensic analysis pointed to this being the resting place of an eminent Viking warrior during a crucial point in history. Join the excavation as a team of scientists attempts to reveal the secrets of a tomb full of golden riches, a missing body, and evidence of the beginning of the end of the Viking Age.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-01",
                    "episode_number": 27,
                    "episode_type": "standard",
                    "id": 2310242,
                    "name": "A Viking Map?",
                    "overview": "According to many experts, the Vinland map was created 50 years before Christopher Columbus sailed west, but amazingly, it features the coast of North America. If it's authentic, it would rewrite history as we know it. Join the investigation as our experts look for clues in the fabric of the map. They'll test a theory that the document is based on Viking maps created centuries before Columbus was born, and they'll name a 1930s scholar who some claim faked the whole thing. Finally, we reveal the true story, thanks to a stunning 2018 discovery.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-08",
                    "episode_number": 28,
                    "episode_type": "standard",
                    "id": 2310243,
                    "name": "Golden Raft of El Dorado",
                    "overview": "The legend of El Dorado has fascinated explorers since the days of the Spanish Conquistadors and sparked what may be the bloodiest gold rush in history. The mythical lost city of gold was inspired by an opulent ancient Colombian tribe, and while the culture has disappeared, an invaluable relic of theirs--a small golden raft statue--lives on. Host Adam Mastrelli tracks a team of metal experts and archaeologists as they study this artifact in hopes of unlocking the secrets of this fabled city and discovering the truth of a vanished civilization.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-08",
                    "episode_number": 29,
                    "episode_type": "standard",
                    "id": 2310244,
                    "name": "Blackbeard's Ship",
                    "overview": "Blackbeard's ship, Queen Anne's Revenge, was once the most feared vessel ever to sail the high seas. In May 1718, she sank off the North Carolina coast, bringing an end to her six-month reign of terror. Now, nautical archaeologists, historians, and scientists are studying the remains of a wreckage believed to be the infamous flagship. Host Adam Mastrelli tracks their quest to answer a 300-year-old question: Was Queen Anne's Revenge the victim of an accident...or sabotage committed by Blackbeard himself?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-15",
                    "episode_number": 30,
                    "episode_type": "finale",
                    "id": 2329003,
                    "name": "Tower of Babel",
                    "overview": "The Tower of Babel is one of the most dramatic stories in the Bible, an apocalyptic tale of the construction of a mighty stairway to heaven that was destroyed by the wrath of God. Now, an incredible discovery suggests that this immense structure wasn't simply a work of fiction, but existed in the legendary city of Babylon. Host Adam Mastrelli examines the mysteries of this lost wonder of the ancient world, the legendary King Nebuchadnezzar II who built it, and his prisoners of war, who may have inspired the biblical tale.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 103066,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 150008,
            "poster_path": "/6XQXW4QpC4vi2bRjxaLSqWCInHE.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    }
}