{"adult":false,"backdrop_path":"/d8OHzAqX92FigTmaMQtqv3ZSB6n.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2020-05-11","genres":[{"id":10764,"name":"Reality"}],"homepage":"https://www.foodnetwork.com/shows/amy-schumer-learns-to-cook","id":103088,"in_production":false,"languages":["en"],"last_air_date":"2020-09-07","last_episode_to_air":{"id":2418549,"name":"Amy's Steakhouse Dinner and BBQ","overview":"Amy is ready to show off her chef skills by taking the lead and attempting to cook her favorite meal -- a classic steakhouse dinner featuring Seared Skirt Steak and Creamed Spinach. They finish off the meal with Amy's perfect childhood dessert, Baked Cinnamon and Sugar Bites. Chris and Amy then take the show outside and fire up the grill for a BBQ lunch featuring a refreshing Watermelon Vodka Punch, Lobster Rolls, Grilled Pork Chops and Grilled Artichokes with Lemon Butter.","vote_average":0,"vote_count":0,"air_date":"2020-09-07","episode_number":4,"episode_type":"finale","production_code":"","runtime":null,"season_number":2,"show_id":103088,"still_path":null},"name":"Amy Schumer Learns to Cook","next_episode_to_air":null,"networks":[{"id":143,"logo_path":"/aKkZnTIGTn92sUODLxqP8ZmgyIA.png","name":"Food Network","origin_country":"US"}],"number_of_episodes":8,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Amy Schumer Learns to Cook","overview":"Amy and Chris are quarantined at home in Martha's Vineyard with their nanny, who looks after baby Gene and runs the camera during naptimes. Chef Chris is on a mission to use this quarantine to teach his wife to cook and Amy is ready, and for the most part willing, to learn.","popularity":2.867,"poster_path":"/nIRM09IZSyFIBOME51RalNgWMj1.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2020-05-11","episode_count":4,"id":150087,"name":"Season 1","overview":"","poster_path":"/nIRM09IZSyFIBOME51RalNgWMj1.jpg","season_number":1,"vote_average":0},{"air_date":"2020-08-17","episode_count":4,"id":159464,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Reality","vote_average":1,"vote_count":1,"season_data":{"1":{"_id":"5eb25db20b7316001c434f60","air_date":"2020-05-11","episodes":[{"air_date":"2020-05-11","episode_number":1,"episode_type":"standard","id":2258930,"name":"Breakfast Time and Late-Night Eats","overview":"Comedian and actress Amy Schumer begins her culinary education where most people begin the day: breakfast! While Amy mixes up an old-fashioned, Chris shows her how to make a perfectly poached egg, crispy bacon, celery and fennel salad and some applesauce for their son, Gene. Chris and Amy also channel her Jewish roots to fry up some homemade latkes. Then Chris teaches Amy how to make some of her favorite late-night treats, and Amy teaches Chris how to make the perfect Moscow mule. While Amy sips her cocktail, she learns the secrets to homemade fried rice, chicken wings and peanut butter cup cookies. Amy also reveals her favorite thing to eat in bed: matzo with butter.","production_code":"","runtime":null,"season_number":1,"show_id":103088,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-18","episode_number":2,"episode_type":"standard","id":2258931,"name":"Lunch Break and Pasta Night","overview":"Chef Chris Fischer, Amy Schumer tries her hand at making two comfort food staples: sandwiches and tacos. Amy starts the meal off right with a tinto de verano and a walk down memory lane. After they wax nostalgic about their trip to Spain and all the tintos they drank there, Chris teaches Amy the art of the perfect sandwich and panzanella salad. After lunch, it's time for taco night. Amy learns how to make tempura-battered fish tacos, guacamole with pea shoots and rice, and Chris learns how to make the perfect paloma.","production_code":"","runtime":null,"season_number":1,"show_id":103088,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-25","episode_number":3,"episode_type":"standard","id":2258932,"name":"Brunch and Taco Night","overview":"As the quarantine continues, Amy Schumer and her husband, Chef Chris Fischer, decide the only possible cure for the lockdown blues is a good, old-fashioned carbo load. Amy mixes peach bellinis while Chris walks her through perfectly fried eggs with shallots and spinach, pork sausage and pancakes. Then, Chris candies his favorite vegetable, fennel, for a sweet scone. The couple's ode to carbs continues as Amy pours a large glass of wine and Chris teaches her to make two kinds of pasta, radish and sweet pea crostini and a refreshing crab, tomato and avocado salad.","production_code":"","runtime":null,"season_number":1,"show_id":103088,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-01","episode_number":4,"episode_type":"finale","id":2293594,"name":"Brunch and Leftovers","overview":"With Amy and Chris still in lockdown at home they are making brunch. Amy mixes the Peach Bellinis while Chris walks her through Fried Eggs with Shallots, Spinach, some Pork Sausage and Pancakes. Then, Chris candies his favorite vegetable fennel for a perfectly baked sweet scone. Amy and Chris have been loading up on groceries, so it is time to move into the leftover phase. Amy makes Chris a comforting Hot Toddy to get through the day, while Chris uses their leftovers to make Mashed Potatoes, Warm Radish and Potato Salad with a Tonnato Dressing and the world’s biggest Frittata.","production_code":"","runtime":null,"season_number":1,"show_id":103088,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":150087,"poster_path":"/nIRM09IZSyFIBOME51RalNgWMj1.jpg","season_number":1,"vote_average":0},"2":{"_id":"5f3b72691c043500368c67bb","air_date":"2020-08-17","episodes":[{"air_date":"2020-08-17","episode_number":1,"episode_type":"standard","id":2393264,"name":"Fresh, Not Frozen and Kids Menu","overview":"Chris decides to teach Amy how to make some of her favorite frozen foods from scratch. While Amy gets things going with a Pina Colada, Chris shows Amy how to make crowd-pleasing Pigs in a Blanket and Pot-Stickers, before capping things off with homemade Potato Skins. Then, Amy and Chris discover that everything on the kid's menu is fun for adults, too. They kick things off with a Frozen Hot Chocolate, as Chris teaches Amy how to make Ricotta Pancakes with a shocking but undetectable amount of broccoli. The pair also hide some veggies in a refreshing Couscous Salad and hearty Meatballs.","production_code":"","runtime":null,"season_number":2,"show_id":103088,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-08-24","episode_number":2,"episode_type":"standard","id":2401973,"name":"Picnic and Unlimited Soup and Salad","overview":"Amy Schumer and her husband, Chef Chris Fischer, pack a picnic lunch to take advantage of the summer weather. Amy starts off with a Margarita \"to go\" while Chris makes Pesto Pasta Salad, a Chicken Cutlet BLT and Brownies for dessert. The pair makes a refreshing Watermelon and Celery Root Salad, with Chris swearing that celery root is the new fennel. Then Chris and Amy celebrate the humble soup and salad combo. While they sip Sazerac cocktails, Chris shows Amy how to make a Kale and Anchovy Salad and a comforting bowl of Chicken Noodle Soup that's main course-worthy. Chris then takes the \"new fennel\" out for a test drive and creates a satisfying Celery Root and Yogurt Soup, and Amy makes an enormous original salad that is heavy on the bacon and cheese.","production_code":"","runtime":null,"season_number":2,"show_id":103088,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-08-31","episode_number":3,"episode_type":"standard","id":2409912,"name":"Takeout Favorites and Finger Foods","overview":"Amy and Chris crack open one of their favorite beers and attempt to recreate their favorite NYC takeout meals. Chris teaches Amy how to make Scarpetta's famous Spaghetti and Tomato Sauce, along with Amy's favorite Chinese takeout pick -- Shrimp in Lobster Sauce with Rice. Chris and Amy finish the day by tackling homemade sushi where they both discover it's not as intimidating as it seems. Amy and Chris then sip Gin and Tonics as they wax nostalgic about the cocktail parties of the past and decide to make an assortment of finger foods. Chris whips up some perfect party staples like Pizza Bagels and Grilled Cheese, with the pair finishing the meal with a summery and refreshing Green Gazpacho.","production_code":"","runtime":null,"season_number":2,"show_id":103088,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-09-07","episode_number":4,"episode_type":"finale","id":2418549,"name":"Amy's Steakhouse Dinner and BBQ","overview":"Amy is ready to show off her chef skills by taking the lead and attempting to cook her favorite meal -- a classic steakhouse dinner featuring Seared Skirt Steak and Creamed Spinach. They finish off the meal with Amy's perfect childhood dessert, Baked Cinnamon and Sugar Bites. Chris and Amy then take the show outside and fire up the grill for a BBQ lunch featuring a refreshing Watermelon Vodka Punch, Lobster Rolls, Grilled Pork Chops and Grilled Artichokes with Lemon Butter.","production_code":"","runtime":null,"season_number":2,"show_id":103088,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":159464,"poster_path":null,"season_number":2,"vote_average":0}}}