{"adult":false,"backdrop_path":"/vOwzPlX7u7CARvugdio0BaCJvfv.jpg","created_by":[{"id":64849,"credit_id":"5258002619c29531db3509c6","name":"Todd McFarlane","gender":2,"profile_path":"/fG0NF6gKK0lBwJTtTPXzp4e4yp8.jpg"}],"episode_run_time":[25],"first_air_date":"1997-05-16","genres":[{"id":10759,"name":"Action & Adventure"},{"id":16,"name":"Animation"},{"id":18,"name":"Drama"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"http://www.spawn.com/entertainment/spawnanimated","id":10331,"in_production":false,"languages":["en"],"last_air_date":"1999-05-28","last_episode_to_air":{"id":423595,"name":"Prophecy","overview":"The Hellspawn stands closer to his destiny. He lies caught between two forces, Heaven and Hell, a prisoner in a scheme that is not his own.   Heaven's bounty hunters appear outside the sanctuary. Spawn learns that if he does not reclaim his humanity, Wanda is in danger because when Spawn made love to her, he made her a pawn in the game, a weapon in the war. Spawn is confused. Cog is enraged.\n\nIt is the prophecy. Hellspawn would plant his seed in a human woman. A child would be born. That child would decide the outcome of armageddon. The final battle between Heaven and Hell!\n\nMalebolgia has tricked Spawn again. It was never about him. It was always about the prophecy, and the child Spawn would bring into the world.\n\nDowntown Officers Sam and Twitch are dealing with their own double-cross. Somebody shot Twitch in the head. At first they thought Spawn was the assailant. Now they know it was an inside job. Chief Banks tries to throw up a smoke screen by telling Sam that an investigation is un","vote_average":0,"vote_count":0,"air_date":"1999-05-28","episode_number":6,"episode_type":"finale","production_code":"","runtime":25,"season_number":3,"show_id":10331,"still_path":null},"name":"Spawn","next_episode_to_air":null,"networks":[{"id":49,"logo_path":"/tuomPhY2UtuPTqqFnKMVHvSb724.png","name":"HBO","origin_country":"US"}],"number_of_episodes":18,"number_of_seasons":3,"origin_country":["US"],"original_language":"en","original_name":"Spawn","overview":"Todd McFarlane's Spawn is an animated television series which aired on HBO from 1997 through 1999. It is also released on DVD as a film series. It is based on the Spawn comic series from Image Comics, and was nominated for and won an Emmy in 1999 for Outstanding Animation Program. An unrelated series titled Spawn: The Animation is in production since 2009, with Keith David reprising his role as the titular character. Like the comic book, the series features graphic violence, sexual scenes, and extensive use of profanity. Todd McFarlane's Spawn was ranked 5th on IGN's list of The Greatest Comic Book Cartoons Of All Time.","popularity":51.327,"poster_path":"/sKZR2IIrPPo2LnMdYfxvOlXFls7.jpg","production_companies":[{"id":3268,"logo_path":"/tuomPhY2UtuPTqqFnKMVHvSb724.png","name":"HBO","origin_country":"US"},{"id":23364,"logo_path":null,"name":"Todd McFarlane Entertainment","origin_country":""}],"production_countries":[],"seasons":[{"air_date":null,"episode_count":11,"id":20393,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"1997-05-16","episode_count":6,"id":20390,"name":"Season 1","overview":"","poster_path":"/ecA3fyDo06EVvbIKCFnfbi3OQ59.jpg","season_number":1,"vote_average":0},{"air_date":"1998-05-15","episode_count":6,"id":20391,"name":"Season 2","overview":"","poster_path":"/2dUi8Pr8d5zklnIYGZY1n9Gt93n.jpg","season_number":2,"vote_average":0},{"air_date":"1999-05-23","episode_count":6,"id":20392,"name":"Season 3","overview":"","poster_path":"/or6sogEFWz9UaQ2hVyrUT8weJkY.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.873,"vote_count":232,"season_data":{"1":{"_id":"5258002319c29531db3505b4","air_date":"1997-05-16","episodes":[{"air_date":"1997-05-16","episode_number":1,"episode_type":"standard","id":423577,"name":"Burning Visions","overview":"His name is Spawn. Spawn knows death. He is a dead man returned to the living by the forces of Hell. What he doesn't know is who or what he is now.","production_code":"","runtime":25,"season_number":1,"show_id":10331,"still_path":"/zoyvCXd30SziNORGg12kOEqTAMz.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"6277cf26aa659e0050df13a4","adult":false,"gender":2,"id":56452,"known_for_department":"Writing","name":"Alan B. McElroy","original_name":"Alan B. McElroy","popularity":4.21,"profile_path":"/uUVDalBQ2kwrlzCcZL9HaN45XsU.jpg"}],"guest_stars":[{"character":"","credit_id":"5258002319c29531db3505ed","order":501,"adult":false,"gender":2,"id":780,"known_for_department":"Acting","name":"Ronny Cox","original_name":"Ronny Cox","popularity":8.88,"profile_path":"/cKkVkqft2RacSDhsKxO8nMFgeAd.jpg"}]},{"air_date":"1997-05-23","episode_number":2,"episode_type":"standard","id":423578,"name":"Evil Intent","overview":"Child killer, and demon in training Bill Kincaid, murders again and dumps the body in the alley where Spawn has found a home among the homeless.","production_code":"","runtime":25,"season_number":1,"show_id":10331,"still_path":"/vU1repUUV7NcD1rQOOEe4LdAcXl.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"6277cf26aa659e0050df13a4","adult":false,"gender":2,"id":56452,"known_for_department":"Writing","name":"Alan B. McElroy","original_name":"Alan B. McElroy","popularity":4.21,"profile_path":"/uUVDalBQ2kwrlzCcZL9HaN45XsU.jpg"}],"guest_stars":[{"character":"","credit_id":"5258002319c29531db3505ed","order":501,"adult":false,"gender":2,"id":780,"known_for_department":"Acting","name":"Ronny Cox","original_name":"Ronny Cox","popularity":8.88,"profile_path":"/cKkVkqft2RacSDhsKxO8nMFgeAd.jpg"}]},{"air_date":"1997-05-30","episode_number":3,"episode_type":"standard","id":423579,"name":"No Rest, No Peace","overview":"Spawn meets Cogliostro and demands to know what the old man knows about who he is and why he is here.","production_code":"","runtime":25,"season_number":1,"show_id":10331,"still_path":"/Aiho50pNus3Y3sTilxzWabH0JkI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-06-06","episode_number":4,"episode_type":"standard","id":423580,"name":"Dominoes","overview":"While Spawn waits for the next event in the battle between Heaven and Hell, Antonio Twistelli tries to make amends with the big man after the destruction of Overkill.","production_code":"","runtime":25,"season_number":1,"show_id":10331,"still_path":"/7zUIFqsxhACopE6sge87uefycKg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-06-13","episode_number":5,"episode_type":"standard","id":423581,"name":"Souls in the Balance","overview":"Warriors can feel forces massing against them. The agonizing wait for battle becomes a way of life, turning and twisting their dark souls. Feeding tense rage that boils deep within every Hellspawn. They rage at the unfairness of their plight.   Rat City. A crazed STREET PREACHER holds a boy against his will. His weapons are his madness and his body wrapped in grenades. Several cops are blown to shreds helplessly trying to free the boy from the preachers grasp. An angry cop takes out his frustration on Gareb. Spawn is forced to intercede, and violently attacks the rampaging officer. Angered by the cops abuse of power, he leaves the cop pinned to a wall as a message to others.\n\nMeanwhile, Jason Wynn's political puppet, Senator McMillian is hard on the campaign trail. Wynn is unhappy with several of the Senator's political moves and suggests that he follow his directions more closely. Wynn has a strangle hold on the senator and the senator must obey. To make matters worse Wynn has caught w","production_code":"","runtime":25,"season_number":1,"show_id":10331,"still_path":"/A6LeH450sreoYzFpJB2GCx367YD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-06-20","episode_number":6,"episode_type":"finale","id":423582,"name":"End Games","overview":"After torturing a stool-pigeon, Spawn learns that it was Antonio Twistelli who kidnapped Cyan while at the safe house. But Tony's boys have lost the girl to the deadly hands of Billy Kincaid. News of the screw-up travels fast and Jason Wynn confronts Senator McMillian about Billy's actions. McMillian denies any knowledge of his killer son's doings, and both men are left wondering who could be behind it.   Wynn believes the senator has nothing to do with the interference and is convinced that there are other players in the mix who are screwing with his plans. He sends Chapel off to track down the weapon thief, while he concocts his next move. Meanwhile, Antonio Twistelli prepares to leave town knowing that losing the child will cause him a great deal of trouble. But before he can leave, Spawn descends out of the darkness and makes the fat mob boss talk. All Spawn gets out of him is a physical description of Billy and that he drives an ice-cream truck.\n\nDowntown, Twitch has uncovered the","production_code":"","runtime":25,"season_number":1,"show_id":10331,"still_path":"/wAVFtBDjsQMe4SteqbHXG1oBOum.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":20390,"poster_path":"/ecA3fyDo06EVvbIKCFnfbi3OQ59.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258002319c29531db3505bf","air_date":"1998-05-15","episodes":[{"air_date":"1998-05-15","episode_number":1,"episode_type":"standard","id":423584,"name":"Home, Bitter Home","overview":"Where do the dead belong in the world of the living? For this newest Spawn, moments of peace never come.   Winter. Memories of his life as Al Simmons continue to haunt Spawn as more and more realizations about who he was and what he did come into view. Of the most painful is the realization that Al Simmons was murdered and burned by his partner, a fellow mercenary known as Chapel. This realization is one that Clown takes great joy in as he persists in taunting, haunting and tormenting the anguished Hellspawn, trying to push him over the edge.\n\nMeanwhile, Jason Wynn continues his climb for more and more power as he sells his illegal arms to both sides of civil wars, and plots his next sinister move. Among his many concerns are the stolen weapons that were taken by Spawn. The weapons are a loose end that are traceable to Wynn, an oversight he cannot afford to let slip through the cracks. To insure the guns safe return, Chapel is sent to track down the thief, return the arsenal and kill th","production_code":"","runtime":25,"season_number":2,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-05-22","episode_number":2,"episode_type":"standard","id":423585,"name":"Access Denied","overview":"Spawn is tortured, and tormented by relentless dreams of Terry sleeping with Wanda. Nightmares where the two of them are happy to be rid of Al Simmons, happy that he's dead. They are the distorted fever dreams of a Hellspawn twisted by the ugly hand of Clown and his boss, Malebolgia. Clown tries to get Spawn to blame Terry for stealing his wife, and ruining his life. Clown will do anything to prod the Hellspawn and turn him into the evil leader of the damned that he was born to be.   Meanwhile, Terry is being framed by Jason Wynn because of the private investigation that Terry has been running in order to expose Wynn for selling illegal arms to outlaw countries. The frame-job is clever and air-tight. Terry is in deep trouble. To make matters worse, Wynn sends MERRICK, a company assassin to kill Fitzgerald. Spawn is there every step of the way, tracking Terry, and putting down the hit-men as he goes. He doesn't want anybody else to kill Fitzgerald, because Spawn wants him for himself.\n\nD","production_code":"","runtime":25,"season_number":2,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-05-29","episode_number":3,"episode_type":"standard","id":423586,"name":"Colors of Blood","overview":"Wynn's search for the missing Terry Fitzgerald continues. He sits and meets with Wanda, while outside Merrick and a team of killers waits to ambush Terry when he arrives home. Terry tries to call his wife, but hears Jason is there and hangs up. Confused, panicked, and on the run, Terry wanders not knowing what his next move will be.   Back in the alley, drug dealers have invaded and are terrorizing the Spawn protects. Burke and Twitch try to roust the dealers, but have little. It is only after the dealers brutally murder one of the residence of the alley that the Spawn, reluctant to be a hero, becomes involved. One by one the Hellspawn eliminates the dealers until only the leader is left. In a final act of poetic justice, Spawn leaves the lead dealer to the mercy of the inhabitants of Rat City.\n\nHas this Hellspawn found some scrap of humanity within himself? Or is this the act of a predator whose territory has been invaded? Has his basic instinct to kill taken hold of him? He knows he h","production_code":"","runtime":25,"season_number":2,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-06-05","episode_number":4,"episode_type":"standard","id":423587,"name":"Send in the KKKlowns","overview":"A sick and twisted killer who answers to the master, Malebolgia is on a mission of death. The killer is stalking the city in search of minorities and murdering them in the name of cleansing. Little does Spawn know, but this and other evil men are in his mist. They are drawn to the alley because of him. Drawn to the sound of Malebolgia'a whisper. Drawn to the evil that lurks in the shadows.   Meanwhile, Wynn is relentlessly pursuing Terry Fitzgerald and keeping a close eye on Wanda in case the traitor shows up to see her. Merrick is convinced that Wanda knows where he is and demands that she be allowed to get the truth out of her. Wynn will not allow it. Instead, he plans to get close to Wanda, have dinner with her, and gain her trust. Maybe then she will let Wynn know where Terry is hiding.\n\nAfter Wanda contacts Terry, Wynn gets suspicious and sends men to follow her. Spawn has been watching the whole time and when the agents try to attack Wanda, the Hellspawn acts. Spawn takes out the","production_code":"","runtime":25,"season_number":2,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-06-12","episode_number":5,"episode_type":"standard","id":423588,"name":"Death Blow","overview":"Jason Wynn is spooked. Some outside force is tampering with his business. He tells Merrick to hire agents outside the agency to track Terry Fitzgerald. Merrick wants to do it herself, but Wynn refuses. Things are getting too close for comfort. He wants to keep the dirty work separate. Merrick begrudgingly agrees to follow the bosses orders.   Washington Post reporter LISA WU has stumbled onto story of her life, maybe the story of the decade when she began investing the death of two reporters murdered in Rat City. Her investigation leads her to Senator McMillian, Billy Kincaid and then, strangely to Wanda Blake and her daughter Cyan, Billy's last victim who was rescued. Is there a connection between all of these parties? Lisa intends to find out and she will start with Wanda Blake, and the alley. She manages to bribe some of the inhabitants of the alley and discovers Spawn's hidden weapons, and gets a hot tip on someone named Al.\n\nThe police are in an uproar. Too many bodies are showing","production_code":"","runtime":25,"season_number":2,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-06-19","episode_number":6,"episode_type":"finale","id":423589,"name":"Hellzapoppin","overview":"Now, it is Jason Wynn who is the haunted man. His schemes are crumbling. His sleep is an endless series of nightmarish visions. He is convinced that he is being called by an evil force and somehow he finds comfort in its familiarity. But the comfort is short lived when a visitor comes to his tower office for a visit. The visitor is Spawn. He has come to Wynn to issue a warning, and show the evil Wynn a glimpse of Hell. But before the visit is concluded Wynn wakes and finds it was all a dream. Or was it?   In the alley Spawn and Cogliostro argue. Cogliostro tries to tell Spawn to forget about his former life. It is time for the Hellspawn to forget the past and worry about the future. He tells Spawn that he and Wynn are entangled. That Malebolgia has always guided both their lives. Spawn demands that the old man say who he is and Cogliostro confesses that the dark one, Malebolgia was once his master too. He knows that if Spawn kills Wynn he will deliver Wynn to the fold and in turn, do M","production_code":"","runtime":25,"season_number":2,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":20391,"poster_path":"/2dUi8Pr8d5zklnIYGZY1n9Gt93n.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258002319c29531db3505ca","air_date":"1999-05-23","episodes":[{"air_date":"1999-05-23","episode_number":1,"episode_type":"standard","id":423590,"name":"The Mindkiller","overview":"Within every Hellspawn, a battle is waged. What scraps of humanity can they hold on to? What master do they serve?   A withered man crawls among the bugs in a cell muttering, don't let the demons take you. In the alley, a battle takes place within Spawn's tormented mind. Cogliostro is aware of the battle. He has was once a Hellspawn himself and he tells Spawn that he must choose which master he serves. For as long as Spawn lives a life of violence, he serves Malebolgia.\n\nFour street punks, Petey, Bobbie, Frankie and their college-going friend Joey are out for a night on the town. But things have changed. The youths are on the verge of becoming men, and for some men, this change comes with the spilling of blood. After a hit, Joey panics and says he'll go to the cops. Now he must be killed as well, and the task is handed to Frankie, Joey's best friend. It's a test. Kill the potential squealer, become a man.\n\nSpawn and Cogliostro attempt to intercede. Spawn wants the punks gone. Cogliostro","production_code":"","runtime":25,"season_number":3,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-05-24","episode_number":2,"episode_type":"standard","id":423591,"name":"Twitch Is Down","overview":"How does one find humanity in an alley? How does one regain one's soul...   An abandoned church. Memories rip through Spawn's fragmented mind. Frustrated with his plight, the Hellspawn lashes out, and then turns his rage toward the alley in search of the old man Cogliostro, the man with the answers. The old man, once a Hellspawn himself, attempts to guide Spawn. The old man reveals that he was the Black Knight and was also known as Merlin. He tells Spawn that the curse can be broken, but Spawn must first accept who and what he is, and abandon the red cloak.\n\nMeanwhile, Jason Wynn is doing some investigating of his own. Using his crooked chief Banks, Wynn probes the appearance of a red cloaked man in the alley. Wynn wants the cloaked man found. The cops at the center of the investigation are Sam and Twitch. Bank orders the duo to find the red cloaked man at all costs. But the cops and Wynn aren't the only ones on the trail of the Hellspawn. There is another, a reporter named Lisa Wu.\n\nSam","production_code":"","runtime":25,"season_number":3,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-05-25","episode_number":3,"episode_type":"standard","id":423592,"name":"Seed of the Hellspawn","overview":"Twitch lies wounded in his hospital bed, his memory as shattered as his brain. The blame for the shooting has been shifted to Spawn when in fact the shooter is Chief Banks, a Jason Wynn puppet. Spawn finds sanctuary from the streets with Cogliostro who reluctantly tells Spawn that his scarlet shroud can be used to turn the Hellspawn into any form he requires, including human. In human form Spawn attempts to visit Wanda, but instead, a wise blind woman, Granny, knows that the mysterious visitor is her daughters dead husband. Has he come back as an angel, or curse?   Twitch tries to remember who shot him while Wynn reams Banks for botching the hit. If Twitch remembers that the chief was the trigger man, then the cesspool of Wynn's corruption could be exposed. But the walls are closing in. Terry Fitzgerald has contacted NSC investigators and hands over information that could bring down Wynn for good. As Wynn's world crumbles and collapses, an old friend calls in and informs Jason of Terry","production_code":"","runtime":25,"season_number":3,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-05-26","episode_number":4,"episode_type":"standard","id":423593,"name":"Hunter's Moon","overview":"The full moon illuminates the scum of Spawn Alley as a predator pimp beats on one of his hookers. Spawn watches the incident and remembers his own violent past. He remembers when Wanda found his guns and all he could think to do was strike her. Has he always been a creature of violence? Did Malebolgia choose correctly when he changed him to a Hellspawn?   The pimp attempts to seduce a lost innocent named Lilly. But the beautiful girl's innocence is as tenuous as her claws are sharp. In a blink, the pimps men are mangled, snapped and broken and their veins drained of blood. Again, Spawn is blamed. Twitch, who has begun to come around, knows Spawn has nothing to do with these murders. The bullet to his head has erased Twitches memory, but now the cop is having strange visions. Visions that tell him nothing human killed the pimps lackeys.\n\nCogliostro learns of Spawns disguised seduction of Wanda and curses the Hellspawn for his lack of honor. Spawn is quick to point out that Cog was a Hell","production_code":"","runtime":25,"season_number":3,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258002419c29531db350761","order":500,"adult":false,"gender":1,"id":10431,"known_for_department":"Acting","name":"Jennifer Jason Leigh","original_name":"Jennifer Jason Leigh","popularity":28.163,"profile_path":"/9nT2mbQ9P8UpCXirssDxDT75jlm.jpg"}]},{"air_date":"1999-05-27","episode_number":5,"episode_type":"standard","id":423594,"name":"Chasing the Serpent","overview":"Before hell swindled his life, mercenary Al Simmons ventured into the heat of the jungle to retrieve Major Forsberg, a fallen soldier who sought sanctuary in a hidden temple to escape the horrors of war. Sent by Jason Wynn, Simmons mission was to bring Forsberg back to him alive if possible, dead if necessary. It does not matter that Forsberg is a trusted friend. Orders are orders. Simmons betrays his friend without regret.   Cogliostro tells Spawn these memories have meaning. They are defining moments in Al Simmons destiny as a pawn of Malebolgia. Spawn claims he did not know what Wynn meant to do with Forsberg, but Cogliostro knows better. What neither is aware of is that Wynn has kept the major alive for all of these years in an opium den, in a cell where Forsberg rots. Now Wynn has come to visit the major in his cell and Wynn wants to know about a mask that was in the temple when he was captured. It is the war mask of Genghis Khan. The mask possesses great power, and Wynn wants it.","production_code":"","runtime":25,"season_number":3,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-05-28","episode_number":6,"episode_type":"finale","id":423595,"name":"Prophecy","overview":"The Hellspawn stands closer to his destiny. He lies caught between two forces, Heaven and Hell, a prisoner in a scheme that is not his own.   Heaven's bounty hunters appear outside the sanctuary. Spawn learns that if he does not reclaim his humanity, Wanda is in danger because when Spawn made love to her, he made her a pawn in the game, a weapon in the war. Spawn is confused. Cog is enraged.\n\nIt is the prophecy. Hellspawn would plant his seed in a human woman. A child would be born. That child would decide the outcome of armageddon. The final battle between Heaven and Hell!\n\nMalebolgia has tricked Spawn again. It was never about him. It was always about the prophecy, and the child Spawn would bring into the world.\n\nDowntown Officers Sam and Twitch are dealing with their own double-cross. Somebody shot Twitch in the head. At first they thought Spawn was the assailant. Now they know it was an inside job. Chief Banks tries to throw up a smoke screen by telling Sam that an investigation is un","production_code":"","runtime":25,"season_number":3,"show_id":10331,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258002319c29531db3505ed","order":501,"adult":false,"gender":2,"id":780,"known_for_department":"Acting","name":"Ronny Cox","original_name":"Ronny Cox","popularity":6.264,"profile_path":"/cKkVkqft2RacSDhsKxO8nMFgeAd.jpg"},{"character":"","credit_id":"5258002519c29531db35079d","order":502,"adult":false,"gender":1,"id":60739,"known_for_department":"Acting","name":"Kath Soucie","original_name":"Kath Soucie","popularity":10.331,"profile_path":"/62hvT4USvGa9OAsMP9guIBtJqkf.jpg"}]}],"name":"Season 3","overview":"","id":20392,"poster_path":"/or6sogEFWz9UaQ2hVyrUT8weJkY.jpg","season_number":3,"vote_average":0}}}