{
    "adult": false,
    "backdrop_path": null,
    "created_by": [],
    "episode_run_time": [
        45
    ],
    "first_air_date": "2019-04-23",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "",
    "id": 105501,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2020-08-04",
    "last_episode_to_air": {
        "id": 2400520,
        "name": "Gods and Monsters",
        "overview": "Clive Anderson and Mary-Ann Ochota investigate rude Viking graffiti, sinister burials, and potent potions, looking to solve 34,000 years of mystic mysteries, from King Arthur to Nessie and the Wicker Man.",
        "vote_average": 6,
        "vote_count": 1,
        "air_date": "2020-08-04",
        "episode_number": 10,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 45,
        "season_number": 2,
        "show_id": 105501,
        "still_path": null
    },
    "name": "Mystic Britain",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 658,
            "logo_path": "/meU2LRnHcSr0m0Upx5loxHWETqF.png",
            "name": "Smithsonian Channel",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 20,
    "number_of_seasons": 2,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Mystic Britain",
    "overview": "Enter a world of mummies, witches, zombies, and shamans as we explore Britain's mysterious sites and mystic past.",
    "popularity": 1.459,
    "poster_path": "/28o8BMqp1PUiXX2I4BpSzztxKLY.jpg",
    "production_companies": [
        {
            "id": 23918,
            "logo_path": "/vZpEEA112GUCdbR1P68LZAMbA4J.png",
            "name": "Blink Films",
            "origin_country": "GB"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2019-04-23",
            "episode_count": 10,
            "id": 155159,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 6
        },
        {
            "air_date": "2020-05-26",
            "episode_count": 10,
            "id": 160235,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 6.6
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 8.3,
    "vote_count": 3,
    "season_data": {
        "1": {
            "_id": "5efc282dbe7f350032a3e47c",
            "air_date": "2019-04-23",
            "episodes": [
                {
                    "air_date": "2019-04-23",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2332401,
                    "name": "Witches and Demons",
                    "overview": "In the Middle Ages, evil was thought to be everywhere. From peasants to kings, the people of Britain believed devils and witches stalked the land, causing chaos, bad fortune, and tens of thousands of deaths. Hosts Clive Anderson and Mary-Ann Ochota examine this time of superstition, magic, and fear. Follow them as they visit an ancient church in the village of Troston marked with medieval demonic symbols.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-30",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2400502,
                    "name": "The Rollright Witch",
                    "overview": "England's Rollright Stones, located on the borders of Oxfordshire and Warwickshire, are among the oldest and most mystic monuments in Britain and have captured people's imaginations for thousands of years. For some, they mark the spot of an unseen natural energy source. For others, they are the home of fairies dancing on summer evenings. Hosts Clive Anderson and Mary-Ann Ochota visit this mystic site and Long Compton to meet residents and examine ancient artifacts in hopes of separating the facts from centuries of mystery and myth.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-07",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2400503,
                    "name": "Hadrian's Mystic Wall",
                    "overview": "At the start of the first millennium, the Roman Empire invaded Britain with an army that was organized and armed to the teeth with modern weapons. But they feared the ancient Brits were magical savage cannibals, and so they built a barrier that separated the docile south from these mystical northern natives: Hadrian's Wall. Visit the empire's most impressive legacy in Britain, which still stands today, and discover its surprising carvings, used to enhance Rome's performance during this epic, supernatural battle.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-14",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2400504,
                    "name": "The Revenants",
                    "overview": "In 1963, archaeologists discovered a pit full of human bones in a preserved medieval village in Yorkshire. Some were dismembered, some were burnt, and all were buried here for a specific reason. Now, our hosts dig through old records and use the latest forensic technology to determine if these corpses were killed in battle, were the result of human sacrifice or cannibalism, or were mutilated to stop them from coming back from the dead.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-21",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2400505,
                    "name": "The Pagan Prince",
                    "overview": "It was supposed to be a routine excavation of a small traffic island in Essex, but it turned into a remarkable archaeological find. The 2003 discovery of an ancient pagan burial chamber revealed a treasure trove of artifacts from the Dark Ages and one shocker: gold foil crosses that predate the arrival of Christianity to the region by nearly 20 years. Was this the tomb of a trailblazer for the religion that would dominate Britain for the next 1,400 years? And if so, what did it mean for the Anglo-Saxon gods that dominated the landscape?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-28",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2400506,
                    "name": "Mummies",
                    "overview": "When we think of mummies, our minds usually turn to ancient Egypt and its bandage-wrapped pharaohs and queens. But as Clive Anderson and Mary-Ann Ochota explore Britain's mystic past, they discover a very different type of mummy, created by smoke, salty sea caves, and bogs. Journey across the United Kingdom as we examine bones from the Bronze Age, revealing strange puppet skeletons, bodies with bits missing, and even a macabre marionette.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-04",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2400507,
                    "name": "Human Sacrifice",
                    "overview": "The U.K. was a hotspot for human sacrifice about 2,000 years ago, and it apparently went beyond simple ritualistic killings. There was cannibalism as well. What was going on during Britain's Iron Age and what drove its people to commit such barbaric executions? Follow hosts Clive Anderson and Mary-Ann Ochota as they travel from the hill forts of Maiden Castle to a cave in South Gloucestershire to uncover the reasons behind these gruesome rituals, to detail the various methods of murder, and to reveal who these unfortunate victims were. Visit seaside caves, grassy castles, and a Lego Iron Age village as we hunt down evidence of human sacrifice in Britain.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-11",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2400508,
                    "name": "Ice Age Shaman",
                    "overview": "Yorkshire, England is a town known for its pudding, cricket, and--so it seems--Mesolithic shamans. Clive Anderson and anthropologist Mary-Ann Ochota examine a treasure trove of ancient wonders found at an archaeological site in Star Carr, including headdresses, tools, and weapons made from deer skulls, bones, and antlers. They also find evidence of the oldest houses ever built in Britain, proving that our 11,000-year-old Ice Age ancestors were a lot more sophisticated than previously believed. They attempt to commune with the old gods as they investigate Britain's Ice Age shamans.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-18",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2400509,
                    "name": "Secrets of Stonehenge",
                    "overview": "Explore one of Britain's best known but most mysterious sites and consider new theories about why Stonehenge was really built. Ancient Britons made a huge circle using stones that had been dragged 180 miles from Wales 5,000 years ago. Five hundred years later, they introduced the mighty sarsen stones, creating the Stonehenge we know today. All these years later, questions still remain: who built it and why? Is it magical? A religious temple? A celestial clock? Did druids build it? By Merlin? Hosts Clive Anderson and Mary-Ann Ochota are determined to get answers and reveal the hidden secrets of the stones.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-25",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 2400510,
                    "name": "Time Tripping",
                    "overview": "Host Clive Anderson and Mary-Ann Ochota are on a trip through time and across the U.K. to examine the sacred sites, supernatural beliefs, and strange rituals of the ancient Britons. Their journey will take them from Ice Age shamanism treasure troves to Stone Age mysteries like the Rollright Stones and Stonehenge to Iron Age tales of human sacrifice to Middle Age zombies and witches. It's a wild 10,000-year trip to uncover the lives and beliefs of our distant ancestors from the unsettling to the utterly surprising.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 155159,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 6
        },
        "2": {
            "_id": "5f438f9181a7fc0036110661",
            "air_date": "2020-05-26",
            "episodes": [
                {
                    "air_date": "2020-05-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2400511,
                    "name": "Lost Tribe of Scotland",
                    "overview": "Clive Anderson and Mary-Ann Ochota try to find out why an ancient warrior tribe mysteriously vanished, and uncover an epic tale of Vikings, giants and the Loch Ness Monster.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-09",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2400512,
                    "name": "Mystery of the White Horse",
                    "overview": "Of all the ways Britain's ancestors have left their mark on the land, none are as impressive or as baffling as the giant carvings cut into the chalklands of Southern England. Chief among them is a White Horse, a 360-foot, mysterious piece of land art steeped in legend, folklore, and magic. Join Clive and Mary-Ann as they translate the subtleties of ancient texts, party with local pagans, and explore the horse's mystical power to pull generations and communities together, all in an attempt to discover who built this incredible creature and why.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-16",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2400513,
                    "name": "The Monster of Maeshowe",
                    "overview": "The Maeshowe runes in Northern Scotland have been a great mystery for many millennia. To the Neolithic people, the ancient monument was a burial chamber. To the Vikings, it was the home of vast treasures. And to Victorians, it was the lair of Hogboon, a powerful ancestral Norse spirit. Join Clive and Mary-Ann as they travel the Orkney Islands through 5,000 years of myth and history to uncover the true story of Maeshowe. It's a journey that will bring them into a world of legendary monsters, Christmas zombies, and sounds that drove hardened warriors insane.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-23",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2400514,
                    "name": "Isle of Druids",
                    "overview": "Clive Anderson and Mary-Ann Ochota explore Anglesey, consider cannibalism and face the fiery Wicker Man.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 6,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-30",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2400515,
                    "name": "Mystery of the Red Lady",
                    "overview": "Clive Anderson and anthropologist Mary-Ann Ochota journey back 34,000 years to investigate a mysterious set of red bones and wind up hunting for woolly mammoths and zombies.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-07-07",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2400516,
                    "name": "The Quest for King Arthur",
                    "overview": "Clive Anderson and Mary-Ann Ochota seek the real King Arthur, exploring ancient castles, casting spells, wielding magical swords and meeting with a real Merlin.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-07-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2400517,
                    "name": "Legend of the Warrior Queen",
                    "overview": "In 60 AD, Queen Boudica emerged from nowhere to lead the fight against the Romans. It turned her into a legend.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-07-26",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2400518,
                    "name": "Leeches, Plagues and Potions",
                    "overview": "Clive Anderson and Mary-Ann Ochota test outrageous remedies like leeches, head-drilling, and a pigeon that cures the plague. Plus, Henry VIII's role in Tudor medicine.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 6,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-07-28",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2400519,
                    "name": "The Sand Bodies of Sutton Hoo",
                    "overview": "Clive Anderson and Mary-Ann Ochota investigate Britain's sinister mysteries - decapitated bodies in gruesome poses, warrior kings with tiny heads and `killer' cake.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-04",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 2400520,
                    "name": "Gods and Monsters",
                    "overview": "Clive Anderson and Mary-Ann Ochota investigate rude Viking graffiti, sinister burials, and potent potions, looking to solve 34,000 years of mystic mysteries, from King Arthur to Nessie and the Wicker Man.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 105501,
                    "still_path": null,
                    "vote_average": 6,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 160235,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 6.6
        }
    }
}