{"adult":false,"backdrop_path":"/8Ep5ppQvqFvaMQrX3ENmM4jpNPI.jpg","created_by":[],"episode_run_time":[25],"first_air_date":"2003-04-06","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"},{"id":35,"name":"Comedy"},{"id":10751,"name":"Family"}],"homepage":"https://www.tv-tokyo.co.jp/anime/sonic_x","id":10926,"in_production":false,"languages":["ja"],"last_air_date":"2005-04-18","last_episode_to_air":{"id":440633,"name":"So Long Sonic","overview":"After the galaxy is saved, Sonic and his friends recalls memorable moments and anticipate their future.","vote_average":0,"vote_count":0,"air_date":"2005-04-18","episode_number":26,"episode_type":"finale","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/jhNUxBYRGo0FGo6ioCG44FZcbWN.jpg"},"name":"Sonic X","next_episode_to_air":null,"networks":[{"id":98,"logo_path":"/1oTje9uOhRcuLSAc8ERn0cnG51i.png","name":"TV Tokyo","origin_country":"JP"},{"id":2445,"logo_path":"/et3ZqCUvzqGVFIs6OiPlw2rxRbc.png","name":"Jetix","origin_country":"FR"}],"number_of_episodes":78,"number_of_seasons":3,"origin_country":["JP"],"original_language":"ja","original_name":"ソニックX","overview":"Sonic and his friends team up with 12 year old Christopher to collect all the Chaos Emeralds and defeat the evil Dr. Eggman.","popularity":61.145,"poster_path":"/mudrU2unvo34g65WvCrFRz2GSpc.jpg","production_companies":[{"id":3034,"logo_path":"/kGRavMqgyx4p2X4C96bjRCj50oI.png","name":"TV Tokyo","origin_country":"JP"},{"id":31029,"logo_path":"/hJBg4AKIAV0FdP6dFt4akwvOysY.png","name":"Sonic Team","origin_country":"JP"},{"id":7164,"logo_path":"/vHsaqTkQ2ZTbdqrCA272YahoVlg.png","name":"TMS Entertainment","origin_country":"JP"},{"id":113750,"logo_path":"/A3QVZ9Ah0yI2d2GiXUFpdlbTgyr.png","name":"SEGA","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":null,"episode_count":17,"id":21315,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2003-04-06","episode_count":26,"id":21312,"name":"Season 1","overview":"","poster_path":"/kP6kmJgy2hPDdAEasvIdFh6okXH.jpg","season_number":1,"vote_average":1},{"air_date":"2003-10-05","episode_count":26,"id":21313,"name":"Season 2","overview":"","poster_path":"/s6SPXKslkbQE3iBWyWdNQLVuAyR.jpg","season_number":2,"vote_average":0},{"air_date":"2005-03-12","episode_count":26,"id":21314,"name":"Season 3","overview":"","poster_path":"/sZe6IQ8dhe7bcDxcExaUzbfpAcc.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.579,"vote_count":254,"season_data":{"1":{"_id":"525808d419c29531db3db5d4","air_date":"2003-04-06","episodes":[{"air_date":"2003-04-06","episode_number":1,"episode_type":"standard","id":440574,"name":"Chaos Control Freaks","overview":"Sonic busts into Chaos Control to stop Eggman from using the Seven Chaos Emeralds and save his friends Cream and Cheese.He screws though and it sends Sonic, Knuckles, Amy, Tails, Cream and Cheese to another world!! Sonic is confused by his surroundings. People are stunned at seeing a Blue Hedgehog! They all try to catch him but Sonic's to stubborn and quick for them. So anyway Sonic goes off and running from the police.He then encounters Sam Speed and the S-Team! Sam Speed trys to catch Sonic but he's to quick for him! Now Sonic is even toying with them!Sam has no choice but to use his Nitro. Sonic is able to lose them though. Now Sonic jumps off a cliff looking at all the beautiful sights but something is below him....a pool! He falls in and starts drowning not able to get up! Luckily he is saved by Christopher \"\"Chris\"\" Thorndyke who is shocked that Sonic can talk so they become friends.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/lnaTmYVvizNWWU8aJWRiQkvOj8X.jpg","vote_average":1,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-04-13","episode_number":2,"episode_type":"standard","id":440575,"name":"Sonic to the Rescue","overview":"Sonic has unofficially taken residence at Chris' house.  Chris is a young boy, whose family is rich.  While Chris and Sonic are watching TV, Chris' grandfather, Chuck, walks into the room and discovers Sonic.  Almost taken apart by Chuck, Sonic flies out of the way to the other side of the room.  Sonic then hears on the TV that Cream and Cheese were found.  Chuck sees this and agrees to help Sonic find his friends.  Cream and Cheese have been taken to Area 99; a top-secret military base.  It is very high security, so Chuck gives Sonic an infrared scope to find his way around.  Sonic finds Cream and Cheese in a lab being tested.  He breaks them out, but then the security cameras catch him and start firing their lasers at them.  After the cameras' lasers destroy about half of the base, Sonic hears a noise outside.  It's the tornado!  Sonic bolts out the wall and lands on the Tornado, and they all fly back to Chris' house to reunite.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/n0AAONFpsVe4SCYVIbGSQ0bfTB9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-20","episode_number":3,"episode_type":"standard","id":440576,"name":"Missile Wrist Rampage","overview":"Knuckles and Amy are scouring the sewers trying to find a way out while Eggman hatches a giant robot named Missle Wrist and Knuckles' is too stubborn to care about it. Can Sonic, Chris, Tails, Cream, and Cheese stop this horrible disaster?","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/1Aw7AWG93ORkOjv6beZ1nFFpdZq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-27","episode_number":4,"episode_type":"standard","id":440577,"name":"Chaos Emerald Chaos","overview":"A Chaos Emerald is found so Chris is determined to get it  before Eggman does to show Sonic that he can be a help. But what's in store when Eggman hatches a giant bird robot?","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/cSbcRBfBjo6U9IhbppS8wdmE4nL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-04","episode_number":5,"episode_type":"standard","id":440578,"name":"Cracking Knuckles","overview":"Eggman tricks Knuckles by saying that Sonic was the one that sent them to the new world. Now Knuckles is more furious then ever to destroy Sonic, and they have an ultimate clash.....or is everything Eggman said just a fake?","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/uzNjuYTliTL2jka9PP9AFTIPJk6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-11","episode_number":6,"episode_type":"standard","id":440579,"name":"Techno Teacher","overview":"Being mad after losing three times, Eggman decides to make a robot named E-51 to go to Chris' school and ruin it. But things turn around when E-51 forgets all about his mission and has fun with the kids!!","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/8eonUG6of7dOVrYuZKEhqUUrF2H.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-18","episode_number":7,"episode_type":"standard","id":440580,"name":"Party Hardly","overview":"Chris throws a home party inviting his teacher Stuart, his Mom's brother Sam Speed, but Chaos Corrupts when Cream begins thinking about her mom...","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/em4rs08UDQUbVG26CwzDAcYktMQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-25","episode_number":8,"episode_type":"standard","id":440581,"name":"Satellite Swindle","overview":"Tails builds a X-Tornado 2 while meanwhile Eggman uses a Satellite to turn down all televisons. Tails finishes building it, and then Sonic, Tails, and Chris take it for a Spin to stop Eggman's fortress, and his Satellite.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/pmrnjbrFLkh0aFPFXN86Gm71BdJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-01","episode_number":9,"episode_type":"standard","id":440597,"name":"The Last Resort","overview":"Chris, Tails, Amy, Cream, and Cheese go to the beach, but Sonic stays behind and goes for a run. Amy has day dreams about Sonic on the beach, and decides to make a necklase for her hero, Sonic. Meanwhile Eggman hatches a mischevious plan to ruin the beach, and without Sonic what will they do? Luckily Sonic comes and fights Eggman's huge robot, but almost gets hurt, and Amy isn't too pleased......","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/u4Rr2XVpECLUw8OL3g4AkRQBnhU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-08","episode_number":10,"episode_type":"standard","id":440582,"name":"Unfair Ball","overview":"Tails finds another Chaos Emerald, but in order to get it  Sonic and pals(including Tails) must win a very odd baseball game against Eggman and his robot's. Or is Eggman just tricking them so he can get all the loot even if he doesn't win?","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/k9fBqNKgGFk2KzWbZCLy20NQx0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-15","episode_number":11,"episode_type":"standard","id":440583,"name":"Fly Spy","overview":"A jewel theif is on the loose-Rouge The Bat. And she plans to steal the Chaos Emeralds by tricking the goverment, by working with them, and pretending to help infilitrate Eggman's Fortress, when she really just plans to steal the Chaos Emerald.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/al3yJGDr2WExZ6OpS6HHrmrX7Yo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-22","episode_number":12,"episode_type":"standard","id":440584,"name":"Beating Eggman (1)","overview":"The President of The United States says his plans to defeat Eggman, while Knuckles trys to sneak into Eggman's base. Meanwhile Tails,  Chris, Amy, and one of Chris' friends, Francine find another Chaos Emerald but Eggman shows up with his giant Wind Robot, and blows them away!","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/gedGDWaSPfzsXQOBRTcxo9w0tHM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-29","episode_number":13,"episode_type":"standard","id":440585,"name":"Beating Eggman (2)","overview":"Rouge, Topaz, Knuckles, and the goverment break into Eggman's base and try to infilitrate it while Sonic and pals try to infilitrate it as well, and get the Chaos Emerald back. But Eggman has a huge suprise in store for Sonic...","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/kPwnvJejaPRbUmQ1dQJRi4dKRI9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-06","episode_number":14,"episode_type":"standard","id":440586,"name":"That's What Friends are For","overview":"After destroying Eggman's base Sonic has become a huge celeberity and the President invites him and his friends to a party but Sonic has promised his new friend Helen that he'd take her to a mountain because her dad never did. Now the president is trying to catch Sonic and take him to the party and Sonic and Helen are on the run!!","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/lwr3XJhoZTFjuk0Je9DHMQJTG8A.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-13","episode_number":15,"episode_type":"standard","id":440587,"name":"Skirmish in the Sky","overview":"Ella decides to take Amy, Tails, Chris, Cream, and Cheese out to the mall, but they see the return of Eggman, and his new Egg Fortress. Eggman launches some missles to the City, and it's up to Sonic to stop them. They end of defeating Eggman, and him and the Egg Carrier fall to the deep ocean....","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/6qDQks3quZFr49S82mkrXQaQhSD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-20","episode_number":16,"episode_type":"standard","id":440588,"name":"Depths of Danger","overview":"Sonic, Tails, Cream, Cheese, and Chris discover that a Chaos Emerald is in the Ocean of a Motel, so they go on a vacation  try to find a Chaos Emerald in the deep Ocean but it turns out that Eggman is under the sea, and ready to attack, trying to get the Chaos Emerald too.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/eYCHpmCxuG2kOAlEP93OfcwIGhY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-27","episode_number":17,"episode_type":"standard","id":440589,"name":"The Adventures of Knuckles and Hawk","overview":"Knuckles has been traveling for days to reach a small town, to see his friend Hawk, and get another Chaos Emerald. They must prevent Rouge or The Fly Thief from getting it and Knux may even have to throw in some punches.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/sPK4UnpPDWIS5zoXrzYqLJqv3Ri.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-03","episode_number":18,"episode_type":"standard","id":440590,"name":"The Dam Scam","overview":"Sonic, Chris, and Tails attempt to destroy Dr. Eggman's Egg Fort, but get the Tornado shot down and they get separated!! Now Tails, and Chris must stop some Damworkers from building a Dam that will block electricity, while Sonic must defeat Eggman's Giant Robot Monkey that can become invisible!!","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/wzxm3WUFaD8ntIPWU6Z9ziV6m9z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-10","episode_number":19,"episode_type":"standard","id":440591,"name":"Sonic's Scream Test","overview":"Chris' mom is doing part of a play in an old castle.  While Sonic is walking in the castle, all of the sudden, everything shakes all of the sudden.  During the night when Lindsay is putting on her makeup, the mirror all of the sudden takes her alive.  The gang goes about looking for her, when all of the sudden Ella is sucked into a wall.  When trying to rescue her, Sonic and Tails are sucked in as well.  Amy and Chris try and rescue everyone.  They figure out that a stone has something to do with this.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/bDqb0eYLkJGoCPNoVkY7F4y9EYi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-17","episode_number":20,"episode_type":"standard","id":440592,"name":"Cruise Blues","overview":"After many weeks of looking for Chaos Emeralds, Nelson suggests that everyone takes a break and goes for a cruise on one of his spare yachts.  However, the ship isn't big enough for Sonic to run on, at all.  Everyone is worried, so an airlift is called in to send Sonic away, but Tanaka is on it, and he has a group of elderly women on board.  He says they will be their coaches, guiding them on how to relax, leaving Sonic on the ship, just as he tricks Tails into thinking the X Tornado is lonely, and lies to Amy that she is the cutest thing he's ever seen (lol!).  Just as the ship approaches the glaciers, the Egg Fort 2 launches for the first time with an attack.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/tKput2gq9zpZg8X2xnLGn6GRqlc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-24","episode_number":21,"episode_type":"standard","id":440593,"name":"Fast Friends","overview":"It's the middle of the night.  But Chris's Uncle can care less.  Sam would like to challenge the speedy blue demon to a speed match; which he's not to interested in.  He finally gives in to all the influences, and goes ahead, with the entire country watching this show down, as well as the president.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/fkSOZiQoxLmas01ynu7cQFbeCso.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-31","episode_number":22,"episode_type":"standard","id":440594,"name":"Little Chao Lost","overview":"While exploring Tanaka's mountainous homeland, Cream and Cheese decide to take a swim.  However Cheese is carelessly swept away down the river by a strong current, and the gang has to find him.  When they reach the spot where they find Cheese, it's a beautiful, crisp lake inhabited by many chao that have been transported here as well.  The gang begins to enjoy the company when unfortunately, Dr. Eggman is taking a hike too; and he plans to ruin the vacation!","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/sq21mMjVPZwOWzK5lZvYeHDGmlH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-09-07","episode_number":23,"episode_type":"standard","id":440595,"name":"Emerald Anniversary","overview":"Rouge and Topaz are 'hanging out' when Rouge spots some beautiful jewelry in the store across the street, but Topaz blurts out 'Thief!' just to anger Rouge. Then Nelson, Chris' dad buys a expensive ring in the store, because it's his anniversary with Lindsay, Chris' mom. Meanwhile, at the Thorndyke's Mansion, Sonic, Tails, Amy, Cream, and Cheese recieve a phone call from Nelson, telling them to go to his office. But Sonic gets a weird reaction from his Chaos Emerald that he's holding, and it turns out that the 'ring' is actually a Chaos Emerald! Knuckles sees the reaction and goes straight to help the gang. But in the shadows Eggman sees the reaction too and decides to jump in with his giant robot to steal the Chaos Emerald for himself!","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/wQb7BEJj4nhqG5VoBJ7wgcQiEY4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-09-14","episode_number":24,"episode_type":"standard","id":440596,"name":"How to Catch a Hedgehog","overview":"Eggman comes in to the area disturbing the peace, but he's not match for blue.  However, when Sonic is fighting, some sort of computer chip lands in Sonic's ear, causing him to pick his ears for the rest of the day (which Amy hates!).  When a remote is pressed, Sonic goes berserk, and then begins to run fast and uncontrollably into the desert.  The gang has to come up with ways to stop him, with the assist from Knuckles and Sam, but to their luck, they all fail, and Sam is no help either. What will they do?","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/9t2TtB3P96vjONFKNh9dBR5p9aA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-09-21","episode_number":25,"episode_type":"standard","id":440599,"name":"A Dastardly Deed","overview":"Now we're on the wire. Six Chaos Emerald have been found, but Eggman has one, and plans to use his E-77 robot to seek out the last one. Meanwhile, Knuckles is looking for the Last Chaos Emerald too. He realizes that the only way for him, Sonic, Tails, Chris, Amy, Cream, and Cheese to get all the Chaos Emeralds is to team up with Eggman. So Knuckles visits the Thorndyke residance, but Sonic, Tails, Cream, Amy, and Cheese are out looking for the last Chaos Emereald as well, so Knuckles teams up with Chris to go to Eggman's base and ask for a partnership. Eggman agrees, but he asks if he can hold the Chaos Emeralds that they have, and foolishly Knuckles agrees. Chris and Knuckles try to keep it a secret from Sonic, Tails, Amy, Cream, and Cheese though. Meanwhile, it turns out that Eggman tricked him, and he steals the Chaos Emeralds for himself...as E-77 is returning with the last Chaos Emerald....what will happen next?","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/9ra1KlNNqVhNxTvuahDV57JojG0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-09-28","episode_number":26,"episode_type":"finale","id":440598,"name":"Countdown to Chaos","overview":"A very sad episode indeed. After a trap set last set by Dr. Eggman, Chris is held captive in E-99 on the shores while Sonic is trying his hardest to defeat it and get Chris back. However, with the power of seven Chaos Emeralds, it's not that easy. Sonic is bruised and beaten...badly. Chris can't stand the sight of his hero beat up, and actually breaks himself free to grab the emeralds and jump in the water to help Sonic. Behold! Super Sonic rises out and destroys E-99, and then a blast of Chaos Control is released, as Station Square watches in awe.","production_code":"","runtime":25,"season_number":1,"show_id":10926,"still_path":"/6sDyhFgjMJD9Pz4lfQUFZUGPdLn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":21312,"poster_path":"/kP6kmJgy2hPDdAEasvIdFh6okXH.jpg","season_number":1,"vote_average":1},"2":{"_id":"525808d419c29531db3db5e2","air_date":"2003-10-05","episodes":[{"air_date":"2003-10-05","episode_number":1,"episode_type":"standard","id":440613,"name":"Pure Chaos","overview":"What has happened? Two huge islands formed on the shores of Station Square, one of them being Angel Island, which is falling! Chaos Control apparently brought Sonic's world to Station Square, leaving Chris happy but Eggman to formulate a way to destroy the city. Next, Eggman is instructing his E-100 team to set out and destroy things. Even more terrible, Chaos is loose on Station Square streets reeking havoc! The beginning of the Sonic Adventure adaptation has begun!","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/jbwEdyJ39RCR47gZkdMeOs809Ri.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-12","episode_number":2,"episode_type":"standard","id":440614,"name":"A Chaotic Day","overview":"After a brief discussion with Chuck,Sonic Tails search for the Chaos Emeralds, Knuckles searches for the pieces of the Master Emerald, and Big Chris search for Froggy. Knuckles gets an image from the past. Sonic Tails encounters Eggman Chaos, who goes under another transformation, while finding a Chaos Emerald. Sonic beats Chaos and Eggman escapes in his Egg Carrier. Sonic Tails goes into the X Tornado and chases Eggman, but Eggman shoots down the X Tornado. Meanwhile, Amy runs into a small bird and they both get kidnapped by one of Eggman's robots. Can Sonic rescue Amy?","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/fPfttHvziMKhv4dnSmEWMzCkbtc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-19","episode_number":3,"episode_type":"standard","id":440616,"name":"A Robot Rebels","overview":"After Amy's kidnapping, Sonic Tails head off in the X Tornado to rescue her. Meanwhile, Knuckles gains most of the Master Emerald pieces and gets another vision of the past. After the vision, Knuckles puts the pieces on the altar and discovers the remaining pieces are in the Egg Carrier. Big Chris manages to find Froggy, but gets stolen by E-102 Gamma and They sneak into the Egg Carrier. After Gamma's success of getting Froggy, Eggman sends the other E-series into other places and orders Gamma to get the bird that's with Amy. When Gamma confronts Amy, she persuades him to help her escape. Knuckles hitches a ride with Sonic Tails and battles the Egg Carrier. After getting through the weapons, they enter the Egg Carrier where dangers await them.","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/dLgaNU0CLMLxtwGf9rBZULv8ILQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-26","episode_number":4,"episode_type":"standard","id":440615,"name":"Heads Up, Tails!","overview":"It's a battle on the Egg Carrier. Knuckles tries to get the last peices of the master emerald, Big and Chris need to get Froggy, and Sonic and Tails need to get Eggman. But when Chaos turns into Chaos 6 and captures Froggy, Big ,and Chris, It's up to Sonic and Knuckles to set them free. When Eggman launches a missle to destroy Station Square, It's all up to Tails to detonate it.","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/h6wvtHZlKUl4qnR4XgAuaoB6JDk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-02","episode_number":5,"episode_type":"standard","id":440618,"name":"Revenge of the Robot","overview":"After the missle attack was prevented, E-102 Gamma deletes master obedience data and heads off. Meanwhile, Amy sets of to find Lilly's brothers. Then, Sonic explores an ancient temple and gets a vision of the past. Then, he fights the Egg viper. Gamma frees Delta, Epsilon, and Zeta. But, Beta tries to destroy him. Can Gamma free Beta?","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/bXizo44MjkrEId0RlApWs7ZOPx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-09","episode_number":6,"episode_type":"standard","id":440617,"name":"Flood Fight","overview":"It's total chaos! Chaos absorbs the 7th Chaos Emerald and starts to destroy Station Square! Now with the Emeralds drained of their power, Sonic friends must use their friendship to power the Emeralds and Sonic changes to Super Sonic! Will Sonic be able to defeat the mystical sea monster known as Chaos?","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/xxGHcp7EUaybvnmINwFNLvuxsYz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-16","episode_number":7,"episode_type":"standard","id":440600,"name":"Project: Shadow","overview":"After accidentally finding Prof. Gerald's diary, Eggman breaks into the military searching for the \"\"Ultimate Creature\"\": Shadow. Thanks to the Egg Mobile, Eggman finds the console & finds an unknown creature...","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/xcBn8zvBjDmgzj4qeNI7wqjzglO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-23","episode_number":8,"episode_type":"standard","id":440602,"name":"Shadow Knows","overview":"After Shadow steals one of the Chaos Emeralds, Sonic is blamed for the crime and finds himself on the run from the law. As he does so, he runs into Shadow, and realizes why he's suddenly become a wanted criminal, because Sonic and Shadow look very much alike. As the two collide, Shadow reveals his ability to harness the power of the Chaos Emerald to use Chaos Control, which gives him an edge over Sonic.","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/v9K1Pg2bntY1QwhUGZAl7xtW9E3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-30","episode_number":9,"episode_type":"standard","id":440601,"name":"Sonic's Big Break","overview":"Under a new alliance, Shadow, Rouge, and Eggman carry out their latest plan. As Eggman launches an attack on Prison Island, Rouge breaks in to steal three Chaos Emeralds, and Shadow sneaks in to plant a bomb which will destroy the island.","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/7y02EtR6LWIW13mHjZzDTfcGXUq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-12-07","episode_number":10,"episode_type":"standard","id":440603,"name":"Shadow World","overview":"Sonic, Tails, Knuckles & Amy manage to break into Eggman's base, undetected. At least they THINK they've entered undetected. Bokkun finds them & calls on the Egg Golem! They board the space shuttle, but their adventure has just begun...","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/m77h4wEP6CJnyTPENFMzvi77o9T.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-12-14","episode_number":11,"episode_type":"standard","id":440605,"name":"Robotnik's Revenge","overview":"Sonic, Tails, Knuckles, Amy and Tanaka have arrived at the ARK, but when Robotnik, Rouge and Shadow programme the ARK on a path to oblivion, it's Sonic The Hedgehog to the rescue in outer space!","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/5L4mlsA84XHuYphcnLxaEkxBday.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-12-21","episode_number":12,"episode_type":"standard","id":440604,"name":"Showdown in Space","overview":"As the clock ticks for Space Colony Arc's crash, Sonic, Eggman, Bokkun, Dekkun, Knuckles, Tails, and Rouge try to get the Master Emerald to the power source, The Chaos emeralds. Meanwhile, Shadow is faced by Chris, who reminds him of Maria's Wish, to help Mankind. As Sonic, Knuckles and the two robots reach the power source, a recreated temple of Chaos, a robot/organic beast attacks the crew, thinking of a way past, Shadow offers to distract the beast long enough to stop the colony. Will they succeed? Watch and find out!","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/6SielHNjzFaFehWNsGh85RSxhsT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-12-28","episode_number":13,"episode_type":"standard","id":440624,"name":"Defective Detectives","overview":"The Chaotix Detectives made up of Vector the Crocodile, Espio the Chameleon, and Charmy the Bee have arrived in Station Square. Their goal is to find Cream for a specific reason, even when they think Sonic stole her. Meanwhile, Dr. Eggman rebuilds half the moon (after part of it was destroyed last episode) into the Eggmoon and claiming to Sonic that he has become reformed. Is this true? And will the others know why the Chaotix Detectives have come for Cream.","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/45lPnRUMMunVaSvoqdsk9nvcffO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-04","episode_number":14,"episode_type":"standard","id":440606,"name":"Sunblock Solution","overview":"When an eclipse from the newly-repaired moon blocks the sun, Station Square faces a risk of panic. Eggman steps in and creates an artificial sunlight orb to provide light through out the city. It seems like Eggman is truly doing some good. Unfortunately, Sonic dosen't think so...","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/ofbmUBq5jo1FcVSgISMUCAIkmci.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-11","episode_number":15,"episode_type":"standard","id":440607,"name":"Eggman For President","overview":"After the success of the sunshine balls, Eggman then tries to execute the rest of his plan. Sonic explains how Eggman eggmoon is moving to block, meaning Eggman set up the eggmoon as part of his master plan. Eggman then captures the president, and as he starts to make his own money, Sonic and Tails crash the X-Tornado into the white house and explain what happen while Mr. Tanaka and Topaz move the eggmoon out of the suns path. Sonic then set up a trivia challenge and traps Eggman by hitting him on the head with a big metal pan, and Eggman is sent to jail.","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/xMjHS2gnFX4G9Ff4YX5ZpwX66jC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-18","episode_number":16,"episode_type":"standard","id":440620,"name":"A Date to Forget","overview":"Sonic is supposed to have a date with Amy, but he doesn't show up. So instead, she has a date with Sam Speed. Meanwhile on Eggman's old island base, Bokkun finds one of Prof. Gerald Robotnik's other creations: Emerl & tries to tell him to defeat Sonic. Bokkun opens the door, & he & Emerl walk to the tank. Sonic is trying to get to his date with Amy, but Bokkun stops him to free Eggman, Decoe & Bocoe from jail with the new tank. Can Sonic stop Bokkun & Emerl from freeing Eggman? Or will he be late for his date with Amy?","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/4cgCIPSX80DJTD7TXy5XIuonW9Q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-25","episode_number":17,"episode_type":"standard","id":440623,"name":"Mean Machines","overview":"","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/fYYsoQnWkjhq1xd4uTm8teYFMt9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-01","episode_number":18,"episode_type":"standard","id":440619,"name":"The Sewer Search","overview":"Stewart keeps a close eye on Eggman. Unfortunetly for him, Chris, Helen, Danny, Cream, Cheese, and Emerl stick with Stewart for the ride. When they are all captured by Eggman, they must try to find a way out, or at least figure a way to contact Sonic to help...","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/hh1r7mPblJJFh2eOnScdQsimyfu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-08","episode_number":19,"episode_type":"standard","id":440608,"name":"Prize Fights","overview":"A tournament at a nearby stadium is being held, with a red Chaos Emerald as the prize. Sonic, Tails, Knuckles, Rouge, Amy, Emerl, and several of their Station Square friends show up to participate in this outstanding event...","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/KtFBo4J8tWdALw1EqSuRANqHWc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-15","episode_number":20,"episode_type":"standard","id":440610,"name":"A Wild Win","overview":"The fight tournament draws to a close with Emerl being the winner. However, Emerl starts going beserk after holding the Chaos Emerald and begins to destroy everything in his path. When Amy, Sonic, Knuckles, Tails, and Rouge are unable to stop it, Cream shows up to confront her robotic friend. Will she be able to talk Emerl into ceasing his uncontrollable mayhem, or will she have no choice but to fight and shut him down?","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/AmynIOMohzXDH4Eg7wcoga741r0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-22","episode_number":21,"episode_type":"standard","id":440625,"name":"Map of Mayhem","overview":"Eggman, Decoe, and Bocoe hatch a plan to destroy the Equator with a giant Robot, and it's up to Sonic, Tails, Knuckles, Amy, Chris, and Rouge to stop him.","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/xdDx6KciRlB0Vnvu4KgNC0xvOHI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-29","episode_number":22,"episode_type":"standard","id":440622,"name":"The Volcanic Venture","overview":"With Eggman under the Volcano Sonic, Rouge, Knuckles, Tails and Chris follow him. But is there something hidden from the world there?","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/qcQsatAW8wA0g6J8yMNaOSkOHIu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-07","episode_number":23,"episode_type":"standard","id":440609,"name":"The Beginning of the End","overview":"It is discovered that Earth and Mobius are merging.  If they join together completely, then time will stop forever.  It is decided that Sonic and co. must return home through chaos control.  This upsets Chris, who runs off to confront Eggman thinking it is one of his tricks to get rid of Sonic.","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/kn1CD2yXwYxnkDYCszlofzJMHHv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-14","episode_number":24,"episode_type":"standard","id":440611,"name":"Running Out of Time","overview":"This episode tells of what happens before Sonic & co. leave for home. Everyone is sad that they'll leave, especially Chris. There are many flashbacks to the first two episodes until they leave. Eggman, Cream, Amy, and Knuckles leave, but at the last second, Chris shuts the portal to Sonic's world, leaving Sonic trapped on Earth.  So begins the (not so) long journey of Chris and Sonic...","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/oGbibm8xj227mI0VkaIOpt8IcVf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-21","episode_number":25,"episode_type":"standard","id":440621,"name":"Friends 'Til the End","overview":"After Chris stops him from going home, Sonic goes on a long journey with Chris, who decides to run away. However, his parents want him back and they soon go looking for him. Will Nelson and Linsey find Chris or has he run away forever?","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/cgl7h64pcg454UUXmsG6x9yoG7m.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-28","episode_number":26,"episode_type":"finale","id":440612,"name":"A New Start","overview":"All the animals (except Sonic) are now back at their original world. Amy is having dinner with Cream and Cream's mom at their house, and Knuckles and Rouge are talking in the woods. Suddenly, Eggman hatches a plan, and Tails gets in his plane to stop him. Tails, is almost beaten, but luckily an old friend, Sonic, as Super Sonic, has finally returned, and pops in, saves him and beats Eggman. Meanwhile in Chris' world years have passed. Chris is now a adult. Suddenly he starts remembering all the fun, and the struggles he had with Sonic as a kid.","production_code":"","runtime":25,"season_number":2,"show_id":10926,"still_path":"/1AShNYrXC7SeB08ccFwMgqxhNLl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":21313,"poster_path":"/s6SPXKslkbQE3iBWyWdNQLVuAyR.jpg","season_number":2,"vote_average":0},"3":{"_id":"525808d419c29531db3db5f0","air_date":"2005-03-12","episodes":[{"air_date":"2005-03-12","episode_number":1,"episode_type":"standard","id":440646,"name":"A Cosmic Call","overview":"Sonic returns to his planet after releasing the seven chaos emeralds into space.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/rFRbaKR6JJOYecepS3DzmR36GPx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-12","episode_number":2,"episode_type":"standard","id":440644,"name":"Cosmic Crisis","overview":"Cosmo reveals the mission of the Metarex.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/iukaL0pk5CRoGFXJ9wNypPNk4X5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-13","episode_number":3,"episode_type":"standard","id":440643,"name":"H2 Whoa","overview":"Sonic is captured by the Metarex.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/3qavd3oblfmnX9y5u5RXmBd8KaJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-14","episode_number":4,"episode_type":"standard","id":440629,"name":"An Enemy In Need","overview":"Sonic and the others see through Eggman's trick.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/8dT7xysT2FnxwbHXlMMSclwcPH0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-15","episode_number":5,"episode_type":"standard","id":440630,"name":"A Chilling Discovery","overview":"Sonic and friends are back on the hunt for Chaos Emeralds.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/iqW6zc8v7G8x9gLotVFyH5SvWOp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-16","episode_number":6,"episode_type":"standard","id":440645,"name":"Desperately Seeking Sonic","overview":"As Sonic crashes with Eggman onto a jungle planet, Amy rushes out to find him, and Cosmo and Cream follow.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/A5lksqr5MtU8anHTFYrp9hkMA1z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-17","episode_number":7,"episode_type":"standard","id":440635,"name":"Galactic Gumshoes","overview":"Chuck finds a way to teleport material objects to Sonic's world, and Vanilla asks the Chaotix to help wend them to Chris.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/8F0qtx3C8DFsHUlL4hM6JS0HLoQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-18","episode_number":8,"episode_type":"standard","id":440642,"name":"Trick Sand","overview":"The crew of the Blue Typhoon go emerald hunting on a deserted planet.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/rsHnWaY0jgvQNhz0R20iSV5qZ8D.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-19","episode_number":9,"episode_type":"standard","id":440639,"name":"Ship of Doom","overview":"A Metarex fleet lead by Scarship sets out to destroy Eggman and Sonic with its might.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/eBKci2Di1QzAH42holO0ozOWDkN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-20","episode_number":10,"episode_type":"standard","id":440648,"name":"An Underground Odyssey","overview":"After the battle with Metarex's Scarship, the Blue Typhoon crashes onto a strange planet.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/krK3bKqSD8uft3BrOWdQUwv93T.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-21","episode_number":11,"episode_type":"standard","id":440626,"name":"Station Break-In","overview":"Sonic and Eggman agree on a joint effort to retrive the last two Chaos Emeralds hiden inside a Metarex fortress.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/duLntBYkqZg6ahRL60TCTkFvg56.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-23","episode_number":12,"episode_type":"standard","id":440627,"name":"A Metarex Melee","overview":"Sonic squares off with Dark Oak and his army of Metarex.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/qC6yEpdpFtmnnxylRsxjsCY99Ex.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-05","episode_number":13,"episode_type":"standard","id":440647,"name":"Mission: Match-Up","overview":"Vector comes up with a scheme to play match maker for Cosmo and Tails.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/6MuXoCIhxoKrcVLX9gAuXP49w2g.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-06","episode_number":14,"episode_type":"standard","id":440634,"name":"Clash in the Cloister","overview":"As they travel through the Intergalactic Cloister, Sonic and the others battle Yellow Zelkova.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/clXpmkEwk9ykapuNkwSBqy5Ij0G.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-07","episode_number":15,"episode_type":"standard","id":440640,"name":"Teasing Time","overview":"Sonic and friends come across a barren planet with 500 Chaos Emerald signals coming from it.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/nWEWrC8zYo9NEMj1XpYpcVtPd7j.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-08","episode_number":16,"episode_type":"standard","id":440650,"name":"A Revolutionary Tale","overview":"While traveling through space, Dr. Eggman and his forces come across a group of humans battling the armada of Pale Bay Leaf.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/fqqmiURWXyu9ysj2ixeVIFqz0up.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-09","episode_number":17,"episode_type":"standard","id":440649,"name":"The Planet of Misfortune","overview":"Sonic and the others finds a race called Marmolians and head to their home planet.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/juhDp4oIhXZtnCmElZwmr9JzguK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-10","episode_number":18,"episode_type":"standard","id":440641,"name":"Terror on the Typhoon","overview":"The Blue Typhoon comes under attack from the Metarex fleet.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/zFnEEdEWIIrQuRecXkWLS0mZNf8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-11","episode_number":19,"episode_type":"standard","id":440638,"name":"Hedgehog Hunt","overview":"The Chaotix trio tries to aide Sonic and his friends as Metarex hunts for them.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/ojnVJuoep0fiNIPrYjKaZgylpuz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-12","episode_number":20,"episode_type":"standard","id":440636,"name":"Zelkova Strikes Back","overview":"The Blue Typhoon arrives at a planet, but Yellow Zelkova attacks the Blue Typhoon.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/keYKLLIjeEoWKBO5vIkmRu1pcKk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-13","episode_number":21,"episode_type":"standard","id":440631,"name":"The Cosmo Conspiracy","overview":"Shadow invades the Blue Typhoon, trying to kill Cosmo for reasons unknown.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/kE5Or7heIvmkIEootPpLp1jKbky.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-14","episode_number":22,"episode_type":"standard","id":440632,"name":"Eye Spy","overview":"When the team discovers that Cosmo's brain is emitting a signal to the Metarex, they plan on trying to eliminate the signal, except that the signal is connected to the part of her brain that translates sounds and sight. While Tails and Cosmo are torn about this, Knuckles pushes for the surgery.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/krBy4C4iJ9DjZhc5O0Os5442Yjq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-15","episode_number":23,"episode_type":"standard","id":440651,"name":"Angel Of Mischief","overview":"Sonic and the others chase after Dark Oak to galactic coordinates 0-0-0, where a thousand-year prophecy will bring their plan to fruition.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/jw2bPXZypiZ550EGWmfqaveZW2a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-16","episode_number":24,"episode_type":"standard","id":440637,"name":"The Light In The Darkness","overview":"After Sonic falls into the watery planet, the gang struggles for a way to rescue him and defeat Dark Oak.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/baGDlYGCzUHpljosJsou4GKnLs6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-17","episode_number":25,"episode_type":"standard","id":440628,"name":"A Fearless Friend","overview":"The giant seed finally reaches the final stage of its metamorphosis, and Cosmo steps in the battle to stop it.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/qnPnJ5jWWs2QhepBBpvM8TOUDbR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-18","episode_number":26,"episode_type":"finale","id":440633,"name":"So Long Sonic","overview":"After the galaxy is saved, Sonic and his friends recalls memorable moments and anticipate their future.","production_code":"","runtime":25,"season_number":3,"show_id":10926,"still_path":"/jhNUxBYRGo0FGo6ioCG44FZcbWN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":21314,"poster_path":"/sZe6IQ8dhe7bcDxcExaUzbfpAcc.jpg","season_number":3,"vote_average":0}}}