{"adult":false,"backdrop_path":"/4xJwEa6D7fBsA1CbmbRMpSYu7Ah.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"2002-08-04","genres":[],"homepage":"","id":10947,"in_production":false,"languages":["en"],"last_air_date":"2004-10-17","last_episode_to_air":{"id":441223,"name":"Anna Goes To Camp","overview":"","vote_average":0,"vote_count":0,"air_date":"2004-10-17","episode_number":2,"episode_type":"finale","production_code":"","runtime":30,"season_number":3,"show_id":10947,"still_path":null},"name":"The Anna Nicole Show","next_episode_to_air":null,"networks":[{"id":76,"logo_path":"/ptpx2Ag52sYJG6LiX9zBlnKsQOS.png","name":"E!","origin_country":"US"}],"number_of_episodes":28,"number_of_seasons":3,"origin_country":["US"],"original_language":"en","original_name":"The Anna Nicole Show","overview":"The Anna Nicole Show is an American reality sitcom starring former model and Playboy Playmate Anna Nicole Smith. The series debuted on August 4, 2002 on the E! entertainment television network and ran for two seasons.","popularity":2.589,"poster_path":"/vwKGXmqtlZV2sZfCaXx4Lir3AIs.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2002-08-04","episode_count":13,"id":21363,"name":"Season 1","overview":"","poster_path":"/82cfIfUCGuSSs4oDWB3RpUKN8at.jpg","season_number":1,"vote_average":0},{"air_date":"2003-03-02","episode_count":13,"id":21361,"name":"Season 2","overview":"","poster_path":"/82cfIfUCGuSSs4oDWB3RpUKN8at.jpg","season_number":2,"vote_average":0},{"air_date":"2004-03-23","episode_count":2,"id":21362,"name":"Season 3","overview":"","poster_path":"/82cfIfUCGuSSs4oDWB3RpUKN8at.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":10,"vote_count":1,"season_data":{"1":{"_id":"5258095a19c29531db3e3d6f","air_date":"2002-08-04","episodes":[{"air_date":"2002-08-04","episode_number":1,"episode_type":"standard","id":441209,"name":"House Hunting","overview":"Anna goes house hunting; attends Guess? 20th Anniversary Party\n\n* * *\n\nAnna goes house hunting with her entourage. She really likes house #2, but the rent is too high and she hasn't received her money yet. Anna then gets emotional over the house and claims that it reminds her of Howard (that'd be her former husband J. Howard Marshall).\n\nShe attends a Guess? 20th anniversary party where she is photographed and a fuss is made over her. Afterward, she confesses that she loves her paparazzi.\n\nThe next morning they talk to other brokers in an attempt to find a house. After a short search they find what Anna calls her dream house.","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-08-11","episode_number":2,"episode_type":"standard","id":441210,"name":"The Introduction of Bobby Trendy","overview":"Anna brings her husband's ashes home; and buys trashy lingerie.\n\n* * *\n\nAnna and the gang bring what furniture she has into the new house. They hire a decorator, Bobby Trendy, to decorate the empty house.\n\nKim and Anna go shopping and on the way they play a game where you punch each other when you see a \"\"bug\"\" (the car). They get into an argument and start calling each other names. They go to Trashy Lingerie to buy, of course, lingerie. When they return home everyone watches Anna's interview on Larry King Live.\n\nIn the beginning of the episode, Anna says to make her house a home, she needs to bring her late husband's ashes in. Howard explains that Anna, in court, was given half of her husbands ashes. Anna becomes emotional upon moving his ashes from the old house to the new one. Anna takes J. Howard Marshall's ashes on a tour of the house, which ended with him getting his own spot, on the television, in Anna's bedroom.","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258095d19c29531db3e3f38","order":504,"adult":false,"gender":0,"id":1242996,"known_for_department":"Acting","name":"Bobby Trendy","original_name":"Bobby Trendy","popularity":0.6,"profile_path":null}]},{"air_date":"2002-08-18","episode_number":3,"episode_type":"standard","id":441211,"name":"The Eating Contest","overview":"Anna & company have an eating contest; Anna and Kim go to a tattoo parlor.\n\n* * *\n\nAnna, Kim, Howard, and Daniel have an eating contest at an Italian restaurant, Mazzarino's. Howard makes the rule that if you throw up during the meal, you're disqualified. Kim is the first to give up. Anna starts says that she's hot. She then says she needs to go to the bathroom. Howard immediately assumes Anna is going in there to throw up, so Daniel and Howard go to the bathroom door to listen. Anna becomes angry at Howard and tells him to get out of her life if he doesn't trust her. She says that he's calling her a liar (apparently not a good thing to do, as Kim learned while playing \"\"punch bug\"\" in episode 2).\n\nTo get away from Howard, Anna and Kim go to the tattoo parlor. Anna gets flowers added to her tattoo, Kim gets Anna's signature added to her Anna Nicole Smith tattoo on her left arm. Kim decides, after some coaxing, to get her tongue pierced.\n\nWhile Anna and Kim are at the tattoo parlor, Bobby Tre","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-08-25","episode_number":4,"episode_type":"standard","id":441216,"name":"The Dentist","overview":"Anna goes to the dentist; then, to a theme park.\n\n* * *\n\nAnna tells us that she only started going to the dentist in her twenties. On the way to the dentist's office she shares stories of how she \"\"got off\"\" as a child. She goes on to tell us that last time she was at the dentist she had a panic attack and ran off. The dentist, Dr. Nick Luizzi, tells us she needs up to twenty crowns. Anna's friend, Kelly, plays Twister with Anna and then Kelly models her teeth for Anna's dentist.\n\nBobby Trendy delivers more furniture to Anna's house. Bobby and Anna share some of their ideas for Anna's bedroom: leopard designs on the wall, stripes of white against a pink wall, etc. etc.\n\nAnna forces Kim to go to Magic Mountain. Kim is very upset to have been made to go to the theme park. They go on a water ride and end up completely soaken (Anna wearing white pants and a white shirt). Duh! Anna forces Kim to ride Goliath, the biggest roller coaster at the park. Then, again convinced by Anna, Kim rides with An","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-08","episode_number":5,"episode_type":"standard","id":441213,"name":"Las Vegas Pt. 1","overview":"Anna and company go to Sin City: Vegas, baby!\n\n* * *\n\nAnna says one thing she learned as a stripper is: one man plus two beers equals twenty dollars. She says her life is very stressful, as her teeth, PMS, Bobby Trendy, and even Sugar Pie have been causing her problems. She was feeling so stressed she decides to go, with her entourage, to Sin City: Vegas!\n\nThey stay in a huge suite. Anna gets her nails and hair done. Then she goes to a male strip club. Anna gets called up onto the stage. Afterwards, she meets the male dancers. Anna says the only thing, other than men, she likes is money. So they do some gambling. Anna keeps losing all her chips, so Kim gives her some of hers. They decide to take what money they have left and spend it on the Strip.\n\nAnna and company go riding a golf cart through the Strip, then go to a female strip club. Anna buys Kim and Howard a lap dance. Anna, of course, also gets a lap dance.\n\n(more of the Sin City trip in Episode #6)","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-15","episode_number":6,"episode_type":"standard","id":441221,"name":"Las Vegas Pt. 2","overview":"The gang continue their vacation in Vegas; then head home.\n\n* * *\n\nThe lap dances continue from last episode. Howard gives Anna a \"\"dance.\"\" They sober up with the bill comes. After all the action, Anna decides she's hungry. So they all go out to a buffet dinner.\n\nThe next day Anna is ready to go home, but fits in a little shopping before leaving. Anna & company discuss the time they spent in Vegas. Howard says he won't get married until Anna's case is settled -- and may never get married. Can we have a collective sigh from all the women out there?\n\nAnna wants to lose weight so she hires a man from Private Chefs, Inc. named Christian Paier. He brings four chefs (Oliver, Michael, Marcel, and Alexander) for a \"\"chef trial.\"\" Anna prefers Alexander, who just happens to be a body double for Arnold Schwarzenegger.\n\nBobby Trendy delivers some more furniture for Anna's bedroom. Bobby says that he and Howard seem to be \"\"at odds.\"\" Howard tries to protect Anna from being cheated by Bobby.","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-22","episode_number":7,"episode_type":"standard","id":441218,"name":"Pet Psychiatrist","overview":"Anna hosts an all-girl charity event at her home; then Sugar Pie gets analyzed by a pet psychic.\n\n* * *\n\nAnna brings over her friend and designer Frankie to help get things in order. Bobby Trendy refuses to bring Anna's stuff until Howard calms down and stops judging his items. Anna calls him and asks him to put his differences with Howard aside and bring her items to her house.\n\nAnna hosts an \"\"all girl\"\" event for a charity that involves foster children, America Works for Kids. Howard makes a speech to the girls (because Anna doesn't like to get in front of people and talk) that's message was basically \"\"follow your dreams,\"\" and he used Anna's life as an example.\n\nAnna consults a pet psychic for Sugar Pie. The psychic says she has never seen the kind of anxiety that Sugar Pie suffers when away from Anna. The psychic's advice: Sugar Pie needs a boyfriend.\n\nFrankie stands up for Anna against Bobby Trendy delivering furniture that is not up to Anna's wants and desires.","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-29","episode_number":8,"episode_type":"standard","id":441215,"name":"Cousin Shelly","overview":"Anna's cousin comes to visit; then, Anna does a couple of interviews.\n\n* * *\n\nAnna's cousin, Michelle Cloud, comes for a visit (with an unauthorized documentary camera crew). Anna doesn't want any part of the documentary, so she turns them away. Anna agrees to see Michelle when the documentary camera crew is out of the picture.\n\nAnna does an interview for a local radio show where the deejay calls her fat and asks if she's on drugs. Anna announces she's had enough of the abuse, and she's leaving.\n\nAnna then appears on the Tonight Show and is interviewed by host Jay Leno.","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258095b19c29531db3e3e44","order":500,"adult":false,"gender":2,"id":14991,"known_for_department":"Acting","name":"Jay Leno","original_name":"Jay Leno","popularity":5.798,"profile_path":"/cplpY6q2VFtR7c1gMHM50wPzdU3.jpg"}]},{"air_date":"2002-10-06","episode_number":9,"episode_type":"standard","id":441220,"name":"The Driving Test","overview":"Anna attempts to get her driver's license.\n\n* * *\n\nAnna is determined to get her driver's license. So she starts to study for the exam. Kim, giving Anna time to study for her driving exam, goes, with Frankie, to get her tattoo of Anna worked on.\n\nBobby Trendy comes by with some pillows that - again - weren't the right ones. Bobby, being in a good mood, says he's just there to make Anna happy, because she's his client. Bobby, determined to be in a good mood, takes down Frankie's order for what Anna wants.\n\nAnna goes to take a driving lesson. Her driving instructor, Simon, does most of the driving for her. Anna says the experience driving around with Simon was frustrating. Simon says she has problems with the brake.\n\nAnna goes to take the exam. Howard takes one also to make the test a competition and a little more fun. In the end, Anna fails the test.","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-13","episode_number":10,"episode_type":"standard","id":441214,"name":"NYC Publicity Tour","overview":"Anna goes on a promotional tour to New York.\n\n* * *\n\nAnna and her entourage (Sugar Pie, too) go to New York for a promotional tour. Daniel stays behind because of school. After a long flight, Anna and company arrive in New York and check in at their hotel.\n\nThe next morning Anna has to get up extremely early to do Live with Regis and Kelly. They're running late and their limo driver seems to be having ahard time doing his job. On the way to Fox News, her publicist adds more appearances to the schedule. After the appearances, Anna and company go back to their hotel to change, then they do some shopping.\n\nAnna's producer tries to talk Anna into appearing on Howard Stern's radio/TV show. Anna doesn't want to because of the way Howard talked about her late husband. Anna changes her mind and appears on Howard Stern's program. They don't let Kim in. One of the Howard Stern crew, Benjy, takes up for Anna during the show and Anna invites him back to her hotel room where they make out and joke arou","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-20","episode_number":11,"episode_type":"standard","id":441219,"name":"Paintball","overview":"Anna and company play paintball; Anna appears on Hollywood Squares.\n\n* * *\n\nAnna and company play paintball. Kim and Anna are on one team, and Howard, Frankie and Daniel are on the other. Anna gets shot and ends up with green paint in her hair. After the game they go to the theater and see \"\"Puppetry of the Penis.\"\" After the show, they (surprise!) go shopping.\n\nThe next morning Anna reads a letter from Bobby Trendy to Howard K. Stern. Bobby claims Howard has harrassed him. Bobby, in the letter, mentions a restraining order.\n\nAnna goes to make her first appearance on Hollywood Squares. Before the show she meets the center square, Ellen DeGeneres. While Anna is on Hollywood Squares, Bobby Trendy drops off some pillows. Howard dresses up as Bobby Trendy and mocks him.\n\nIt's Saturday night and Anna wants to have fun, so they go to an Anna Nicole look-alike show. Bobby Trendy is also invited. Backstage, they run into Bobby. Bobby claims to have been trying to bury the hatchet, but that Howard was","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-27","episode_number":12,"episode_type":"standard","id":441212,"name":"Halloween Party","overview":"Anna ends her association with Bobby Trendy; the gang celebrates Kim's birthday.\n\n* * *\n\nAnna has had enough of Bobby Trendy and wants everything that reminds her of him gone. So they tear apart the pink bed he delivered. They slash and rip it apart. Bobby says he was appalled by the destruction and says he thought Anna had more class than that.\n\nAnna, tired of people who ask her why she doesn't go on dates, goes to the Millionaire Club, where they set up beautiful women with millionaires.\n\nAnna says Kim is more than her assistant, she is her friend. Anna says Kim takes care of everything Anna and Daniel need. They have their fights, but they always make up. Kim's birthday is coming up and Anna wants to buy Kim a car. Anna and Howard go to a car dealership in Santa Monica to pick out a car. They decide to buy her a black \"\"Bug\"\".\n\nAnna and Howard hurry back to get on their costumes (Kim's party is on, or near, Halloween). Howard is Dracula, Anna is \"\"Draculess,\"\" Kim is a nun, and Frankie is th","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-03","episode_number":13,"episode_type":"finale","id":441217,"name":"The Date","overview":"Anna goes on a date she got from the Millionaire Club.\n\n* * *\n\nAnna goes on a date with Claude Dauman, a millionaire. She met him through the Millionaire Club, a company that sets up millionaires with dates.\n\nThe beginning of the episode chronicles Anna and Claude preparing for the date. Claude arrives, giving Anna roses, and even bringing Sugar Pie a special dog treat. And then they're off!\n\nClaude takes Anna to a fancy restaurant where they chat about Anna's dream of being a ballerina as well as other subjects. After the restaurant, they go to a place to ride a mechanical bull. After they eat again, and give the bull a try, Anna decides it's time to go home. In the limo ride on the way home, Anna lays her head in Claude's lap. Anna kisses Claude as he leaves. Afterward, both Anna and Claude confess that they had a good time.","production_code":"","runtime":30,"season_number":1,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":21363,"poster_path":"/82cfIfUCGuSSs4oDWB3RpUKN8at.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258095a19c29531db3e3d59","air_date":"2003-03-02","episodes":[{"air_date":"2003-03-02","episode_number":1,"episode_type":"standard","id":441196,"name":"Season 2 Premiere","overview":"Anna chooses between five bachelors.\n\n* * *\n\nIn this live and supersized season premiere, which is hosted by Joe Millionaire butler Paul Hogan, Anna has to choose between five bachelors. The bachelors are Jeff Hawkins, Brook Pemberton, Frank Miniaci, Mark Norris, and Mitchell Olson. The episode chronicles the search for the bachelors, Anna's date with them, and Howard putting each of them through a lie detector test. Anna narrows it down to three bachelors, eliminating Mitchell and Frank. Each remaining bachelor gets 30 seconds to state his case to Anna. Anna makes her decision: Mark.","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-09","episode_number":2,"episode_type":"standard","id":441198,"name":"Nature Calls","overview":"Anna and company go camping\n\n* * *\n\nDaniel doesn't want to be part of the show anymore. He says he doesn't want to be famous. Howard says they should mention it to Anna while they are camping. Anna, Daniel, Kim, and Howard are warned of the dangers of their camping experience. Howard and Kim leave to get supplies...\n\nAnna puts together a potty, and then starts a fire. Anna and Daniel discuss how he feels about doing the show. Daniel confesses he doesn't want to do it, and Anna says that's okay, all he had to do is say so. Anna freaks out when she hears coyotes, and retreats to her tent. Howard and Kim return, and they all roast weiners and sing a campfire song. Then they go to sleep. During the night, Anna yells for Howard and tells him that \"\"something is out here.\"\"\n\nRanger Steve returns to their camp site and takes the gang fishing. Daniel catches the first fish, a very small one. Anna rushes Howard to get the fish unhooked so they can throw it back. Anna calls Daniel a fish murderer, the","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-16","episode_number":3,"episode_type":"standard","id":441199,"name":"Shrew's the Boss","overview":"Anna sets her sights on the acting world.\n\n* * *\n\nAnna gets a call from Cedric the Entertainer asking her to be a guest on his TV show. She practices her lines for the show with Kim and Howard. Then we flash back to when Anna got information from an acting coach that sends her Shakespeare literature to practice - she reads the lines with Howard. In the lines, she must slap the person who is reading with her, and Howard got tired of that fast. She gets her make-up artist, Angie, to practice the lines with her. It doesn't turn out well when Anna slaps Angie (which is a little off and turned out to be more of a scratch), and Angie calls her a b****.\n\nAnna is visited by Dr. Amazing and an astrologer, Gemini. Dr. Amazing hypnotizes Anna to help her remember her lines, and make her feel better about acting.\n\nAnna prepares as well as she could, so she attends class. Her partner is actor Danny Bonaduce. Anna and Danny are put on the spot when they must practice their lines in front of an acting cl","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258095b19c29531db3e3dd9","order":501,"adult":false,"gender":2,"id":75315,"known_for_department":"Acting","name":"Danny Bonaduce","original_name":"Danny Bonaduce","popularity":3.508,"profile_path":"/A3TlkIbCKpYo4PF2BUEwVT0k63o.jpg"},{"character":"","credit_id":"5258095b19c29531db3e3def","order":505,"adult":false,"gender":2,"id":5726,"known_for_department":"Acting","name":"Cedric the Entertainer","original_name":"Cedric the Entertainer","popularity":15.099,"profile_path":"/s6UrY5uofyxXsU5PydWBoLFReK0.jpg"}]},{"air_date":"2003-03-30","episode_number":4,"episode_type":"standard","id":441197,"name":"To Live and Diaper in L.A.","overview":"Anna Nicole injures her knee; and trades places with a waitress.\n\n* * *\n\nThe first part of this episode is a mock E! True Hollywood Story that chronicles the gang going skating then Anna falling and hurting her knee.\n\nAnna gets frustrated about being inside all the time, so Howard and Kim take her to a restaurant in town. Anna decides she wants to trade places with the waitress at the restaurant. And so Anna becomes a waitress.\n\nAfter her shift, she can't go home - she has to take care of the children of the waitress, and the waitress gets a taste of how Anna Nicole's life is. In the end, Anna realizes she misses her own life.","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258095a19c29531db3e3da1","order":502,"adult":false,"gender":2,"id":76669,"known_for_department":"Acting","name":"Wayne Brady","original_name":"Wayne Brady","popularity":9.978,"profile_path":"/zRIYr4jl7LiEDbbaFcwFiRwLhw1.jpg"}]},{"air_date":"2003-04-06","episode_number":5,"episode_type":"standard","id":441200,"name":"Restoration Hard Way","overview":"Anna decorates her neighbor's room, while they decorate hers.\n\n* * *\n\nAnna trades spaces with her neighbors, Cris and Wes. Anna wants them to decorate her room of choice, and she wants to decorate theirs. The neighbors hire a designer, while Anna hires a designer of her own -- who just happens to be a dominatrix. Anna decides to male her neighbor's room a \"\"sex room.\"\"\n\nAfter shopping for the necessary items, Anna, Howard, and Kim get to work. They clear out the room and start the transformation. They paint all the walls black. Over at Anna's house, the neighbors use feng shui to decorate the room.\n\nFinally, it's time for the rooms to be revealed. Anna loves her room. Wes liked the room Anna had decorated, but after some discussion Cris decides it's best for them to redo the room (because it faces the street, and may be offensive to some people).","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-13","episode_number":6,"episode_type":"standard","id":441205,"name":"Even Cowgirls Get the Blues","overview":"Anna goes on a date with the bachelor she chose in episode 14; Howard visits his parents.\n\n* * *\n\nMark, from the season two premiere, takes Anna on a date in another town, which means they stay overnight (separately). He arrives to take her out in an eighteen-wheeler, which Anna is not happy about. On the long drive, Mark tries to draw Anna out, but all she wants to do is sleep. Anna is wide awake when a cop pulls Anna and Mark over. After a lousy ride, Anna decides to have a good time.\n\nThe next day, Anna and Mark enjoy breakfast and go to a rodeo. When Mark and Anna leave the stands they run into some cowboys. They convince her to ride a horse. As they ride, the cowboys sweet talks Anna, and asks her to spend the evening with them. She, with sadness, sends Mark packing. Anna enjoys a fun evening with the cowboys.\n\nMeanwhile, Howard goes to visit his parents. He upsets his mother by cursing, is asked to go to the dentist, and get a physical.","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-20","episode_number":7,"episode_type":"standard","id":441203,"name":"Lipstick Thespians","overview":"Anna returns to the film industry in the movie Wasabi Tuna.\n\n* * *\n\nAnna Nicole gets a script for an action-comedy movie called Wasabi Tuna, where she plays herself. When she found out her co-stars were Jason London, Antonio Sabato Jr., and Tim Meadows, she had Howard set up a meeting to seal the deal. Howard agrees to dress up as Anna for the movie. The producers ask Anna to attend a casting call for Anna drag queens. After Howard sees all the drag queens dressed as Anna, Howard has second thoughts about it.\n\nAnna is excited because it is the first shoot day for the movie. Anna gets up early and gets into her make-up, but she ends up waiting hours for them to call her to the set. When they get to the set they have problems with words Anna can and cannot use. Hours later, Anna is still waiting to go into make-up and shoot her scenes. Howard and Anna fight over what to do with Howard's penis when he wears the dress.\n\nThe time has come for Howard to dress as Anna Nicole. They cut his hair, p","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-27","episode_number":8,"episode_type":"standard","id":441202,"name":"Courting Disaster","overview":"Anna becomes a judge for the court show Texas Justice; and appears on The Tonight Show.\n\n* * *\n\nAnna is to make an appearance on The Tonight Show with Jay Leno, but lost her cowboy boots. So she and the gang pile into the limo and go a western store for some shopping. At the store, they run into Judge Larry Joe Doherty, of the real-life court show Texas Justice. Judge Doherty is in town to hear some cases to see if they could be brought to Texas to appear on the show. He asks Anna to come and hear some cases with him. He says since the cases don't involve money, all she has to do is decide what's fair.\n\nAnna appears on The Tonight Show as the easter bunny. She had thought she was going to be a guest. Afterward, she heads over to be a judge with Larry Joe Doherty. Kim is the bailiff and Howard interviews the people after the case is heard. The cases deal with a friend's \"\"package\"\" hanging out, make-up, loud parties, and a dog peeing on a plant.","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258095b19c29531db3e3e44","order":500,"adult":false,"gender":2,"id":14991,"known_for_department":"Acting","name":"Jay Leno","original_name":"Jay Leno","popularity":5.798,"profile_path":"/cplpY6q2VFtR7c1gMHM50wPzdU3.jpg"}]},{"air_date":"2003-05-04","episode_number":9,"episode_type":"standard","id":441204,"name":"Something Trendy This Way Comes","overview":"Anna has a gallery showing of her art.\n\n* * *\n\nAnna reveals her love for painting. So the gang go to get her paintings framed. She is told she could show off her paintings in a gallery. After some thought, Anna decides that a showing of her art may not be a bad idea. Soon, her paintings are priced and hanging on a wall.\n\nAt the gallery, Anna is greeted by many friendly and familiar faces. Bobby Trendy shows up. He claims that he is just passing by. Howard and Bobby get into an argument, and Bobby leaves. While Bobby is in his car leaving, Howard pounds on his window and yells at him some more.","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-11","episode_number":10,"episode_type":"standard","id":441201,"name":"Anna (Palm) Springs into Action","overview":"Anna and company go to Palm Springs.\n\n* * *\n\nPeople from a website ask Anna and company to go to Palm Springs and judge a body-building contest. She's disappointed when she finds out that the hotel isn't quite up to her standards. They all go out for dinner and drinks and discuss sex. Anna finds an onion in her food and is upset because she is allergic. When they bring her another plate, she finds more onions.\n\nAnna hopes the contest will put her in better spirits. Anna gets to meet the guys. She goes back to the hotel to start the contest. She has to ask weird questions and wonders what the contest is all about. She says she has been in Palm Springs for a whole day and hasn't had any fun yet. So she and the contestants have a party. Two women show up and get into the pool with Anna, and their father shows up. The cops show up and shut down the party.\n\nAnna wakes up the next morning with a monster hangover and wants to get out of Palm Springs fast, but first she has to finish the contest.","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"62299adad34eb3004699e41b","order":508,"adult":false,"gender":2,"id":2132258,"known_for_department":"Acting","name":"Kevin Peake","original_name":"Kevin Peake","popularity":5.713,"profile_path":"/cKponIgF6OFOQTfKPDsd7CWHFvd.jpg"}]},{"air_date":"2003-05-18","episode_number":11,"episode_type":"standard","id":441206,"name":"Do the Hustler","overview":"Larry Flynt asks Anna to direct a photo shoot for his magazine.\n\n* * *\n\nAnna has dinner with Larry Flynt. They talk about sex, of course. Larry offers her a chance to direct a photo shoot for his magazine.\n\nAfter arriving at the set, Anna discusses things with the photographer and helps the women get dressed. Anna takes pictures of the women, thinking that the women couldn't touch each other or be more alluring. When she finds out they could do more than she thought, she is upset. After discussing this with Clive, the photographer, Anna is given a second chance. This time, she will direct the girls while Clive takes the pictures.\n\nLarry was very happy with the pictures. He also asks Anna to invite him over to dinner sometime.","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-25","episode_number":12,"episode_type":"standard","id":441208,"name":"Derby Daze","overview":"Anna and company go to the Kentucky Derby.\n\n* * *\n\nAnna is invited to the Kentucky Derby and to a charity event. Anna and Howard start fighting over pictures of hats. On the plane Anna reads a book of lawyer jokes to Howard.\n\nHoward is in charge of placing bets for the group. Anna's betting strategy is to bet on almost all the horses. They are told they can't take Sugar Pie to the Derby. Anna is very upset and says she cannot go to the track without Sugar Pie.\n\nWhen things cool down they all, minus Sugar Pie, head off to the Kentucky Derby. Anna sees Larry King, Joey Fatone, and others. Afterwards, at the charity event Anna sees Kid Rock, Latoya Jackson, and Tammy Faye Bakker.\n\nHoward meets a woman, Stacy, in the bar, but has to deliver drinks to Anna first. He convinces Anna to go meet Stacy and her mother. On the way back to the room, Anna and Howard have a huge fight. They eventually make up, however.","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258095b19c29531db3e3ece","order":503,"adult":false,"gender":1,"id":1229925,"known_for_department":"Acting","name":"La Toya Jackson","original_name":"La Toya Jackson","popularity":4.759,"profile_path":"/qU4iatar3wk8xRHhHQBe0u68u4q.jpg"},{"character":"","credit_id":"5258095b19c29531db3e3ee4","order":506,"adult":false,"gender":2,"id":165867,"known_for_department":"Acting","name":"Kid Rock","original_name":"Kid Rock","popularity":4.981,"profile_path":"/rcVwdKYqb0NAiBhjKWzxuZzekGC.jpg"},{"character":"","credit_id":"5258095b19c29531db3e3efa","order":507,"adult":false,"gender":2,"id":92706,"known_for_department":"Acting","name":"Slash","original_name":"Slash","popularity":5.351,"profile_path":"/6fO19xVBCUvCPeNgcWvGBJYByhK.jpg"}]},{"air_date":"2003-06-01","episode_number":13,"episode_type":"finale","id":441207,"name":"Season Finale","overview":"Anna takes her cousin to get a makeover.\n\n* * *\n\nShelly, Anna's cousin, come to Los Angeles to visit Anna and get comfort from having problems with her boyfriend. Anna was also not happy - she had just seen an interview of Shelly that she didn't care for. Anna and Shelly fight and Anna makes Shelly apologize. Anna has a very emotional moment talking about how her family treats her. Anna asks Shelly to come back.\n\nAnna lets Shelly go anywhere she chooses. Shelly chooses to go to a salon. While Shelly and Kim have their hair colored, Anna gets some hair removed from her forehead. Afterwards, Anna takes Shelly to a tattoo parlor to get her belly button pierced. While at the parlor, they get a call from the salon saying there may be a problem with Shelly's hair. They must rinse her hair immediately.\n\nBack at the salon, Shelly's gets her hair cut. Anna then takes Shelly yo get a very expensive dress. Shelly chooses the next stop: a bar, where there is mud wrestling. Anna takes off her dress and","production_code":"","runtime":30,"season_number":2,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":21361,"poster_path":"/82cfIfUCGuSSs4oDWB3RpUKN8at.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258095a19c29531db3e3d64","air_date":"2004-03-23","episodes":[{"air_date":"2004-03-23","episode_number":1,"episode_type":"standard","id":441222,"name":"Season 3 Premiere","overview":"","production_code":"","runtime":30,"season_number":3,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-17","episode_number":2,"episode_type":"finale","id":441223,"name":"Anna Goes To Camp","overview":"","production_code":"","runtime":30,"season_number":3,"show_id":10947,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":21362,"poster_path":"/82cfIfUCGuSSs4oDWB3RpUKN8at.jpg","season_number":3,"vote_average":0}}}