{"adult":false,"backdrop_path":"/9byUBHvka2bikvidy5bpmXWfaRB.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2020-09-19","genres":[{"id":18,"name":"Drama"},{"id":10751,"name":"Family"},{"id":35,"name":"Comedy"}],"homepage":"http://program.kbs.co.kr/2tv/drama/homemadelovestory","id":109629,"in_production":false,"languages":["ko"],"last_air_date":"2021-03-07","last_episode_to_air":{"id":2774602,"name":"Episode 50","overview":"Min Jae returns home and gives Jung Hoo another chance. Hae Deun and Jun A come up with another plan to change their mom's hearts after they inadvertently trigger the fire alarm. Seo A realizes how badly she treated Chae Woon and apologizes to her. Meanwhile, Ra Hoon buys Eun Ji flowers, and Pil Hong gets an offer to stay at Samgwang Villa for the time being.","vote_average":0,"vote_count":0,"air_date":"2021-03-07","episode_number":50,"episode_type":"finale","production_code":"","runtime":66,"season_number":1,"show_id":109629,"still_path":"/kS8Ko4LUAmgtyG3xKU5ZK6oo7ka.jpg"},"name":"Homemade Love Story","next_episode_to_air":null,"networks":[{"id":342,"logo_path":"/nFmWwUAf2D3iAtizUcmkxufaM0q.png","name":"KBS2","origin_country":"KR"}],"number_of_episodes":50,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"오! 삼광빌라!","overview":"Strangers living together at the Samkwang Villa get to know each other and even fall in love.","popularity":28.669,"poster_path":"/sqMTarhApbUylV5dnNJnv3PxYtw.jpg","production_companies":[{"id":116360,"logo_path":"/AfvZsh1ImHqATwF6LCUz7QLcS4g.png","name":"Monster Union","origin_country":"KR"},{"id":126405,"logo_path":"/beAhkAErNhnTFZy2lmMaLT0LJML.png","name":"Production H","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2020-09-19","episode_count":50,"id":162497,"name":"Season 1","overview":"","poster_path":"/sqMTarhApbUylV5dnNJnv3PxYtw.jpg","season_number":1,"vote_average":5.2}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6,"vote_count":5,"season_data":{"1":{"_id":"5f5ee366fd7aa4003bec5bbf","air_date":"2020-09-19","episodes":[{"air_date":"2020-09-19","episode_number":1,"episode_type":"standard","id":2426030,"name":"Episode 1","overview":"Sun Jeong shares the same birthday as her three kids, Bit Chae Woon, Hae Deun, and Ra Hoon, so they plan to have a big party in the evening. Sun Jeong's sister Man Jeong visits the family to celebrate her birthday. Somehow, Chae Woon isn't too happy to see Man Jeong. Jae Hee goes to see Jung Won and Seo A be with them on a special day. Meanwhile, Chae Woon gets a call she's been waiting for.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/pR1ky85IYU7Fw3tclAJte2RBQ0l.jpg","vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-09-20","episode_number":2,"episode_type":"standard","id":2433792,"name":"Episode 2","overview":"After Bit Chae Woon meets a woman who could be her biological mother, she feels sorry for Sun Jeong. Sun Jeong thinks the woman who had approached her is strange, which leaves her feeling unsettled. Meanwhile, Bit Chae Woon's siblings discover she is looking for her biological mother, which starts a huge argument among them.","production_code":"","runtime":68,"season_number":1,"show_id":109629,"still_path":"/71G9iLqEai7Xsi4YcMbaUb38YII.jpg","vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-09-26","episode_number":3,"episode_type":"standard","id":2442762,"name":"Episode 3","overview":"Out of anger and frustration, Chae Woon heads to the CEO of LX Fashion's house. At the gate, she faints, and Jung Won takes her in. Jung Won promises Chae Woon that she'll look into the case. Later, Jung Won calls Chae Woon into the office to explain the evaluation process. Even after hearing the explanation, Chae Woon still wants to prove her innocence, so Jung Won offers her an internship instead of giving her the prize.","production_code":"","runtime":67,"season_number":1,"show_id":109629,"still_path":"/aw2DicoCwsxqDpsS2ZcswLxqZF3.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-09-27","episode_number":4,"episode_type":"standard","id":2442763,"name":"Episode 4","overview":"Chae Woon loses her patience and lets all her frustration out on Sun Jeong. Hae Deun, Ra Hoon, and Man Jeong stick up for Sun Jeong, but they each get a taste of the painful stories she had been keeping inside. Man Jeong, who gets the worst of it, goes out drinking solo and returns on Hwak Se's back. The next day, Chae Woon realizes she's lost her cell phone.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/ti2qUsZ1AnPWAajvV5bAMRZbo5b.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-10-03","episode_number":5,"episode_type":"standard","id":2452461,"name":"Episode 5","overview":"Jae Hee is welcomed by everyone at Samgwang Villa. Chae Woon starts working at LX Fashion and has a hard time getting up to speed. A new tenant moves into the basement floor of Samgwang Villa. When Jae Hee recognizes him, he's very suspicious of his intentions. Sun Jeong helps out with the party at her boss' house and runs into Jung Won. Jung Won recognizes Sun Jeong.","production_code":"","runtime":67,"season_number":1,"show_id":109629,"still_path":"/5R6H653YfKnFGQm7jrIDW3ZigAy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-10-04","episode_number":6,"episode_type":"standard","id":2452462,"name":"Episode 6","overview":"After reuniting with Jung Won, Sun Jeong, without knowing, feels immensely guilty about her happiness to see her. Jae Hee is thrown into a storm of confusion when he learns about Chae Woon's past, and Min Jae shouts a startling remark at Jung Hoo, who had been secretly tailing her. Meanwhile, Chae Woon confronts Seo A when she sees she was deliberately excluded from the interns' presentation.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/bFhAKiIbwLvhelSUwZvO7J1PcKc.jpg","vote_average":4,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-10-10","episode_number":7,"episode_type":"standard","id":2459909,"name":"Episode 7","overview":"Jung Won receives a mysterious call regarding her lost daughter. She's shaken over it. Hae Deun causes trouble again, and this time, she used Man Jeong's credit card without permission. Out of frustration, Man Jeong leaves Samgwang Villa. Chae Woon looks for Park So Mi, the girl who framed her for bullying Seo A back in middle school. However, So Mi pretends not to know about it. Meanwhile, Min Jae sends her divorce lawyer to Jung Hoo.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/1gp1ftI0dolU6ijbEF6Qv5kGptH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-10-11","episode_number":8,"episode_type":"standard","id":2459910,"name":"Episode 8","overview":"Sun Jeong gets Chae Woon to tell her what's going on, and Chae Woon explains it's about Seo A. Jae Hee finds out where So Mi, Seo A's middle school friend, works and tells Chae Woon. Later, Jae Hee tries to talk some sense into his dad, but instead, he ends up renouncing his inheritance. Meanwhile, Chae Woon visits So Mi and Hae Deun auditions for Slight Entertainment.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/hHjV82EL9prsZ9gVuCd5M2TNoYq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-10-17","episode_number":9,"episode_type":"standard","id":2467329,"name":"Episode 9","overview":"Jung Hoo gets on his knees and begs Min Jae to come back home, but Min Jae doesn't falter in her determination to get a divorce. Jae Hee overhears Hae Deun and Ra Hoon talking and finds out that Hae Deun didn't pass the audition. Jung Won and Sun Jeong meet up for dinner and catch up with each other. Jung Won is happy to reminisce about the good old days with Sun Jeong, but Sun Jeong isn't so comfortable with her. Min Jae and Jung Hoo end up getting divorced, leaving Jae Hee heartbroken.","production_code":"","runtime":68,"season_number":1,"show_id":109629,"still_path":"/eUO55rI2tCGM63CChPxKGRfY49X.jpg","vote_average":4,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-10-18","episode_number":10,"episode_type":"standard","id":2467330,"name":"Episode 10","overview":"Chae Woon tries to console Jae Hee about his parents' divorce, while Jung Hoo adjusts to living alone. Later, Jung Won asks Sun Jeong to prepare a dinner party for Seo A and her team at her house. Meanwhile, Man Jeong gets caught sneaking back into Samgwang Villa to grab her things, but Sun Jeong won't let her leave. Later, Jung Won visits Pil Hong at the correctional facility and asks him about the suspicious person lurking around her.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/fGMmnN7IQmZOffgdyS3d29ki2SZ.jpg","vote_average":4,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-10-24","episode_number":11,"episode_type":"standard","id":2475792,"name":"Episode 11","overview":"Jung Hoo wakes up in the emergency center but doesn't remember who he is. Sun Jeong sees he's having trouble, so she decides to let him stay at Samgwang Villa until he recovers fully. Jung Hoo begs Sun Jeong and Hwak Se not to tell anyone else that he's staying at their house, so they decide to keep it a secret from the other residents. Meanwhile, Seo A sees Chae Woon's baby photo and realizes that she was the baby in the photo that Jung Won had.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/nrkgQNFtvMYqEa6vczB5kfNYpgr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-10-25","episode_number":12,"episode_type":"standard","id":2475793,"name":"Episode 12","overview":"Ra Hoon tells Jae Hee about the suspicious offer Hae Deun got from a new agency. When Hae Deun is about to sign the fake contract, Jae Hee and Na Ro show up to save her. However, Hae Deun feels more embarrassed than grateful. Sun Jeong gets invited to the launching event party of LX Fashion. There, she sees Jung Won being sweet to Chae Woon.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/juvcCFCtmB0bghOQZzSBLzUt0Hb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-10-31","episode_number":13,"episode_type":"standard","id":2485677,"name":"Episode 13","overview":"Sun Jeong tells Jung Won that Chae Woon is her daughter, and upon hearing the news, Jung Won is all the more glad to have her as her employee. Jae Hee finds out that Jung Hoo is suffering from amnesia and decides not to tell anyone his identity for the moment. Seo A invites Jae Hee to the team dinner and introduces him as her boyfriend. Worried that Chae Woon might get the wrong idea, Jae Hee tells everyone that he and Seo A are just friends.","production_code":"","runtime":67,"season_number":1,"show_id":109629,"still_path":"/e5PP37tqARlsgEynf83uDt71n9e.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-11-01","episode_number":14,"episode_type":"standard","id":2485678,"name":"Episode 14","overview":"Jae Hee takes Jung Hoo to get a checkup at the hospital. He finds out that he's perfectly fine. He questions for a moment that Jung Hoo could be lying but soon figures out that he's not. Jung Won gets invited to Samgwang Villa, where she meets everyone. Seeing how Chae Woon admires Jung Won so much, Sun Jeong decides to tell Chae Woon the truth. Meanwhile, Chae Woon rejects Jae Hee, saying she wants to be on good terms with Jung Won.","production_code":"","runtime":67,"season_number":1,"show_id":109629,"still_path":"/yPoFWjDj0DM8tbhGm374BvQ3P5I.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-07","episode_number":15,"episode_type":"standard","id":2498625,"name":"Episode 15","overview":"Sun Jeong tells Chae Woon that Jung Won is her birth mother. Shocked and confused, Chae Woon yells at Sun Jeong for not telling her sooner and insists on seeing Jung Won right away. They go to Jung Won's house, but they can't bring themselves to go inside. The next day, Jung Won asks Chae Woon to accompany her to the columbarium where she put the urn of her daughter, which she thought she had lost. Chae Woon is shocked by the fact that Jung Won thinks she doesn't exist in this world.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/wGzghTOjuYa5RNT6SbiLvRBM2TU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-08","episode_number":16,"episode_type":"standard","id":2498626,"name":"Episode 16","overview":"Chae Woon can't bring herself to go back home as she suddenly feels isolated and alone. She decides to have a sleepover at her friend's house, making Sun Jeong even more worried. Min Jae visits Jae Hee's neighborhood and sees Jung Hoo walking by. Chae Woon calls in sick because she's not ready to face Jung Won at work. Worried that things will get worse, Sun Jeong decides to meet Jung Won herself and tell her the truth.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/enaIBogvZyDNhUB19CpxV7v7KzP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-14","episode_number":17,"episode_type":"standard","id":2507642,"name":"Episode 17","overview":"Sun Jeong tells Jung Won about how Seo Yeon came to be with her, but Jung Won has a hard time believing her. However, they end up in a scuffle that Chae Woon sees. Jung Won faints and gets taken to the hospital. Later, Sun Jeong tries to tell Chae Woon why she didn't tell her that Jun Won is her biological mother, but Chae Woon reminds her that she doesn't want to know and that she is her mom.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/oAzhqlBKFjTS5HeV7biA7W76gMb.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-11-15","episode_number":18,"episode_type":"standard","id":2507643,"name":"Episode 18","overview":"Sun Jeong and Jung Won decide to tell Chae Woon about the DNA test results. Although Jung Won expresses her wishes to be Chae Woon's mom, Chae Woon refuses. After Sun Jeong and Chae Woon return home, the residents of Samgwang Villa get together for dinner. Meanwhile, Jae Hee helps Jung Hoo attend an emergency board meeting at the office.","production_code":"","runtime":68,"season_number":1,"show_id":109629,"still_path":"/pNS3SwSVNIWyGmow8hZfLWAmkL.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2020-11-21","episode_number":19,"episode_type":"standard","id":2520221,"name":"Episode 19","overview":"Jung Won comes to Samgwang Villa to see Chae Woon, but she can't bring herself to take Chae Woon with her. Sun Jeong, along with everyone else, is shaken by the fact that Chae Woon could leave them anytime soon, but Chae Woon decides to stay with Sun Jeong, no matter what happens. However, Sun Jeong decides it's better for Chae Woon to live with Jung Won when he realizes how Pil Hong can mess up Chae Woon's life.","production_code":"","runtime":67,"season_number":1,"show_id":109629,"still_path":"/fEfAKuvRT4NbnNm8R9JUKdDgfPy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-22","episode_number":20,"episode_type":"standard","id":2520222,"name":"Episode 20","overview":"By chance, Chae Woon picks up a call from Jung Won's mom and hears things she shouldn't have heard. She decides to live with Jung Won to understand what really happened when she was young. Min Jae barges into Samgwang Villa in the middle of the night and finds Jung Hoo in Jae Hee's room. Jae Hee tells her that Jung Hoo has amnesia, and Min Jae is devastated. Meanwhile, Jae Hee finally finds out who Na Ro really is.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/m0JTpsQ6Kavoof423NzC6sHgZWV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-28","episode_number":21,"episode_type":"standard","id":2533656,"name":"Episode 21","overview":"Chae Woon leaves Samgwang Villa and arrives at Jung Won's house. There, she meets Chun Seok, her grandmother, who had tried to blame everything on Sun Jeong. Seo A explodes into a jealous rage over Chae Woon's arrival. Meanwhile, Na Ro lashes out when Jae Hee suspects his motives, and Jung Hoo continues to get headaches when he starts to remember more from his past.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/zva1HJS5NZ6DJ0sYvPDcJndy1jT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-29","episode_number":22,"episode_type":"standard","id":2533657,"name":"Episode 22","overview":"Min Jae comes to take Jung Hoo home, but he can't believe that Min Jae is his wife. Meanwhile, Hwak Se goes to sing at an event where Man Jeong is present. She sticks up for Hwak Se in front of all her friends, and they have a heart-to-heart conversation. Later, Jung Hoo wakes up in the hospital to find Jae Hee and Min Jae at his bedside.","production_code":"","runtime":71,"season_number":1,"show_id":109629,"still_path":"/645eMYIyqDtiKZi4ifllbEhbgWP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-05","episode_number":23,"episode_type":"standard","id":2544937,"name":"Episode 23","overview":"Jung Hoo wakes up in the hospital with his memory restored. He heads home with Min Jae and Jae Hee. Meanwhile, Jung Won asks Chae Woon to open up to her more, but the mood in the house gets awkward when Seo A's jealousy continues to grow. Later on, Na Ro goes to see Seo A, and the pair come up with a scheme to get Chae Woon in trouble.","production_code":"","runtime":68,"season_number":1,"show_id":109629,"still_path":"/ld2mpUCGhd30ynLqqMbKEmgnHHR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-06","episode_number":24,"episode_type":"standard","id":2544939,"name":"Episode 24","overview":"Chun Seok tells Sun Jeong to leave for Chae Woon's sake, but Sun Jeong stands her ground. Jung Hoo feels lonely now that he's back home, and Jae Hee suggests that they don't let the residents of Samgwang know about his memory coming back. Meanwhile, Chae Woon takes on a big project at work, but someone gets her into trouble on purpose.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/p7RnE2SqL4HKctgSMChPz1OcSmq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-12","episode_number":25,"episode_type":"standard","id":2555082,"name":"Episode 25","overview":"Chae Woon tries to find out who's behind the conspiracy to sabotage her, but that only creates bigger gaps between Chae Woon and Jung Won. When Jae Hee finds out about what happened to Chae Woon, he suspects Na Ro and warns him to stay away from Chae Woon. Meanwhile, Sun Jeong finally makes up her mind to take action for Chae Woon.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/jwpdKYaXVNabh2fnZg4HlPhSPR9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-13","episode_number":26,"episode_type":"standard","id":2555083,"name":"Episode 26","overview":"Seo A gets upset when both Jung Won and Jae Hee try to only protect Chae Woon from troubles. Seo A is also going through a hard time, but Na Ro is the only person checking up on her. Meanwhile, Sun Jeong tells Jung Won that Chun Seok is threatening her. However, it only infuriates Chun Seok even more.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/fEms2sY1W1m617jRoVhaEQSSY5w.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-19","episode_number":27,"episode_type":"standard","id":2568519,"name":"Episode 27","overview":"As Na Ro is following Seo A around everywhere, all the time, Jae Hee starts to worry about Seo A. Chun Seok tries to corner Sun Jeong again, but Jung Hoo stops Chun Seok and saves Sun Jeong from trouble. Both Jae Hee and Min Jae are suspicious about Jung Hoo's feelings for Sun Jeong. Meanwhile, Chae Woon meets Chun Seok to find out why she is constantly threatening Sun Jeong.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/dAtnDzLpc1jXURj0287cLeIAwVG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-20","episode_number":28,"episode_type":"standard","id":2568520,"name":"Episode 28","overview":"Na Ro shows up in front of Pil Hong and warns him not to provoke him in any way. Man Jeong remembers seeing Na Ro from prison and questions whether the side of him she knows now is genuinely who he is. Meanwhile, Chairwoman Lee calls Sun Jeong and threatens her to leave town, and Min Jae shares with Jung Won what she saw at Sun Jeong's place. Meanwhile, Jung Won becomes anxious about the fact that Pil Hong wants her to accept him as Seo Yeon's father.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/53yQdzi3i3GvjTwDxg6kqCe0l6b.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-26","episode_number":29,"episode_type":"standard","id":2589498,"name":"Episode 29","overview":"Sun Jeong finally gets to clear her name regarding Chae Won but angers Chairwoman Lee and shocks Jung Won. Jung Hoo reflects on the past and regrets how selfish he had been. He promises to stay away from Min Jae and begins to change. Meanwhile, Pil Hong gets ready to make his move, and Man Jeong confronts Na Ro about his past.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/mKAhC8BfBUg9Fc4XDq7KdwPiJen.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-27","episode_number":30,"episode_type":"standard","id":2589499,"name":"Episode 30","overview":"Jung Hoo tells Min Jae to stop worrying about him and resumes working part-time at the restaurant. Still worried, Min Jae visits Sun Jeong for a quick chat. However, unknowingly, she leaves Sun Jeong's house with the dictionary that Jung Hoo had given her in the past. Meanwhile, Pil Hong has dinner with Chae Woon and Jae Hee and sews up Mr. Teddy that Chae Woon cherishes. Later, Jung Won invites Sun Jeong and the kids over for dinner.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/rhs052C5JcmoWr3QNgSB9whz5PF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-02","episode_number":31,"episode_type":"standard","id":2611083,"name":"Episode 31","overview":"Sun Jeong can't believe what Jung Won tells the directors and leaves the house without staying for dinner. Chae Woon takes her home. Man Jeong senses something strange and asks what happened, but nobody says a word. Later, Jung Won comes over to Samgwang Villa to apologize.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/aJa4Bo5xiOwYBd2TOOo6Jq6DC3g.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-03","episode_number":32,"episode_type":"standard","id":2611086,"name":"Episode 32","overview":"Hwang Na Ro becomes the chairwoman's personal assistant and a full-time employee. No matter how hard Jung Won is against the idea, she has no choice but to give in. Meanwhile, Jae Hee learns that Mr. Lee is Park Pil Hong, Chae Woon's father, who he had been trying to locate. However, after confronting him about it, he disappears from the job site.","production_code":"","runtime":68,"season_number":1,"show_id":109629,"still_path":"/loDWntiNZCQXEUV0wl9HrKkJVB1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-09","episode_number":33,"episode_type":"standard","id":2626051,"name":"Episode 33","overview":"Chae Woon says yes to Jae Hee's marriage proposal. However, when she gets home, Sun Jeong and Jung Won are there to let her know that it would be best if she returns to Samgwang Villa. Meanwhile, Pil Hong warns Na Ro to stay away from his daughter Chae Woon, and Ra Hoon keeps Ba Reun from leaving Samgwang Villa. Later, Jun A returns home to Jung Won and tells her that Park Pil Hong is working with Jae Hee.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/s68mFW7h5HYejR7DgrD22SqhhaS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-10","episode_number":34,"episode_type":"standard","id":2626052,"name":"Episode 34","overview":"Regrettably, Chae Woon figures out who Park Pil Hong is and runs out upset, blaming Jae Hee for not telling her. Man Jeong and Hwak Se meet with Na Ro and advise him to leave Samgwang Villa. Meanwhile, Pil Hong quits working for Jae Hee and leaves, and Jung Won warns her mother not to deal with Pil Hong. Later, Sun Jeong makes a big dinner for everyone at Samgwang Villa, and Seo A finds out about Jae Hee and Chae Woon's engagement.","production_code":"","runtime":67,"season_number":1,"show_id":109629,"still_path":"/l4QWChsIoKsFc8HH5I6XO0J95wY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-16","episode_number":35,"episode_type":"standard","id":2646406,"name":"Episode 35","overview":"Jae Hee and Chae Woon are stunned to hear Min Jae is against their marriage. Jae Hee figures it might have something to do with Jung Hoo and Sun Jeong's past relationship, and he heads over to see him. Meanwhile, Sun Jeong is shocked to learn that Na Ro left Samgwang Villa. Pil Hong works out a deal with Chairwoman Lee that could hurt Jae Hee. Later, Chae Woon talks with Jung Won and ends up quitting LX Fashion.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/qMoFRI1V9X4JlNxJcu9cRq8NqCn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-17","episode_number":36,"episode_type":"standard","id":2646407,"name":"Episode 36","overview":"It's a big day at Samgwang Villa. Everyone shares a hearty breakfast and goes their separate ways. Jae Hee gets ready to close a big contract, and Ra Hoon and Ba Reun prepare themselves to buy a used food truck. Later, Chae Woon changes her mind about leaving LX, and Hae Deun rushes over to see Jun A, lying sick in bed. Meanwhile, in the shadows, Park Pil Hong starts to move.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/qkczEleDOC7GaCQhlrwYS7yoyYg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-23","episode_number":37,"episode_type":"standard","id":2671400,"name":"Episode 37","overview":"Jae Hee is taken to the hospital. Chae Woon rushes to get answers from Na Ro. However, Seo A warns her this is just the beginning. At the hospital, Chae Woon learns that Jae Hee gets panic attacks. Meanwhile, Man Jeong leaves Samgwang Villa because of Sun Jeong's reaction to her dating Hwak Se. Pil Hong calls Jae Hee regarding the deal.","production_code":"","runtime":68,"season_number":1,"show_id":109629,"still_path":"/vDnYvERh5fyNOpUYo1rSZYngMXf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-24","episode_number":38,"episode_type":"standard","id":2671401,"name":"Episode 38","overview":"Pil Hong gets arrested in front of Chae Woon, but she denies that she's his daughter to the police. While Jae Hee sincerely apologizes to the people affected by the contract falling through, Min Jae finds out about what happened and blames it on Jung Hoo. Meanwhile, Jun A meets Na Ro for the first time and grows suspicious of his intentions. Later, Jae Hee testifies to Park Pil Hong's innocence, upsetting Chae Woon.","production_code":"","runtime":69,"season_number":1,"show_id":109629,"still_path":"/hwKIXIh5V9R8e3L4DGk5gK08HJ4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-30","episode_number":39,"episode_type":"standard","id":2693343,"name":"Episode 39","overview":"Chae Woon has a hard time after Jae Hee leaves Samgwang Villa, but she keeps her head up and devotes herself to her work. Jun A and Hae Deun go to LX for work but need an extra model and call Ba Reun for help. Sun Jeong tracks down Hwak Se and gives him an earful for running away. Meanwhile, Min Jae accuses Seo A of causing Jae Hee's contract to fall through, but Seo A lies to Min Jae that she had anything to do with it.","production_code":"","runtime":68,"season_number":1,"show_id":109629,"still_path":"/3XhArf1vBVlOu1CF1Aiw6w3Y78B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-31","episode_number":40,"episode_type":"standard","id":2693349,"name":"Episode 40","overview":"Jung Won, who has an important meeting soon, worries about Chae Woon being in the hospital. Sun Jeong gets to the hospital and earnestly requests Pil Hong to leave Chae Woon alone. Thanks to Pil Hong, Jae Hee learns about what happened and comes rushing to the hospital. Meanwhile, Jun A tries to move into Samgwang Villa until he sees Jung Won standing out in front.","production_code":"","runtime":66,"season_number":1,"show_id":109629,"still_path":"/iZpQt6ayMbShAqThMH7NiBp0Tfb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-06","episode_number":41,"episode_type":"standard","id":2710547,"name":"Episode 41","overview":"Jae Hee wants to go back to Samgwang Villa. Chae Woon visits Jae Hee's office since she misses Jae Hee and runs into Pil Hong. Meanwhile, Seo A runs away from home to be with Na Ro, whom she trusts the most because she feels Jung Won betrayed her. Chun Seok tries to use Pil Hong to do something to stop Jung Won from dismissing her from her position.","production_code":"","runtime":67,"season_number":1,"show_id":109629,"still_path":"/fIdJOdYA8NN4AOb4GPKz5LlNX5g.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-07","episode_number":42,"episode_type":"standard","id":2710583,"name":"Episode 42","overview":"Jung Won reveals that Chae Woon is her biological daughter at the emergency board meeting and gets Chairwoman Lee relieved of her position. The news spreads throughout the company. However, Seo A becomes frantic and retaliates by telling Jung Won she will marry Na Ro. Meanwhile, Chae Woon meets with Min Jae, who mentions Park Pil Hong because of concern for Jae Hee.","production_code":"","runtime":70,"season_number":1,"show_id":109629,"still_path":"/mWEUjM7NEteyxWGca8L40mVBmqI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-13","episode_number":43,"episode_type":"standard","id":2727137,"name":"Episode 43","overview":"Jung Won visits Samgwang Villa to have a gathering as a family for the first time, and she gets closer to Hae Deun as well. With Min Jae's help, Jung Hoo spends time with Chae Woon and Jae Hee to get along with them. Meanwhile, Seo A comes back to the office after the investigation at the police station. She realizes her colleagues are talking behind her back, and she takes out her anger on Jun A and Hae Deun.","production_code":"","runtime":66,"season_number":1,"show_id":109629,"still_path":"/iw9oMflT6ODPNXvDnZVpflDdshq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-14","episode_number":44,"episode_type":"standard","id":2727142,"name":"Episode 44","overview":"Chae Woon and Jae Hee get utterly shocked when they find out about Hae Deun and Jun A's relationship. Although they try to talk some sense into them, Jun A and Hae Deun state the facts and adamantly justify their relationship. Meanwhile, Ra Hoon tells the people at Samgwang Villa about his call to mandatory military service.","production_code":"","runtime":65,"season_number":1,"show_id":109629,"still_path":"/A7nVjrK6qgmgEXI2bGqKDOksEJF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-20","episode_number":45,"episode_type":"standard","id":2743168,"name":"Episode 45","overview":"Sun Jeong and Jung Won catch Hae Deun and Jun A together and learn about their absurd relationship. At their distress call, Chae Woon and Jae Hee rush to Samgwang Villa. They calm the situation, but in the end, Jun A goes home with Jung Won. Later, Seo A warns Hae Deun to stay away from her brother, but it turns into an altercation that gets out of hand. Meanwhile, Hwak Se gets ready for the singing competition.","production_code":"","runtime":64,"season_number":1,"show_id":109629,"still_path":"/m2iTM9HGfatspq8zY7TbTQscP0b.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-21","episode_number":46,"episode_type":"standard","id":2743169,"name":"Episode 46","overview":"Jun A brings Hae Deun to his house, and they sit together before Jung Won, hoping to persuade her to approve their relationship. Hwak Se realizes his missed opportunity to be a singer deeply upsets Man Jeong, and he finds a way to apologize to her. Meanwhile, Sun Jeong gets a call from the orphanage letting her know that Kim Eun Ji, a woman who could be Ra Hoon's biological mother, will be visiting her.","production_code":"","runtime":63,"season_number":1,"show_id":109629,"still_path":"/375w6TBkCfRv6FEA4wPjUwOFiOd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-27","episode_number":47,"episode_type":"standard","id":2760285,"name":"Episode 47","overview":"Pil Hong cherishes the jacket Chae Woon had given him, but Jae Hee feels bad he didn't tell her about his whereabouts. Man Jeong runs into Eun Ji, peering into Samgwang Villa, and realizes there's something else to her and asks Sun Jeong about it. Meanwhile, Hae Deun and Jun A try to win their moms' hearts over and end up doing something drastic, and Seo A tries to pay off Professor Kim.","production_code":"","runtime":65,"season_number":1,"show_id":109629,"still_path":"/fvpEYcSz3b4Sebunbf2rIWKp1bh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-28","episode_number":48,"episode_type":"standard","id":2760286,"name":"Episode 48","overview":"Jung Hoo asks Min Jae to give him one last chance while Man Jeong confronts Eun Ji and Hwak Se about what she knows. Sun Jeong contemplates accepting Pil Hong as Jun A works diligently to win her heart. Meanwhile, Hae Deun gets hired as Jung Won's stylist and also tries to win her over. Later, Jung Won receives an anonymous parcel that enrages her.","production_code":"","runtime":67,"season_number":1,"show_id":109629,"still_path":"/zSlPXmABjnkaaVfTBt4I9btxtIc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-06","episode_number":49,"episode_type":"standard","id":2774599,"name":"Episode 49","overview":"Luckily, Chae Woon's blood matches Pil Hong's, and she donates her blood to save him. Everyone waits anxiously for Pil Hong to regain consciousness, including Jung Won. Meanwhile, Seo A follows Na Ro and professes her love for him, and Man Jeong and Hwak Se tell Sun Jeong about the DNA test between Eun Ji and Ra Hoon.","production_code":"","runtime":66,"season_number":1,"show_id":109629,"still_path":"/kw7cBxvVt9r31PZbG8tdrv9jOy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-07","episode_number":50,"episode_type":"finale","id":2774602,"name":"Episode 50","overview":"Min Jae returns home and gives Jung Hoo another chance. Hae Deun and Jun A come up with another plan to change their mom's hearts after they inadvertently trigger the fire alarm. Seo A realizes how badly she treated Chae Woon and apologizes to her. Meanwhile, Ra Hoon buys Eun Ji flowers, and Pil Hong gets an offer to stay at Samgwang Villa for the time being.","production_code":"","runtime":66,"season_number":1,"show_id":109629,"still_path":"/kS8Ko4LUAmgtyG3xKU5ZK6oo7ka.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":162497,"poster_path":"/sqMTarhApbUylV5dnNJnv3PxYtw.jpg","season_number":1,"vote_average":5.2}}}