{"adult":false,"backdrop_path":"/hRQfwDzTXpUrIEkPaQXt4mldNsh.jpg","created_by":[{"id":7624,"credit_id":"52580eb719c29531db438d94","name":"Stan Lee","gender":2,"profile_path":"/kKeyWoFtTqOPsbmwylNHmuB3En9.jpg"},{"id":18866,"credit_id":"52580eb719c29531db438d9a","name":"Jack Kirby","gender":2,"profile_path":"/ihhR019gL1WrXdSQNJITAY6dont.jpg"}],"episode_run_time":[30],"first_air_date":"1982-09-18","genres":[{"id":16,"name":"Animation"}],"homepage":"http://hulk.toonzone.net/","id":11328,"in_production":false,"languages":["en"],"last_air_date":"1983-10-08","last_episode_to_air":{"id":449804,"name":"The Hulk Destroys Bruce Banner","overview":"At Gamma Base, Bruce and Betty are testing the new Transmat, a device that can transport an object from one place to another. Bruce volunteers himself as a human test subject, but during the process, the Transmat beam changes him into the Hulk, who is transported to Betty's end of the beam. The Transmat is destroyed by the Hulk, who then escapes from the base. Betty theorizes that Banner's pattern might still be in the machine, and that the only way of getting him back will be to duplicate the original experiment's conditions by putting the Hulk back into the Transmat beam. Approaching the town of Twilight Junction, the Hulk turns back into Banner, who finds out that a Gamma Base scientist has been disintegrated. Thinking that it was Betty, Bruce attempts to hand himself over to the authorities, telling them that he is the Hulk, but with no success. As Betty feverishly works to repair the Transmat before it is shut down and shipped back to the Pentagon, Major Talbot and his Hulkbusters","vote_average":0,"vote_count":0,"air_date":"1983-10-08","episode_number":13,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null},"name":"The Incredible Hulk","next_episode_to_air":null,"networks":[{"id":6,"logo_path":"/cm111bsDVlYaC1foL0itvEI4yLG.png","name":"NBC","origin_country":"US"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"The Incredible Hulk","overview":"The Incredible Hulk is an animated television series based on the Marvel Comics character of the same name. The series ran for 13 episodes on NBC in 1982, part of a combined hour with Spider-Man and His Amazing Friends. Unlike the previous live-action The Incredible Hulk television series from Universal in the 1970s, this series was based upon the Hulk comic-books and was able to portray the more fantastical elements of the comics as sticking to his true name and origin as well as featuring the return of the original characters in his life all of which the live-action series refused to show. It featured stories faithful to the source material from Marvel, In addition, new recurring characters were created for the series including the Hispanic family of father Rio and his youthful daughter Rita.","popularity":48.75,"poster_path":"/eg1HgM1kF0SJbYsWVmpP2BjvPUU.jpg","production_companies":[{"id":66062,"logo_path":null,"name":"Pan Sang East Co.","origin_country":""},{"id":2301,"logo_path":"/qdPhBEP8sjK3Eb3rKc94554gcZt.png","name":"Marvel Productions","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"1982-09-18","episode_count":13,"id":21829,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.522,"vote_count":23,"season_data":{"1":{"_id":"52580eb619c29531db438c0c","air_date":"1982-09-18","episodes":[{"air_date":"1982-09-18","episode_number":1,"episode_type":"standard","id":449792,"name":"Tomb Of The Unknown Hulk","overview":"An intense solar flare from the Sun creates a wave of radiation over the Earth. At the same time, Gamma Base is in charge of the highly powerful substance Perium-99. With the base's radio communication equipment rendered useless by the radiation, Dr. Octopus decides to use this opportunity to steal the Perium-99. As Rick checks up on Bruce at the base, Banner begins spontaneously changing into the Hulk due to the radiation wave. Rick subdues the Hulk and restores Banner to normal, but they soon both leave the base in case Bruce begins to change again. As Doc Ock's men infiltrate the base, Major Talbot discovers their presence and alerts General Ross. After trying to locate Banner for their investigation, Talbot follows Banner, but the radiation flares up again and Banner transforms into the Hulk, who trashes the army's trucks as well as the base's radar. With no warning, Doc Ock's men take full control over Gamma Base, and Ock himself quickly steals the Perium-99. Meanwhile, Rick leads","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1982-09-25","episode_number":2,"episode_type":"standard","id":449793,"name":"Prisoner Of The Monster","overview":"The Sonar Crystallizer, a highly powerful device capable of reducing anything to dust, is due to be tested at Gamma Base, and a villain known as the Spymaster sets his sights on it. Meanwhile, Rio tells Rick about an ancient curse that befell a prince of the Yucatan in South America. The prince was trapped in a forbidden, enchanted volcano that caused him to turn him into a green beast similar to the Hulk whenever he became angry. Eventually, a tribe magician used a secret potion was used to permanently cure the prince, and the potion was enshrined in a temple. Rick tells Banner about this legend, and Banner immediately travels to the Yucatan along with him. As Banner explores Yucatan with Rick, Spymaster infiltrates Gamma Base as a phoney General. In the Yucatan jungle, Banner's party comes under attack by the ancient tribe they were looking for, and Banner becomes the Hulk, who drives the warriors off. Bruce and Rick eventually locate the ancient temple, and after evading several boo","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1982-10-02","episode_number":3,"episode_type":"standard","id":449794,"name":"Origin Of The Hulk","overview":"In the desert of New Mexico, a mysterious U.F.O. is detected close to Gamma Base, an army facility where a new weapon known as the Gamma Bomb is due to be tested. The inventor of the bomb is Dr. Bruce Banner, assisted by his fiance Betty Ross and the edgy Dr. Carlson, who is very eager to get a hold of Banner's Gamma formula. The U.F.O. is shot down by fighter jets, but not before an escape pod is secretly jettisoned. As the countdown to the Gamma Bomb's detonation continues, teenager Rick Jones accidentally breaks down in the test area. Banner asks Carlson to halt the countdown while he rescues the kid, but Carlson lets it continue. As Banner gets to Rick, the Gamma Bomb explodes. Banner gets Rick to safety in a ditch, but he is bombarded with the full force of the Gamma Rays. That night, in the base hospital, Banner and Rick are being held for observation, while Dr. Carlson assures his true superior inside the U.F.O. escape pod that he will be able to steal Banner's formula. As Banne","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1982-10-09","episode_number":4,"episode_type":"standard","id":449795,"name":"When Monsters Meet","overview":"In Paris, Bruce and Betty are meeting with the Academy of Science, with Betty carrying one of the gold keys that opens an underground gold vault. Quasimodo, the evil great-great-great- great-great-grandson of the original hunchback of Notre Dame, spies on Betty in order to steal the gold and plans on using one of the assembled scientists to turn him into a normal human. As Betty prepares to meet with the Minister of Finance in order to secure some of the U.S. government's gold deposits, Bruce is given a vial of a chemical that reverses radiation mutation by one of the other scientists, Professor Royale. As Betty goes to her meeting, she is kidnapped and taken underground by Quasimodo. Banner follows him and soon turns into the Hulk, losing the vial in the process. Quasimodo and the Hulk battle each other within an underground dungeon while Betty escapes from her prison. The monsters' battle then takes them to the streets of Paris, where Quasimodo eventually leads the Hulk to the Eiffel","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52580eb619c29531db438c57","order":501,"adult":false,"gender":2,"id":46330,"known_for_department":"Writing","name":"Stanley Ralph Ross","original_name":"Stanley Ralph Ross","popularity":3.195,"profile_path":null}]},{"air_date":"1982-10-16","episode_number":5,"episode_type":"standard","id":449796,"name":"The Cyclops Project","overview":"Cyclops, the largest and most powerful computer on Earth, is due to be granted full control over the U.S. entire military defenses. Banner, while on his way with Rick with the de-activation codes for Cyclops, accidentally crashes his car, destroying the codes, injuring Rick and causing him to turn into the Hulk. The Hulk takes Rick and heads towards Cyclops Mountain, where the computer is located. Meanwhile, Cyclops' defense systems are turned on by its creator, Dr. Kurt Donovan, and the computer controls all of the military's systems. The Hulk breaks into Cyclops Mountain, and is quickly dealt with by some defense robots. The Hulk trashes the robots, and soon a stray mouse interferes with Cyclops' circuits, causing a chain reaction. Cyclops becomes sentient and decides that machines are superior to mankind. He seals off the mountain, trapping Donovan, Betty, Rick and the Hulk. Donovan agrees to help Cyclops, while the computer makes its intentions to take control over all machines on","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52580eb619c29531db438c76","order":500,"adult":false,"gender":2,"id":21874,"known_for_department":"Acting","name":"Alan Young","original_name":"Alan Young","popularity":6.979,"profile_path":"/9sMQDRksfRxXysHCSP98S8Z9mf8.jpg"}]},{"air_date":"1982-10-23","episode_number":6,"episode_type":"standard","id":449797,"name":"Bruce Banner Unmasked","overview":"General Ross makes the capture of the Hulk Gamma Base's primary objective. Meanwhile, the villainous Puppet Master sets up operation in Mesa City, and begins controlling everyone in the town, with the Hulk also in his sights. Major Talbot is granted control over the new Hulkbuster armed forces, and Betty uses the Garth 7 multi-processor to find out further info about the Hulk. Banner alters the computer's programming, protecting his identity, while the Puppet Master attempts to take control over the Hulk's mind using one of his atomic puppets. At the same time, Rick, Rita and Rio are visiting Alicia Masters, the Puppet Master's daughter in Mesa City who has created a sculpture of Betty. Rio falls under her father's control, and Alicia, realising what has happened, gets Rick and Rita to safety. Betty finds out that Bruce altered the computer's programming and goes to tell her father. Soon however, the Puppet Master's new Hulk puppet is activated and forces Banner to change into the Hulk","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52580eb619c29531db438c95","order":502,"adult":false,"gender":2,"id":33482,"known_for_department":"Acting","name":"Bob Holt","original_name":"Bob Holt","popularity":4.599,"profile_path":"/8u2FSZRgWYIfFpAdmEggVq5jevv.jpg"}]},{"air_date":"1982-10-30","episode_number":7,"episode_type":"standard","id":449798,"name":"The Creature And The Cavegirl","overview":"In New York, Dr. Brandon Jones, Rick's uncle, has successfully developed the Time Project, a time machine. Rick tells Bruce, who hopes to use the machine to travel through time and prevent himself from ever becoming the Hulk by stopping Rick from entering the Gamma Bomb test site. Meanwhile, Rita is bitten by a poisonous lizard while making a student film in the desert. Only Banner's computer can analyse her blood for a cure to be found, but Banner is in New York and becomes the Hulk after a power failure in the lab. The Hulk accidentally activates the Time Projector, transporting him, Rick, Betty Major Talbot, General Ross and the main lab itself to 1,000,000 B.C. Back in the future, Rita's condition is deteriorating without Banner's activation code for his computer. In the past, the Hulk comes to the rescue of a cavewoman named Umela, and they become attracted to each other. Umela's former boyfriend, Nagira quickly appears and challenges the Hulk, but is outmatched by the green golia","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1982-11-06","episode_number":8,"episode_type":"standard","id":449799,"name":"It Lives! It Grows! It Destroys!","overview":"At Gamma Base, Dr. Proto is attempting to create a new form of life, and proceeds to draw power from Bruce Banner's new Gammatron experiments against Banner's request. After nearly destroying the Gammatron, Dr. Proto's experiment works and he creates a deadly organism, that looks like yellow slime and can eat through almost anything. That night, the organism is locked away in the lab refrigerator, but Proto forgets to cover the silicon container, and it grows outside of its container once everyone has left. Banner goes to Proto's lab and is trapped in a net while the slime approaches him. He becomes the Hulk and breaks out of the base while the organism continues to eat its way through the lab. The Hulk turns back into Banner, who heads back to Proto's lab to figure out a way to stop the creature. Proto tells him that the life-form is part fungus, and so Banner appropriates a weed killer to halt the slime's progress. The strategy fails, and Proto decides to split the nuclei of the slim","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1982-11-13","episode_number":9,"episode_type":"standard","id":449800,"name":"The Incredible Shrinking Hulk","overview":"Bruce is experimenting with a gamma ray emitter on a lab rabbit, when it suddenly short circuits and after being bombarded with the ray, reduces the rabbit and then Banner in size to only one inch tall. Unable to attract Betty's attention, Banner has to figure out a way of getting back to normal size himself. As Banner attempts to climb up the lab table, he is attacked by both a rat and a tarantula, and soon becomes a pint-sized Hulk. The Hulk fights off the household menaces and ventures out into the desert to find Rick. After overcoming a ferocious desert lizard as the Hulk, Banner makes it to Rio's diner to alert Rick as to his condition. After spooking Rick, Banner accidentally ends up in Major Talbot's coat and ends up back at the base. General Ross meets with Talbot to discuss the testing of the new T-70 tank, and tells him that the Pentagon has alerted him that there are saboteurs on the base who are after the tank. Rick heads to Banner's lab and discovers the Gamma ray machine","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1983-09-17","episode_number":10,"episode_type":"standard","id":449801,"name":"Punks On Wheels","overview":"Bruce finds himself in a windswept landscape, running away from none other than the Incredible Hulk! As the Hulk prepares to smash him once and for all, Banner wakes up from his terrible nightmare. He and Betty then accompany Rick and Rita to a nearby stunt-bike show. The show is gatecrashed by bionic punks on futuristic motorcycles calling themselves the Screaming Vultures. They kidnap Rita and Bruce and Betty follow them in a jeep. The jeep crashes, and after Betty has been thrown to safety, Bruce becomes the Hulk, who fights the Vultures. The punks get away however, entering a base inside one of the mesas. There, they take Rita to meet with their commander a green-skinned, large- brained individual known as The Leader. The Hulk calms down into Banner, who then ends up in the Leader's base. The Leader tells Banner of how he was once a worker in a chemical plant who was exposed to experimental Gamma rays that gave him his newfound intellect. Betty and Rick are also taken to the Leader","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1983-09-24","episode_number":11,"episode_type":"standard","id":449802,"name":"Enter: She-Hulk","overview":"In Los Angeles, criminal lawyer Jennifer Walters, who is investigating the criminal organization Hydra, has just had a medical check-up by Dr. Steve Perry, when the Medical Center comes under attack by Hydra soldiers. Jennifer decides to pursue them, and proceeds to become a greener, bigger and stronger individual calling herself the She-Hulk. She-Hulk follows the Hydra agents and stops them, leaving them for the police. Bruce, together with Rick, is visiting L.A. to see his cousin Jennifer, as a last chance to do something about his condition. Bruce tells Rick of how he visited Jennifer a few months ago, when she was involved in a gas explosion at home. Having the same blood type as her, Bruce performed a transfusion that saved her life, but also gave her the ability to become the She-Hulk, who still retains Jennifer's mind. Bruce hopes to control the Hulk's body with his own mind, and wants Jennifer's help. In L.A., Jennifer is kidnapped by Hydra agents and is told by the Supreme Hyd","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1983-10-01","episode_number":12,"episode_type":"standard","id":449803,"name":"The Boy Who Saw Tomorrow","overview":"As Bruce supervises a space shuttle gantry on Gamma Base, the whole structure collapses and injures Jeff Kessler, the chief project engineer. Betty's quickly arrives with her nephew Jonah, who claims that he can see into the future. Jonah had predicted the gantry's collapse and warned Betty about it twenty minutes before it actually happened. At Betty's house, Jonah predicts that a an air force plane will crash into an ammunitions dump, causing artillery to fly all over the base. Those events actually take place, and Rick ends up trapped under a collapsed telephone pole. Bruce becomes the Hulk, rescues Rick and puts out the munitions fire. Jonah then demonstrates his fortune-telling abilities for General Ross and Major Talbot, and foresees the Hulk destroying the controls of Space Shuttle 99 piloted by Betty on August 2nd, which then crashes. Only Bruce is told by Jonah of what he saw, and shortly afterwards Betty announces that NASA has chosen her to pilot a science shuttle mission on","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1983-10-08","episode_number":13,"episode_type":"finale","id":449804,"name":"The Hulk Destroys Bruce Banner","overview":"At Gamma Base, Bruce and Betty are testing the new Transmat, a device that can transport an object from one place to another. Bruce volunteers himself as a human test subject, but during the process, the Transmat beam changes him into the Hulk, who is transported to Betty's end of the beam. The Transmat is destroyed by the Hulk, who then escapes from the base. Betty theorizes that Banner's pattern might still be in the machine, and that the only way of getting him back will be to duplicate the original experiment's conditions by putting the Hulk back into the Transmat beam. Approaching the town of Twilight Junction, the Hulk turns back into Banner, who finds out that a Gamma Base scientist has been disintegrated. Thinking that it was Betty, Bruce attempts to hand himself over to the authorities, telling them that he is the Hulk, but with no success. As Betty feverishly works to repair the Transmat before it is shut down and shipped back to the Pentagon, Major Talbot and his Hulkbusters","production_code":"","runtime":30,"season_number":1,"show_id":11328,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":21829,"poster_path":null,"season_number":1,"vote_average":0}}}