{"adult":false,"backdrop_path":"/6cejuTfzhMQ9n8diWAEdsU6Fm2k.jpg","created_by":[{"id":8554,"credit_id":"5be1a851c3a36809e600cf17","name":"Peter Benchley","gender":2,"profile_path":"/bkiyTDgdvyXkowNvJ3QYy9IOGG.jpg"}],"episode_run_time":[44],"first_air_date":"1999-09-25","genres":[{"id":18,"name":"Drama"}],"homepage":"","id":11502,"in_production":false,"languages":["en"],"last_air_date":"2000-05-20","last_episode_to_air":{"id":453915,"name":"A Bible and a Gun","overview":"Karen, Jimmy and Alex argue about who will fly, as the hydroplane can only take 2 persons. Karen has piloting hours in her favor. The choice remains between Jimmy and Alex. In a fight with Alex, Jimmy is shot and severely injured. When Karen goes to the hydroplane to have it ready for departure in emergency, she sees it pulled away in the river by some of Morag's sons. She takes advantage of a moment of distraction and flies away with the hydroplane. Jimmy and Alex remain on the ground. Alex decides to go back to the Natives' village to find the shaman who helped him before and leaves Jimmy alone, promising to be back two days after. Jimmy starts having hallucinations. They take out some dynamites out of the plane. The wild child from the forest, that Elder Cole, Andrew and Korakal helped to escape is chased and taken back to the village on Balaam's order.","vote_average":0,"vote_count":0,"air_date":"2000-05-20","episode_number":22,"episode_type":"finale","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null},"name":"Amazon","next_episode_to_air":null,"networks":[{"id":184,"logo_path":null,"name":"Syndication","origin_country":"US"}],"number_of_episodes":22,"number_of_seasons":1,"origin_country":["CA"],"original_language":"en","original_name":"Amazon","overview":"Amazon was a syndicated television show created by Peter Benchley. It was developed by Canadian production companies Alliance Atlantis Communications & WIC Entertainment and German company Beta Film GmbH. The 22 episodes of the series were in first-run syndication between 1999 and 2000.\n\nThe drama series focused on the six survivors of a crashed airline flight in the Brazilian Amazon jungle. The group soon comes into contact with a Native American tribe, and relations are anything but friendly. The group is taken in by a mysterious tribe, who descended from 16th century British colonists who were lost in Amazon. Relations with the Chosen are tenuous at best. Most of the group escapes the Chosen only to stir up a hornets nest with a tribe of cannibals, led by an insane American woman bent on domination of all the local tribes. The first season ended in a cliff-hanger, and a second season was never produced. The series retained sufficient interest that it was released on DVD in 2011.\n\nA novelization of the 2-hour pilot was written by Rob MacGregor, and a mass-market paperback was released by Harper on 8 Aug 2000.\n\nThe German title was Amazonas - Gefangene des Dschungels.","popularity":5.204,"poster_path":"/bnaq2T22ddL8wHAMJ8lHJb9vaMd.jpg","production_companies":[{"id":803,"logo_path":"/jEMVaCuEjQ3lzkhakWDKNVjwd9Q.png","name":"Alliance Atlantis","origin_country":"CA"},{"id":59317,"logo_path":null,"name":"WIC Entertainment","origin_country":""},{"id":1080,"logo_path":"/6bZ0BiLDzCZSqVCjiSqweWwp9Ew.png","name":"Beta Film","origin_country":"DE"}],"production_countries":[{"iso_3166_1":"DE","name":"Germany"},{"iso_3166_1":"CA","name":"Canada"}],"seasons":[{"air_date":"1999-09-25","episode_count":22,"id":21987,"name":"Season 1","overview":"","poster_path":"/2L5w8hnMTD9tPByHOA3ObWJObUh.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Scripted","vote_average":7.8,"vote_count":9,"season_data":{"1":{"_id":"525810ad19c29531db459de3","air_date":"1999-09-25","episodes":[{"air_date":"1999-09-25","episode_number":1,"episode_type":"standard","id":453916,"name":"Fallen Angels","overview":"While flying through a storm over the Amazon Forest, flight 767 to Rio de Janeiro suffers a shot circuit in its cargo deck and starts to lose height. Moments later, one of the wings is struck by lightning and the pilots are forced to crash land in a small clear. The tail section of the plane is cut off and slides down a cliff. The next morning, a rescue team searches the crash site, but they can't find any survivors. Since many of the passengers were Americans, the team is made up of American Rangers. Two of them find the tail section, but there is nobody inside, dead or alive. One of the rangers is attacked by piranhas and other is killed by a native, so the colonel in charge decides to call off the rescue. A Brazilian official objects, claiming that one of the passengers was famous opera singer Pia Claire and her body has not been found yet. The colonel says that since all the bodies are badly burned, he can pick up one and claim that it's Claire's.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-02","episode_number":2,"episode_type":"standard","id":453917,"name":"Nightfall","overview":"Lost in the forest, the survivors try to gather some wood to start a fire. Will catches a glimpse of himself on Pia's hand mirror and notices that he has a strange simbol painted on his forehead. They search for food and find that someone or something is stalking them, but it turns out to be just a wild pig. Soon later they come across Marcel DaSilva, another survivor of the crash. Marcel has a deep knowledge on how to survive in the forest. He tells them that they must find a river and follow its course to the sea. It will be difficult, he says, but eventually they will find their way back to the civilization. However, moments later Marcel is bitten by a poisonous snake and dies. The survivors decide to go on with his plan anyway. Will sees a misterious blond man who has in his forehead the same simbol he has in his, but the man quickly disapears. When he tells the others, they think that what he saw was probably just an animal, but the blond man keeps following them...","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-09","episode_number":3,"episode_type":"standard","id":453918,"name":"Suffer the Little Children","overview":"Going back to salvage items from the wreck, the survivors encounter a wild jungle man and then find they must hide from natives who are apparently trying to kill them.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-16","episode_number":4,"episode_type":"standard","id":453919,"name":"The Fierce Ones","overview":"Karen, Pia, Jimmy and Will are taken to the native's village, where they find out that Sidney is still alive and has been kept as a prisoner since they last saw him. Back in the forest, Alex and Andrew discuss what to do. Andrew has leukemia and is getting weaker, so Alex wants to leave him behind and try to find some help. Andrew, in spite of his condition, wants to help the others. When the natives force Karen, Pia and Jimmy to take off their clothes (not all of them, actually) Jimmy hits one of the natives and is tied up with Sidney. Later, two wounded natives are brought in and the shaman performs some sort of ritual on them. During the ritual, Sidney is untied and the natives let him go, but as soon as he leaves the village, the natives start to chase him. He runs for his life, but he is soon caught and killed. Alex decides to join Andrew in his rescue attemp. On their way to the village they meet the blond man who was following the group.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-23","episode_number":5,"episode_type":"standard","id":453923,"name":"The Chosen","overview":"The English-speaking jungle man brings the exhausted survivors back to his home, the village of the Chosen.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"1999-10-30","episode_number":6,"episode_type":"standard","id":453920,"name":"The End of the World","overview":"While Karen and Pia distract the guards, Alex, Andrew and Jimmy try to escape climbing the cliffs that surround the Chosen village. In the Fierce Ones village, one of the warriors tries to kill Will, but Korakal stops him and tells the boy that three of his friends must die as payback for the three warriors killed. Just as the guards discover the escape, Jimmy falls from the cliff, landing on a cabin's roof. Balaam goes with the guards after the other two, but first he warns Falconer John that if they are not caught, the women will take their place. Chased by the guards, Alex and Andrew split. Andrew meets a mysterious woman who wanishes without uttering a single word. Then he is found by Falconer John and agrees to go back with him, so neither Karen or Pia will have to take his place. Alex is captured by Balaam and swears that he'll find some way to escape, even if he has to kill him.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"1999-11-06","episode_number":7,"episode_type":"standard","id":453921,"name":"The Lost Words","overview":"The elders find Jimmy guilty in the death of a local fisherman, and throw him and his companions into a deadly pit.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"1999-11-13","episode_number":8,"episode_type":"standard","id":453902,"name":"Resurrection","overview":"The elders check some of the words in the wall that speak about \"\"The Boy of the Promise\"\". Cole thinks that Will may be that boy and that they should claim him. Balaam and Malakai do not think so, but they agree to send John to find out if Will is fine. When Cole calls Andrew to tell him about this, Andrew starts to feel sick and soon later he passes out. The village doctor wants to help, but Karen and Pia do not trust him and they send him away. The doctor, however, comes back with more people and they take Andrew out of the village, fearing that he may have some contagious disease. Karen brings Prudence, who gives Andrew some medicine and then asks Karen to leave them alone. Korakal tells Will that Jakuki and him must perform a ritual in order to die as children and become men. He send them out with the Shaman. Later, John is captured by the Shaman and others. Cole and the doctor come back for Andrew, who seems to die in front of them.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"1999-11-20","episode_number":9,"episode_type":"standard","id":453903,"name":"The Blood Angel","overview":"When all the villagers mysteriously disappear overnight, Karen and Talbott find them awaiting a sign from their deity about the Promised One.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"1999-11-27","episode_number":10,"episode_type":"standard","id":453904,"name":"War","overview":"The Chosen go to war for Will where they fight with the savages. In the end both decide to fight one on one. The chief of the savages fights with Taylor using a scorpion bag and stones. Taylor wins and Will returns to the Chosen though he is reluctant at first.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-22","episode_number":11,"episode_type":"standard","id":453905,"name":"Eyes in the Dark","overview":"As the Chosen Warriors return with Will, the Elders need to cope with a death in their ranks.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"2000-01-29","episode_number":12,"episode_type":"standard","id":453906,"name":"The First Stone","overview":"As disease attacks the Spider people, Falconer John reluctantly leads Dr. Kennedy to their aid.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"2000-02-05","episode_number":13,"episode_type":"standard","id":453907,"name":"The Devil's Army","overview":"While searching for a lost pig on the other side of the river, Jimmy and Erra the dungman are attacked by ants and they barely save themselves running back to the river. They tell the Elders about it, but Balaam does not seem to take Erra's warnings serioulsy. Later, Jimmy learns that Erra is Balaam's father. Many years ago he was the village's sentinel, but one night he fell sleep and the savages attacked, killing some of the Chosen. After checking the ants by himself, Andrew, who knows a thing or two about them, tells the elders that the village is in danger. Cole agrees to give him some men to clear the river so the ants can not make it to the other side, but they make it anyway using a dead crocodile as a bridge. The Chosen leave their village and go to live with the excluded. Hekka and Adam go to Prudence's cabin and we learn that the two women are sisters.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-12","episode_number":14,"episode_type":"standard","id":453908,"name":"The Finding","overview":"As the villagers have a communal wedding ceremony, Hekka plans an escape with the survivors.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"2000-02-19","episode_number":15,"episode_type":"standard","id":453909,"name":"Escape","overview":"Alex, Andrew and Jimmy go to the caves to check some paintings that feature the way out of the Chosen valley. They notice that someone is watching then, but they can't find who. The elders tell Will that they want to start training him to be an elder some day. Will does not like the idea, but the others decide that, since the Chosen may go as far as necessary to get him back, he must stay in the village. Pia decides to stay and so does Karen to look after Will. Andrew goes to say goodbye to Prudence. She warns him that if he leaves the forest, he will suffer leukemia again and eventually he will die. Andrew changes his mind and stays, so Alex tells him to take care of Adam for him. On the night of the escape, Alex and Jimmy are caught in the forest by Balaam and a few of his men. He was the one watching them in the caves, but he does not want to stop them.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-26","episode_number":16,"episode_type":"standard","id":453922,"name":"Home","overview":"Karen trys to swim to the boat and gets a shock from an electric eel. While the rest are trying to revive her, she dreams that they are rescued and when they return to save Pia and Will, Falconer John is killed. Later on they all return to their old lives and it is as though the whole incident never happened. She also dreams that she keeps on dreaming and seeing the chosen.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-15","episode_number":17,"episode_type":"standard","id":453910,"name":"The Pale Horseman","overview":"After the survivors' escape, Elder Cole has a fit and collapses into a coma.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"2000-04-22","episode_number":18,"episode_type":"standard","id":453911,"name":"The White Witch","overview":"Boat they found gets taken by the owner who knocks Alex out. They split up to catch up with the boat. Jimmy falls into a bog and on saving him they find the body of a geologist whose arm was hacked off him. Andrew becomes separated from the group and is found by a woman. Karen searches for him and ends up with the woman also. Jimmy finds a man who is stuck and handcuffed onto a wooden pole and he goes to find Alex. When they return to the spot, the man is gone. They decide to continue on without Karen and Andrew. They hear a fiddle playing and they go to investigate the cave from which the sound is coming from. There they find a Canadian woman named Morag who serves them human meat. They freak out and try to escape. They then find Karen and Andrew tied up in the cave and they realize that Morag is the leader of the Cannibals.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-29","episode_number":19,"episode_type":"standard","id":453912,"name":"Circle of Fire","overview":"They are all captured and there is a Caucasian photographer with Morag. All of them have to work except for Karen. Morag tells them that there are going to be guests coming for dinner. Will learns how to hunt from Falconer John so that he would be able to escape from the Chosen. Elder Kohl rejects Pia. The guys escape from the Cannibals but are caught and the arrival of the Savage ones save them from Morag's wrath. Morag wants Karen to be her son's wife. Her husband was the chief of the Cannibals. Morag pits Andrew against Jimmy and Karen against Alex for entertainment. The Savage ones save them by killing off all the Cannibals, but they leave Morag alive and she vows to avenge her dead sons.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Elder Malakai","credit_id":"64d39a43bf31f201ccbcb337","order":500,"adult":false,"gender":2,"id":2320,"known_for_department":"Acting","name":"Julian Richings","original_name":"Julian Richings","popularity":9.435,"profile_path":"/9Qf044hlSHjjoRngbI8h7txPNwU.jpg"}]},{"air_date":"2000-05-06","episode_number":20,"episode_type":"standard","id":453913,"name":"Babel","overview":"The savages get rid of Morag's stuff using fire. Not knowing that the boxes contain live ammunition, they throw them into the fire and bullets start to fly about. One of them hits the savage Shaman. They take Morag to their village and Andrew, who has decided to return to the Chosen, goes with them. Back at the Chosen's village, Rachel dies and Pia is very sad. When she is singing in the forest, she sees a young savage woman who seems to like her singing but quickly rans away. Karen and the guys search the dead geologists for things that might be useful to them. They find a map, a logbook and a compass. Reading the logbook, they learn that the geologists had a partner who was supposed to arrive the day before on a hydroplane. While they are at it, the rest of the cannibals return to find the others dead. Karen and Jimmy hide in the cave and Alex pretends to be dead. The cannibals soon leave to go after the savages.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-05-13","episode_number":21,"episode_type":"standard","id":453914,"name":"Wild Child","overview":"As the wild child discovered by Pia brings chaos to the village, Dr. Kennedy finds the airplane that could take them out of the jungle.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-05-20","episode_number":22,"episode_type":"finale","id":453915,"name":"A Bible and a Gun","overview":"Karen, Jimmy and Alex argue about who will fly, as the hydroplane can only take 2 persons. Karen has piloting hours in her favor. The choice remains between Jimmy and Alex. In a fight with Alex, Jimmy is shot and severely injured. When Karen goes to the hydroplane to have it ready for departure in emergency, she sees it pulled away in the river by some of Morag's sons. She takes advantage of a moment of distraction and flies away with the hydroplane. Jimmy and Alex remain on the ground. Alex decides to go back to the Natives' village to find the shaman who helped him before and leaves Jimmy alone, promising to be back two days after. Jimmy starts having hallucinations. They take out some dynamites out of the plane. The wild child from the forest, that Elder Cole, Andrew and Korakal helped to escape is chased and taken back to the village on Balaam's order.","production_code":"","runtime":44,"season_number":1,"show_id":11502,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":21987,"poster_path":"/2L5w8hnMTD9tPByHOA3ObWJObUh.jpg","season_number":1,"vote_average":0}}}