{
    "adult": false,
    "backdrop_path": "/pHjosQo4kMUS1D1t9zGpVKdAe8i.jpg",
    "created_by": [],
    "episode_run_time": [
        30
    ],
    "first_air_date": "2021-01-04",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "https://www.bbc.co.uk/programmes/m000qzxs",
    "id": 116054,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2023-02-24",
    "last_episode_to_air": {
        "id": 4232938,
        "name": "Episode 10",
        "overview": "Rick spends a surreal afternoon watching a German film crew at work on a Cornish romance and discovers a brain-boosting mushroom, which he promptly puts in a stir fry.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2023-02-24",
        "episode_number": 10,
        "episode_type": "standard",
        "production_code": "",
        "runtime": null,
        "season_number": 3,
        "show_id": 116054,
        "still_path": "/SarlgYArW1QDj3WbAcMrRjKxDg.jpg"
    },
    "name": "Rick Stein's Cornwall",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 332,
            "logo_path": "/7HVPn1p2w1nC5oRKBehXVHpss7e.png",
            "name": "BBC Two",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 40,
    "number_of_seasons": 3,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Rick Stein's Cornwall",
    "overview": "In this new series Rick Stein reveals the Cornwall that he knows and loves: a unique part of the British isles with a strong sense of identity and a history rooted in its Celtic past. With his famous natural inquisitiveness, Rick shares the road less travelled – championing the food, history, music, art and culture of the county many locals argue should be a country in its own right.",
    "popularity": 3.103,
    "poster_path": "/s8DZQRTOgUy8iHxxr0npeuvZFRs.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2021-01-04",
            "episode_count": 15,
            "id": 175210,
            "name": "Season 1",
            "overview": "Rick Stein shares his love and passion for the people and places of his beloved Cornwall.",
            "poster_path": "/6LuinKDYxMtnkevlDWlah42A7P5.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2022-01-03",
            "episode_count": 15,
            "id": 238351,
            "name": "Season 2",
            "overview": "Rick Stein takes us once again on a rich journey of discovery around his beloved Cornwall.",
            "poster_path": "/cO7nvqeWriYdKTEqzfDaPi2ziHJ.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2023-02-13",
            "episode_count": 10,
            "id": 328884,
            "name": "Season 3",
            "overview": "Rick Stein shares his love and passion for the people and places of his beloved Cornwall.",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 6,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "5ff4798f29c6260040aea3d5",
            "air_date": "2021-01-04",
            "episodes": [
                {
                    "air_date": "2021-01-04",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2618843,
                    "name": "Episode 1",
                    "overview": "In this episode, Rick takes us to the place where his passion for Cornwall began – his family home at Trevose Head on the north Cornish coast, where as a child he would go fishing with his father. He explores the wild yet beautiful landscape of the Land’s End peninsula with the artist Kurt Jackson before heading to the tranquillity of an heritage apple orchard preserved by head gardener John Harris. Here Rick picks some apples to make his mother’s Apple Charlotte pudding.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/seNST7iSq3aBIFXDGhRy18mjXY6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-05",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2639988,
                    "name": "Episode 2",
                    "overview": "Deep in the Cornish countryside, Rick Stein takes us to meet an extraordinary family who are making some of the best Gouda cheese in Britain, from which he cooks a tortilla dish with caramelised apples, onions and Cornish Gouda. In the fishing village of Mevagissey, he discovers the origins of the sea shanty and the history of the pilchard fishing industry, when shoals of pilchards were so large they would attract killer whales.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/m1DdMCH64LqqvqL0TpIk5bFzPZQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-06",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2639989,
                    "name": "Episode 3",
                    "overview": "Rick Stein meets young chef Tom Adams, who runs Combeshead Farm, a leading field-to-fork restaurant in Cornwall. Here they grow and produce all of their own food, from sourdough bread to pork pies, as well as rearing a small heard of Mangalitsa pigs, a hairy, old-world breed which produces exquisite hams. Rick tries out a new recipe – pork chops with a sloe berry sauce – before moving on to the village of Rock, where his son Jack holds a clam bake on the shore of the Camel Estuary.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/6M88FJ4JnjEX0sNgZOvPHL3L523.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-07",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2639990,
                    "name": "Episode 4",
                    "overview": "The town of Launceston in east Cornwall is bypassed by many who visit the county, yet Rick discovers that it’s home to an unusual superstition and a rare type of Norman castle. In the far west of Cornwall, Rick meets Graham Fitkin and Ruth Wall, two musicians who combine modern and traditional ways to make some extraordinary compositions. Rick rounds off his trip by cooking an alfresco dish of Cornish mussels with cider.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/q0KY6LcBAJQNTirlGTiMDkE9GEY.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-08",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2639991,
                    "name": "Episode 5",
                    "overview": "Rick Stein meets his good friend, the actor and comedian Barry Humphries, who fell in love with Cornwall in the 1960s when he escaped London to develop his now famous character, Dame Edna Everage, with near-disastrous consequences. Barry talks about his friendship with Britain’s favourite poet, John Betjeman, and asks Rick to review his homemade fishcakes. Rick also goes fishing for crab, before cooking a simple yet delicious crab omelette. And he takes a dip in the chilly north Atlantic with an eccentric group of wild water swimmers called the Perranporth Blue Tits.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/tQOhOkuUtSgi2hiMS1nL3Ut0WNE.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-11",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2639992,
                    "name": "Episode 6",
                    "overview": "Rick journeys inland from the majestic Camel Estuary to one of Britain’s finest vineyards, where he joins in harvesting the grapes to discover that the Cornish weather is perfect for making some of the best wine in the country.  Just off Pentire Point, as the sun sets, Rick rides the gentle swell of the North Atlantic with an old friend, casting his line to hook Britain’s fastest fish, before firing up the barbecue to cook his catch with a recipe inspired by a trip to Goa.  Rick joins Tim Smit, best known for starting the hugely successful Eden Project, who reveals to Rick his new and ambitious idea in Cornwall.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/vjtnYrEJcNM3dOhRC1PjH27QBwi.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-12",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2639993,
                    "name": "Episode 7",
                    "overview": "Rick explores one of Cornwall’s hidden secrets, the secluded and stunning Fowey Estuary, joining his friend on a boat trip to learn about the history of the area and getting a unique view of the beautiful buildings along the river bank.  Downstream, after a meal of crab scotch eggs at a fashionable new restaurant, Rick discovers that the historic town of Fowey was once a hotbed of piracy. Just above the town is a family making a prize-winning Cornish vodka, which Rick uses to make a delicious pancake with a wild blackberry compote and Cornish clotted cream.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/5M0ZrcAJMjsKFFOwMAiJcweSgyj.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-13",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2639994,
                    "name": "Episode 8",
                    "overview": "On the wild north Atlantic coast, Rick heads out to sea to go fishing for lobsters with his old friend and celebrity chef Nathan Outlaw and learns about a revolutionary new conservation programme which is making lobster fishing a sustainable enterprise. In the historic and pretty harbour town of Port Isaac, Rick and Nathan cook up a fabulous lobster risotto.  At Tresillian House, near Newquay, Rick meets with head gardener John Harris to find out more about his Victorian walled garden, an oasis of calm where Rick discovers how harvesting by the phases of the moon means better tasting veg. Rick cooks a Cornish Briam, a tasty slow-cooked dish of fresh vegetables.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/eTndeGbJB1VHmCwrfQMxeSUyIc6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-14",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2639995,
                    "name": "Episode 9",
                    "overview": "Join Rick for a trip on the world’s busiest chain ferry that links Cornwall and Devon across the Tamar River – on the Torpoint ferry Rick chats to ferry controller Mike Bright. Following this short journey, he explores Torpoint, a town on Cornwall’s Rame peninsula, with historian Harry Bennett.\n\nNow for a real highlight of the series, Rick visits the mystical woodland setting of Golitha Falls, near Liskeard, to find the spectacular cascades and waterfalls. Whilst here he also chats to the very lovely Dawn French about all things Cornwall, including why she’s made it her home.\n\nRick then heads down to the south coast to visit Seth Pascoe at Cornish Seaberry Co to learn how and where his produce grows. As well as being great to cook with, Cornish Seaberry have partnered with Cornish drinks companies Colwith Farm Distillery and Driftwood Spars Brewery to create vodka and beer flavoured by their berries.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/sKP6EsCdfxYRWvNG4QOi0XZz1EG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-15",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2639996,
                    "name": "Episode 10",
                    "overview": "Rick heads into the bowels of Cornwall with author Philip Marsden, deep into the China Clay pits, to discover what is known locally as White Gold, one of this county’s most important industries.\n\nHe then climbs the Cornish Alps, huge slag heaps created by the clay mining and some of Cornwall’s highest land.\n\nAfter a wild swim with Shonna Hands at one of Cornwall’s picturesque hidden coves, Polridmouth, Rick cooks a simple recipe for BBQ sea bass with a fennel mayonnaise – telling you how to make the perfect homemade mayonnaise in the process.\n\nIn the far west of the county, on the Land’s End peninsula, Rick introduces us to his niece, Lucy Stein, a modern artist who explains her deep spiritual connection to Cornwall – including a wander at Boscawen-un stone circle close to St Buryan.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/79Mjbvv3M7EiijIEXCqBV1wQQgK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-18",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2640001,
                    "name": "Episode 11",
                    "overview": "In this episode of Rick Stein’s Cornwall you will explore the world-famous Barbara Hepworth Sculpture Garden in St Ives with artist Anthony Frost –  noted for his abstract works consisting of brightly coloured prints and collages. Fish for red mullet on the Lizard with fishermen, Danny and Tommy Phillips – two wonderfully Cornish gents from Cadgwith Cove which is located in a must-visit spot on the south coast. Then you’ll meet Sophie Alexander and Stephen Holloway at Source Kitchen in St Ives to chat about their artisan produce and hyper seasonal dishes. Finally, travel further down west to the tiny village of Porthgwarra to meet RSPB Chough expert, Paul St Pierre.\n\nRecipes in episode 11 include red mullet on confit potatoes with black olive tapenade – cooked at Source Kitchen.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/pYyiNn6xOUiqlzvTQiseWNG2rNv.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-19",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 2640003,
                    "name": "Episode 12",
                    "overview": "In episode 12 of Rick Stein’s Cornwall, you’ll visit quite possibly the prettiest church in the world, St Just-In-Roseland Church. Explore the waterside haven of St Mawes by foot and water with Alex and Olga Polizzi from Hotel Tresanton as well as meeting chef Paul Wadham. Then it’s up to Launceston to be introduced to some of the best meat in the country at our Cornish butcher, Ian Warren from Warrens Butchers. Their steaks are simply fab. Rick then explores potter Jack Doherty’s studio in Penzance before returning to Padstow to listen to Dave Brown and St Merryn Ukes – a rather good local ukulele band.\n\nRecipes in episode 12 include steak with béarnaise sauce to celebrate meat from Cusgarne Farm.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/kqkKyRFeBj12XuFRivtYQLzdyze.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-20",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 2640004,
                    "name": "Episode 13",
                    "overview": "In episode 12 of Rick Stein’s Cornwall, you’ll visit quite possibly the prettiest church in the world, St Just-In-Roseland Church. Explore the waterside haven of St Mawes by foot and water with Alex and Olga Polizzi from Hotel Tresanton as well as meeting chef Paul Wadham. Then it’s up to Launceston to be introduced to some of the best meat in the country at our Cornish butcher, Ian Warren from Warrens Butchers. Their steaks are simply fab. Rick then explores potter Jack Doherty’s studio in Penzance before returning to Padstow to listen to Dave Brown and St Merryn Ukes – a rather good local ukulele band.\n\nRecipes in episode 12 include steak with béarnaise sauce to celebrate meat from Cusgarne Farm.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/8LrITJJar6Bv4XcXpiEujVMxnRW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-21",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 2640006,
                    "name": "Episode 14",
                    "overview": "Rick Stein’s Cornwall episode 14 guide:\n\n– Visit Lamorna Cove\n\n– Explore the National Trust coast around Botallack tin and copper mines\n\n– Search for Cornwall’s oldest building\n\nRecipes in episode 14 include Cornish bouillabaisse.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/d4L7PDv40KQoUjTRU5Zj4uJLlDw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-22",
                    "episode_number": 15,
                    "episode_type": "finale",
                    "id": 2640008,
                    "name": "Episode 15",
                    "overview": "As Rick’s Cornish odyssey nears its end, he takes a break in the city of Truro, where he discovers an unusual ghost story and tours the magnificent cathedral with friend Daphne Skinnard. He also meets a family passionate about offal, who prepare him a meal of pickled ox tongue and beef heart tacos, and in the county’s most northerly parish, on a wander to Hawker’s Hut, he tells the story of an eccentric vicar who would retrieve the bodies from nearby shipwrecks and bury them in his church graveyard.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 116054,
                    "still_path": "/hHQGiF69USUvETYUViZbmRBKOOE.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "Rick Stein shares his love and passion for the people and places of his beloved Cornwall.",
            "id": 175210,
            "poster_path": "/6LuinKDYxMtnkevlDWlah42A7P5.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "61d3f683944a57001f8dfa8a",
            "air_date": "2022-01-03",
            "episodes": [
                {
                    "air_date": "2022-01-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3427622,
                    "name": "Episode 1",
                    "overview": "Rick Stein takes a trip back in time to his early days running a nightclub in Padstow before a bracing dip in Bude's stunning sea pool. Then Rick braves the notoriously wild Atlantic waters to learn about the ancient fishing method of handlining at Sennen Cove off Land's End. The catch of the day is some deliciously plump pollock, which Rick uses to make the ultimate fish pie for the head gardener of Tresillian House, John Harris.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/h7lakWPN4PAxUOzLlKFcW4o9mNq.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3427624,
                    "name": "Episode 2",
                    "overview": "Rick Stein travels to St Ives to meet one of Britain's little-known artists, Alfred Wallis. In the shadow of Bodmin Moor Rick visits a very rare collection of medieval stained-glass windows in the church of St Neot. It is here he ticks off an item on his bucket list by taking part in a rather unusual celebration called Oak Apple Day, marking the occasion when Charles II became king.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/vnZgzR6o5quV6p89Hlf7wuuCKKo.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-05",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3427625,
                    "name": "Episode 3",
                    "overview": "Rick meets \"Springwatch\" presenter and biologist Gillian Burke, who takes Rick on a walk through a rare habitat called an Atlantic temperate rainforest on the banks of the Helford River. Rick also follows his passion for cured meats when he discovers a husband-and-wife team making premium Cornish salami.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/r3L5fKX2hQsQWjYRsRYgmEO9HuX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3427626,
                    "name": "Episode 4",
                    "overview": "Cornwall has more than its fair share of folktales. Perhaps the most famous is found near Land's End, where Rick recounts the tale of the Mermaid of Zennor. A short distance away, Rick joins a small army of seaweed harvesters who are feeding an increasing appetite for a natural food more common in Japan.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/fgcrL1eOfN7rzQT3vqHepCnmRXz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-07",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3427627,
                    "name": "Episode 5",
                    "overview": "Following in the footsteps of one of his literary heroes, Rick roams the dramatic north Cornish coast to tell the story of one of Britain's best-loved writers, Thomas Hardy, and his little-known love affair with a Cornishwoman. Another famous writer, Dylan Thomas, dubbed Rick's next stop, Mousehole, as \"the loveliest village in Britain\".",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/jyIr48VmpiXR7liL7o1eToz24QC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3427628,
                    "name": "Episode 6",
                    "overview": "Cornish king crab is on the menu for Rick as he heads out of Newquay to catch and cook this tasty crustacean. Afterwards, he takes a trip inland to Bodmin Moor to meet Robin Hanbury Tenison, one of the 20th century’s last great explorers. His farm is home to one of Cornwall’s most ambitious rewilding projects, where Robin’s son, Merlin, has recently introduced a pair of wild beavers who are doing their best to restore biodiversity in this corner of Cornwall.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/1JdYGKKgn8CDuGlqVnZNA25PePD.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-11",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3427629,
                    "name": "Episode 7",
                    "overview": "Rick boards the ferry in Penzance to take him to the Isles of Scilly, a group of islands which were once part of Cornwall. Here, he finds out about the islands’ rich history, including one of the Royal Navy’s worst shipping disasters in which 1,500 men lost their lives. In the world-famous gardens of Tresco, Rick meets a beekeeper attempting to breed a native Scillonian honeybee to deal with the harsh Atlantic climate. This inspires Rick to cook a honey pudding with Cornish ice-cream and a butterscotch sauce.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/flHarIypDQ00AXYvaNzvBYQXKVL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-12",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3427631,
                    "name": "Episode 8",
                    "overview": "On a visit to a dairy, Rick meets a man who is paid to eat 700 samples of cheese a week and cooks his sumptuous cheese and chive scones. His next stop is the salty old fishing town of Newlyn, the unlikely setting of one of Britain’s most revolutionary art movements. Rick discovers an intriguing tale of deception behind one of the most famous paintings produced here.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/8qbJQiQkvtxmZBamtYYhQ9lAu1z.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-13",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3427632,
                    "name": "Episode 9",
                    "overview": "Rick is in Falmouth, discovering that far from being 'that bit on the end of Britain’, Cornwall used to be at the very heart of the British Empire’s communication system and is still very much a working port today. It was the seas around Cornwall that inspired author William Golding to write his famous novel, Lord of the Flies, and his daughter Judy tells Rick how her father was horrified by what he witnessed during the war. And Rick gets to enjoy dishes prepared for him by an innovative young chef called Andy Tuck, who cooks everything over wood – forget your BBQ, this is cooking with fire on a whole new level",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/nQOJuOhGvyUIH2edXMppHf4UNUQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-14",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 3427633,
                    "name": "Episode 10",
                    "overview": "In our fields and hedgerows are plants that are delicious as well as plants that are deadly, as Rick learns from a professional forager who takes him on a tour around the beautiful Camel Estuary. Inspired, Rick creates his own version of a Greek Horta pie with foraged greens. Afterwards, it’s a trip down memory lane with his long-time fish supplier Matthew Stevens, who remembers Cornwall before the tourists came. Over a pint with actor, comedian and passionate Cornishman Ed Rowe, star of the BAFTA winning film Bait, Rick examines the impact of second home ownership on Cornish communities.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/ltRNWaUzapbgTFMJwz17gKgmTpw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-17",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 3453957,
                    "name": "Episode 11",
                    "overview": "Rick joins a team diving for razor clams, which he takes back to the kitchen to make a quick but tasty dish of grilled shangurro clams. At the end of Newlyn Pier, Rick visits a scruffy little hut that until recently played a huge part in determining the height of everything around us. And in the Penlee Museum, Rick is shown some of the beautiful items made a century ago by fishermen using Cornish copper and meets a metalworker who is bringing copperwork back to the town.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/6F6d7vE2W1J9awByaDSGxqQsH3W.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-18",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 3453958,
                    "name": "Episode 12",
                    "overview": "Following in the footsteps of Turner, one of Britain’s most loved artists, Rick discovers how much the Cornish landscape influenced his work. At Newlyn Fish Market, Rick counts in the daily catch with the head auctioneer, who tells him how the market has adapted to modern times. Surrounded by beautifully fresh fish, Rick takes away some monkfish and fires up his BBQ to make a grillade of monkfish with roasted red pepper sauce. At Caerhays Castle, home to the nation’s largest collection of magnolias, Rick discovers how this corner of Cornwall was once home to some of the great Victorian plant hunters.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/cDaPg11Spz9Y9A0xLCaqWk7baVT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-19",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 3453959,
                    "name": "Episode 13",
                    "overview": "On the banks of the River Tamar, Rick visits a little-known mausoleum with a rather macabre story. On the wild Atlantic coast, near Bedruthan Steps, he meets fellow chef Emily Scott, who recreates the meal she cooked for President Joe Biden during the recent G7 summit. And Rick takes to the waves with an inspirational organisation who offer therapy using the power of surfing.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/7XYLfTC7qYjPwDNUCDjA2XoICcz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-20",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 3453960,
                    "name": "Episode 14",
                    "overview": "In the town of Looe, Rick learns about a time when the Cornish were taken as slaves by North African pirates. He joins one of the last fishing boats in St Mawes and uses the catch of lemon sole to make a warm, delicious salad. In Newlyn, he meets two entrepreneur chefs who cook mackerel to perfection.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/dJfEbkIAw70BF6cNpiFFwAVfqw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-21",
                    "episode_number": 15,
                    "episode_type": "finale",
                    "id": 3453961,
                    "name": "Episode 15",
                    "overview": "In the final episode, Rick visits the Rame Peninsula. Far from the traditional tourist track, this part of Cornwall is famed for its cliffs and beaches. Rick also meets a beachcomber who has found some remarkable objects washed up on the shore. In mining country, Rick explores the history of the Cornish pasty and shows us how to cook them the proper Cornish way.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 116054,
                    "still_path": "/7HRjPYAFYN9iHYZv3bWv7m9abD3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "Rick Stein takes us once again on a rich journey of discovery around his beloved Cornwall.",
            "id": 238351,
            "poster_path": "/cO7nvqeWriYdKTEqzfDaPi2ziHJ.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "63eb322a1f3e6000c031fcd2",
            "air_date": "2023-02-13",
            "episodes": [
                {
                    "air_date": "2023-02-13",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4232928,
                    "name": "Episode 1",
                    "overview": "Rick forages for mussels in his favourite rock pools, tours Bodmin Moor’s dark past with his son Jack and cooks a foolproof souffle with artisanal Cornish goat’s cheese.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/gY1OlM1peLUUsuNzsyieHaNugXU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4232929,
                    "name": "Episode 2",
                    "overview": "Rick makes heritage cider with Raynor Winn, author of The Salt Path. Later, he cooks a chicken, leek and cider gratin for his old friend John Harris and meets a sea shanty group with a difference.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/tWKEFZVDm4yit2k33JJj3l5b6d0.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4232930,
                    "name": "Episode 3",
                    "overview": "Rick discovers Europe’s largest tea plantation on the banks of the River Fal, bakes a simple yet sumptuous fruited tea loaf and finds out how Cornwall inspired Charles Dickens.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/aAa8jzvERBcy71u2G2xz4FvmUrY.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-16",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4232931,
                    "name": "Episode 4",
                    "overview": "After soaking up the ambience at one of the UK’s last live cattle markets, Rick’s in the mood for steak and kidney pudding before setting sail out of Falmouth in a handbuilt boat.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/2JuuvpqC03zRa5mP3eehuHRUeaN.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-17",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4232932,
                    "name": "Episode 5",
                    "overview": "Rick goes fishing under sail for his favourite oysters, makes a delicious fish soup and discovers the all-but-forgotten story of Cornwall’s ancient capital, Lostwithiel",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/AtwXaX99W1xW7FjGvKlBCHHREWu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-20",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4232934,
                    "name": "Episode 6",
                    "overview": "Rick visits an organic deer farm near Bodmin Moor, makes a stunning venison wellington, and over a pint with comedian Jonny Cowling, defines the Cornish sense of humour.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/h2Nr3PMXGRFO5UqOZgPfu366rdA.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-21",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4232935,
                    "name": "Episode 7",
                    "overview": "Rick enjoys one of the world’s most scenic ferry crossings, rustles up a tasty vegetarian tart, and investigates the Cornish influence on Oscar-winning composer Malcolm Arnold.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/b0eNiEWDt84Tyg5iIikY1gtIn8X.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-22",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4232936,
                    "name": "Episode 8",
                    "overview": "Rick finds out about the back-breaking work done by women in Cornwall’s mines, gets a little merry on botanical spirits, and adds a cheeky nip to his yummy clementine trifle.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/5LAqxzvSFw3UxLxJqbZKstmEtGd.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-23",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4232937,
                    "name": "Episode 9",
                    "overview": "On the trail of the 'greatest Second World War poet’, Charles Causley, Rick catches up with bestselling author Patrick Gale before heading home to whip up his favourite sea bass dish.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/vXP6XTZ0wQG5ftaTillPW4DU4WQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-24",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 4232938,
                    "name": "Episode 10",
                    "overview": "Rick spends a surreal afternoon watching a German film crew at work on a Cornish romance and discovers a brain-boosting mushroom, which he promptly puts in a stir fry.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 116054,
                    "still_path": "/SarlgYArW1QDj3WbAcMrRjKxDg.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "Rick Stein shares his love and passion for the people and places of his beloved Cornwall.",
            "id": 328884,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    }
}