{"adult":false,"backdrop_path":"/wdvHiWNSeR9xTGWuxmOhBc6rpQ4.jpg","created_by":[{"id":1215164,"credit_id":"525812ed19c29531db47df93","name":"Francine Pascal","gender":0,"profile_path":null}],"episode_run_time":[30,22],"first_air_date":"1994-09-05","genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":11671,"in_production":false,"languages":["en"],"last_air_date":"1997-10-14","last_episode_to_air":{"id":457361,"name":"Animal Rights and Wrongs","overview":"Elizabeth and Jessica try out to be in a commercial for double vision cosmetics, and they eventually get it. But when Elizabeth learns that double vision cosmetics tests their products on animals, she backs out. Todd has started to ignore Winston and is spending more time with his basketball friends, such as going bungee jumping with them and forgetting about the fact that he is supposed to go to a model airplane convention with Winston.","vote_average":0,"vote_count":0,"air_date":"1997-10-14","episode_number":22,"episode_type":"finale","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null},"name":"Sweet Valley High","next_episode_to_air":null,"networks":[{"id":40,"logo_path":"/333LtWX9Z7H9uRrNcCl1JcTvdpR.png","name":"UPN","origin_country":"US"},{"id":184,"logo_path":null,"name":"Syndication","origin_country":"US"}],"number_of_episodes":88,"number_of_seasons":4,"origin_country":["US"],"original_language":"en","original_name":"Sweet Valley High","overview":"Sweet Valley High is an American comedy-drama series","popularity":6.259,"poster_path":"/rkdEnsWEJuNREP1DUFNqy6zKbmk.jpg","production_companies":[{"id":2106,"logo_path":"/3ymjxYcUFEwCdMf2SoVyGd1aHef.png","name":"Saban Entertainment","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"1994-09-05","episode_count":22,"id":22206,"name":"Season 1","overview":"","poster_path":"/srU7hLIXHfgrzq0vkPlUnELlBVH.jpg","season_number":1,"vote_average":9.7},{"air_date":"1995-09-11","episode_count":22,"id":22204,"name":"Season 2","overview":"","poster_path":"/6NeZxt5CeYzUW9EQDMQPvm2cPhc.jpg","season_number":2,"vote_average":0},{"air_date":"1996-08-26","episode_count":22,"id":22205,"name":"Season 3","overview":"","poster_path":"/mArA0iVXncQN0rgaDY2SEhlE6cb.jpg","season_number":3,"vote_average":0},{"air_date":"1997-09-15","episode_count":22,"id":22203,"name":"Season 4","overview":"","poster_path":"/dug0Y91xgaqGOJx6wXvpdReBfVD.jpg","season_number":4,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.667,"vote_count":9,"season_data":{"1":{"_id":"525812e119c29531db47d6d7","air_date":"1994-09-05","episodes":[{"air_date":"1994-09-05","episode_number":1,"episode_type":"standard","id":457407,"name":"Dangerous Love","overview":"Liz breaks up with Todd when she is nominated for homecoming queen against her wishes. To Jessica's chagrin, not only does Liz beat her out for the title, but attracts the attention of college freshman Scott Daniels. Jessica convinces Liz to accept a date only to pull a twin-switch and go in her place. As usual, she gets what she wants... but she may get more than she wanted this time.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":10,"vote_count":1,"crew":[{"department":"Directing","job":"Director","credit_id":"525812e719c29531db47dc69","adult":false,"gender":2,"id":82346,"known_for_department":"Writing","name":"Jonathan Prince","original_name":"Jonathan Prince","popularity":3.627,"profile_path":"/1uN89BlnIHwiRUsvsIVomaXG1kb.jpg"}],"guest_stars":[]},{"air_date":"1994-09-12","episode_number":2,"episode_type":"standard","id":457406,"name":"Oracle On Air","overview":"When Sweet Valley High gets its own news station, Jessica fights for the spotlight against Elizabeth while trying to impress a new guy. She's willing to do anything; even pull a twin-switch on camera. Meanwhile, Winston, who is constantly being picked on by Bruce, tries to get his own back but seems to constantly fail.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1994-09-19","episode_number":3,"episode_type":"standard","id":457408,"name":"Skin and Bones","overview":"When Jess hears that Dakota Dancer is going to paint Enid for a national exhibition, she cons her way into posing for him by convincing Enid that he wants to paint her nude. Although she wears a bikini during the posing, the unveiling reveals a portrait of her actually in the raw. She's mocked by the school until Liz and the gang set out to stop the painting from being exhibited. Meanwhile the students are upset when the principal pulls down an offending photo of himself off the graffiti wall; Liz learns to speak up for her rights.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1994-09-26","episode_number":4,"episode_type":"standard","id":457409,"name":"Critical Mess","overview":"Spiraling gossip lead the gang to believe that Bruce's uncle is a famous Hollywood director. Determined to get a part, Jessica sends a review for Macbeth (in which she plays Lady Macbeth) to Andy Patman without reading; only to accordingly get slammed by her sister for overdoing the role. She blames Liz for not getting a part, especially when she finds out that Lila (who played Witch #2) got one. Liz goes to Andy Patman to make amends, only to actually score Jess a role... in a commercial.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1994-10-03","episode_number":5,"episode_type":"standard","id":457414,"name":"What, Me Study?","overview":"Jess is on the verge of flunking chemistry; unless she manages to get a good grade on an upcoming test she's bound to be kicked off the cheerleading squad. Winston manages to hack into Mr Russo's computer and discovers a love letter he's written to the secretary, he then proceeds to pass copies around the school. Jess uses this find to con Winston into telling her the password; she then takes a copy of the test and subsequently scoring an A. Unfortunately Mr Russo knows someone's stolen it and immediately suspects Jessica. To protest her innocence, she passes the blame onto Winston by using the love letter as an example. Liz sets out (again) to save the day.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1994-10-10","episode_number":6,"episode_type":"standard","id":457415,"name":"Almost Married","overview":"When Liz's parents go away for the weekend and with Todd's house being painted, she invites him to stay over so they can spend more time together. Although they begin the weekend with good intentions they then proceed to drive each other crazy. Jessica uses this opportunity to blackmail Liz into throwing a party and using the emergency credit card for a new dress. Chaos breaks loose when an accident ruins Jess's outfit, preventing her from returning it the next day.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-10-17","episode_number":7,"episode_type":"standard","id":457416,"name":"The Curse of Lawrence Manson","overview":"On Halloween the group pass on a party to hang out at school, where they intend to revive Lawrence Manson, a former student who died there exactly 25 years ago. They then proceed to get scared out of their wits... but is it all just a practical joke, or is it really Lawrence seeking revenge?","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":9,"vote_count":1,"crew":[{"department":"Directing","job":"Director","credit_id":"525812e719c29531db47dd36","adult":false,"gender":2,"id":3140,"known_for_department":"Acting","name":"Marc Lawrence","original_name":"Marc Lawrence","popularity":7.765,"profile_path":"/exCnOfb7yD7VSppd32RA9K4TIWx.jpg"},{"department":"Writing","job":"Writer","credit_id":"525812e719c29531db47dd1a","adult":false,"gender":0,"id":1212943,"known_for_department":"Writing","name":"Bruce Kalish","original_name":"Bruce Kalish","popularity":0.84,"profile_path":null}],"guest_stars":[]},{"air_date":"1994-10-24","episode_number":8,"episode_type":"standard","id":457413,"name":"The Prince of Santa Dora","overview":"Elizabeth's long-time penpal Prince Arthur Castillio comes to Sweet Valley and he and Jess feel an instant attraction. They manage to escape his bodyguard to enjoy an afternoon of fun. Jessica immediately falls in love and is already dreaming of becoming the queen of Santa Dora - however, Lila discovers that Arthur is actually engaged, and prepares to drop this bombshell in public.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1994-10-31","episode_number":9,"episode_type":"standard","id":457411,"name":"Coma","overview":"When Jess leaves Elizabeh stranded at the Moon Beach, she has no choice but to hitch a ride with Todd's motorcycle (or miss her deadline). On the way they get into an accident and while Todd is virtually unharmed, Liz is left with a coma. Guiltridden, Jess stays by her side until Liz recovers. However, she seems to have undergone a personality change, literally acting more \"\"Jessica\"\" than Jessica.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1994-11-07","episode_number":10,"episode_type":"standard","id":457417,"name":"Uh-Oh-Seven","overview":"After seeing a James Bond movie, Liz tries to write a similar type of story of her own, only the females are the strong characters and vice versa. Her main character is Platinum Blonde, a superspy who sets out to investigate a suspicious case concerning video game machines.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-11-14","episode_number":11,"episode_type":"standard","id":457410,"name":"Secrets","overview":"Enid's new boyfriend Ronnie chooses her to become the new spokesperson for an anti-drug campaign... touring the country with Steven Tyler. In confidence, Enid tells Liz that she's nervous because she used to have a drug problem herself. When Jessica overhears this she tries to use this information to snag the spokesperson position for herself. When Ronnie finds out about Enid's past he drops her from the campaign... and his life.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-11-21","episode_number":12,"episode_type":"standard","id":457412,"name":"Photographic Evidence","overview":"While at the beach, Liz catches a suspicious looking photo of three men, although she manages to escape without being caught. Later on she finds out that one of them is actually an important witness who has mysteriously disappeared. She tries to go to the police but because the picture is blurred they don't believe her story. While Winston is trying to fix up the photo, Jess hooks up with a new guy Chad, not realising that he is one of the men and thinks that she is Liz. Because Jessica impersonated Liz to get a date with him in the first place, she gets a hard time getting Chad to believe that it is not her, but her identical twin who has photo.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1994-11-28","episode_number":13,"episode_type":"standard","id":457425,"name":"Club X","overview":"Jessica wants to join Club X, an exclusive club which creates hijinx around the school. At first Bruce is agitated that a girl wants to join, but once she passes initiation, he tries to use her eagerness to his advantage, setting her up in front of the school principal. Meanwhile, Todd tries to earn extra money playing baseketball so he can take Liz out, but as his bank account grows, so does his ego. Liz and Winston try to deflate him by enlisting the help of a professional.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-12-05","episode_number":14,"episode_type":"standard","id":457419,"name":"Poetic Injustice","overview":"A few of the gang become interested in their teacher's Adam Buchman's poetry. When Jessica is teased for not being 'cultured' enough to appreicate poetry, she comes along to a poetry reading just to prove them wrong. Bored, she becomes interested only when she finally sees Adam, and subsequently undergoes a personality (and physical) change just to impress him. Unfortunately, her writing skills are still underdeveloped. Desperate to impress, she steals one of Liz's poems and passes it off as her own at the next poetry reading... not realising that it is actually Adam's.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-12-12","episode_number":15,"episode_type":"standard","id":457421,"name":"Stolen Diary","overview":"Feeling left out because Liz appears to spend all her time with Todd, Jessica tells Peggy that Todd is available in the hope of breaking them up. Peggy throws herself at Todd and Liz catches them, promptly breaking up with him. Then Jessica arranges a date between Liz and Chris. When Liz rejects Chris after one date, he uses her found diary (which she accidentally dropped) to spread her secrets around school. Pretty soon all of Liz's friends are mad at her, but Jess refuses to believe that Liz could spill their secrets, and promptly goes out to set things right.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Peggy","credit_id":"60998eb5006eee003c1e0ac9","order":502,"adult":false,"gender":1,"id":135528,"known_for_department":"Acting","name":"Lisa Pepper","original_name":"Lisa Pepper","popularity":2.612,"profile_path":"/cjwxRtmusgsymo6nvYcVf6kWkZJ.jpg"}]},{"air_date":"1995-01-02","episode_number":16,"episode_type":"standard","id":457423,"name":"Love On The Line","overview":"While working at a teen hotline, Enid helps Mike, a quarterback from another school, to get over his parent's divorce. She agrees to meet with him in person, but backs out at the last minute because she's afraid that she's not pretty enough for him. She asks Jessica for support only to have her steal him away. Winston's eager to show the new Japanese foreign exchange student how to be 'cool' only to find that the roles are actually reversed.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-09","episode_number":17,"episode_type":"standard","id":457420,"name":"Working Girl","overview":"Lila's dad forces her to work at the Moon Beach cafe and subsequently she becomes attracted to the meat delivery man, Heath. However, she discovers that she must hide her true idenity from him because he appears to have a thing against rich people. Jessica is thrilled to be working for the new fashion designer Dante until she learns that she is resigned to menial tasks such as making coffee. When she designs a jacket to show Dante, he promptly steals it to use in his own show.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-23","episode_number":18,"episode_type":"standard","id":457422,"name":"Dancing Fools","overview":"Jessica and Lila are at it again. The annual Pacific Freestyle Dance is coming up and the winners have a chance to appear on TV. Jessica, winner for the last two years, is aghast when her steady dance partner Franco leaves her to tour with Madonna. Especially when Lila's father has flown in a top dancer, Rico, for her. Grudgingly, she pairs with Winston only to find out that he's very good. But when Franco returns unexpectedly she promptly drops Winston. When Lila cons Franco into leaving town just before the concert, Jess steals Rico away, leaving Lila with no one but Winston to dance with. Meanwhile, Todd refuses to enter with Liz because he hates dancing, but is hurt when she never asks him and pairs with Koichi instead.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-30","episode_number":19,"episode_type":"standard","id":457418,"name":"Kidnapped (1)","overview":"Liz, working in the local hospital as a candy striper, finds out that famous talk show host Jeremy Frakes has landed in hospital. Jessia, determined to be his new assistant, also volunteers to get to him -- although she seems to only cause trouble for him. Meanwhile, Todd becomes jealous when Winston and Liz start to spend more time together. He starts suspecting his best friend has a crush on her when Liz starts to mysteriously receive flowers and letters.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e719c29531db47dd73","adult":false,"gender":0,"id":1211828,"known_for_department":"Writing","name":"David Garber","original_name":"David Garber","popularity":1.834,"profile_path":null}],"guest_stars":[]},{"air_date":"1995-02-06","episode_number":20,"episode_type":"standard","id":457427,"name":"Kidnapped (2)","overview":"The gang are at a party for Nicholas Morrow, the new heartthrob in town, when Liz is kidnapped following her shift at the hospital. Todd is the first to sense something's wrong, and he and Jess look for her everywhere only to discover that she's been kidnapped. Winston goes to the scene of the crime to look for her, but instead is arrested, which leads everyone to believe that it may be him who's kidnapped her.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e719c29531db47dd73","adult":false,"gender":0,"id":1211828,"known_for_department":"Writing","name":"David Garber","original_name":"David Garber","popularity":1.834,"profile_path":null}],"guest_stars":[]},{"air_date":"1995-02-13","episode_number":21,"episode_type":"standard","id":457424,"name":"Kidnapped (3)","overview":"When it is discovered that Peter has escaped from prison, Liz and Jess are put under protective custody. After two weeks with no danger, Jess is sick of being watched and manages to successfully escape. Unfortunately, she runs straight into Peter, who kidnaps her thinking she is Liz. When Peter realizes that it is the wrong twin he is dealing with, he sets up a deathtrap for her to get closer to Liz.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e719c29531db47dd73","adult":false,"gender":0,"id":1211828,"known_for_department":"Writing","name":"David Garber","original_name":"David Garber","popularity":1.834,"profile_path":null}],"guest_stars":[]},{"air_date":"1995-02-20","episode_number":22,"episode_type":"finale","id":457426,"name":"Say Goodbye","overview":"Todd is accepted into Fairmount Academy, a school capable of training many NBA hopefuls -- in Vermont. Liz has a hard time dealing with this, and finds in harder when they can't seem to spend any of his last days together. On his last night in Sweet Valley they get into an argument, and don't speak for two weeks. Nicholas then proceeds to ask Liz out, much to Jessica's dismay. Determined to get Nicholas, Jessica is determined to reunite Liz and Todd. She arranges for Todd to return to Sweet Valley -- with disastrous results.","production_code":"","runtime":null,"season_number":1,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":22206,"poster_path":"/srU7hLIXHfgrzq0vkPlUnELlBVH.jpg","season_number":1,"vote_average":9.7},"2":{"_id":"525812e119c29531db47d6c1","air_date":"1995-09-11","episodes":[{"air_date":"1995-09-11","episode_number":1,"episode_type":"standard","id":457363,"name":"Summer Lovin'","overview":"At the summer draws to a close, the gang finds out that Todd has returned to Sweet Valley. Although Liz is initailly ecstatic, she finds him to be moody and depressed. Although she tries to console him, he breaks up with her. Later on she finds out that he was actually cut from the team. Jess is determined to lead her team to victory at the end of summer annual Beach Olympics and beat Bruce's team - even if it means employing underhanded tactics. Manny - who watched too much tv over the summer - starts fantisising about Enid.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-09-18","episode_number":2,"episode_type":"standard","id":457362,"name":"Model Behavior","overview":"A new school year starts in Sweet Valley.  Tatyana Thomas, a famous model, comes to Sweet Valley hoping to start her life over.  However, it's not as easy as she's hoped.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-09-25","episode_number":3,"episode_type":"standard","id":457367,"name":"Promotional Rescue","overview":"Bruce is left in charge of the Moon Beach after his father buys it.  Bruce, hoping to impress his father, fires Winston and takes Jessica on as a business partner.  Meanwhile, Cheryl, Elizabeth, and Enid decide to take a camping trip in hopes that Elizabeth will start to get over Todd.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-10-02","episode_number":4,"episode_type":"standard","id":457365,"name":"Dark Side of the Moon Beach","overview":"Elizabeth decides it's time to start dating again, and with the help of Jessica, Lila, and Enid, she dates a bunch of guys. Winston catches Todd and his 'friends' trying to steal a car.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-10-09","episode_number":5,"episode_type":"standard","id":457369,"name":"IQ Commeth","overview":"Jessica--as well as everyone else--is surprised when she gets one of the highest scores on the college compatibility test. Her and Mortimer are chosen to represent the school in the academic bowl, and even though Jessica finds out that her test results were wrong, she decides to participate anyway. When Winston angers two guys--Todd's 'friends'--they demand two hundred dollars from him, which he doesn't have. Elizabeth decides to help him out and give him the money to pay them, but Jessica uses the money without asking to buy a new dress. Cheryl tries to help out Winston by teaching him boxing, just in case those two guys want to fight him.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-10-16","episode_number":6,"episode_type":"standard","id":457370,"name":"False Possessions","overview":"When Enid talks with Todd, she develops feelings for him and later asks him out. Todd, however, doesn't think of it as a date. Lila moves into The Wakefield's house while her own home is being fumigated. While Jessica and Lila are together at the mall, Jessica catches Lila shoplifting, and Lila tells her it's a total rush, so she decides to shoplift also, but they both end up getting caught.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-10-23","episode_number":7,"episode_type":"standard","id":457364,"name":"A Fair to Remember","overview":"The new coach asks Todd to please show his son around town.\n\nJason, who seems to be quite a shy guy, turns out to not be so shy around the local girls.  He not only goes on a date with Elizabeth, but also with Jessica.  Meanwhile, Todd tries to warn the girls about what Jason's doing.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-10-30","episode_number":8,"episode_type":"standard","id":457368,"name":"It's My Party and I'll Ditch It If I Want To","overview":"Instead of attending the Wakefield's annual sleep over, Jessica opts to to attend a dinner with Bruce and his friends from Harvard.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":1.451,"profile_path":null}],"guest_stars":[]},{"air_date":"1995-11-06","episode_number":9,"episode_type":"standard","id":457366,"name":"Blunder Alley","overview":"Bruce put up a fortune-teller at the moon beach, and the fortunes Jessica and Lila get only predict bad luck, which ends up coming true. Elizabeth goes on a date with a guy to the bowling alley, and when Todd hears this he decides to go as well and bring a date of his own.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":1.451,"profile_path":null}],"guest_stars":[]},{"air_date":"1995-11-13","episode_number":10,"episode_type":"standard","id":457371,"name":"Like Water For Hot Dogs","overview":"Todd and Elizabeth's anniversary is coming up, and Liz waits for him to ask her out. Lila and Winston help Todd become more romantic. Jessica gets tapes from the library to help her learn her lines as Dorothy, but she accidentally gets Spanish tapes instead.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-11-20","episode_number":11,"episode_type":"standard","id":457375,"name":"The Quick and the Blonde","overview":"Bruce, who's ancestor Bruno supposedly founded Sweet Valley, works on an exhibit on exploring the town's history.  However, Liz finds a diary that says otherwise.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-11-27","episode_number":12,"episode_type":"standard","id":457380,"name":"Mixed Doubles","overview":"Liz tries to help Enid gain self-confidence by giving her a job at the Oracle.  Meanwhile, Bruce gets interested in an exchange student from Brazil and makes a deal with Jessica.  She helps him to get Isabel, the exchange student, by making her jealous, and in turn, Bruce loans Jessica his yacht for the weekend.  However, the plan goes awry when Bruce and Jessica discover that they may be interested in each other.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-12-04","episode_number":13,"episode_type":"standard","id":457372,"name":"Reading, Writing, Rescue","overview":"Bruce sets up a security camera at the moon beach. Jessica literally saves Winston life, so now Winston is her genie, so whatever Jessica wants, he'll get. Current expose decides to do a story on Jessica's rescue, and Bruce threatens her with the security camera tape, which shows she didn't really try to save him. David is a new student and basketball player at Sweet Valley High. Enid thinks he doesn't like her, and Elizabeth finds out his secret that he can't read.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-12-11","episode_number":14,"episode_type":"standard","id":457378,"name":"The War of the Pom-Poms","overview":"A transfer student, Heather, is great and cheerleading and is voted as the squad's new co-captain.  Jessica, jealous and angry over Heather's elected position, quits the squad and tries to form her own.  When her squad is short a member, she blackmails Liz into joining the team by threatening to tell that Elizabeth dated Ken while Todd was away in Vermont.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-12-18","episode_number":15,"episode_type":"standard","id":457374,"name":"You Call This a Wonderful Life?","overview":"During the Christmas season, an angel is sent to show Elizabeth and Jessica what their friends's lives would have been like if they had never been born.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-01-01","episode_number":16,"episode_type":"standard","id":457376,"name":"Sam Enchanted Evening","overview":"Jessica meets Sam Woodruff at the race track where she is there with Liz and Lila watching Todd practice for a motercross race. She starts to get to know him better, and also learns about his past, in which he was in prison. Lila starts spending time with Liz and Todd now that she broke up with her boyfriend, and she drives them insane with her constant chatter.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-01-08","episode_number":17,"episode_type":"standard","id":457373,"name":"Totally Cueless","overview":"The Moon Beach holds a pool contest in which the winners receive a free trip to the Bahamas.  Jessica and Lila try to figure out a way to win the competition, even though they know nothing about pool.  Meanwhile, Winston and Manny try to convince Enid that she has amnesia and Manny is her boyfriend.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"525812e419c29531db47d9a0","adult":false,"gender":2,"id":52044,"known_for_department":"Directing","name":"David Winning","original_name":"David Winning","popularity":4.068,"profile_path":"/pQXcLaJ05OVmQuK5uM6Uqeuk1Ce.jpg"}],"guest_stars":[]},{"air_date":"1996-01-15","episode_number":18,"episode_type":"standard","id":457379,"name":"Win Sam, Lose Sam","overview":"Sam thinks he no longer has chances for getting a sponsor and racing in Australia when he ruins his chances of winning the motocross race by helping Todd. It's just the opposite. Jessica doesn't want him to go, and Sam tells her he doesn't want to go and that he wants to stay in Sweet Valley with her. When the yearbooks come out Todd is voted sexiest, Bruce is voted BMOC (Big mouth on Campus), Cheryl is voted most sophisticated, Winston is voted most likely to move back in with his parents, Manny is voted nicest smile, Enid is voted, talks the most, says the least, Lila is voted bionic spender, Jessica is voted flirtaholic, and Elizabeth is voted most responsible, which makes her upset. She decides to let Winston, Manny and Bruce plan the prom instead of her and tries to be more free spirited. Cheryl, Lila and Enid decide to go to the prom without dates, but then Enid is asked to go by Manny, and Cheryl asks Bruce to go with her, leaving Lila with no one. She eventually ends up stuck g","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-01-22","episode_number":19,"episode_type":"standard","id":457377,"name":"Identical Opposites","overview":"The talk show The Foxie Jones Show is looking for sets of twins to guest star on the show.  Jessica tries to convince Liz to go with her and be guests.  Liz finally agrees, but as they shoot the show, she finds that they're supposed to pretend to be long lost twins that were seperated at birth.  However, Liz soon gets her revenge when they tape a follow-up segment.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-01-29","episode_number":20,"episode_type":"standard","id":457383,"name":"One Big Mesa","overview":"The big football game- Sweet Valley vs. Mesa is coming up and everyone's in a frenzy.  Practical jokes are being played by everyone and Todd is arranging the half-time show in which everything must be perfect.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Ginger","credit_id":"64344c9a22af3e0077534e92","order":503,"adult":false,"gender":1,"id":56513,"known_for_department":"Acting","name":"Catherine Sutherland","original_name":"Catherine Sutherland","popularity":4.909,"profile_path":"/yGGrbprFrz47DlXIZenEedesow6.jpg"}]},{"air_date":"1996-02-05","episode_number":21,"episode_type":"standard","id":457382,"name":"Sam Kind of Wonderful","overview":"Jessica and Sam are spending allot of time together, and Lila is upset that Jess has entered the Sam zone. She decides to join Cheryl in painting, and doing pottery. Manny tries to find out what kind of guy Enid likes, but ends up getting it all wrong.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-03-25","episode_number":22,"episode_type":"finale","id":457381,"name":"A Look Back in Anecdotes","overview":"Many years later, Jessica is now a a talk show host, and Elizabeth is a journalist. When they come together to sell thier old house, they start packing and the packing leads to memories of thier time at Sweet Valley High.","production_code":"","runtime":null,"season_number":2,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":22204,"poster_path":"/6NeZxt5CeYzUW9EQDMQPvm2cPhc.jpg","season_number":2,"vote_average":0},"3":{"_id":"525812e119c29531db47d6cc","air_date":"1996-08-26","episodes":[{"air_date":"1996-08-26","episode_number":1,"episode_type":"standard","id":457384,"name":"Much Ado About Nachos","overview":"The group, which includes Lila, Jessica, Elizabeth, Todd, Enid, Cheryl and Winston, spend time at a Mexican resort. Jessica then tells everyone that they can do whatever they want and charge all the expenses to Lilaâ€™s credit card, which soon adds up to over 7000 dollars. Enid realizes Mannyâ€™s feelings for her.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-09-02","episode_number":2,"episode_type":"standard","id":457385,"name":"Shred Reckoning","overview":"Jessica and Lila are excited to hear that a new Patman (Reginald Patman) will be coming to Sweet Valley now that Bruce has left to join the army. Lila throws Reginald a party for him. Todd and his superstitions annoy Elizabeth. Winston hopes to become the manager at the moon beach so he tries to make the place look great and he hires a busboy to help him out.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":1.451,"profile_path":null}],"guest_stars":[]},{"air_date":"1996-09-09","episode_number":3,"episode_type":"standard","id":457386,"name":"Imperfectly Fit","overview":"Cheryl hosts a fitness video, and Jessica and Lila really want to be a part of it. Lila hires a personal trainer for both of them, and they also rent tons of fitness videos, but they are more worried about how to wear their hair and if lipsticks lasts till the end of the video. Elizabeth takes a job at the tribune, alongside Peter, who she starts developing feelings for.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-09-16","episode_number":4,"episode_type":"standard","id":457388,"name":"The Man of My Screams","overview":"Todd fears that Elizabeth is starting to like Peter so he gets Manny and Winston to spy on them. Jessica dreams about kissing Shred, which freaks her out. Lila tells her that to make the nightmares go away she must kiss him for real.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e519c29531db47dabd","adult":false,"gender":2,"id":16480,"known_for_department":"Acting","name":"Peter Egan","original_name":"Peter Egan","popularity":5.272,"profile_path":"/c1Mq0x2DEQiwzQYXD7AtFUdx7BC.jpg"}],"guest_stars":[]},{"air_date":"1996-09-23","episode_number":5,"episode_type":"standard","id":457387,"name":"Are You a Man or a Mouse?","overview":"Liz finally decides to call it quits with Todd. Winston and Shred try to help Todd get over her. Jessica accidentally looses a mouse, which Liz needs for her science project. Not knowing this, Jessica gets an exterminator to find and kill the mouse.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-09-30","episode_number":6,"episode_type":"standard","id":457390,"name":"The Mondo Chill","overview":"Shred decides to become ice cream man when the original one retires. He then hires a sad Enid to help him. Manny and Simone break up, and Manny start noticing Enid and Shred spending alot of time together. When Jessica gets the flu, Peter and Elizabeth's first date is spent at home caring for her.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-10-07","episode_number":7,"episode_type":"standard","id":457391,"name":"Surfing the Nets","overview":"The group makes a bet. They all have to give up their special quirks they have for 2 days, and if they crack they have to put 25 dollars in the pot. Whoever doesn't crack at the end of the two days wins all the money. So, for Jessica, this means no flirting, for Lila, no shopping, for Cheryl, no sarcastic remarks, for Todd, talking about sports, and for Enid, no relative stories. When Peter and Elizabeth come across cut fishing nets at the beach they find out that Shred's father R.J Patman is responsible for this. Peter dreams of this being a big story, and Shred is scared to confront his father about the situation.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":1.451,"profile_path":null}],"guest_stars":[]},{"air_date":"1996-10-14","episode_number":8,"episode_type":"standard","id":457389,"name":"Mall Brats","overview":"Jessica and Lila take jobs at the mall (which doesn't last too long) to pay for dresses they want to buy since Lila's credit card isn't working. Peter and Liz break up.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-10-21","episode_number":9,"episode_type":"standard","id":457392,"name":"Swish Upon a Star","overview":"Jessica becomes more and more self absobed. She blurts out that Elizabeth and Cheryl have been planning a surprise birthday for Enid, with Enid there able to hear. Jessica has taken all the hot water, and borrowed her sister's clothes without asking. Elizabeth decides to pay her back for what she did. When Todd scores the winning points at a basketball game, his ego starts to spin out of control.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e519c29531db47dabd","adult":false,"gender":2,"id":16480,"known_for_department":"Acting","name":"Peter Egan","original_name":"Peter Egan","popularity":5.272,"profile_path":"/c1Mq0x2DEQiwzQYXD7AtFUdx7BC.jpg"}],"guest_stars":[{"character":"Melvin","credit_id":"64a0ae040cb33500fe5eb702","order":504,"adult":false,"gender":0,"id":2349831,"known_for_department":"Acting","name":"David Castellani","original_name":"David Castellani","popularity":1.031,"profile_path":null}]},{"air_date":"1996-10-28","episode_number":10,"episode_type":"standard","id":457393,"name":"The Tooth Hurts","overview":"Reggie's constant snack of chocolate leaves him with cavaties.  Cheryl and Enid try to convince him that he's addicted, while Reggie won't believe him.  Meanwhile, the television show Headline America wants to interview Todd.  He asks Elizabeth for help with his nerves.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-11-04","episode_number":11,"episode_type":"standard","id":457394,"name":"Rock Around the Block","overview":"Todd is kicked off of the football team after illegally accpeting gifts.  Television reports on Todd's story try to ignore Todd and Elizabeth's relationship.  Meanwhile, Jessica is annoyed with a neighborhood band practicing loudly until she meets one of the cute members of the band.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"A.J.","credit_id":"5585a3c1c3a368273b000814","order":501,"adult":false,"gender":2,"id":50098,"known_for_department":"Acting","name":"Jason David Frank","original_name":"Jason David Frank","popularity":4.913,"profile_path":"/lR7VkHYktJTgim0UGpafC1t8gLS.jpg"}]},{"air_date":"1996-11-11","episode_number":12,"episode_type":"standard","id":457395,"name":"Lofty Ambitions","overview":"Employees of one of the Moon Beach's competitors play practical jokes at the Moon Beach, annoying Winston.  Meanwhile, Liz and Enid try to do something brave and Jessica continues to see A.J.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"A.J.","credit_id":"5585a3c1c3a368273b000814","order":501,"adult":false,"gender":2,"id":50098,"known_for_department":"Acting","name":"Jason David Frank","original_name":"Jason David Frank","popularity":4.913,"profile_path":"/lR7VkHYktJTgim0UGpafC1t8gLS.jpg"}]},{"air_date":"1996-11-18","episode_number":13,"episode_type":"standard","id":457396,"name":"Shakes, Fries & Videotape","overview":"When Moon Beach's competitor lowers their prices, the Moon Beach starts to have a low turn out of customers.  Winston decides to try and create a commercial for the Moon Beach starring Liz.  With A.J. spending so much time with Jessica, his band forces him to choose between them and her.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e519c29531db47dabd","adult":false,"gender":2,"id":16480,"known_for_department":"Acting","name":"Peter Egan","original_name":"Peter Egan","popularity":5.272,"profile_path":"/c1Mq0x2DEQiwzQYXD7AtFUdx7BC.jpg"}],"guest_stars":[{"character":"A.J.","credit_id":"5585a3c1c3a368273b000814","order":501,"adult":false,"gender":2,"id":50098,"known_for_department":"Acting","name":"Jason David Frank","original_name":"Jason David Frank","popularity":4.913,"profile_path":"/lR7VkHYktJTgim0UGpafC1t8gLS.jpg"}]},{"air_date":"1996-11-25","episode_number":14,"episode_type":"standard","id":457398,"name":"A Star is Torn","overview":"Jessica helps out A.J.'s band by giving their demo tape to a Dj to play on the radio.  However, helping A.J.'s band to beome big, threatens to end Jessica and A.J.'s relationship.  Meanwhile, Liz has an extra ticket to a concert and decides to give away her extra ticket.  Todd ends up with the ticket.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":1.451,"profile_path":null}],"guest_stars":[{"character":"A.J.","credit_id":"5585a3c1c3a368273b000814","order":501,"adult":false,"gender":2,"id":50098,"known_for_department":"Acting","name":"Jason David Frank","original_name":"Jason David Frank","popularity":4.913,"profile_path":"/lR7VkHYktJTgim0UGpafC1t8gLS.jpg"}]},{"air_date":"1996-12-02","episode_number":15,"episode_type":"standard","id":457399,"name":"Ready, Set, Snow!","overview":"Jessica and Lila only want to receive Christmas gifts; not give them. While they get massages, both girls get the \"\"Christmas Carol\"\" treatment for their Scrooge-type behavior.  Three cast members take turns playing the ghosts of Christmases Past, Present,and Future. The girls wise up and decide to help give presents to children.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-12-02","episode_number":16,"episode_type":"standard","id":457397,"name":"Don't Strand So Close To Me","overview":"When Todd find out that Elizabeth has a new boyfriend, Chad, he eventually asks out Carrie. When he and Carrie go hiking he gets lost in the woods and calls Liz to come get him, who is ablout to go on her date with Chad. Jessica is convinced she has psychic powers after seeing a commerical.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e519c29531db47dabd","adult":false,"gender":2,"id":16480,"known_for_department":"Acting","name":"Peter Egan","original_name":"Peter Egan","popularity":5.272,"profile_path":"/c1Mq0x2DEQiwzQYXD7AtFUdx7BC.jpg"}],"guest_stars":[]},{"air_date":"1996-12-16","episode_number":17,"episode_type":"standard","id":457400,"name":"All Along the Water Tower","overview":"After the guys at Sweet Valley High hear over the intercom that Elizabeth likes guys that are into sports all the jocks in school start asking her out. Todd thinks that Elizabeth doesn't want to be with him when she also mentions over the intercom all the guys she's been with. Todd tries to win her over by using a magazine she left at the moon beach. While Jessica is reading a book--Silos--a photographer shows up at the front door, just like in the book. Enid's relatives come to Sweet Valley for the Rollins family hoe down.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525812e619c29531db47dbc2","order":500,"adult":false,"gender":2,"id":49624,"known_for_department":"Acting","name":"Jensen Ackles","original_name":"Jensen Ackles","popularity":33.068,"profile_path":"/vFegIjLLQGwPn6af4SE9LAbnGNE.jpg"}]},{"air_date":"1997-01-06","episode_number":18,"episode_type":"standard","id":457401,"name":"My Fair Shred","overview":"Shred faces going to a military school.  Meanwhile, Jessica and Lila don't get invitations to the Patman's big Silver and Gold Ball.  They work out a deal in which they will help Shred to be able to stay in Sweet Valley and he gets them invitations to the ball.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-01-13","episode_number":19,"episode_type":"standard","id":457403,"name":"Sweet Valley Fever","overview":"Jessica takes on responsibility planning the next dance at SVH. She steals the idea for a 70's disco dance from Enid. She doesn't want to do any of the work, so she eventually tells her sister she can help her. Todd wants to go to the dance as a famous basketball player of the 70's, while Liz wants him to go in an outfit she saw Principle Cooper wear in an old SVH yearbook. Manny wants to ask Enid to the dance, but then there is a misunderstanding and he goes with Simone, just as friends, while Enid goes with Winston, just as friends also.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e519c29531db47dabd","adult":false,"gender":2,"id":16480,"known_for_department":"Acting","name":"Peter Egan","original_name":"Peter Egan","popularity":5.272,"profile_path":"/c1Mq0x2DEQiwzQYXD7AtFUdx7BC.jpg"}],"guest_stars":[]},{"air_date":"1997-01-20","episode_number":20,"episode_type":"standard","id":457402,"name":"Crimes and Cappuccinos","overview":"Lila is kidnapped outside the moon beach, and Jessica starts spending alot of time with Enid now that Lila is nowhere to be seen. Winston finds a cappuccino machine and it doesn't take long for the moon beach to become the best place to be.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-01-27","episode_number":21,"episode_type":"standard","id":457404,"name":"Search For Liz","overview":"Jessica hits her head on a door and dreams she and her friends are characters in one of her soap operas. Jessica's married to Winslow and is accused of killing Delilah. She only has 24 hours to prove her innocence. Rod, the clueless detective, has to find out who it was that killed Delilah. Low down Liz Wakefield is Jessica's evil twin who works at the gloom beach cafe, and is the one who did try to kill Delilah. The other characters are the nurse, Cheryl, who is in love with the doctor, Shred, a rocker, Enid, and Manno, the officer who is madly in love with Enid.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":1.451,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-02-10","episode_number":22,"episode_type":"finale","id":457405,"name":"Might as Well Jump","overview":"Winston convinces Todd to go ahead with his traditional jump off Jackson's bluff with the basketball team, joined by Winston himself. Jessica and Lila want to spend Spring break in Europe, but there is only on problem. Jessica fails her social studies test, and is forced to take a make-up test and pass it, or else spend spring break with the teacher taking make-up classes.","production_code":"","runtime":null,"season_number":3,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":1.451,"profile_path":null}],"guest_stars":[]}],"name":"Season 3","overview":"","id":22205,"poster_path":"/mArA0iVXncQN0rgaDY2SEhlE6cb.jpg","season_number":3,"vote_average":0},"4":{"_id":"525812e119c29531db47d6b6","air_date":"1997-09-15","episodes":[{"air_date":"1997-09-15","episode_number":1,"episode_type":"standard","id":457341,"name":"Romance Wasn't Built in a Day","overview":"Enid wins a trip for her and her friends to go to a resort in Brazil. There, she constantly drives Cheryl crazy with her hyper attitude. Winston plays shuffleboard with old woman. Todd wants to sleep with Elizabeth, and Jessica wants to get to know Ricardo, a latin singer. He, however, is spending alot of time with a girl named Renata. Lila gets a tooth ache from biting into a pearl.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-16","episode_number":2,"episode_type":"standard","id":457340,"name":"Loose Lips Sink Yachts","overview":"Devon Whitelaw arrives in Sweet Valley and Jessica and Renata both want to date him and know everything there is to know about him. Elizabeth and Enid come across an article saying that Devon's parents were killed in a boat accident and that Devon gets thier Inheritance. Alot of people are convinced he killed his parents for thier money, except for Elizabeth. Lila finds out that she has a locker at geek corner.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-17","episode_number":3,"episode_type":"standard","id":457345,"name":"Drag King","overview":"Winston tries new themes out at the Moon Beach to make Renata feel more at home.  Meanwhile, Jessica tries out a love potion in order to attract Devon, a drag racer.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-18","episode_number":4,"episode_type":"standard","id":457344,"name":"The Right to Bare Midriffs","overview":"Todd starts spending allot of time on the Internet, making Liz worried. Winston decides to meet his online girlfriend, Petunia, but before they meet, they send pictures of each other. Because of a misunderstanding, Petunia thinks the guy she has been talking to online is Todd. When Renata, Lila, and Jessica hear there might be a dress code, they decide to protest and they take their fight down to city hall.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d713","adult":false,"gender":2,"id":1234100,"known_for_department":"Writing","name":"Peter Knight","original_name":"Peter Knight","popularity":1.559,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-09-19","episode_number":5,"episode_type":"standard","id":457342,"name":"Lights, Camera, Factions","overview":"Winston is shooting a movie for a student film festival.  Jessica is completely uninterested in the film until she finds that Friskel and Debert will be judging the films.  Then Jessica gets a little too interested in the film and insists that Winston do everything her way.  Devon thinks that Liz should lighten up a little bit more and tries to help her by getting her detention.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d713","adult":false,"gender":2,"id":1234100,"known_for_department":"Writing","name":"Peter Knight","original_name":"Peter Knight","popularity":1.559,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-09-22","episode_number":6,"episode_type":"standard","id":457343,"name":"A Kiss is Just a Kiss","overview":"Jessica find the perfect guy in Devon Whitelaw, who only seems to be interested in Elizabeth. Tood gives Renata driving lessons so she can get her driveers licence since she doesn't have one in the United States.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-23","episode_number":7,"episode_type":"standard","id":457349,"name":"The Kiss Heard Around the School","overview":"When the school learns that Devon and Elizabeth kissed, thanks to Renata, Todd soon find out as well and punches Devon. Cheryl gets Enid an interview for a possibility to be an ear model.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-24","episode_number":8,"episode_type":"standard","id":457354,"name":"Lucky Streaks","overview":"Liz starts seeing Devon, while Todd starts seeing Renata.  Jessica is angry because it seems that she wasn't good enough for Devon, but instead, her sister was.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d713","adult":false,"gender":2,"id":1234100,"known_for_department":"Writing","name":"Peter Knight","original_name":"Peter Knight","popularity":1.559,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-09-25","episode_number":9,"episode_type":"standard","id":457352,"name":"West Coast Story (1)","overview":"The big game against Big Mesa is coming up and the pranks start to begin again.  Sweet Valley isn't as sure to win as they first thought they were after Mesa's star player Christian Gorman returns to Big Mesa.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":2.171,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-09-26","episode_number":10,"episode_type":"standard","id":457347,"name":"West Coast Story, Part Deux (2)","overview":"The prank war continues on in preparation of the big game, leading to a fight to be scheduled between the boys from each school.   Meanwhile, Jessica starts to date one of the Big Mesa guys and as a result, her popularity begains to fall.  Jessica thinks about possibly transferring over to Big Mesa.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":2.171,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-09-29","episode_number":11,"episode_type":"standard","id":457351,"name":"Rumble in the Valley (3)","overview":"The fight between the boys from each school is rescheduled.  As the fight nears, Manny and Winston start to think about backing out.  Meanwhile, Devon tries to apologize to Liz.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-30","episode_number":12,"episode_type":"standard","id":457353,"name":"Devon Breaklaw","overview":"Elizabeth finally get the courage to break up with Devon after his recent outbreaks and the fact that he can't control his anger. Jessica helps Renata win back Todd. She tells Renata that Todd likes the all american girl, so she starts to wear boring clothes, hardly any make-up, no jewelry, and straitens her hair in hope that Todd will come back to her.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":2.171,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-10-01","episode_number":13,"episode_type":"standard","id":457355,"name":"Skiing is Believing","overview":"Jessica, Elizabeth, Cheryl, and Enid take a trip up to the moutains to go skiing. Jessica wants to win the women's downhill race to prove she is the bette skier than Elizabeth. Manny is mad that Enid decided to go on the ski trip since its thier first anniversiry and he's scared she'll find someone new.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d713","adult":false,"gender":2,"id":1234100,"known_for_department":"Writing","name":"Peter Knight","original_name":"Peter Knight","popularity":1.559,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-10-02","episode_number":14,"episode_type":"standard","id":457350,"name":"Single in Sweet Valley (1)","overview":"A new student named Betsy tries to become Jessica and constantly follows her everywhere.  Meanwhile, a radio talk show features a boy who wants to find someone to date in Sweet Valley.  Liz's friends convince her to write a letter and Single in Sweet Valley ends up choosing her.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-03","episode_number":15,"episode_type":"standard","id":457346,"name":"Sailing Solution (2)","overview":"It turns out that this Single in Sweet Valley is in fact Todd, and so he and Liz are back together again.  Todd wants them to go sailing, but Elizabeth finds that it's during the same time that she's supposed to receive her award for the Junior Writing Awards.  Meanwhile, Lila and Jess compete with each other in a Teen Girl Magazine competition to see who's the better party hostess.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-06","episode_number":16,"episode_type":"standard","id":457348,"name":"Down By Whitelaw (1)","overview":"Devon promises to learn to deal with his anger and liz agrees to help him.  The case surrounding his parents's death is re-opened, with Devon as the main suspect.  Jessica tries to use the publicity to be in the public eye.  Meanwhile, Devon has nightmares and starts to realize that he might in fact have been responsible for the death of his parents.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":2.171,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-10-07","episode_number":17,"episode_type":"standard","id":457356,"name":"Down By Whitelaw, Part Dos (2)","overview":"Through his dreams, Devon realizes that someone else was on board the yacht when his parents died- Sam.  Before Devon can tell Liz the identity of this other person, Liz visits Sam to tell him that Devon realized that someone else was on board.  Liz is then taken hostage by Sam.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":2.171,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-10-08","episode_number":18,"episode_type":"standard","id":457358,"name":"Swing Time","overview":"Liz fears that Todd slept with Renata while he was dating her when Renata continues to flirt with him.  Meanwhile, a photographer wants to photograph Jessica, but everyone else warns her that it might be dangerous.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-09","episode_number":19,"episode_type":"standard","id":457357,"name":"Down Horoscope","overview":"Enid reads her horoscope and finds out that a scorpio will find her irrestistible. When she learns that Devon matches that description, she thinks he wants to date her. Jessica doesn't want anyone to know that her and Devon are dating, which bother's him. They are supposed to meet at a party and Jessica sees him with another girl. She mistakes the girl as his date, when it happens to be his next door neighbour whom he drove to the party. When Elizabeth protects Todd with her Judo skills he gets teased about it. He eventually enroles in Judo himself.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d713","adult":false,"gender":2,"id":1234100,"known_for_department":"Writing","name":"Peter Knight","original_name":"Peter Knight","popularity":1.559,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-10-10","episode_number":20,"episode_type":"standard","id":457359,"name":"A Simple Twist of Mates","overview":"Todd accidently kissed Jessica in the library, thinking it's Liz! They don't want to tell Devon and Elizabeth, but when Todd and Liz go on a double date with Jess and Devon they end up finding out. When Lila is prepared for a history test she copies Enid's work, and Enid ends up getting blamed for cheating.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-13","episode_number":21,"episode_type":"standard","id":457360,"name":"Ticket to Lie","overview":"When Jessica gets pulled over for speeding, she gives the officer her sister's ID since she doesn't have her own. When Todd discovers the upcoming test questions he and Winston have to break into the school and return it. Enid and Manny find out they might be related.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d788","adult":false,"gender":1,"id":158645,"known_for_department":"Writing","name":"Peggy Nicoll","original_name":"Peggy Nicoll","popularity":2.171,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-10-14","episode_number":22,"episode_type":"finale","id":457361,"name":"Animal Rights and Wrongs","overview":"Elizabeth and Jessica try out to be in a commercial for double vision cosmetics, and they eventually get it. But when Elizabeth learns that double vision cosmetics tests their products on animals, she backs out. Todd has started to ignore Winston and is spending more time with his basketball friends, such as going bungee jumping with them and forgetting about the fact that he is supposed to go to a model airplane convention with Winston.","production_code":"","runtime":null,"season_number":4,"show_id":11671,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525812e219c29531db47d713","adult":false,"gender":2,"id":1234100,"known_for_department":"Writing","name":"Peter Knight","original_name":"Peter Knight","popularity":1.559,"profile_path":null}],"guest_stars":[]}],"name":"Season 4","overview":"","id":22203,"poster_path":"/dug0Y91xgaqGOJx6wXvpdReBfVD.jpg","season_number":4,"vote_average":0}}}