{"adult":false,"backdrop_path":"/q2duDsVXVhyRQLh5HwdF1L2kAXu.jpg","created_by":[],"episode_run_time":[62],"first_air_date":"2021-05-07","genres":[{"id":35,"name":"Comedy"},{"id":18,"name":"Drama"}],"homepage":"https://program.kbs.co.kr/2tv/drama/imitation/","id":116708,"in_production":false,"languages":["ko"],"last_air_date":"2021-07-23","last_episode_to_air":{"id":2641684,"name":"Episode 12","overview":"","vote_average":0,"vote_count":0,"air_date":"2021-07-23","episode_number":12,"episode_type":"finale","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/mB6Nd1c5CgecoLtyxK8CvmuOuua.jpg"},"name":"Imitation","next_episode_to_air":null,"networks":[{"id":342,"logo_path":"/nFmWwUAf2D3iAtizUcmkxufaM0q.png","name":"KBS2","origin_country":"KR"}],"number_of_episodes":12,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"이미테이션","overview":"Ma-Ha is a member of girl group Teaparty. The other members are Ri-A and Hyun-Ji. Since their debut, they haven't achieved much success. Ma-Ha has received some attention due to her resemblance to popular singer Ri-Ma. Teaparty then takes part in a reality TV program, involving popular idol groups participating in sporting events. Ma-ha wants to catch the attention of viewers. Meanwhile, Kwon Ryeok is member of popular boy band Shax. He is well liked and is good at singing, dancing, and acting. He is also focused on maintaining his success. He doesn't like Ma-Ha, who imitates the appearance of popular singer Ri-Ma. During the TV program, Hyeok from boy band Shax gets injured due to Ma-Ha. Kwon Ryeok bursts out with anger at Ma-Ha. She also receives hate from other people. Ma-Ha doesn't want to see Kwon Ryeok anymore, but they cross paths on TV programs and while performing in a drama series.","popularity":6.379,"poster_path":"/s62lBhUvPRx8WugYLjaar9o3Vb3.jpg","production_companies":[{"id":139214,"logo_path":"/1aHsO2tVEdJfIBYCy0G4VpWYDY8.png","name":"Kakao Entertainment","origin_country":"KR"},{"id":106643,"logo_path":null,"name":"Hidden Sequence","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2021-05-07","episode_count":12,"id":176582,"name":"Season 1","overview":"","poster_path":"/yaQ0bNYpv03ywGcDCK5lPKPqPy1.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.962,"vote_count":13,"season_data":{"1":{"_id":"6000f855a6a4c1003fe62ba1","air_date":"2021-05-07","episodes":[{"air_date":"2021-05-07","episode_number":1,"episode_type":"standard","id":2641609,"name":"Episode 1","overview":"Three years before the main events of the story, idol trainee Lee Ma-ha's dream of debuting in a girl group is cut short when news of a fellow trainee Annie who had committed suicide breaks out and disturbs the K-pop industry. Elsewhere, the comeback of popular boy group Shax kicks off with a rough start as Kwon Ryok is forced to cover for a co-member Lee Eun-jo who suddenly goes missing. At the present time, Ma-ha struggles to support herself by impersonating the famous solo artist La Ri-ma while Shax has become the most popular group in the industry, with Ryok developing a successful acting career.","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/a4ro0aIYA8Y5SohQAcxnHfeyRn2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-14","episode_number":2,"episode_type":"standard","id":2641673,"name":"Episode 2","overview":"After an eventful movie shoot, Ma-ha chooses to quit pursuing idol stardom and start a new life, a decision seconded by her teammates Yu Ri-ah and Shim Hyun-ji. In a press conference, reporter Byun Jung-hee causes a stir by questioning Shax about Eun-jo whose disappearance has already caused an emotional toll on Ryok. Meanwhile, Shax's ex-manager Ji Hak returns to the K-pop industry and decides to manage Ma-ha, Ri-ah and Hyun-ji. The trio changes their minds, resolves to accept Ji Hak's offer and adopts the group name \"Tea Party.\" Ji Hak starts implementing his unorthodox way in managing an idol group.","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/60UK4oMNWq5vId1wKsN8hwiq856.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-21","episode_number":3,"episode_type":"standard","id":2641674,"name":"Episode 3","overview":"Controversy is stirred amongst Shax fans when Ma-ha is photographed returning Ryok's jacket to him after a television shoot. Ryok is forced to apologize to fans, who brazenly demand Shax avoid Ri-ma and Ma-ha at all costs. In a meeting with her CEO, Ri-ma threatens to end her contract if she does not get to record a duet with Ryok. Meanwhile, Tea Party work to find their perfect debut single as Ji Hak prepares for their first appearance on a music show. Elsewhere, Ma-ha's best friend Lee Yu-jin prepares a comeback with his own group, Sparkling, but he is troubled by Ma-ha's interactions with Ryok.","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/AwqVmHbVpw7ahIosqggHSzub3u.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-28","episode_number":4,"episode_type":"standard","id":2641675,"name":"Episode 4","overview":"Shax's CEO Park Jin-man forces the group to appear on a music show, despite their pledge to do otherwise for their juniors' sakes. The move leads junior artists, including Tea Party, to have shorter screentimes. Yu-jin confronts Ryok about the situation and is chastised for being rude to a senior in the industry. However, Tea Party earns a taste of popularity after skillfully performing their debut single a cappella when a technical glitch cuts out their music. Ma-ha fills in the vacated female lead role in a film Ryok is starring in and joins in a tour across major cities to promote the film's premiere.","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/t6RklCSXkl7c8AfzIzZRVLP2wCo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-04","episode_number":5,"episode_type":"standard","id":2641676,"name":"Episode 5","overview":"During the film promotion tour, Ma-ha and Ryok find themselves in a tight spot as Shax's sasaeng fans storm the halls of their accommodation. Ji Hak is confronted by Jung-hee who is investigating Eun-jo's disappearance and Ji Hak's connection to the late idol trainee Annie, whom she suspects to have been Eun-jo's girlfriend. Elsewhere, Yu-jin and Hyun-ji do a photoshoot together while Ri-ah rejects a request from Shax's Lee-hyun to collaborate on a song. While forced to read more film and TV drama scripts, Ryok recruits his bandmates Do-jin and Hyuk to help him understand his developing feelings towards Ma-ha.","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/l6lrmKOPHlbdiEztoxATlaCXOUA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-11","episode_number":6,"episode_type":"standard","id":2641677,"name":"Episode 6","overview":"Ryok visits Ma-ha outside of her apartment, but is chased off by Hyun-ji and Ri-ah. Ma-ha is cast for a sitcom along with Ryok's co-members Do-jin and Hyuk. Ryok is forced to accept another role in an action film right after finishing a countryside shooting for a reality show. Ryok's co-members Do-jin and Hyuk help him sneak out to visit Ma-ha, but are caught by Shax's leader Jae-woo. Ma-ha, Hyun-ji, and Ri-ah visit the set of Ryok's new film where Yu-jin has a supporting role. Ma-ha unwittingly distracts Ryok with her arrival, causing him to crash his car in the midst of the shooting.","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/fNlBYalJJatoVaigvdVl1QbQ4q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-18","episode_number":7,"episode_type":"standard","id":2641678,"name":"Episode 7","overview":"Ryok does not sustain any serious injuries from the accident but his hospitalization allows him compensate on his lack of sleep due to his tight schedule. Shax's manager Dae-kwon apologizes to Ryok for making him overwork and promises that he will do anything he asks. Dae-kwon, Do-jin and Hyuk arrange a secret meeting at the hospital between Ryok and the unknowing Ma-ha who bursts into tears upon arrival. Ma-ha and Ryok confess their feelings for each other. Upon his recovery, Ryok receives a warm welcome from his co-members, while Lee-hyun opens up to Ryok about his feelings for Ri-ah. Later, Ryok takes Ma-ha on a nighttime date in a mountain.","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/V8kx0RBishrQXNsXcSsKu51zYY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-25","episode_number":8,"episode_type":"standard","id":2641680,"name":"Episode 8","overview":"Unbeknownst to Ma-ha and Ryok, a paparazzo has taken photos of them and has decided to spy on the couple. After finding out that Ma-ha will be shooting kissing scenes for the sitcom, Ryok visits the set with a food truck but can barely contain his jealousy while watching Ma-ha's kissing scene. Later, the paparazzo reveals Ryok and Ma-ha's secret dating to CEO Park, who then convinces Tea Party's former boss to file a trumped-up breach of contract lawsuit against the trio. Ma-ha and Ryok learn that their secret relationship has been exposed. While Ji Hak and Tea Party brace themselves for the lawsuit, Ryok resorts to a difficult decision.","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/Awy4SzGIUrO2RBbHyuHOMDzqdCU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-02","episode_number":9,"episode_type":"standard","id":2641681,"name":"Episode 9","overview":"","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/ybMVQkqx9PNhA47Czj3bFedYvXt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-09","episode_number":10,"episode_type":"standard","id":2641682,"name":"Episode 10","overview":"","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/9QmRXGJ390iC76iGtx1kg6ReqQO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-16","episode_number":11,"episode_type":"standard","id":2641683,"name":"Episode 11","overview":"","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/rWRe44ZkJzduRkcGsN02LS9C86C.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-23","episode_number":12,"episode_type":"finale","id":2641684,"name":"Episode 12","overview":"","production_code":"","runtime":62,"season_number":1,"show_id":116708,"still_path":"/mB6Nd1c5CgecoLtyxK8CvmuOuua.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":176582,"poster_path":"/yaQ0bNYpv03ywGcDCK5lPKPqPy1.jpg","season_number":1,"vote_average":0}}}