{"adult":false,"backdrop_path":"/a7oZ4AMrR7y3q0xm6VHb4FxXGED.jpg","created_by":[{"id":228989,"credit_id":"62371237209f180072d560b4","name":"Ravi Chopra","gender":2,"profile_path":null},{"id":1043908,"credit_id":"60bc4e70b0460500295cb308","name":"B.R. Chopra","gender":0,"profile_path":null}],"episode_run_time":[45],"first_air_date":"1988-10-02","genres":[{"id":18,"name":"Drama"}],"homepage":"","id":12605,"in_production":false,"languages":["hi","ta","te"],"last_air_date":"1988-10-02","last_episode_to_air":{"id":484668,"name":"Raja Bharat and Raja Shantanu","overview":"King Bharat sows the seed of democratic thinking by appointing a commoner as his successor. Many generations later, King Shantanu risks the tradition when he marries Ganga and promising never to question her for anything she does.","vote_average":9,"vote_count":1,"air_date":"1988-10-02","episode_number":1,"episode_type":"standard","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null},"name":"Mahabharat","next_episode_to_air":null,"networks":[{"id":177,"logo_path":"/mXNmU8Ya7ljkap8P9F5wm717CvS.png","name":"DD National","origin_country":"IN"}],"number_of_episodes":94,"number_of_seasons":1,"origin_country":["IN"],"original_language":"hi","original_name":"महाभारत","overview":"A dynastic struggle occurs for the throne of Hastinapur, the kingdom ruled by the Kuru clan, between the Kauravas and Pandavas, collateral branches of the clan, which causes the Kurukshetra War.","popularity":15.919,"poster_path":"/850vJ2Is5zTYh7lnwhMvwovwRSe.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":null,"episode_count":12,"id":23500,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"1988-10-02","episode_count":94,"id":23499,"name":"Season 1","overview":"","poster_path":"/wQLCIUAVqnWDYaIzRxI1CuDolJo.jpg","season_number":1,"vote_average":8.5}],"spoken_languages":[{"english_name":"Hindi","iso_639_1":"hi","name":"हिन्दी"},{"english_name":"Tamil","iso_639_1":"ta","name":"தமிழ்"},{"english_name":"Telugu","iso_639_1":"te","name":"తెలుగు"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.625,"vote_count":23,"season_data":{"1":{"_id":"525821e6760ee36aaa7be1f0","air_date":"1988-10-02","episodes":[{"air_date":"1988-10-02","episode_number":1,"episode_type":"standard","id":484668,"name":"Raja Bharat and Raja Shantanu","overview":"King Bharat sows the seed of democratic thinking by appointing a commoner as his successor. Many generations later, King Shantanu risks the tradition when he marries Ganga and promising never to question her for anything she does.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":2,"episode_type":"standard","id":484680,"name":"Ganga Kills Her Sons","overview":"Bound by his promise, Shantanu does not question Ganga as she sacrifices seven sons. When he protests at the birth of their eighth son, Ganga leaves him. Years later the son is returned, trained and educated as Prince Devarata.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":3,"episode_type":"standard","id":484681,"name":"Bhishma is Big","overview":"Devarata is crowned as Yuvraj, heir apparent. But, to enable the marriage of his father to a village girl, Devarata renounces his rights to the throne and also vows never to marry. Gods shower blessings and Devrata is renamed as Bhishma.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":4,"episode_type":"standard","id":484659,"name":"Bhisma Pratigya & Iccha Mrityu Vardaan","overview":"Bhishma (Devarata) defends his sacrifice and carries out his duties to look after all the affairs of the State. King Shantanu dies in grief and guilt towards Bhishma.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":5,"episode_type":"standard","id":484682,"name":"Amba, Ambika and Ambalika","overview":"Shantanu's son Vichitraviya ascends the throne. Bhishma arranges the marriage of Ambika and Ambalika, the daughters of a neighboring king, to King Vichitravirya. However, Vichitraviya dies young and without any offspring.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":6,"episode_type":"standard","id":484684,"name":"Royal Lineage","overview":"Threatened with extinction, Queen mother Satyavati, calls on Ambalika and Ambika to marry Vyasa. Ambalika gives birth the Dhritarastra who is born blind. Ambika gives birth to Pandu who is born anemic and weak. Bhishma is forced to look after this generation too.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":7,"episode_type":"standard","id":484683,"name":"Gandhari and Kunti","overview":"Dhritarastra and Pandu are married to Gandhari and Kunti. As Dhritrashtra was blind, Gandhari binds up her eyes with a piece of silk, refusing to see the world. Kunti was the daughter of the King of Yadavas and thus the sister of Vasudeva, father of Lord Krishna.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":8,"episode_type":"standard","id":484685,"name":"Kunti, Madri and The Retreat","overview":"Pandu establishes the supremacy of the Kuru House. During his campaigns he takes another wife, Madri. After the campaigns, Pandu goes to the forest for relaxation with his two queens Kunti and Madri.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":9,"episode_type":"standard","id":484686,"name":"Murder and Penance","overview":"While hunting, Pandu accidentally kills a Sage. To do penance Pandu decides to spend his life in exile and entrusts his Kingdom to Dhritarastra. In time five children - Yudhishtra, Bheem, Arjun, Nakul and Sahadeva, are born to Kunti and Madri. Dhritarastra had a hundred sons from Gandhari, the eldest being Duryodhana.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":10,"episode_type":"standard","id":484687,"name":"(Krishna Katha) Kans and The Prophecy","overview":"In Mathura, King Kans dethrones his father and takes over the Kingdom. He arranges his sister Devki's marriage with his influential friend Vasudev. But when a Sage predicts that her eighth son will be responsible for Kans' death, he imprisons Devki and Vasudev.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":11,"episode_type":"standard","id":484688,"name":"(Krishna Katha) Six Infanticides and Birth of Balram and Krishna","overview":"Kans personally kills Devki's first six children born in the prison. Devki's seventh \"pregnancy\" is taken over by Vasudev's second wife who gives birth to Balram. And when the eighth child, Krishna is born, miraculously the prison doors open and Vasudev is able to smuggle out the child and leave him in Gokul with his friend Nand.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":12,"episode_type":"standard","id":484689,"name":"(Krishna Katha) Pootna Vadh and Move To Nandgaon","overview":"Unusual celebrations in Gokul make Kans auspicious that Devki's eighth child must be there. Pootna is sent there as a toy seller to kill all the children born in Gokul. When she tries to kill Krishna, she herself is killed. Meanwhile all the people of Gokul, including Krishna's foster parents, shift to Nandgaon.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":13,"episode_type":"standard","id":484690,"name":"(Krishna Katha) Divine Childhood","overview":"Childhood of Shri Krishna, the Supreme Being, and Narayan. While Yashoda happily reared Shri Krishna in Nandgaon his real mother Devki, and his father Vasudev spent days inside the prison in Mathura. Krishna regaled the entire Nandgaon with his divine sports.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":14,"episode_type":"standard","id":484691,"name":"(Krishna Katha) Kalia Vadh","overview":"Krishna's divine sports make him the darling of his friends. To everyone's amazement he killed Kalia the Serpent King who lived in the river Yamuna, while retrieving the ball of his friend Sridham from the bottom of the river.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":15,"episode_type":"standard","id":484692,"name":"(Krishna Katha) Adolescent Love and Defiance","overview":"Krishna grows up to an 11-year-old boy. Now he has given up stealing butter; instead he steals the hearts of the young \"Gopis\". Radha is one such \"Gopi\" who has lost her heart to him. Two songs illustrate this beautiful relationship. Also, Krishna encourages the habitants of Nandgaon to stop sending butter, as a levy, to Kans, the ruler of Mathura. Kans feels slighted that someone has defied him.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":16,"episode_type":"standard","id":484693,"name":"(Krishna Katha) Goverdhan, Maharass, and The Invitation","overview":"Kans tries to subdue Krishna. He commands two demons to destroy Nandgaon. However, Krishna and Balram, annihilate the evil demons. The episode also covers two major portions of divine sports - one, saving of Nandgaon by lifting the Goverdhan Mountain and the other, \"Maharass\" in which Shri Krishna creates the illusion among the dancing Gopis, each one of whom thinks that he is dancing with her and her alone. Meanwhile, Kans tricks Vasudev's friend Akrur into inviting to Mathura with the intention of killing him.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":17,"episode_type":"standard","id":484694,"name":"(Krishna Katha) Kans Vadh","overview":"Krishna departs from Nandgaon for Mathura. The residents of Mathura have heard of his divine sports and they pay obeisance to him as an \"Avatar\" (incarnation of God). Eventually Krishna faces his uncle, Kans. The cruel ruler had planned to slay Krishna but he meets his own death at the hands of Shri Krishna. Before killing him, Krishna reveals to him his 'Viraat Roop' (Deity Incarnate in its full form).","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":18,"episode_type":"standard","id":484695,"name":"Mathura's Freedom and Pandu's Release","overview":"Shri Krishna releases King Ugrasen and his parents Devki and Vasudev who had been imprisoned by Kans. People of Mathura rejoice and celebrate the coronation of King Ugrasen. Krishna goes to Sandeepani Gurukul for his education. In Nandgaon, Yashoda is upset learn that Shri Krishna had stayed back in Mathura and probably would never return. The Pandava children, Yudhishtra, Bheem, Arjun, Nakul and Sahadev grow up and receive their education in the Forrest. Pandu dies in the forest and Kunti returns to Hastinapur with her children.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":19,"episode_type":"standard","id":484697,"name":"Kauravas and Pandavas' Education","overview":"Vyas takes Satyavati, Ambika and Ambalika to Tapovan (forest). Before leaving, Satyavati tells Dhritarashtra to look after the Pandava children. The Kaurava and the Pandava children grow up together. They are educated under Kripacharya. Shakuni instigates Duryodhan against the Pandavas and rivalry develops between the Kauravas and Pandavas.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":20,"episode_type":"standard","id":484696,"name":"Duryodhan Poisons Bheem","overview":"Adirath is released from the duties as blind-King Dhritarashtra's assistant. Sanjay takes over from Adirath as Dhritarashtra's assistant. Rivalry between Duryodhan and Bheem develops. Duryodhan plots to poison Bheem. After poisoning Bheem he throws him out in River Ganga. Bheem survives the attempt to kill him and he is returned safely to Kunti and his brothers.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":21,"episode_type":"standard","id":484698,"name":"Sudama’s chivda and Dron arrrives to Hastinapur","overview":"Kunti forbids Bheem from saying anything about Duryodhan’s attempt to kill him. Vidur suspects something is behind Bheem’s silence. He goes to see Bheeshma to discuss his concerns. Bheeshma is worried about this development, but is helpless as he is bound by his vow to protect the throne of Hastinapur and he cannot take sides. Duryodhan and Shakuni continue to plot against Bheem. Dhritarashtra is concerned about the developments in Hastinapur but Gandhari is a sobering influence on him. Meanwhile, in Mathura at the Sandeepani Gurukul, Shri Krishna and Sudama become close friends. Also in this episode Dronacharya (Drona) is introduced as one of the teachers of the Kuru Princes","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":22,"episode_type":"standard","id":484699,"name":"Shastra Pooja, Drona insults Karna and Arjun’s Test","overview":"Dronacharya (Drona) trains the Kuru Princes in the art of archery and other military skills. Arjun receives praise by his teachers. Duryodhan is often advised to control his arrogance. Shakuni rebukes his sister Gandhari for not seeing through all the plots of the Pandavas","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":23,"episode_type":"standard","id":484700,"name":"Ekalavya, Karna’s Education, Arjun’s test of Bird’s eye","overview":"Dronacharya (Drona) trains the Kuru Princes in the art of “Gada Yudh” (Mace fighting). Bheem and Duryodhan specialize in it and exhibit their skills. Drona is especially delighted by Arjun’s prowess and he loves him even more than his own son, Ashwathama. Drona informs Bheeshma that the education of Kuru Princes is complete. They agree to hold a tournament to test the war skills of the Princes","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":24,"episode_type":"standard","id":484701,"name":"Karna challenges Arjun and Duryodhan gives Anga desh to Karna","overview":"A special stadium that was built to exhibit the feats of the Kuru princes is full of spectators. Members of the Royal Household are invited. The princes perform amazing feats with their weapons. A mace fight between Duryodhan and Bheem follows and the fight becomes too intense. Arjun displays many feats of archery and every one is convinced that there is no one equal to him. Just then the people are startled by a voice coming from the gateway. It is Karna, Kunti’s son from the Sun God. Karna challenges Arjun for a single combat. Kripacharya declares that Arjun can only fight against other royalty. Karna bows his head in silence. While Duryodhan springs up and says, “we crown him the King of Anga, which is now without a master, they can fight after that”. Karna’s coronation takes place and Duryodhan wins a life long friend in Karna. Arjun and Karna are prevented from competing as the sun sets and the tournament that had begun so dramatically ends in an equally dramatic manner.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":25,"episode_type":"standard","id":484702,"name":"Drona’s guru dakshina to capture Dhrupad","overview":"he education of the Kuru princes is over. Dhrona continues to advise the Kaurava and the Pandava Princes. The Pandavas do well and this makes Dhritarashtra unhappy. Shri Krishna and Balram finish their education at Sandeepani Gurukul and plan to return to Mathura. Parsuram arrives at the Gurukul and gives Shri Krishna his Sudarshan Chakra. He asks Shri Krishna to lay the foundation of a New Yuga (New Era)….","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":26,"episode_type":"standard","id":484703,"name":"Krishna defeats Jarasandh and orders building Dwarika","overview":"After finishing his education at Sandeepani Gurukul Shri Krishna returns to Mathura. Krishna advises Ugrasen, the king of Mathura, to shift his capital from Mathura to Dwarika. The Heir Apparent to the throne of Hastinapur is to be chosen and Duryodhan is staking his claim while Drona, Vidur and the people of Hastinapur favour Yudhisthir. Bheeshma remains silent as he is bound by his vow to serve the throne which is with Dhritarashtra","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":27,"episode_type":"standard","id":484704,"name":"Yudhishthir is crowned as prince.","overview":"The court meets to name the Heir Apparent to the throne of Hastinapur. Dhritarashtra is compelled to appoint Yudhishthir because of his superior intellect. Jarasandh, the King of Magadha, arrives in Vidarbha to meet King Bheeshmak. Jarasandh asks Bheeshmak to invite Shishupal, the Chedi King, to marry his daughter Rukmani and make Shishupal his ally. Rukmani however has lost her heart to Shri Krishna so she writes him a letter to take her away","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":28,"episode_type":"standard","id":484705,"name":"Krishna kidnaps Rukmini","overview":"Shri Krishna has received a letter from Rukmani asking him to take her away from Vidarbha before she is married to Shishupal. Krishna decides to go to Vidarbha and defeats the forces of Bheeshmal and Shishupal and takes Rukmani away. In Hastinapur, Dhirtarashtra is worried about his throne. Yudhisthir has been made Heir Apparent (Yuvraj) and due to his popularity the people want him to become their King as soon as possible. Meanwhile, Duryodhan and Shakuni plot against Yudhisthir. They would like him to die before he becomes a King. Shakuni devises a plan to send Yudhisthir and his brothers to Varnavat where they would be burnt alive in a house of wax","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":29,"episode_type":"standard","id":484706,"name":"Lakshagraha is built in Varnavar by Purochan","overview":"Shri Krishna has received a letter from Rukmani asking him to take her away from Vidarbha before she is married to Shishupal. Krishna decides to go to Vidarbha and defeats the forces of Bheeshmal and Shishupal and takes Rukmani away. In Hastinapur, Dhirtarashtra is worried about his throne. Yudhisthir has been made Heir Apparent (Yuvraj) and due to his popularity the people want him to become their King as soon as possible. Meanwhile, Duryodhan and Shakuni plot against Yudhisthir. They would like him to die before he becomes a King. Shakuni devises a plan to send Yudhisthir and his brothers to Varnavat where they would be burnt alive in a house of wax","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":30,"episode_type":"standard","id":484707,"name":"Tunneling in Varnavat begins","overview":"Kunti takes Yudhishthir to Gandhari to seek her blessings before leaving for Varnavat. Gandhari is extremely happy to learn that Yudhishthir will stay in the beautiful palace built by her son Duryodhan. She is unaware that the palace is meant to kill Yudhishthir. The Pandava brothers are suspicious of Duryodhan’s eagerness to send Yudhishthir to Varnavat; so they accompany him to Varnavat. Kunti also decides to go with them. Vidur learns that Duryodhan’s spies had been collecting wax, oil and other flammable materials in the recent past. Vidur warns Yudhishthir in words that are meaningful to him only. Yudhishthir understands Duryodhan’s hideous plan and the means to escape","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":31,"episode_type":"standard","id":484709,"name":"Escape from Lakshagraha","overview":"Only three days are left for the house of wax to go up in flames and for kunti and her sons to burn to death. Vidur informs the Pandavas of the evil plan and sends them a miner who helps them dig a tunnel to escape. The charred corpses of a woman and her five sons mistakenly give credence to the news that the Pandavas were burnt alive. The Kauravas shed false tears for the “dead” Pandavas.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":32,"episode_type":"standard","id":484708,"name":"Hidimb vadh and Bhims marriage","overview":"After escaping from the tragedy, the Pandavas arrive in a forest and take rest.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":33,"episode_type":"standard","id":484711,"name":"Bakasur's vadh","overview":"The Pandavas stay in the city of Ekchakra in the guise of Brahmins. Kunti and Bheem learn of a cruel and terribly strong rakshasa named Bakasur who was harassing the people. Bheem sets out to eliminate this rakshasa. A great fight ensues and Bheem kills him. Not wanting to be recognized by the citizens of Ekchakra, the Pandavas leave the Brahmin’s house unnoticed and proceed on their journey, waiting for better days to come.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":34,"episode_type":"standard","id":484670,"name":"Dristadyumna & Draupadi Birth and Draupadi Swayamvar","overview":"The Pandavas journey through the forest and learn about Draupadi the daughter of King Drupad. At Droupadi's royal wedding ceremony many warrior princes were invited to attend. The candidate for the hand of the princess was required to string a mighty steel bow and shoot a steel arrow. Many noted princes rise and try in vain to string the bow. Then a youth arises from among the group of Brahmins and advances towards the bow. It is Arjun in the guise of a Brahmin. Om Shri Krishna recognizes him. Arjun easily lifts the bow and strings it.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":35,"episode_type":"standard","id":484672,"name":"Arjun wins Draupadi","overview":"Without pause or hesitation Arjun shoots his arrow into the target. He wins Draupadi's hand in marriage. The princes are loud with anger. \"How can a Brahmin marry a princess?\" they demand. A fight seems imminent. Shri Krishna seeks to appease the princes and Arjun and Bheem protect Draupadi. At long lost they take Draupadi to their temporary abode. Kunti unknowingly asks the five Pandava brothers to share their bride prize. Also, Shri Krishna meets his aunt Kunti and his cousins. Meanwhile Dhrishtadyumna, who had followed them, reports back and reveals the true identities of Pandava brothers.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":36,"episode_type":"standard","id":484710,"name":"Pandav leave from Panchal to Hastinapur","overview":"Duryodhan and Shakuni are furious when they learn that the Pandava brothers are alive and that King Dhritrashtra has sent Vidur to call them back to Hastinapur. Karna, as usual, is ready to fight them, but Shakuni realizes that with King Drupad and Krishna on the side of the Pandavas it would be difficult to defeat them. Dhritrashtra consoles Duryodhan and assures him that his rights as heir apparent to the throne of Hastinapur will be fully protected. In Kampilya, King Drupad and Shri Krishna advise Yudhishthir to fight for his right to the throne of Hastinapur. Just then Vidur arrives and tells the Pandava brothers that they have been invited back to Hastinapur along with their bride.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":37,"episode_type":"standard","id":484712,"name":"Pandav arrive at Hastinapur and the kingdom is divided","overview":"The Pandavas and Draupadi return to Hastinapur. Dhritrashtra conceals his disappointment and orders everyone to welcome them. Determined to establish peace between the Kauravas and the Pandavas, Bheeshma suggests giving half the kingdom to Yudhishthir. Dhritrashtra agrees to his suggestion. Krishna and Balram, also give their consent and it is decided that Yudhishthir’s coronation as King of Khandavprastha be held in Hastinapur.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":38,"episode_type":"standard","id":484713,"name":"Pandav get Khandavprastha","overview":"The decision to partition the Kingdom of Hastinapur between the Kauravas and the Pandavas is not liked by the Pandavas, but Krishna consoles them and tells them that Khandavprastha is their Karmabhoomi (field of action) Gandhari feels that a partition of a country can never be a solution to the rivalry. Bheeshma feels that there is no other option.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":39,"episode_type":"standard","id":484714,"name":"Coronation of Yudhirsthir, Khandavprastha becomes Indraprastha","overview":"Yudhishthir is coronated with great celebration. Dhritarashtra bids Yudhishthir farewell with these words, \"My brother Pandu made this Kingom prosperous. May you prove a worthy heir to his renown! May you conquer the entire world! May you perform the Rajsuya Yagna and may you live long and rule as a just King as your forfathers did before you!\" Ydhishthir knew that the land he was to rule was a barren wasteland, but he agreed to accept this injustice because he wanted peace. The Pandavas reach Khandavprastha, and with the help of Krishna and Balram, they renovate the ruined city. They plough the land and rename it Indraprastha.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":40,"episode_type":"standard","id":484715,"name":"Arjun runs away with Subhadra","overview":"The Pandavas were happy in Indraprastha. To avoid rivalry amongst themselves, they had come to a decision to have Draupati divide her time equally between the five brothers. When she was alone with one of them and if any other brother should intrude on their privacy, he must go on a pilgrimage to do penance. Once while helping a Brahim, Arjun had to violate the rule and had to go on a pilgrimage. Arjun visited Naglok and Manlur, and there he married Ullipi and Chitrangandha. Duryodhan asks Balram for his sister Subhadra’s hand in marriage and Balram promises to plead his case with his parents. Meanwhile, Arjun reaches Dwarika and he feel in love with Subhadra. And, Subhadra reciprocates his love. Before any decision can be made, Krishna helps Arjun to elope with Subhadra. Balram is furious and wants to send his army to capture Arjun, but Krishna convinces him that Subhadra had gone with Arjun on her own accord.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":41,"episode_type":"standard","id":484716,"name":"Arjun gets Devdatta Conch and Gandiv and Bhim gets his Gada","overview":"Arjun and Subhadra arrive at Dwarika and are formally married. Arjun later returns to Indraprastha with Subhadra. Draupadi welcomes Subhadra. Yudhishthir seeks Sri Krishna’s advice on performing the Rajsuya Yagna. Krishna approves but explains that Jarasandh, who has imprisoned 86 Kings, would be a constant challenge to Yudhishthir’s Royal Supremacy. Arjun, Bheem, and Sri Krishna eventually go to Magadh and challenge Jarasandh for a combat. Jarasandh chooses to fight with Bheem.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":42,"episode_type":"standard","id":484717,"name":"Jarasandh Vadh, Rajsuya Yagnya begins, Shishupal's Story","overview":"Bheem and Jarasandh are so equally matched in strength that they fight for nearly fourteen days without rest. When Jarasandh finally shows signs of exhaustion, Krishna prompts Bheem to bring an end to him. After Jarasandh had been destroyed, Jarasandh’s son was crowned King of Magadh.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":43,"episode_type":"standard","id":484718,"name":"Rajsuya Yagya, Shishupal Vadh","overview":"Yudhishthir decides to perform the Rajsuya Yagna. The first honor is rendered to Sri Krishna. Shishupal, the King of Chedi, ask, “ When there are so many Kings gathered in this assembly, why should the first honor be paid to Krishna – a cowherd boy and the son of a servant of Ugrasena?” Krishna warns Shishupal but Shishupal does not pay any heed so Sri Krishna kills him. The Rajsuya Yagna is celebrated and Yudhishthir is recognized as an Emperor.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":44,"episode_type":"standard","id":484674,"name":"Vyas predicts war, Draupadi laughs at Duryodhan","overview":"Duryodhan is unhappy about the prosperity of the Pandavs, Shakuni consoles him and later loses in a game of dice to Yudishthir. Duryodhan walks around Yudhishthir's 'Maya Mahal\" and falls into one of the pools. Draupadi calls him the \"blind son of a blind father.\" Duryodhan, Kama and Shakuni plan to avenge Draupadi for her taunting remarks. Shakuni suggests that Yudhishthir be invited to Hastinapur for a game of dice.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":45,"episode_type":"standard","id":484673,"name":"Pandavas go to Hastinapur to Gamble","overview":"Dhritarashtra orders Vidur to go to Indraprastha and to invite Yudhishthir to Hastinapur to play dice with Duryodhan. The Pandavs arrive in Hastinapur and pay their respects to the King. Dhritarashtra announces that the game will be played in the special assmbly hall.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":46,"episode_type":"standard","id":484676,"name":"Yudhirshthir loses everything","overview":"Duryodhan suggests that Shakuni cast the dice for him. Yudhishthir loses his entire Kingdom, his brothers, himself and Draupadi. Duryodhan insists that Draupadi be fetched to the assembly hall and orders Prathkami to bring her. Draupadi replies angrily, \"Ask him who played the game of dice with Duryodhan, whether he first lost himself or his wife? Bring me his answer and then you can take me away!\"","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":47,"episode_type":"standard","id":484671,"name":"Vastraharan","overview":"Enraged, Duryodhan asks his brother Dushasan to bring Draupadi to the assembly hall. Dushasan drags Draupadi to the hall and tries to disrobe her but a miracle occurs. Bheem swears to avenge the wrong doing, while Draupadi rises to curse the Kauravs. Gandhari pleads with Draupadi to stop.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":48,"episode_type":"standard","id":484675,"name":"Pandav Get Back Everything","overview":"Gandhari warns Dhritarashtra that the attempt to disrobe Draupadi would cause the destruction of his lineage. Dhritarashtra gives everything back to the Pandavs. Arjun swears that the Pandavs want the dead bodies of Duryodhan, Dushasan and Shakuni to avenge the injury. Bheeshma says, \"Don't forget Yudhishthir's role. Isn't he responsible for what has happened as well?\" and adds, \"Go back to Indraprastha and ponder over the incident with a cool head.\"","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":49,"episode_type":"standard","id":484669,"name":"Rematch of Dyut","overview":"Duryodhan threatens to wage war against the Pandavs. When Dhritrashtra forbids him from war, Duryodhan secures Dhritrashtra's approval to entice Yudhishthir to another game of dice. Yudhishthir accepts the challenge but is once again defeated. The Pandavs are to spend the next 12 years in exile and the 13th year incognito.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":50,"episode_type":"standard","id":484719,"name":"Vanvas Begins","overview":"The departure of the Pandavas upset Bheeshama, Vidur, Drona and the other elders of the Royal House of Kurus. Vidur advises Dhritarashtra to summon them back. Dhritarashtra rebukes Vidur, so Vidur leaves. After spending thirteen days in the forest, Bheem, Arjun, Nakul and Sahadev are ready to wage a war against Hastinapur. Yudhishthir refuses to wage war and decides to spend the full thirteen years in exile as his punishment for being reckless in gambling","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":51,"episode_type":"standard","id":484720,"name":"Gandharvas Catch Duryodhan","overview":"Rishi Vyas rebukes Dhritarashtra for exiling the Pandavas. He predicts the extinction of the Kauravs after 14 years due to Duryodhan’s misdeeds. Duryodhan and his men leave for Dwaitavan to witness the distress of the Pandavas. Duryodhan tries to flirt with a Gandharv girl and is captured by the enraged Gandharvas. Duryodhan’s bodyguard approaches the Pandavas for help and Bheem and Arjun unwillingly rescue their cousin.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":52,"episode_type":"standard","id":484721,"name":"Arjun worships Indra and Shiva for Divyastra and gets Pashupatastra","overview":"After hearing about the Pandavas exile, Krishna goes to visit them. He advises the Pandavas to prepare for war and tells Arjun unwillingly to do penance to obtain divine weapons. Arjun does penance and eventually pleases Lord Shiva. Lord Shiva bestows him with the divine Pasupata weapon and advises him to obtain other weapons in Indralok. Rishi Durvasa visits Hastinapur. In an attempt to humiliate the Pandavas, Duryodhan requests that the sage visit that Pandavas as well. Rishi Durvasa promises to do so.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":53,"episode_type":"standard","id":484722,"name":"Krishna’s story of one grain of rice","overview":"Rishi Durvasa and his followers arrive in the forest to visit the Pandavas. He requests food for himself and his followers and Draupadi is worried for her cooking vessel is empty. Draupadi prays to Lord Krishna and he asks her for something to eat. Draupadi shows him her empty vessel but Krishna, the Soul of the Universe, sees one grain of rice in the vessel, and eats it with pleasure. Durvasa and his followers immediately feel that their hunger has been satisfied. In Indralok, Lord Indra advises Arjun to learn to dance and music from Chitrasen to help him during his 13th year when incognito. Arjun continues to obtain divine weapons and Apsara Urvashi falls in love with him. When Arjun does not reciprocate her love, Apsara Urvashi curses him with impotence.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":54,"episode_type":"standard","id":484723,"name":"Arjun gets curse of impotency from Urvashi","overview":"In Indralok, Lord Indra limits Urvashi’s curse on Arjun to one year during which he becomes an eunuch. In Dwaraka, Sri Krishna trains his nephew Abhimanyu in the martial arts. In Hastinapur, Bheeshma, Drona and Vidur worry about the future of their Kingdom, while Duryodhan’s stepbrother, Yuyutsu, foresees the destruction of the Kurus. Arjun returns from Indralok armed with divine weapons. He accompanies Bheem while they rescue Draupadi from Jayadrath, Duryodhan’s brother-in-law.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":55,"episode_type":"standard","id":484725,"name":"Story of poisoned water and Yaksha","overview":"Jayadrath, Duryodhan’s brother-in-law, does penance for kidnapping Draupadi and is rewarded by Lord Shiva. In the forest, the Pandavas plan their 13th year of exile to live incognito and to work in another Kingdom. Nakul tries to fetch water form the lake but is told not to use the water by an invisible voice. He ignores the warning, drinks the water and falls down dead. His brothers meet the same fate except for Yudhishtir who realizes the voice belongs to Yaksha. The Yaksha asks him questions and Yudhishtir answers them correctly. The Yaksha reveals himself as Lord Yama and grants back the lives of all the dead brothers.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":56,"episode_type":"standard","id":484724,"name":"Agyatvas in Matsya desh","overview":"The Pandavas live incognito and serve King Virat. Yudhishthir becomes a courtier named Kanak. Bheem becomes a cook. Nakul and Sahadev look after cattle and horses. Arjun becomes a eunuch named Brihannala and Draupadi becomes Sairandhir, the handmaiden to the Queen Sudeshna of Virat.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":57,"episode_type":"standard","id":484726,"name":"Karna’s curse, Sairandhri rejects Keechak","overview":"Karna has assumed the guise of a Brahmin and has become a disciple of Parshuram. Parshuram observes Karna’s resistance to pain and realizes that he is a Kshatriya. In anger, he curses Karna. In Virat, Queen Sudeshna’s brother Keechak professes his love for Draupadi.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":58,"episode_type":"standard","id":484727,"name":"Keechak Vadh","overview":"Keechak is mad with lust for Draupadi. Draupadi runs to the Virat court, where Keechak angrily kicks her in the presence of Yudhishtir and Bheem. Draupadi reports the matter to Queen Sudeshna and asks Bheem for protection and revenge. Bheem kills Keechak.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":59,"episode_type":"standard","id":484728,"name":"Kaurav attack Matsya desh","overview":"The news of Keechak’s death reaches Duryodhan. He suspects that Bheem is responsible and decides to invade Virat. King Susarma of Trigarta also invades Virat. He captures Virat, but Bheem attacks and Virat emerges victorious. Duryodhan then attacks from another front. Prince Uttar tries to retreat after seeing the Kaurav army but Brihannala (Arjun) stops him. Brihannala reveals his weapons and his identity, then blows his conch.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":60,"episode_type":"standard","id":484729,"name":"Viraat yudh and clothes for Uttara's dolls","overview":"Duryodhan and Karna advance into battle. Arjun attacks the Kaurav army and the Kaurav warriors fall unconscious due to his magical weapons. News arrives from the battlefield and King Virat boasts about the glory of his son Uttar. Kanak (Yudhishthir) praises Brihannala and the King flings his dice at Yudhishthir’s face. Prince Uttar arrives and is distressed after seeing Yudhishthir’s bleeding face. King Virat eventually learns about the true identity of the Pandavas.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":61,"episode_type":"standard","id":484730,"name":"Abhimanyu’s marriage","overview":"After the wedding of Abhimanyu and Uttara, Krishna, the Pandavas, Virat and others meet in Virat’s assembly. They decide to send an emissary to Hastinapur to seek the restoration of Indraprastha. The emissary arrives in Hastinapur. Bheeshma and Vidur favour a peaceful settlement but Duryodhan disagrees. Duryodhan insists that the Pandavas spend 12 more years in exile.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":62,"episode_type":"standard","id":484731,"name":"Dhritarashtra does not agree and sends Sanjay","overview":"Vidur advises Dhritrashtra to return Indraprastha to the Pandavas. Gandhari also ask her husband to act justly, but Dhritrashtra refuses to accept their advice. He sends his charioteer Sanjay with a message to Yudhishthir, telling the Pandavas that they should spend 12 more years in exile, since Duryodhan had exposed them during their incognito life. The Pandavas and their allies are upset after hearing the message. They send Sanjay back to Hastinapur with the message that they are ready for peace as well as war.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":63,"episode_type":"standard","id":484733,"name":"Krishna or Narayani Sena","overview":"In Hastinapur everyone is nervous when Sanjay returns from the meeting with Yudhishthir and his allies. Sanjay says, “Duryodhan should know that Arjun said, ‘If Indraprastha is not given back to us, we will uproot the Kauravas.” Duryodhan remains adamant about going for war. Shakuni advises Duryodhan to seek Krishna’s help. Arjun also wishes to seek Krishna’s help and visits Krishna at the same time as Duryodhan. Krishna tells them, he is obliged to assist both of them.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":64,"episode_type":"standard","id":484732,"name":"Krishna goes to Hastinapur as shanti doot","overview":"The war between the Kauravas and the Pandavas looks inevitable, but Krishna makes a last attempt for peace. Krishna arrives in Hastinapur and is flooded with valuable presents. He pays his respects to Dhritrashtra and says, “ Maharaj, in return I can only offer peace!” “We will talk after you have rested,” says Dhritrashtra. He tells Dushasan to take Krishna to the guestroom, but Krishna refuses the offer and tells Dhritrashtra that he will be staying with Vidur. Duryodhan is annoyed with Krishna for refusing their hospitality.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":65,"episode_type":"standard","id":484734,"name":"Krishna avtar and Indra takes Karna’s kawach kundala","overview":"Krishna goes to the court of Hastinapur and says, “ Peace is a necessity. In war, people from both sides die, though only one side wins.” He suggests that Indraprastha be given back to the Pandavaas, but Duryodhan insists that the Pandavas must return to the forest. Krishna then suggests that five villages be given to the five Pandava brothers. Duryodhan finds the suggestion unacceptable and threatens to seize Krishna. Krishna discloses his divinity and leaves the court.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":66,"episode_type":"standard","id":484735,"name":"Karna’s Identity is disclosed","overview":"Krishna’s peace mission has failed. Krishna goes to Kunti and tells her what has happened at the Court. He asks her if she has a message for her sons. “The time has come”, she says, “for which a Kshatriya woman brings forth sons”. Before leaving for Upaplavya, Krishna meets with Karna and tells him to be true to Dharma and not to support sinful Duryodhan. Karna says, “you’re right, my Lord. A righteous man should not side with a sinner; but I am in debt of Duryodhan and cannot let him down”.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":67,"episode_type":"standard","id":484736,"name":"Vidur resigns as a prime minister, Kunti meets Karna","overview":"Vidur submits his resignation to Dhritarashtra, he is depressed by the inevitable war. Kunti worries about the battle to be fought between her sons, Karna and the Pandava brothers. She visits Karna and tells him the truth about his birth. Karna tells her he already knows the truth, and he is happy to have his mother by his side. Kunti pleads with him to join the Pandavas, but he says, “ I must fight with Arjun, I cannot abandon my promise to Duryodhan. “ Krishna reaches Upaplavya and tells the Pandavas that his attempt to stop the war has failed. The Pandavas prepare for the war.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":68,"episode_type":"standard","id":484737,"name":"Sanjay gets divya drishti, Ulluk goes to Pandavs","overview":"Yudhishtir holds a meeting and Drishtadyum, Drawplate’s brother, is appointed Supreme Commander of the Pandora army. Drupad, Shikhandi, Bheem and the other prominent warriors take command of the various divisions. The stage is set for the Kurukshetra war. Vyas visits Dhritarashtra and offers to bestow divine eyesight unto him but Dhritarashtra is reluctant to see the destruction of his sons. Vyas grants divine eyesight to Sanjay, Dhritarashtra’s charioteer.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":69,"episode_type":"standard","id":484738,"name":"Shalya becomes Karna’s Sarathi","overview":"All the warriors expect Balram and Rukhmi (Rukmani’s brother) move towards the battelfield. Balram remains neutral and both parties deny Rukhmi’s help. Duryodhan tricks Salya into joining the Kaurava army. Salya encourage Duryodhan to war against the Pandavas. She wants to seek Krishna’s help in protecting her sons, but Dhritarashtra stops her.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":70,"episode_type":"standard","id":484739,"name":"Shikhandi’s Story","overview":"Shikhandi, who was Amba in the previous life, is anxious for the Kurukshetra war because he wants to fight with Bheeshma. Bheeshma had insulted Amba by refusing to marry her after he had abducted her. Amba had sworn to take revenge on Bheeshma, so she was reborn as Shikhandi, the elder brother of Draupadi. The opportunity for Amba’s revenge has come.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":71,"episode_type":"standard","id":484740,"name":"Arjun worships Durga, Rules of war layed","overview":"Krishna tells Arjun to seek Goddess Durga’s blessings for winning the war. Arjun prays to the Goddess. She tells him, “ Wherever there is righteousness there is Krishna, and wherever there is Krishna, there is victory” Krishna drives Arjun to the middle of the battlefield in his chariot. Arjun sees the men on the battlefield and tells Krishna, “ wining a kingdom after killing one’s own kin is too heavy a price to pay. I prefer to be a beggar if this is the price I have to pay for our throne”.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":72,"episode_type":"standard","id":484741,"name":"War begins and Arjun drops his weapons, Geeta Saar begins","overview":"Arjun refuses to fight and kill his relatives and friends. Krishna tell him that “Atama (Soul) cannot be killed” and advises Arjun to be strong. Krishna’s teachings to Arjun at the battlefield form the basis of the “BHAGAWAD – GITA” (the song of God).","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":73,"episode_type":"standard","id":484742,"name":"Geeta Saar Part 2","overview":"On the battlefield of Kurukshetra, Krishna continues to talk to Arjun about the importance of following Dharma (Duty). He tells Arjun to equate pain with pleasure and profit with loss. He emphasizes the importance of selfless action without the desire to seek a reward for it.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":74,"episode_type":"standard","id":484743,"name":"Geeta Saar Part 3 and Krishna Maha Avtaar","overview":"Krishna says to Arjun, “I am birthless and changeless. I am the Lord. I take birth through the power of my Maya”. Unable to satisfy Arjun’s hopeless conscience, Krishna grants divine eyesight to Arjun and stuns him with his “Viraat Roop” (divine manifestation). Arjun is consoled and enlightened. He understands that the pure seek the spirit while the impure are trapped in “Prakrit (Matter). He agrees to do his duty selflessly, lifts his “Gandeev” and prepares to fight the Kauravas.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":75,"episode_type":"standard","id":484744,"name":"Abhimanyu faces Bhishma","overview":"The battle is about to begin, but Yudhisthir removes his armour, puts down his weapons, and descends from his chariot. The Pandavas and the Kauravas forces look with amazement as he proceeds on foot towards the Kaurava camp. Duryodhan brags that Yudhisthir is visiting the Kaurava camp to seek the benediction of the elders before starting the battle. After been blessed by the elders, Yudhisthir goes to the middle of the battlefield and announces that anyone who wants to change sides must do so now. Duryodhan’s stepbrother Yuyutsu crosses over to the Pandava camp and the battle begins.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":76,"episode_type":"standard","id":484745,"name":"Arjun faces Bhishma","overview":"During the afternoon of the first day of battle, Abhimanyu attacks grandsire Bheeshma and brings down his chariot’s flag. The Kauravas warriors retaliate with a combined attack on the youthful warrior. Bheeshma’s chariot continues to create havoc and Duryodhan instructs all of his warriors to protect Bheeshma. The Pandava army fares poorly, Yudhisthir worries, but Shikhandi consoles him by saying, “Righteousness will win eventually and we are of righteousness. As the battle continues, Drona brings down Shrishadyummna’s flag and Salya slays Uttar, the Price of Virat.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":77,"episode_type":"standard","id":484746,"name":"Arjun is unstoppable","overview":"The Pandavas army fares poorly during the first day of the battle. Dhrishtadyumna, the commander-in-chief of the Pandavas, devises strategies to avoid a repetition of the first day. Bheeshma’s chariot, Duryodhan’s men protect the grandsire, but Arjun continues to fight. Bheeshma’s arrows hit Arjun and Shri Krishna. Arjun retaliates and injures Bheeshma. Satyaki kills Bheeshma’s charioteer and horses are left unbridled. The horses run wildly and take Bheeshma away from the battlefield. The Pandavas return to their camp in great cheer.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":78,"episode_type":"standard","id":484747,"name":"Bhisma tells Arjun how to take him out of the war","overview":"The Pandavas are faced with a huge problem, victory continues to elude them. They were blessed by Bheeshma to achieve victory but they could only achieve victory after they kill Bheeshma and Bheeshma could not be killed unless he willed himself to die. Yudhisthir and Arjun go to Bheeshma and inform him of their predicament. Bheemshma tells them that only a woman could bring his death for he would not raise his hand against a woman. The Pandavas decide to use Shikhandi in their fight against Bheeshma and the stage is set for the fall of the grandsire from the battlefield.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":79,"episode_type":"standard","id":484748,"name":"Bhishma lies on the Bed of Arrows, Karna meets Bhishma","overview":"On the tenth day of battle, Arjun positions Shikhandi in front of him and attacks Bheeshma. As Arjun’s arrows pierce his body, Bheeshma smiles. Bheeshma’s shield is cut into pieces by Arjun’s arrows and he falls onto the ground with Arjun’s arrows covering his body. Drona is made the new Commander-in-chief of the Kaurav army, and Karna becomes warrior in the war.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":80,"episode_type":"standard","id":484749,"name":"Dron tries to capture Yudhishthir but is unsuccesful","overview":"The Kaurav warriors sit in council and decide to have Drona capture Yudhisthir alive. Duryodhan says, “ I will end the war as soon as Yudhisthir is in our hands. Drona agrees to the plan after Duryodhan promises that Yudhisthir would not be sentenced to death after he is captured.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":81,"episode_type":"standard","id":484750,"name":"Chakravyuh planned by Dron","overview":"Drona decides to arrange his focuses in a “Chakra – Vyuha”, which is a battle arrangement that only Arjun can penetrate and emerge from. The Trigartha Chief Susarama is asked to assist the Kauravas in their plan to capture Yudhisthir by luring Arjun so far away from the battlefield that it will be impossible for him to return before sunset..","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":82,"episode_type":"standard","id":484751,"name":"Abhimanyu Vadh","overview":"Yudhisthir learns about Drona’s plan to arrange the Kaurav forces in the Chakra-Vyuha. Unfortunately, Yudhisthir cannot depend on Arjun for Susarama has lured him away from the battlefield, but Arjun’s son, Abhimanyu offers his assistance. Abhimanyu succeeds in penetrating the Chakra – Vyuha but he gets trapped inside it and is eventually killed.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":83,"episode_type":"standard","id":484752,"name":"Arjun vows to kill Jayadrath","overview":"Arjun kills Susarama the Trigatha Chief and returns to the Pandava camp. He learns about Abhimanyu’s death and discovers that Jayadhrath was the main cause of his son’s death. Arjun vows to kill Jayadhrath before sunset the next day.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":84,"episode_type":"standard","id":484753,"name":"Arjun breaks chakravyuh to get to Jayadrath","overview":"On the battlefield Arjun tells Krishna to take his chariot to Jayadhrath. “There is a wall of Kaurav army between you and Jayadhrath” says Krishna.” I have to break the wall to complete my oath”. Declares Arjun. Krishna is amused. He remarks that members of the Royal House of Bharat are very impulsive. On the slightest pretext they take an oath. Bheeshma bound himself with an oath, and now you have taken an oath”.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":85,"episode_type":"standard","id":484754,"name":"Jayadrath Vadh","overview":"Arjun vows to kill Jayadhrath before sunset to avenge the death of his son Abhimanyu. If he is unable to kill Jayadhrath before sunset, Arjun swears he will burn himself to death. Duryodhan has hidden Jayadhrath but with Krishna’s assistance, Arjun is able to discover his whereabouts and kill him.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":86,"episode_type":"standard","id":484755,"name":"Ghatotkach dies","overview":"Bheem and Hidimba’s mighty son, Ghatotkach, joins the Pandavas in the war. Duryodhan realizes that Ghatotkach must be destroyed and encourages Karna to use his “shakti” (divine weapon). Karna resists because he is saving the weapon to use it against Arjun, but Duryodhan persuades him. Karna destroys Ghatotkach with his “Shakti”.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":87,"episode_type":"standard","id":484756,"name":"Drona Dies","overview":"Drona spreads fear and destruction in the Pandava army. He seems invincible but Krishna tells Yudhisthir and Arjun that Drona can be defeated. “ If he were to hear that his son, Ashwathama is dead, he would loose interest in life and throw down his weapons, “says Krishna. Yudhisthir consults Bheem who kills a huge elephant that was also named Ashwathama. Bheem roars, “I have killed Ashwathama”. Drona hears his word and shouts back “ I will not take your word for it, let Yudhisthir say so “Yudhisthir repeats” Ashwathama is dead” and then he mutters to himself, “ Ashwathama, the elephant”. Upon hearing Yudhisthir, Drona lays down his weapons and is killed.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":88,"episode_type":"standard","id":484757,"name":"Dushyasan dies and Karna fights with Arjun","overview":"On the battlefield, Dushasan attacks Bheem with his arrows. Bheem remembers what Dushasan had done to Draupadi and anger blazes within him. Bheem jumps from his chariot and attacks Dushasan. Bheem fulfills the oath he had made thirteen years ago and kills Dushasan. Gandhari looses another one of her sons.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":89,"episode_type":"standard","id":484758,"name":"Karna Dies","overview":"As the sun rises in the sky the battle between Karna and Arjun begins. Karna sends a dazzling arrow, which splits fire towards Arjun. Krishna presses Arjun’s chariot five fingers deep in the mud at the last minute, so that the shaft misses Arjun’s head and only strikes his crown. Arjun burns with anger, fixes an arrow on his bow and kills Karna.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":90,"episode_type":"standard","id":484759,"name":"Yudhishthir Curses All Woman Kind and Duryodhan Becomes Iron Bodied","overview":"Kunti visits the battlefield in the middle of the night to grieve over the dead body of her son Karna. Yudhisthir finds her and learns that Karna was his brother. \"Had I known, I wouldn't have fought this war,\" says Yudhishthir. Arjun does also feel guilty about killing Karna but Krishna consoles him and convinces him that it was his \"Dharma\" (duty). The Pandavas plan to perform the last rites of Karna, but Duryodhan claims the body and lights Karna's pyre by himself.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":91,"episode_type":"standard","id":484677,"name":"Bhim duryodhan Gada Yudh","overview":"The battle between Bheem and Duryodhan begins. The wariors appear equal in strength and skill, but Krishna informs Bheem that Duryodhan could be defeated if he smashes Duryodhan's thights. Bheem leaps like a lioin and breaks Duryodhan's thighs with his mace and defeats him.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":92,"episode_type":"standard","id":484678,"name":"Duryodhan Dies, Ashwathama, Krip and Kritvarma is remaining, Parikshit's story","overview":"Duryodhan commands Ashwathama, the new commander-in-chief, to kill the Pandavas. Ashwathama, Kripacharya and Krit Verma arrive at the Pandava camp in the middle of the night as Dhristdyumna and Draupadi's five sons are sleeping. They kill all the sleeping warriors and set fir to the camp. Believing that they have killed the Pandavas, they return to Duryodhan and discover that he has died. They light Duryodhan's pyre, and go to save Vyas's Ashram. The Pandavas find Ashwathama with Sage Vyas and take their revenge.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":93,"episode_type":"standard","id":484760,"name":"Dhritarashtra Tries to Kill Bhim","overview":"Duryodhan commands Ashwathama, the new commander-in-chief, to kill the Pandavas. Ashwathama, Kripacharya and Krit Verma arrive at the Pandava camp in the middle of the night as Dhristdyumna and Draupadi's five sons are sleeping. They kill all the sleeping warriors and set fir to the camp. Believing that they have killed the Pandavas, they return to Duryodhan and discover that he has died. They light Duryodhan's pyre, and go to save Vyas's Ashram. The Pandavas find Ashwathama with Sage Vyas and take their revenge.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":94,"episode_type":"finale","id":484679,"name":"End","overview":"After the mourning period is over, Krishna leads Yudhishthir to the throne. Yudhishthir crowns Bheem the Yuvraj and appoints Vidur as the Prime Minister of Hastinapur. Arjun is made the commander of the army, Nakul is made Arjun's assistant and Sahadev is made the personal protector of the King. After the affairs of the state are in order, Krishna takes the Pandava brothers to Bheeshma. Bheeshma gives them a discourse on Dharma and his soul leaves for the Heavens.","production_code":"","runtime":45,"season_number":1,"show_id":12605,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":23499,"poster_path":"/wQLCIUAVqnWDYaIzRxI1CuDolJo.jpg","season_number":1,"vote_average":8.5}}}