{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[22,30],"first_air_date":"2000-08-02","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.actualreality.tv/production.html?production=americanhigh","id":12645,"in_production":false,"languages":["en"],"last_air_date":"2000-08-09","last_episode_to_air":{"id":486026,"name":"Pressure High","overview":"Allie tries to readjust to school life after ditching classes for several months in the aftermath of her parents' divorce. She struggles with her feelings about her father's new family, and quarrels with her mother over her plans to put off college for a year. Allie and her mother seek a fresh start as they move into a new apartment. Kiwi hopes to earn a college scholarship through his kicking ability. He becomes depressed after missing a field goal in an important game, and frets about his upcoming 18th birthday. Salima's parents blame her slipping grades on her relationship with Morgan.","vote_average":0,"vote_count":0,"air_date":"2000-08-09","episode_number":4,"episode_type":"standard","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null},"name":"American High","next_episode_to_air":null,"networks":[{"id":19,"logo_path":"/1DSpHrWyOORkL9N2QHX7Adt31mQ.png","name":"FOX","origin_country":"US"}],"number_of_episodes":14,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"American High","overview":"American High is an American documentary television show about the lives of fourteen students at Highland Park High School, located in the city of Highland Park, Illinois. The series originally aired on Fox and was canceled after four episodes. It was later picked up by PBS and aired in its entirety. The series was created by R. J. Cutler, an award winning documentary filmmaker. The show received the 2001 Emmy Award for Outstanding Non-Fiction Program.\n\nThe theme song \"American High\", was written and performed by Bouncing Souls.\n\nAn earlier Fox Network documentary series from 1991, Yearbook also covered the lives of suburban Chicago high school students.","popularity":1.469,"poster_path":null,"production_companies":[],"production_countries":[],"seasons":[{"air_date":"2000-08-02","episode_count":14,"id":23564,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":2.5,"vote_count":1,"season_data":{"1":{"_id":"52582277760ee36aaa7c78e8","air_date":"2000-08-02","episodes":[{"air_date":"2000-08-02","episode_number":1,"episode_type":"standard","id":486023,"name":"You Only Live Once (a.k.a. F is for Fun)","overview":"Rebellious Morgan airs his views on the importance of living one's teen years to the fullest. He is later caught shooting off illegal fireworks. Sarah and Robby discuss their romance. She admits that she fears losing him when he leaves for college in a year. Kiwi turns to best friend Anna for relationship advice. Anna begins to miss Kiwi as he spends more time with his new girlfriend, Rachel. Kiwi kicks a game-winning field goal.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-08-02","episode_number":2,"episode_type":"standard","id":486024,"name":"Who Am I? (a.k.a. Ritalin Kid)","overview":"Morgan, who suffers from Attention Deficit Disorder, discusses his embarrassment over having to take behavioral drugs such as Ritalin. Morgan takes an after school job as a gymnastics coach for the disabled, where he draws on his background as a special education student to communicate with his pupils. Singer/songwriter Kaytee performs for her friends in the school hallway, but doesn't believe there is a place for her in the music industry. She records a demo with a friend's help and hopes to perform in coffeehouses. Robby recalls the moment when Brad came out to him. Brad describes the difficulties of being an openly gay student without gay friends. He rebels against his surroundings by putting together a provocative art project.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-08-09","episode_number":3,"episode_type":"standard","id":486025,"name":"Boogie Nights","overview":"Brad helps choreograph a routine for Highland Park's annual dance show. Morgan is asked to participate in Brad's act; and must console his girlfriend, Salima, when she fails to make the cut. Everyone becomes annoyed with Morgan because of his attitude. Although he initially has trouble learning the steps, he gets it together before opening night. The group pulls off a flawless performance and gets a standing ovation. Suzy worries about her weight, but tries to maintain her self-esteem. She takes part in a swing number, and hopes to make her father proud.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-08-09","episode_number":4,"episode_type":"standard","id":486026,"name":"Pressure High","overview":"Allie tries to readjust to school life after ditching classes for several months in the aftermath of her parents' divorce. She struggles with her feelings about her father's new family, and quarrels with her mother over her plans to put off college for a year. Allie and her mother seek a fresh start as they move into a new apartment. Kiwi hopes to earn a college scholarship through his kicking ability. He becomes depressed after missing a field goal in an important game, and frets about his upcoming 18th birthday. Salima's parents blame her slipping grades on her relationship with Morgan.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":5,"episode_type":"standard","id":486027,"name":"Saints and Sinners","overview":"Pablo and his friend Lisa escape from family pressures by hanging out at her late grandfather's house, which is vacant while undergoing renovations. Pablo goes against Lisa's wishes by holding a wild party at the house, and gets arrested. The incident creates a rift between them. Kaytee develops a massive crush on her friend Teddy. When he does not reciprocate her feelings, she uses her music to deal with the pain.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":6,"episode_type":"standard","id":486028,"name":"Bustin' Out","overview":"Allie struggles to deal with her parents as their divorce is finalized. Her mother worries about her plans to possibly wait a year before attending college. Anna applies to Brown University. Robby believes his parents are too protective, and longs for more freedom. Pablo considers joining the Marines for the financial benefits, even though he is a pacifist.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":7,"episode_type":"standard","id":486029,"name":"Winter Chill","overview":"Brad is accepted to New York University. His best friend Abby experiences great anxiety because she has yet to get into any colleges. She feels that he hasn't been sensitive to her situation, and they argue. Allie tries to bring up her grades and get her college applications in order. She relies on the support of her best friend Brett during her hard times. Morgan collects change from other students, telling them that he will use it to attend Harvard.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":8,"episode_type":"standard","id":486032,"name":"Winter Formalities","overview":"Morgan and Salima have problems in their relationship as their respective parents continue to worry about them. Her parents forbid her from seeing him for a time, but the families eventually decide to cut the couple some slack. Morgan and Salima attend the school's winter formal together. Suzy fears that she isn't normal because of her lack of dating experience. She reveals her dreams of becoming an opera singer, and opines that her dedication to singing will cut into her social life. Suzy goes to Peoria to try out for the All-State choir, and becomes annoyed when her roommates ignore her wishes and let boys hang around the room. Suzy is selected for the All-State Honor Choir as one of the best singers in her section. Tiffany asks her longtime crush to the winter formal. He accepts and begins spending a lot of time with her, but then becomes involved with another girl.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":9,"episode_type":"standard","id":486031,"name":"Homeward Bound","overview":"Allie's father plans to remarry. Allie and her brother decide to attend the wedding, leaving their mother feeling betrayed. Kaytee's parents struggle with the decision of whether they should stay together. Kaytee performs a concert at a local cafe, and finds the experience exhilarating. Morgan is furious when his mother gives away his hamsters without his consent. The family later deals with the loss of pet cat Earl, who has to be put to sleep after a long illness.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":10,"episode_type":"standard","id":486030,"name":"Spring Broken","overview":"Kaytee and Scott travel to China with the school band during spring break. The instructor criticizes the band for a lack of focus after a poor performance. Everyone comes together to play well at the final concert, despite the pressure of having to follow an orchestra of child prodigies. A bunch of seniors spend their vacation in the Bahamas without adult supervision. Abby's friend Shanna grows tired of the behavior of Abby and others. She spends time with Allie, who was once one of her closest friends. Robby plans to hook up with a lot of girls, but finds that he can only think about Sarah.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":11,"episode_type":"standard","id":486034,"name":"Promises, Prom Misses","overview":"Salima cannot attend the prom because her parents have barred her from seeing Morgan again. Morgan finally breaks up with her so that he will not cause her any further trouble. He takes an acquaintance to the dance. After Kiwi's girlfriend ends their relationship, he worries about finding a girl to take to the prom. He surprises Shanna by showing up in one of her classes with flowers and asking her to be his date. Anna does not believe she will be able to go to the prom, as she has only been asked by guys with ulterior motives. She accepts an invitation from a boy who is really proud of his tree collection, and is elected prom queen. Allie receives a love note from a guy who wants her to go to the prom with him.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":12,"episode_type":"standard","id":486033,"name":"War and Pieces","overview":"Allie lives with Brett for a while after her mother asks her to leave. They later come together and work out their differences. Pablo worries about his little sister's future as his mother considers filing for another divorce. He decides to officially join the Marines to get out of the house, but is rejected because of his drug use. Pablo and his mother get into a major argument. Morgan learns that he may not graduate.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":13,"episode_type":"standard","id":486035,"name":"Finale (1)","overview":"Seniors reflect on their high school years in the final days before graduation. Morgan's parents are thrilled when he passes all of his classes to ensure his graduation, and is accepted to college. Allie also learns that she has gained entry to college, while Kiwi accepts a scholarship to kick for Ball State University. Pablo moves out after the fight with his mother; he stays with his father and some friends at various times during his final two weeks of school. Robby and Sarah prepare to go their separate ways. She realizes that she has become a stronger person, and Robby opines that she will overcome her troubled childhood and live a happy life. Brad worries that the school will develop a negative attitude toward homosexuals after he and other gay upperclassmen leave. A teacher insists that Brad's actions will have a long-lasting impact on the school. Anna and her father have problems communicating. Kaytee goes to the studio to record a CD. Suzy looks forward to attending Northweste","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":14,"episode_type":"finale","id":486036,"name":"Finale (2)","overview":"Morgan and two friends get caught spraying graffiti on the school and are barred from the graduation ceremony. Morgan's family is devastated, but later takes him out to dinner to celebrate his graduation and takes pictures of him in his cap and gown. Pablo attends his sister's kindergarten graduation before preparing to receive his own diploma. The staff refuses to go along with his plan to wear a Greco-Roman wreath atop his head as he walks across the stage. Suzy looks toward the future with optimism as she graduates and turns 18. Allie's mother expresses her pride in her daughter's accomplishments at a dinner in her honor. Anna's father writes and records a song about her graduation.","production_code":"","runtime":null,"season_number":1,"show_id":12645,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":23564,"poster_path":null,"season_number":1,"vote_average":0}}}