{"adult":false,"backdrop_path":"/n87Z80UJAzOvZhR44O896npB8Vq.jpg","created_by":[{"id":13594,"credit_id":"5258268e760ee36aaa813e53","name":"Joseph Barbera","gender":2,"profile_path":"/lpjg99DpaK0RDbbe6mqk1Z7YIke.jpg"},{"id":13620,"credit_id":"5258268e760ee36aaa813e59","name":"William Hanna","gender":2,"profile_path":"/zf5WRsouQN0ozuJ4vFosXylPjaZ.jpg"}],"episode_run_time":[30],"first_air_date":"1973-09-08","genres":[{"id":16,"name":"Animation"},{"id":9648,"name":"Mystery"},{"id":18,"name":"Drama"}],"homepage":"","id":13255,"in_production":false,"languages":["en"],"last_air_date":"1973-12-01","last_episode_to_air":{"id":495602,"name":"The Haunted Castle","overview":"Wally's uncle dies and leaves Wally an ancient castle in his will. The Kids go to Scotland to claim it. Soon weired things begin to happen such as the drawbridge going up and down by itself, the ghost of a headless woman stalking Merilee and Steffy,  and a \"\"ghost hound\"\" lurking around them. Soon Butch realizes someone is trying to scare them out of the castle. Witht eh help of a medallion Wally has also inherited, the Kids find out why, hiddden in a secret passageway is a collction of gold and jewels! But who wants the Kids out of the castle? Who wants the gold?","vote_average":0,"vote_count":0,"air_date":"1973-12-01","episode_number":13,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null},"name":"Butch Cassidy","next_episode_to_air":null,"networks":[{"id":6,"logo_path":"/cm111bsDVlYaC1foL0itvEI4yLG.png","name":"NBC","origin_country":"US"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Butch Cassidy","overview":"Butch Cassidy was a Saturday morning cartoon produced by Hanna-Barbera Productions in 1973 for NBC. The series title is a play on the name of the unrelated 1969 film Butch Cassidy and the Sundance Kid. The character's music group is called the Sundance Kids.","popularity":1.272,"poster_path":"/55PFtq883y1A4ACy0WVCYxig6E3.jpg","production_companies":[{"id":1353,"logo_path":"/yXhCcOFK5Fy3ZBQwhBYx8Zu9ZIw.png","name":"Hanna-Barbera Productions","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"1973-09-08","episode_count":13,"id":24172,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"5258268d760ee36aaa813c75","air_date":"1973-09-08","episodes":[{"air_date":"1973-09-08","episode_number":1,"episode_type":"standard","id":495594,"name":"The Scientist","overview":"The Kids are called upon to help smuggle a scientist out of the country of Belgrovia, where he was captured. They arrive to find their hotel room bugged and no idea where to find him! The owners of the hotel get suspicious that they have arrived for a concert when they have outlawed rock music! They catch a supposed \"\"burgler\"\" that sneaks into the bedroom, to find he is their contact and tells them to contact his boss, J-8. When they reach her she tells them she will smuggle the scientist out of jail and sneak him into their concert, they must find a way to get him out.The hotel owners follow them, having discovered the truth.  Can they get him out in time?","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-09-15","episode_number":2,"episode_type":"standard","id":495591,"name":"The Counterfeiters","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-09-22","episode_number":3,"episode_type":"standard","id":495592,"name":"One Of Our Ships Is Missing","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-09-29","episode_number":4,"episode_type":"standard","id":495595,"name":"Double Trouble","overview":"The Kids are called upon to play a a coronation of a Prince in a small Indian country. It is suspected that his enimies will try to kidnap him ad the Kids mission is to find out who and stop him. They discover the Prince is going to be replaced with an imposter who will assume the throne in his place. Can they stop him in time?","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-10-06","episode_number":5,"episode_type":"standard","id":495596,"name":"The Pearl Caper","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-10-13","episode_number":6,"episode_type":"standard","id":495590,"name":"The Gold Caper","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-10-20","episode_number":7,"episode_type":"standard","id":495597,"name":"Road Racers","overview":"The Kids are on a white-water rafting vacation when Mr. Socrates calls them with the ring. He needs them to fly out to Italy and play for the Opening Day of the Road Race, but of course that's just the cover. many valuable diamonds are being stolen right out of hotel rooms and it's the Kid's job to find out why.    Once they get to Italy, their arrival takes back seat to the arrival of Mario Angelino the famous Italian race car driver, who arrives exactly the same moment (and immidiatly catches Steffy's eye). They reach their hotel and are greeted by the owner,Marino, who offers to take their sutcases up to their rooms while the Kids get lunch at a restaurant downtown.But once they're gone, his asssistant, the bellhop, goes through their luggage.    As the Kids get their pizza, their contact, B-12, arrives disguses as a waiter and gives them a list of the stolen diamonds. AS they take it back to the hotel room to read it, it blows away in Butch's hand. Marino finds it and recogninzes i","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-10-27","episode_number":8,"episode_type":"standard","id":495598,"name":"Hong Kong Story","overview":"The Kids are called from an airplace race to go to Hong Kong. An extremely valuable Jade statue is in danger of being stolen and their mission is to protect it at all costs. When they reach Hong Kong they make it to the museum where the statue is on display and notice its closely guarded. They also notice a middle-aged man following them all over, it turns out he's the henchmen of a merchant who is going to use the Kids to help him steal the statue. The Kids meet up with their contact, and help him deduce that one of the brand new yachts that have just come in has to contain the theif. Butch and Merilee go on board his yacht, while Evlis creates a distaction, and find their sheet music and two models if different ships.    That night, during the finale of their concert, which coincidentally contains fireworks, the theves take advantage of it and use explosives to steal the statue, knowing it can't be heared due to the fireworks! The Kids figure this out while hearing the theft on the n","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-11-03","episode_number":9,"episode_type":"standard","id":495599,"name":"Operation G-Minus","overview":"The Kids are called upon to travel to Germany on a new 'gig'. They are really called upon to stop two German scientists in posssesion of an anti-gravity device. The scientists demanded jewles from the U.S.A. in exchange for it. The Kids must find the scientists, destroy the device, and make sure they do not get the jewels!","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-11-10","episode_number":10,"episode_type":"standard","id":495600,"name":"Orient Express","overview":"The Kids are enjoying a deep sea diving vacation when they are called in to see Mr. Socrates. He tells them they are wanted on a mission, they must go to Paris on a 'gig', but they have to ride the Orient Express there and pick up a super secret formula, which enemy agents are trying to get their hands on. Once they leave the janitor arrives, but it turns out he's a fellow spy sent to hack into Mr. Socrates and get the information about who will get the formula. He radios the info to his fellow agents who are disguised as passengers on the train. The Kids finally get the formula, disgused as a menu and take it into their car on the train. As they're taking pictures of it, one of the passengers disguses himself as an old woman and drives Butch and Merilee from the car by telling them there's a stange man in his compartment, but it turns out HE'S the strange man after his wig blow off. Wally chases him while Steffy guards the formula, but another agent threatens her and she tells him she","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-11-17","episode_number":11,"episode_type":"standard","id":495601,"name":"The Parrot Caper","overview":"The Kids are enjoying a picnic when Mr. Socrates calls them on a special mission: they are to pick up a special parrot that used to belong to a deceased scientist and deliver it to Switzerland. The parrot has memorized half of a secret formula, his twin brother has the other half and the parrots muct be reunited in order to deliver the entire thing.    When they arrive in Switzerland an enemy scientist's assistants switch the parrot on Wally and give him a sickly looking coocoo bird. But without his brother the parrot canot give the scientist the formula, so he has his assistants follow the Kids and get him.    The Kids to go their contact and pick up the other parrot and hide them in their cabin, intending to switch it for the coocoo bird when the assistants come. When the assistants pick up the coocoo bird, the Kids chase him on skis. Wally falls behind due to his inability to ski, and Steffy and Merilee crash into each other. The assistants try to derail Butch with a carreening rock","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-11-24","episode_number":12,"episode_type":"standard","id":495593,"name":"The Super Sub","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-12-01","episode_number":13,"episode_type":"finale","id":495602,"name":"The Haunted Castle","overview":"Wally's uncle dies and leaves Wally an ancient castle in his will. The Kids go to Scotland to claim it. Soon weired things begin to happen such as the drawbridge going up and down by itself, the ghost of a headless woman stalking Merilee and Steffy,  and a \"\"ghost hound\"\" lurking around them. Soon Butch realizes someone is trying to scare them out of the castle. Witht eh help of a medallion Wally has also inherited, the Kids find out why, hiddden in a secret passageway is a collction of gold and jewels! But who wants the Kids out of the castle? Who wants the gold?","production_code":"","runtime":30,"season_number":1,"show_id":13255,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":24172,"poster_path":null,"season_number":1,"vote_average":0}}}