{"adult":false,"backdrop_path":"/osmolAEgt6KEqLt031IdWH1O2k4.jpg","created_by":[{"id":1244376,"credit_id":"57278113c3a368549e002dad","name":"Gordon Murray","profile_path":null}],"episode_run_time":[15],"first_air_date":"1969-10-06","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":13284,"in_production":false,"languages":["en"],"last_air_date":"1969-12-29","last_episode_to_air":{"id":496119,"name":"A Present For Lord Belborough","overview":"Mr Antonio is delivering ice cream to the Winkstead Hall tea room. He meets Mr Bilton the gardener, who says he has some wall flowers to give him. Mr Bilton is suffering from 'the rheumatics' so Mr Antonio helps out by doing a bit of lawn mowing. On his way out Mr Antonio meets Lord Belborough who tells him he would like to give Bilton a motor-barrow but can't afford it what with the cost of the recent reroofing...","vote_average":0,"vote_count":0,"air_date":"1969-12-29","episode_number":13,"episode_type":"finale","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/iRpCE6wQvvcgo9dmGu6XbleqMQS.jpg"},"name":"Chigley","next_episode_to_air":null,"networks":[{"id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","name":"BBC One","origin_country":"GB"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Chigley","overview":"Chigley is the third and final stop-motion children's television series in Gordon Murray's Trumptonshire sequence. Production details are identical to Camberwick Green.\n\nAs in Camberwick Green and Trumpton, the action centres around a small community, in this case the fictitious village or hamlet of Chigley, near Camberwick Green in Trumptonshire. Chigley is more of an industrial area, and according to Gordon Murray, the three communities are at the corners of an equilateral triangle. A digitally restored version of the series from the rediscovered original film masters emerged in 2012.","popularity":19.197,"poster_path":"/sOktUiFFGzgCajpO3XA3p9AiGrK.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"1969-10-06","episode_count":13,"id":24203,"name":"Season 1","overview":"","poster_path":"/9TjmaYEIiyzWtBkrKu6416KQRll.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":10,"vote_count":1,"season_data":{"1":{"_id":"525826c4760ee36aaa818314","air_date":"1969-10-06","episodes":[{"air_date":"1969-10-06","episode_number":1,"episode_type":"standard","id":496118,"name":"Lord Belborough's Secret","overview":"Dr. Mopp calls at the Chigley Pottery to buy a vase for his sister Millicent, and gets a demonstration of how a potter uses his wheel. Lord Belborough arrives in Bessie to collect a crate of pottery, and they go with him to Treddles wharf, where he picks up a mysterious crate. Dr. Mopp asks the Camberwick Green villagers if they know what is inside the crate. Mrs Honeyman suggests that it must be something to do with the six o'clock whistle at the biscuit factory, which proves to be correct. At 6.00 the workers leave the factory and Lord Belborough unveils to them a Dutch organ which plays the music for the six o'-clock dance.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/oWgfdPiB9KorKfmBNzk1sDmc4if.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-10-13","episode_number":2,"episode_type":"standard","id":496116,"name":"Bessie To The Rescue","overview":"Farmer Bell makes his regular delivery of produce to the Chigley biscuit factory, and gets a tour of the factory from Mr Cresswell. They notice that a box of biscuits meant for delivery has been overlooked. As Trumpton is very congested at this time of day it is too late to take it by road to Wintelbury station, in time for the 5.23 train to London. Farmer Bell comes to the rescue by taking the box to the pottery where it is picked up by Lord Belborough in Bessie and taken to Treddles Wharf. Here it is transferred to Chippy Minton's truck which he drives off to Wintelbury. Mr Swallow then points out that as the timetable has recently been changed, the train doesn't leave until 5.43, and so they would have made it by road anyway !","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/1fTfxhQBPlwZRn8W1dW00X7zqig.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-10-20","episode_number":3,"episode_type":"standard","id":496117,"name":"The Balloon","overview":"The Mayor of Trumpton visits Lord Belborough and asks him for fund-raising ideas for the Old People's Holiday Fund. When Lord Belborough has to go to the Pottery he gives Winnie a ride on Bessie. Her balloon gives him an idea.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/wbKi12M3EsaliqfXy27XtrmF7K6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-10-27","episode_number":4,"episode_type":"standard","id":496115,"name":"The Fountain","overview":"PC McGarry calls at the pottery to invite Mr Farthing to tea. Mr Farthing is sculpting in his garden but explains that there is not much demand for stone sculptures these days. PC McGarry then calls in at the Biscuit Factory where he tells Mr Cresswell that he has a clean and modern looking factory, but also points out that a fountain would look nice. Mr Cresswell asks Mr Farthing the Potter to make one. Lord Belborough picks up the block of stone from Treddles Wharf, Farmer Bell digs the foundations and Mr Clutterbuck builds the fountain's basin. Then at six o'clock one evening, when it is all finished, the Mayor of Trumpton unveils the fountain.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/4L7iHYVVW8WxNLA379kiLbiEEQ4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-11-03","episode_number":5,"episode_type":"standard","id":496121,"name":"The Garden Wall","overview":"Mr Crockett delivers a lawnmower to Winkstead Hall, having just rebuilt the engine, and \"sharpened her up\". Lord Belborough starts the mower, which was still in gear, and it runs off and demolishes the garden wall and door. Lord Belborough phones Mr Clutterbuck the builder and asks him if he can rebuild the wall before the weekend, but Mr Clutterbuck is still awaiting delivery of a load of bricks, which are stuck at Treddles Wharf. Lord Belborough and Brackett steam of to the wharf in Bessie and collect the bricks. Bricklayers Cyril and Horrace are then able to rebuild the wall, while Chippy Minton and Nibbs make a new door. Mr Crockett repairs the mower, \"using several completely new parts\" and everything is ready in time for the six o'clock dance.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/2nv4fSc0KB7Sev07LcQhKsFkEzh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-11-10","episode_number":6,"episode_type":"standard","id":496126,"name":"Binnie And Bessie","overview":"Roger Varley arrives at Winkstead Hall to help clean Bessie the steam engine and Binnie the pumping engine. Roger is cleaning Binnie when Brackett the butler comes in and says the water level in Winkstead Hall is very low. But the only way to pump the water is to burn the coal to get the pumping engine going, but there is no coal left. They ring up Mr Swallow at Treddles Wharf and ask for some coal. He tells them that they will have to pick it up. They set off in Bessie, pick up the coal at the wharf, and return to Winkstead Hall. With a new delivery of coal Binnie can pump again. The biscuit factory whistle blows and it is time for the six o'clock dance.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/yE5SJXTqFKNTBqGhLGP8kXHVuH2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-11-17","episode_number":7,"episode_type":"standard","id":496125,"name":"Lord Belborough's Lucky Day","overview":"Thomas Tripp is delivering milk to Winkstead Hall, and while talking to Brackett they discover that because Lord Belborough's birthday is in February then today is his lucky day. Later, Lord Belborough is telling Brackett about his antique vase, (and that he is looking for another to make a pair) when he accidentally drops it, smashing it into pieces. When the dustmen arrive they empty the Winkstead Hall bins and take away the vase fragments.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/xDmolLTWdEAHQdpWLv5VCO9syMM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-11-24","episode_number":8,"episode_type":"standard","id":496127,"name":"The Broken Bridge","overview":"Mr Carraway is delivering three boxes of plaice to the Chigley biscuit factory restaurant when PC McGarry turns up and tells them that the Chigley bridge is unsafe and closed to all traffic. This is bad news for Mr Cresswell as he has a delivery of biscuits to go out. Mr Carraway points out that the boys from Pippin Fort have a temporary bridge but it is kept at Treddles Wharf, which is on the other side of the river. A few phone calls later and Lord Belborough goes off in Bessie to collect it from the wharf and take it to the bridge. Unfortunately the soldier boys are still on the wrong side of the river, but with the help of Mr Dagenham and his helicopter they are picked up by rope, three at a time, and carried across the river to where they can assemble their temporary bridge. Mr Carraway has the dubious honour of being first to try out the bridge, and then they all go off to the six o'clock dance.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/htL9PGdex9nWYQGjtqzT8JO6tyk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-12-01","episode_number":9,"episode_type":"standard","id":496123,"name":"Clay For Mr Farthing","overview":"Mr Wantage and Fred finish their work in Trumpton and go off to the Chigley pottery to mend Harry Farthing's phone. There, they find that the trouble is due to clay in the receiver holder. Harry gives them a demonstration of how he makes a bowl. The PO engineers mention that a lot of clay was dug out when the new telephone exchange was built, and they give Harry a lift to the exchange in their van. They tell Harry he can have it all, but how can they transport it back to the pottery ?","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/3we1VXC2lvJdrn0fVdxwgKlvlcJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-12-08","episode_number":10,"episode_type":"standard","id":496124,"name":"Trouble With The Crane","overview":"At Treddle's Wharf, Mr Rumpling is supposed to unload a crate from his boat for Lord Belborough, and pick up a crate of scrap metal from Farmer Bell. While lifting a crate the crane fails and drops what they think is Lord Belborough's crate of valuable antique books into the canal. The solider boys are called and Private Armitage (the best swimmer) dives into the canal to rescue the crate. However due to a previous mix-up, the dropped crate is found to contain Farmer Bell's scrap metal, which obviously isn't damaged by having been dropped in the canal.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/ab10Ve9DFuFb6jRiBKmo3WSUhrC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-12-15","episode_number":11,"episode_type":"standard","id":496122,"name":"Apples Galore","overview":"When the Winkstead orchard has a bumper crop of apples, Windy Miller suggests they turn them into apple juice using his cider press. The fire brigade pick the apples and Jonathan Bell loads them onto Bessie with the aid of his forklift loader. Then Lord Belborough takes them to Windy's barn (just below the mill) and with the help of the biscuit factory workers they are pressed and barrelled in time to be taken to the six o'-clock dance.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/xEhI20VUIjGEnf9fgpOPsdAIhdg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-12-22","episode_number":12,"episode_type":"standard","id":496120,"name":"Willie Munn","overview":"Mr. Clamp takes some stock to the Chigley biscuit factory for the staff canteen. While there, he asks Mr Cresswell (the biscuit factory owner) how his nephew Willie Munn is doing. Mr Cresswell takes Mr Clamp to see Willie who works on the biscuit stamper.","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/8Dj3SJ1g81wL59aOGD86v4pN74c.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-12-29","episode_number":13,"episode_type":"finale","id":496119,"name":"A Present For Lord Belborough","overview":"Mr Antonio is delivering ice cream to the Winkstead Hall tea room. He meets Mr Bilton the gardener, who says he has some wall flowers to give him. Mr Bilton is suffering from 'the rheumatics' so Mr Antonio helps out by doing a bit of lawn mowing. On his way out Mr Antonio meets Lord Belborough who tells him he would like to give Bilton a motor-barrow but can't afford it what with the cost of the recent reroofing...","production_code":"","runtime":15,"season_number":1,"show_id":13284,"still_path":"/iRpCE6wQvvcgo9dmGu6XbleqMQS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":24203,"poster_path":"/9TjmaYEIiyzWtBkrKu6416KQRll.jpg","season_number":1,"vote_average":0}}}