{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[25],"first_air_date":"1955-07-16","genres":[{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"","id":13498,"in_production":false,"languages":["en"],"last_air_date":"1955-10-08","last_episode_to_air":{"id":499956,"name":"Captives of the Zero Hour","overview":"From Republic's press release: \"\"Commando Cody's rocketship is taken to Mercury by the Ruler. There the Ruler hopes to destroy Cody's dispeller ray, but is in for a surprise.\"\"","vote_average":0,"vote_count":0,"air_date":"1955-10-08","episode_number":12,"episode_type":"finale","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null},"name":"Commando Cody: Sky Marshal of the Universe","next_episode_to_air":null,"networks":[],"number_of_episodes":12,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Commando Cody: Sky Marshal of the Universe","overview":"Masked scientific government agent is pitted against a rogue army, led by a mystery man known only as \"The Ruler\",  which is attempting to conquer the solar system by first decimating earth's climate through various futuristic devices which Cody must meet with earth's own futuristic technology. \n\n[Intended to be a limited-run television series, Commando Cody: Sky Marshal Of The Universe was first released theatrically in 1953 as a twelve-chapter movie serial; it was not shown on television until 1955.\n\nThe Commando Cody character was first introduced in Republic's earlier movie serial Radar Men from the Moon; however, \"Sky Marshal\" is actually a prequel, with the first chapter dealing with Cody's origins and the acquisiton of his staff as seen in \"Radar Men\".]","popularity":2.875,"poster_path":"/6uwjur0fCPVdUZPLAROYAaWrg1m.jpg","production_companies":[{"id":1432,"logo_path":"/8AcaWEWQ8MFUBGlt9WxGGBAMpMG.png","name":"Republic Pictures","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"1955-07-16","episode_count":12,"id":24507,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5,"vote_count":1,"season_data":{"1":{"_id":"52582845760ee36aaa834f2f","air_date":"1955-07-16","episodes":[{"air_date":"1955-07-16","episode_number":1,"episode_type":"standard","id":499952,"name":"Enemies of the Universe","overview":"From Republic's press release: \"\"The Ruler, a diabolical scientist who wants to enslave the Solar System, learns of Commando Cody's design for a rocketship that can go anywhere in outer space. He is determined to sabotage Cody's work.\"\"  Commando Cody is a top secret scientist who wears a mask for security reasons. He recieves two new assistants, Joan Gilbert and Ted Richards, that help him develop an atomic powered rocketship. The Interplanetary commission has received a warning from a mad scientist known as Ruler. Cody is named the new sky marshal of the universe in order to combat Ruler's threat. Cody explains that reports of flying saucers are actually reports of Ruler's missles attempting to land on Earth. Cody develops an cosmic dust blanket that encricles the globe and that will cause any enemy craft to disintegrate before entering earth atmosphere. Ruler fears Cody's abilities and sends agents to sabotage Cody's rocket and learn the secret of the cosmic dust blanket. Cody drives","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-07-23","episode_number":2,"episode_type":"standard","id":499948,"name":"Atomic Peril","overview":"From Republic's press release: \"\"Lenotto is sent to the Earth by the Ruler to help Dr. Varney in destroying Commando Cody. First they try to gain Cody's confidence by introducing him to a new element. When given the opportunity they try to steal Commando Cody's rocketship and in the ensuing scuffle Lenotto is killed with his own gun.\"\"  Unable to penetrate the cosmic dust blanket with his warships, the Ruler sends an agent Lenato inside a small missle headed for earth. Lenato carries Thenustrium: a new element developed on Planet X. Lenato tells Dr. Varney that Thenustrium is similar to uranium, but is easier to control. Lenato and Dr. Varney poses as scientists who have discovered the new element. They are able to get into Commander Cody's lab. Cody examines the element and realizes that combining it with uranium will allow him to construct a rocket with more power and range. When Cody leaves, Lenato and Varney kidnap Joan and Ted. They steal Cody's rocket and fly away. Lenato and Varne","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-07-30","episode_number":3,"episode_type":"standard","id":499954,"name":"Cosmic Vengeance","overview":"From Republic's press release: \"\"A strange garbled message convinces Commando Cody that the Ruler is trying to contact his agents on Earth. Cody tries to find the Ruler before he can carry out his newest plot.\"\"  Commando Cody discovers that the Ruler is on the Planet Venus. Ross and Hardy learn that Commando Cody plans to fly to Venus and they sabotage his rocket ship. However, Cody manages to land the crippled ship on Venus and confronts the Ruler. The Ruler reveals his plans to conquer Earth and other habitable planets. He shows off his weapons of conquest. Cody manages to bury the \"\"Ruler of Outer Space\"\" in his operations cavern on Venus.","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-08-06","episode_number":4,"episode_type":"standard","id":499950,"name":"Nightmare Typhoon","overview":"From Republic's press release: \"\"A series of destructive floods and typhoons strike all parts of the Earth. Commando Cody suspects that this is part of the Ruler's latest plan to conquer the world.\"\"  Ted Richards is transferred and replaced by Dick Preston. The Ruler uses a rocket (R-6) containing a ‘radioactive\"\" gas which causes hurricanes, floods and typhoons. The Ruler threatens to completely destroy the Earth unless the Earth surrenders unconditionally.","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-08-13","episode_number":5,"episode_type":"standard","id":499957,"name":"War of the Space Giants","overview":"From Republic's press release: \"\"The Ruler has found an element on the planet Saturn that enables him to drop germ capsules through the Cosmic Dust Blanket onto the Earth.\"\"   The Ruler uses his M-7 rockets loaded with bombs which carry germ warfare agents. The Ruler issues and ultimatum: complete surrender or complete annihilation. Cody captures an unexploded M-7 and analysis indicates that the substance is \"\"saturium,\"\" available only one of Saturn's moons. Cody, Joan and Dick travel to the moon and encounter a \"\"magnetic drag ray.\"\" They manage to counteract the ray and destroy the mining facility on the surface.","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-08-20","episode_number":6,"episode_type":"standard","id":499951,"name":"Destroyers of the Sun","overview":"From Republic's press release: \"\"The Ruler uses a device which puts out the sun's light. Panic results all over the world as it is plunged into darkness. Commando Cody must go to the Earth's rescue.\"\"\n\nWhen the Ruler blots out the sun, Cody finds he is trapped on the Earth. A saboteur has added an element to the Station #8 dispenser for the Cosmic Dust Blanket. Cody's Disbursal Ray will not penetrate the Dust Blanket and allow his rocketship to leave the Earth. Cody discovers the saboteur and traces the energy source of the Ruler's device to Planet M-27. When he reaches the planet he can not destroy the \"\"Atomic Device\"\" blotting out the sun because he is stopped by an Invisible Block.\"\"","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-08-27","episode_number":7,"episode_type":"standard","id":499949,"name":"Robot Monster from Mars","overview":"From Republic's press release: \"\"The Ruler's robot agents capture Commando Cody's assistant and carry him off to the Ruler's secret outer space headquarters. Cody must rescue him.\"\"","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-09-03","episode_number":8,"episode_type":"standard","id":499947,"name":"The Hydrogen Hurricane","overview":"From Republic's press release: \"\"Hydrogen hurricanes threaten to destroy the Earth. Commando Cody suspects that they are being caused by the Ruler.\"\"","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-09-10","episode_number":9,"episode_type":"standard","id":499946,"name":"Solar Sky Raiders","overview":"From Republic's press release: \"\"The Ruler puts five suns in the sky. Unless Commando Cody can stop the suns from shining, their intense heat will destroy the Earth.\"\"","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-09-17","episode_number":10,"episode_type":"standard","id":499953,"name":"S.O.S. Ice Age","overview":"From Republic's press release: \"\"In a diabolical plot, the Ruler manages to couple the Earth and Saturn. This throws the Earth off its axis and causes quakes and catastrophic climatic changes.\"\"","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-09-24","episode_number":11,"episode_type":"standard","id":499955,"name":"Lost in Outer Space","overview":"From Republic's press release: \"\"In his efforts to add the Earth to his long list of slave planets, the Ruler tries to get Commando Cody and his crew out of the way. His plans include the capture of Cody's rocketship. The method, a trumped up story told by a Mercurian.\"\"","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1955-10-08","episode_number":12,"episode_type":"finale","id":499956,"name":"Captives of the Zero Hour","overview":"From Republic's press release: \"\"Commando Cody's rocketship is taken to Mercury by the Ruler. There the Ruler hopes to destroy Cody's dispeller ray, but is in for a surprise.\"\"","production_code":"","runtime":25,"season_number":1,"show_id":13498,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":24507,"poster_path":null,"season_number":1,"vote_average":0}}}