{"adult":false,"backdrop_path":"/94BJcmZDvPSNoJF04gau87Kl3AZ.jpg","created_by":[{"id":3288721,"credit_id":"617b468867825900443d7358","name":"Lee Jeong-woo","gender":0,"profile_path":null}],"episode_run_time":[60],"first_air_date":"2021-12-11","genres":[{"id":18,"name":"Drama"},{"id":10768,"name":"War & Politics"}],"homepage":"","id":135751,"in_production":false,"languages":["ko"],"last_air_date":"2022-05-01","last_episode_to_air":{"id":3266458,"name":"Episode 32","overview":"Lee Do shows aggression toward Bang Won to be free from his control. Despite his effort, Bang Won's power is still too great, and eventually fails to save his father-in-law, Shim On. However, Lee Do grows to become a successful king as time passes. With this in mind, Bang Won and Lady Min rest deeply in peace.","vote_average":0,"vote_count":0,"air_date":"2022-05-01","episode_number":32,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/rfu66lyJIy93EsT914No1c9nDvX.jpg"},"name":"The King of Tears, Lee Bang Won","next_episode_to_air":null,"networks":[{"id":829,"logo_path":"/xH3ldaNUozSEqekkZoU8MqPbNF0.png","name":"KBS1","origin_country":"KR"}],"number_of_episodes":32,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"태종 이방원","overview":"A work that sheds new light on the figure of Lee Bang-won, a leader who took the lead in the founding of the nation.","popularity":9.729,"poster_path":"/ijVdfnfCrFQDC0tWBNvPejDuZUA.jpg","production_companies":[{"id":116360,"logo_path":"/AfvZsh1ImHqATwF6LCUz7QLcS4g.png","name":"Monster Union","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2021-12-11","episode_count":32,"id":214526,"name":"Season 1","overview":"","poster_path":"/zcqtV0hpsv6K4uWmlFRroBm2Ehv.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5,"vote_count":5,"season_data":{"1":{"_id":"615d74a9d1444300602d771c","air_date":"2021-12-11","episodes":[{"air_date":"2021-12-11","episode_number":1,"episode_type":"standard","id":3266356,"name":"Episode 1","overview":"It is the year 1388. General Lee Seong Gye is dispatched to invade the Liaodong Peninsula but decides to retreat. King Woo of Goryeo, enraged, orders to arrest all the family of General Lee. The general’s son, Lee Bang Won, manages to elude the chase of soldiers and heads to Pocheon to save his family.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/mhzumGxgRWN7IocxUxV8jDBgFHf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-12","episode_number":2,"episode_type":"standard","id":3266422,"name":"Episode 2","overview":"After a fierce battle, the royal palace falls. Lee Seong Gye cannot bear to become a traitor and makes his army wait outside instead of taking over the palace. However, King Woo finds it hard to accept the defeat and organizes a surprise attack.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/ySchHRTC7Fuu800tZ35wjuvafPG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-18","episode_number":3,"episode_type":"standard","id":3266425,"name":"Episode 3","overview":"Lee Bang Won learns that assassins got inside the home of Lee Seong Gye. He rushes to the mansion to find his father still safe. Much relieved, Lee Bang Won approaches Lee Seong Gye, but at that moment, the men with swords jump at the father and the son.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/fPDUPoIBKxHEUSq2AdJ10JS1Gd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-19","episode_number":4,"episode_type":"standard","id":3266426,"name":"Episode 4","overview":"King Gongyang has shamed Lee Seong Gye in public. Unable to tolerate the insult his father suffered, Lee Bang Won visits the king and conveys a sharp warning. Terrified, the king issues an order to decapitate his predecessors, Woo and Chang. A confounded Lee Seong Gye implores the king to withdraw the order of beheading.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/j9M89qBP8yDXkzGmPqX9kO6nQhA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-25","episode_number":5,"episode_type":"standard","id":3266427,"name":"Episode 5","overview":"Lee Seong Gye gives up everything and leaves for Dongbukmyeon. Lee Bang Won fails to dissuade his father from leaving and feels frustrated. Meanwhile, Jo Yeong Mu, who has joined the journey to Dongbukmyeon, asks Lee Seong Gye to go back to Gaeseong and become the king, telling him that they will not be welcomed in their hometown in the present situation. Lee Seong Gye has to think and make a decision now.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/yiHLZaEBUfehqjwHcEBezvyNFW8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-26","episode_number":6,"episode_type":"standard","id":3266429,"name":"Episode 6","overview":"Jeong Do Jeon dashes toward the Cheongju Prison, and so does Jeong Mong Ju. But both are held back midway by a downpour, which cut off all the roads to the Cheongju Castle. The prisoners, who belong to Jeong Mong Ju’s faction, are destined to die if the rain should continue to flood the Cheongju Castle. The two men watch the endless heavy rain, each waiting for fate to decide.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/wxIXHDmm3ZDfyYTsqsHaOXNqy2a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-01","episode_number":7,"episode_type":"standard","id":3266430,"name":"Episode 7","overview":"While hunting in the woods, Lee Seong Gye is critically injured when he falls off his horse. Jeong Mong Ju takes this opportunity to exile all of Lee Seong Gye's followers. The Lee family does not know what to do and waits for Lee Seong Gye to wake up. Then, Lady Kang asks to see Bang Won who is carrying out a three-year memorial ritual for the late Lady Han.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/s2haQrIem43g9MbLGLdCvnlg11j.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-02","episode_number":8,"episode_type":"standard","id":3266431,"name":"Episode 8","overview":"Despite his father's order not to touch Jeong Mong Ju, Bang Won defies him and is determined to put an end to the chancellor's life. The death of Mong Ju has given Lee Seong Gye a chance to retake the throne, but as much as the General respects Master Poeun, he banishes Bang Won and his brothers from the house for disobeying his intentions. Now with Jeong Mong Ju gone, the fate of the throne lies within the hands of the family of Lee.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/iaHY7II9CTyq4qP0BzZCaSVTtei.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-08","episode_number":9,"episode_type":"standard","id":3266432,"name":"Episode 9","overview":"After Master Sambong reorganizes the court officials, he and Lady Kang succeed in persuading Seong Gye to take the throne. Thrilled by the news, Bang Won and his brothers attend the coronation. But as they reach the palace, they only find disappointment. Seong Gye is now in deep thought of who to appoint as the Crown Prince. He is aware of his old age and wishes to appoint the Crown Prince quickly.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/1VmCa0637rCubxx8hiwDd7qfHPc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-09","episode_number":10,"episode_type":"standard","id":3266434,"name":"Episode 10","overview":"Bang Won hears the news that Bang Seok will be installed as the Crown Prince. Full of rage and disappointment, he finds his brothers to stop it from happening. However, his brothers have given up on taking a position in the palace. Meanwhile, Lady Kang is extremely happy as her meticulous plan that she has been working on for years is finally coming into place. With her son appointed as Crown Prince and herself as the Queen, nothing can stop her now.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/slYZCH36BMhhWk53ANiujBhl33b.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-15","episode_number":11,"episode_type":"standard","id":3266435,"name":"Episode 11","overview":"Bang Won is furious as he sees Queen Sindeok act with hypocrisy. Although he wishes to rash out on the manipulative Queen, Lady Min settles him down and tells him that the time to strike back will come. As the King leaves the palace for a trip, the Queen plans a trap to get rid of Bang Won for good. She tampers with his family member and lures him to attack her with his House Guard soldiers.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/x3rTkqju5rTQB6UqzHojD4LCRSF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-16","episode_number":12,"episode_type":"standard","id":3266436,"name":"Episode 12","overview":"Bang Won sets off to Ming to stabilize the diplomacy. Although Queen Hyun is happy about having rid of Bang Won, bad news starts to pile on her. Meanwhile, Bang Won's audience with the Emperor of Ming goes better than expected. He returns home safely into the arms of his beloved wife, Lady Min. However, there are changes at the Palace that Bang Won must deal with. Perhaps these changes can become a chance for Bang Won to thrive.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/uxvIL21Sh3AI6b2M5Jv2zTlDE4E.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-02-19","episode_number":13,"episode_type":"standard","id":3266438,"name":"Episode 13","overview":"Lee Seong Gye accuses Bang Won responsible for the early death of Queen Hyun. Although Bang Won pleads his innocence, the King is blinded by the sorrow of losing his beloved Queen and cuts ties with Bang Won for good. Lady Min becomes outraged as she sees her husband being treated wrongfully. While Bang Won recovers from the shock that his father has given him, Lady Min tries everything in her power to make a spark of rebellion.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/r4ec5zH88HfNo11pXQ4YwNxgZwe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-02-26","episode_number":14,"episode_type":"standard","id":3266439,"name":"Episode 14","overview":"Bang Won starts planning details of the rebellion and begins training his soldiers for the battle to come. However, Seong Gye is fast-witted enough to realize that Bang Won is up to something. Although he tries to disband Bang Won's soldiers and take him in, he does not have enough evidence to do so. On top of that, the Emperor of Ming is also causing a problem. Both domestically and diplomatically, Joseon faces many hardships to go through.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/yG8qXKWGHfXG8Fg6Q2sRbrXOTnP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-02-27","episode_number":15,"episode_type":"standard","id":3266440,"name":"Episode 15","overview":"Lee Seong Gye declares that he will wage war in the Yodong Peninsula with all the private soldiers he has absorbed into the Three Armies Command. Several of his court officials beg him to reconsider, but he is adamant. Meanwhile, Lee Sook Beon and his soldiers appear in the Capital. Bang Won sees this as an opportunity to reignite the flames of rebellion.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/5ufChuTAQqRMAhuGBPpJKmVn6mp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-06","episode_number":16,"episode_type":"standard","id":3266442,"name":"Episode 16","overview":"Master Sambong finally determines to get rid of Bang Won and the other princes. However, as the assassination ends up a failure, it only provokes Bang Won to proceed with his rebellion quickly. Now, all soldiers from various parts of the country gather to follow Bang Won into the palace. With the King bedridden and the Crown Prince too scared to do anything, the palace remains defenseless. The future of Joseon now depends on the consequence of this rebellion.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/7RjRkOrHM11dZOJHE4A2DI4iV7X.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-12","episode_number":17,"episode_type":"standard","id":3266443,"name":"Episode 17","overview":"Bang Won's rebellion proceeds exactly as planned. Although he spares his father, he puts an end to those who are loyal to Jeong Do Jeon. Just when things seem to go well, unexpected casualties also occur. Royal blood that should not be split has been shed unrelated to Bang Won's wishes. He becomes confused whether he is a bloodthirsty beast or a man who wants to accomplish a great cause. Regardless, Bang Won now holds the most power in Joseon.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/lSdvTazzTCRXr6cNsCnuVcrTJGy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-13","episode_number":18,"episode_type":"standard","id":3266444,"name":"Episode 18","overview":"Sang Gu continues to threaten Sa Ra for money, and when that doesn't work, he decides to use Se Jong as bait. Se Jong nearly gets into an accident while running away, and Dan Dan gets injured while saving him. Meanwhile, Ki Ja gets caught for stealing Dae Ran's gold and money, but this leads to Young Guk finding out about the whereabouts of his mother's diamond ring.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/Ail5NkJHMtfjDwNTa9Z7mM5OarS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-19","episode_number":19,"episode_type":"standard","id":3266445,"name":"Episode 19","overview":"Lee Bang Gwa is fully determined to keep the throne and protect it from Bang Won. Although Bang Won is already distressed with Bang Gwa and Seong Gye, his other brothers raise an army against him. Bang Gan and Bang Ui take action and wage battle against Bang Won. Despite Bang Won's sickness of fighting his brothers, he yet once again must draw his sword against family.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/ieXFCWfWhzsKHRJjLp3h043CAQY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-20","episode_number":20,"episode_type":"standard","id":3266446,"name":"Episode 20","overview":"Bang Won successfully suppresses Bang Gan and heads directly to the Palace. Despite their differences, Bang Won and Bang Gwa have the same desire to stop shedding family blood. Hence, Bang Gwa decides to hand over the throne to Bang Won peacefully, and Bang Won decides to spare Bang Gan his life. However, Seong Gye is not satisfied with Bang Gwa's choices and plans his own schemes.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/v2edOL9qh9i9mrYpzBThUaUrqHM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-26","episode_number":21,"episode_type":"standard","id":3266447,"name":"Episode 21","overview":"Bang Won's plan to abolish private armies meets strong opposition from his court officials. He soon realizes that he cannot proceed with his plans without the support of the Min clan. However, Bang Won and Lady Min's discord continues to worsen as they struggle to see eye-to-eye on Lady Min's position in the future.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/w66ULDgO9GdoOeYKrOlC7ZkfbuU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-27","episode_number":22,"episode_type":"standard","id":3266448,"name":"Episode 22","overview":"Bang Won finally ascends to the throne and becomes the third king of Joseon. However, his wife, Lady Min is not even allowed to set foot in the palace. Lady Min becomes upset at how she is being treated and decides to enter the palace without Bang Won's permission. Bang Won's anger at her disobedience continues to grow.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/j6zD7srn7Q8p8i5uAD8U15N563M.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-02","episode_number":23,"episode_type":"standard","id":3266449,"name":"Episode 23","overview":"The King tries to weaken the power of the Min Clan by taking away all of Queen Wongyeong's court ladies and also by bringing in Min Je for questioning. Meanwhile, Seong Gye and those who follow him do not stay still. They gather armies from Dongbukmyeon and Seobukmyeon to revolt against Bang Won. Despite being king, Bang Won still has many challenges to face.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/sz6GlcfatZTVfjquwMomttrkSD5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-03","episode_number":24,"episode_type":"standard","id":3266450,"name":"Episode 24","overview":"The Former King Taejo aggressively gathers his army with Jo Sa Eui as the commander. Although Bang Won couldn't believe it at first, he quickly realizes the danger and assembles his army. Bang Won and Bang Gwa swore to never spill the blood of their family again. However, they both know that their father will not stop until he gets Bang Won's head. Now, the grand war that will decide the true king of Joseon begins.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/gAGpq4M3X0ejskgiRg7rZaLauib.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-09","episode_number":25,"episode_type":"standard","id":3266451,"name":"Episode 25","overview":"Once again Bang Won achieves victory against his father. Bang Won spares his father's life under the judgment that Jo Sa Eui is the only cause of the rebellion. No matter how many times he defeats his father, Bang Won is never at peace. Meanwhile, rumors start in the Captial that a child of the King is born and is left somewhere to die. Furious with this news, Bang Won sets off to find his mysterious child.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/sll4TCzOWhRSu3IpGfxGxEzR5yT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-10","episode_number":26,"episode_type":"standard","id":3266452,"name":"Episode 26","overview":"Bang Won decides that the Min Clan is not to be trusted. He comes up with a plan that will educate the Crown Prince as the future king and check the loyalty of the Min Clan at the same time. However, although he manages to achieve one thing, he did not expect the other to end up so differently than he expected.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/3ji5DY5Ud6b6TUUbBBnKeeq6AcR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-16","episode_number":27,"episode_type":"standard","id":3266453,"name":"Episode 27","overview":"The Crown Prince becomes rebellious against Bang Won as he gets forced to study. Although Bang Won is furious about the Prince not obeying him, he also realizes how Seong Gye must have felt. Meanwhile, the power of the Min Clan steadily weakens. As Mu Ku and Mu Jil are in danger of facing the death penalty, the Queen tries her best to prevent it from happening. The growth of a new generation brings an unsure future to the Palace.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/ccHD2HuTGNZQEoemA8sr73Z9aRt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-17","episode_number":28,"episode_type":"standard","id":3266454,"name":"Episode 28","overview":"The Queen's heart shatters into pieces as the Crown Prince betrays her. With his consent, Mu Ku and Mu Jil are indeed to die. Disputes occur regarding the Min brothers' innocence, but Bang Won punishes everyone who defies him. Meanwhile, Lee Je now seems to be ready to become King. However, Grand Prince Chungnyeong disagrees with it.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/2fU0dDSXamZcndNe8sd7FayoVhH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-23","episode_number":29,"episode_type":"standard","id":3266455,"name":"Episode 29","overview":"The Crown Prince is quickly losing his father's trust. Although he has already let Bang Won down several times, he only brings even more disappointment. Prince Chungnyeong sees this as an opportunity. For the purpose of serving the people well and making the country prosper, he grows his ambition to become King. Meanwhile, the power of the Min Clan drops further down as the Queen gets betrayed by the person she has shown mercy to.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/vbBwTKhMbZkJ443qDZXyAcVdvzQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-24","episode_number":30,"episode_type":"standard","id":3266456,"name":"Episode 30","overview":"The King allows the Crown Prince to return to the Palace. But what awaits him is only Chungnyeong making attempts to take his place. In this competition between the two brothers, the Queen is deeply worried that either one of her sons might get hurt. Meanwhile, one of Bang Won's loyal subjects becomes exiled for ruthless behavior.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/zGDGkO4WlUJdPwilORUQJJu0mJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-30","episode_number":31,"episode_type":"standard","id":3266457,"name":"Episode 31","overview":"Bang Won discrowns Lee Je and installs Lee Do as the new Crown Prince. As Lee Je leaves the palace, Queen Wongyeong also decides to leave because she cannot bear to be with Bang Won anymore. Shortly after, Bang Won abdicates the throne to Lee Do. Although Bang Won believes Lee Do will become a good king, he still wishes to control Lee Do in some ways whereas Lee Do fights against his father's control.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/80epiJJiP37w9sbDUKcI2kg5Rj7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-01","episode_number":32,"episode_type":"finale","id":3266458,"name":"Episode 32","overview":"Lee Do shows aggression toward Bang Won to be free from his control. Despite his effort, Bang Won's power is still too great, and eventually fails to save his father-in-law, Shim On. However, Lee Do grows to become a successful king as time passes. With this in mind, Bang Won and Lady Min rest deeply in peace.","production_code":"","runtime":60,"season_number":1,"show_id":135751,"still_path":"/rfu66lyJIy93EsT914No1c9nDvX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":214526,"poster_path":"/zcqtV0hpsv6K4uWmlFRroBm2Ehv.jpg","season_number":1,"vote_average":0}}}