{"adult":false,"backdrop_path":"/9JyCG0dGDJZm96Vm12KrBUXL96F.jpg","created_by":[{"id":1469021,"credit_id":"5d21de2f15c6364f5bf5554a","name":"Takashi Nishiyama","gender":0,"profile_path":null},{"id":2356199,"credit_id":"5d21de3f7eb5f200124e7f19","name":"Hiroshi Matsumoto","gender":0,"profile_path":null}],"episode_run_time":[19],"first_air_date":"1995-10-21","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"}],"homepage":"","id":13655,"in_production":false,"languages":["en"],"last_air_date":"1997-05-14","last_episode_to_air":{"id":503206,"name":"Cammy Tell Me True","overview":"Bison captures the MI5 team in a brief battle, and the British government are adamant about getting them back, as they know critical government secrets. Bison compiles doomsday codes, which are the launch protocols for every known nuclear bomb on earth, and plans to not take over the world, but to destroy it. Guile and Chun-Li are given a package from Sagat, containing the secret of Cammy's past, as Sagat does not want the world destroyed by Bison. They infiltrate Bison's base, and everyone, including MI5, team up to stop Bison, and destroy his computer console with one second left on the doomsday timer.","vote_average":0,"vote_count":0,"air_date":"1997-05-14","episode_number":13,"episode_type":"finale","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null},"name":"Street Fighter","next_episode_to_air":null,"networks":[{"id":30,"logo_path":"/g1e0H0Ka97IG5SyInMXdJkHGKiH.png","name":"USA Network","origin_country":"US"}],"number_of_episodes":26,"number_of_seasons":2,"origin_country":["US","JP","CA"],"original_language":"en","original_name":"Street Fighter","overview":"A new challenger approaches with this Street Fighter II The Animated Series boxed set which contains both seasons of the television series! Discipline! Justice! Commitment! That's the code that the secret international peacekeeping force \"Street Fighter\" adheres to! Made up of the top martial artists from around the world, Street Fighter opposes criminal activities anywhere, at any time. William F. Guile, the leader of Street Fighter, conducts himself with honor even as he blows away bad guys at the speed of sound with his \"Sonic Boom\"! Meanwhile, the bestial Blanka shocks his opponents all too literally, and Chun-Li's furiously flying fleet feet take down anything that gets between her and justice! They'll need all the help they can get against the villainous Shadaloo, whose leader M.Bison is one of the strongest, most vile criminals around! Fortunately for Street Fighter, they've got Ryu and Ken to back them up.","popularity":7.452,"poster_path":"/pvMYVVqbZ2l4TCF4VX1e4tC2r0m.jpg","production_companies":[{"id":7220,"logo_path":"/dD0x5awPmtx4sAr2pNvkmxkCODh.png","name":"CAPCOM","origin_country":"JP"},{"id":106882,"logo_path":null,"name":"Graz Entertainment","origin_country":"US"},{"id":120450,"logo_path":null,"name":"InVision Entertainment","origin_country":""},{"id":16642,"logo_path":null,"name":"USA Network","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"},{"iso_3166_1":"CA","name":"Canada"}],"seasons":[{"air_date":"1995-10-21","episode_count":13,"id":24700,"name":"Season 1","overview":"","poster_path":"/t1MEaYdtVh5xw9jBkwLCtETSfDW.jpg","season_number":1,"vote_average":0},{"air_date":"1996-09-21","episode_count":13,"id":24701,"name":"Season 2","overview":"","poster_path":"/7anYBA2EfQpxwzHVBlrjWmI1qZZ.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5.125,"vote_count":8,"season_data":{"1":{"_id":"52582966760ee36aaa84fd35","air_date":"1995-10-21","episodes":[{"air_date":"1995-10-21","episode_number":1,"episode_type":"standard","id":503181,"name":"The Adventure Begins","overview":"While working undercover for the Street Fighter operation, Guile gets contacted by Escher. Bison had just stolen a biological virus that can kill in 24 hours that he stole from Guile's old flame, Lucinda (or \"Cindy\"). Guile assembles a team consisting of Chun-Li, Ryu, Ken and Blanka, and heads to the jungle to put an end to Bison's schemes. Unfortunately both Ryu and Blanka contract the virus.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-10-28","episode_number":2,"episode_type":"standard","id":503182,"name":"The Strongest Woman In The World","overview":"Bison commandeers a nuclear facility in China which is coincidentally situated near Chun-Li's birthplace which Bison had destroyed years prior. Guile assembles Blanka and Chun-Li for the mission to stop Bison. Chun-Li however, is only focused on destroying Bison and cares little weather the nuclear plant is destroyed. Eventually, Guile's scolding gets through to her and she lets Bison escape so that innocent people wouldn't be harmed.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-11-04","episode_number":3,"episode_type":"standard","id":503183,"name":"Getting To Guile","overview":"Dee Jay relays to Escher and Chun-Li that he and Guile were ambushed by Bison and Zangief and that Guile was captured. Bison hooks Guile into a mind-probing device to find his Achilles heel, so he can reprogram Guile to destroy the rest of the street fighters. Meanwhile Chun-Li rallies Blanka, Dee Jay, Ryu and Ken to go to Guile's aid and infiltrate Bison's stronghold. After battling many mutants, the team rescues Guile and reminds him of the street fighter code: Discipline, justice, and commitment.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-11-11","episode_number":4,"episode_type":"standard","id":503184,"name":"No Way Out","overview":"Sagat uses his vast army to wage war on the US embassy in Shadowlaw, all the while a young boy is trapped in the building while it's being evacuated. Blanka, Chun-Li and Guile head the rescue operation, but Guile also gets trapped in the building with the boy as well. Both Guile and his young friend try to escape Sagat's patrolling forces and were able to gain access to the secret computer files, which were very important apparently.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-11-18","episode_number":5,"episode_type":"standard","id":503185,"name":"Demon Island","overview":"Bison steals a top secret military plane that can turn invisible at the push of a button so it's up to Guile, Dee Jay, Cammy and Blanka to get it back. They arrive on a mysterious island where Bison currently has set up shop, unfortunately Zangief is patrolling the area in a hovercraft. Dee Jay blames Zangief for ruining his fighting career, and they begin to fight while Guile fends off Bison. The Street Fighters eventually steal the plane just as the island explodes inexplicably.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-12-02","episode_number":6,"episode_type":"standard","id":503186,"name":"Desert Thunder","overview":"Escher receives word that a new military laser was stolen by the female cyborg, the Satin Hammer and her cohort, T. Hawk. While T. Hawk was originally supposed to be undercover, Escher believes T. Hawk has switched sides. He charges Guile and Blanka to get to the bottom of situation. They eventually confront T. Hawk, who still maintains he's on their side, even though it's clear he's sympathetic towards the Satin Hammer. Eventually however, T. Hawk throws himself into Hammer's computer system which destroys it.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-12-09","episode_number":7,"episode_type":"standard","id":503187,"name":"Dark Heart","overview":"The millennium comet is on its scheduled 1000-year voyage in the skies over earth, but Bison uses his magnetic chi powers to redirect the comet towards the planet unless he gets a huge sum of money. Guile, Blanka, Ryu and Ken go the Himalayas to stop Bison, but the group gets separated. Blanka also meets Dhalsim while in the mountains, who he blames for turning him into a monster. With Dhalsim's help however, they stop Bison's plan and probably saved Ken and Ryu too.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-12-16","episode_number":8,"episode_type":"standard","id":503188,"name":"The Medium Is The Message","overview":"A Street Fighter tournament is being held in India, and Escher sends Guile and the rest of the street fighters to compete. Bison is attending as well, and has a double threat of a plan; use his new mutant combatants to destroy the street fighters, or have Balrog create a video of the street fighters defiling a Hindu temple. Both Bison's plans fail when Guile saves a scientist then performs a flash kick on a bomb. This episode is notable for producing an Internet meme on Youtube (\"This is delicious!\" and \"YESH! YESH!\")","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-12-30","episode_number":9,"episode_type":"standard","id":503189,"name":"Eye Of The Beholder","overview":"Word comes in that a scientist in Hawaii is concocting a serum that could help Blanka revert into his human form. Vega however, also hears of this serum and wants to use it to make himself eternally young. Vega captures the scientist and holds him for ransom. Blanka is forced to give Vega the cure, in exchange for the Doctor's life. Also, Blanka makes out with the scientist's assistant while falling from a plane. Vega drops the vial of serum too, losing his chance for immortality.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-06","episode_number":10,"episode_type":"standard","id":503190,"name":"The Hand That Feeds You","overview":"Ryu's cousin goes missing in Hong Kong while the street fighters are investigating a local drug operation. Action star Fei Long says he'll teach Guile the secrets of the city, if Guile teaches him how to use Chi energy attacks. Eventually, Ryu and Ken get captured by the drug runners. And it's up to Guile and Fei Long to save them.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-01-20","episode_number":11,"episode_type":"standard","id":503191,"name":"Keeping The Peace","overview":"A small city near Shadowlaw is in chaos as diamonds have been found to be rich in the region. Sagat and other warlords are lurking about, and each faction wants a piece of the pie. Guile is asked by Escher to check out the situation on behalf of the Street Fighters. Meanwhile Sawada has taken over Guile's former position in the AN and is currently in charge of the military presence. Hostilities run high as Guile as to defuse several bombs in the area, with the help of his Sonic Boom attack.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-01-27","episode_number":12,"episode_type":"standard","id":503192,"name":"Chunnel Vision","overview":"Bison finally gets captured at the hands of Cammy's former British teammates, MI5. While great news, Bison's supporters randomly start blowing up locations in England and threaten that it will continue until Bison is released, along with a 2 billion pound payoff. Zangief places bombs in the chunnel, a train track connecting England and France. It's up to Guile, Dee Jay, Honda and Cammy to clean up the mess.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-02-03","episode_number":13,"episode_type":"finale","id":503193,"name":"Strange Bedfellows","overview":"A mysterious warrior starts destroying both Bison's strongholds as well as those under Street Fighter jurisdiction. Both sides blame the other and it eventually comes down to Bison and Guile meeting on a Volcano for a final showdown. However, clumsy clues were given to both warriors which lead them to the location of the battle by none other than Akuma. Akuma wants both Bison and Guile to fight to death, where Akuma will then destroy the winner and steal their chi. Bison and Guile are forced to work together and eventually attack Akuma, only for him to escape via teleportation.","production_code":"","runtime":19,"season_number":1,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Akuma","credit_id":"5d21e22094d8a849844336d0","order":503,"adult":false,"gender":2,"id":27145,"known_for_department":"Acting","name":"Dale Wilson","original_name":"Dale Wilson","popularity":1.777,"profile_path":"/pvze2KdWMK16UEvJuSrJBTVL4Iy.jpg"}]}],"name":"Season 1","overview":"","id":24700,"poster_path":"/t1MEaYdtVh5xw9jBkwLCtETSfDW.jpg","season_number":1,"vote_average":0},"2":{"_id":"52582966760ee36aaa84fd40","air_date":"1996-09-21","episodes":[{"air_date":"1996-09-21","episode_number":1,"episode_type":"standard","id":503194,"name":"The Hammer Strikes","overview":"Needing the help of the street fighters, Dhalsim summoned them to his remote mountain temple by causing Blanka considerable mental pain. It seems the Satin Hammer was back, and wanted to steal an atomic bomb that Dhalsim currently had in his possession. Guile brought Blanka, T. Hawk and Sawada along with him, even though feelings still existed between T. Hawk and the Satin Hammer. Eventually the street fighters stopped hammer's plot when Dhalsim deactivated the atomic bomb's countdown timer.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-09-28","episode_number":2,"episode_type":"standard","id":503195,"name":"Cammy And The Bachelor","overview":"A crime wave has taken over London, and Bison is thought to be the one responsible, so Guile, Cammy and Honda team up with the team at MI5 to take Bison as well as Birdie and Sodom down. During the fight, Bison seemingly takes over Cammy's mind, and she immediately switches allegiances. With a backup plan in full readiness, Bison and Cammy manage to escape. This is much to the chagrin of Guile, who screams at them as they fly away.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52582967760ee36aaa84fe81","order":500,"adult":false,"gender":2,"id":26089,"known_for_department":"Acting","name":"Garry Chalk","original_name":"Garry Chalk","popularity":9.198,"profile_path":"/jESGnBSP0OjFxJejN1OPsjXA9sJ.jpg"}]},{"air_date":"1996-10-05","episode_number":3,"episode_type":"standard","id":503196,"name":"New Kind OF Evil","overview":"Chun-Li is attacked by mysterious mutant assailants, as well as having her TV crew kidnapped. She calls for Guile and Blanka's help to track them down, which leads to a search of the sewers. They soon find out that a former scientist of Bison's is continuing mutant research and mutated 3 thugs into half-man/half eel/alligator/bat warriors. In the ensuing battle, Blanka receives a mega-dose of mutagen ooze, which turns him even more feral.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-10-12","episode_number":4,"episode_type":"standard","id":503197,"name":"The Worlds Greatest Warrior","overview":"While visiting their master Gouken, Ryu and Ken are challenged by the evil Akuma who claims to have stolen Gouken's chi and will do the same to them. Akuma gives Ryu and Ken time to train so they might stand a chance against him. During the course of their sparring sessions however, Ken injures Ryu's arm, which leaves Ryu in a bad state. Akuma uses that to easily defeat Ryu, only to get defeated himself by the power of Ken.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Akuma","credit_id":"5d21e3427eb5f200114e83cc","order":504,"adult":false,"gender":2,"id":84490,"known_for_department":"Acting","name":"David Kaye","original_name":"David Kaye","popularity":3.468,"profile_path":"/izxtFSio5twcVA1oJWPvobxpcZj.jpg"}]},{"air_date":"1996-11-05","episode_number":5,"episode_type":"standard","id":503198,"name":"So, You Want To Be In Pictures","overview":"Ryu and Ken are asked to help Fei Long with his latest movie project. Investors in the film however pull funding out of the movie, which leaves Fei Long with no way to raise awareness about the evil crime boss, Lo Fat. Ken is forced to ask his father to re-invest in the film, so it can continue. Ken gets creative license for the script, and writes himself in as the star instead of Fei Long. Both men have a climatic showdown, which results in Ken burning down the entire movie studio.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-11-15","episode_number":6,"episode_type":"standard","id":503199,"name":"Face Of Fury","overview":"Guile and Blanka take a trip to the Middle East to cool hostilities between Arabs and Israelis, but Blanka's temper gets the best of him, and he attacks them all. Vega, watching this drama unfold on a prison TV set, swears revenge against Blanka for destroying his face. Vega easily escapes, and flies to Hawaii for a final battle while taking Mei Lei, Blanka's love interest, hostage. Blanka almost manages to kill Vega, but with the combined efforts of Mei Lei, Guile and Chun-Li, they were able to prevent Vega's tragic death at the hands of Blanka.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-11-23","episode_number":7,"episode_type":"standard","id":503200,"name":"Cammy Must Die!","overview":"Bison charges Cammy and his cybernetic creation La Lupa, to steal a priceless Kali statue for him. The statue has meditative powers that Bison hopes will help him heal his wounds from his previous battle with Guile. The street fighters team up with MI5 to help get to the bottom of Cammy's switched allegiances and during the battle, Cammy gets knocked on the head which frees her from Bison's mental control. Cammy then lures the street fighters to Bison's hideout, where she betrays them once more. Bison and Cammy are then able to escape.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-12-09","episode_number":8,"episode_type":"standard","id":503201,"name":"The Flame And The Rose","overview":"The mystical psychic Rose, senses that powers in the world are fluctuating wildly out of control. She blames Ken and Blanka for this sudden energy spike, and believes they are the catalysts to the end of the world. Rose kidnaps them both and forces them to fight only to realize they are not evil at all. With their help, she tracks down Bison, who is the true manifestation of evil she had sensed. She then attacks Bison in the mental world just as Ken and Blanka destroy the kali statue, which destroys Bison's entire castle. Mysteriously, everyone in uninjured, and Bison eludes capture once more.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52582967760ee36aaa84ff29","order":501,"adult":false,"gender":1,"id":51800,"known_for_department":"Acting","name":"Teryl Rothery","original_name":"Teryl Rothery","popularity":19.113,"profile_path":"/16rUSnTH56cKatjd6kjEYEfU4cA.jpg"}]},{"air_date":"1997-01-04","episode_number":9,"episode_type":"standard","id":503202,"name":"The Warrior King","overview":"The powerful Warrior King had defended his country from the evil Mages for years, but when his orb of power is flung into a vortex, he follows it as well. The orb lands in a nation close to Shadowlaw, and Bison claims it as his own. The orb has the power to control all weather, and Bison threatens the world with its power. The street fighter team is assembled, and Chun-Li is the first to confront Bison. The Warrior King magically appears, and fights Bison's minions with Chun-Li's help. The two quickly fall in love until another vortex appears, and the Warrior King leaves Chun-Li forever.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Warrior King","credit_id":"5d21e38cf495ee001436fb6d","order":505,"adult":false,"gender":2,"id":2391,"known_for_department":"Acting","name":"Michael Dorn","original_name":"Michael Dorn","popularity":11.503,"profile_path":"/55xWHDtf7xHFdS6IKicqVzEfTo7.jpg"}]},{"air_date":"1997-02-18","episode_number":10,"episode_type":"standard","id":503203,"name":"The Beast Within","overview":"Blanka searches the jungle for a mysterious healing plant that could revert him to his normal form. Guile and Lucinda go to track him down, and hear the same story of the plant from the jungle natives. Blanka then encounters a wild jungle boy who swears revenge against the natives for killing his family. The boy is actually an alien who had crash-landed on earth along with his family. Blanka befriends the boy, and along with Guile and Lucinda, they defeat the evil natives and the boy returns to his home planet.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-04-11","episode_number":11,"episode_type":"standard","id":503204,"name":"Second To None","overview":"Ryu is a legend in Shadowlaw, and Sakura is his most adamant admirer. But when Sagat patrols the streets regularly making sure to burn down any building with posters of Ryu in it, Sakura leaps into action. She boards a plane headed for New York to seek out her idol, who had just been visiting Ken in the hospital, as Ken swallow some water while on a mission in Africa. Ryu meets Sakura, and she convinces him to come to Shadowlaw to defeat Sagat once more. Sagat welcomes the challenge, and he and Ryu have another epic confrontation.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-04-27","episode_number":12,"episode_type":"standard","id":503205,"name":"Final Fight","overview":"The plot of this episode is based on the arcade game with the same title. The new mayor of Metro City Mike Haggar, has his daughter kidnapped by the Mad Gear gang, so it's up to Ken and Ryu to save her. Escher, Guile and Haggar devise a plan to put Ken and Ryu undercover to infiltrate the gang, which Cody takes exception to as he constantly screams at everyone in protest. Eventually Ken and Ryu meet with Belger, the boss of the Mad Gears, and along with Cody and Guy, are able to save Jessica. Haggar breaks down a door at the very end, and Guy kicks a rocket back at Belger.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52582968760ee36aaa84ff83","order":502,"adult":false,"gender":2,"id":52288,"known_for_department":"Acting","name":"Jim Byrnes","original_name":"Jim Byrnes","popularity":5.332,"profile_path":"/q6NzmS2O3fJ4Z2JJ22dSH5rGbJT.jpg"}]},{"air_date":"1997-05-14","episode_number":13,"episode_type":"finale","id":503206,"name":"Cammy Tell Me True","overview":"Bison captures the MI5 team in a brief battle, and the British government are adamant about getting them back, as they know critical government secrets. Bison compiles doomsday codes, which are the launch protocols for every known nuclear bomb on earth, and plans to not take over the world, but to destroy it. Guile and Chun-Li are given a package from Sagat, containing the secret of Cammy's past, as Sagat does not want the world destroyed by Bison. They infiltrate Bison's base, and everyone, including MI5, team up to stop Bison, and destroy his computer console with one second left on the doomsday timer.","production_code":"","runtime":19,"season_number":2,"show_id":13655,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":24701,"poster_path":"/7anYBA2EfQpxwzHVBlrjWmI1qZZ.jpg","season_number":2,"vote_average":0}}}