{"adult":false,"backdrop_path":"/53C8hxVGz5jhed5f2gaUBTgZj6a.jpg","created_by":[{"id":14774,"credit_id":"55867ad59251411e8d002e36","name":"Harry Julian Fink","profile_path":null}],"episode_run_time":[30],"first_air_date":"1966-09-16","genres":[{"id":10759,"name":"Action & Adventure"},{"id":18,"name":"Drama"}],"homepage":"","id":13823,"in_production":false,"languages":["en"],"last_air_date":"1967-03-31","last_episode_to_air":{"id":506645,"name":"Lisa","overview":"(intro narration)  Night.  A man is running away, he's being chased by 2 goons in a Rolls Royce.  In the alley behind the Casa del Gato, the hoods (dressed as cops) get out of the car and shoot the man.  Cat whales into the crooks, but they escape.  Pepe asks Cat if he knows the murdered man; Cat doesn't, but the dead man had a note with Cat's name on it.\n\nCat goes to meet Lisa, a beautiful woman around 30; she is on the 6th floor terrace of a swanky hotel.  \"\"You got my message,\"\" Lisa says, as she offers Cat some champagne and they sip it together.  Cat reminds his felonious friend, \"\"The last time you sent me a message, you cost me 50,000 pesetas.\"\" (about $312)  Cat tells her the man who delivered her message is dead; she says he was \"\"a dear friend\"\" yet seems remarkably unconcerned with his death.  Cat quips her friends have a high mortality rate; and even as Lisa tells Cat of her latest $1.5-million larceny, she has drugged his champagne.  When Cat wakes up, he is greeted by General Bu","vote_average":0,"vote_count":0,"air_date":"1967-03-31","episode_number":26,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null},"name":"T.H.E. Cat","next_episode_to_air":null,"networks":[{"id":6,"logo_path":"/cm111bsDVlYaC1foL0itvEI4yLG.png","name":"NBC","origin_country":"US"}],"number_of_episodes":26,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"T.H.E. Cat","overview":"T.H.E. Cat is an American action drama that aired during the 1966-1967 television season on NBC, co-sponsored by R.J. Reynolds and Lever Brothers. The series was created by Harry Julian Fink, the creator of Dirty Harry .\n\nRobert Loggia starred as the title character, Thomas Hewitt Edward Cat. T. H. E. Cat is a forerunner of television characters such as The Equalizer, who skirt the edges of the law and bring skills from earlier careers on behalf of those needing more help than the police can offer.\n\nThe series preceded the 1968-1970 ABC television series It Takes a Thief, which was also about a cat burglar who used his skills for good.","popularity":4.983,"poster_path":"/l5wGcpTvFpLSBa6VYpQTgQKtPF1.jpg","production_companies":[{"id":1502,"logo_path":"/ywjcvHUiKxv7cYsestkONF8LieH.png","name":"NBC","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"1966-09-16","episode_count":26,"id":24992,"name":"Season 1","overview":"","poster_path":"/1xUsMwgMh0ke8eY9k64Nn04Empe.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8,"vote_count":3,"season_data":{"1":{"_id":"52582b20760ee36aaa8730e9","air_date":"1966-09-16","episodes":[{"air_date":"1966-09-16","episode_number":1,"episode_type":"standard","id":506620,"name":"To Kill a Priest","overview":"Outside a cathedral, which is like a giant fortress, armed police are standing guard.  Captain McAllister, chomping on a big cigar, takes Cat inside, and explains, \"\"They call him the Fisherman's Priest, he blesses them and their boats.\"\"  A while back, extortionists started demanding $5 per fisherman, per week.  That's $5,000 a week-- a quarter of a million dollars a year; several fishermen were killed.  The good priest told his flock not to pay, now the priest is marked for death; there have been 3 attempts on his life in the last month.  The good priest doesn't want police protection, instead relying on some fishermen, like former champion wrestler \"\"Mighty Joe\"\" Slavic.  The priest has a patch over his right eye, he explains to Cat: \"\"acid.\"\"  Cat goes outside, and using his grappling hook and rope, makes a dramatic top-story entrance and punches out Slavic, and throws a knife narrowly missing the priest's head-- proving to the good priest that he needs protection.  The man in black tell","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b20760ee36aaa873105","adult":false,"gender":2,"id":68682,"known_for_department":"Directing","name":"Boris Sagal","original_name":"Boris Sagal","popularity":1.34,"profile_path":"/tJL5SUvaNPQXcOIIIuQxLxOZbgV.jpg"}],"guest_stars":[]},{"air_date":"1966-09-23","episode_number":2,"episode_type":"standard","id":506621,"name":"Sandman","overview":"Late at night, an elderly cat burglar, dressed all in black, breaks into a mansion, and cracks a wall safe; he tries to steal an object.  The owner, Mr. Cahill, bursts into the room, and fires several shots at the burglar, who escapes out the window.  On the roof, the elderly cat burglar is confronted by a young cat burglar, dressed in an identical all-black outfit.  The young burglar asks, \"\"Don't you remember your best student?\"\"  The elderly man says no, and asks, \"\"Who are you?\"\"  The young man in black answers, \"\"Cat-- T. Hewitt Edward Cat.\"\" (intro music)\n\nAt the Casa del Gato, Pepe is telling Cat about the world-famous emerald called \"\"the Portuguese\"\" which is in the possession of that racketeer Cahill.  It was no doubt the Portuguese that the Sandman tried to steal last night.  Cat says the Sandman was more than just his teacher, he was a Master.  McAllister shows up and talks to Cat.  Even though McAllister knows Cahill has stolen the emerald, he can't just search his place without a","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b20760ee36aaa873105","adult":false,"gender":2,"id":68682,"known_for_department":"Directing","name":"Boris Sagal","original_name":"Boris Sagal","popularity":1.34,"profile_path":"/tJL5SUvaNPQXcOIIIuQxLxOZbgV.jpg"},{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[]},{"air_date":"1966-09-30","episode_number":3,"episode_type":"standard","id":506622,"name":"Payment Overdue","overview":"In the wee hours of the morning, at the Casa del Gato, the singer this week is the fair Jerrie Loren.  She's singing to the audience, \"\"Night brings soft winds, and I close my eyes and reminisce.  I find my mind filled with memories of our last kiss.  The soft winds touch me, gently warming me the way you used to do.  Daytime I'm fine, but then comes the night, bringing soft winds and memories of you.\"\"  Outside, Arnie Bliss is being attacked by Morgan and his hoods.  When one of the hoods slaps him, the Cat turns as he hears the sound.  (how can he hear it inside the club, with a band and a singer?)  Cat goes outside to investigate, just as Morgan sticks a knife into Arnie.  Cat fights off the attackers; Morgan drives away in his car.  Arnie, slumped on the sidewalk, says, \"\"Thanks.  I owe ya one, whatever your name is.  Mister...\"\"  The  man in black answers, \"\"Cat-- T. Hewitt Edward Cat.\"\" (intro music)\n\nThey put Arnie in an ambulance and drive him to the hospital.  McAllister goes inside","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b20760ee36aaa873105","adult":false,"gender":2,"id":68682,"known_for_department":"Directing","name":"Boris Sagal","original_name":"Boris Sagal","popularity":1.34,"profile_path":"/tJL5SUvaNPQXcOIIIuQxLxOZbgV.jpg"},{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[{"character":"Morgan","credit_id":"63d5cc8e22df2e00a0d983b0","order":502,"adult":false,"gender":2,"id":103789,"known_for_department":"Acting","name":"Don Barry","original_name":"Don Barry","popularity":7.433,"profile_path":"/A4huH027Zvo1sgi3Ym5RetBAvve.jpg"}]},{"air_date":"1966-10-07","episode_number":4,"episode_type":"standard","id":506623,"name":"Brotherhood","overview":"Cat walks up to a dilapidated apartment building.  He goes upstairs and silently unlocks the door, and walks through the front room; then he kicks open the kitchen door.  Inside the room, Omar Cantorte is holding a sawed-off shotgun to a girl's head; she is tied to a chair.  Cantorte asks, \"\"You're the one?  Your name?\"\"  The man in black answers, \"\"Cat-- T. Hewitt Edward Cat.\"\" (intro music)\n\nCantorte tells the story.  17 years ago, his younger brother shot policeman J. W. Hardman's wife; she'd just had a baby (the girl now in the chair).  Hardman went on a shooting spree and killed 5 members of the Brotherhood, including Cantorte's brother.  Hardman has spent the last 17 years in prison, he is being released today.  The Brotherhood has ordained his death.  Cantorte offers a trade: the girl's life, if Cat brings him Hardman alive.\n\nCat goes to the prison, and rides with Hardman on the train back to town.  On the train, Cat saves Hardman from the Man with Pale Eyes, and 3 other members of th","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[]},{"air_date":"1966-10-14","episode_number":5,"episode_type":"standard","id":506624,"name":"Little Arnie from Long Ago","overview":"Arnie Ludock got sent to prison in 1936; now, after 30 years, he is free.  Arnie is accompanied by his old sidekick Drummer.  At their place, Captain McAllister confronts Arnie.  The Captain is the one who sent Arnie up 30 years ago; McAllister was just a rookie cop then.  Arnie is as feisty as ever, and sneers, \"\"You think I'm scared of an old man with one wing and a badge?\"\"  McAllister is about to punch him when Cat intervenes.  Arnie asks, \"\"Who are you?\"\"  The man in black answers, \"\"Cat--T. Hewitt Edward Cat.\"\" (intro music)\n\nAt the Casa del Gato (\"\"House of the Cat,\"\" a nightclub run by their friend Pepe), McAllister indicates his missing left hand and tells Cat, \"\"Arnie did this!\"\"  Arnie had shot McAllister's hand off with a machine gun; McAllister wants revenge.  Even though his handicap held him back, McAllister still made Captain on the police force over the years-- Cat tells him he had a long, honorable career; he shouldn't throw it all away with some rash revenge against Arnie.  Mea","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"52582b20760ee36aaa87315f","order":500,"adult":false,"gender":2,"id":6577,"known_for_department":"Acting","name":"James Whitmore","original_name":"James Whitmore","popularity":10.08,"profile_path":"/d1nOu22OvPzdwS8euWE0FNHwx8K.jpg"}]},{"air_date":"1966-10-21","episode_number":6,"episode_type":"standard","id":506625,"name":"None to Weep, None to Mourn","overview":"Late afternoon, in a large castle-like home, filled with relics and paintings and statues, Cat walks down a corridor.  Cat asks an old woman, \"\"Where are the servants?\"\"  The old woman says, \"\"When death is about to enter the house, no one may remain to bar his way.\"\"  Cat opens a door, and sees a dead man (Hadis) propped up.  The woman asks, \"\"You are not...?\"\"  Cat says, \"\"Death?  No.\"\"  The old woman asks, \"\"Then who are you?  What is the name by which you walk?\"\"  He answers, \"\"Cat-- T. Hewitt Edward Cat.\"\" (intro music)\n\nLater, at the Casa del Gato, Cat is discussing the case with his pals.  Captain McAllister thinks it was death by natural causes, there are no injuries on the body-- the old man's heart just stopped.  Pepe says the man was marked for death, and talks of feuds, cults and rites of blood.  The widow of Hadis phones Pepe asking for help; Pepe promises her that Cat will come.  Back at Hadis' mansion, the widow Lilah (she was Hadis' 4th wife) tells Cat that she is worried her stepso","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b21760ee36aaa873182","adult":false,"gender":2,"id":151399,"known_for_department":"Directing","name":"Harvey Hart","original_name":"Harvey Hart","popularity":1.687,"profile_path":"/30F5RFoDhduvxJmNnllM9D7S9eQ.jpg"},{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[{"character":"Lilah Hadis","credit_id":"6498269dbbd0b000adf0c4f8","order":509,"adult":false,"gender":1,"id":16014,"known_for_department":"Acting","name":"Diana Muldaur","original_name":"Diana Muldaur","popularity":4.157,"profile_path":"/3CH6B91gnBWkKkC0NImNQYRAWJH.jpg"},{"character":"Salen Grigor","credit_id":"649826b062f33500e912c16b","order":510,"adult":false,"gender":2,"id":88906,"known_for_department":"Acting","name":"Cyril Delevanti","original_name":"Cyril Delevanti","popularity":3.247,"profile_path":"/ldqsp9NS3cbTQfQvp6JJ5WgTWxA.jpg"}]},{"air_date":"1966-10-28","episode_number":7,"episode_type":"standard","id":506626,"name":"Moment of Truth","overview":"At the Casa del Gato, Serafina, a pretty flamenco dancer, is doing her number.  Cat says, \"\"Beautiful\"\"; Pepe, looking at the night's receipts, says, \"\"Beautiful.\"\"  Cat observes, \"\"You are getting old, my friend-- you appreciate the wrong figures.\"\"  But Carlos the waiter appreciates Serafina's beauty.  Just then, Miguel Figueroa, a famous Spanish matador who now has a slight limp, enters along with his fellow matadors Luiz and Frederico, and the Count de Vallares.  Pepe greets Figueroa, and seats him at the head table.  Mysteriously, a hand pulls a dagger from a coat-of-arms display on the wall.  The dagger flies at Figueroa's head, but at the last instant, Cat pulls him to safety.  Miguel Figueroa asks, \"\"And to whom do I owe my life?\"\"  The man in black answers, \"\"Cat--T. Hewitt Edward Cat.\"\" (intro music)\n\nLater, Figueroa is having drinks with Pepe, Cat, and Count de Vallares; Luiz and Frederico are at the next table.  Captain McAllister shows up with the dagger, and says there were no finge","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b21760ee36aaa8731a1","adult":false,"gender":2,"id":21452,"known_for_department":"Directing","name":"John Rich","original_name":"John Rich","popularity":1.213,"profile_path":null},{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[]},{"air_date":"1966-11-04","episode_number":8,"episode_type":"standard","id":506627,"name":"Marked For Death","overview":"At midnight, Cat is on the roof of a tall building, and enters through the skylight.  He slides down a long rope.  He is immediately surrounded by many men in the dark; a spotlight hits Cat, who remains motionless.  A man, obviously the leader (Silvio), steps forward and demands to know what Cat is doing here.  Cat shows him a card (sort of like a Tarot card) with 2 crossed daggers, pointing down and dripping blood; in the background there is a coiled snake.  Cat turns the card over, the back was blank but on it is some handwriting: \"\"12 o'clock.\"\"  The leader says this card was not meant for him, it was meant for Pepe Cordoza of the tribe Barbiria Cordoz.  Cat says he came in his stead; the leader says he should not meddle in gypsy affairs, but adds, \"\"We will give you a reading.  But I do not think you will relish your future, Señor...?\"\"  The man in black answers, \"\"Cat--T. Hewitt Edward Cat.\"\" (intro music)\n\nThe beautiful gypsy Mariana reads Cat's left palm; she says his false loyalty to","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1966-11-18","episode_number":9,"episode_type":"standard","id":506628,"name":"Crossing at Destino Bay","overview":"Night, around 1:30 a.m.  Cat is at the Destino Bay Ferry building, which appears to be totally deserted-- even the man in the ticket booth is either unconscious or dead.  Cat encounters an armed hitman.  Cat pulls his cat's-claw knife from his sleeve; the hitman shoots it out of his hand with his silencer.  The hitman says, \"\"The others are in the waiting room.  You could not be the one who hired me.\"\"  Cat responds, \"\"Nor you the one who hired me.\"\"  The hitman introduces himself, \"\"I am Scorpio.  And your name?\"\" The man in black answers, \"\"Cat--T. Hewitt Edward Cat.\"\" (intro music)\n\nScorpio, now toting a machine-gun, unlocks the big, metal sliding gate and takes Cat into the large waiting room.  There are 4 anxious people-- 2 men and a couple-- who are desperate to get across the Destino and over the border.  The first to talk is Benjamin J. Gross: a bald, heavyset man around 60; he is the one who hired Cat for protection.  Gross is carrying a large briefcase; he is desperate to cross the bo","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b20760ee36aaa873105","adult":false,"gender":2,"id":68682,"known_for_department":"Directing","name":"Boris Sagal","original_name":"Boris Sagal","popularity":1.34,"profile_path":"/tJL5SUvaNPQXcOIIIuQxLxOZbgV.jpg"}],"guest_stars":[]},{"air_date":"1966-11-25","episode_number":10,"episode_type":"standard","id":506629,"name":"To Bell T.H.E. Cat","overview":"Night.  Andrea March is sitting at one of the restaurant's outdoor tables, on the sidewalk.  She is sketching Moonface who is sitting at another table; his bald head, thick glasses and stark features make his face unique.  Suddenly, 2 thugs show up and kill the proprietor.  Moonface and the thugs are about to run away, but there was a witness: Andrea with her sketch pad.  Moonface says, \"\"The girl-- she has my face!\"\"  (well, that didn't come out right.)  As they attack the girl, she screams for help.  Just then, Cat is driving by in his cool sportscar; he stops, gets out and beats up the bad guys, but Moonface escapes.  Andrea says, \"\"Thanks, mister.  Mister...?\"\" The man in black answers, \"\"Cat--T. Hewitt Edward Cat.\"\" (intro music)\n\nThe cops show up.  Cat is talking to Andrea who seems like a very nice, normal woman.  She tells Cat he can keep the sketch and give it to the police.  Cat seems attracted to her, and says he can be reached at the Casa del Gato.  Then McAllister shows up; he ex","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b21760ee36aaa8731e8","adult":false,"gender":0,"id":95148,"known_for_department":"Directing","name":"Sutton Roley","original_name":"Sutton Roley","popularity":1.995,"profile_path":null},{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[]},{"air_date":"1966-12-02","episode_number":11,"episode_type":"standard","id":506630,"name":"Curtains for Miss Winslow","overview":"Night.  Cat enters a large, deserted theatre.  Cat goes downstairs to the huge prop room, and runs into a man who says he is Dario Marzoni, the keeper.  Almost his entire face is scarred, and he wears dark glasses, long hair and a large moustache; he also has a slight hunchback, and a limp.  This man takes Cat to Felicia Winslow, a lady around 50; she was a famous actress, now retired.  Her young protege Chris is the one who sent for Cat.  Winslow's dog has been killed and placed in a casket, as a threat to her.  Miss Winslow tells Cat someone intends to kill her.  She asks, \"\"Will you save me?\"\"  Cat nods.  Miss Winslow is relieved; then she asks, \"\"And what is your name?\"\"  He answers, \"\"Cat-- T. Hewitt Edward Cat.\"\" (intro music)\n\nCat asks Miss Winslow who might want to kill her.  She says that 20 years ago, her husband Wallace Lancaster killed her leading man (out of jealousy, we suspect).  Lancaster got 20 years in prison, and was just released; (we assume she divorced him sometime when","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b21760ee36aaa873207","adult":false,"gender":2,"id":1213157,"known_for_department":"Directing","name":"Herschel Daugherty","original_name":"Herschel Daugherty","popularity":2.17,"profile_path":null},{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[]},{"air_date":"1966-12-09","episode_number":12,"episode_type":"standard","id":506631,"name":"King of the Limpets","overview":"An assassin dressed like a sailor walks up to the El Pescador (fisherman) Cafe, there are hotel rooms upstairs.  In a hotel room, Vasco and another man quickly try to smuggle a boy (Victor) to safety, downstairs and out the back way.  But downstairs in the cafe, the assassin stabs Vasco in the back.  Our hero shows up, and there's a Cat fight; the assassin winds up with a sword in his gut.  Vasco is lying injured on the floor, and says to Cat, \"\"I owe you 2 lives, my own and the boy's.  Maybe only one life.  A debt I acknowledge, Señor...?\"\"  The man in black answers, \"\"Cat--T. Hewitt Edward Cat.\"\" (intro music)\n\nLater, at the Casa del Gato, Pepe has housed the boy upstairs in one of his rooms; it's an hour before the Casa opens for business.  The beautiful Terese Blanchert asks Cat to take care of the boy, and gives him an envelope full of money.  But she refuses to answer any questions: who the boy is, who is trying to kill him.  Cat gives her back her money; but for the sake of the boy,","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b20760ee36aaa873105","adult":false,"gender":2,"id":68682,"known_for_department":"Directing","name":"Boris Sagal","original_name":"Boris Sagal","popularity":1.34,"profile_path":"/tJL5SUvaNPQXcOIIIuQxLxOZbgV.jpg"},{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[]},{"air_date":"1966-12-16","episode_number":13,"episode_type":"standard","id":506632,"name":"The System","overview":"Cat breaks in to the top floor of a large building.  It is a museum-- a dungeon of sorts, with wax figures, suits of armor, medieval weapons and torture devices.  Cat unties an elderly gentleman with a German accent, who asks, \"\"Lisa-- she sent you to find me?\"\"  Cat picks up a medieval ball-and-chain battle mace and clobbers a crook.  (ugh!)  The elderly gentleman is impressed, and says, \"\"With you to help, I might still have a chance.  But who are you?\"\" The man in black answers, \"\"Cat--T. Hewitt Edward Cat.\"\" (intro music)\n\nIn one of the upstairs rooms at the Casa del Gato, where Pepe is forever offering a safe haven to people in need, Pepe is playing chess with the man Cat rescued: Max Heller, who is a scientist and a mathematical genius.  Cat brings in Max's young daughter Lisa, and there is a heartwarming reunion.  Later, in the downstairs cafe, Cat and Lisa enjoy some of Pepe's fine brandy.  Lisa talks of growing up in the desolation and destruction after the War; then she and her fath","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1966-12-23","episode_number":14,"episode_type":"standard","id":506633,"name":"The Canary Who Lost His Voice","overview":"The jazz band is playing at the Casa del Gato.  A beautiful woman, Christine Martell, is nervous and wants Cat to protect someone; she gives Cat a blank check.  He asks, \"\"Do I fill it out before or after?\"\"  On the back of the check is written: Joey Crato -- Luna Arcade.  Cat goes there, and enters Joey's Antique Shop, which is dark and deserted.  Suddenly, a man wearing a red fez starts blasting with a chopper-- he hits a row of antiques and the windows, and misses Cat by a mile.  Outside, Fetlock is sitting in the back-seat of a car, being chauffeured by a man wearing a turban; Fetlock uses his car phone to call the shop.  Inside the shop, the man wearing the fez goes to answer the phone; he gets the cat's-claw knife thrown through his heart.  Cat picks up the phone and hears, \"\"This is Fetlock.  Is he dead?\"\"  Cat answers, \"\"If you mean Joey Crato, he's not in.\"\"  A surprised Fetlock asks, \"\"Who is this?  What is your name?\"\"  The man in black answers, \"\"The name is Cat--T. Hewitt Edward Ca","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b21760ee36aaa87324e","adult":false,"gender":2,"id":15705,"known_for_department":"Directing","name":"Joseph Pevney","original_name":"Joseph Pevney","popularity":1.607,"profile_path":"/ySLp7BvShA5uA7JXqYiwd3VoRCE.jpg"},{"job":"Sound Recordist","department":"Sound","credit_id":"5cefdc4392514169fdb922c8","adult":false,"gender":2,"id":2315134,"known_for_department":"Sound","name":"Earl Schwarz","original_name":"Earl Schwarz","popularity":1.012,"profile_path":null}],"guest_stars":[]},{"air_date":"1966-12-30","episode_number":15,"episode_type":"standard","id":506634,"name":"The Ring of Anasis","overview":"Early afternoon, Cat is on a bodyguard assignment.  Cat is in yet another one of those strange, fortress-like mansions, and his client is an eccentric millionaire, Tony Webb, who is rather wimpy.  Webb has a gigantic collection of exotic artifacts and rare, primitive weapons and statues.  At the moment, he is practicing with a blowgun; Webb states flatly, \"\"A man who expects hourly to be struck down-- murdered-- should practice.\"\"  Cat throws a spear into the wall, showing he is quite skilled at handling weapons, too.  Webb says, \"\"I take it then you must be the one Lisa hired to protect me.\"\"  Then Webb asks, \"\"Who are you?\"\" The man in black answers, \"\"The name is Cat--T. Hewitt Edward Cat.\"\" (intro music)\n\nCat notes that the spear he holds, and the blowgun Webb holds, are both Aganté: made by a tribe of pygmies in the middle Amazon.  Webb says the pygmies use the darts to kill jaguars; Cat points out that each blowgun dart is curare (poison) tipped.  (who would win in a battle of spear vs. b","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b21760ee36aaa87326d","adult":false,"gender":2,"id":10146,"known_for_department":"Directing","name":"Jacques Tourneur","original_name":"Jacques Tourneur","popularity":3.97,"profile_path":"/o3Du8pFBlQ22JXGTVw9IB9yKVuC.jpg"},{"job":"Writer","department":"Writing","credit_id":"63eff8d0a24c5000800b2969","adult":false,"gender":2,"id":94773,"known_for_department":"Writing","name":"Herman Miller","original_name":"Herman Miller","popularity":1.286,"profile_path":null}],"guest_stars":[{"character":"Lisa Lawrence","credit_id":"63eff8e6a6725400865c9052","order":506,"adult":false,"gender":0,"id":1461970,"known_for_department":"Acting","name":"Marilyn Devin","original_name":"Marilyn Devin","popularity":0.6,"profile_path":"/gIXBsIPMmsvBTZ8RFnwjQYCwZBP.jpg"},{"character":"Tony Webb","credit_id":"63eff900a24c5000a13bf05a","order":507,"adult":false,"gender":2,"id":10775,"known_for_department":"Acting","name":"William Daniels","original_name":"William Daniels","popularity":14.999,"profile_path":"/1SCR6im2maiASfTD5h7r0g9dU78.jpg"},{"character":"Julie Roth","credit_id":"63eff90ea6725400c9f2307f","order":508,"adult":false,"gender":1,"id":50972,"known_for_department":"Acting","name":"Michele Carey","original_name":"Michele Carey","popularity":6.099,"profile_path":"/g1gEz4DyCR50nxph3xDRYTBY9Ui.jpg"}]},{"air_date":"1967-01-06","episode_number":16,"episode_type":"standard","id":506635,"name":"Queen of Diamonds, Knave of Hearts","overview":"(intro narration)  Night, on a millionaire's estate.  Cat climbs to the 2nd story of the mansion, and sneaks into a bedroom; immediately a beautiful woman, who was hiding behind the curtains, holds a small gun to the back of Cat's head.  She says facetiously, \"\"Turn and face your punishment.\"\"  Cat quips, \"\"A punishment fit for a king.\"\"  The lady is his long-time friend, the Countess De Laurent; Cat kisses her.  The Countess, with her charming foreign accent, tells Cat why she sent for him.  She has been married for many years now to a rich American, Robert Lampson.  But 3 years ago, she foolishly had a dalliance with that suave knave Gordon Amley, whom she describes as \"\"handsome and dashing.\"\"  When they broke up, Gordon blackmailed her: he threatened to tell her husband about their affair.  She gave him a $50,000 diamond necklace, for his silence.\n\nThe Countess had an excellently-crafted copy of the diamond necklace made; she is wearing the copy now.  Trouble: her husband is having all th","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b20760ee36aaa873105","adult":false,"gender":2,"id":68682,"known_for_department":"Directing","name":"Boris Sagal","original_name":"Boris Sagal","popularity":1.34,"profile_path":"/tJL5SUvaNPQXcOIIIuQxLxOZbgV.jpg"}],"guest_stars":[]},{"air_date":"1967-01-13","episode_number":17,"episode_type":"standard","id":506636,"name":"A Hot Place to Die","overview":"(intro narration)  David Benton and the beautiful Crystal Pierson are in the blazing desert, in their convertible.  They stop at a filling station.  David is nervous; he has a suitcase, and was supposed to meet a man there.  Crystal says worriedly that Percy Hagan probably stopped the man.  As they start to drive on, a long car cuts in front of them.  It's 2 of Hagan's armed goons.  They tell Benton to turn around and follow them back to the casino.  (so this is probably outside Las Vegas, Nevada).  Later, as they're driving along, Cat speeds up in his sportscar, and runs the hoods off the road.  Cat leaves his car there, and hops into the driver's seat of Benton's convertible; Cat was the man Benton was supposed to meet.\n\nBenton was an accountant for Hagan, but 6 months ago he saw Hagan brutally murder a man over an unpaid gambling debt.  Benton has 6 month's worth of evidence in his suitcase, enough to nail Hagan for murder, extortion and income tax evasion.  Crystal was Hagan's girlf","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52582b21760ee36aaa87329f","order":501,"adult":false,"gender":2,"id":12312,"known_for_department":"Acting","name":"Richard Anderson","original_name":"Richard Anderson","popularity":16.01,"profile_path":"/AiAPSDhMNu7zoZRngj8dISNk1rA.jpg"}]},{"air_date":"1967-01-20","episode_number":18,"episode_type":"standard","id":506637,"name":"A Slight Family Trait","overview":"(intro narration) Night.  A luxury liner, the Princess Louise, is docked.  There is a huge party on board-- but there is also at least one uninvited guest: the Cat.  The man in black sneaks into a forward cabin, and finds a beautiful young woman in black (Blossom) has just picked a wall-safe.  She guesses correctly that her mother had sent for Cat to stop her.  Then Cat struggles with her as he forces her out of the room, for her own safety.  Ironically, it is Cat who is caught by 2 armed guards: Vincent and Bayo.  Blossom escapes.\n\nVincent and Bayo are actually nothing more than thugs, working for the crooked, dethroned King Delphine.  They take Cat to the King's private room, and the King asks Cat who he works for.  When Cat refuses to talk, Vincent suggests that when they are out to sea: a few bullets in Cat's head, and then throw him to the sharks.  Cat retorts that in America, even a burglar has rights; and his friends would go to the police if he doesn't return.  Since the former","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b20760ee36aaa873105","adult":false,"gender":2,"id":68682,"known_for_department":"Directing","name":"Boris Sagal","original_name":"Boris Sagal","popularity":1.34,"profile_path":"/tJL5SUvaNPQXcOIIIuQxLxOZbgV.jpg"}],"guest_stars":[]},{"air_date":"1967-01-27","episode_number":19,"episode_type":"standard","id":506638,"name":"If Once You Fail","overview":"(intro narration)  Night.  Cat is driving his sportscar, and dropping off the lovely Dr. Kathryn DeVrees at the Country Hospital where she works.  They have a long kiss; Cat is in love with her, this time it's serious.  After Cat drives away, a gunshot rings out; a man is shot.  Kathryn kneels over him and gives him first aid, but he dies in her arms.  Then she looks up and sees the face of the killer: Juan Sonorrito; since she could now identify him, he must kill her, too.  But as a doctor and some nurses rush out, the killer disappears for now.  He will be back.\n\nCat is in Kathryn's bedroom, the penthouse on the 30th floor.  Cat kisses her goodnight; he will guard her apartment all night.  In the living room, McAllister talks to Cat; McAllister says Kathryn can testify, the other witness is dead.  Joseph Reinhoff hired the killer, and Kathryn's testimony will put him away; Reinhoff will be finished, as will half the criminals in the city.  Cat wants to be the lone guard in her apartme","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1967-02-03","episode_number":20,"episode_type":"standard","id":506639,"name":"Design for Death","overview":"(intro narration) There is a fashion show at some ritzy club.  It is being presided over by Claudine Peyser, wearing a divine silver lamé outfit-- she's an attractive woman, but with a stern face (and whose irritating singsong voice sounds like she is doing a bad Phyllis Diller impression), \"\"LOOK at them, EMPty headed little VIXens.  GREGory, reMIND me to send some ROses to that SEAMstress in PARis who got us into SAN SIOUX's showing... you wouldn't beLIEEEVE PARis.\"\"  Gregory Tyrole is her weirdo sidekick, wearing glasses indoors; (he's the actor who played the lunatic Cosmo in episode #10).  Cat shows up, looking out of place at this showing of Paris fashions, and orders a vodka on the rocks from the bartender (rare for Cat to drink on the job).\n\nCat talks to Valerie Evans, she hires the models for Claudine, at the exorbitant cost of $25 per hour (this is 1967 prices); Valerie makes a date with Cat for later that evening, a quiet dinner for two.  Shortly thereafter, in the dressing roo","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1967-02-10","episode_number":21,"episode_type":"standard","id":506640,"name":"Matter Over Mind","overview":"(intro narration)  Night.  The scene opens with yet another of those weird, fortress-like mansions that are so prevalent in this series; inside there are exotic artifacts: ancient statues of samurais and a creature with 4 horns, arcane spell books (an entire occult library), and a skull which is also an incense burner.  Leo Seraf, a gangster in his late 60s, is forcing psychic Maya Leandro to do a seance-- at gunpoint.  Leo's armed thug Connie has Maya and her brother Carl covered.  Leo demands to know who is trying to kill him-- it's the one who killed his partner Phillip, isn't it?  Maya moans and groans, and then says it is the man in black: T. Hewitt Edward Cat.\n\nThe next night, outside the Casa del Gato, Connie and 2 other thugs fire at Cat and miss; Cat hops into his sportscar and follows them, to the \"\"5 Deuces Club\"\" (that sounds crooked).  Maya and Carl Leandro are the headliners, with their mind-reading act.  After the show, Cat confronts Maya in her dressing room; they are old","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b20760ee36aaa873105","adult":false,"gender":2,"id":68682,"known_for_department":"Directing","name":"Boris Sagal","original_name":"Boris Sagal","popularity":1.34,"profile_path":"/tJL5SUvaNPQXcOIIIuQxLxOZbgV.jpg"}],"guest_stars":[]},{"air_date":"1967-02-17","episode_number":22,"episode_type":"standard","id":506641,"name":"The Blood-Red Night","overview":"(intro narration)  Daytime.  Cat is called to the mansion of Amelia Ferret, a rich lady in her late 70s.  She fears for her life because of a large, rare ruby she wears, the \"\"sangre de Cristo\"\" (blood of Christ) ruby.  She tells Cat the ruby has an evil power.  Her father gave it to her mother; 2 days later she died.  Amelia wore it on her wedding day; her fiancé died, and she became a spinster.  It has brought nothing but death; she was afraid to sell the ruby, since it would bring death to the new owner and guilt to her.  Now, after all these decades, she is going to shatter the evil spell: a jewel-cutter will fragment the ruby into 3 stones.  Then the small rubies will be sold, and the money (a sizable sum) will be given to charity.\n\nThe beautiful Gail Ogden tells Cat that death threats have been phoned in, warning them not to cut the ruby; the phone rings and Cat hears another threat himself.  Amelia says they will all be safe at Carver Parmiter's ranch in the desert, which is where","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b22760ee36aaa873312","adult":false,"gender":2,"id":31503,"known_for_department":"Acting","name":"Bert Freed","original_name":"Bert Freed","popularity":2.77,"profile_path":"/2TLuIMSx3NaCgfhoQBsicbdEIBE.jpg"}],"guest_stars":[{"character":"Gail Ogden","credit_id":"63d5cd5812b10e00de5b73ab","order":503,"adult":false,"gender":1,"id":15961,"known_for_department":"Acting","name":"Antoinette Bower","original_name":"Antoinette Bower","popularity":8.458,"profile_path":"/iwku24YPaqrtGfvjk0oSq9eCpTz.jpg"},{"character":"Stoddard","credit_id":"63d5cd6b12b10e007fdaeefc","order":504,"adult":false,"gender":2,"id":103789,"known_for_department":"Acting","name":"Don Barry","original_name":"Don Barry","popularity":7.433,"profile_path":"/A4huH027Zvo1sgi3Ym5RetBAvve.jpg"},{"character":"Killer","credit_id":"63d5cd7d955c650084792a5a","order":505,"adult":false,"gender":2,"id":2454,"known_for_department":"Acting","name":"Matt Clark","original_name":"Matt Clark","popularity":12.004,"profile_path":"/n5TJz5CaTqRXLpAOl0wHJXrPQOk.jpg"}]},{"air_date":"1967-02-24","episode_number":23,"episode_type":"standard","id":506642,"name":"The Ninety Percent Blues","overview":"(intro narration)  Gangster Milo Andrade, along with 2 of his thugs, is having a meeting in his penthouse apartment with handsome, young black comedian Timmie Taylor.  In front of them is a 10-gallon aquarium filled with piranha, their teeth \"\"sharper than razors.\"\"  Milo tells Timmie to sign the management contract: 90% for Milo, 10% for Timmie-- no wonder Timmie has got The Ninety Percent Blues.  When Timmie refuses, Frankie Welles and the other thug grab him, and force his hand into the piranha tank-- but only for a second, as a warning.  One thug forces Timmie into the next room.  Then Cat silently enters the room, knocks out Frankie Welles and throws him across a table.  Cat sneaks Timmie out, and to safety.\n\nThat night, at a nightclub, Timmie is doing his act: dancing with a 4-piece band (bass guitar, horn, drums and piano) and telling jokes-- \"\"My friend was on a far-out diet.  For 3 weeks all he ate was bananas.  He didn't lose any weight, but man, you should see him climb trees!\"\"","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b22760ee36aaa873331","adult":false,"gender":2,"id":112567,"known_for_department":"Directing","name":"Harry Harris","original_name":"Harry Harris","popularity":3.842,"profile_path":null}],"guest_stars":[]},{"air_date":"1967-03-10","episode_number":24,"episode_type":"standard","id":506643,"name":"The Long Chase","overview":"(intro narration)  Night.  Dozens of policemen are having a big shootout with escaped convict Laurent, who is holed up in a large steel works plant.  2 officers are dead; Lieutenant Lassiter has sent for Cat.  Lassiter explains to Cat that they can't rush Laurent, he has a hostage: nurse Valerie.  Cat is an expert at high steel and high wires; so is Laurent.  Complicating matters is the fact Laurent once saved Cat's life; Cat figures he still owes him, and will try to take him alive.\n\nDaylight.  Laurent, armed with a high-powered rifle and a gun, is somewhere on the upper floors of a factory building, which consists of steel girders and exposed pipes (no walls, as if it were still under construction).  The police fire to create a diversion, but Laurent sees Cat enter the site.  Cat, silently as a panther, prowls about the upper stories-- but Laurent still manages to sneak up behind Cat and get the drop on him.  Cat says he comes as a friend; Laurent retorts, \"\"To capture me and lock me b","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1967-03-24","episode_number":25,"episode_type":"standard","id":506644,"name":"Twenty-One and Out","overview":"(intro narration)  Daytime.  Undercover cop Joe is bringing groceries, and a couple of books to read, to lovely Laurie Neal-- she's holed up in a room in 2-story motel, as part of a witness protection program.  (She's been shuttled from one safe spot to another for 7 months now.)  Suddenly, a car speeds by and fires at some undercover cops stationed outside; they return the fire, but then a bomb blasts through Laurie's window.  Later, Lieutenant Lassiter puts Laurie up in a backroom at the Casa del Gato; he also sends for Cat, who is an old friend of Laurie's.  They will have a federal indictment against mobster John Radek within 48 hours, if Laurie stays alive to testify-- Radek has put a $200,000 price on her head.\n\nCat meets with Radek in his private office; Radek owns and runs a big gambling casino.  Cat tells Radek to take his bounty off Laurie; Radek says Laurie was his secretary, and then told a grand jury he was into narcotics-- and without Laurie, they have no case.  Cat makes","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b22760ee36aaa873361","adult":false,"gender":2,"id":47370,"known_for_department":"Directing","name":"Paul Stanley","original_name":"Paul Stanley","popularity":2.209,"profile_path":null}],"guest_stars":[]},{"air_date":"1967-03-31","episode_number":26,"episode_type":"finale","id":506645,"name":"Lisa","overview":"(intro narration)  Night.  A man is running away, he's being chased by 2 goons in a Rolls Royce.  In the alley behind the Casa del Gato, the hoods (dressed as cops) get out of the car and shoot the man.  Cat whales into the crooks, but they escape.  Pepe asks Cat if he knows the murdered man; Cat doesn't, but the dead man had a note with Cat's name on it.\n\nCat goes to meet Lisa, a beautiful woman around 30; she is on the 6th floor terrace of a swanky hotel.  \"\"You got my message,\"\" Lisa says, as she offers Cat some champagne and they sip it together.  Cat reminds his felonious friend, \"\"The last time you sent me a message, you cost me 50,000 pesetas.\"\" (about $312)  Cat tells her the man who delivered her message is dead; she says he was \"\"a dear friend\"\" yet seems remarkably unconcerned with his death.  Cat quips her friends have a high mortality rate; and even as Lisa tells Cat of her latest $1.5-million larceny, she has drugged his champagne.  When Cat wakes up, he is greeted by General Bu","production_code":"","runtime":30,"season_number":1,"show_id":13823,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582b22760ee36aaa873380","adult":false,"gender":2,"id":117865,"known_for_department":"Directing","name":"Jud Taylor","original_name":"Jud Taylor","popularity":5.189,"profile_path":"/27HKQcfeY2jZvFF0D5XvVht0nSC.jpg"}],"guest_stars":[]}],"name":"Season 1","overview":"","id":24992,"poster_path":"/1xUsMwgMh0ke8eY9k64Nn04Empe.jpg","season_number":1,"vote_average":0}}}