{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"1952-10-26","genres":[{"id":99,"name":"Documentary"},{"id":10768,"name":"War & Politics"}],"homepage":"","id":13890,"in_production":false,"languages":["en"],"last_air_date":"1953-05-03","last_episode_to_air":{"id":508461,"name":"DESIGN FOR PEACE: Surrender of Japan & aftermath of war","overview":"The atomic bomb is detonated, and its effects demonstrated at Hiroshima and Nagasaki. With that, Japan surrenders, and their country's diplomats and military officials sign the official surrender documents aboard the USS Missouri. The U.S. armed forces come home to signs saying, \"Welcome Home\" before they are greeted by mothers, wives, children and fellow neighbors. But before the series come to a close, there is one last parade to march in their honor.","vote_average":5,"vote_count":2,"air_date":"1953-05-03","episode_number":26,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/jDbP3mJEQajNBo7tpVMEVauyKqF.jpg"},"name":"Victory at Sea","next_episode_to_air":null,"networks":[{"id":6,"logo_path":"/cm111bsDVlYaC1foL0itvEI4yLG.png","name":"NBC","origin_country":"US"}],"number_of_episodes":26,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Victory at Sea","overview":"Victory at Sea is a documentary television series about naval warfare during World War II that was originally broadcast by NBC in the USA in 1952–1953. It was condensed into a film in 1954. Excerpts from the music soundtrack, by Richard Rodgers and Robert Russell Bennett, were re-recorded and sold as record albums. The original TV broadcasts comprised 26 half-hour segments—Sunday afternoons at 3pm in most markets—starting October 26, 1952 and ending May 3, 1953. The series, which won an Emmy award in 1954 as \"best public affairs program\", played an important part in establishing historic \"compilation\" documentaries as a viable television genre.  \n\nOver 13,000 hours of footage gathered from US, British, German and Japanese navies during World War II were perused in the making of these compelling episodes.","popularity":11.337,"poster_path":"/2aIFcJ7C2e5LQjfxIOcs3QtxBWC.jpg","production_companies":[{"id":12851,"logo_path":null,"name":"Mill Creek Entertainment","origin_country":""}],"production_countries":[],"seasons":[{"air_date":"1952-10-26","episode_count":26,"id":25104,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":5.1}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":5.8,"vote_count":5,"season_data":{"1":{"_id":"52582c0c760ee36aaa88863a","air_date":"1952-10-26","episodes":[{"air_date":"1952-10-26","episode_number":1,"episode_type":"standard","id":508436,"name":"DESIGN FOR WAR: Battle of the Atlantic, 1939-1941","overview":"World War II comes, and Germany succeeds in invading Poland and France. But is held back by England thanks to the vital convoys, Canada and the American naval forces' initial involvement, and Lend-Lease. Still, the German submarine war increases to its crescendo thanks to new French bases.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/nbULrKNaFPwZUXlcgwEp8iLi4HO.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1952-11-02","episode_number":2,"episode_type":"standard","id":508437,"name":"THE PACIFIC BOILS OVER: Pearl Harbor, December 7, 1941","overview":"Using Japanese footage, we see the planning, execution, and ultimately the celebration of the Asian country's attack on Pearl Harbor. There's also an explanation provided for the attack and some peaceful moments depicted among the U.S. sailors before the fateful events unfold. And out of this wreckage, the bloodied U.S. Navy fleet rises up to fight another day.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/mEOl7b3tocSUdyLSiHJ5ppLYaGA.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1952-11-09","episode_number":3,"episode_type":"standard","id":508438,"name":"SEALING THE BREACH: Anti-submarine warfare, 1941-1943","overview":"With war now declared on the U.S. front, naval forces throughout the states have banded together to bring convoys of supplies across the Atlantic Ocean to our Allies in England. German U-Boats come through and manage to destroy some of ships along the way. Still, Americans are resilient...","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/gj2xI7ww16H68877swOI6lsHc27.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1952-11-23","episode_number":4,"episode_type":"standard","id":508439,"name":"MIDWAY IS EAST: Japanese victories & the Midway Battle","overview":"Japan is ascendant as it successfully invades Indonesia, Singapore and the Philippines. But the Americans draw first blood, first on the Coral Sea, and ultimately on Midway as they manage to bomb four of Japan's aircraft carriers--the same ones that participated in Pearl Harbor--making the imperial fleet retreat and giving the U.S. an incredible early victory in the pacific...","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/Ymn4hVMyhSe79EgfBakJNetu1X.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1952-11-30","episode_number":5,"episode_type":"standard","id":508440,"name":"MEDITERRANEAN MOSAIC: Gibraltar, Allied & enemy fleets, Malta","overview":"World War II comes to the Mediterranean Sea as Italian, French and British naval forces flex their muscle. British forces have the enviable position of guarding the sea as they escort convoys from Gibraltar to Malta. Still, they have their relaxing moments, especially the daily mealtimes: Morning cocoa, breakfast, dinner, tea, and supper. Meanwhile, the German Luftwaffe never fails to besiege the island of Malta, but they remain steadfastly determined to keep fighting and tough it out. Their heroism is rewarded when King George VI pays a later visit to the island, reviving their spirits.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/ntiNmB6caxTNWbt4eQvs1NDExzq.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1952-12-14","episode_number":6,"episode_type":"standard","id":508441,"name":"GUADALCANAL","overview":"After training in Australia and New Zealand, the U.S. Marines land on Guadalcanal. The U.S. Navy suffers defeat after defeat at the hands of the Japanese Navy around the island--in an area called Ironbottom Sound. Essential information is conveyed about how some deaths are caused not just by battle but also by malaria that comes from the long stays in the Guadalcanal rain forests. The number of people dying on both sides is especially emphasized here, a remarkable example of endurance. Meanwhile, to the tune of Richard Rodgers' most famous march from the series, America's men and materiel are mobilized against the ultimate struggle that is World War II.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/f9WVpTsq2RZOsSi3towd4wJ6fsn.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1952-12-21","episode_number":7,"episode_type":"standard","id":508442,"name":"RINGS AROUND RABAUL: Struggle for the Solomon Islands","overview":"The Japanese Navy is ascendant in its conquests, of which its linchpin is the main base at Rabaul in the New Britain Islands. This Victory at Sea episode refers to the US strategy of surrounding and strangling the Japanese base in the fall of 1943 through set piece invasions of its surrounding islands (Bouganville, Rendova). Praise should be given to the Seabees, which made the airfields operational in a short time, and observation planes and radar, which helped the U.S. Navy stop cold Japanese reinforcements and counterattacks.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/calCXLtVdi0WiVd4MIJeqqfeheb.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1952-12-28","episode_number":8,"episode_type":"standard","id":508443,"name":"MARE NOSTRUM: Mediterranean Command, 1940-1942","overview":"Mussolini calls the Mediterranean \"mare nostrum\"--our sea. And seeks to exploit it to the full. British and Greek military forces, however, defeat the Italians, forcing the Germans to bring in the Afrika Korps. But it is in the heroic sea battles to take over the Mediterranean that is the crux. At issue is who controls the Suez Canal in Egypt. Eventually, the Allies triumph, and proceeded to destroy the Germans in the desert.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/g0aB3qKl2O3coJDFRIFOiMBPiCX.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-01-04","episode_number":9,"episode_type":"standard","id":508444,"name":"SEA AND SAND: Invasion of North Africa, 1942-1943","overview":"The Soviet Union demand a \"second front\" as their country struggles under the might of the Nazis. The wish is granted as Roosevelt and Churchill in Casablanca agree on the first invasion at North Africa against General Rommel's forces via Operation Torch, while the Allies also neutralize many of the axis' Mediterranean supply bases. Eventually, the Germans fight back, but to no avail.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/sRvc6AtzCznosykA1MUeqacvawC.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-01-11","episode_number":10,"episode_type":"standard","id":508445,"name":"BENEATH THE SOUTHERN CROSS: War in the south Atlantic","overview":"The South Atlantic becomes a front in the overall Battle of the Atlantic, from the pursuit of the Graf Spee to the battle between HMS Devonshire and the German raider Atlantis. The Allies, meanwhile, nurture their ties to South America and gained a vital base in Ascension Island. Despite deep rooted Nazi sympathy, the South American nations rallied to the Allies' cause, securing vital bases, forces, and resources.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/vlcL7ifPztfQu17pSfk2e1DyzB6.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-01-18","episode_number":11,"episode_type":"standard","id":508446,"name":"THE MAGNETIC NORTH: War from Murmansk to Alaska","overview":"This episode of Victory at Sea explores the battles between the Allies and Germans over the Arctic Circle, and the convoys battling past Nazi-occupied Norway to Russia. Meanwhile, Japan unsuccessfully invades Alaska, and the U.S. Navy again is called to guard this vital area amidst the toughest climate and vast vistas.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/v9W6OPkJu53aENRRh7j6tn7ZSDN.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-01-25","episode_number":12,"episode_type":"standard","id":508447,"name":"THE CONQUEST OF MICRONESIA: Carrier warfare--Gilberts and Marshalls","overview":"The ubiquitous aircraft carrier of the U.S. Navy goes into the attack in the Central Pacific at the Gilberts and Marshalls, destroying Japanese installations and taking the fight to the enemy. But for all of these, there is a price to pay for victory in men and materiel.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/yWQ7mohQ9zsLTtYVaK3ovZTqkb8.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-02-01","episode_number":13,"episode_type":"standard","id":508448,"name":"MELANESIAN NIGHTMARE: New Guinea campaign","overview":"The Allies are victorious in New Guinea as they repel the Japanese. They thus bring the fight through a series of island-hopping offensives using a new ship--the slow but vital LST. The price paid is high in both sides, but as Japanese casualties pile up in their never-ending losing battle against the Allied onslaught, their homeland only hears news of their victory being broadcast on the radio. We see also just how Japan's people are suffering in defeat through a very touching scene of a massive funeral at the conclusion of this segment, providing a balance of how universal grief truly is.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/ourh4EWRSd0LTAgdrw5M97gOTew.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-02-08","episode_number":14,"episode_type":"standard","id":508449,"name":"ROMAN RENAISSANCE: Sicily and the Italian campaign","overview":"While Hitler's Germany starts its decline, Mussolini's Italy falls. Eventually, as destruction is heaped upon Naples and Rome, Italy accepts defeat and surrenders, allowing the allied forces to liberate their people. But the conflict grinds to a slow ruinous campaign (Salerno, Cassino, Anzio) until final victory is achieved by the liberation of Rome, where ecstatic Romans celebrate freedom waving American flags, and the Pope addressing the audience...","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/wuI1jVUTfG8AxJd6FH0x4XBL3G3.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-02-15","episode_number":15,"episode_type":"standard","id":508450,"name":"D-DAY: Normandy","overview":"The Allied invasion of Normandy--from preparation to execution--is detailed to very compelling effect courtesy of vintage footage from both sides. One of the most important turning points for victory from the Allied side. Perhaps one of the most exciting episodes of the entire Victory at Sea series--the pivotal moment of World War II in Europe.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/A0nPRHtuM0tE4fXnyoB6qJQIULe.jpg","vote_average":5.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-02-22","episode_number":16,"episode_type":"standard","id":508451,"name":"KILLERS AND THE KILL: Victory in the Atlantic, 1943-1945","overview":"The U-Boats are ascendant, and their triumphs trumpeted over Germany. But the Allies hit back with new bases in lands bordering the Atlantic Ocean, new antisubmarine techniques, and the new escort, or \"jeep\", carrier. Thus, the neutralization and destruction of the German U-Boat forces is guaranteed.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/hpWaw3RlXc8qQwjAWt8pDjaMK5m.jpg","vote_average":6,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-03-01","episode_number":17,"episode_type":"standard","id":508452,"name":"THE TURKEY SHOOT: Conquest of the Marianas","overview":"Guam, a U.S. territory, gets invaded by Japan a few days after Pearl Harbor and remains under occupation for two and a half years before the Americans arrive to take Saipan and Guam back, and finished off as well the Japanese fleet in a classic \"turkey shoot\". The Guamanians are thankful as expressed on their smiling faces, making it one of the most inspiring segments of Victory at Sea. Meanwhile, the Americans are preparing the bases in the islands as well as in other areas of the Marianas for the ultimate bomber offensive against Japan.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/6AE3zcpDIPGAPblT1rL4zExIrZo.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-03-08","episode_number":18,"episode_type":"standard","id":508453,"name":"TWO IF BY SEA: Peleliu and Angaur","overview":"Before the Philippines, the United States first attacks Peleliu and Anguar. Through communiques, we follow the bloody battle in its ferocity.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/too9TcmtHFQfVOG3LA8dUZR7jGU.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-03-15","episode_number":19,"episode_type":"standard","id":508454,"name":"BATTLE FOR LEYTE GULF: Sea battle for Leyte Gulf","overview":"The Japanese fleet is fast disappearing, and the Imperial Navy conducts its last major operation in the Philippines. It ends in debacle: The risen battleships of Pearl Harbor avenge the attack in Surigao Strait, the Center Force is defeated in Sibuyan Sea, the jeep carriers and destroyers heroically fend off a stronger Japanese force near Samar, and their remaining aircraft carriers were sunk. This Victory at Sea segment marked the counting of the days until the Japanese would accept defeat and surrender to the allies.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/x2MmIFjzm0pOmqkDlYQWpbjDjMw.jpg","vote_average":6,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-03-22","episode_number":20,"episode_type":"standard","id":508455,"name":"RETURN OF THE ALLIES: Liberation of the Philippines","overview":"Just after the U.S. entered World War II, the Japanese conquered the Commonwealth of the Philippines, an American protectorate, bringing despair to its people. But they still hope, and in January of 1945, these were answered as much of the Philippines were liberated and its people cheered the Americans. Their liberation became bloody as they fought their way in Manila, but still they cheered. A touching tribute to the will of the Philippine people to survive as they waited for liberation--and their eventual independence a year later.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/pfzyd8fGbFCmxvpnEPdQcD0eWnb.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-03-29","episode_number":21,"episode_type":"standard","id":508456,"name":"FULL FATHOM FIVE: U.S. submarines","overview":"In this episode of Victory at Sea, we see how the U.S. Navy's submarines contributed to the Japanese empire's downfall, sinking thousands of tons of ships, and strangling the Japanese. We see footage of ship upon ship from the House of the Rising Sun destroyed. But a price is paid for those whom the U.S. Navy classifies as \"did not return\".","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/tVilUyDvol4kVKgpHO1Ssh1V2B5.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-04-05","episode_number":22,"episode_type":"standard","id":508457,"name":"THE FATE OF EUROPE: Black Sea, south of France, surrender","overview":"Sevastopol was liberated, and the Allies finally crush Germany. We also witness the meeting of Roosevelt, Churchill, and Stalin on final plans for Germany's surrender and the forming of the United Nations. At the end, Hitler commits suicide, and Nazi flags are torn apart and German military uniforms and hats lie on the ground like discarded garbage. However, compelling footage of German cities in ruins make this one of the most triumphant as well as somewhat somber episodes of Victory at Sea.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/1nFqlMFu4S0IpEtsR9IAwkYvtyR.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-04-12","episode_number":23,"episode_type":"standard","id":508458,"name":"TARGET SURIBACHI: Iwo Jima","overview":"The United States fought two battles here--the U.S. Marines at Iwo Jima against the Japanese, and the U.S. Navy against the typhoon. During the now-legendary events depicted in this episode, we reach the final throes of battle in the Pacific war against Japan. And as the scene of the recent Mount Suribachi memorial appears, we are once again reminded of the price that comes before true victory can be achieved.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/5KWa0IAfs88Dfo2UFA5sSsdHTTA.jpg","vote_average":5.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-04-19","episode_number":24,"episode_type":"standard","id":508459,"name":"THE ROAD TO MANDALAY: China, Burma, India, and Indian Ocean","overview":"Japan invades China in 1936, but the Japanese are not satisfied, and they began to invade Indochina and Thailand, paving the way for the invasion of Burma. The U.S. and British Navies nurture their relations with the Indian Navy as supplies are building up for the return back. Eventually, it was decided to build a road to link up with the Burma Road, and with human and elephant power, they succeeded. Eventually, they \"came back to Mandalay\", and the first supplies traveled the road to hordes of cheering Chinese.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/4F721TY35AdC40r3BM47Bp34Yxd.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-04-26","episode_number":25,"episode_type":"standard","id":508460,"name":"SUICIDE FOR GLORY: Okinawa","overview":"In one last ditch effort at glory, having lost most of their best men in military actions, Japan employs suicide pilots--the Kamikaze--men who would willingly crash their planes into ships in order to destroy the American spirit. But the U.S. Navy and Marines are ready for them with their guns, and they fought heroically against the onslaught. And on Okinawa, Americans fight a major battle with the Japanese Army.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/ohNiKFDZxxJDDQXe701J66DynLg.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1953-05-03","episode_number":26,"episode_type":"finale","id":508461,"name":"DESIGN FOR PEACE: Surrender of Japan & aftermath of war","overview":"The atomic bomb is detonated, and its effects demonstrated at Hiroshima and Nagasaki. With that, Japan surrenders, and their country's diplomats and military officials sign the official surrender documents aboard the USS Missouri. The U.S. armed forces come home to signs saying, \"Welcome Home\" before they are greeted by mothers, wives, children and fellow neighbors. But before the series come to a close, there is one last parade to march in their honor.","production_code":"","runtime":30,"season_number":1,"show_id":13890,"still_path":"/jDbP3mJEQajNBo7tpVMEVauyKqF.jpg","vote_average":5,"vote_count":2,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":25104,"poster_path":null,"season_number":1,"vote_average":5.1}}}