{
    "adult": false,
    "backdrop_path": "/uKmpcdbXBP6C9yPesKNo3bCvjyE.jpg",
    "created_by": [],
    "episode_run_time": [
        20,
        42
    ],
    "first_air_date": "2021-11-28",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "https://www.history.com/shows/the-toys-that-built-america",
    "id": 139096,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2023-12-17",
    "last_episode_to_air": {
        "id": 4972312,
        "name": "Most Valuable Toys",
        "overview": "From Lionel Trains to video games, for the right collector our cherished childhood toys can be worth millions! Over the last three decades, people have paid some truly outrageous prices to get their hands on that elusive toy they always wanted.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2023-12-17",
        "episode_number": 12,
        "episode_type": "standard",
        "production_code": "",
        "runtime": 20,
        "season_number": 3,
        "show_id": 139096,
        "still_path": "/AdhQWsJPOqcb0vp5d1YjeBhhxn4.jpg"
    },
    "name": "The Toys That Built America",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 65,
            "logo_path": "/9fGgdJz17aBX7dOyfHJtsozB7bf.png",
            "name": "History",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 26,
    "number_of_seasons": 3,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "The Toys That Built America",
    "overview": "This four-part docuseries showcases visionaries such as the Parker Brothers, Milton Bradley and Ruth Handler who transformed a small toy company into the billion-dollar empire now known as Mattel. It reveals the little-known stories behind groundbreaking innovations like the Frisbee® and accidental discoveries like how the Slinky was created.",
    "popularity": 6.916,
    "poster_path": "/3LpXhboCuDfJik0HRCskwohptCU.jpg",
    "production_companies": [
        {
            "id": 124386,
            "logo_path": "/oXVJwTOYWTNkYwkF8T509esZH38.png",
            "name": "Six West Media",
            "origin_country": "US"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "US",
            "name": "United States of America"
        }
    ],
    "seasons": [
        {
            "air_date": "2021-11-28",
            "episode_count": 4,
            "id": 220264,
            "name": "Season 1",
            "overview": "",
            "poster_path": "/3LpXhboCuDfJik0HRCskwohptCU.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2022-10-23",
            "episode_count": 10,
            "id": 285957,
            "name": "Season 2",
            "overview": "",
            "poster_path": "/xezZNbKqNXLVDEjvXiAKRgYG1BK.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2023-10-15",
            "episode_count": 12,
            "id": 359784,
            "name": "Season 3",
            "overview": "This season turns the lens on an exciting new selection of bold visionaries and creators behind history’s biggest-selling toys, games, and action figures as they build billion-dollar empires against the backdrop of a changing world in the 20th century.",
            "poster_path": "/dDqF7lGmGhTpha08D3x2KqreYxJ.jpg",
            "season_number": 3,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 7,
    "vote_count": 9,
    "season_data": {
        "1": {
            "_id": "619867105c071b002a7dbbea",
            "air_date": "2021-11-28",
            "episodes": [
                {
                    "air_date": "2021-11-28",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3345777,
                    "name": "Masters of Invention",
                    "overview": "During World War II, a naval engineer accidentally creates an iconic spiral toy that walks downstairs. At the same time, an engineer is trying to invent a synthetic rubber for the war effort and instead creates a strange putty that becomes another world-famous toy.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 139096,
                    "still_path": "/6sHcrwZ9LwBJn46pzoJindPOIP8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-12-05",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3345778,
                    "name": "Clash of the Toy Titans",
                    "overview": "As the post-war baby boom creates unprecedented demand for toys, Ruth Handler turns her greatest gamble into the most recognizable toy in the world. Meanwhile, rival Merrill Hassenfeld, at the reigns of a company that will one day be one the most famous brands in the world, tries to capitalize on Handler's success to launch a military doll for boys--which is brilliantly rebranded as the world's first \"action figure,\" and eventually spawns a tv series and a movie franchise. For decades, these two companies battle each other to dominate the toy industry. But when the cultural landscape shifts, they are forced to make desperate choices that ultimately earn their toys immortal status.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 139096,
                    "still_path": "/3dkWaAVjarRxQJBV3o1zqGJ50wS.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-12-12",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3345779,
                    "name": "Toy Car Wars",
                    "overview": "As car culture cranks up in the early 1950s, a young machinist in England invents one of the world's most successful toys when he creates a toy car small enough to fit inside a matchbox for his daughter to take to school. In Los Angeles, Elliot Handler creates one of the biggest toy rivalries in history when he brings on a former missile designer to make a toy car behemoth of his own.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 139096,
                    "still_path": "/jfB63PisimTq0VUzfzXzTxPVhGm.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-12-19",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 3345780,
                    "name": "Board Game Empires",
                    "overview": "After failing to make a living selling lithographs, Milton Bradley creates one of America's first board games, which will go on to become one of the biggest of all time. But the Parker brothers threaten Bradley's reign. But it's a game about Monopoly that will upend the business. And in its earliest days, it might have been pirated from its true creator, who has been largely lost to history--until now",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 139096,
                    "still_path": "/s0SRKZDKnZSG5vZeEC4mbR36nWx.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 220264,
            "poster_path": "/3LpXhboCuDfJik0HRCskwohptCU.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "62479069cb71b80063e3373c",
            "air_date": "2022-10-23",
            "episodes": [
                {
                    "air_date": "2022-10-23",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3637442,
                    "name": "Masters of the Toy Universe",
                    "overview": "After passing on the biggest deal in toy industry history, Mattel President Ray Wagner finds himself a step behind former colleague-turned- rival, Bernie Loomis. Loomis leads a small-town toy company to record heights and revolutionizes the entire action figure market. But Wagner refuses to back down and steals a page from Loomis’ playbook to create the next blockbuster toy that will put Mattel back on top.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/w8DRJeoZ4cODz0oc0UvOdtHxRDu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-30",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3637443,
                    "name": "The Birth of Video Games",
                    "overview": "Defense contractor Ralph Baer invents the world's first home video game console. But it is soon eclipsed by a new table tennis game that becomes one of the most famous video games of all time. And when a third pioneer, Jerry Lawson, creates a console featuring swappable games, the fledgling video game industry explodes into an epic contest for control of what will become a multi-billion dollar market.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/54cez3LUIEz6883XjOzdKJAJ0mc.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-06",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3637444,
                    "name": "The Idea Man",
                    "overview": "A visionary named Marvin Glass oversees the creation of many of the most iconic toys of the 20th Century. From chattering teeth to a legendary game based on a mouse trap, Glass pushes the boundaries of what a toy can be, and inspires generations. From his windowless fortress in Chicago, Glass reinvents the way toys are imagined and invented...building himself a toy empire. But his tyrannical style will set him on a collision course with his own designers--in a clash for control of the most important element of the toy universe: ideas.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/nPrbyZ6Ahtag5UsyWy8YKT6lhob.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-13",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4039560,
                    "name": "Brick by Brick",
                    "overview": "At the height of the industrial age, as America's cities go vertical for the first time, a Yale educated medical doctor and Olympic gold medalist turns his attention to toys. Leaving his profitable magic business behind, he goes all in on his revolutionary steel building toy that will inspire generations of Americans to build bigger. Creating the first-ever national ad campaign for a toy, he'll go head-to-head with a British rival who sells a remarkably similar building kit. But after decades at the top, a struggling Danish Carpenter emerges, whose passion for innovation leads him to a new building material--plastic. With it he'll create the biggest toy empire the world has ever seen.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/ie1wOv5KSgStFOlaDPED3ZXPzaW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-20",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4065846,
                    "name": "Order Out of Chaos",
                    "overview": "Hungarian professor, Erno Rubik, ignites \"Cube Mania\" with his 3-D puzzle that takes the world by storm. Hot on his heels, Leslie Scott will stop at nothing to bring an iconic building block board game to market. And, working deep behind the Iron Curtain, Alexey Pajitnov, risks everything to launch a video game obsession based on a puzzle, and it will become one of the biggest-selling video games on the planet...if he can ever get it out of his country. Together, they revolutionize the puzzle industry and stump some of the world's greatest minds.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/z9LA9xs4OKWhgNkyoBIjUWcL9S1.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-27",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4065847,
                    "name": "Cabbage Patch Clash",
                    "overview": "In the midst of the 1970s folk art movement, art student Martha Nelson creates a one-of-a-kind doll to sell at local Kentucky craft markets. She has no idea that a visionary young entrepreneur will use her artwork as inspiration for a mass-produced doll that will spark a multi-billion-dollar toy craze. They will make him rich, but first he must fend off challenges to his empire from Nelson... and from a baseball card company looking to lampoon his dolls to make a fortune of their own.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/xcXwXr3WK4ADBDANQcYZLD4Whfh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-12-04",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4090196,
                    "name": "80's Tech Toys",
                    "overview": "In the 1980s, groundbreaking technology doesn't just improve adult life, it redefines classic toys. For the first time, childhood staples are reimagined by innovators pushing the boundaries of entertainment technology. A former amusement park employee combines his animatronic knowledge with the cassette tape to create the world's first realistic talking toy, while a NASA engineer invents an entirely new toy segment stemming from the boring old squirt gun. It's an era when technology redefines how we live, and these toy innovations are at the forefront.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/5qxWfpTakTgHuDtflmJ24IRfvo9.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-12-11",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4090198,
                    "name": "Plumber Bros vs. Hedgehog",
                    "overview": "After the U.S. videogame crash of 1983, a Japanese electronics company single-handedly resurrects the industry with a game featuring a jumping plumber. But a rival rises to challenge their dominance, setting off a two-way war between video game superpowers. In the process, the two companies will humiliate a third, transforming the fight from a two-player matchup into a three-way brawl...that will change the video game industry forever.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/lyJasJtzZ6U4kvlaW8Yhqah7sLR.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-12-18",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4090199,
                    "name": "Christmas Crazes",
                    "overview": "The Christmas crazes that helped transform holiday shopping into the frantic, no-holds-barred $1.1 trillion frenzy that it is today. From a hit doll in the Great Depression, to a $5 plush reselling for a thousand times its value, each season's 'must-have toy' makes the top of Santa's list for its own improbable reason... and sends desperate shoppers to unbelievable lengths just to buy it.",
                    "production_code": "",
                    "runtime": 20,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/nEh4JbYCjk19LX7v8eu5BHECHHe.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-12-25",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 4090200,
                    "name": "Gross Out Icons",
                    "overview": "Gross-out humor is as old as human society itself, and so are the toys designed to capitalize on it. From a 1st century Roman Emperor who created an early version of the Whoopee cushion, to cutting edge, modern materials that emulate human body fluids, gross equals big bucks for toymakers. These are the stories of America's most innovative, groundbreaking, and profitable toys designed to shock--and how they grew to claim a bigger piece of the 100-billion-dollar toy industry than you would think.",
                    "production_code": "",
                    "runtime": 20,
                    "season_number": 2,
                    "show_id": 139096,
                    "still_path": "/sawiM34BbiDXjuViw1JXzRmgCxn.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 285957,
            "poster_path": "/xezZNbKqNXLVDEjvXiAKRgYG1BK.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "651f3d14c50ad200ad836703",
            "air_date": "2023-10-15",
            "episodes": [
                {
                    "air_date": "2023-10-15",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4792636,
                    "name": "Transforming Toy Invasion",
                    "overview": "In 1983, underdog company Tonka sets out to bring a game-changing toy from Japan to America: the transformable robot. But they're soon confronted by industry giant, Hasbro, who has its own competing toy line. It's a true David vs. Goliath story, as both race to rule this new frontier.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/kvCn2tK9PA1bRCqceBdK4I8jb8i.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-10-22",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4792637,
                    "name": "Mind Game Masters",
                    "overview": "Before World War II, board games are mostly simple, but postwar peace and prosperity reveals a demand for more challenging pastimes. After decades of struggle, three different innovators break the mold to release games that combine fun with an intellectual challenge: Scrabble, Clue and Yahtzee.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/glEj3jye8NhRKphpzY6pFFdvHtA.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-10-29",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4792638,
                    "name": "Video Game Visionaries",
                    "overview": "Thanks to the industry-defining innovations of three men through the creation of games like Super Mario Brothers, The Legend of Zelda, and Pokémon, Nintendo goes from a struggling playing card company to a video game juggernaut.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/tfMIb4JRNUQ7360xltCXVVv34JJ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-11-05",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4889771,
                    "name": "Game Night Legends",
                    "overview": "In the 1970s, the board game industry was aimed almost entirely at children, until a literal game changer came along in Trivial Pursuit; redefining the possibilities for adult fun, it opened up a whole new genre.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/guvgwflXHFTDqaD72RMvEwRpHOG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-11-12",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4897949,
                    "name": "Mighty Mutant Mayhem",
                    "overview": "The Teenage Mutant Ninja Turtles high kick their way into the action figure market in the late 1980s, opening the door for a new kind of martial arts toy. But their place at the top is soon challenged by a mighty morphin phenomenon that takes the world by storm.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/nxy1oS63b48OFjuP1hWReNdiOQM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-11-26",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4897950,
                    "name": "Old Games, New Twists",
                    "overview": "As toys become increasingly complex in the early 1970s, two unconventional inventors risk their homes and careers to bring revolutionary twists to classic games; together, Uno and Connect Four unleash a wave of family-friendly games.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/1Yslb9tdTkJXJjgeBfJBCBicKmu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Howard Wexler",
                            "credit_id": "65648079edeb430100aba1aa",
                            "order": 500,
                            "adult": false,
                            "gender": 0,
                            "id": 2942098,
                            "known_for_department": "Acting",
                            "name": "John Ammirati",
                            "original_name": "John Ammirati",
                            "popularity": 0.39,
                            "profile_path": "/t2zFRhWAi7emJoRV2K24heB4XEh.jpg"
                        }
                    ]
                },
                {
                    "air_date": "2023-12-03",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4932421,
                    "name": "Happy Accidents",
                    "overview": "Two chance discoveries in the 1950s turn mundane industrial materials into legendary toys; Etch A Sketch and Play-Doh will rake in billions for decades to come, but not everyone will reap the rewards.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/m4IOiZ9NJK9Uvv4yBU5m1zZy3oR.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-12-10",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4932423,
                    "name": "The Santa That America Built",
                    "overview": "Santa Claus is one of the most beloved figures -- and famous faces -- on Earth, a symbol of hope and goodwill for all; this is the story of the creative minds, brands, and major events that shaped the image of jolly ol' St. Nick.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/7GnrEM8p6jgTa8SrJtnEuARgmSw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-12-10",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4932426,
                    "name": "90's Fad Toys",
                    "overview": "From Furbys to Pogs, the 1990s were full of unforgettable fad toys; it was a decade where old school toys like Beanies Babies went head-to-head with high-tech wonders like Tamagotchi, and parents would do anything to get their hands on them.",
                    "production_code": "",
                    "runtime": 20,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/kOBqf9YwibW7TZPzkRMePM2r9VH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-12-10",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 4932427,
                    "name": "Hottest Wheels",
                    "overview": "From the velocipede to the Schwinn Stingray, or even pedal cars to Power Wheels, viewers will roll their way through the history of the hottest toys on wheels and the surprising stories behind their creations.",
                    "production_code": "",
                    "runtime": 20,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/6HaRKJA1OtRBZGdChgxC8FA93LB.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-12-17",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 4932428,
                    "name": "The Prank Toy Race",
                    "overview": "For six decades two silly, but savvy entrepreneurs--S.S. Adams and H. Fishlove--turned their love of a good joke into a booming prank toy industry. Their heated rivalry produced hundreds of tricks and gags that entertained generations of Americans.",
                    "production_code": "",
                    "runtime": 20,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/d3jUVNun5PweGP8ULxDbMdFOMES.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-12-17",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 4972312,
                    "name": "Most Valuable Toys",
                    "overview": "From Lionel Trains to video games, for the right collector our cherished childhood toys can be worth millions! Over the last three decades, people have paid some truly outrageous prices to get their hands on that elusive toy they always wanted.",
                    "production_code": "",
                    "runtime": 20,
                    "season_number": 3,
                    "show_id": 139096,
                    "still_path": "/AdhQWsJPOqcb0vp5d1YjeBhhxn4.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "This season turns the lens on an exciting new selection of bold visionaries and creators behind history’s biggest-selling toys, games, and action figures as they build billion-dollar empires against the backdrop of a changing world in the 20th century.",
            "id": 359784,
            "poster_path": "/dDqF7lGmGhTpha08D3x2KqreYxJ.jpg",
            "season_number": 3,
            "vote_average": 0
        }
    }
}