{"adult":false,"backdrop_path":"/aNYE3GKV0MsmlQtwzZI7bEq55Xq.jpg","created_by":[{"id":165899,"credit_id":"5b8b40e00e0a261d7c029286","name":"Simon Cowell","gender":2,"profile_path":"/My1ntuj7FdrO1rnJW4FKGesRRp.jpg"}],"episode_run_time":[60],"first_air_date":"2004-09-04","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.itv.com/xfactor","id":13999,"in_production":false,"languages":["en"],"last_air_date":"2018-12-02","last_episode_to_air":{"id":1632657,"name":"Final Sunday","overview":"Dermot O'Leary hosts the tension-packed season finale as the X Factor 2018 winner is crowned.","vote_average":0,"vote_count":0,"air_date":"2018-12-02","episode_number":28,"episode_type":"finale","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null},"name":"The X Factor","next_episode_to_air":null,"networks":[{"id":9,"logo_path":"/oz9pjTHnBUmlju8OkaTymhKbh6C.png","name":"ITV1","origin_country":"GB"}],"number_of_episodes":423,"number_of_seasons":15,"origin_country":["GB"],"original_language":"en","original_name":"The X Factor","overview":"The X Factor is a British television music competition to find new singing talent, contested by aspiring singers drawn from public auditions.","popularity":30.112,"poster_path":"/pHXjjGnPgKcU7vekSo4K69djr9G.jpg","production_companies":[{"id":5645,"logo_path":"/bKcQzzCVVeqgby86hAqKm5iVuzi.png","name":"Talkback Thames","origin_country":"GB"},{"id":26554,"logo_path":"/8KCY7SFDapSTQhEVH6jQMaabCmV.png","name":"FremantleMedia","origin_country":"GB"},{"id":67127,"logo_path":null,"name":"Syco Television","origin_country":""}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"}],"seasons":[{"air_date":null,"episode_count":1,"id":25290,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2004-09-04","episode_count":23,"id":25291,"name":"Season 1","overview":"The X Factor is a British television music competition to find new singing talent; the winner of which receives a £1 million recording contract with the Syco Music record label. The first series was broadcast from 4 September to 11 December 2004. The competition was split into several stages: auditions, bootcamp and live shows, with Simon Cowell, Sharon Osbourne, Louis Walsh as judges. It was won by Steve Brookstein, who went on to have some chart success, with runners-up G4 achieving two platinum albums before splitting up in 2007. Cowell was the winning mentor. Brookstein and Cowell reportedly fell out over Cowell's insistence that he record cover versions, rather than self-penned material, leading to him being dropped from Sony BMG, and his name being little-mentioned in subsequent series of the show.","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2005-08-20","episode_count":30,"id":25292,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2006-08-19","episode_count":30,"id":25293,"name":"Season 3","overview":"The X Factor is a British television music competition to find new singing talent. The third series was broadcast on ITV from 19 August 2006 until 16 December 2006. Twelve million people tuned into the final on 16 December 2006, which saw Leona Lewis declared the winning act and Simon Cowell the winning mentor. After the 9 December show, Cowell became the winning judge even though the series had not yet finished, as two of his acts, Ray Quinn and Lewis, became the two finalists.\n\nInstead of the earlier red and purple colour scheme, this year's theme was red and blue. A new-look website for the third series was launched on 11 August 2006.","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2007-08-18","episode_count":28,"id":25294,"name":"Season 4","overview":"The X Factor is a British television music competition to find new singing talent. The fourth series was broadcast on ITV from 18 August 2007 and was won by Leon Jackson on 15 December 2007, with Rhydian Roberts finishing as the runner-up and Dannii Minogue emerging as the winning mentor. Dermot O'Leary presented the main show on ITV, whilst Fearne Cotton presented spin-off show The Xtra Factor on ITV2. Simon Cowell and Sharon Osbourne returned as judges, whilst two new judges, Brian Friedman and Minogue joined the panel. Friedman replaced original judge Louis Walsh, but Walsh was later reinstated after the London auditions.\n\nThis series saw a number of changes to the format, most notably the lowering of the minimum age for participants from 16 to 14 and the increase in the number of categories from three to four, resulting from the division of the 16-24s category into separate male and female categories. The series hit the headlines even before recording began. Some of the controversy centred upon whether 14 and 15-year-olds should be eligible to enter, and also on the high-profile dismissals of judge Louis Walsh and presenter Kate Thornton, who were replaced by choreographer and Grease Is the Word judge Brian Friedman and Big Brother's Little Brother host Dermot O'Leary respectively. Before hiring Freidman and Minogue, Cowell had apparently approached colleague and fellow American Idol judge Randy Jackson, and close friend and The X Factor mentor Sinitta. Friedman, however, was only a judge for the London auditions and Walsh was quickly reinstated, with Friedman becoming the show's choreographer. Jackson's prize as winner was a £1 million recording contract. His first single release was \"When You Believe\", arranged for the finalists by composer Stephen Schwartz and released to download on 16 December 2007, with the physical format following on 19 December. The single became that year's Christmas Number one in the UK Singles Chart.","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2008-08-16","episode_count":30,"id":25295,"name":"Season 5","overview":"The X Factor is a British television music competition to find new singing talent. The fifth series was broadcast on ITV from 16 August 2008 until 13 December 2008. It was won by Alexandra Burke, with new judge Cheryl Cole emerging as the winning mentor. Auditions in front of producers were held in April/May, with callbacks in front of the judges in June. The number of applicants for series 5 reached an all-time high with a reported 182,000 people auditioning. A number of well-established music acts from around the world, such as Mariah Carey, Britney Spears, Miley Cyrus, Girls Aloud, Take That, Il Divo, and series 3 winner Leona Lewis performed during the live stages of the show.\n\nBurke's prize, as winner, was a £1 million recording contract with Syco Music. Her debut single, \"Hallelujah\", written by Leonard Cohen, was released for digital download at 00:01 on 14 December 2008, with the physical format following on 17 December. It was later announced that her single had become the fastest selling song of all time.","poster_path":null,"season_number":5,"vote_average":0},{"air_date":"2009-08-22","episode_count":30,"id":25296,"name":"Season 6","overview":"The X Factor is a British television music competition to find new singing talent. The sixth series started on ITV on 22 August 2009 and was won by Joe McElderry on 13 December 2009. Cheryl Cole emerged as the winning mentor for the second consecutive year, the first time in the show's history that a mentor has won back-to-back series. The show was presented by Dermot O'Leary, with spin-off show The Xtra Factor hosted by Holly Willoughby on ITV2.\n\nPublic auditions by aspiring singers began in June 2009 and were held in five cities across the UK. Judges Simon Cowell, Dannii Minogue, Louis Walsh, and Cheryl Cole returned to judge the contestants, with auditions being held in front of a live audience for the first time. Following initial auditions, the \"Boot camp\" stage took place in August 2009, where the number of contestants was narrowed down to 24. The 24 contestants were split into their categories, Boys, Girls, Over 25s and Groups, and given a judge to mentor them at the \"Judges' houses\" stage and throughout the finals.\n\nDuring \"Judges' houses\", the 24 acts were reduced to twelve, who went on to the live finals, with one act being eliminated each week by a combination of public vote and judges' decision until a winner was found. The live shows started on 10 October 2009. The acts performed every Saturday night with the results announced on Sundays. This was change of format from previous series in which the results were announced later on the Saturday evening.","poster_path":"/541JuoF0vwgXYaMNessIxK0cOSB.jpg","season_number":6,"vote_average":0},{"air_date":"2010-08-21","episode_count":30,"id":25297,"name":"Season 7","overview":"The X Factor is a British television music competition to find new singing talent. The seventh series started on ITV on 21 August 2010 and ended on 12 December 2010. The winner was Matt Cardle and his debut single \"When We Collide\" was released after the final. Cardle was mentored throughout by Dannii Minogue, who won as mentor for the second time. A total of 15,448,019 votes were cast throughout the series. It was presented by Dermot O'Leary, with spin-off show The Xtra Factor hosted by Konnie Huq on ITV2, who took over from Holly Willoughby.\n\nThe competition was split into several stages: auditions, bootcamp, judges' houses and live shows. Auditions took place throughout June and July 2010, with Simon Cowell, Louis Walsh and Cheryl Cole returning as judges. Special guest judges were brought in to replace Minogue, who was on maternity leave. Cole missed the auditions in Manchester and bootcamp because she had malaria. Following bootcamp, successful acts were split into four categories: Boys, Girls, Over 28s and Groups. Minogue returned for the judges' houses stage, and each judge mentored eight acts through judges' houses. The live shows started on 9 October 2010. Four acts eliminated at judges' houses were brought back as wildcards, making this the first series to have 16 acts perform in the live shows. This series was the last with Cowell, Minogue and Cole as judges, as Gary Barlow, Kelly Rowland and Tulisa Contostavlos replaced them in series 8.","poster_path":null,"season_number":7,"vote_average":0},{"air_date":"2011-08-20","episode_count":31,"id":25298,"name":"Season 8","overview":"The X Factor is a British television music competition to find new singing talent. The eighth series began airing on ITV on 20 August 2011 and ended on 11 December 2011. The winner was Little Mix, a four-piece girl group known earlier in the series as Rhythmix, consisting of members Jesy Nelson, Perrie Edwards, Leigh-Anne Pinnock, and Jade Thirlwall. They became the first act in the groups category to win in the show's history with new judge Tulisa Contostavlos emerging as their winning mentor. Also they are the only girl group to get to the final. Louis Walsh was the only judge from the previous series to return, and was joined by Contostavlos, Gary Barlow and Kelly Rowland, who all appeared as judges for the first time. Previous judges Simon Cowell, Dannii Minogue and Cheryl Cole all left to join other shows before recording for this series started. Dermot O'Leary presented the show on ITV, while Caroline Flack and series 6 runner-up Olly Murs co-presented the spin-off show The Xtra Factor on ITV2, replacing Konnie Huq from the previous year.\n\nOn 4 August 2011, promotional pictures of the judges surfaced across the internet. The next day, an advertisement premiered on itv.com.","poster_path":"/chxJnLfdSzWwpQqug2OZYaYZMAo.jpg","season_number":8,"vote_average":0},{"air_date":"2012-08-18","episode_count":31,"id":25299,"name":"Season 9","overview":"The X Factor is a British television music competition to find new singing talent. The ninth series began airing on ITV on 18 August 2012 and ended on 9 December 2012. Before the start of the auditions process it was confirmed that Louis Walsh, Gary Barlow and Tulisa Contostavlos would return to the judging panel. Nicole Scherzinger was confirmed as the fourth permanent judge after Geri Halliwell, Leona Lewis, Rita Ora, Mel B, Anastacia and Scherzinger herself stood in as guest judges for the vacant position left by Kelly Rowland. Dermot O'Leary returned as host on ITV, whilst Caroline Flack and Olly Murs returned to host The Xtra Factor on ITV2. After the 8 December show, two of Scherzinger's acts, James Arthur and Jahméne Douglas, became the two finalists, meaning that Scherzinger was guaranteed to win. Arthur was announced as the winner on 9 December, and released a cover of Shontelle's \"Impossible\" as his winner's song. This has since gone on to become the second best selling winning single of any The X Factor winner, behind only series 5 winner Alexandra Burke's version of \"Hallelujah\". This series was the final one to feature Contostavlos as judge, as she will not return for series 10, where former judge Sharon Osbourne replaced her.","poster_path":null,"season_number":9,"vote_average":0},{"air_date":"2013-08-31","episode_count":32,"id":25300,"name":"Season 10","overview":"","poster_path":null,"season_number":10,"vote_average":0},{"air_date":"2014-08-30","episode_count":12,"id":63446,"name":"Season 11","overview":"","poster_path":null,"season_number":11,"vote_average":0},{"air_date":"2015-08-25","episode_count":28,"id":69867,"name":"Season 12","overview":"","poster_path":"/g7SItN4TeAnG9jz56rEFT1zIwS2.jpg","season_number":12,"vote_average":0},{"air_date":"2016-08-27","episode_count":32,"id":79577,"name":"Season 13","overview":"","poster_path":null,"season_number":13,"vote_average":0},{"air_date":"2017-09-02","episode_count":28,"id":92275,"name":"Season 14","overview":"","poster_path":null,"season_number":14,"vote_average":0},{"air_date":"2018-09-01","episode_count":28,"id":108698,"name":"Season 15","overview":"","poster_path":null,"season_number":15,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Reality","vote_average":5.1,"vote_count":81,"season_data":{"1":{"_id":"52582d75760ee36aaa8a613b","air_date":"2004-09-04","episodes":[{"air_date":"2004-09-04","episode_number":1,"episode_type":"standard","id":511505,"name":"Episode 1: The Auditions Part 1","overview":"The judges visit Leeds and London for the first audions round. Amongst the thousands of contestants who tried out were:   Retired miner Mario, sisterly duos Sweet Harmony and Gemini, rapper ginger Benjamin (who got on the wrong side of Sharon by insulting her kids!) & 81 year old Reney!","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-11","episode_number":2,"episode_type":"standard","id":511504,"name":"Episode 2: The Auditions Part 2","overview":"The judges visit Newcastle.  Two rivalry bands both get through to the next round.   A girl tries out with her two best friends, only to be told by Simon that she has to ditch them if she wants to go any further. After a heart-to-heart with her friends, the girl tries out in front  of the judges on her own.    Louis gets re-acquainted with an old friend.  Simon suggests that Louis take her out, then when she turns up for their lunch date with her dog, Louis runs away from Simon and out of the back door.","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-18","episode_number":3,"episode_type":"standard","id":511501,"name":"Episode 3: The Auditions Part 3","overview":"The judges continue to search for people who they think have the X Factor.","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-25","episode_number":4,"episode_type":"standard","id":511502,"name":"Episode 4: The Auditions Part 4","overview":"The judges visit Scotland.  The talent is very poor and the success rate of getting through to the next round is very low.  The judges aren't very pleased.\n\nSharon, annoyed at Simon, pours two glasses of water over his head.","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-02","episode_number":5,"episode_type":"standard","id":511507,"name":"Episode 5: The Auditions Part 5","overview":"The judges continue to search for people who they think have the X Factor.","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-09","episode_number":6,"episode_type":"standard","id":511506,"name":"Episode 6: The Boot Camp Part 1","overview":"The judges get together a team to help them mentor their group of hopefuls.","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-16","episode_number":7,"episode_type":"standard","id":511508,"name":"Episode 7: The Boot Camp Part 2","overview":"The judges get together a team to help them mentor their group of hopefuls.","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-23","episode_number":8,"episode_type":"standard","id":511503,"name":"Live Show : The final 9 perform","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-23","episode_number":9,"episode_type":"standard","id":511519,"name":"Live Results : Down to 8 acts","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-30","episode_number":10,"episode_type":"standard","id":511510,"name":"Live Show : The final 8 perform","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-30","episode_number":11,"episode_type":"standard","id":511520,"name":"Live Results : Down to 7 acts","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-06","episode_number":12,"episode_type":"standard","id":511509,"name":"Live Show : the final 7 perform","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-06","episode_number":13,"episode_type":"standard","id":511521,"name":"Live Results : Down to 6 acts","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-13","episode_number":14,"episode_type":"standard","id":511522,"name":"Live Show : the final 6 perform","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-13","episode_number":15,"episode_type":"standard","id":511523,"name":"Live Results : Down to 5 acts","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-20","episode_number":16,"episode_type":"standard","id":511512,"name":"Series 1 - Live Show 5","overview":"Cassie and Tabby were the final two people left and the judges had to choose between them.  Louis and Simon both voted Cassie off.  Sharon refused to give a vote.  Kate Thornton said that if the votes were tied, then the person who would be kicked out is the person who got the lowest phone votes. Over 2 million people had voted for Cassie and Tabby.","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-20","episode_number":17,"episode_type":"standard","id":511513,"name":"Series 1 - Live Show 5 (Result)","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-27","episode_number":18,"episode_type":"standard","id":511514,"name":"Series 1 - Live Show 6","overview":"In this episode, each act performed two songs. On the results show later on, the judges decided which one of the two songs that their act sung earlier, would be singing again to keep them in the show.   Rowetta was voted off tonights show.","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-27","episode_number":19,"episode_type":"standard","id":511515,"name":"Series 1 - Live Show 6 (Result)","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-12-04","episode_number":20,"episode_type":"standard","id":511511,"name":"Series 1 - Live Show 7","overview":"In this episode, Tabby was voted off the show.  Even though he was sad to be going, he was glad that he'd made it this far.\n\nG4 and Steve will be going head-to-head in the final next Saturday.","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-12-04","episode_number":21,"episode_type":"standard","id":511516,"name":"Series 1 - Live Show 7 (Result)","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-12-11","episode_number":22,"episode_type":"standard","id":511517,"name":"The X Factor Final 2004","overview":"This is the final.\n\nG4 vs Steve.    Who will win the title of person or group with the X Factor?    You decide!!!","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-12-11","episode_number":23,"episode_type":"finale","id":511518,"name":"The X Factor Final 2004 (Result)","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"The X Factor is a British television music competition to find new singing talent; the winner of which receives a £1 million recording contract with the Syco Music record label. The first series was broadcast from 4 September to 11 December 2004. The competition was split into several stages: auditions, bootcamp and live shows, with Simon Cowell, Sharon Osbourne, Louis Walsh as judges. It was won by Steve Brookstein, who went on to have some chart success, with runners-up G4 achieving two platinum albums before splitting up in 2007. Cowell was the winning mentor. Brookstein and Cowell reportedly fell out over Cowell's insistence that he record cover versions, rather than self-penned material, leading to him being dropped from Sony BMG, and his name being little-mentioned in subsequent series of the show.","id":25291,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"52582d75760ee36aaa8a6146","air_date":"2005-08-20","episodes":[{"air_date":"2005-08-20","episode_number":1,"episode_type":"standard","id":511524,"name":"Auditions 1","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"52582d77760ee36aaa8a6374","order":518,"adult":false,"gender":1,"id":1225310,"known_for_department":"Acting","name":"Alexandra Burke","original_name":"Alexandra Burke","popularity":2.28,"profile_path":"/rGWHZ8Aku3ymyt4sTHUADYaf7oy.jpg"}]},{"air_date":"2005-08-27","episode_number":2,"episode_type":"standard","id":511525,"name":"Auditions 2","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-03","episode_number":3,"episode_type":"standard","id":511526,"name":"Auditions 3","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-10","episode_number":4,"episode_type":"standard","id":511527,"name":"Auditions 4","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"5727264b925141038700163f","order":533,"adult":true,"gender":1,"id":278697,"known_for_department":"Acting","name":"Michelle Thorne","original_name":"Michelle Thorne","popularity":3.184,"profile_path":"/ymqWIPMYNp2PhOk2oPXe2VAmCt7.jpg"}]},{"air_date":"2005-09-17","episode_number":5,"episode_type":"standard","id":511528,"name":"Auditions 5","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-24","episode_number":6,"episode_type":"standard","id":511529,"name":"Auditions 6","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-01","episode_number":7,"episode_type":"standard","id":511530,"name":"Bootcamp 1","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"52582d77760ee36aaa8a6374","order":518,"adult":false,"gender":1,"id":1225310,"known_for_department":"Acting","name":"Alexandra Burke","original_name":"Alexandra Burke","popularity":2.28,"profile_path":"/rGWHZ8Aku3ymyt4sTHUADYaf7oy.jpg"},{"character":"Self","credit_id":"5727264b925141038700163f","order":533,"adult":true,"gender":1,"id":278697,"known_for_department":"Acting","name":"Michelle Thorne","original_name":"Michelle Thorne","popularity":3.184,"profile_path":"/ymqWIPMYNp2PhOk2oPXe2VAmCt7.jpg"}]},{"air_date":"2005-10-01","episode_number":8,"episode_type":"standard","id":511531,"name":"Bootcamp 2","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"52582d77760ee36aaa8a6374","order":518,"adult":false,"gender":1,"id":1225310,"known_for_department":"Acting","name":"Alexandra Burke","original_name":"Alexandra Burke","popularity":2.28,"profile_path":"/rGWHZ8Aku3ymyt4sTHUADYaf7oy.jpg"}]},{"air_date":"2005-10-08","episode_number":9,"episode_type":"standard","id":511532,"name":"Judges' Houses 1","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"52582d77760ee36aaa8a6374","order":518,"adult":false,"gender":1,"id":1225310,"known_for_department":"Acting","name":"Alexandra Burke","original_name":"Alexandra Burke","popularity":2.28,"profile_path":"/rGWHZ8Aku3ymyt4sTHUADYaf7oy.jpg"}]},{"air_date":"2005-10-08","episode_number":10,"episode_type":"standard","id":511533,"name":"Judges' Houses 2","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"52582d77760ee36aaa8a6374","order":518,"adult":false,"gender":1,"id":1225310,"known_for_department":"Acting","name":"Alexandra Burke","original_name":"Alexandra Burke","popularity":2.28,"profile_path":"/rGWHZ8Aku3ymyt4sTHUADYaf7oy.jpg"}]},{"air_date":"2005-10-15","episode_number":11,"episode_type":"standard","id":511534,"name":"Live Show 1","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"63bb1298a6e2d20092103cb8","order":543,"adult":false,"gender":0,"id":1226215,"known_for_department":"Acting","name":"Shayne Ward","original_name":"Shayne Ward","popularity":1.534,"profile_path":null},{"character":"Self","credit_id":"63bb12a3aede59007d25685c","order":544,"adult":false,"gender":0,"id":1226936,"known_for_department":"Acting","name":"Andy Abraham","original_name":"Andy Abraham","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63bb130aaede59008d35e823","order":545,"adult":false,"gender":0,"id":3863475,"known_for_department":"Acting","name":"Carl Pemberton","original_name":"Carl Pemberton","popularity":1.094,"profile_path":null},{"character":"Self","credit_id":"63bb1314fa4046008755d8b8","order":546,"adult":false,"gender":0,"id":3863476,"known_for_department":"Acting","name":"Andy Pemberton","original_name":"Andy Pemberton","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63bb1322aede59007d25688d","order":547,"adult":false,"gender":1,"id":2526695,"known_for_department":"Acting","name":"Brenda Edwards","original_name":"Brenda Edwards","popularity":0.994,"profile_path":"/9QVYbNjvVpKmVWNAIaj6tfBwYoq.jpg"},{"character":"Self","credit_id":"63bb182ac0a308007fc14362","order":548,"adult":false,"gender":0,"id":1220153,"known_for_department":"Acting","name":"Chico Slimani","original_name":"Chico Slimani","popularity":0.694,"profile_path":null},{"character":"Self","credit_id":"63bb1902fc31d30092c4ef6d","order":549,"adult":false,"gender":0,"id":3863504,"known_for_department":"Acting","name":"Sinead Conway","original_name":"Sinead Conway","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63bb190bc0a308008ca22394","order":550,"adult":false,"gender":0,"id":3863505,"known_for_department":"Acting","name":"Sharon Conway","original_name":"Sharon Conway","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63bb1920aede59007d256a4b","order":551,"adult":false,"gender":0,"id":3863506,"known_for_department":"Acting","name":"Marie Conway","original_name":"Marie Conway","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63bb192efc31d3008bce5ee2","order":552,"adult":false,"gender":0,"id":3863508,"known_for_department":"Acting","name":"Laura Conway","original_name":"Laura Conway","popularity":0.648,"profile_path":null},{"character":"Self","credit_id":"63bb1938c0a308008ca223a4","order":553,"adult":false,"gender":0,"id":3863510,"known_for_department":"Acting","name":"Nicholas Dorsett","original_name":"Nicholas Dorsett","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63bb1946ae6f093c3a4b2420","order":554,"adult":false,"gender":0,"id":3863512,"known_for_department":"Acting","name":"Maria Lawson","original_name":"Maria Lawson","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63bb194ffa404600c1283461","order":555,"adult":false,"gender":0,"id":3863513,"known_for_department":"Acting","name":"Chenai Zinyuku","original_name":"Chenai Zinyuku","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63bb1959fa4046007d4cc41b","order":556,"adult":false,"gender":0,"id":3863515,"known_for_department":"Acting","name":"Phillip Magee","original_name":"Phillip Magee","popularity":0.6,"profile_path":null}]},{"air_date":"2005-10-15","episode_number":12,"episode_type":"standard","id":511535,"name":"Live Show Results 1","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-22","episode_number":13,"episode_type":"standard","id":511536,"name":"Live Show 2","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-22","episode_number":14,"episode_type":"standard","id":511537,"name":"Live Show Results 2","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-29","episode_number":15,"episode_type":"standard","id":511538,"name":"Live Show 3","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-29","episode_number":16,"episode_type":"standard","id":511539,"name":"Live Show Results 3","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-05","episode_number":17,"episode_type":"standard","id":511540,"name":"Live Show 4","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-05","episode_number":18,"episode_type":"standard","id":511541,"name":"Live Show Results 4","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-12","episode_number":19,"episode_type":"standard","id":511542,"name":"Live Show 5","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-12","episode_number":20,"episode_type":"standard","id":511543,"name":"Live Show Results 5","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-19","episode_number":21,"episode_type":"standard","id":511544,"name":"Live Show 6","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-19","episode_number":22,"episode_type":"standard","id":511545,"name":"Live Show Results 6","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-26","episode_number":23,"episode_type":"standard","id":511546,"name":"Live Show 7","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-26","episode_number":24,"episode_type":"standard","id":511547,"name":"Live Show Results 7","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-12-03","episode_number":25,"episode_type":"standard","id":511548,"name":"Live Show 8","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-12-03","episode_number":26,"episode_type":"standard","id":511549,"name":"Live Show Results 8","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-12-10","episode_number":27,"episode_type":"standard","id":511550,"name":"Live Show 9","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-12-10","episode_number":28,"episode_type":"standard","id":511551,"name":"Live Show Results 9","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-12-17","episode_number":29,"episode_type":"standard","id":511552,"name":"Live Final","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-12-17","episode_number":30,"episode_type":"finale","id":511553,"name":"Live Final Results","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":25292,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"52582d75760ee36aaa8a6154","air_date":"2006-08-19","episodes":[{"air_date":"2006-08-19","episode_number":1,"episode_type":"standard","id":511554,"name":"Series 3 - Open Auditions 1","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"52582d78760ee36aaa8a6646","order":513,"adult":false,"gender":1,"id":216710,"known_for_department":"Acting","name":"Leona Lewis","original_name":"Leona Lewis","popularity":3.609,"profile_path":"/cCgs7rAMbCA7AG7YNGnI6KmQoVD.jpg"}]},{"air_date":"2006-08-26","episode_number":2,"episode_type":"standard","id":511555,"name":"Series 3 - Open Auditions 2","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"52582d78760ee36aaa8a668d","order":510,"adult":false,"gender":2,"id":1225433,"known_for_department":"Acting","name":"Ray Quinn","original_name":"Ray Quinn","popularity":2.15,"profile_path":null}]},{"air_date":"2006-09-02","episode_number":3,"episode_type":"standard","id":511556,"name":"Series 3 - Open Auditions 3","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-09-09","episode_number":4,"episode_type":"standard","id":511557,"name":"Series 3 - Open Auditions 4","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-09-16","episode_number":5,"episode_type":"standard","id":511558,"name":"Series 3 - Open Auditions 5","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-09-23","episode_number":6,"episode_type":"standard","id":511559,"name":"Series 3 - Open Auditions 6","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-09-30","episode_number":7,"episode_type":"standard","id":511560,"name":"Series 3 - Boot Camp 1","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-09-30","episode_number":8,"episode_type":"standard","id":511561,"name":"Series 3 - Boot Camp 2","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"52582d78760ee36aaa8a6729","order":512,"adult":false,"gender":0,"id":1220165,"known_for_department":"Acting","name":"Ben Mills","original_name":"Ben Mills","popularity":0.6,"profile_path":null}]},{"air_date":"2006-10-07","episode_number":9,"episode_type":"standard","id":511562,"name":"Series 3 - Boot Camp 3","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-07","episode_number":10,"episode_type":"standard","id":511563,"name":"Series 3 - Boot Camp 4","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-14","episode_number":11,"episode_type":"standard","id":511564,"name":"Series 3 - Live Finals 1","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7a760ee36aaa8a67cb","order":506,"adult":false,"gender":2,"id":181891,"known_for_department":"Acting","name":"Lionel Richie","original_name":"Lionel Richie","popularity":6.222,"profile_path":"/fths3YsxhPuPw6NCKOdUjqKCtZa.jpg"}]},{"air_date":"2006-10-14","episode_number":12,"episode_type":"standard","id":511565,"name":"Series 3 - Live Finals 1 (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7a760ee36aaa8a67cb","order":506,"adult":false,"gender":2,"id":181891,"known_for_department":"Acting","name":"Lionel Richie","original_name":"Lionel Richie","popularity":6.222,"profile_path":"/fths3YsxhPuPw6NCKOdUjqKCtZa.jpg"}]},{"air_date":"2006-10-21","episode_number":13,"episode_type":"standard","id":511566,"name":"Series 3 - Live Finals 2","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7a760ee36aaa8a6829","order":505,"adult":false,"gender":2,"id":263720,"known_for_department":"Acting","name":"Rod Stewart","original_name":"Rod Stewart","popularity":2.54,"profile_path":"/2lWU2oL8AiE1oPCy1pVNrknqZH.jpg"}]},{"air_date":"2006-10-21","episode_number":14,"episode_type":"standard","id":511567,"name":"Series 3 - Live Finals 2 (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7a760ee36aaa8a6829","order":505,"adult":false,"gender":2,"id":263720,"known_for_department":"Acting","name":"Rod Stewart","original_name":"Rod Stewart","popularity":2.54,"profile_path":"/2lWU2oL8AiE1oPCy1pVNrknqZH.jpg"}]},{"air_date":"2006-10-28","episode_number":15,"episode_type":"standard","id":511568,"name":"Series 3 - Live Finals 3","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7a760ee36aaa8a6887","order":509,"adult":false,"gender":2,"id":138986,"known_for_department":"Acting","name":"Tony Bennett","original_name":"Tony Bennett","popularity":7.448,"profile_path":"/gcbLJMKNsbhkvOobTDOT7DfdDZF.jpg"}]},{"air_date":"2006-10-28","episode_number":16,"episode_type":"standard","id":511569,"name":"Series 3 - Live Finals 3 (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7a760ee36aaa8a6887","order":509,"adult":false,"gender":2,"id":138986,"known_for_department":"Acting","name":"Tony Bennett","original_name":"Tony Bennett","popularity":7.448,"profile_path":"/gcbLJMKNsbhkvOobTDOT7DfdDZF.jpg"}]},{"air_date":"2006-11-04","episode_number":17,"episode_type":"standard","id":511570,"name":"Series 3 - Live Finals 4","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-04","episode_number":18,"episode_type":"standard","id":511571,"name":"Series 3 - Live Finals 4 (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-11","episode_number":19,"episode_type":"standard","id":511572,"name":"Series 3 - Live Finals 5","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-11","episode_number":20,"episode_type":"standard","id":511573,"name":"Series 3 - Live Finals 5 (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7b760ee36aaa8a6907","order":504,"adult":false,"gender":2,"id":162072,"known_for_department":"Acting","name":"Julio Iglesias","original_name":"Julio Iglesias","popularity":3.765,"profile_path":"/vTvYsulwFnhxpvalv24m1Rpx2Ft.jpg"}]},{"air_date":"2006-11-18","episode_number":21,"episode_type":"standard","id":511574,"name":"Series 3 - Live Finals 6","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-18","episode_number":22,"episode_type":"standard","id":511575,"name":"Series 3 - Live Finals 6 (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-25","episode_number":23,"episode_type":"standard","id":511576,"name":"Series 3 - Live Finals 7","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-25","episode_number":24,"episode_type":"standard","id":511577,"name":"Series 3 - Live Finals 7 (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-02","episode_number":25,"episode_type":"standard","id":511578,"name":"Series 3 - Live Finals 8","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7b760ee36aaa8a69a9","order":508,"adult":false,"gender":2,"id":71794,"known_for_department":"Acting","name":"Barry Manilow","original_name":"Barry Manilow","popularity":1.736,"profile_path":"/oAROfq6xXL46I0FkNlj9uIjwyP3.jpg"}]},{"air_date":"2006-12-02","episode_number":26,"episode_type":"standard","id":511579,"name":"Series 3 - Live Finals 8 (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7b760ee36aaa8a69a9","order":508,"adult":false,"gender":2,"id":71794,"known_for_department":"Acting","name":"Barry Manilow","original_name":"Barry Manilow","popularity":1.736,"profile_path":"/oAROfq6xXL46I0FkNlj9uIjwyP3.jpg"}]},{"air_date":"2006-12-09","episode_number":27,"episode_type":"standard","id":511580,"name":"Series 3 - Live Finals 9","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-09","episode_number":28,"episode_type":"standard","id":511581,"name":"Series 3 - Live Finals 9 (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Performer","credit_id":"52582d7b760ee36aaa8a6a18","order":517,"adult":false,"gender":1,"id":94759,"known_for_department":"Acting","name":"Gloria Estefan","original_name":"Gloria Estefan","popularity":4.747,"profile_path":"/alS75LDLaXopWcWxUVZ2Q70Mlm5.jpg"}]},{"air_date":"2006-12-16","episode_number":29,"episode_type":"standard","id":511582,"name":"Series 3 - The Live Final","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - OB Presenter","credit_id":"52582d7b760ee36aaa8a6a95","order":520,"adult":false,"gender":0,"id":1220156,"known_for_department":"Acting","name":"Jeff Brazier","original_name":"Jeff Brazier","popularity":0.631,"profile_path":null},{"character":"Self - OB Presenter","credit_id":"52582d7b760ee36aaa8a6acb","order":524,"adult":false,"gender":1,"id":76490,"known_for_department":"Acting","name":"Myleene Klass","original_name":"Myleene Klass","popularity":2.777,"profile_path":"/bELhmJFkUlAsvKbX4MLmnIw0j6t.jpg"}]},{"air_date":"2006-12-16","episode_number":30,"episode_type":"finale","id":511583,"name":"Series 3 - The Live Final (Result)","overview":"","production_code":"","runtime":60,"season_number":3,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - OB Presenter","credit_id":"52582d7b760ee36aaa8a6a95","order":520,"adult":false,"gender":0,"id":1220156,"known_for_department":"Acting","name":"Jeff Brazier","original_name":"Jeff Brazier","popularity":0.631,"profile_path":null},{"character":"Self - OB Presenter","credit_id":"52582d7b760ee36aaa8a6acb","order":524,"adult":false,"gender":1,"id":76490,"known_for_department":"Acting","name":"Myleene Klass","original_name":"Myleene Klass","popularity":2.777,"profile_path":"/bELhmJFkUlAsvKbX4MLmnIw0j6t.jpg"}]}],"name":"Season 3","overview":"The X Factor is a British television music competition to find new singing talent. The third series was broadcast on ITV from 19 August 2006 until 16 December 2006. Twelve million people tuned into the final on 16 December 2006, which saw Leona Lewis declared the winning act and Simon Cowell the winning mentor. After the 9 December show, Cowell became the winning judge even though the series had not yet finished, as two of his acts, Ray Quinn and Lewis, became the two finalists.\n\nInstead of the earlier red and purple colour scheme, this year's theme was red and blue. A new-look website for the third series was launched on 11 August 2006.","id":25293,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"52582d75760ee36aaa8a6162","air_date":"2007-08-18","episodes":[{"air_date":"2007-08-18","episode_number":1,"episode_type":"standard","id":511584,"name":"Series 4 - Auditions 1","overview":"The show returns for it's fourth series with Dermot O'Leary as the new host. Hopefuls audition for the judges hoping to impress and make it through to the next stage of the competition. Simon decides that new judge Brian isn't working out on the show and decides to ask Louis Walsh to return as his replacement.","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-25","episode_number":2,"episode_type":"standard","id":511585,"name":"Series 4 - Auditions 2","overview":"The auditions come from Birmingham and Cardiff as more hopefully try and impress the judges. Paris who at 14 last year impressed all the judges but was too young for the competition returns once again. With the competiton now open to 14 year olds and above she manages to impress again and makes it through. Others to impress include Ryan who has been serving in the British Army in Iraq.","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-09-01","episode_number":3,"episode_type":"standard","id":511586,"name":"Series 4 - Auditions 3","overview":"More hopefuls good and bad try and impress the four judges in a hope of making it through to the next round of the competition. Dermot is on hand to talk to those who make it through and also to offer comfort to the less successful.","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Auditionee","credit_id":"52582d7c760ee36aaa8a6b5a","order":514,"adult":false,"gender":0,"id":1220221,"known_for_department":"Acting","name":"Leon Jackson","original_name":"Leon Jackson","popularity":1.156,"profile_path":null}]},{"air_date":"2007-09-08","episode_number":4,"episode_type":"standard","id":511587,"name":"Series 4 - Auditions 4","overview":"More hopefuls good and bad try and impress the judges and again a place in the next round of the competition. Kelly's father is upset with Simon when he refuses to put his daughter through to the next round. Natasha Benjamin manages to impress all the judges after they hear her history and they her her sing.","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-09-15","episode_number":5,"episode_type":"standard","id":511588,"name":"Series 4 - Auditions 5","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-09-22","episode_number":6,"episode_type":"standard","id":511589,"name":"Series 4 - Auditions 6","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-09-29","episode_number":7,"episode_type":"standard","id":511590,"name":"Boot Camp - 1","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"52582d7c760ee36aaa8a6bd7","order":503,"adult":false,"gender":0,"id":1220231,"known_for_department":"Acting","name":"Rhydian","original_name":"Rhydian","popularity":0.6,"profile_path":null},{"character":"Self - Contestant","credit_id":"52582d7d760ee36aaa8a6c10","order":522,"adult":false,"gender":0,"id":1244789,"known_for_department":"Acting","name":"Niki Evans","original_name":"Niki Evans","popularity":0.615,"profile_path":null}]},{"air_date":"2007-09-29","episode_number":8,"episode_type":"standard","id":511591,"name":"Boot Camp - 2","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"52582d7c760ee36aaa8a6bd7","order":503,"adult":false,"gender":0,"id":1220231,"known_for_department":"Acting","name":"Rhydian","original_name":"Rhydian","popularity":0.6,"profile_path":null}]},{"air_date":"2007-10-06","episode_number":9,"episode_type":"standard","id":511592,"name":"Boot Camp - 3","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"52582d7c760ee36aaa8a6bd7","order":503,"adult":false,"gender":0,"id":1220231,"known_for_department":"Acting","name":"Rhydian","original_name":"Rhydian","popularity":0.6,"profile_path":null},{"character":"Self - Judges' Expert","credit_id":"52582d7e760ee36aaa8a6c74","order":511,"adult":false,"gender":2,"id":1093141,"known_for_department":"Acting","name":"Kian Egan","original_name":"Kian Egan","popularity":1.838,"profile_path":"/1YrdVFHBF705G4gz5q3ig6dzVgQ.jpg"},{"character":"Self - Contestant","credit_id":"52582d7d760ee36aaa8a6c10","order":522,"adult":false,"gender":0,"id":1244789,"known_for_department":"Acting","name":"Niki Evans","original_name":"Niki Evans","popularity":0.615,"profile_path":null}]},{"air_date":"2007-10-07","episode_number":10,"episode_type":"standard","id":511593,"name":"Boot Camp - 4","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"52582d7c760ee36aaa8a6bd7","order":503,"adult":false,"gender":0,"id":1220231,"known_for_department":"Acting","name":"Rhydian","original_name":"Rhydian","popularity":0.6,"profile_path":null},{"character":"Self - Contestant","credit_id":"52582d7d760ee36aaa8a6c10","order":522,"adult":false,"gender":0,"id":1244789,"known_for_department":"Acting","name":"Niki Evans","original_name":"Niki Evans","popularity":0.615,"profile_path":null}]},{"air_date":"2007-10-20","episode_number":11,"episode_type":"standard","id":511594,"name":"Elimination - 1","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-10-20","episode_number":12,"episode_type":"standard","id":511595,"name":"Elimination - 1 (Results)","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"61c361069f51af00413da141","order":536,"adult":false,"gender":1,"id":216710,"known_for_department":"Acting","name":"Leona Lewis","original_name":"Leona Lewis","popularity":2.698,"profile_path":"/cCgs7rAMbCA7AG7YNGnI6KmQoVD.jpg"}]},{"air_date":"2007-10-27","episode_number":13,"episode_type":"standard","id":511596,"name":"Elimination - 2","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7f760ee36aaa8a6d0c","order":500,"adult":false,"gender":1,"id":16303,"known_for_department":"Acting","name":"Céline Dion","original_name":"Céline Dion","popularity":3.794,"profile_path":"/eR4PVLOJiRtP40uhJefNkdwAtPo.jpg"}]},{"air_date":"2007-10-27","episode_number":14,"episode_type":"standard","id":511597,"name":"Elimination - 2 (Results)","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d7f760ee36aaa8a6d0c","order":500,"adult":false,"gender":1,"id":16303,"known_for_department":"Acting","name":"Céline Dion","original_name":"Céline Dion","popularity":3.794,"profile_path":"/eR4PVLOJiRtP40uhJefNkdwAtPo.jpg"}]},{"air_date":"2007-11-03","episode_number":15,"episode_type":"standard","id":511598,"name":"Elimination - 3","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-03","episode_number":16,"episode_type":"standard","id":511599,"name":"Elimination - 3 (Results)","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-10","episode_number":17,"episode_type":"standard","id":511600,"name":"Elimination - 4","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-10","episode_number":18,"episode_type":"standard","id":511601,"name":"Elimination - 4 (Results)","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-17","episode_number":19,"episode_type":"standard","id":511602,"name":"Elimination - 5","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-17","episode_number":20,"episode_type":"standard","id":511603,"name":"Elimination - 5 (Results)","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-24","episode_number":21,"episode_type":"standard","id":511604,"name":"Elimination - 6","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-24","episode_number":22,"episode_type":"standard","id":511605,"name":"Elimination - 6 (Result)","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-01","episode_number":23,"episode_type":"standard","id":511606,"name":"Elimination - 7","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-01","episode_number":24,"episode_type":"standard","id":511607,"name":"Elimination - 7 (Result)","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-08","episode_number":25,"episode_type":"standard","id":511608,"name":"Elimination - 8","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d80760ee36aaa8a6f22","order":538,"adult":false,"gender":2,"id":21860,"known_for_department":"Acting","name":"Michael Bublé","original_name":"Michael Bublé","popularity":3.05,"profile_path":"/mXGgDOQE0fm1BaRERamaq3kGev3.jpg"}]},{"air_date":"2007-12-08","episode_number":26,"episode_type":"standard","id":511609,"name":"Elimination - 9 (Result)","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d80760ee36aaa8a6f22","order":538,"adult":false,"gender":2,"id":21860,"known_for_department":"Acting","name":"Michael Bublé","original_name":"Michael Bublé","popularity":3.05,"profile_path":"/mXGgDOQE0fm1BaRERamaq3kGev3.jpg"}]},{"air_date":"2007-12-15","episode_number":27,"episode_type":"standard","id":511610,"name":"The Final","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - OB Presenter","credit_id":"52582d80760ee36aaa8a6f80","order":515,"adult":false,"gender":0,"id":1217443,"known_for_department":"Acting","name":"Michael Underwood","original_name":"Michael Underwood","popularity":1.553,"profile_path":null},{"character":"Self - OB Presenter","credit_id":"52582d7b760ee36aaa8a6a95","order":520,"adult":false,"gender":0,"id":1220156,"known_for_department":"Acting","name":"Jeff Brazier","original_name":"Jeff Brazier","popularity":0.631,"profile_path":null},{"character":"Self - Special Guest","credit_id":"52582d80760ee36aaa8a6fb6","order":521,"adult":false,"gender":2,"id":141985,"known_for_department":"Acting","name":"Jason Donovan","original_name":"Jason Donovan","popularity":4.967,"profile_path":"/bwQx8cbD9Rq8uPZ0vq1TPkPS4uX.jpg"},{"character":"Self - Special Guest","credit_id":"52582d80760ee36aaa8a6fec","order":523,"adult":false,"gender":1,"id":12207,"known_for_department":"Acting","name":"Kylie Minogue","original_name":"Kylie Minogue","popularity":7.108,"profile_path":"/u9Lpzp7TFUcXn7277qMQRFNpEJu.jpg"},{"character":"Self - OB Presenter","credit_id":"52582d7b760ee36aaa8a6acb","order":524,"adult":false,"gender":1,"id":76490,"known_for_department":"Acting","name":"Myleene Klass","original_name":"Myleene Klass","popularity":2.589,"profile_path":"/bELhmJFkUlAsvKbX4MLmnIw0j6t.jpg"},{"character":"Self - Special Guest","credit_id":"52582d80760ee36aaa8a7028","order":526,"adult":false,"gender":1,"id":146458,"known_for_department":"Acting","name":"Katherine Jenkins","original_name":"Katherine Jenkins","popularity":2.815,"profile_path":"/omBxjQHAgxNtSCQ9rbYBrfgQ1Gb.jpg"}]},{"air_date":"2007-12-15","episode_number":28,"episode_type":"finale","id":511611,"name":"The Final (Results)","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d80760ee36aaa8a6fec","order":523,"adult":false,"gender":1,"id":12207,"known_for_department":"Acting","name":"Kylie Minogue","original_name":"Kylie Minogue","popularity":7.108,"profile_path":"/u9Lpzp7TFUcXn7277qMQRFNpEJu.jpg"}]}],"name":"Season 4","overview":"The X Factor is a British television music competition to find new singing talent. The fourth series was broadcast on ITV from 18 August 2007 and was won by Leon Jackson on 15 December 2007, with Rhydian Roberts finishing as the runner-up and Dannii Minogue emerging as the winning mentor. Dermot O'Leary presented the main show on ITV, whilst Fearne Cotton presented spin-off show The Xtra Factor on ITV2. Simon Cowell and Sharon Osbourne returned as judges, whilst two new judges, Brian Friedman and Minogue joined the panel. Friedman replaced original judge Louis Walsh, but Walsh was later reinstated after the London auditions.\n\nThis series saw a number of changes to the format, most notably the lowering of the minimum age for participants from 16 to 14 and the increase in the number of categories from three to four, resulting from the division of the 16-24s category into separate male and female categories. The series hit the headlines even before recording began. Some of the controversy centred upon whether 14 and 15-year-olds should be eligible to enter, and also on the high-profile dismissals of judge Louis Walsh and presenter Kate Thornton, who were replaced by choreographer and Grease Is the Word judge Brian Friedman and Big Brother's Little Brother host Dermot O'Leary respectively. Before hiring Freidman and Minogue, Cowell had apparently approached colleague and fellow American Idol judge Randy Jackson, and close friend and The X Factor mentor Sinitta. Friedman, however, was only a judge for the London auditions and Walsh was quickly reinstated, with Friedman becoming the show's choreographer. Jackson's prize as winner was a £1 million recording contract. His first single release was \"When You Believe\", arranged for the finalists by composer Stephen Schwartz and released to download on 16 December 2007, with the physical format following on 19 December. The single became that year's Christmas Number one in the UK Singles Chart.","id":25294,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"52582d76760ee36aaa8a6170","air_date":"2008-08-16","episodes":[{"air_date":"2008-08-16","episode_number":1,"episode_type":"standard","id":511612,"name":"Auditions 1","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-23","episode_number":2,"episode_type":"standard","id":511615,"name":"Auditions 2","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-30","episode_number":3,"episode_type":"standard","id":511616,"name":"Auditions 3","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-06","episode_number":4,"episode_type":"standard","id":511614,"name":"Auditions 4","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-13","episode_number":5,"episode_type":"standard","id":511618,"name":"Auditions 5","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-20","episode_number":6,"episode_type":"standard","id":511617,"name":"Auditions 6","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-27","episode_number":7,"episode_type":"standard","id":511613,"name":"Boot Camp 1","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-28","episode_number":8,"episode_type":"standard","id":511623,"name":"Boot Camp 2","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-04","episode_number":9,"episode_type":"standard","id":511620,"name":"Boot Camp 3","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-05","episode_number":10,"episode_type":"standard","id":511619,"name":"Boot Camp 4","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-11","episode_number":11,"episode_type":"standard","id":511621,"name":"Elimination 1","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-11","episode_number":12,"episode_type":"standard","id":511622,"name":"Elimination 1 (Result)","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-18","episode_number":13,"episode_type":"standard","id":511624,"name":"Elimination 2","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-18","episode_number":14,"episode_type":"standard","id":511625,"name":"Elimination 2 (Result)","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-25","episode_number":15,"episode_type":"standard","id":511629,"name":"Elimination 3","overview":"The 10 remaining acts return to perform live for the third time. This week each act has to perform a Big Band song. The judges give their verdicts on what they have heard. At the end of the show the phone lines are opened for this week's public vote.","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-25","episode_number":16,"episode_type":"standard","id":511631,"name":"Elimination 3 (Result)","overview":"The finalists performed a cover version of the Mariah Carey song \"Hero\" on behalf of the Help for Heroes charity. This song will be released as a download on Sunday 26 as a download and Monday 27 physically.","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-01","episode_number":17,"episode_type":"standard","id":511633,"name":"Elimination 4","overview":"Down to nine acts and the contestants must sing again for a place in next week's show. This week they must sing classic disco songs for the judges and the viewers at home. The viewers will then vote for their favourite and the two acts with the lowest number of votes will be forced to sing again for the judges who will then decide to save one act.","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Creative Director","credit_id":"52582d81760ee36aaa8a71d2","order":502,"adult":false,"gender":2,"id":1215879,"known_for_department":"Acting","name":"Brian Friedman","original_name":"Brian Friedman","popularity":1.674,"profile_path":"/shdqs2G5DUcvuo0aXeKSClpSDyI.jpg"},{"character":"Self - Special Guest","credit_id":"52582d81760ee36aaa8a7275","order":519,"adult":false,"gender":2,"id":66700,"known_for_department":"Acting","name":"Will Young","original_name":"Will Young","popularity":5.246,"profile_path":"/sDsdMyHpJEsyqsnFkXm86YwN67O.jpg"}]},{"air_date":"2008-11-01","episode_number":18,"episode_type":"standard","id":511634,"name":"Elimination 4 (Result)","overview":"Theme: Disco\n\nCelebrity Guest: Will Young\n\nSong performed by celebrity guest: Changes","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d81760ee36aaa8a7275","order":519,"adult":false,"gender":2,"id":66700,"known_for_department":"Acting","name":"Will Young","original_name":"Will Young","popularity":5.246,"profile_path":"/sDsdMyHpJEsyqsnFkXm86YwN67O.jpg"}]},{"air_date":"2008-11-08","episode_number":19,"episode_type":"standard","id":511632,"name":"Elimination 5","overview":"Dermot O'Leary hosts the fifth live show of the series. This week, the eight remaining acts meet Mariah Carey and must perform her songs for the judges and the viewers. The viewers will then vote for their favourite and the two acts with the lowest number of votes will sing again for the judges who will choose to save one act and send the other home.","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Creative Director","credit_id":"52582d81760ee36aaa8a71d2","order":502,"adult":false,"gender":2,"id":1215879,"known_for_department":"Acting","name":"Brian Friedman","original_name":"Brian Friedman","popularity":1.674,"profile_path":"/shdqs2G5DUcvuo0aXeKSClpSDyI.jpg"},{"character":"Self - Special Guest","credit_id":"52582d81760ee36aaa8a717a","order":507,"adult":false,"gender":1,"id":66586,"known_for_department":"Acting","name":"Mariah Carey","original_name":"Mariah Carey","popularity":15.207,"profile_path":"/5abhvNcfjv7Bhj0Jdqbgy9CwOvC.jpg"}]},{"air_date":"2008-11-08","episode_number":20,"episode_type":"standard","id":511626,"name":"Elimination 5 (Result)","overview":"Theme: Mariah Carey\n\nCelebrity Guest: Mariah Carey\n\nSong performed by celebrity guest: TBA","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d81760ee36aaa8a717a","order":507,"adult":false,"gender":1,"id":66586,"known_for_department":"Acting","name":"Mariah Carey","original_name":"Mariah Carey","popularity":15.207,"profile_path":"/5abhvNcfjv7Bhj0Jdqbgy9CwOvC.jpg"}]},{"air_date":"2008-11-15","episode_number":21,"episode_type":"standard","id":511628,"name":"Elimination 6","overview":"Theme: Best of British","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Creative Director","credit_id":"52582d81760ee36aaa8a71d2","order":502,"adult":false,"gender":2,"id":1215879,"known_for_department":"Acting","name":"Brian Friedman","original_name":"Brian Friedman","popularity":1.674,"profile_path":"/shdqs2G5DUcvuo0aXeKSClpSDyI.jpg"}]},{"air_date":"2008-11-15","episode_number":22,"episode_type":"standard","id":511630,"name":"Elimination 6 (Result)","overview":"Celebrity Guest: Leona Lewis\n\nSong performed by celebrity guest: \"Run\"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"61c361069f51af00413da141","order":536,"adult":false,"gender":1,"id":216710,"known_for_department":"Acting","name":"Leona Lewis","original_name":"Leona Lewis","popularity":2.698,"profile_path":"/cCgs7rAMbCA7AG7YNGnI6KmQoVD.jpg"}]},{"air_date":"2008-11-22","episode_number":23,"episode_type":"standard","id":511627,"name":"Elimination 7","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-22","episode_number":24,"episode_type":"standard","id":511635,"name":"Elimination 7 (Result)","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"61c363e4904f6d00406fc3d9","order":537,"adult":false,"gender":0,"id":1220231,"known_for_department":"Acting","name":"Rhydian","original_name":"Rhydian","popularity":0.6,"profile_path":null}]},{"air_date":"2008-11-29","episode_number":25,"episode_type":"standard","id":511637,"name":"Elimination 8","overview":"Five acts remain in the competition and the acts must now perform 2 songs each. This week the theme is American Classics as the contestants perform for the viewers' votes. The two acts with the lowest number of votes must then sing again for the judges Simon Cowell, Louis Walsh, Cheryl Cole and Dannii Minogue.\n\nHannah Montana star Miley Cyrus appears in this episode.","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Creative Director","credit_id":"52582d81760ee36aaa8a71d2","order":502,"adult":false,"gender":2,"id":1215879,"known_for_department":"Acting","name":"Brian Friedman","original_name":"Brian Friedman","popularity":1.674,"profile_path":"/shdqs2G5DUcvuo0aXeKSClpSDyI.jpg"}]},{"air_date":"2008-11-29","episode_number":26,"episode_type":"standard","id":511636,"name":"Elimination 8 (Result)","overview":"Theme: Songs by Britney Spears and American Classics\n\nSong performed by celebrity guests: \"Womanizer\" (Britney Spears), \"7 Things\" (Miley Cyrus)","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d81760ee36aaa8a72ea","order":516,"adult":false,"gender":1,"id":111946,"known_for_department":"Acting","name":"Britney Spears","original_name":"Britney Spears","popularity":6.74,"profile_path":"/5ClVSzj0roqRY1ff2rNnZJcWuSA.jpg"}]},{"air_date":"2008-12-06","episode_number":27,"episode_type":"standard","id":511638,"name":"Series 5 - Elimination - 9","overview":"With only four acts remaining in the competition, we reach the 9th live show of the series. The contestants must each perform 2 songs for the viewers' votes. The 2 acts with the lowest number of votes will have to sing again judges Simon Cowell, Louis Walsh, Cheryl Cole and Dannii Minogue who, for the last time, will choose an act to send home.","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Creative Director","credit_id":"52582d81760ee36aaa8a71d2","order":502,"adult":false,"gender":2,"id":1215879,"known_for_department":"Acting","name":"Brian Friedman","original_name":"Brian Friedman","popularity":1.674,"profile_path":"/shdqs2G5DUcvuo0aXeKSClpSDyI.jpg"}]},{"air_date":"2008-12-06","episode_number":28,"episode_type":"standard","id":511639,"name":"Series 5 - Elimination - 9 (Result)","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-13","episode_number":29,"episode_type":"standard","id":511640,"name":"Series 5 - The Final","overview":"There are only three acts remaining in this week's grand final. After auditions, boot camp, the mentors' houses and nine live shows, the three acts remaining in the competition sing for one last time for the audience vote. The act with the highest number of votes will be crowned The X Factor champion of 2008 winning a £1m recording contract with Simon Cowell. Dannii Minogue is the only judge with no acts left in the competition.","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - OB Presenter","credit_id":"52582d80760ee36aaa8a6f80","order":515,"adult":false,"gender":0,"id":1217443,"known_for_department":"Acting","name":"Michael Underwood","original_name":"Michael Underwood","popularity":1.553,"profile_path":null},{"character":"Self - OB Presenter","credit_id":"52582d7b760ee36aaa8a6a95","order":520,"adult":false,"gender":0,"id":1220156,"known_for_department":"Acting","name":"Jeff Brazier","original_name":"Jeff Brazier","popularity":0.631,"profile_path":null},{"character":"Self","credit_id":"52582d82760ee36aaa8a7382","order":525,"adult":false,"gender":1,"id":14386,"known_for_department":"Acting","name":"Beyoncé","original_name":"Beyoncé","popularity":5.103,"profile_path":"/8yI9Y1zmum6GsRSRKq5dC61lkYw.jpg"}]},{"air_date":"2008-12-13","episode_number":30,"episode_type":"finale","id":511641,"name":"Series 5 - The Final (Result)","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - OB Presenter","credit_id":"52582d80760ee36aaa8a6f80","order":515,"adult":false,"gender":0,"id":1217443,"known_for_department":"Acting","name":"Michael Underwood","original_name":"Michael Underwood","popularity":1.553,"profile_path":null},{"character":"Self - OB Presenter","credit_id":"52582d7b760ee36aaa8a6a95","order":520,"adult":false,"gender":0,"id":1220156,"known_for_department":"Acting","name":"Jeff Brazier","original_name":"Jeff Brazier","popularity":0.631,"profile_path":null},{"character":"Self","credit_id":"52582d82760ee36aaa8a7382","order":525,"adult":false,"gender":1,"id":14386,"known_for_department":"Acting","name":"Beyoncé","original_name":"Beyoncé","popularity":5.103,"profile_path":"/8yI9Y1zmum6GsRSRKq5dC61lkYw.jpg"}]}],"name":"Season 5","overview":"The X Factor is a British television music competition to find new singing talent. The fifth series was broadcast on ITV from 16 August 2008 until 13 December 2008. It was won by Alexandra Burke, with new judge Cheryl Cole emerging as the winning mentor. Auditions in front of producers were held in April/May, with callbacks in front of the judges in June. The number of applicants for series 5 reached an all-time high with a reported 182,000 people auditioning. A number of well-established music acts from around the world, such as Mariah Carey, Britney Spears, Miley Cyrus, Girls Aloud, Take That, Il Divo, and series 3 winner Leona Lewis performed during the live stages of the show.\n\nBurke's prize, as winner, was a £1 million recording contract with Syco Music. Her debut single, \"Hallelujah\", written by Leonard Cohen, was released for digital download at 00:01 on 14 December 2008, with the physical format following on 17 December. It was later announced that her single had become the fastest selling song of all time.","id":25295,"poster_path":null,"season_number":5,"vote_average":0},"6":{"_id":"52582d76760ee36aaa8a617b","air_date":"2009-08-22","episodes":[{"air_date":"2009-08-22","episode_number":1,"episode_type":"standard","id":511662,"name":"Auditions 1: Off To A Flying Start","overview":"Britain's biggest talent show returns for a brand new series. Judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh sift through a record-breaking number of applicants, who this year must audition in front of a studio audience and the panel. The heats start in London, before moving on to Manchester and Glasgow. Watch out for Simon and Louis falling out over a pair of Irish twins. Plus, who gives what Simon describes as 'the best first audition I have ever heard'? Dermot O'Leary hosts.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/sHX4Ojd6VV98ghUU0mB2YHOuOtY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-29","episode_number":2,"episode_type":"standard","id":511664,"name":"Series 6 - Auditions 2","overview":"Britain's biggest talent show rolls into Birmingham for auditions along with judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh and now of course, a live audience. It is Cheryl's birthday - but will it be a day to celebrate? A 22-year-old fellow Geordie girl certainly does tug at Cheryl's heart strings. And the clock is ticking for an ageing Brummie rocker still dreaming of stardom.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-05","episode_number":3,"episode_type":"standard","id":511663,"name":"Series 6 - Auditions 3","overview":"The auditions for Britain's biggest talent competition continue, as more wannabe popstars perform in front of the studio audience and judges Simon Cowell, Louis Walsh, Dannii Minogue and Cheryl Cole. As they think ahead to the mentoring stage, all the judges will be hoping for some amazing singers with real star quality. Meanwhile host Dermot O'Leary is on hand to celebrate or commiserate with the contestants.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-12","episode_number":4,"episode_type":"standard","id":511666,"name":"Series 6 - Auditions 4","overview":"Britain's biggest and best open talent competition continues with some more good, bad and unbelievable auditions from across the country. The wannabes will be performing in front of a studio audience and the panel, so they must bring an iron nerve. Who will impress judges Simon Cowell, Dannii Minogue, Cheryl Cole and Louis Walsh? Host Dermot O'Leary is on hand to celebrate success or mop up the tears.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/pXqux3tMtBcnTexMHBxVZdMrB5W.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-19","episode_number":5,"episode_type":"standard","id":511665,"name":"Series 6 - Auditions 5","overview":"With only two more auditions to go before the bootcamp stage and the assignment of the categories, judges Simon Cowell, Louis Walsh, Dannii Minogue and Cheryl Cole continue the nationwide search for a star. Host Dermot O'Leary is on hand to celebrate success or console those who are sent home.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-20","episode_number":6,"episode_type":"standard","id":511667,"name":"Series 6 - Auditions 6","overview":"It is the last leg of this year's auditions, and we will see the final group of hopefuls from the record number who applied. Judges Simon Cowell, Dannii Minogue, Cheryl Cole and Louis Walsh are on a whistle stop tour of Britain to find any other potential winners out there. The wannabes must perform in front of the judges and a large studio audience, so they will need a strong constitution. But host Dermot O'Leary will be there to offer a shoulder to cry on if they need it. Who will make it through?","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/eBlcSZmD5tAqwkltSLGjG8khlh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-26","episode_number":7,"episode_type":"standard","id":511642,"name":"Series 6 - Boot Camp 1","overview":"The successful auditionees head to London's Hammersmith Apollo for the biggest bootcamp ever. Judges Simon Cowell, Dannii Minogue, Louis Walsh and Cheryl Cole will be putting 200 acts through their paces. Who will be able to handle the pressure and stand out from the crowd, and who will be heading home? After this first challenge, only 50 acts can go through to the next bootcamp stage. Host Dermot O'Leary is on hand to offer condolences to the unlucky and celebrate with the chosen few.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/fkk5GstvZbpr23cUCzTimUkBsod.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-27","episode_number":8,"episode_type":"standard","id":511644,"name":"Series 6 - Boot Camp 2","overview":"Join host Dermot O'Leary for the second in our bootcamp weekend double bill. The 50 remaining acts must perform again in front of an audience of thousands. Each singer has been able to practise overnight, and today is their last chance to impress judges Simon Cowell, Dannii Minogue, Cheryl Cole and Louis Walsh. The panel must now start choosing the performers they believe can go all the way. Who will make it into the final 24?","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/9JQxmrRcxE1EAqfMenEekjQ23Dd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-03","episode_number":9,"episode_type":"standard","id":511645,"name":"Judges Houses 1: Singing For Survival","overview":"The X Factor goes global, as the 24 remaining acts jet off around the world to the judges' houses. Simon is at his home in Los Angeles, while Cheryl is in Marrakech, Louis is in Italy and Dannii is in Dubai. The judges are joined by Kylie Minogue, Will Young, Ronan Keating and Sinitta, who will be helping them make the tough decisions needed to whittle down the contestants to the final 12. Host Dermot O'Leary is on hand to support the singers as they face their biggest performance so far.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/5cjGccwklHyAeDFLJHSFxM64Egv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Guest Judge","credit_id":"577d172bc3a36842d7003168","order":532,"adult":false,"gender":2,"id":215820,"known_for_department":"Acting","name":"Ronan Keating","original_name":"Ronan Keating","popularity":3.364,"profile_path":"/v7ofKk5F50zRTjgkvK9A8hzWiKf.jpg"}]},{"air_date":"2009-10-04","episode_number":10,"episode_type":"standard","id":511643,"name":"Series 6 - Boot Camp 4","overview":"It is make or break time for the 24 remaining hopefuls - at the end of today's show they will find out whether they have been chosen for the live stages. There are only three places in each category, so judges Simon Cowell, Dannii Minogue, Cheryl Cole and Louis Walsh have some big decisions to make. Host Dermot O'Leary is on hand to support the contestants.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-10","episode_number":11,"episode_type":"standard","id":511647,"name":"Series 6 - Elimination - 1","overview":"It's the moment of truth for the final 12 as they perform live in front of the nation... with the first of two live shows as the final 12 sing live - and the judges each mentor one category of singers. Simon Cowell has the over 25s, Cheryl Cole has the boys, Dannii Minogue has the girls and Louis Walsh has the groups. Host Dermot O'Leary will be on hand to deal with the war of words as the judges give their views on each performance and defend their acts - one of which will leave the competition.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"52582d82760ee36aaa8a7475","order":501,"adult":false,"gender":2,"id":80535,"known_for_department":"Acting","name":"Robbie Williams","original_name":"Robbie Williams","popularity":3.886,"profile_path":"/u17YN87MjtKKoVZhZu4EVNNIzFV.jpg"}]},{"air_date":"2009-10-11","episode_number":12,"episode_type":"standard","id":511646,"name":"Series 6 - Elimination - 1 (Result)","overview":"It's a brand new live Sunday night results show as the final 12 discover the outcome of the public vote. The two acts with the lowest number of votes will sing for survival in the final showdown. Then it is up to the judges to decide who stays to sing another day and who is out of the competition. Last year's winner Alexandra Burke gives the first performance of her new single - and in a world exclusive Robbie Williams is back performing live!","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"61c3656fd05a0300987035e4","order":539,"adult":false,"gender":2,"id":80535,"known_for_department":"Acting","name":"Robbie Williams","original_name":"Robbie Williams","popularity":3.886,"profile_path":"/u17YN87MjtKKoVZhZu4EVNNIzFV.jpg"}]},{"air_date":"2009-10-17","episode_number":13,"episode_type":"standard","id":511648,"name":"Live Show 2: Diva Week","overview":"Watch all 11 acts strut their stuff as they make their claim to The X Factor throne.  Tonight the competition really hots up, and Whitney Houston is a special guest tomorrow night. Louis Walsh will be absent from both shows as he attends Stephen Gately's funeral in Dublin.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-18","episode_number":14,"episode_type":"standard","id":511649,"name":"Live Results 2 : And Then There Were Ten","overview":"Join host Dermot O'Leary live as the 11 remaining acts find out the results of the public vote. The two acts with the lowest number of votes must sing for survival in the final showdown. Then it is up to the judges to decide who stays to sing another day and who leaves the competition. Plus the legendary Whitney Houston performs live, in her first UK TV appearance in 12 years.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/5S85TgGC51QlS6UV2QMUUYugoIR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-24","episode_number":15,"episode_type":"standard","id":511650,"name":"Live Show 3: Big Band Week","overview":"The 10 remaining acts battle it out to win the public's votes and stay in the competition. Today's theme is Big Band, which means the contestants must face the challenge of singing with a full orchestra. How will they get on? Judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh will be keen to support the acts they are mentoring, and host Dermot O'Leary is on hand to keep everyone going as the tension mounts.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/m1kDMszTKJTpUTAWt3ObTYAVXNs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-25","episode_number":16,"episode_type":"standard","id":511654,"name":"Series 6 - Elimination - 3 (Result)","overview":"Join Dermot O'Leary live for the results of the public vote. The two acts with the lowest number of votes must perform again in the final showdown. Then judges Louis Walsh, Dannii Minogue, Simon Cowell and Cheryl Cole will decide who stays to sing another day and who leaves the competition. Plus Michael Bublé and Westlife are live on stage.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/mWG6XDblOHd07ikyrHH3D9KK2uL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-31","episode_number":17,"episode_type":"standard","id":511652,"name":"Series 6 - Elimination - 4","overview":"All the performances and much more from The X Factor's very first Rock week.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/w9IR5KDqosPjILEFTn4dchAoUpp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-01","episode_number":18,"episode_type":"standard","id":511651,"name":"Series 6 - Elimination - 4 (Result)","overview":"Dermot O'Leary hosts the all-new Sunday night X Factor results show, as the nine acts find out the results of the public vote. The two with the lowest number of votes will sing for survival in the final showdown, then it is up to the judges to decide who stays to sing another day and who leaves the competition. Plus Bon Jovi and JLS perform.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/wi081QZ5g9wTfQ0vrfxkzsVFgi1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-07","episode_number":19,"episode_type":"standard","id":511653,"name":"Series 6 - Elimination - 5","overview":"The battle for the crown continues as the eight remaining acts step onto Britain's biggest stage for the fifth live show. Each of the performers will be hoping to impress the voting audience at home as well as judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh. Host Dermot O'Leary will be on hand to deal with the war of words as the judges give their views on each performance and defend their singers. Next time, one act will be leaving the competition.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/97EoY39ZhTxhBIWAymudD6R3MM2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-08","episode_number":20,"episode_type":"standard","id":511655,"name":"Series 6 - Elimination - 5 (Result)","overview":"Dermot O'Leary hosts the live results show. The remaining performers will be on tenterhooks as the results of the public vote are revealed, as the two acts with the lowest number of votes must sing for their survival in the final showdown. Who will judges Simon Cowell, Dannii Minogue, Cheryl Cole and Louis Walsh choose to send home? Plus performance from Leona Lewis and the Black Eyed Peas.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/hYSqRPzKesN8Sykf44gHEdmtXQp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-14","episode_number":21,"episode_type":"standard","id":511656,"name":"Series 6 - Elimination - 6","overview":"Only seven acts remain and the competition will be getting fiercer than ever as the performers battle it out to stay in the running. Judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh will be on the edges of their seats as they support the singers they are mentoring, while host Dermot O'Leary is on hand to deal with all the tears and triumphs. Who will impress the judges - and the voting public - today?","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-15","episode_number":22,"episode_type":"standard","id":511657,"name":"Series 6 - Elimination - 6 (Result)","overview":"It is time for the seven remaining acts to find out the result of the public vote. The two acts with the lowest numbers of votes must sing for survival in the final showdown. Then judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh will decide who stays in the competition and who is sent home. Plus there is a guest performance by Colombian pop superstar Shakira. Hosted by Dermot O'Leary.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/v8mN9l7bPTonVt4F65XNCFjU6t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-21","episode_number":23,"episode_type":"standard","id":511658,"name":"Live Show 7: Wham! Week","overview":"There are only six acts remaining in the competition, and today they must sing live again in a battle to win the biggest prize in pop. Also fighting it out are judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh, who are each mentoring one category of singers. Host Dermot O'Leary will be on hand to deal with all the tears and triumphs.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/virSa5RYXY1lElQWioJvPIUCF4R.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-22","episode_number":24,"episode_type":"standard","id":511660,"name":"Live Results 7: Who Will Stay And Who Will Go Go?","overview":"It is time to reveal the results of the public vote. The two acts with the fewest votes will have to perform again in a sing-off, and then it is up to the judges to decide who stays in the competition and who is eliminated. Plus there are live performances from Mariah Carey and Susan Boyle. Hosted by Dermot O'Leary.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/38QDQ3QU5diGV0TiMtuS40mLvMy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-28","episode_number":25,"episode_type":"standard","id":511659,"name":"Live Show 8: Take That & Elton John Week","overview":"It is the eighth live show, and with only five acts remaining, the pressure is really on to make an impression on both the judges and the voters at home. Panellists Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh will be rooting for the performers in their categories, while host Dermot O'Leary is on hand to deal with all the tears and triumphs.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/ueB8IJ8Xl6OXYt8OTnEk3tjX5IA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-29","episode_number":26,"episode_type":"standard","id":511661,"name":"Series 6 - Elimination - 8 (Result)","overview":"Dermot O'Leary reveals the results of the latest public vote. The two acts with the fewest votes must take part in a sing-off, and then judges Simon Cowell, Dannii Minogue, Louis Walsh and Cheryl Cole decide who stays to compete in the quarter-finals, and who must leave for good. Also featuring live performances from Rihanna and Alicia Keys.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-05","episode_number":27,"episode_type":"standard","id":511668,"name":"Series 6 - Elimination - 9","overview":"Dermot O'Leary hosts the semi-finals. The four remaining acts - Danyl, Joe, Olly and Stacey - must perform two songs each, and it will be up to them to really sing their hearts out if they are to be in with a chance of making it to next week's final. Judges Cheryl Cole, Simon Cowell, Dannii Minogue and Louis Walsh will be crossing their fingers for their favoured acts. Who will impress the panel and the voters at home?","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/1Xfi2JPEYDf9J36XqrqTAJUHJ0b.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-06","episode_number":28,"episode_type":"standard","id":511669,"name":"Series 6 - Elimination - 9 (Result)","overview":"Lady Gaga and Janet Jackson perform in tonight's show, as Dermot O'Leary reveals which performers will have to fight for survival in a sing-off. The bottom two acts will face the judges again, and one will be eliminated, losing their chance of competing in next week's final. Who is going home today?","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/uZT0F3oSAaQUdufaMH9sQiZOWfA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-12","episode_number":29,"episode_type":"standard","id":511670,"name":"Series 6 - The Final","overview":"It is the final! Hundreds of thousands of hopefuls came to the nationwide auditions, but now only three acts remain to battle it out for the title - and one will be going home today. At stake is the biggest prize in pop - a life-changing record contract and the release of their debut single. Judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh are also joining in the race to the finish line, as they cross their fingers for their own acts. Plus some amazing international guest stars will be appearing. Hosted by Dermot O'Leary.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/cyq5WtIg3KAZ18CdqNIeIGfdoFm.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52582d84760ee36aaa8a7698","adult":false,"gender":0,"id":1244790,"known_for_department":"Directing","name":"Jonathan Bullen","original_name":"Jonathan Bullen","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2009-12-13","episode_number":30,"episode_type":"finale","id":511671,"name":"Series 6 - The Final (Result)","overview":"Now the moment the nation has been waiting for arrives, as Dermot O'Leary reveals who the public has crowned 2009 X Factor champion. Joining Dermot and the remaining two acts are judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh, as well as more international guest stars. The final two acts each perform what will become the winner's first single. Then at last the suspense is over and we discover which act has taken the prize.","production_code":"","runtime":60,"season_number":6,"show_id":13999,"still_path":"/jRIzm4JRO2tBnlthFDYel4bHrvN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"The X Factor is a British television music competition to find new singing talent. The sixth series started on ITV on 22 August 2009 and was won by Joe McElderry on 13 December 2009. Cheryl Cole emerged as the winning mentor for the second consecutive year, the first time in the show's history that a mentor has won back-to-back series. The show was presented by Dermot O'Leary, with spin-off show The Xtra Factor hosted by Holly Willoughby on ITV2.\n\nPublic auditions by aspiring singers began in June 2009 and were held in five cities across the UK. Judges Simon Cowell, Dannii Minogue, Louis Walsh, and Cheryl Cole returned to judge the contestants, with auditions being held in front of a live audience for the first time. Following initial auditions, the \"Boot camp\" stage took place in August 2009, where the number of contestants was narrowed down to 24. The 24 contestants were split into their categories, Boys, Girls, Over 25s and Groups, and given a judge to mentor them at the \"Judges' houses\" stage and throughout the finals.\n\nDuring \"Judges' houses\", the 24 acts were reduced to twelve, who went on to the live finals, with one act being eliminated each week by a combination of public vote and judges' decision until a winner was found. The live shows started on 10 October 2009. The acts performed every Saturday night with the results announced on Sundays. This was change of format from previous series in which the results were announced later on the Saturday evening.","id":25296,"poster_path":"/541JuoF0vwgXYaMNessIxK0cOSB.jpg","season_number":6,"vote_average":0},"7":{"_id":"52582d76760ee36aaa8a618f","air_date":"2010-08-21","episodes":[{"air_date":"2010-08-21","episode_number":1,"episode_type":"standard","id":511684,"name":"Auditions 1: Glasgow welcomes Geri!","overview":"With Dannii looking after her mini Minogue the panel of power welcomed the first of our celebrity guest judges in Glasgow, the notoriously never lost for words, formally ginger, Geri Halliwell.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":"/peVi8LsCAwJoDsy5BrI7uguxhpz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-28","episode_number":2,"episode_type":"standard","id":511683,"name":"Auditions 2: Dublin welcomes Katy Perry!","overview":"Guest judge Katy Perry helps Simon Cowell, Cheryl Cole and Louis Walsh select the best solo singers and groups in Dublin as the auditions move to Louis's native Republic of Ireland for the first time since 2006.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":"/9DUIAUnt5wHN9CHkdqN4m9cCDE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"5e11ffc2d64ac2001463a97e","order":534,"adult":false,"gender":1,"id":2500849,"known_for_department":"Acting","name":"Mary Byrne","original_name":"Mary Byrne","popularity":0.98,"profile_path":"/ldFquf7xvWUsceXhvTvtsij7Y6p.jpg"}]},{"air_date":"2010-09-04","episode_number":3,"episode_type":"standard","id":511686,"name":"Auditions 3: Birmingham welcomes Natalie Imbruglia!","overview":"Guest judge Natalie Imbruglia helps Simon Cowell, Cheryl Cole and Louis Walsh select the best solo singers and groups at the auditions in Birmingham, where highlights include a female duo whose attitude fails to impress Simon. Plus, more from London, where a pair of twins from Paris bring back memories of Jedward for the judges.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":"/i7EvuyUpMOHgxcXEFtcuuOxwO6F.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-11","episode_number":4,"episode_type":"standard","id":511685,"name":"Auditions 4: Cardiff welcomes Pixie Lott!","overview":"Pixie Lott helps Simon Cowell, Cheryl Cole and Louis Walsh put through the best solo acts and groups as the auditions reach Cardiff, where last year the judges discovered Lucie Jones and Lloyd Daniels, who would go on to reach the live finals.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":"/jEv857PWkrqsR9smdMEF2ZVpYxF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-18","episode_number":5,"episode_type":"standard","id":511680,"name":"Series 7 - Auditions 5","overview":"In the first of two shows from Manchester bringing the 2010 auditions to a close, Simon Cowell and Louis Walsh are joined by Pussycat Dolls lead singer Nicole Scherzinger on the judges' panel, but have to make do without Cheryl Cole, who was recovering from malaria when this double bill was filmed.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":"/7B98W9KgJIk0DYGiUKxsVY7bx6k.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-19","episode_number":6,"episode_type":"standard","id":511690,"name":"Auditions 6: Manchester Day 2","overview":"With Cheryl Cole still absent, the contestants in Manchester have one last chance to impress Simon Cowell, Louis Walsh and guest judge Nicole Scherzinger in the final audition show before boot camp begins next week.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":"/tvAfKxHDQAuvCiRlvb4uAnZZ3IX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"570659f3c3a3685d4c0022c6","order":527,"adult":false,"gender":2,"id":1052109,"known_for_department":"Acting","name":"Harry Styles","original_name":"Harry Styles","popularity":33.19,"profile_path":"/l4sBFHHKlfrHDFxyupoXYPPAb4j.jpg"}]},{"air_date":"2010-09-25","episode_number":7,"episode_type":"standard","id":511689,"name":"Boot Camp 1","overview":"The first of this weekend’s bootcamp double bill, as the cream of the crop from the nationwide auditions head to London. Over 200 acts will be tested to the limit at Wembley Arena in the biggest bootcamp ever. They will face choreography, vocal coaching and styling sessions as they try to stand out from the crowd. Those that make it through the first challenges will get to perform centre stage in front of Simon Cowell, Louis Walsh and guest judge and Pussycat Doll Nicole Scherzinger. Host Dermot O’Leary will be there at every step of the way as we find out who makes it through and who heads home.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"570659f3c3a3685d4c0022c6","order":527,"adult":false,"gender":2,"id":1052109,"known_for_department":"Acting","name":"Harry Styles","original_name":"Harry Styles","popularity":33.19,"profile_path":"/l4sBFHHKlfrHDFxyupoXYPPAb4j.jpg"},{"character":"Self - Contestant","credit_id":"57065a2ec3a3685d44002274","order":528,"adult":false,"gender":2,"id":1146050,"known_for_department":"Acting","name":"Zayn Malik","original_name":"Zayn Malik","popularity":8.458,"profile_path":"/nzCk09tN15NOMpKPoCwegcJnx3j.jpg"},{"character":"Self - Contestant","credit_id":"57065a3e9251411f3c00222b","order":529,"adult":false,"gender":2,"id":1052108,"known_for_department":"Acting","name":"Liam Payne","original_name":"Liam Payne","popularity":5.507,"profile_path":"/qEcguZf134qEvshZRzAcfChll7c.jpg"}]},{"air_date":"2010-09-26","episode_number":8,"episode_type":"standard","id":511687,"name":"Boot Camp 2","overview":"It is the second of this weekend’s bootcamp double bill. The solo performances continue as one by one, the acts take to the biggest stage yet. No-one can afford to slip up as they face Simon Cowell, Louis Walsh and guest judge and Pussycat Doll Nicole Scherzinger. Tonight, the judges decide who they believe could go all the way as they reveal who makes it to judges’ houses. Host Dermot O’ Leary will be there every step of the way as we find out who makes it through and who heads home.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"570659f3c3a3685d4c0022c6","order":527,"adult":false,"gender":2,"id":1052109,"known_for_department":"Acting","name":"Harry Styles","original_name":"Harry Styles","popularity":33.19,"profile_path":"/l4sBFHHKlfrHDFxyupoXYPPAb4j.jpg"},{"character":"Self - Contestant","credit_id":"57065a2ec3a3685d44002274","order":528,"adult":false,"gender":2,"id":1146050,"known_for_department":"Acting","name":"Zayn Malik","original_name":"Zayn Malik","popularity":8.458,"profile_path":"/nzCk09tN15NOMpKPoCwegcJnx3j.jpg"},{"character":"Self - Contestant","credit_id":"57065a3e9251411f3c00222b","order":529,"adult":false,"gender":2,"id":1052108,"known_for_department":"Acting","name":"Liam Payne","original_name":"Liam Payne","popularity":5.507,"profile_path":"/qEcguZf134qEvshZRzAcfChll7c.jpg"},{"character":"Self - Contestant","credit_id":"57065a70c3a3685d38002838","order":535,"adult":false,"gender":2,"id":1052107,"known_for_department":"Acting","name":"Niall Horan","original_name":"Niall Horan","popularity":4.728,"profile_path":"/uNTmtPViI8UNTlS1u46RlgpoOZy.jpg"}]},{"air_date":"2010-10-02","episode_number":9,"episode_type":"standard","id":511688,"name":"Judges Houses 1","overview":"Those who have made it through travel to the judges houses where they have one last chance to impress before the judges decide who they will put through to the live stages of the competition.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":"/lNhqGrcTVV0L2o2RV9Wh7ui13Q1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-03","episode_number":10,"episode_type":"standard","id":511692,"name":"Judges Houses 2","overview":"The judges reveal who has made it through to the live finals.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":"/nZFnFvZN0RHbzwUK6k9en6DHbyk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-09","episode_number":11,"episode_type":"standard","id":511691,"name":"Live Show 1","overview":"Tonights theme: Number one Singles.\n\nDermot O'Leary hosts the first of the live shows. Thousands of singers auditioned across the UK and their numbers have been whittled down so that now only the 12 finalists remain to battle it out for a life-changing record contract. Each finalist is mentored by one of the judges - Dannii Minogue returns from maternity leave to support the boys, Cheryl Cole looks after the girls, Simon Cowell is mentoring the groups and Louis Walsh is helping the contestants in the new over-28s category. Tomorrow night, the first act will leave the competition.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-10","episode_number":12,"episode_type":"standard","id":511695,"name":"Live Results Show 1","overview":"Dermot O'Leary reveals how the public has voted in the first live results show. The acts with the fewest number of votes must sing again in the final showdown, and then it is up to the judges to decide who will be leaving the competition. Plus last year's winner Joe McElderry gives the first performance of his new single.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"57065c6ac3a3685d3e0023d9","order":530,"adult":false,"gender":2,"id":57108,"known_for_department":"Acting","name":"Usher","original_name":"Usher","popularity":2.156,"profile_path":"/5LGTj79RPTJdBD19E30HtItbx5y.jpg"}]},{"air_date":"2010-10-16","episode_number":13,"episode_type":"standard","id":511693,"name":"Live Show 2","overview":"Tonights theme: Heroes.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-17","episode_number":14,"episode_type":"standard","id":511694,"name":"Live Results Show 2","overview":"Join host Dermot O'Leary live as the 11 remaining acts find out the results of the public vote. The two acts with the lowest number of votes must sing for survival in the final showdown. Then it is up to the judges to decide who stays to sing another day and who leaves the competition.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"57065d55c3a3685d3e002414","order":531,"adult":false,"gender":1,"id":111455,"known_for_department":"Acting","name":"Katy Perry","original_name":"Katy Perry","popularity":8.47,"profile_path":"/mOz6ZSj6QeUQfsT0y2offrKVCKR.jpg"}]},{"air_date":"2010-10-23","episode_number":15,"episode_type":"standard","id":511696,"name":"Live Show 3","overview":"The 10 remaining acts battle it out to win the public's votes and stay in the competition.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-24","episode_number":16,"episode_type":"standard","id":511674,"name":"Series 7 - Elimination - 3 (Result)","overview":"Join Dermot O'Leary live for the results of the public vote. The two acts with the lowest number of votes must perform again in the final showdown. Then judges Louis Walsh, Dannii Minogue, Simon Cowell and Cheryl Cole will decide who stays to sing another day and who leaves the competition.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Special Guest","credit_id":"52582d80760ee36aaa8a6f22","order":538,"adult":false,"gender":2,"id":21860,"known_for_department":"Acting","name":"Michael Bublé","original_name":"Michael Bublé","popularity":4.115,"profile_path":"/mXGgDOQE0fm1BaRERamaq3kGev3.jpg"}]},{"air_date":"2010-10-30","episode_number":17,"episode_type":"standard","id":511681,"name":"Series 7 - Elimination - 4","overview":"Live Show","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-31","episode_number":18,"episode_type":"standard","id":511682,"name":"Live Results Show 4","overview":"Dermot O'Leary hosts the all-new Sunday night X Factor results show, as the nine acts find out the results of the public vote. The two with the lowest number of votes will sing for survival in the final showdown, then it is up to the judges to decide who stays to sing another day and who leaves the competition","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-06","episode_number":19,"episode_type":"standard","id":511676,"name":"Live Show 5","overview":"The battle for the crown continues as the eight remaining acts step onto Britain's biggest stage for the fifth live show. Each of the performers will be hoping to impress the voting audience at home as well as judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh. Host Dermot O'Leary will be on hand to deal with the war of words as the judges give their views on each performance and defend their singers. Next time, one act will be leaving the competition.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-07","episode_number":20,"episode_type":"standard","id":511697,"name":"Live Results Show 5","overview":"Dermot O'Leary hosts the live results show. The remaining performers will be on tenterhooks as the results of the public vote are revealed, as the two acts with the lowest number of votes must sing for their survival in the final showdown.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-13","episode_number":21,"episode_type":"standard","id":511675,"name":"Live Show 6","overview":"Only seven acts remain and the competition will be getting fiercer than ever as the performers battle it out to stay in the running. Judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh will be on the edges of their seats as they support the singers they are mentoring","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-14","episode_number":22,"episode_type":"standard","id":511700,"name":"Live Results Show 6","overview":"It is time for the seven remaining acts to find out the result of the public vote. The two acts with the lowest numbers of votes must sing for survival in the final showdown. Then judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh will decide who stays in the competition and who is sent home.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-20","episode_number":23,"episode_type":"standard","id":511699,"name":"Series 7 - Elimination - 7","overview":"here are only six acts remaining in the competition, and today they must sing live again in a battle to win the biggest prize in pop. Also fighting it out are judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh, who are each mentoring one category of singers. Host Dermot O'Leary will be on hand to deal with all the tears and triumphs.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-21","episode_number":24,"episode_type":"standard","id":511698,"name":"Live Results Show 7","overview":"t is time to reveal the results of the public vote. The two acts with the fewest votes will have to perform again in a sing-off, and then it is up to the judges to decide who stays in the competition and who is eliminated.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-27","episode_number":25,"episode_type":"standard","id":511672,"name":"Live Show 8","overview":"It is the eighth live show, and with only five acts remaining, the pressure is really on to make an impression on both the judges and the voters at home. Panellists Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh will be rooting for the performers in their categories","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-28","episode_number":26,"episode_type":"standard","id":511673,"name":"Series 7 - Elimination - 8 (Result)","overview":"Dermot O'Leary reveals the results of the latest public vote. The two acts with the fewest votes must take part in a sing-off, and then judges Simon Cowell, Dannii Minogue, Louis Walsh and Cheryl Cole decide who stays to compete in the quarter-finals, and who must leave for good.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-04","episode_number":27,"episode_type":"standard","id":511677,"name":"Series 7 - Elimination - 9","overview":"The battle to win the biggest prize in pop moves a step closer as the show reaches the semi-final. The remaining acts each sing two songs live in a bid to win viewers' votes. Also fighting for the acts they have mentored are judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh, while host Dermot O'Leary is on hand to deal with the triumphs and tears.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-05","episode_number":28,"episode_type":"standard","id":511678,"name":"Series 7 - Elimination - 9 (Result)","overview":"Britain has been voting over the last 24 hours and now the semi-finalists find out the result of the public vote. The act with the fewest votes will leave the competition, and the others will compete in next week's final. Including live performances from the cast of hit US series Glee, former X Factor winner Alexandra Burke and chart-topping group the Black Eyed Peas. Hosted by Dermot O'Leary.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-11","episode_number":29,"episode_type":"standard","id":511679,"name":"The Final 2010","overview":"The finalists go head to head as they sing live in a bid to win this year's competition and bag a life-changing recording contract. Also battling it out are judges Simon Cowell, Louis Walsh, Dannii Minogue and Cheryl Cole, while host Dermot O'Leary is on hand to keep the warring parties at bay. Plus there will be performances by some amazing international guest stars. The voting lines open tonight as the countdown starts - tomorrow night, one act will win the X Factor.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-12","episode_number":30,"episode_type":"finale","id":511701,"name":"The Final 2010 Results","overview":"Britain has been voting for 24 hours and the finalists face a nail-biting wait to find out the results of the public vote. Joining them for the biggest pop event of the year are judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh as well as more top international guest stars. The two finalists left battling for the crown after the third-placed act has gone home will perform what will become the winner's single. Then it is the moment that everybody has been waiting for as Dermot O'Leary announces the winner of The X Factor 2010.","production_code":"","runtime":60,"season_number":7,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"The X Factor is a British television music competition to find new singing talent. The seventh series started on ITV on 21 August 2010 and ended on 12 December 2010. The winner was Matt Cardle and his debut single \"When We Collide\" was released after the final. Cardle was mentored throughout by Dannii Minogue, who won as mentor for the second time. A total of 15,448,019 votes were cast throughout the series. It was presented by Dermot O'Leary, with spin-off show The Xtra Factor hosted by Konnie Huq on ITV2, who took over from Holly Willoughby.\n\nThe competition was split into several stages: auditions, bootcamp, judges' houses and live shows. Auditions took place throughout June and July 2010, with Simon Cowell, Louis Walsh and Cheryl Cole returning as judges. Special guest judges were brought in to replace Minogue, who was on maternity leave. Cole missed the auditions in Manchester and bootcamp because she had malaria. Following bootcamp, successful acts were split into four categories: Boys, Girls, Over 28s and Groups. Minogue returned for the judges' houses stage, and each judge mentored eight acts through judges' houses. The live shows started on 9 October 2010. Four acts eliminated at judges' houses were brought back as wildcards, making this the first series to have 16 acts perform in the live shows. This series was the last with Cowell, Minogue and Cole as judges, as Gary Barlow, Kelly Rowland and Tulisa Contostavlos replaced them in series 8.","id":25297,"poster_path":null,"season_number":7,"vote_average":0},"8":{"_id":"52582d76760ee36aaa8a619d","air_date":"2011-08-20","episodes":[{"air_date":"2011-08-20","episode_number":1,"episode_type":"standard","id":511704,"name":"Auditions 1","overview":"The first set of hopefuls audition in front of the judges hoping to gain a place in the next round of the competition. Dermot is on hand to console those who fail to make it through. Frankie Cocozza and Kitty Brucknell are amongst the successful acts who manage to make it through to boot camp. Raymond Harding and Wendy Davis fail to impress though and find their hopes dashed at the first hurdle. Goldie Cheung shocks Gary when she gives him a lap dance and ends up making it through to boot camp.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-27","episode_number":2,"episode_type":"standard","id":511703,"name":"Auditions 2","overview":"Dermot O'Leary hosts the second round of auditions, which come from London and Liverpool. Louis Walsh and new judges Gary Barlow, Kelly Rowland and Tulisa Contostavlos are hoping to find talented future stars, but have this week's crop of hopefuls got what it takes to impress them? Strutting their stuff this week are a 45-year-old from Harrow who hopes that this is his chance to shine, a 20-year-old Romeo who professes his love for Kelly and a band whose line-up was finalised only weeks ago. Can they hit the right note with the panel?","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-03","episode_number":3,"episode_type":"standard","id":511702,"name":"Auditions 3","overview":"Dermot O'Leary hosts the third set of auditions in the search for a new pop sensation. Judges Louis Walsh, Gary Barlow, Kelly Rowland and Tulisa Contostavlos are on the hunt for outstanding talent, but will they find what they are looking for? This week, the tryouts move to a new city, where hopeful performers have lined up for their chance to sing for the panel. Dermot is on hand to celebrate or commiserate with the contestants.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-10","episode_number":4,"episode_type":"standard","id":511705,"name":"Auditions 4","overview":"Dermot O'Leary presents the fourth set of auditions from Britain's biggest singing competition. Judges Louis Walsh, Kelly Rowland, Tulisa Contostavlos and Gary Barlow continue their star search across the country, but will today's crop of hopeful performers be able to impress them? Dermot is on hand to celebrate or commiserate with the contestants.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-11","episode_number":5,"episode_type":"standard","id":511706,"name":"Auditions 5","overview":"Dermot O'Leary presents the fifth set of auditions. Judges Gary Barlow, Kelly Rowland, Tulisa Contostavlos and Louis Walsh are on the lookout for a potential star of the future, but will any of today's contestants live up to the panel's high expectations?","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-17","episode_number":6,"episode_type":"standard","id":511708,"name":"Auditions 6","overview":"Dermot O'Leary presents the sixth set of auditions. Judges Gary Barlow, Kelly Rowland, Tulisa Contostavlos and Louis Walsh are on the lookout for a potential star of the future, but will any of today's contestants live up to the panel's high expectations?","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-18","episode_number":7,"episode_type":"standard","id":511707,"name":"Auditions 7","overview":"Dermot O'Leary presents the seventh set of auditions. Judges Gary Barlow, Kelly Rowland, Tulisa Contostavlos and Louis Walsh are on the lookout for a potential star of the future, but will any of today's contestants live up to the panel's high expectations?","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-24","episode_number":8,"episode_type":"standard","id":511711,"name":"Bootcamp 1","overview":"The successful auditionees head to London's Hammersmith Apollo for the biggest bootcamp ever. Judges Simon Cowell, Dannii Minogue, Louis Walsh and Cheryl Cole will be putting 200 acts through their paces. Who will be able to handle the pressure and stand out from the crowd, and who will be heading home? After this first challenge, only 50 acts can go through to the next bootcamp stage. Host Dermot O'Leary is on hand to offer condolences to the unlucky and celebrate with the chosen few.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-25","episode_number":9,"episode_type":"standard","id":511710,"name":"Bootcamp 2","overview":"Join host Dermot O'Leary for the second in our bootcamp weekend double bill. The 50 remaining acts must perform again in front of an audience of thousands. Each singer has been able to practise overnight, and today is their last chance to impress judges Simon Cowell, Dannii Minogue, Cheryl Cole and Louis Walsh. The panel must now start choosing the performers they believe can go all the way. Who will make it into the final 24?","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-01","episode_number":10,"episode_type":"standard","id":511709,"name":"Judges Houses 1","overview":"The remaining acts jet off around the world to the judges' homes, where they will battle it out for a place in the final 16. Each panellist is joined by a celebrity guest mentor to help them whittle down the list of acts. Who will make it through to the live shows?","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-02","episode_number":11,"episode_type":"standard","id":511712,"name":"Judges Houses 2","overview":"In four locations around the world, it is make or break time for the remaining hopefuls as they find out whether or not they have made it to the live shows. Judges Kelly Rowland, Tulisa Contostavlos, Louis Walsh and Gary Barlow have some big decisions to make as they work out who they are sending to the final 16.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-08","episode_number":12,"episode_type":"standard","id":511714,"name":"Live Show 1","overview":"After weeks of gruelling auditions, the remaining 16 contestants have reached the live rounds. Dermot O'Leary presents the first of the live shows, in which the finalists perform for the judges, the audience and the viewers at home. Gary Barlow is mentoring the boys, Kelly Rowland is looking after the girls, Louis Walsh is helping the over-28s and Tulisa Contostavlos takes charge of the groups.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-09","episode_number":13,"episode_type":"standard","id":511713,"name":"Live Show 1 Results","overview":"Dermot O'Leary hosts the live results show in which the finalists find out who is going home. There will be tears and drama as no-one wants to leave the competition in the first week. Plus 2010 winner Matt Cardle returns with the first-ever performance of his new single.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-15","episode_number":14,"episode_type":"standard","id":511715,"name":"Live Show  2","overview":"Watch all 11 acts strut their stuff as they make their claim to The X Factor throne.  Tonight the competition really hots up, and Whitney Houston is a special guest tomorrow night.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-16","episode_number":15,"episode_type":"standard","id":511716,"name":"Live Show 2 Results","overview":"Join host Dermot O'Leary live as the 11 remaining acts find out the results of the public vote. The two acts with the lowest number of votes must sing for survival in the final showdown. Then it is up to the judges to decide who stays to sing another day and who leaves the competition","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-22","episode_number":16,"episode_type":"standard","id":511718,"name":"Live Show 3","overview":"The 10 remaining acts battle it out to win the public's votes and stay in the competition.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-23","episode_number":17,"episode_type":"standard","id":511717,"name":"Live show 3 Results","overview":"Join Dermot O'Leary live for the results of the public vote. The two acts with the lowest number of votes must perform again in the final showdown. Then judges Louis Walsh, Dannii Minogue, Simon Cowell and Cheryl Cole will decide who stays to sing another day and who leaves the competition","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-29","episode_number":18,"episode_type":"standard","id":511719,"name":"Live Show 4","overview":"All the performances and much more from The X Factor's","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-30","episode_number":19,"episode_type":"standard","id":511720,"name":"Live Show 4 Results","overview":"Dermot O'Leary hosts the all-new Sunday night X Factor results show, as the nine acts find out the results of the public vote. The two with the lowest number of votes will sing for survival in the final showdown, then it is up to the judges to decide who stays to sing another day and who leaves the competition.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-05","episode_number":20,"episode_type":"standard","id":511722,"name":"Live Show 5","overview":"The battle for the crown continues as the eight remaining acts step onto Britain's biggest stage for the fifth live show. Each of the performers will be hoping to impress the voting audience at home as well as judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh. Host Dermot O'Leary will be on hand to deal with the war of words as the judges give their views on each performance and defend their singers. Next time, one act will be leaving the competition.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-06","episode_number":21,"episode_type":"standard","id":511721,"name":"Live Show 5 Results","overview":"Dermot O'Leary hosts the live results show. The remaining performers will be on tenterhooks as the results of the public vote are revealed, as the two acts with the lowest number of votes must sing for their survival in the final showdown. Who will judges Simon Cowell, Dannii Minogue, Cheryl Cole and Louis Walsh choose to send home?","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-12","episode_number":22,"episode_type":"standard","id":511723,"name":"Live Show 6","overview":"Only seven acts remain and the competition will be getting fiercer than ever as the performers battle it out to stay in the running. Judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh will be on the edges of their seats as they support the singers they are mentoring","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-13","episode_number":23,"episode_type":"standard","id":511724,"name":"Live Show 6 Results","overview":"It is time for the seven remaining acts to find out the result of the public vote. The two acts with the lowest numbers of votes must sing for survival in the final showdown. Then judges Simon Cowell, Cheryl Cole, Dannii Minogue and Louis Walsh will decide who stays in the competition and who is sent home","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-19","episode_number":24,"episode_type":"standard","id":511726,"name":"Live Show 7","overview":"There are only six acts remaining in the competition, and today they must sing live again in a battle to win the biggest prize in pop.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-20","episode_number":25,"episode_type":"standard","id":511725,"name":"Live Show 7 Results","overview":"It is time to reveal the results of the public vote. The two acts with the fewest votes will have to perform again in a sing-off, and then it is up to the judges to decide who stays in the competition and who is eliminated","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-26","episode_number":26,"episode_type":"standard","id":511728,"name":"Live Show 8","overview":"Theme: \"Movie Week\"","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-27","episode_number":27,"episode_type":"standard","id":511727,"name":"Live Show 8 Results","overview":"Result show 8, with celebrity performers: Rebecca Ferguson (\"Nothing's Real But Love\") and Rihanna (\"We Found Love\")","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-03","episode_number":28,"episode_type":"standard","id":511729,"name":"Semi-Final","overview":"Dermot O'Leary hosts the semi-finals. The four remaining act must perform two songs each, and it will be up to them to really sing their hearts out if they are to be in with a chance of making it to next week's final.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-04","episode_number":29,"episode_type":"standard","id":511730,"name":"Semi-Final Results","overview":"Dermot O'Leary reveals which performers will have to fight for survival in a sing-off. The bottom two acts will face the judges again, and one will be eliminated, losing their chance of competing in next week's final. Who is going home today?","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-10","episode_number":30,"episode_type":"standard","id":511731,"name":"Final","overview":"Dermot O'Leary presents the final of the singing competition from Wembley Arena. The remaining contestants must perform in front of a crowd of 10,000 in a bid to win viewers' votes and claim the life-changing prize of a recording contract. There are also performances from top international guest stars. With judges Gary Barlow, Kelly Rowland, Tulisa Contostavlos and Louis Walsh.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-11","episode_number":31,"episode_type":"finale","id":511732,"name":"Final Results","overview":"Dermot O'Leary reveals the results of the public vote. The two acts left battling for the crown perform what will become the winner's single in front of 10,000 people at Wembley Arena, before they find out who has won this year's competition. Plus there are performances from top international guest stars. With judges Gary Barlow, Kelly Rowland, Tulisa Contostavlos and Louis Walsh.","production_code":"","runtime":60,"season_number":8,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"The X Factor is a British television music competition to find new singing talent. The eighth series began airing on ITV on 20 August 2011 and ended on 11 December 2011. The winner was Little Mix, a four-piece girl group known earlier in the series as Rhythmix, consisting of members Jesy Nelson, Perrie Edwards, Leigh-Anne Pinnock, and Jade Thirlwall. They became the first act in the groups category to win in the show's history with new judge Tulisa Contostavlos emerging as their winning mentor. Also they are the only girl group to get to the final. Louis Walsh was the only judge from the previous series to return, and was joined by Contostavlos, Gary Barlow and Kelly Rowland, who all appeared as judges for the first time. Previous judges Simon Cowell, Dannii Minogue and Cheryl Cole all left to join other shows before recording for this series started. Dermot O'Leary presented the show on ITV, while Caroline Flack and series 6 runner-up Olly Murs co-presented the spin-off show The Xtra Factor on ITV2, replacing Konnie Huq from the previous year.\n\nOn 4 August 2011, promotional pictures of the judges surfaced across the internet. The next day, an advertisement premiered on itv.com.","id":25298,"poster_path":"/chxJnLfdSzWwpQqug2OZYaYZMAo.jpg","season_number":8,"vote_average":0},"9":{"_id":"52582d76760ee36aaa8a61ab","air_date":"2012-08-18","episodes":[{"air_date":"2012-08-18","episode_number":1,"episode_type":"standard","id":511733,"name":"Auditions 1","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-25","episode_number":2,"episode_type":"standard","id":511735,"name":"Auditions 2","overview":"Audtions 2","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-01","episode_number":3,"episode_type":"standard","id":511734,"name":"Auditions 3","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-08","episode_number":4,"episode_type":"standard","id":511736,"name":"Auditions 4","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-09","episode_number":5,"episode_type":"standard","id":511737,"name":"Auditions 5","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-15","episode_number":6,"episode_type":"standard","id":511738,"name":"Auditions 6","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-16","episode_number":7,"episode_type":"standard","id":511739,"name":"Auditions 7","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-22","episode_number":8,"episode_type":"standard","id":511740,"name":"Boot Camp 1","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-23","episode_number":9,"episode_type":"standard","id":511741,"name":"Boot Camp 2","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-29","episode_number":10,"episode_type":"standard","id":511743,"name":"Judges House 1","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-30","episode_number":11,"episode_type":"standard","id":511742,"name":"Judges House 2","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-06","episode_number":12,"episode_type":"standard","id":511745,"name":"Top 12 Performance","overview":"Theme: Heroes night The result of the wildcard vote is revealed before the performances as 12 Become 13","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":"/o46T4rtgWB8WQDT1gEkj7n6CWEo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-07","episode_number":13,"episode_type":"standard","id":511744,"name":"Top 12 Results","overview":"Group Performance: \"Read All About It (Pt. III)\" Musical Guests: Leona Lewis (\"Trouble\") and Ne-Yo (\"Let Me Love You (Until You Learn to Love Yourself)\")","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-13","episode_number":14,"episode_type":"standard","id":511746,"name":"Live Show 2","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-14","episode_number":15,"episode_type":"standard","id":511747,"name":"Live Show 2 Results","overview":"Group Performance: \"Somebody That I Used to Know\" Musical Guests: Rebecca Ferguson (\"Backtrack\") and Taylor Swift (\"We Are Never Ever Getting Back Together\")","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-20","episode_number":16,"episode_type":"standard","id":511748,"name":"Live Show 3","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-21","episode_number":17,"episode_type":"standard","id":511749,"name":"Live Show 3 Results","overview":"Group Performance: \"Ain't Nobody\" Musical Guests: Labrinth feat. Emeli Sandé (\"Beneath Your Beautiful\") and JLS (\"Hottest Girl in the World\")","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-27","episode_number":18,"episode_type":"standard","id":511750,"name":"Live Show 4","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-28","episode_number":19,"episode_type":"standard","id":511751,"name":"Live Show 4 Results","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-03","episode_number":20,"episode_type":"standard","id":511752,"name":"Live Show 5","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-04","episode_number":21,"episode_type":"standard","id":511753,"name":"Live Show 5 Results","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-10","episode_number":22,"episode_type":"standard","id":511754,"name":"Live Show 6","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-11","episode_number":23,"episode_type":"standard","id":511755,"name":"Live Show 6 Results","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-17","episode_number":24,"episode_type":"standard","id":511760,"name":"Live Show 7","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-18","episode_number":25,"episode_type":"standard","id":511759,"name":"Live show 7 Results","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-24","episode_number":26,"episode_type":"standard","id":511756,"name":"Live Show 8","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-25","episode_number":27,"episode_type":"standard","id":511757,"name":"Live Show 8 Results","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-01","episode_number":28,"episode_type":"standard","id":511758,"name":"Live Show 9","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-02","episode_number":29,"episode_type":"standard","id":511763,"name":"Live Show 9 Results","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-08","episode_number":30,"episode_type":"standard","id":511762,"name":"Finale Live Show","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-09","episode_number":31,"episode_type":"finale","id":511761,"name":"Finale Live Show Results","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"The X Factor is a British television music competition to find new singing talent. The ninth series began airing on ITV on 18 August 2012 and ended on 9 December 2012. Before the start of the auditions process it was confirmed that Louis Walsh, Gary Barlow and Tulisa Contostavlos would return to the judging panel. Nicole Scherzinger was confirmed as the fourth permanent judge after Geri Halliwell, Leona Lewis, Rita Ora, Mel B, Anastacia and Scherzinger herself stood in as guest judges for the vacant position left by Kelly Rowland. Dermot O'Leary returned as host on ITV, whilst Caroline Flack and Olly Murs returned to host The Xtra Factor on ITV2. After the 8 December show, two of Scherzinger's acts, James Arthur and Jahméne Douglas, became the two finalists, meaning that Scherzinger was guaranteed to win. Arthur was announced as the winner on 9 December, and released a cover of Shontelle's \"Impossible\" as his winner's song. This has since gone on to become the second best selling winning single of any The X Factor winner, behind only series 5 winner Alexandra Burke's version of \"Hallelujah\". This series was the final one to feature Contostavlos as judge, as she will not return for series 10, where former judge Sharon Osbourne replaced her.","id":25299,"poster_path":null,"season_number":9,"vote_average":0},"10":{"_id":"52582d76760ee36aaa8a61b6","air_date":"2013-08-31","episodes":[{"air_date":"2013-08-31","episode_number":1,"episode_type":"standard","id":511773,"name":"Room Auditions 1","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-01","episode_number":2,"episode_type":"standard","id":511791,"name":"Arena Auditions 1","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-07","episode_number":3,"episode_type":"standard","id":511792,"name":"Room Auditions 2","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-08","episode_number":4,"episode_type":"standard","id":511793,"name":"Arena Auditions 2","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":"/darzvU94WGaO0bAWWiMMcl8HEUk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-14","episode_number":5,"episode_type":"standard","id":511794,"name":"Room Auditions 3","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":"/kEOkSj6cP6OBJUusxdcciEZz3C8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-15","episode_number":6,"episode_type":"standard","id":511795,"name":"Arena Auditions 3","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":"/iieXju6CMfQEoayznI9jDrz9zvF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-21","episode_number":7,"episode_type":"standard","id":511764,"name":"Auditions 7","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":"/EpsZNw4KTC8kQ0EF1cTea88OSV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-22","episode_number":8,"episode_type":"standard","id":511765,"name":"Auditions 8","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":"/m3prXixBPfykyhbJ3LfQs4yLWsO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-28","episode_number":9,"episode_type":"standard","id":511766,"name":"Bootcamp 1","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":"/k3abbNyuqG3w9oGi4AzEboX4YkB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-29","episode_number":10,"episode_type":"standard","id":511767,"name":"Bootcamp 2","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":"/eXlqBDR9dceTMoukO0OVk0aCaXa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-05","episode_number":11,"episode_type":"standard","id":511768,"name":"Judges' houses 1","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":"/389D12UUpEtRHb3EEvLGrsV3B5L.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-06","episode_number":12,"episode_type":"standard","id":511769,"name":"Judges' houses 2","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":"/4yeD96uZx85dsfEojb2V7kcv30i.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-12","episode_number":13,"episode_type":"standard","id":511770,"name":"Live Show 1","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-13","episode_number":14,"episode_type":"standard","id":511771,"name":"Live Show 1 Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-19","episode_number":15,"episode_type":"standard","id":511772,"name":"Live Show 2","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-20","episode_number":16,"episode_type":"standard","id":511774,"name":"Live Show 2 Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-26","episode_number":17,"episode_type":"standard","id":511775,"name":"Live Show 3","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-27","episode_number":18,"episode_type":"standard","id":511776,"name":"Live Show 3 Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-02","episode_number":19,"episode_type":"standard","id":511777,"name":"Live Show 4","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-03","episode_number":20,"episode_type":"standard","id":511778,"name":"Live Show 4 Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-09","episode_number":21,"episode_type":"standard","id":511779,"name":"Live Show 5","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-10","episode_number":22,"episode_type":"standard","id":511780,"name":"Live Show 5 Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-16","episode_number":23,"episode_type":"standard","id":511781,"name":"Live Show 6","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-17","episode_number":24,"episode_type":"standard","id":511782,"name":"Live Show 6 Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-23","episode_number":25,"episode_type":"standard","id":511783,"name":"Live Show 7","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-24","episode_number":26,"episode_type":"standard","id":511784,"name":"Live Show 7 Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-30","episode_number":27,"episode_type":"standard","id":511785,"name":"Live Show 8","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-01","episode_number":28,"episode_type":"standard","id":511786,"name":"Live Show 8 Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-07","episode_number":29,"episode_type":"standard","id":511787,"name":"Semi-Final","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-08","episode_number":30,"episode_type":"standard","id":511788,"name":"Semi-Final Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-14","episode_number":31,"episode_type":"standard","id":511789,"name":"Final","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-15","episode_number":32,"episode_type":"finale","id":511790,"name":"Final Results","overview":"","production_code":"","runtime":60,"season_number":10,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"","id":25300,"poster_path":null,"season_number":10,"vote_average":0},"11":{"_id":"54678fe6eaeb8118b200048f","air_date":"2014-08-30","episodes":[{"air_date":"2014-08-30","episode_number":1,"episode_type":"standard","id":1018497,"name":"Room Auditions 1","overview":"The first set of hopefuls audition in front of the judges in a closed room enviroment hoping to gain a place in the next phase of the competition. Those hoping to impress include Chloe Jasmine, Blonde Electric, and Reece Bibby.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":"/bb12kLIDdo4Ddz5kND0LqQdeMBu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-31","episode_number":2,"episode_type":"standard","id":1018498,"name":"Room Auditions 2","overview":"The second set of hopefuls audition in front of the judges in a closed room enviroment hoping to gain a place in the next phase of the competition where they will have to perform at Wembley Arena in front of a live audience. Stevi Richie, Linzi Martin, Chloe Thwala, Helen Fulthorpe, Michelle Lawson, Only The Young, Concept, Oceane Guyot, Jummy Cheun, Jan Chichorz, and Andrea Faustini are amongst those hoping to impress tonight.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":"/yhqCZsmhK4riLaQ9O1pDSDSkuFM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-06","episode_number":3,"episode_type":"standard","id":1018499,"name":"Room Auditions 3","overview":"The third set of hopefuls audition in front of the judges in a closed room enviroment hoping to gain a place in the next phase of the competition where they will have to perform at Wembley Arena in front of a live audience.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":"/huETdpDXrTlWdj7jwK7PCMR1p8M.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-07","episode_number":4,"episode_type":"standard","id":1018500,"name":"Room Auditions 4","overview":"The fourth set of hopefuls audition in front of the judges in a closed room enviroment hoping to gain a place in the next phase of the competition where they will have to perform at Wembley Arena in front of a live audience.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":"/nWJw3IeTbZPKWR1KxcWy6CRhUP2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-13","episode_number":5,"episode_type":"standard","id":1018501,"name":"Arena Auditions 1","overview":"Simon Cowell returns to the judging panel in the eleventh season; the first round of arena auditions begin.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":"/9jn2qnzY6ZXIeDNIdTVrI069V8c.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-14","episode_number":6,"episode_type":"standard","id":1018502,"name":"Arena Auditions 2","overview":"Simon Cowell returns to the judging panel; another batch of singers and groups face the judges and a packed Wembley arena.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":"/78A3D7iWFnMfWXtZ0Tb2ACbKJXk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-20","episode_number":7,"episode_type":"standard","id":1395583,"name":"Arena Auditions 3","overview":"Having proved themselves in front of the judges, the hopefuls must now perform for an audience of almost 5,000 as the Wembley Arena auditions continue.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-21","episode_number":8,"episode_type":"standard","id":1395585,"name":"Arena Auditions 4","overview":"Having impressed the judges in the audition room, the aspiring pop stars now have the more daunting challenge of captivating a huge audience at Wembley Arena, as Simon, Cheryl, Mel B, and Louis make their final selections for boot camp.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-26","episode_number":9,"episode_type":"standard","id":1395586,"name":"Bootcamp 1","overview":"In the first of three boot camps editions, the six-chair challenge returns. Simon, Louis, Mel B, and Cheryl must decide on the final six acts they will take to the judges' houses stage. Making the decisions are Simon (overs), Cheryl (girls), Mel B (boys) and Louis (groups).","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-27","episode_number":10,"episode_type":"standard","id":1395587,"name":"Bootcamp 2","overview":"The six-chair challenge continues in the second of three boot-camp shows, in which the hopefuls battle it out for one of six places at the judges' house stage.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-15","episode_number":25,"episode_type":"standard","id":1018312,"name":"Episode 25","overview":"Wannabe pop stars across the country are preparing to brave the panel of judges and the British public and stake their claim to the winner’s title. Excitingly, this time round there’s a new line up of judges. Familiar face Louis Walsh is joined by the multi-million selling artists, songwriters and pop masterminds that are Gary Barlow, Kelly Rowland and Tulisa Conostavlos. As per, the quartet will be handing out their judgement on contestants within the following categories: male soloists aged 16-28, female soloists 16-28 years, over 28s and groups. The X Factor stalwart, Dermot O’Leary will be hosting for the fifth year running and elsewhere, Olly Murs, who was runner-up in 2009, and Caroline Flack, former presenter of ‘I’m a Celebrity! Get me out of Here! Now’ will be taking care of business over on The Xtra Factor. Once again, the auditions took place in front of live audiences throughout the UK, from thousands and thousands of applications. Each contestant needs three yeses to pass their audition; not two yeses and ‘I think you’d be good in a boyband’ from Louis – it’s three yeses every time. Those who survive the audition phase then graduate to bootcamp, where they are put through their paces and mercilessly whittled down, until 32 acts remain. Each judge is then assigned a category to mentor and it’s off to the judges’ houses. Eight acts go to each house, but only three will return. The live show stage of the competition begins in October, as each week we lose the act with the fewest public votes. In the final, three acts will battle it out, until one is crowned winner of The X Factor.","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-14","episode_number":34,"episode_type":"finale","id":1024253,"name":"Series 11, The Final Extra (Result)","overview":"","production_code":"","runtime":60,"season_number":11,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 11","overview":"","id":63446,"poster_path":null,"season_number":11,"vote_average":0},"12":{"_id":"55dc0eb0c3a3680c0900147b","air_date":"2015-08-25","episodes":[{"air_date":"2015-08-25","episode_number":1,"episode_type":"standard","id":1100976,"name":"Auditions 1","overview":"The talent show returns for its 12th series with Radio One DJ Nick Grimshaw and singer-songwriter Rita Ora joining Simon Cowell and Cheryl Fernandez-Versini on the judging panel. New presenting duo Caroline Flack and Olly Murs host as the search for a potential music star with an amazing voice and that extra special something begins. Tonight's edition will see the start of the auditions, as hopefuls perform in front of the judges and an arena audience of thousands in the hope of securing a place at Boot Camp. ","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-30","episode_number":2,"episode_type":"standard","id":1111792,"name":"Audtions 2","overview":"More hopefuls sing in front of the judges and an arena audience of thousands to prove their worth and possibly secure a place at Boot Camp.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-05","episode_number":3,"episode_type":"standard","id":1104158,"name":"Auditions 3","overview":"Olly Murs and Caroline Flack host proceedings as the audition stages continue, with more hopeful contenders seek to win over the panel and secure a place at the Boot Camp. Doing so will first mean they must face the collective criticism of Simon Cowell, Cheryl Fernandez-Versini, Nick Grimshaw and Rita Ora, along with the gathered arena audience.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-06","episode_number":4,"episode_type":"standard","id":1104731,"name":"Auditions 4","overview":"Caroline Flack and Olly Murs present further coverage of the audition process, as another batch of applicants perform in front of judges Simon Cowell, Cheryl Fernandez-Versini, Nick Grimshaw and Rita Ora, as well as an arena audience of thousands, in the hope of winning one of the coveted places at the Boot Camp","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-12","episode_number":5,"episode_type":"standard","id":1106332,"name":"Auditions 5","overview":"Olly Murs and Caroline Flack host proceedings as the audition stages continue, as more hopeful contenders seek to win over the panel and secure a place at Boot Camp. Doing so means they must face the collective criticism of Simon Cowell, Cheryl Fernandez-Versini, Nick Grimshaw and Rita Ora, along with the arena audience. ","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-13","episode_number":6,"episode_type":"standard","id":1106534,"name":"Auditions 6","overview":"Olly Murs and Caroline Flack host proceedings as the audition stages continue, as more hopeful contenders seek to win over the panel and secure a place at Boot Camp. Doing so means they must face the collective criticism of Simon Cowell, Cheryl Fernandez-Versini, Nick Grimshaw and Rita Ora, along with the arena audience. ","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-19","episode_number":7,"episode_type":"standard","id":1108266,"name":"Auditions 7","overview":"Tonight, in the last of the arena auditions, performers will sing one last time in front of the judges and an audience of thousands in the hope of securing a place at Boot Camp.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-20","episode_number":8,"episode_type":"standard","id":1111793,"name":"Country House Boot Camp 1","overview":"Tonight sees the launch of this year's supersized Boot Camp stage, kicking off in a grand country house.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-27","episode_number":9,"episode_type":"standard","id":1110494,"name":"Country House Boot Camp 2","overview":"Tonight sees the the last day of  this year's supersized Boot Camp stage, kicking off in a grand country house.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-04","episode_number":10,"episode_type":"standard","id":1112967,"name":"Six Chair Challenge (1)","overview":"Rita Ora picks the TOP 6 girls in the 1st show of the six chair challenge..","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-11","episode_number":11,"episode_type":"standard","id":1116334,"name":"Six Chair Challenge (2)","overview":"Nick Grimshaw picks the TOP 6 boys in the 2nd show of the six chair challenge..and Cheryl Fernandez-Versini finishes off the show going through half of the groups before next Sundays  3rd and final six chair challenge.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-18","episode_number":12,"episode_type":"standard","id":1130882,"name":"Series 12 - Six Chair Challenge (3)","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-24","episode_number":13,"episode_type":"standard","id":1132089,"name":"Judges' Houses 1","overview":"The beginning of the judges' houses stage, which sees the remaining 24 acts jet off to glamorous destinations around the world to sing for a place in the live shows. As usual the judges are assisted by industry experts - Simon by One Direction heart-throb Louis Tomlinson, Cheryl by chart star Jess Glynne, Rita by US sensation Meghan Trainor and Nick by leading producer Mark Ronson. However, unlike in previous years, the hopefuls don't get the news straight away. Instead they have had to wait a few weeks until this weekend, when back in the studio the judges will finally choose their finalists live. Hosted by Caroline Flack and Olly Murs.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-25","episode_number":14,"episode_type":"standard","id":1132295,"name":"Series 12 - Judges' Houses (2)","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-31","episode_number":15,"episode_type":"standard","id":1133439,"name":"Live Show 1","overview":"Caroline and Olly present the first of this year's live shows. The 12 remaining acts compete for the chance to make it through to the live final later this year, hoping to impress the judges enough to stay on the show. Simon has the Overs, Cheryl the Groups, Nick the Boys, and Rita the Girls. However, the standard is high, which is sure to cause drama and disagreements among the judges, and tomorrow's show will see the first act eliminated after a sing-off.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-01","episode_number":16,"episode_type":"standard","id":1135862,"name":"Live results 1","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-07","episode_number":17,"episode_type":"standard","id":1135260,"name":"Live Show 2","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-09","episode_number":18,"episode_type":"standard","id":1135537,"name":"Live Show 2 Results","overview":"Caroline and Olly present the results of last night's viewers' vote. The lowest scoring acts are challenged to compete in a sing-off to win the approval of judges Nick, Rita, Cheryl, and Simon - with one of them being eliminated from the contest at the end of tonight's show.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-14","episode_number":19,"episode_type":"standard","id":1136533,"name":"Live Show 3","overview":"Series 12 - Live Show 3","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-15","episode_number":20,"episode_type":"standard","id":1136873,"name":"Live Show 3 Results","overview":"Live Show 3 results.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-21","episode_number":21,"episode_type":"standard","id":1136874,"name":"Live Show 4","overview":"Series 12 - Live Show 4","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-22","episode_number":22,"episode_type":"standard","id":1136875,"name":"Live Show 4 Results","overview":"Live Show 4 Results","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-28","episode_number":23,"episode_type":"standard","id":1136876,"name":"Quarter-Final","overview":"Live Quarter-Final show.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-29","episode_number":24,"episode_type":"standard","id":1136877,"name":"Quarter-Final Results","overview":"Quarter-Final Results.","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-05","episode_number":25,"episode_type":"standard","id":1136878,"name":"Semi-Final","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-06","episode_number":26,"episode_type":"standard","id":1136879,"name":"Semi-Final Results","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-12","episode_number":27,"episode_type":"standard","id":1136880,"name":"The Final","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-13","episode_number":28,"episode_type":"finale","id":1136881,"name":"Final Results","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 12","overview":"","id":69867,"poster_path":"/g7SItN4TeAnG9jz56rEFT1zIwS2.jpg","season_number":12,"vote_average":0},"13":{"_id":"57c1b2d6c3a36806bf00088f","air_date":"2016-08-27","episodes":[{"air_date":"2016-08-27","episode_number":1,"episode_type":"standard","id":1217560,"name":"Auditions 1","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-08-28","episode_number":2,"episode_type":"standard","id":1218029,"name":"Auditions 2","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-03","episode_number":3,"episode_type":"standard","id":1219524,"name":"Auditions 3","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-04","episode_number":4,"episode_type":"standard","id":1219525,"name":"Auditions 4","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-10","episode_number":5,"episode_type":"standard","id":1222264,"name":"Auditions 5","overview":"Auditions 5","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-11","episode_number":6,"episode_type":"standard","id":1222730,"name":"Auditions 6","overview":"Auditions 6","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-17","episode_number":7,"episode_type":"standard","id":1224438,"name":"Boot Camp 1","overview":"Boot camp begins. Simon Cowell and his fellow judges Sharon Osbourne, Louis Walsh, and Nicole Scherzinger put those hopefuls who made it past the initial auditions through a series of dancing and singing challenges, aimed at weeding out the less-talented candidates.","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-18","episode_number":8,"episode_type":"standard","id":1224435,"name":"Boot Camp 2","overview":"Boot Camp concludes. Simon Cowell and his fellow judges Sharon Osbourne, Louis Walsh, and Nicole Scherzinger put those hopefuls who made it past the initial auditions through a series of dancing and singing challenges, aimed at weeding out the less-talented candidates.","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-24","episode_number":9,"episode_type":"standard","id":1224436,"name":"Six Chair Challenge 1","overview":"The Six Chair Challenge returns. The judges must decide on the final six acts in each category to take through to the Judges' Houses stage. None of the hopefuls who secure a seat are safe until everyone in their category has sung. Who will have what it takes to keep hold of their seat and move one step closer to a coveted place in the live shows?","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-25","episode_number":10,"episode_type":"standard","id":1226391,"name":"Episode 10","overview":"This episode doesn't have a summary yet. Add one here.","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-02","episode_number":11,"episode_type":"standard","id":1228634,"name":"Episode 11","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-02","episode_number":12,"episode_type":"standard","id":1228635,"name":"Episode 12","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-07","episode_number":13,"episode_type":"standard","id":1230066,"name":"Live Show 1","overview":"In the first live show of the year the 12 remaining acts compete for the public vote.","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-10","episode_number":14,"episode_type":"standard","id":1230209,"name":"Live Show 1 Results","overview":"The results of last night's live show is revealed.","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-15","episode_number":15,"episode_type":"standard","id":1231917,"name":"Episode 15","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-17","episode_number":16,"episode_type":"standard","id":1232205,"name":"Episode - 16","overview":"Episode - 16","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-22","episode_number":17,"episode_type":"standard","id":1233414,"name":"Episode 17","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-23","episode_number":18,"episode_type":"standard","id":1233415,"name":"Episode 18","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-29","episode_number":19,"episode_type":"standard","id":1235557,"name":"Live Show 4","overview":"On the 4th weekend of live shows the remaining contestants take to the stage to perform for the judges and audience at home, all in the hope of sealing their place in the competition for another week.","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-30","episode_number":20,"episode_type":"standard","id":1235872,"name":"Live Show 4 Results","overview":"The results of last night's live show are revealed.","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-05","episode_number":21,"episode_type":"standard","id":1236960,"name":"Live Show 5","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-06","episode_number":22,"episode_type":"standard","id":1237272,"name":"Episode 22","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-12","episode_number":23,"episode_type":"standard","id":1239263,"name":"Episode 23","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-13","episode_number":24,"episode_type":"standard","id":1239649,"name":"Episode 24","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-19","episode_number":25,"episode_type":"standard","id":1241564,"name":"25","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-20","episode_number":26,"episode_type":"standard","id":1241565,"name":"26","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-26","episode_number":27,"episode_type":"standard","id":1243511,"name":"27","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-27","episode_number":28,"episode_type":"standard","id":1243512,"name":"28","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-03","episode_number":29,"episode_type":"standard","id":1244959,"name":"29","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-04","episode_number":30,"episode_type":"standard","id":1245025,"name":"Live Show 9 Results","overview":"The results of last night's live show are revealed, and 3 contestants go through to the finals.","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-10","episode_number":31,"episode_type":"standard","id":1245038,"name":"31","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-11","episode_number":32,"episode_type":"finale","id":1245039,"name":"32","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 13","overview":"","id":79577,"poster_path":null,"season_number":13,"vote_average":0},"14":{"_id":"59ab31cec3a3682cc801ac89","air_date":"2017-09-02","episodes":[{"air_date":"2017-09-02","episode_number":1,"episode_type":"standard","id":1360119,"name":"Series 14 - Auditions 1","overview":"The UK's most talked about TV show, The X Factor, is back. And this year's series sees the return of some favourite faces as rock royalty Sharon Osbourne, pop sensation Nicole Scherzinger, chart maestro Louis Walsh and The X Factor creator and music mogul Simon Cowell are reunited on the judging panel. They are joined by the nation's favourite TV host, Dermot O'Leary, who is back to guide viewers through all of The X Factor action as well as providing hopefuls with those much-needed ‘Dermot hugs'. Also returning this year are the intimate room auditions. Expect knock out vocals and big personalities as the auditionees find themselves face-to-face in front of the judges in a very personal setting, tackling the first stage in their path to secure a life changing record contract.","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-03","episode_number":2,"episode_type":"standard","id":1360384,"name":"Series 14 - Auditions 2","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-09","episode_number":3,"episode_type":"standard","id":1364192,"name":"Series 14 - Auditions 3","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-10","episode_number":4,"episode_type":"standard","id":1364509,"name":"Series 14 - Auditions 4","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-16","episode_number":5,"episode_type":"standard","id":1367283,"name":"Series 14 - Auditions 5","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-17","episode_number":6,"episode_type":"standard","id":1367804,"name":"Series 14 - Auditions 6","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-23","episode_number":7,"episode_type":"standard","id":1370446,"name":"Series 14 - Auditions 7","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-24","episode_number":8,"episode_type":"standard","id":1370895,"name":"Series 14 - Auditions 8","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-29","episode_number":9,"episode_type":"standard","id":1373653,"name":"Bootcamp 1","overview":"Bootcamp is looming on the horizon, and Dermot O’Leary presents the final selection of room auditions. Sharon Osbourne, Nicole Scherzinger, Louis Walsh and Simon Cowell assemble for the last stop on their nationwide talent-hunt, as more hopefuls submit themselves for approval","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-01","episode_number":10,"episode_type":"standard","id":1373874,"name":"Boot Camp 2","overview":"It's Boot Camp! And the remaining contestants are put through their paces, having to perform once again for the judges in a series of singing challenges. First, contestants must race to the Wall of Songs and choose a song which they will have to perform together in groups of four. If they succeed in impressing Simon Cowell, Nicole Scherzinger, Sharon Osbourne and Louis Walsh, the contestants will earn a coveted place at the next stage of Boot Camp, the Arena Auditions. Dermot O'Leary, will be on hand to guide viewers through all the Boot Camp action as well as providing hopefuls with those much-needed ‘Dermot hugs'.","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-07","episode_number":11,"episode_type":"standard","id":1377229,"name":"Boot Camp 3","overview":"Tonight sees Bootcamp come to a close as the arena auditions continue and the remaining contestants take to the stage at Wembley arena to perform in front of a live audience for the first time in the competition. If they impress the judges, and the audience, they will then move on to the next stage of the competition: the Six Chair Challenge, meaning they are one step closer to securing a coveted place at Judges' Houses. Dermot O'Leary will be on hand to guide viewers through all the action as well as providing hopefuls with those much-needed ‘Dermot hugs'","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-08","episode_number":12,"episode_type":"standard","id":1377842,"name":"Six Chair Challenge","overview":"Tonight's episode sees the competition reach a new level as the dramatic Six Chair Challenge returns, promising some amazing performances alongside some agonising decisions for the judges, as they must each decide on the final six acts they will take through to their Judge's House. In the first of three special Six Chair Challenge episodes, the stakes are high as the acts perform individually and their judge then has to decide, there and then in front of the audience, if they want the act to take one of the six seats on stage – each one representing a place at Judges' Houses. However, even if they win a seat, the contestants face an anxious wait as no one is safe until the last person in each category has sung. Each judge is able to change their mind at any point swapping an act already through with someone else who comes on and out-performs them. Who will have what it takes to keep hold of their seat and be one step closer to a coveted place in the lives shows?","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-14","episode_number":13,"episode_type":"standard","id":1380019,"name":"Six Chair Challenge (2)","overview":"In the second of three special Six Chair Challenge episodes, the stakes are high as the acts perform individually and their judge then has to decide, there and then in front of the audience, if they want the act to take one of the six seats on stage – each one representing a place at Judges' Houses. However, even if they win a seat, the contestants face an anxious wait as no one is safe until the last person in each category has sung. Each judge is able to change their mind at any point swapping an act already through with someone else who comes on and out-performs them. Who will have what it takes to keep hold of their seat and be one step closer to a coveted place in the lives shows?","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-15","episode_number":14,"episode_type":"standard","id":1380318,"name":"Six Chair Challenge (3)","overview":"In the final special Six Chair Challenge episodes, the stakes are high as the acts perform individually and their judge then has to decide, there and then in front of the audience, if they want the act to take one of the six seats on stage – each one representing a place at Judges' Houses. However, even if they win a seat, the contestants face an anxious wait as no one is safe until the last person in each category has sung. Each judge is able to change their mind at any point swapping an act already through with someone else who comes on and out-performs them. Who will have what it takes to keep hold of their seat and be one step closer to a coveted place in the lives shows?","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-21","episode_number":15,"episode_type":"standard","id":1382632,"name":"Judges' Houses (1)","overview":"The route to the live shows draws tantalisingly closer for the remaining 24 The X Factor contestants as they jet off to Judges' Houses in a bid to land a coveted place in the live shows.","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-11","episode_number":16,"episode_type":"standard","id":1392000,"name":"Series 14 - Judges' Houses (2)","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-11","episode_number":17,"episode_type":"standard","id":1392001,"name":"Series 14 - Live Show 1","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-11","episode_number":18,"episode_type":"standard","id":1392002,"name":"Series 14 - Live Show 2","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-11","episode_number":19,"episode_type":"standard","id":1392003,"name":"Series 14 - Live Show 3","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-11","episode_number":20,"episode_type":"standard","id":1392004,"name":"Series 14 - Live Show 4","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-11","episode_number":21,"episode_type":"standard","id":1392005,"name":"LayarStar - Live Show 5","overview":"The nation's favourite singing show continues into its third weekend of the live shows as the remaining contestants take to the stage to perform for the judges and audience at home, all in the hope of sealing their place in the competition for another week. This year the stakes are higher, as the most popular act over the weekend will win a money-can't-buy prize. Resident host Dermot O'Leary leads the proceedings, as the four judges battle it out to keep their acts in the show. This year Louis Walsh has the Boys, Nicole Scherzinger the Overs, Simon Cowell the Groups and Sharon Osbourne the Girls. Throughout the live shows an outstanding line-up of guest stars will perform.","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-18","episode_number":22,"episode_type":"standard","id":1392006,"name":"LayarStar - Live Show 6","overview":"The nation's favourite singing show continues into its third weekend of the live shows as the remaining contestants take to the stage to perform for the judges and audience at home, all in the hope of sealing their place in the competition for another week. This year the stakes are higher, as the most popular act over the weekend will win a money-can't-buy prize. Resident host Dermot O'Leary leads the proceedings, as the four judges battle it out to keep their acts in the show. This year Louis Walsh has the Boys, Nicole Scherzinger the Overs, Simon Cowell the Groups and Sharon Osbourne the Girls. Throughout the live shows an outstanding line-up of guest stars will perform.","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-18","episode_number":23,"episode_type":"standard","id":1397342,"name":"Quarter Final 1","overview":"The UK's favourite singing competition kicks off its fourth weekend of live shows as the remaining contestants sing their hearts out. Dermot O'Leary hosts as judges Simon Cowell, Nicole Scherzinger, Sharon Osbourne and Louis Walsh take their seats for more amazing performances from each of their categories. Another big name guest also performs live.","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-19","episode_number":24,"episode_type":"standard","id":1397343,"name":"Quarter Final 2","overview":"The UK's favourite singing competition continues its fourth weekend of live shows as the remaining contestants sing their hearts out. Dermot O'Leary hosts as judges Simon Cowell, Nicole Scherzinger, Sharon Osbourne and Louis Walsh take their seats for more amazing performances from each of their categories. Another big name guest also performs live","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-25","episode_number":25,"episode_type":"standard","id":1397344,"name":"Semi-final 1","overview":"The nation's favourite singing show continues into its semi-final round as the remaining contestants take to the stage to perform for the judges and audience at home, with the hope of making it into next week's final.","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-26","episode_number":26,"episode_type":"standard","id":1397345,"name":"Semi-final 2","overview":"The nation's favourite singing show continues into its semi-final round as the remaining contestants take to the stage to perform for the judges and audience at home, with the hope of making it into next week's final.","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-02","episode_number":27,"episode_type":"standard","id":4116713,"name":"Live Final 1","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Dancer","credit_id":"63a5c877387651009f4bcd96","order":542,"adult":false,"gender":2,"id":1969976,"known_for_department":"Acting","name":"Luke Johnson","original_name":"Luke Johnson","popularity":0.6,"profile_path":"/b0dIUc0zMxBZqtErm8zbW0iZEXQ.jpg"}]},{"air_date":"2017-12-03","episode_number":28,"episode_type":"finale","id":4116715,"name":"Live Final 2","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Dancer","credit_id":"63a5c877387651009f4bcd96","order":542,"adult":false,"gender":2,"id":1969976,"known_for_department":"Acting","name":"Luke Johnson","original_name":"Luke Johnson","popularity":0.6,"profile_path":"/b0dIUc0zMxBZqtErm8zbW0iZEXQ.jpg"}]}],"name":"Season 14","overview":"","id":92275,"poster_path":null,"season_number":14,"vote_average":0},"15":{"_id":"5b8b40979251415197026142","air_date":"2018-09-01","episodes":[{"air_date":"2018-09-01","episode_number":1,"episode_type":"standard","id":1561603,"name":"Episode 1","overview":"Simon Cowell, Louis Tomlinson, Robbie Williams and Ayda Williams return for an exciting fifteenth season of the UK's biggest singing competition, starting with arena auditions at SSE Wembley Arena; with Dermot O'Leary.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/20p0LMBs68NkmRrv8uRP7XSFSzu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-02","episode_number":2,"episode_type":"standard","id":1561824,"name":"Episode 2","overview":"The search for a new music superstar continues with the second of the Auditions shows","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/xmF9ZSgahpls4gD3eZkpK2aHm25.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1f2701ac2920076ad1877","order":541,"adult":false,"gender":2,"id":3120388,"known_for_department":"Acting","name":"Brendan Murray","original_name":"Brendan Murray","popularity":0.6,"profile_path":null}]},{"air_date":"2018-09-08","episode_number":3,"episode_type":"standard","id":1568016,"name":"Episode 3","overview":"The search for a new music superstar continues as The X Factor returns to ITV. Heralding the start of a new era for the nation’s most talked about entertainment show, is a brand-new panel with Robbie Williams, Ayda Williams and Louis Tomlinson joining music mogul Simon Cowell as judges.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/6cilUHMShi1jTS19hHVVpK3R7Mc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-09","episode_number":4,"episode_type":"standard","id":1568680,"name":"Episode 4","overview":"The search for a new music superstar continues as The X Factor returns to ITV. Heralding the start of a new era for the nation’s most talked about entertainment show, is a brand-new panel with Robbie Williams, Ayda Williams and Louis Tomlinson joining music mogul Simon Cowell as judges.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/t7EOejQCQ2I9EehMqaVRFRUBBLe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-15","episode_number":5,"episode_type":"standard","id":1573699,"name":"Episode 5","overview":"The SSE Arena Wembley is the location as the audition rounds continue in the talent contest, hosted by Dermot O’Leary. Judges Robbie Williams, Ayda Williams, Louis Tomlinson and Simon Cowell decide who goes through to the Six Chair Challenge, before the competition really heats up later in the year with the live shows.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/4gsE6bIf1TdZ68gLNXeqCVrXXDy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-16","episode_number":6,"episode_type":"standard","id":1573729,"name":"Episode 6","overview":"The search for a new music superstar heats up as the auditions continue at the SSE Arena.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/svq8d08Vk59ZwPWeCa8nJtRpMVj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"}]},{"air_date":"2018-09-22","episode_number":7,"episode_type":"standard","id":1577101,"name":"Episode 7","overview":"The search for a new music superstar heats up as the auditions continue. Judges Robbie Williams, Ayda Williams, Louis Tomlinson and Simon Cowell audition more hopefuls at the SSE Arena in Wembley. They are joined by Dermot O’Leary, who will be on hand to guide viewers and contestants alike through their X Factor journey, providing them with a word of advice or a much-needed hug as the contestants perform in front of the judging panel.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/5NpfaBTczusrMIgQgbZtO5vYPLS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-23","episode_number":8,"episode_type":"standard","id":1577304,"name":"Episode 8","overview":"The search for a new music superstar heats up as the auditions continue. Joining music mogul Simon Cowell as judges are Robbie Williams, Ayda Williams and Louis Tomlinson.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/jRK8k0g0JIfhv6gMJ5uq5JK86ow.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-29","episode_number":9,"episode_type":"standard","id":1581531,"name":"Six Chair Challenge 1","overview":"The Six Chair Challenge returns, promising amazing performances alongside agonising decisions for judges Robbie Williams, Ayda Williams, Louis Tomlinson and Simon Cowell, as they must each decide on the acts they will take through to their Judges' House. However, this year each judge has a golden button, which guarantees one act in their line-up a place in the final six, meaning that once they have a seat, they cannot be swapped out. Presented by Dermot O'Leary.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/4Am2eBvqshFbCtN7Re71mCzcypj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-30","episode_number":10,"episode_type":"standard","id":1581532,"name":"Six Chair Challenge 2","overview":"Dermot O'Leary hosts the second of the three Six Chair Challenge episodes, in which the acts perform individually before the judges choose who will be selected for the next stage. However, even if a contender is selected to go through to the next stage, the judges are free to change their minds and ditch them if a more promising alternative comes along later in the show.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/kNKzS8e5KfdFo5UXPwmvBFgSs3Z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-06","episode_number":11,"episode_type":"standard","id":1583474,"name":"Six Chair Challenge 3","overview":"The final Six Chair Challenge episodes, in which the acts perform individually before the judges choose who will be selected for the next stage.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/heq3ClAd8DZhQmXCSPmh7R0MNk0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-07","episode_number":12,"episode_type":"standard","id":1583475,"name":"Judges' Houses 1","overview":"The remaining 24 acts jet off to the Judges' Houses stage. Offering a glimpse into the jetset lifestyle that the winner could have, the contestants travel to glamorous destinations across the world, and with just one more chance to impress their mentor, each act will be hoping to convince them that they have the star quality required to reach the live shows.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/b37FLGMbys4BNYG4qyurRNXhjFj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-13","episode_number":13,"episode_type":"standard","id":1594389,"name":"Judges' Houses 2","overview":"The competition reaches its next stage as the remaining acts jet off to the Judges' Houses, where they have a final chance to make a good impression.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/xU9qQuTmzP2oHxXltFg7n4yetX7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-14","episode_number":14,"episode_type":"standard","id":1595009,"name":"Judges Houses 3","overview":"","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":"/fGU5s7SNrnCqiidNdqEZmovQ180.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-20","episode_number":15,"episode_type":"standard","id":1595010,"name":"Live Show 1","overview":"","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"},{"character":"Self - Contestant","credit_id":"60c1f2701ac2920076ad1877","order":541,"adult":false,"gender":2,"id":3120388,"known_for_department":"Acting","name":"Brendan Murray","original_name":"Brendan Murray","popularity":0.6,"profile_path":null}]},{"air_date":"2018-10-21","episode_number":16,"episode_type":"standard","id":1595011,"name":"Results Show 1","overview":"","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-27","episode_number":17,"episode_type":"standard","id":1605901,"name":"Live Show 2","overview":"Each of the acts will need to show their adaptability as well as singing talent in order to survive another week in the competition.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"},{"character":"Self - Contestant","credit_id":"60c1f2701ac2920076ad1877","order":541,"adult":false,"gender":2,"id":3120388,"known_for_department":"Acting","name":"Brendan Murray","original_name":"Brendan Murray","popularity":0.6,"profile_path":null}]},{"air_date":"2018-10-28","episode_number":18,"episode_type":"standard","id":1606649,"name":"Results Show 2","overview":"Each of the acts will need to show its adaptability as well as singing talent in order to survive another week in the competition; Dermot O'Leary hosts.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-03","episode_number":19,"episode_type":"standard","id":1612358,"name":"Live Show 3","overview":"Each of the acts will need to show its adaptability as well as singing talent in order to survive another week in the competition; Dermot O'Leary hosts.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"},{"character":"Self - Contestant","credit_id":"60c1f2701ac2920076ad1877","order":541,"adult":false,"gender":2,"id":3120388,"known_for_department":"Acting","name":"Brendan Murray","original_name":"Brendan Murray","popularity":0.6,"profile_path":null}]},{"air_date":"2018-11-04","episode_number":20,"episode_type":"standard","id":1612476,"name":"Live Show 3 Results","overview":"Dermot O'Leary hosts as the nerve-racking live shows continue; each of the acts will need to show their adaptability as well as singing talent in order to survive another week in the competition.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-10","episode_number":21,"episode_type":"standard","id":1615757,"name":"Live Show 4","overview":"Dermot O'Leary hosts as the nerve-racking live shows continue.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"},{"character":"Self - Contestant","credit_id":"60c1f2701ac2920076ad1877","order":541,"adult":false,"gender":2,"id":3120388,"known_for_department":"Acting","name":"Brendan Murray","original_name":"Brendan Murray","popularity":0.6,"profile_path":null},{"character":"Self - Dancer","credit_id":"63a5c877387651009f4bcd96","order":542,"adult":false,"gender":2,"id":1969976,"known_for_department":"Acting","name":"Luke Johnson","original_name":"Luke Johnson","popularity":0.6,"profile_path":"/b0dIUc0zMxBZqtErm8zbW0iZEXQ.jpg"}]},{"air_date":"2018-11-11","episode_number":22,"episode_type":"standard","id":1616556,"name":"Results Show 4","overview":"","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-17","episode_number":23,"episode_type":"standard","id":1623173,"name":"Live show 5","overview":"Each of the acts will need to show its adaptability as well as singing talent in order to survive another week in the competition; Dermot O'Leary hosts.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"},{"character":"Self - Contestant","credit_id":"60c1f2701ac2920076ad1877","order":541,"adult":false,"gender":2,"id":3120388,"known_for_department":"Acting","name":"Brendan Murray","original_name":"Brendan Murray","popularity":0.6,"profile_path":null}]},{"air_date":"2018-11-18","episode_number":24,"episode_type":"standard","id":1623659,"name":"Live results 5","overview":"Each of the acts will need to show its adaptability as well as singing talent in order to survive another week in the competition; Dermot O'Leary hosts.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-24","episode_number":25,"episode_type":"standard","id":1627670,"name":"Live Show 6","overview":"Each of the acts will need to show its adaptability as well as singing talent in order to survive another week in the competition; Dermot O'Leary hosts.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"},{"character":"Self - Contestant","credit_id":"60c1f2701ac2920076ad1877","order":541,"adult":false,"gender":2,"id":3120388,"known_for_department":"Acting","name":"Brendan Murray","original_name":"Brendan Murray","popularity":0.6,"profile_path":null}]},{"air_date":"2018-11-25","episode_number":26,"episode_type":"standard","id":1627962,"name":"Results Show 6","overview":"Each of the acts will need to show its adaptability as well as singing talent in order to survive another week in the competition; Dermot O'Leary hosts.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"}]},{"air_date":"2018-12-01","episode_number":27,"episode_type":"standard","id":1632656,"name":"Final Saturday","overview":"The final acts perform in the hope of impressing the judges and the audience at home, while a lineup of guest performers takes to the stage.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"}]},{"air_date":"2018-12-02","episode_number":28,"episode_type":"finale","id":1632657,"name":"Final Sunday","overview":"Dermot O'Leary hosts the tension-packed season finale as the X Factor 2018 winner is crowned.","production_code":"","runtime":60,"season_number":15,"show_id":13999,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Contestant","credit_id":"60c1ef0583901800400c5a35","order":540,"adult":false,"gender":2,"id":3120374,"known_for_department":"Acting","name":"Dalton Harris","original_name":"Dalton Harris","popularity":0.6,"profile_path":"/qFALsWrXRf4nnkbDUpezeyy0PNX.jpg"},{"character":"Self - Contestant","credit_id":"60c1f2701ac2920076ad1877","order":541,"adult":false,"gender":2,"id":3120388,"known_for_department":"Acting","name":"Brendan Murray","original_name":"Brendan Murray","popularity":0.6,"profile_path":null}]}],"name":"Season 15","overview":"","id":108698,"poster_path":null,"season_number":15,"vote_average":0}}}