{"adult":false,"backdrop_path":"/6oPp1dJftr7JO7grTPTApHKyp4h.jpg","created_by":[],"episode_run_time":[60,45],"first_air_date":"2008-01-09","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.scifi.com/ghi/","id":14058,"in_production":false,"languages":["en"],"last_air_date":"2012-04-04","last_episode_to_air":{"id":513068,"name":"Hell's Gate: Canada","overview":"The Ghost Hunters International team travel to Lower Fort Garry in Manitoba, Canada, which was originally built to protect the fur trade. Paranormal activity has increased in recent months!  \n\nPeople have spotted the apparition of a little girl in the guest cottage and a figure of a man and a woman in the prison where a guard once killed himself. From the blacksmith's shop people hear hammering noises and this is the site of an explosion that killed the blacksmith and his son. People have seen a man looking out the window of the warehouse. A security guard confronted a man walking around upstairs, and when he asked him to leave the man walked out through the wall! In the sick house, once used for tuberculosis patients, workers found the house trashed and a little girl crying in the corner, only to have the girl disappear just after!\n\nWhy is this suddenly happening? Hopefully the team can answer some questions.\n\nNext the team heads to British Columbia, to Hell's Gate Airtram, the site of the construction of the Canadian Pacific Railway. Rumor holds that for every mile of track that was laid, 3 Chinese workers were killed. Reports are of apparitions, sounds of shouting and screaming and the figure of a man in the dining room who is smoking a cigar. Products have fallen off walls, people hear footsteps and voices, and someone saw a dark shadow with fierce Doberman dogs with them. In the terminal, guests have felt people playing with their hair. The activity has kicked up during the winter season and the operators of Hell's Gate are concerned they won't be able to re-open in the spring.","vote_average":0,"vote_count":0,"air_date":"2012-04-04","episode_number":13,"episode_type":"finale","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null},"name":"Ghost Hunters International","next_episode_to_air":null,"networks":[{"id":77,"logo_path":"/iYfrkobwDhTOFJ4AXYPSLIEeaAT.png","name":"Syfy","origin_country":"US"}],"number_of_episodes":62,"number_of_seasons":3,"origin_country":["US"],"original_language":"en","original_name":"Ghost Hunters International","overview":"Ghost Hunters International was a spin-off series of Ghost Hunters that aired on Syfy. The series premiered on January 9, 2008. Like its parent series, GHI was a reality series that followed a team of paranormal investigators; whereas, the original series primarily covers only locations within the United States, the GHI team traveled around the world and documented some of the world's most legendary haunted locations.","popularity":8.214,"poster_path":"/1WAjct2Nqc6hB5maRaAwXUwjQHP.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":null,"episode_count":1,"id":25370,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2008-01-09","episode_count":23,"id":25367,"name":"Season 1","overview":"","poster_path":"/iPL5LDc40cUPrJOGaBjyHuFDuwt.jpg","season_number":1,"vote_average":10},{"air_date":"2009-07-08","episode_count":26,"id":25368,"name":"Season 2","overview":"","poster_path":"/dCR3Q6H4O9PwxP2yZbdb0knwxpO.jpg","season_number":2,"vote_average":0},{"air_date":"2011-07-13","episode_count":13,"id":25369,"name":"Season 3","overview":"","poster_path":"/qMImIDGArsQUGv7XCTjkDUew6Te.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.519,"vote_count":27,"season_data":{"1":{"_id":"52582dee760ee36aaa8aff3c","air_date":"2008-01-09","episodes":[{"air_date":"2008-01-09","episode_number":1,"episode_type":"standard","id":513007,"name":"Chillingham","overview":"The team investigates England's Chillingham Castle.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/nueU4vm0pq2YDPp7dbvk2b8K1Vy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52582def760ee36aaa8aff7e","order":501,"adult":false,"gender":2,"id":1216565,"known_for_department":"Acting","name":"Jason Hawes","original_name":"Jason Hawes","popularity":0.802,"profile_path":"/apMH8oOedXa1p09tCeOZGU4bO2R.jpg"},{"character":"","credit_id":"52582def760ee36aaa8aff98","order":502,"adult":false,"gender":2,"id":218886,"known_for_department":"Acting","name":"Grant Wilson","original_name":"Grant Wilson","popularity":0.654,"profile_path":"/aGUqK5uiTN4SUNkr1JLYqaxHbLo.jpg"}]},{"air_date":"2008-01-16","episode_number":2,"episode_type":"standard","id":513014,"name":"Evil Unearthed","overview":"The Abbey at Lucedio, Italy and the Nanteos Mansion in Wales are investigated.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/9mVqxKinMUAmaBLcFpxVElwgLzL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-23","episode_number":3,"episode_type":"standard","id":513008,"name":"Whispers From Beyond","overview":"The GHI team arrives at the Ragged School, formerly an orphanage and currently abandoned. The structure shares a basement connection with a shop called Camera Obscura, whose employees no longer venture into the basement because of all their experiences.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-30","episode_number":4,"episode_type":"standard","id":513010,"name":"Haunted Village","overview":"The team arrives in Pluckley Village, listed by the Guinness Book of World Records as \"Europe's most haunted village.\" Their first stop is at the Black Horse Inn where owner Kevin Savidge gives them a tour, pointing out where people saw ghosts, including those of Will the Bailiff and a 7-year-old girl who was murdered.\n\nNext destination is Elvey Farm in England.  The farm manager Simon Peek gives the team a tour of the farm, which was built in 1406, and its surroundings, including the famed Screaming Woods.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/diEexEIlavY7dfUQbj2oyDRGPq0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-06","episode_number":5,"episode_type":"standard","id":513016,"name":"Fortress of Fear","overview":"The GHI team arrives in the Transylvania section of Romania, ready to investigate Citadel Rasnov, high in the mountains. The snow makes it difficult to drive, and they wind up walking up the last section of road with their equipment.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/vJaIzA8JfCEWCUlo9HkO0hiIHkM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-13","episode_number":6,"episode_type":"standard","id":513012,"name":"Headless Haunting","overview":"The GHI team arrives in Slovakia to become the first to investigate Orava Castle, where the classic silent film Nosferatu was shot. Upon arrival, they meet with Peter Palka, a local historian, who guides them through the structure.\n\nThe team's next stop is Germany's Reichenstein Castle which was built in the 11th century. Caretaker Sandor Schmitz gives the team a tour while telling them the legend of Dietrich, lord of the castle, whose head was cut off. His decaptitated ghost is said to still haunt the structure, searching for its head.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/lHveSlJKLR6jmG7mY5K36Joz1wc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-20","episode_number":7,"episode_type":"standard","id":513009,"name":"Frankenstein's Castle","overview":"The GHI team is thrilled to be joined by Destination Truth host Josh Gates for their visit to the Castle Frankenstein in Germany. En route, Donna explains the castle was constructed 12 centuries earlier and fell into disuse in the 19th century. Mary Shelley's famous horror novel, Frankenstein, was based on the actual exploits of Konrad Dipple Von Frankenstein, an alchemist who performed experiments on dead bodies that he exhumed.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/i4mbRy3TBQoN4OW2BYD3BeblHBd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52582def760ee36aaa8affd7","order":500,"adult":false,"gender":2,"id":218897,"known_for_department":"Acting","name":"Josh Gates","original_name":"Josh Gates","popularity":3.594,"profile_path":"/a3FCAPDaOWi5C7PEKXDvgzKfWbK.jpg"}]},{"air_date":"2008-07-09","episode_number":8,"episode_type":"standard","id":513011,"name":"Larnach Castle","overview":"The team makes its way to what many believe is the most haunted site in New Zealand, Larnach Castle. With a long history of death, tragedy, scandal and suicide, Larnach Castle is believed to be haunted by all members of the Larnach family, who each occupied a portion of the estate.\n\nThe patriarch supposedly keeps watch over the lower floor, while his daughter and wife make their presence known upstairs. The Ghost Hunters International team brave the wrath of the Larnach family and figure out who really is the keeper of the castle.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/xhCjgZBhbsuXEl5TSEqhXsHt0AT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-07-16","episode_number":9,"episode_type":"standard","id":513015,"name":"Devil Dog","overview":"It's so embarrassing when a fading entertainer refuses to leave the stage, but sometimes it can be down right frightening. The GHI gang spend a night in Wellington, New Zealand's St. James Theatre and Opera House to see if they can flush out some of the ghosts that supposedly occupy the site.\n\nThen, the team travels to the Woodchester Mansion in Woodchester Park, England. The mansion is still under construction, but the ghosts that occupy the deserted space are fully realized. Allegedly haunted by a host of paranormal personas ranging from a Victorian gentleman, an American soldier and a young woman, the mansion is teeming with supernatural activity.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/aIKpqj9VGSjROl3plFFgzJFNh4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-07-23","episode_number":10,"episode_type":"standard","id":513013,"name":"Castle of the Damned","overview":"It's off to Ireland to explore the mysteries of infamous Charleville Castle. Built on the graves of people who were buried alive, and situated on an underground labyrinth, Charleville Castle was once rumored to be the scene of devil worshipping and ritual human sacrifice.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/RpqNe9Xd5sIkxo9KEOS3V9RYWY.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-30","episode_number":11,"episode_type":"standard","id":513018,"name":"Shattered Spirit","overview":"The Ghost Hunters International team visits Bodelwyddan Castle in Rhyl, England. Shrouded in mystery and housing unidentified bones in its walls, the only thing certain about this castle is the presence of unexplained shadows and drifting figures through its long corridors.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/dU8lHll0DJv6ZfjSVVDQ2YkMv3A.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-06","episode_number":12,"episode_type":"standard","id":513017,"name":"Hauntings of South Africa","overview":"The team explores South Africa, and finds out about a prostitute named Charlotte who never properly checked out of the Nottingham Road Hotel in KwaZulu-Natal. Charlotte threw herself from a window, and has been a hotel guest for over 200 years.\n\nThe team moves on to Nightmare Cave, the gravesite of an African civil war soldier. It's covered in graphic murals, and houses visible human remains and a ghost, quite possibly that of the deceased occupant's spirit. Nightmare Cave evokes anger and resentment in anyone who crosses through its stone expanses.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/AsKJ8kTlCVcLME25pty13CkovQZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-13","episode_number":13,"episode_type":"standard","id":513020,"name":"Tortured Souls","overview":"The team's the first ever to investigate the Predjama Castle, an ominous Slovenian national monument. Once a refuge site for the Luegg family, the castle is now home to a museum.\n\nEmployees lock up long before dusk to avoid encountering the spirit of Robin Hood-like Erasmus, who is still trying to keep the castle stocked with food and supplies. Nobody has spent the night at Predjama for over 20 years, but that won't stop the team from confronting the keeper of this castle.\n\nThe team then travels to another castle with a far more gruesome pedigree.\n\nThe Bathory Ruins at Cachtice Castle in Slovenia, are home to the final resting place of prolific and infamous serial killer Elizabeth Bathory. Known as the Bloody Countess, Bathory terrorized, tortured and killed over 600 young women, using her royal connections to escape persecution. Bathory passed away in the castle in 1614, but visitors, particularly women, still feel her presence today.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/5PwHSf1fqlKNB9TSK9sBTLGqzxg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-20","episode_number":14,"episode_type":"standard","id":513019,"name":"Dracula's Castle","overview":"It's off to Romania's Banffy Castle, known as the Versailles of Transylvania. In it's prime, the castle was home to the Banffy family. Even with a war raging all around the castle, Miklos Banffy, refused to abandon his beloved home, and still makes his presence known today.\n\nThen the team travels to Poienari Castle to visit the residence of Vlad the Impaler, better known as the legendary Dracula. Seeking refuge from the Turks, Vlad surrounded himself by a forest of snakes and other obstacles to keep his attackers (and anyone else) at bay. The Impaler's wife threw herself out of a window. Details of his own death remain sketchy enough to propagate legions of rumors. His spirit remains a constant presence, watching over his castle.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/1B5vy4m7lNJO479dh6Pn2EgqzWD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-07","episode_number":15,"episode_type":"standard","id":513021,"name":"Real Felipe Fortress","overview":"The team's the first ever to investigate the Predjama Castle, an ominous Slovenian national monument. Once a refuge site for the Luegg family, the castle is now home to a museum.\n\nThe team then travels to another castle with a far more gruesome pedigree.\n\nThe Bathory Ruins at Cachtice Castle in Slovenia, are home to the final resting place of prolific and infamous serial killer Elizabeth Bathory. Known as the Bloody Countess, Bathory terrorized, tortured and killed over 600 young women, using her royal connections to escape persecution. Bathory passed away in the castle in 1614, but visitors, particularly women, still feel her presence today.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/eYc4s0fSgfp3hnnEPYWR321FEHF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-14","episode_number":16,"episode_type":"standard","id":513023,"name":"City of the Doomed","overview":"While in Brazil, TAPS first investigated the Grande Hotel in Cambuquira, Brazil. Legend has it that a local priest cursed the town that the hotel resides in. The Grande Hotel is open for business, but guests tend to shy away from the location due to the frightening stories that surround the building. Apparitions of the restless souls are seen roaming the empty corridors and strange voices are regularly heard in the kitchen.\n\nAfter completing their work at the Grande Hotel, the team headed to Apa street's Little Castle. Fearful members of the surrounding community adamantly avoid the castle and claim to have seen apparitions of young Alvaro, the son of the aristocratic Reis family. Alvaro is said to have murdered his entire family within the estate. Visitors of the castle have claimed that they've heard the chilling voices of the Reis family echoing in the supposedly abandoned hallways.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/8aOc1x2tjpiwp4NnkutplnLNhFd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-21","episode_number":17,"episode_type":"standard","id":513022,"name":"A Call For Help","overview":"The international ghost hunters answered the call of a local Denmark investigative team, who needed help deciphering whether or not the historic Trekroner Fort in Copenhagen is haunted. The battles of Copenhagen in 1801 and 1807 were fought at this fort, and during each war; many soldiers died on the grounds. Presently the spirits are still suspected to lurk around in search of the unknown.\n\nWhile in Peru, the team sought answers as to whether or not Casa Garland, a family house, was haunted.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/gObeeGvYXsdhBI5CG080mGtHzvy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-28","episode_number":18,"episode_type":"standard","id":513024,"name":"Restless Souls of Sweden","overview":"Investigator Joe Chin joins the team as they set out to examine one of the most notoriously haunted Inns of Sweden. The location was formerly a vicarage in 1876 and is allegedly haunted by the ghost of a chaplain's wife who was buried on the grounds of the property. Visitors of the inn have reported hearing strange noises, seeing objects move and glimpsing frightening apparitions of women walking along the grounds.\n\nAfter investigating the vicarage turned-inn, the team headed over to Varberg, Sweden, where they investigated the paranormal events surrounding the 800-year-old fortress of Varberg. The fortress was originally built in 1618 and was then used as a prison, and now currently serves as a museum. Many prisoners were condemned for life and buried on the grounds of the fortress and their spirits are said to still roam the space.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/4rq0wwGFaquOEAewIPRISGLLKb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-04","episode_number":19,"episode_type":"standard","id":513025,"name":"Buried Alive","overview":"The Ghost Hunters International team traveled to Denmark to uncover the truth behind paranormal activities at the Dragholm Castle. Various legends surround the location, including one story that entails the princess being buried alive in the walls by her father - who was enraged that she had fallen in love and gotten pregnant by a local peasant. In more recent times, the apparition (presumed to be the broken hearted princess) of a woman has been seen roaming the halls of the castle.\n\nIn Rio de Janeiro the team investigated the Jose Bonifacio Cultural Center, which was constructed in 1877 and built on a slave burial ground. Many witnesses from the community have reported hearing the voices of the disturbed souls and the footsteps of people that are nowhere to be found. The center is allegedly haunted by a disgraced former Admiral for the Brazilian Navy because of the center's emphasis on African related history.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/9Zs6jTb71UpULPTv7b2HyJQl5gQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-11","episode_number":20,"episode_type":"standard","id":513026,"name":"Unknown Soldiers","overview":"The team journeyed the distance to the Philippines to investigate the haunted Clark Hospital. Once occupied during WWII by the Imperial Japanese army and then seized in 1945 by the Americans, numerous soldiers have died in the hospital and their souls have yet to leave the grounds. To date, security guards of the buidling affirm that they've seen a full-bodied man with a skull for a face walking through the halls. Others attest to hearing voices, footsteps and sounds similar to crying heard in and around the pediatric ward of the building.\n\nFor their second case, the investigators went to the Diplomat Hotel, which was first used as a monastery, then a sanitarium and a refugee torture camp for the Japanese. Workers and tourists claim to have seen the dark figure of a man who is completely black — with no visible face. Allegedly this man roams the grounds so often that many have grown accustomed to seeing him. Visitors of the hotel also claim to have seen the full-bodied apparition of various women in the Garden Chapel.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/nvjesAYCdMMnE63v4WMLK4yTHMM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-18","episode_number":21,"episode_type":"standard","id":513027,"name":"Spanish Scares","overview":"The team set out to investigate the Castillo Coracera in Madrid, Spain, which was constructed in the 14th century and is allegedly cursed. A Spanish admiral bought the castle in the 1920s and when his two brothers died in a plane crash he was said to have buried them in the walls. Since that time, people on the premises have made reports that they heard loud screams coming from that same area of the castle. Another eerie legend is based on the 1980s death of the last owner who was a member of the Occult. To date, it is still unknown as to whether or not he killed himself or was murdered.\n\nThe team's next investigation took place at the Castel D'escales, which is a Medieval Castle that scholars believe was once used as a hideout for refugees who fled during the genocide of the Knights Templar. It currently operates in the summer as a bed and breakfast and no person who has stayed there has ever left without a story of an eerie encounter.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/hZOWykrFokENcx3Zdem0MViKGws.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-25","episode_number":22,"episode_type":"standard","id":513028,"name":"Ghosts In The City Of Lights","overview":"For their first investigation, the team researched the Chateau Lagorce, which was once home to many wealthy noblemen throughout the 19th century and was later seized by the Germans during World War II. The owner recalls seeing a shadow move across the wall and other guests have reported hearing voices throughout the building.\n\nNext, the investigators headed to the Paris Underground, which is reportedly known for its paranormal activity. According to Christopher Spence, the Underground researcher, the area was once used as a monk's monastery known as the Capucins Quarries. It was widely reported that they would see a green mist and then hours later someone from the group would die.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/tGjnBIswpe6uKKNfieZKIAfzUz8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-04","episode_number":23,"episode_type":"finale","id":513029,"name":"Karosta Prison","overview":"The team heads to Liepaja, Latvia's Karosta Cietums, a former military prison where they will try to unlock the tortured souls of the paranormal which are still caged inside.","production_code":"","runtime":null,"season_number":1,"show_id":14058,"still_path":"/qPtBU6FzDRIRvUYdfyqyRnz2MA2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":25367,"poster_path":"/iPL5LDc40cUPrJOGaBjyHuFDuwt.jpg","season_number":1,"vote_average":10},"2":{"_id":"52582dee760ee36aaa8aff4d","air_date":"2009-07-08","episodes":[{"air_date":"2009-07-08","episode_number":1,"episode_type":"standard","id":513034,"name":"Wicklow's Gaol","overview":"The team makes its way to Ireland, to check out Wicklow Gaol, a prison constructed in 1702 that once housed some 780 prisoners during the Great Famine. It's now a museum, but reports have been made of people being pushed or touched by unseen forces, seeing blood on the floor, and witnessing strange shadows and mists.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-15","episode_number":2,"episode_type":"standard","id":513035,"name":"Skeleton In The Closet","overview":"This week, the GHI team conducts a pair of investigations. The first takes them to the Czech Republic, where a sprawling castle known as Cesky Krumlov has been the setting for numerous reports of supernatural phenomena. Constructed in the 13th century, the castle spans five courtyards, 43 buildings and 15 acres of land, making it one of the largest locations ever investigated by GHI.\n\nNext, the GHI team moves on to Rathlin Island, off the coast of Northern Ireland. The target for the investigation is the island's Manor House, where caretaker Ksenia Zywczuk relates several stories of paranormal activity, including an exorcism that was performed in the house's Bedroom 6. We also hear from a witness who claims to have seen shapes moving around the back door of the dining room.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-22","episode_number":3,"episode_type":"standard","id":513030,"name":"Gate To Hell","overview":"This week, GHI investigates the Czech Republic's Castle Houska, a structure supposedly built to keep something in. Legend has it that the castle, dating back to the 13th century, was built over the Gates of Hell and meant to keep evil spirits from escaping into the world. Needless to say, the team is champing at the bit to get a crack at this gothic fortress.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-29","episode_number":4,"episode_type":"standard","id":513031,"name":"Witches Castle","overview":"The team arrives in Austria for the first time to investigate the eerie Moosham and Schloss Porchia Castles. First up, is the Moosham Castle, which was built in the 13th century by the Mooshimmer. Moosham Castle was allegedly a torture site during history's bloodiest witch trial. When the archbishop made accusations of witchcraft against certain women it was off with their— well, yeah, you know where we're headed (no pun intended!).\n\nStill high off the success of the investigation at the Moosham Castle, the team takes on the Schloss Porcia. The Porcia Castle was built in 1533 by the Salamanca dynasty and was purchased in the 1950s by the government to be used for a variety of purposes. The mayor, police department and caretaker have all had personal experiences with paranormals on the property. The most chilling legend surrounds Katharina, the last of the Salamanca family, who is said to have killed a worker with a wooden shoe. And they say good help is hard to find. To date, people claim to see Katharina roaming the castle's halls at night.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-05","episode_number":5,"episode_type":"standard","id":513032,"name":"Spirits of Italy","overview":"The GHI team heads to Italy for a pair of palace investigations. The first takes them to Fosdinovo, Italy, location of Malaspina Castle. Built in the 11th Century, the structure has been owned by one family for hundreds of years. Pietro, the latest in the line of owners, shows the team around to sites in which visitors have seen shadows, heard screams, and witnessed poltergeist activity like drawers opening and closing on their own.\n\nThat settled, the team moves on to its second case, Palazzo Ducale in Genoa, Italy. Once a seat of government, the palace has a long and bloody history of political intrigue. In addition to the murder of various government officials, some notable names were imprisoned there. Among them was violinist Nicolo Paganini, whose music is still heard reverberating in the halls. Also heard are sounds of wailing and crying, and one artisan working on restoring a fresco reported hearing a voice telling her, \"Good job.\"","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-12","episode_number":6,"episode_type":"standard","id":513033,"name":"Holy Ghost","overview":"GHI heads to the southern hemisphere for a pair of investigations in Chile. The first is in El Bosque, where the City Hall has been the site of numerous reported phenomena. Formerly an orphanage, the building also served as a retirment home for Catholic priests, and was used for the torture of suspected communists in the country's 1973 coup. \n\nOur second case this week takes GHI to Valparaiso, Chile, to the Santiago Severin Library. Built in the early part of the 20th century, the library houses some 180,000 books and is a central landmark in Valparaiso. According to liaison and local historian Gerry Woodhams, it has also been the site of numerous sightings and experiences.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-06","episode_number":7,"episode_type":"standard","id":513036,"name":"Hitler's Ghost","overview":"The Ghost Hunters International team makes its way to Argentina to visit the historic Gran Hotel Viena. The hotel is in disrepair now, but was once rumored to be a compound for Nazi war criminals who had fled Germany. Most significantly, there are conspiracy theories claiming that Adolph Hitler did not, as is popularly believed, commit suicide in a Berlin bunker, but rather fled to Argentina, and to the Gran Hotel Viena. Robb and the rest of the team are very excited to have the chance to seek the spirit of one of history's most notorious figures.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-13","episode_number":8,"episode_type":"standard","id":513037,"name":"Silver Shadow","overview":"The team's back in Argentina this week with a visit to the Eden Hotel, which many folks claim is the most haunted spot in the country. The hotel opened in 1899 and was a destination for the rich and famous, but is now a museum. Curator Rose Zicari leads the initial tour, detailing phenomena like the sounds of voices and moving shadows. Particularly of note are encounters children visiting the museum seem to have with the ghost of a little girl.\n\nThe second investigation takes place in one of Australia's most purportedly haunted locations. The Monte Cristo homestead was home to a family called the Crawleys, and is now a museum. Curator Reg Ryan tells of numerous phenomena experienced by him and his family, including cold spots, moving objects, and disembodied voices...including orders from Mrs. Crawley, herself, to leave the house.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-20","episode_number":9,"episode_type":"standard","id":513038,"name":"Quarantine Station","overview":"It's time for the Ghost Hunters International team to get ill, as they head out to Sydney's Quarantine Station. Opened in 1833, the location served as an entry point for passengers in which the sick were separated from the well and kept under some fairly harsh conditions. Cases of plague, typhus, cholera, smallpox and Spanish influenza were all prevalent there, and many people died within the station's confines.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-27","episode_number":10,"episode_type":"standard","id":513041,"name":"Port Arthur Penitentiary","overview":"A centuries-old prison that was home to rapists, murders, and the criminally insane sounds like a setting right out of a horror movie, but it's a real place - Australia's Port Arthur Penitentiary, rumored to be one of the most haunted spots in the world. As the team descends on the location, Brandy details Port Arthur's history, and a long list of reported paranormal phenomena that includes apparitions, moving objects, footsteps, and even people reporting being touched by spirits.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-03","episode_number":11,"episode_type":"standard","id":513039,"name":"Tasmanian Death Sentence","overview":"The GHI team remains in Tasmania to investigate a building that used to be the island's Supreme Courthouse. But its walls also had a darker purpose at one time- it was originally built to be a prison, and execution ground. Then they fly to Malaysia to investigate Kellie's Castle, a fabulous mansion built upon a tragedy- dozens of the Hindu workers died from sickness during its construction.\n\nThe team also travels - sans Brandy - to Malaysia to investigate a castle built by a Scottish immigrant for his family. Many Indian workers died in its construction, and visitors have reported manifestations of both these departed laborers and the owner and his family.Taj Yaacob, the Property Operator, leads the investigators on a tour of a second-floor corridor where lights have been seen, and even videotaped. In addition, spirits have been witnessed in a former bedroom and in the horse stables.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-10","episode_number":12,"episode_type":"standard","id":513040,"name":"San Lucas Prison","overview":"As the team rolls out, Robb informs us that Dustin won't be along for this particular trip, then tosses it to Brandy, who runs down the history of Costa Rica's San Lucas Island Prison. Built in 1862, it's the Costa Rican equivalent to Alcatraz, and has a dark history. Tour Manager Craig Lapsley meets the crew at the boat that will ferry them to the island, and regales them with tales of prisoner torture and the murder of both a nurse and a priest within the prison's confines.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-17","episode_number":13,"episode_type":"standard","id":513042,"name":"The Legend of Rose Hall","overview":"Sugar was king in the 1800s, bringing immense wealth to the owners of Jamaica's sugar cane plantations. There were 700 plantation great houses, all built on high ground to oversee the thousands of slaves who worked in the fields below. During the slave rebellion of 1831, 685 of the great houses were burned to the ground as hated symbols of the extravagant life styles founded on cruelty. Yet, one of the fifteen great houses which still remained was The Rose Hall Great House, a 6,000 acre and 3,000 slave plantation.\n\nRose Hall is a visually impressive Georgian Mansion and the most famous great house in Jamaica. Rich woodwork graces the interiors furnished with European antiques. It sits high on the hillside, with a panorama view over the coast in Montego Bay. John Palmer, the representative of King George III to the Jamaican Parish of St. James, built it between 1770 and 1780.\n\nRose Hall, however, is not only noteworthy for its beauty. It is also famous as the setting for a chilling Jamaican legend about the White Witch of Rose Hall filled with underground passageways, dungeons, bloodspill, and hauntings.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-14","episode_number":14,"episode_type":"standard","id":513043,"name":"The Spirit of Robin Hood","overview":"Location: Nottingham, England \n\nThe team heads to the Galleries of Justice in Nottingham, England, where the legend of Robin Hood is said to have originated. Recruits from last year's Academy, Susan and Karl, join the team in this facility that has reports of every kind of paranormal activity, including apparitions, attacks, noises, transfigurations and unexplained lights. \n\nScott and Robb head to the modern cells with a bevy of technical equipment to document reports of noises and bumps. Soon, they get a fluctuating EMF reading and Robb gets a serious case of the chills. Brandy and Barry set up an EVP session in the Reception Area to communicate with the apparitions of a Victorian man and woman seen there. They hear a sighing noise, but can't find the source. \n\nIn the courtroom, where people have reported seeing a black shadow and feeling their pews being hit, Paul and Scott attempt to communicate, and almost immediately hear bumping noises and see shadows. Attempting to get consistency, Scott \"gets New York\" on the spirit, growing more aggressive with his dialogue. They hear a loud bang, and Paul chases after it. Though they felt the entity was playing with them one moment, it seems to be gone the next. \n\nLater, Barry and Susan visit the courtroom, and they pursue the claim that the ghost of Judge Black transfigures - or changes the appearance of - people sitting in the judge's chair. Susan boldly sits in the chair, where she feels some bizarre sensations. Barry documents the session with a still camera. \n\nRobb and Karl move to Robin Hood's Tunnel, where the reports include dark masses as well as candlelight. They ask the presence to throw stones, or otherwise show itself. They hear a tapping sound, but soon deduce that it is caused by dripping water. \n\nPaul and Ashley investigate the Dark Cell, where a woman is said to have been thrown against a wall by a shadowy figure. They provoke the spirit, daring it to push them. They pursue the sound of a woman's voice, but find no apparent source. Upon sitting on the cell's bench, however, Ashley feels the wall behind her being hit. \n\nThen Ashley and Robb visit the Night Cell, where Robb uses the light meter in active mode, setting it to emit either UV or infrared light, and it begins to detect dramatic changes in the light coming through the door. After determining that the meter might be hurting the spirit, they switched it to passive mode, and the spirit departed. Paul and Scott explore the crumbling oubliette, where they hear a woman's voice, but cannot find its source. \n\nDuring analysis, the team comes across a potential EVP and a mysterious form in one of the windows. Barry and Robb present their information, including a \"Yes\" and a \"Get out\" audio clip from the Modern Cells. Paul and Ashley's EVP picks up a \"You're right\" response, and Robb and Karl's session in the Dark Cell yields a catch of tapping that confirms their experience. Barry's photographs from the courtroom show a mist appearing during Susan's attempt at transfiguration, and a video clip shows another mysterious form in the courtroom. The client is thrilled to have some confirmation of what he and visitors have long suspected","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-21","episode_number":15,"episode_type":"standard","id":513044,"name":"Sweeney Todd","overview":"This week is a double-header, with the team starting at Margam Castle in Wales. They meet with Geraint Hopkins, a tour guide at the castle for roughly 20 years. They use his expertise to investigate the most active areas.\n\nTheir next stop is the 900-year-old Ostrich Inn in England, which served as the inspiration for Sweeny Todd. Former owners the Jarmans killed over 60 people by getting them drunk, putting them to bed, then dropping them through a trap door in the bed into a vat of boiling oil below. The murders took place in the Blue Room, and Scott Malpass, the current manager, as well as many of his employees, have felt sickening feelings of unease in that room. In other parts of the inn, people have had the feeling of being strangled and of seeing apparitions and lights.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-28","episode_number":16,"episode_type":"standard","id":513045,"name":"Wolf's Lair","overview":"The team makes their debut in Poland at the Wolf's Lair, Hitler's Eastern Front command post, where he spent roughly 800 days and where the attempt on his life, Operation Valkyrie, failed. Judwiga, the staff historian, tours them around the facility, where eerie noises, voices speaking German, and creepy feelings, as of being watched, abound.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-04","episode_number":17,"episode_type":"standard","id":513046,"name":"The Devil's Wedding","overview":"The team goes to investigate some of the boldest claims they've ever faced, in the Fredricksten Fortress in Norway. Robb and Ashley start at the bell tower, a spot where a woman, now known as the White Lady, was said to have killed herself and later, as a ghost, to have pushed a lieutenant to his death. Robb tempts the spirit by standing on the ledge and provoking the White Lady into touching him.\n\nThe next stop is The Old House in Tallinn, Estonia, where a legend circulates of a former inn owner witnessing the Devil getting married, and several reports of more contemporary paranormal experiences, as well.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-11","episode_number":18,"episode_type":"standard","id":513047,"name":"Demons Of Nicaragua","overview":"The team heads to Nicaragua, and Susan, after introducing the ghost hunters to her extended family, leads the way. She and Robb check out the Beast Tower in Coyotepe Fortress, where Satanists have been known to perform rituals. They both feel strange sensations and pursue a mysterious noise with the feeling that they're being toyed with. As Joe and Barry investigate the site of an exorcism, they hear footsteps and call on Scott and Paul for backup, who report that one of their cameras has gone out. Revisiting the Beast Tower, Scotty and Joe hear a \"Hey,\" and hope to catch it in analysis.\n\nTheir next stop is Leon, at the museum of Carcel XXI, a onetime facility where criminals were held and political prisoners were hideously tortured. Many of the employees have quit due to the high level of paranormal activity.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-18","episode_number":19,"episode_type":"standard","id":513048,"name":"Pirates Of The Caribbean","overview":"In Omoa, Honduras, the team heads to Fortaleza de San Fernando, a former fortress and prison with connections to the history of the pirates of the Carribean.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-05","episode_number":20,"episode_type":"standard","id":513054,"name":"Hamlet's Castle","overview":"The team heads to Kronborg Castle in Helsingor, Denmark - the setting that Shakespeare chose for Hamlet. Their client, Shane, gives them a tour that includes a massive ballroom, Queen Sophie's room, and a dungeon that has a reputation for bizarre noises and draining camera batteries.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-12","episode_number":21,"episode_type":"standard","id":513050,"name":"Ghosts of the Eastern Bloc: Ukraine and Poland","overview":"In the countryside of Ukraine lies a castle called Pidhirtsi. Dr. Vita Susak wants to turn the erstwhile tuberculosis hospital and Nazi experiment grounds into a museum, but she's concerned about the paranormal activity there. When GHI arrives, they begin by investigating tales of the nobleman who lived there who allegedly immured his wife because she was unable to have children. Visitors have spoken of seeing a White Lady - thought to be the nobleman's wife - and while Susan looks for her, she's hit by a dizzy spell, hears someone say \"Oi,\" and feels something touch her face. While Britt and Joe seek the White Lady in the chapel, they also feel lightheaded. In an EVP session, they ask for a knock, and get one. They ask again, and again get a positive response.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-19","episode_number":22,"episode_type":"standard","id":513049,"name":"Unfaithful Spirit: Germany","overview":"The team seeks the source at Fursteneck Castle in Germany. The legend of the place is that a medieval knight interred his cheating wife is its walls, and an apparition, thought by many to be her, is often seen in this castle-turned-hotel.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-26","episode_number":23,"episode_type":"standard","id":513051,"name":"Amsterdamned: Netherlands","overview":"Can a house ruin a man’s life? According to Johan Vlemmix, owner of what is referred to as the most haunted house in the Netherlands, it can. He bought the house just over a year ago, and since that time, all aspects of his life have gone downhill. The previous owner concurs – his own life is in shambles, he says, solely because of the house. Johan is grateful to have GHI present, and they, in turn, do their best to get to the bottom of the strange phenomena to which the house is prone.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-02","episode_number":24,"episode_type":"standard","id":513052,"name":"Army Of The Dead: Serbia","overview":"Europe's largest undestroyed fortress - the Petrovaradin Fortress in Novi Sad, Serbia - is bound to have a few stories to tell, and the GHI team want to hear them. Alen Panikovic, who works at the now-museum, shows the team the grounds, including a prison, a barricade area, an execution wall, and a tunnel system 16 kilometers long. The facility is so large that their normal equipment won't do the trick, but luckily Paul is able to rig a device for each of the investigators so that they can carry DVs, audio recorders, EMF detectors - the whole toolkit - on one hand-held rig. Genius. Barry warns them to be careful of the fortress's dangers, including collapsing tunnels, and with that, the explorers set off.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-09","episode_number":25,"episode_type":"standard","id":513053,"name":"Shadows in the Dark: Scotland","overview":"The destination this week is Scotland, starting at Usher Hall in Edinburgh.\n\nThe next Scottish location is Inveraray Jail. All manner of prisoner were housed there, including children as young as seven.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-16","episode_number":26,"episode_type":"finale","id":513055,"name":"Soldiers of Misfortune: Puerto Rico","overview":"The GHI team head to Puerto Rico, but they're not expecting a relaxing time at the beach. Debbie Molina Ramos has called them here to see if visitors to her facility, the San Cristobal and El Morro Fortresses in San Juan, are safe from the paranormal activity they've reported.\n\nThe investigators continue to their next hotbed of paranormal activity, the Tapia Theater, also in San Juan. They team up with local investigator Bruce Otero to gain the inside info that the building used to be an execution site.","production_code":"","runtime":null,"season_number":2,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":25368,"poster_path":"/dCR3Q6H4O9PwxP2yZbdb0knwxpO.jpg","season_number":2,"vote_average":0},"3":{"_id":"52582dee760ee36aaa8aff58","air_date":"2011-07-13","episodes":[{"air_date":"2011-07-13","episode_number":1,"episode_type":"standard","id":513056,"name":"Rising from the Grave: Trinidad","overview":"The team goes to Trinidad to probe claims concerning the ghost of a cocoa plantation owner in the Season 3 premiere.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-20","episode_number":2,"episode_type":"standard","id":513059,"name":"Sensing Evil: Argentina & Trinidad","overview":"A former leper colony is probed on Trinidad's Chacachacare Island; the ghosts of four murdered workers are sought at a meat packing plant in Argentina.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-27","episode_number":3,"episode_type":"standard","id":513057,"name":"Touched By The Dead: Ireland","overview":"The team heads to Barry's homeland of Ireland to investigate two local infamous cases. The first is at Roe Valley Hospital, a site that began as a workhouse - a facility where the homeless were forced to perform grueling labor - until it was transformed into a hospital by Dr. Robinson, a woman who is said to haunt the grounds today.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-03","episode_number":4,"episode_type":"standard","id":513058,"name":"Search For The She-wolf: England","overview":"The team goes to Britain in search of a she-wolf.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-10","episode_number":5,"episode_type":"standard","id":513060,"name":"Murders and Mysteries: England and New Zealand","overview":"Probing Castle Rushen on the Isle of Man, where sightings of a ghostly girl have been reported. Also: the team goes to New Zealand to investigate a hotel, the site of an unsolved murder.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-17","episode_number":6,"episode_type":"standard","id":513062,"name":"Imprisioned Souls: New Zealand","overview":"The team probes New Zealand's Napier Prison, where phantom footfalls and disembodied threats have been heard and doors have allegedly closed by themselves.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-22","episode_number":7,"episode_type":"standard","id":513061,"name":"Temple Of Doom: Peru","overview":"Claims of paranormal activity and legends of a magical stone are probed in Peru's Chavin ruins.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-29","episode_number":8,"episode_type":"standard","id":513064,"name":"The Man in the Iron Mask: Italy","overview":"The team heads to the Fort of Fenestrelle in Turin, Italy. This massive fortress will require the team to climb 4,000 steps to reach the investigation site. There is a prison in which hundreds died, including a man who had been forced to hide his face behind an iron mask as punishment for his crimes. Locals believe this man is haunting the prison and fortress- and one witness claims to have seen the apparition of the man with burning red eyes! In the officer's prison, people speculate that the man with the iron mask was a relative— either an identical twin, illegitimate child or distant relative — to the king. As he was a threat to the crown, he was imprisoned and forced to cover his face. A resident walking his dog once saw the man with the iron mask, and his dog went crazy over it.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-07","episode_number":9,"episode_type":"standard","id":513063,"name":"The Crystal Maiden: Belize & France","overview":"In San Ignacio, Belize the team investigates caves that the ancient Mayans believed were the first of nine layers to the underworld.  The caves were the sites of numerous human sacrifices, including that of the Crystal Maiden, whose bones have been there so long they have crystallized into the cave floor.  Claims at the cave, as reported by cave guide Emil Gamez, include chanting noises, balls of fiery light and spirits that pass through people's bodies. In the tomb-like area of the Crystal Maiden people feel strange energy, a sense of unwelcome and glowing lights around the Maiden.\n\nNext the team investigates a 14th century mansion in Queaux, France where a ghost named Alice is haunting the women visitors to the home.  She died in the 1920's of a kidney infection and now it seems that any woman who stays in Alice's room gets the same infection! Even the homeowner's daughter ends up in the hospital.  How creepy!  Full body apparitions, voices, touching, violent noises and shadows add to the mystery.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-14","episode_number":10,"episode_type":"standard","id":513065,"name":"Sacrificed Mayan Spirits: Belize and France","overview":"The team tries to help a man who is being tormented by spirits from the Mayan ruins of Cahal Pech; one team member takes part in a ritual to contact Mayan spirits.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-21","episode_number":11,"episode_type":"standard","id":513066,"name":"Ghoul's School: American Samoa","overview":"The team investigates an abandoned all girls' school in American Samoa; It is believed that the Samoan Chief possessed and killed schoolgirls.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-28","episode_number":12,"episode_type":"standard","id":513067,"name":"The Rise of Frankenstein: Belgium & Italy","overview":"The team heads to Belgium seeking the ghost of a fallen soldier. Then, they head to Frankenstein's birthplace.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-04","episode_number":13,"episode_type":"finale","id":513068,"name":"Hell's Gate: Canada","overview":"The Ghost Hunters International team travel to Lower Fort Garry in Manitoba, Canada, which was originally built to protect the fur trade. Paranormal activity has increased in recent months!  \n\nPeople have spotted the apparition of a little girl in the guest cottage and a figure of a man and a woman in the prison where a guard once killed himself. From the blacksmith's shop people hear hammering noises and this is the site of an explosion that killed the blacksmith and his son. People have seen a man looking out the window of the warehouse. A security guard confronted a man walking around upstairs, and when he asked him to leave the man walked out through the wall! In the sick house, once used for tuberculosis patients, workers found the house trashed and a little girl crying in the corner, only to have the girl disappear just after!\n\nWhy is this suddenly happening? Hopefully the team can answer some questions.\n\nNext the team heads to British Columbia, to Hell's Gate Airtram, the site of the construction of the Canadian Pacific Railway. Rumor holds that for every mile of track that was laid, 3 Chinese workers were killed. Reports are of apparitions, sounds of shouting and screaming and the figure of a man in the dining room who is smoking a cigar. Products have fallen off walls, people hear footsteps and voices, and someone saw a dark shadow with fierce Doberman dogs with them. In the terminal, guests have felt people playing with their hair. The activity has kicked up during the winter season and the operators of Hell's Gate are concerned they won't be able to re-open in the spring.","production_code":"","runtime":null,"season_number":3,"show_id":14058,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":25369,"poster_path":"/qMImIDGArsQUGv7XCTjkDUew6Te.jpg","season_number":3,"vote_average":0}}}