{"adult":false,"backdrop_path":"/pLDSMPwzcx43K5lHQnNYiJgwGK5.jpg","created_by":[{"id":196178,"credit_id":"525705a5760ee3776a018c3e","name":"Mark Shirrefs","gender":0,"profile_path":null},{"id":1224718,"credit_id":"525705a6760ee3776a018c46","name":"John Thomson","gender":0,"profile_path":null}],"episode_run_time":[24,25],"first_air_date":"1995-01-09","genres":[{"id":10751,"name":"Family"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"","id":1455,"in_production":false,"languages":["en"],"last_air_date":"1997-10-24","last_episode_to_air":{"id":957123,"name":"A Wedding Surprise","overview":"After evrything settles --Sun has scholar Merck take all the huns to land of machines -- there is more than enough room for their people there and they can help repopulate the earth there. Ashka is blindfolded and told to select a destanation by moving the musical to jewels to whatever setting she chose ( without the aid of site) here they maroon her in the middle of a forrest with nothing but ehr power suite to protect her.    Josh and Kathy and their family are returned to their own world. Sun and his sister decide to share the Throne. Everything turns out well.","vote_average":0,"vote_count":0,"air_date":"1997-10-24","episode_number":26,"episode_type":"finale","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/64G1wH3MYjFNXq9OJ8540d53TCY.jpg"},"name":"Spellbinder","next_episode_to_air":null,"networks":[{"id":66,"logo_path":"/pXibAQSgIIanNkSg68dUooI7IGU.png","name":"Nine Network","origin_country":"AU"}],"number_of_episodes":52,"number_of_seasons":2,"origin_country":["US","AU","PL"],"original_language":"en","original_name":"Spellbinder","overview":"A group of teenagers go on a school camp in the Blue Mountains in Australia. While at the camp, Paul Reynolds accidentally goes into a parallel universe. This other world is inhabited by a more hierarchic and technologically different society, ruled by a group of people known as Spellbinders.","popularity":12.661,"poster_path":"/piDLgTPFgQ4ePpfbAZadkaqlWYg.jpg","production_companies":[{"id":6480,"logo_path":"/qJUUNzFYXNUDaisssBTV3Zdki9R.png","name":"TVP","origin_country":"PL"},{"id":8884,"logo_path":null,"name":"Film Australia","origin_country":"AU"}],"production_countries":[],"seasons":[{"air_date":"1995-01-09","episode_count":26,"id":3909,"name":"Season 1","overview":"","poster_path":"/ucSWu6SUJjWOHGMIU5MMrECkKLR.jpg","season_number":1,"vote_average":0},{"air_date":"1997-09-01","episode_count":26,"id":3908,"name":"Season 2","overview":"","poster_path":"/lHOHxeOLGKeHKW02bYk8VOCwDCD.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.4,"vote_count":24,"season_data":{"1":{"_id":"5257059e760ee3776a01889f","air_date":"1995-01-09","episodes":[{"air_date":"1995-01-09","episode_number":1,"episode_type":"standard","id":69335,"name":"The Big Bang","overview":"A school excursion turns into a disaster when Paul disappears. As part of a practical joke, Paul and his friend Alex set up a cable, but it passes close to power lines. A strange electrical surge passes through the cable and explodes Paul into a parallel universe. Uncertain of his new surroundings, Paul is confronted by a strange man - a Summoner - who is angered when Paul steals his Eyestone","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/gMQQAUo635pjQ5mEknNlxjN8ZBd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-16","episode_number":2,"episode_type":"standard","id":69336,"name":"Where Am I?","overview":"While his classmates and the police are searching for him, Paul is trying to come to terms with his new and primitive surroundings. He has met a girl - Riana - but she is suspicious of his foreign ways and fears he is evil. She leaves him to his own devices, and his strange ways offend the people of this new world, particularly the powerful Spellbinders","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/3TgqBbpggMpwOghzmypJxYOrlUy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-23","episode_number":3,"episode_type":"standard","id":69339,"name":"Finding The Way Home","overview":"Paul manages to convince a frightened Riana that he is from another world. Together they make their way back to the place where Paul entered this new world. Seeing an electrical surge building up, Paul recognizes his chance to get home. But on the other side the police are still looking for Paul and, fearing the danger of an electrical surge, they knock down the pillars which are feeding the surge - destroying Paul's chances of returning home. Riana takes Paul back to her village","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/lQ9A3jTiByDyJf6stX7TJ2lFRVS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-01-30","episode_number":4,"episode_type":"standard","id":69340,"name":"It Isn't Magic, It's Science","overview":"Riana arranges it so that Paul can live and work in her village, but he finds the work in the fields unnecessarily difficult. Riana explains that things must be done according to the Spellbinders' instructions. Paul becomes skeptical about the Spellbinders' powers and soon realizes that they are using science, not magic,to appear powerful. The power suits that they wear have some kind of electrical energy. Paul tries to explain to the local Spellbinder, Gryvon, that he is from another world. He shows him things he has brought from his world and asks for some help to get home, but Gryvon accuses him of breaking Spellbinder law. Paul gets an opportunity to show off his unique talents by making fireworks to save the village from ravaging Marauders, but Gryvon takes him away to be judged.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/h3KM69o4rcbFhjI1im8Z0Y3LZ28.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-02-06","episode_number":5,"episode_type":"standard","id":69338,"name":"Secrets","overview":"Paul is brought before the Council of Regents in the Spellbinders' castle and is found guilty of stealing an Eyestone. He is banished to the wastelands for breaking Spellbinder law. One Spellbinder named Ashka is curious about Paul and is sympathetic to his story. She tries to convince the Council of his innocence. As a result, Paul is put in a cell while the Council decides what to do with him. Riana is making her way to the Spellbinder castle in an attempt to return Paul's video tape to him, hoping this will help him convince the Spellbinders that he is from another world. Meanwhile, Paul's family, friends and the police are still desperately looking for him back in his own world. One girl, Katrina, is convinced he has gone into a parallel universe but no one will believe her.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/2GxoPnkZjBAPXOzEVtLyfk3M0Ed.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-02-13","episode_number":6,"episode_type":"standard","id":69348,"name":"Show Me Your World","overview":"Ashka and Gryvon realize the potential of Paul's fireworks, and how powerful they would be if they knew how to make them. They plan to learn the secret from Paul. Riana manages to sneak into the Spellbinders' castle and finds Paul's video recorder in the hands of a Regent named Correon. She puts the tape in and shows him how the recorder works, playing back his image. Correon is fascinated and takes it to show the other Regents, who then question Paul about his world. Gryvon and Ashka realize that this could destroy their plans of becoming powerful, so they plot to take Paul for themselves, by telling the guards that Riana and Paul have escaped","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/wD2G0FM1lYPBXzxFalc14CyTTDy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-02-20","episode_number":7,"episode_type":"standard","id":69349,"name":"The Gunpowder Plot","overview":"Gryvon takes Paul to an unused part of the castle and insists he teach him how to make gunpowder. Meanwhile, Riana has convinced Correon that Paul has been abducted and they set off in search of him. They find Paul demonstrating the destructive power of gunpowder to Gryvon and Ashka. Once they know how to make their own gunpowder, Gryvon and Ashka are no longer interested in helping Paul. However, Paul had grown suspicious of Gryvon and Ashka and had given them false instructions, so their gunpowder won't work. Correon, having observed the strength of the gunpowder, realizes that Paul's knowledge is too dangerous for their world and insists on helping him return to his world. Correon lures Ashka back to the castle and captures Gryvon.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/6uV3he70JAayohfC0B1YiE9SZEM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-02-27","episode_number":8,"episode_type":"standard","id":69341,"name":"Secrets Of The Spellbinders","overview":"Back in Paul's universe Katrina has managed to convince another of Paul's friends of her suspicions as to where Paul is. They make their way back to the cave where he disappeared. Meanwhile, Paul and his rescuers are heading for the cave where he entered this new world. Katrina and Alex have made radio contact with the new world. They see energy rippling around the cave and get vague glimpses of figures in the doorway. Paul's attempts to pass back into his world are thwarted by the Ashka and Gryvon who have united to search for Paul and Correon. Paul flees to a nearby village only to be attacked by Marauders.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/g6SoTvQhH7ExTKsfDTkc4s7Jrb5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-03-06","episode_number":9,"episode_type":"standard","id":69342,"name":"The Labyrinth","overview":"The Marauders turn out to be regular people who had been banished by the Spellbinders and so disguised themselves. They capture Paul, Riana and Correon and take them to their camp in a labyrinth on the edge of the forest. Ashka and Gryvon have combined forces with another Spellbinder, Lucas. Convincing them they are chasing renegades, they are close on the trail of Paul and the Marauders. Paul manages to convince one of the Marauders of his story. He helps him get equipment and directs him out of the labyrinth.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/c8NxPWFIJomyu17To5SzAN0D49B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-03-13","episode_number":10,"episode_type":"standard","id":69347,"name":"Desperate Measures","overview":"Paul makes his way back to the cave, this time with a chain which will act as a conductor to create an electrical surge and help him return home. Paul's friends back home, Alex and Katrina, try again to make radio contact with Paul. They set up a two-way radio and make contact through Ashka's Eyestone. Alex and Katrina pick up that Paul is in trouble and transmit a warning to him. Paul hears the warning but is out of the labyrinth, making his way back to the cave. He fears for his new found friends safety so returns to the labyrinth to save them. The Spellbinders pursue Paul and his friends through the labyrinth, eventually capturing Paul and flying him back to their castle. Ashka wants to take Correon's position as a Regent, so misinforms all that he has been killed by Marauders. Ashka gets elected to the Council of Regents in Correon's place.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/6RVuo5X4t0qURXEug6vEnqwU2jU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-03-20","episode_number":11,"episode_type":"standard","id":69350,"name":"Centre Of Power","overview":"Ashka takes over Correon's position and settles into his rooms. She demands that Paul tell her how to make gunpowder but he gives her another incorrect formula. Correon returns to the Spellbinder castle to take his position but has to duel with Ashka. Gryvon rigs the duel so that Correon loses. Paul pleads for Correon's life to be spared, in return he will give them the formula for gunpowder. Correon gets banished into the wasteland. Riana is now the only hope of saving Paul and Correon. She is hiding outside the castle. Katrina and Alex try again to make radio contact with Paul. Their transmission comes through Gryvon's Eyestone and Paul yells back that he is being held prisoner. Paul is administered with a truth potion which was stolen from the Marauders. Ashka interrogates Paul under the influence of the truth drug and discovers that he has no practical knowledge about the weapons of the world. Riana disguises herself as a servant and sneaks into the castle. Together she and Paul ov","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/obb4BZXL72BuQ9t8qLxGKiKfkP6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-03-27","episode_number":12,"episode_type":"standard","id":69345,"name":"Spellbinder Jack","overview":"Paul's flying ship plummets out of the sky and Paul gets trapped. Wearing Gryvon's power suit he is able to pretend to be a Spellbinder. He and Riana are rescued by a local farmer who directs them to a nearby town. Ashka sends out Summoners to search for Paul and Riana. Realizing that the Summoners are close on their trail, Paul and Riana have to resort to floating down the river to escape. Alex and Katrina have troubles making plans for getting back up to the cave to help Paul return to his own world. Paul and Riana make their way to Riana's village to get a chain to help them open the doorway to Paul's world, but they are putting Riana's family at risk.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/flOqxYgi5G9e7P4XzOb8g9JKZCz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-04-04","episode_number":13,"episode_type":"standard","id":69344,"name":"The Final Challenge","overview":"Paul and Riana get caught by Summoners and Riana's family help them to escape, now they must all flee the village. Paul, wearing a power suit, manages to open the doorway into his world, but unbeknown to him, Ashka is hiding, waiting for an opportunity to pass into his world. Katrina's voice comes over Ashka's Eyestone, alerting Paul to Ashka's presence. There is a struggle between Ashka and Paul at the mouth of the cave. Riana arrives and distracts Ashka so Paul is able to pass into his world. He turns back to see Riana threatened by Ashka, so he grabs her and drags her into his world. A frightened Riana stares at the immensity of the world she has come to.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/ougCgReBwMALw9M9jRFE8cbs45F.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-04-11","episode_number":14,"episode_type":"standard","id":69343,"name":"Lost and Found","overview":"As Paul pulls Riana into his world, Ashka fires a bolt of energy which destroys the Summoning Tower. The doorway closes behind Riana, stranding her in Paul's world. Leaving the two-way radio set up so that Correon can contact them when he has rebuilt the Tower, they start walking to the railway station, where Riana gets lost. Paul is adamant that Katrina and Alex keep the Spellbinders' world a secret. They make a promise but Katrina is not happy. Paul and Alex go to Paul's home to get help in finding Riana but the police are there, having been alerted by a woman who recognized Paul on the train. Paul tells Alex to take the power suit and goes to meet his father. Wandering through the city, Riana' s odd behavior attracts unwanted attention. She has some fun, but mostly frightening experiences. She is chased and in desperation, takes refuge by climbing a building.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/3B0uLZXlX6x7fHY7c5GnD2weuGR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-04-18","episode_number":15,"episode_type":"standard","id":69346,"name":"Hospitality","overview":"Riana is rescued and questioned by the authorities. She is terrified. They think she is crazy and take her to the hospital. At school the next day, Katrina shows Paul and Alex a photo of Riana in the paper. The authorities are trying to find out who she is. Paul shows his father the photo and begs him to take him to the hospital. The doctor is beginning to suspect that Riana is some kind of \"\"wild child.\"\" The doctor concludes that Riana must have helped Paul in the bush and that Paul is suffering hallucinations and amnesia as a result of his ordeal. Riana tries to escape from the hospital, but is caught and placed in a security ward. Paul and Alex repair the power suit to try and prove Paul's story to Brian. Paul puts it on and energizes it. Every electrical device in Alex's house and the surrounding houses blows out. Paul realizes that the suit has some unexpected effects in this world.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/p7qCZrTLtlvkJD8ja80d2sEIqry.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-04-25","episode_number":16,"episode_type":"standard","id":69356,"name":"Breakout","overview":"A despondent Paul meets up with Alex and they try to visit Riana. She pleads with them to get her out. That night Paul and Alex use the power suit to get past security systems and break into the hospital. The suit's magnetic field damages the hospital computers. They rescue Riana and escape. They take Riana back to Paul's house. Paul hides Riana just before Brian comes in to take Paul and Christine to school. Alone, Riana is amazed, amused and frightened by the appliances and amenities of Paul's house. When Paul returns home he finds Riana has made a huge mess. Christine comes in and Paul is forced to hide the truth. Christine gets on well with Riana and agrees to help hide her and keep the secret. They clean up and Brian gets home.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/oXRnUR2aTqqaInANBvqBlvt1Tm1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-05-02","episode_number":17,"episode_type":"standard","id":69351,"name":"The Trojan Toffee Trolley","overview":"Riana begs Paul to allow her to come to school with him. With the help of a forged note, Paul passes Riana off as his cousin from Poland. Despite Paul's anxiety, Riana is able to fit in well. Katrina threatens to turn in Riana, if Paul doesn't allow her to use the power suit to convince her parents. Alex supports Katrina. Paul receives a radio message from Correon. The Summoning Tower has been rebuilt. They can take Riana home. Paul heads over to Alex's to get him and the power suit. They discover that the suit is gone. Paul realizes in horror that Katrina must have taken it. They race to Katrina's. At home, Katrina finishes putting the power suit on. She manages to turn it on. Power flickers at her finger tips.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/eMo4ipFgmtcHDQykEzP1IsqgP9F.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-05-09","episode_number":18,"episode_type":"standard","id":69354,"name":"Run","overview":"Paul and Alex race to Katrina's house just as she gets the suit working. They get the suit back. Unable to find Paul at school, Riana goes back to his house. No one is home, so she breaks in. Brian catches her and calls the police. Terrified, she breaks away and runs. Paul tells the police that he knows nothing. The next day, Riana goes to the school, looking for Paul. She gives a message to the teacher to pass on to Paul, which he does not receive until the next day. Paul and Alex take the power suit to the rendezvous. Paul recognizes the trail of Spellbinder eyes Riana had left for him and starts to follow them. Meanwhile, Riana is spotted by the police. They chase her. Paul activates the power suit and rescues her.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/rCzX6WP9tPO1irU2LjLwroF5kWD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525705a0760ee3776a018ad1","order":500,"adult":false,"gender":2,"id":33192,"known_for_department":"Acting","name":"Joel Edgerton","original_name":"Joel Edgerton","popularity":20.982,"profile_path":"/uFLxGHmPaNoTD6EMpMmu5bfP9Fr.jpg"}]},{"air_date":"1995-05-16","episode_number":19,"episode_type":"standard","id":69352,"name":"Reunions","overview":"Paul convinces Brian that he is going fishing for the weekend with Alex and his father, when he is really planning on going back to the Spellbinder's world. When Paul and Riana arrive at the cave, they use the radio to contact Correon. Correon opens the doorway and they step through to Riana's world. Correon tells them that Ashka is still at large, but poses no threat to the Spellbinders. Correon reveals that he has Paul's video camera with him. Paul starts filming proceedings so that he will have some proof for Katrina. Gryvon sneaks away and goes to Ashka who is hiding out in the forest. Ashka realizes that this is her last chance to get the gunpowder formula from Paul. Gryvon lures Paul to the outskirts of Clayhill where Ashka captures him.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/aIKNcp8ec2ybbJMZEDIAzUozifP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-05-23","episode_number":20,"episode_type":"standard","id":69357,"name":"Alien Invasion","overview":"Riana finds and rescues Paul, but leaves the video camera behind. Ashka flees and Correon calls for flying ships to search for her. With Gryvon's help she steals an Eyestone, opens the doorway, and enters into Paul's world. Paul returns to his world without the video camera. Katrina and Alex are furious that there is no proof of the other world. Paul reconciles with his father, assuring him that everything is going to be fine. But disturbing news reports of strange events make him realize that a Spellbinder is visiting his world.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/5K6AglFudALRmjEHByqT8j1a9RS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-05-30","episode_number":21,"episode_type":"standard","id":69355,"name":"Hunt For Ashka","overview":"Ashka is having a hard time in Paul's world. She uses the power suit in an electrical store and all of the appliances go haywire. Paul sees a report about the event and realizes that a Spellbinder must be in his world - Ashka. At school, Katrina finds Paul and Alex in the science lab, building two electromagnetic detectors. She suspects what they are up to, but they deny it. She decides to search on her own. Katrina visits the electrical shop where Ashka used her power suit and follows the magnetic signposts Ashka has left. Katrina finds Ashka who discovers that Katrina was a friend of Paul's and can be very useful to her. Ashka makes up a story about needing medicines to combat an epidemic in her world. Katrina agrees to help her. Katrina helps Ashka rent a hotel room where she learns about this world. Ashka decides to rob an armored car using her power suit. Paul and Alex detect the event and head for the city.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/hzaJ4SZhZ0XwfkuZYqZm3KBZmaz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-06-06","episode_number":22,"episode_type":"standard","id":69353,"name":"Clowning Around","overview":"Pretending to be room service, Alex locates Ashka. Katrina surprises them and is about to call for help but Paul convinces her that Ashka is up to no good. Ashka returns to the room and the boys have to hide. Paul grabs the power suit and throws it into a garbage truck where it is crushed. When Paul heads home, Ashka follows and spies on his family before returning to the cave. In Riana's world, Gryvon steals the Eyestone and sneaks up to the Summoning Tower where Riana sees him open the door to Paul's world and is shocked to see Ashka step through. After following them to the castle, Riana makes a noise and is caught. They seal her in the vault with the skeletons of the old Spellbinders.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/2BDQwojeyUn9t3pUEAhh3ze8Yei.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-06-13","episode_number":23,"episode_type":"standard","id":69358,"name":"High Tech Power Suit","overview":"Using all her strength and cunning, Riana manages to escape from the vault. She reaches the Summoning Tower just in time to see Ashka step through to Paul's world, where she follows her. Brian is hard at work at Newton Industries when he gets a call that a woman has arrived to see him - it is Ashka! She shows Brian the book she obtained from the vault. He is flattered when Ashka tells him that she sought him out because of his scientific reputation. He agrees to work with Ashka in discovering the book's secrets. That night Riana climbs in through the bedroom window and surprises Paul. She warns him about Ashka and her plan to build a power suit - they set out to find her. When Paul comes home from school the next day and hides Riana, Brian arrives and wants to introduce his new girlfriend. Paul is horrified to discover it is Ashka!","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/aMveXfG85q1RlWW3AwqrLqGPxPl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-06-20","episode_number":24,"episode_type":"standard","id":69360,"name":"A Spellbinder In The House","overview":"Paul tries to warn his father about Ashka, but Brian gets angry at hearing that Paul repeat his old story and takes Ashka to his lab to work on the book. Riana tells Paul she has the videotape of her world so he can prove to Brian that he has been telling the truth. Brian is infuriated by his son's behavior and refuses to look at the tape. Riana sneaks into the lab and tries to steal the book which contains the power suit plans. Ashka catches her and takes her back to her house and locks her up. Paul turns to his friend Alex for help, but Alex's father tells Paul to leave. Ashka reveals to Paul that she has Riana and warns him not to cause any trouble. In desperation, Paul stows away in the trunk of Ashka's car to find out where she is hiding Riana.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/mvs5IFQlvhTxlEAFQNZ02jo3bSl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-06-27","episode_number":25,"episode_type":"standard","id":69359,"name":"Breakfast Of Champions","overview":"Paul realizes he'll need help to save Riana and tips off Katrina and Alex. Katrina contrives to meet Ashka and manages to slip into her house before she can be stopped. Katrina booby traps the security system so that they can get in later. Paul encourages his father to ask Ashka to lunch and puts laxatives in her food. While Brian is tending the sick Ashka, Paul sneaks out. Paul, Alex and Katrina rescue Riana and find a case of money from the armored car robbery. They inadvertently start the alarm and the group splits up to get away from the police. Paul and Riana make their way to Paul's father's lab where they are shocked to see that Brian has finished building the new power suit.","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/lTnnd0G1FdOZcNQudsWGphrwTDD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1995-07-04","episode_number":26,"episode_type":"finale","id":69361,"name":"Flight","overview":"Brian, Paul and Riana are pursued through the building by Ashka. They are no match for the powers of the new suit. Ashka catches them, locks them up and tells them she is destroying all evidence of her work. She starts a fire in the building. Brian realizes there is a copy of the power suit plan on the computer at home and Christine is there on her own. They escape from the building and try to ring Christine from the car phone. She doesn't hear the phone so they contact Alex and Katrina who make their way to Paul's house. Over the phone Paul instructs Alex on how to make a copy of the file, but the phone goes dead. Christine screams as Ashka arrives, but Katrina takes her out the back door to safety.Brian, Paul and Riana arrive to confront Ashka. Alex manages to get a disk to Paul. Ashka realizes what has happened and races after them. Paul and Riana take refuge at the docks but Ashka corners Riana. Paul uses a huge electro-magnet to short out Ashka's power suit. Ashka is helpless and","production_code":"","runtime":null,"season_number":1,"show_id":1455,"still_path":"/nHqq9bsJ4w2dS69Cm8h3LzxDiiH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":3909,"poster_path":"/ucSWu6SUJjWOHGMIU5MMrECkKLR.jpg","season_number":1,"vote_average":0},"2":{"_id":"5257059e760ee3776a01888f","air_date":"1997-09-01","episodes":[{"air_date":"1997-09-01","episode_number":1,"episode_type":"standard","id":69362,"name":"The Trans- Dimensional Bamboo Boat","overview":"The Morgan Family is on vacation -- they choose to camp out in the \"\"Bush\"\" For a  couple of weeks to have some real family time. The Morgans have 2 kids Kathy and Josh. Josh pulls a prank on Kathy and she runs off.\n\nIn the Land of the Dragonlord scholar Meck has finished his latest invention -- a trans dimensional boat -- a boat in which he believes if he sets the musical jewels to the correct settings it will allow him to use the frequency to transport himself to parallel worlds.He does this against the Dragonlords orders. He tries it out anyways and finds himself in another world.\n\nKathy is still angry at Josh -- she sees a light appear out of nowhere on the lake. She goes to investigate only to see a chinese looking man next to a weird boat.\n\nafter an accidental scare scholar meck and Kathy get transported to another dimension - a dimension unknown to them -- the parallel universe of the Spellbinder!","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/zJPqgQ5aA5qKsU4BQBnsDMIkE4e.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-02","episode_number":2,"episode_type":"standard","id":957031,"name":"Ashka","overview":"Kathy and Meck are both stuck in a strange world -- after being taken in for questioning by a Spellbinder, they discover a servant named ASHKA who says she can help them. Her and her assistant Gryvon help them escape and she travels to the Land of The Dragonlord with Meck and Kathy.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/eBC1jT5e3uNgLQ4SWclvDWIos6W.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-03","episode_number":3,"episode_type":"standard","id":957030,"name":"The Dragon Lord","overview":"As Kathy and Ashka are brought to the palace to meet the Dragonlord -- Meck is ordered to dismantle the Boat - not allowing Kathy to return home. Kathy meets the Princess and is taken to the princesses brother \"\"the Dragonlord\"\" -- this king turns out to be a spoiled 6 year old child, who throws temper tantrums on a regular basis.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/p6y7AUIejyzoq1EqRbse8WW2Dts.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-03","episode_number":4,"episode_type":"standard","id":958552,"name":"Oracle","overview":"Kathy is well liked by the dragonlord cause she will play with him -- he allows her freedom of the palace - which is run by a computer program of sorts -- this computer is called \"\"the Oracle\"\". The oracle decides jobs and events throughout the land of the Dragonlord. The only way to change the programming is by the Dragonlord himself. While Kathy is liked by the Dragonlord -Ashka is not -- and she is left improsoned.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/q3XpzlX7QmRK6UkLAJAFRhufMGw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-09","episode_number":5,"episode_type":"standard","id":957119,"name":"Marooned In A World Of Monsters","overview":"Kathy shows the Dragonlord what a chocolate bar is -- Sun is so excited he tells scholar Meck to reassemble the Boat so that he can go to Kathys world and retrieve some. But the plan goes awry when he and scholar Meck arrive Sun sees a car for the very first time. Well him and Meck panick and try to go back -- when they get the correct settings done the boat starts to travel and accidentally pulls the car that they see with them!    The Car contains Kathys family searching for her -- and everyone ends up in the Land Of the Dragonlord.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/2khzYfiwnPvqOlRPO2KwPLOfZtZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-10","episode_number":6,"episode_type":"standard","id":957032,"name":"Attack of the Thirty-metre Warrior","overview":"The Land of the dragonlord is being invaded by a group of warriors and their family who are seeking shelter. Sun refuses them entry and calls his  \"\"guard\"\" a huge computer image of a giant - that can shoots lasers! The Huns give up temporarily although they take Kathys Family Hostage.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/hmWvtee2Z37oAJvqfgpAbzCJ2wZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-15","episode_number":7,"episode_type":"standard","id":958518,"name":"Josh, the Water Spirit","overview":"Josh escapes his captivity and goes to get help -- he makes it across the Dragonlords border and has to convince a few villagers that he is a water spirit.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/atD9FVDI3QPOVsdpNTgHhKkmVar.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-16","episode_number":8,"episode_type":"standard","id":957038,"name":"Sun Becomes a Star","overview":"Sun tries to got o Kathys World again - this time he takes Ashka as his body guard ( she has shown him how powerful her power suit is) -- well when she gets to Kathys world she maroons him there. He stumbles onto the set of a commercial. In the Meantime Ashka tells Suns sister taht a monster attacked him, and that he is dead.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/x3jsnv5sjYFcrgt5mReF4A8jPfG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-17","episode_number":9,"episode_type":"standard","id":957037,"name":"Designation Day","overview":"The Villagers that Josh stumbled onto are having their Job Choosing Day -- the day when the Otracle tells all the 15 year old teenagers what their designated Job will be for life. There is a girl who wants to be a performer -- she is told she must be a field worker -- she is upset- Josh tries to help.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/mvkUGWu0CyQwuF5eQu8zajFcRf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-22","episode_number":10,"episode_type":"standard","id":957033,"name":"The Oracle Is Dead","overview":"Ashka finds out the secret of the computer and staels the Jade Mask -- here is when Ashka decides to take control of Suns World.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/ang0l3l2lfL5P63uCjBKJ9XWKSz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-23","episode_number":11,"episode_type":"standard","id":957120,"name":"The Only Child in the World","overview":"Kathy and Meck steal the trans dimensional boat to go try to find Sun and to stop Ashka -- but the machine gets broken and they get sent to yet another parallel world -- this is a world where their are no Children -- even though Kathy is only 13 - she is considered a child and it starts a riot amongst the adults who have wanted a child - but because of a disease 100s of years before no child can be born. This is a major problem for Kathy.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/xDzTRbieRXRKkQbzrkALXcEc4wx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-24","episode_number":12,"episode_type":"standard","id":957034,"name":"Girl for Sale","overview":"The Adults decide to take turns at being Kathys Care giver - they also decide to inject her with the vaccine that will keep her a child forever.The same vaccine that keeps them alive, but makes them sterile.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/xaWrn65RJtX9m7jm1whUGh0iv7F.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-29","episode_number":13,"episode_type":"standard","id":957036,"name":"To Live Forever","overview":"Kathy is very very upset about the idea of being injected and tries to run away.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/qNnyL6dNgs40O6dU73uf44jzS4V.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-30","episode_number":14,"episode_type":"standard","id":957035,"name":"Barbarians at the Gate","overview":"Without the Oracle the barbarians get through the barrier and take over the Land Of the Dragonlord.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/dDcTyQQqVe2GtIugfWtCNu3OrmG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-01","episode_number":15,"episode_type":"standard","id":69337,"name":"'The Best-laid Plans...'","overview":"Scolar Meck and Kathy have to escape -- after coming up with a daring plan they manage to do it, only to end up in yet another parallel world.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/6eVPXZvRKIXUsnT2IkdwkhYCFEq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-06","episode_number":16,"episode_type":"standard","id":957121,"name":"Graveyard of Machines","overview":"After trying to find out how to fix the boat -- they find themselves trapped in a world which appears just to have alot of blown up machine parts and such - thinking it might help scholar Meck attempts to fix one of the huge machines -- he is succesful but the Machine comes to life and starts trying to shoot every living thing in its path.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/1UCP7Spf1knaY6fXcWjbdfpUafE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52716dae760ee340da009354","order":501,"adult":false,"gender":2,"id":235493,"known_for_department":"Acting","name":"Andrzej Grabowski","original_name":"Andrzej Grabowski","popularity":1.576,"profile_path":"/fP05tSunoTpzO5ntjnZscvI4TQy.jpg"}]},{"air_date":"1997-10-07","episode_number":17,"episode_type":"standard","id":957122,"name":"The Hunter and the Haunting","overview":"The Machines are every where -- after befriending some nearby villagers and find them to be about the level of people who existed in the 1800s -- not very knowledgable with modern equipment -- their world was destroyed by a whole army of machines and they are trying to rebuild after 100 years of hiding underground. The awakened machines causes panick.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/yTk8V9xtyCrZN5k6rGc4eveImkq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52716dae760ee340da009354","order":501,"adult":false,"gender":2,"id":235493,"known_for_department":"Acting","name":"Andrzej Grabowski","original_name":"Andrzej Grabowski","popularity":1.576,"profile_path":"/fP05tSunoTpzO5ntjnZscvI4TQy.jpg"}]},{"air_date":"1997-10-08","episode_number":18,"episode_type":"standard","id":958519,"name":"'Stop the Moloch!'","overview":"The villagers run back into hiding underground - Kathy and meck decide it was their fault and try to stop the machines -- they try to destroy them.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/mTFH0JbGPEw9P89HpxZd16X5ypB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52716dae760ee340da009354","order":501,"adult":false,"gender":2,"id":235493,"known_for_department":"Acting","name":"Andrzej Grabowski","original_name":"Andrzej Grabowski","popularity":1.576,"profile_path":"/fP05tSunoTpzO5ntjnZscvI4TQy.jpg"}]},{"air_date":"1997-10-13","episode_number":19,"episode_type":"standard","id":957039,"name":"Escape from the Palace","overview":"Josh and his father maange to reescape the clutches of the Barbarian king who is trying to force Suns sister the princess to marry him.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/jzQbKsgLsfWWZUaVtJHcFyjNctT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-14","episode_number":20,"episode_type":"standard","id":69363,"name":"Kathy Meets...Herself","overview":"Kathy and Meck succesfully stop the monsters - they return to Mecks world only to find Josh  and Ashka waiting for them  , Ashka holds him hostage and all of them take off in the boat-- once there she escapees -- With the Jade mask!Josh tells them about whats going on, now they must try to retrieve the jade face mask which is still the only way to get the Oracle to work and to save Suns world. -- this time they reach Kathys own world -- Or have they? -- the people are the same but evrything in their lives are different -- Kathy finds her parents divorced -- another Josh and worse -- Her very own Twin -- nothing like her but definealty 100% look alikes!","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/jhqlIb1KHDk47cN1wzaRylgXjpt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-15","episode_number":21,"episode_type":"standard","id":958520,"name":"The Doublecross","overview":"They need to get the Jade mask back - it has fallen into a jewelers hands -- thanks to Ashka -- disguising herself once again as Harley -- she had to escape the Hun atatck -- she stole the Jade mask and ran . Here she intends to get money for the Jade mask.The Kids decide to turn to their doubles for help.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/q0tOWZ7OSo3d0Z6Rb3S1qggI2Qi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-20","episode_number":22,"episode_type":"standard","id":957040,"name":"On the Trail","overview":"They need Ashkas help - since the Jewlers she tried to sell the mask to stole it -- she is helpless -- they decide to work together to retrieve the mask. They almost fail but their alternate dad helps and all ends well.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/kIojyjtaQJGCzzg3hyCdDgEbrnW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-21","episode_number":23,"episode_type":"standard","id":957042,"name":"The Two Joshes","overview":"The Two Joshes get entangled into the mess and the father helps them escape and they get the mask back fromt he crooked dealers- then Ashka double crosses them again - only this time fails.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/phr0bPH5FhrO7wGl3VSs6ynzmRA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-22","episode_number":24,"episode_type":"standard","id":957041,"name":"Who's Who?","overview":"With the mess sorted out - the alternate characters help their counterparts return to their own world -- they rescue sun and return back to The Land of the Dragonlord -- ready to fight.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/2UzHD3O9O5uVAVlbDqQtlbv4Ol7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-23","episode_number":25,"episode_type":"standard","id":957043,"name":"The Disappearing Act","overview":"They manage to get the mask into place and to tie up Ashka -- she will be dealt with -- Then Sun starts the Oracle and the huns are defeated.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/74IpZ8qNo40cp0LMAngDM61hsIb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-10-24","episode_number":26,"episode_type":"finale","id":957123,"name":"A Wedding Surprise","overview":"After evrything settles --Sun has scholar Merck take all the huns to land of machines -- there is more than enough room for their people there and they can help repopulate the earth there. Ashka is blindfolded and told to select a destanation by moving the musical to jewels to whatever setting she chose ( without the aid of site) here they maroon her in the middle of a forrest with nothing but ehr power suite to protect her.    Josh and Kathy and their family are returned to their own world. Sun and his sister decide to share the Throne. Everything turns out well.","production_code":"","runtime":null,"season_number":2,"show_id":1455,"still_path":"/64G1wH3MYjFNXq9OJ8540d53TCY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52716dae760ee340da009354","order":501,"adult":false,"gender":2,"id":235493,"known_for_department":"Acting","name":"Andrzej Grabowski","original_name":"Andrzej Grabowski","popularity":1.576,"profile_path":"/fP05tSunoTpzO5ntjnZscvI4TQy.jpg"}]}],"name":"Season 2","overview":"","id":3908,"poster_path":"/lHOHxeOLGKeHKW02bYk8VOCwDCD.jpg","season_number":2,"vote_average":0}}}