{"adult":false,"backdrop_path":"/epshabzrMcMYOFknC2zUFfu2C2s.jpg","created_by":[{"id":1336262,"credit_id":"53b2c15dc3a3682edf0076dc","name":"Bernadette McDaid","profile_path":null}],"episode_run_time":[60],"first_air_date":"2003-07-14","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.pbs.org/opb/historydetectives/","id":14679,"in_production":false,"languages":["en"],"last_air_date":"2014-07-22","last_episode_to_air":{"id":992781,"name":"Who Killed Jimmy Hoffa?","overview":"An investigation into the disappearance of Jimmy Hoffa, the former Teamsters president, who was last seen outside the Machus Red Fox Restaurant in Bloomfield Township, Mich., on July 30, 1975.","vote_average":0,"vote_count":0,"air_date":"2014-07-22","episode_number":4,"episode_type":"finale","production_code":"","runtime":60,"season_number":11,"show_id":14679,"still_path":null},"name":"History Detectives","next_episode_to_air":null,"networks":[{"id":14,"logo_path":"/hp2Fs7AIdsMlEjiDUC1V8Ows2jM.png","name":"PBS","origin_country":"US"}],"number_of_episodes":116,"number_of_seasons":11,"origin_country":["US"],"original_language":"en","original_name":"History Detectives","overview":"A group of researchers help people to find answers to various historical questions they have, usually centering around a family heirloom, an old house or other historic object or structure. It devotes itself \"to exploring the complexities of historical mysteries, searching out the facts, myths and conundrums that connect local folklore, family legends and interesting objects.\"","popularity":2.859,"poster_path":"/guxiUh059E3rmjnwKfqxNhSVkfl.jpg","production_companies":[{"id":86233,"logo_path":"/w3TUWUJOVoxR4j9dcgI4C1YY9W0.png","name":"Lion Television USA","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2003-07-14","episode_count":10,"id":61412,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2004-06-21","episode_count":12,"id":61413,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2005-06-27","episode_count":11,"id":61414,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2006-06-19","episode_count":11,"id":61415,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2007-06-25","episode_count":12,"id":61416,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0},{"air_date":"2008-06-30","episode_count":11,"id":61417,"name":"Season 6","overview":"","poster_path":null,"season_number":6,"vote_average":0},{"air_date":"2009-06-22","episode_count":13,"id":61418,"name":"Season 7","overview":"","poster_path":null,"season_number":7,"vote_average":0},{"air_date":"2010-06-21","episode_count":11,"id":61419,"name":"Season 8","overview":"","poster_path":null,"season_number":8,"vote_average":0},{"air_date":"2011-06-21","episode_count":12,"id":61420,"name":"Season 9","overview":"","poster_path":null,"season_number":9,"vote_average":0},{"air_date":"2012-07-17","episode_count":9,"id":61421,"name":"Season 10","overview":"","poster_path":null,"season_number":10,"vote_average":0},{"air_date":"2014-07-01","episode_count":4,"id":61422,"name":"Season 11","overview":"The 11th season of \"History Detectives\" premiered on July 1st, 2014.  In past seasons, several mysteries were explored in each episode.  This season however, \"History Detectives\" has been reformatted to focus on one iconic mystery per episode and the show is now called \"History Detectives Special Investigations\".","poster_path":"/6n6p23sUsrtBe5HlmZOC6Et3Ldx.jpg","season_number":11,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":7,"vote_count":3,"season_data":{"1":{"_id":"53b29e480e0a26598900a074","air_date":"2003-07-14","episodes":[{"air_date":"2003-07-14","episode_number":1,"episode_type":"standard","id":992656,"name":"New Jersey","overview":"Face Artifact   The Place: Mantoloking, New Jersey   Found on the beach, a pebble in the sand with sculpted human features. To unlock this riddle, the team must travel through time, across borders and between cultures.\n\nFire Station   The Place: Morristown, New Jersey   The evidence suggests that President Ulysses S. Grant celebrated America's centennial at this old firehouse. The History Detectives try to prove it.\n\n\"Pop\" Lloyd's Baseball Field   The Place: Atlantic City, New Jersey   Black ball players, white politicians, prejudice and patrimony. All of these threads appear when the History Detectives begin to unravel the origins of a historic memorial to black ballplayer John Henry Lloyd.","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-15","episode_number":2,"episode_type":"standard","id":992657,"name":"The Mid West","overview":"Bonnie & Clyde   The Place: Brodhead, Wisconsin   Did these five .45 caliber bullets end one of the most infamous crime sprees in American history? The History Detectives try to link these bullets to Bonnie and Clyde using ballistics tests and some old-fashioned research.\n\nAl Ringling Theater   The Place: Baraboo, Wisconsin   Was this one of the country's first great movie palaces? The History Detectives set out to discover why such an ornate theater was erected and survived in such an obscure location.\n\nSears Home   The Place: Akron, Ohio   The History Detectives investigate whether or not Sears & Roebuck could have built this home during the industrial boom. Does this couple live in a relic from years gone by?","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-16","episode_number":3,"episode_type":"standard","id":992658,"name":"New England","overview":"Morgan Whaling Ship   The Place: Mystic, Connecticut   Did this Charles W. Morgan whaling ship smuggle slaves out of the south as part of the Underground Railroad? The History Detectives are called in to find out.\n\nWitch's House?   The Place: Essex County, Massachusetts   Did Martha Carrier, who was hanged as a witch, once own Benjamin Abbot's house? The History Detectives must rely on historical research, Martha's descendents and even experts from around the world to solve the case.\n\n1909 Jigsaw Puzzle   The Place: Worcester, Massachusetts   A quirky jigsaw puzzle of women playing football in the 1800s puzzles the History Detectives. A jigsaw expert, sport historian, magazine collector and antiquities society help solve the riddle.","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-17","episode_number":4,"episode_type":"standard","id":992659,"name":"The Capitol","overview":"Portrait of George Washington   The Place: Frederick, Maryland   Is this an authentic portrait of the nation's first president, George Washington? The History Detectives call in a fake buster and art historian to discover if this is a national treasure.\n\nPatty Cannon   The Place: Federalsburg, Maryland   Was Jack and Rose's home once the headquarters of kidnapper and slave trader Patty Cannon?\n\nTrumpet   The Place: Bucks County, Pennsylvania   Was this trumpet, bought by a Philadelphia man at auction, actually played during the battles that won America's independence from England?","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-21","episode_number":5,"episode_type":"standard","id":992660,"name":"The South East","overview":"Lee's Last Orders   The Place: Beech Island, South Carolina   Is the Beech Island Agricultural Club's copy of Confederate General Robert E. Lee's farewell address the original?\n\nNatchez House   The Place: Natchez, Mississippi   How could Robert Smith, a former slave, afford to build this magnificent home for himself in 1851?\n\nNapoleonic Sword   The Place: St. Martinville, Louisiana   A family legend has it that when a doctor treated Napoleon at the Battle of Wagram in Austria, the great General was so grateful he rewarded him with a fine sword, which has been kept in the family ever since.","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-28","episode_number":6,"episode_type":"standard","id":992661,"name":"California","overview":"John Brown's Letters   The Place: Sacramento, California   Does a Californian woman own a treasure trove of John Brown's documents? Tukufu sets out to authenticate the letters and delve into her family tree to prove if she is related to the famous abolitionist.\n\nJapanese Tea House   The Place: Gilroy, California   How did an authentic Japanese house become part of the famed San Francisco World Fair just before World War II? The history detectives attempt to reveal the origins of the house and how it got there.\n\nPoems   The Place: San Francisco, California   Kathleen Wong, a second-generation Chinese-American calls in the history detectives to trace her ancestors' perilous journey to America. She wants to know whether any of the hundreds of poems left on the walls at the West Coast Angel Island detention center relate to her family.","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-04","episode_number":7,"episode_type":"standard","id":992662,"name":"Texas","overview":"The Depot That Made Dallas   The Place: Dallas, Texas   A local historian calls in the History Detectives to find out if a disused depot was the first railroad station in Texas and if it was responsible for putting Dallas on the map.\n\nMexico Peso   The Place: San Antonio, Texas   Searching through his great-grandfather's belongings, a San Antonio man finds Mexican currency and suspects a link to infamous bandits Emiliano  Zapata and Pancho Villa. Did this money play a part in the Mexican revolution in the 1910s and how did it end up in the hands of a quiet family man?\n\nPirate Spyglass   The Place: Texas City, Texas   Jean Lafitte was a fearsome pirate, an ingenious privateer, and a war hero. A Texas library is donated a spyglass said to be handed down from Lafitte to his ship captain. Was it?","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-25","episode_number":8,"episode_type":"standard","id":992663,"name":"New York","overview":"Ventriloquist Dummy   The Place: Brooklyn, New York   Where did \"\"Sam\"\" the first black ventriloquist dummy, come from? Did he change the way Americans viewed race in the early 20th century?\n\nHome of Lincoln Assassination Plot?   The Place: Greenwich Village, New York   Did John Wilkes Booth, the infamous assassin of Abraham Lincoln, spend time in this woman's house planning the assassination?\n\n34 Star Flag   The Place: Staten Island, New York   Did a 34-star Civil War-era flag in the possession of a New York historical society once save a boarding house from being burned down? Legend says it replaced a confederate flag hung at the height of Civil War hysteria.","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-09-01","episode_number":9,"episode_type":"standard","id":992664,"name":"Oregon","overview":"Sheridan's House?   The Place: Grand Ronde, Oregon   Although the locals have little interest in this abandoned Dutch Colonial Style home, new research suggests the house may originally have been built as officer quarters for the Union Army by a young Philip Sheridan, before he became a famous general.\n\nMark Twain Watch?   The Place: Oregon   The grandson of prominent Oregonian Captain Ainsworth wants to know if his watch was a gift from noted American author Samuel Clemens.\n\nPrisoner Poem   The Place: Salem, Oregon   Where did this Revolutionary War poem, recently discovered in an antique trunk, come from? Did the author, an American prisoner of war in England, write it there? If so, where was it for over two centuries, and how did it end up in Oregon?","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-09-08","episode_number":10,"episode_type":"finale","id":992665,"name":"Philadelphia","overview":"The Love Dish   The Place: Philadelphia, Pennsylvania   Was a set of 18th century china emblazoned with hearts and arrows given by the Marquis de Lafayette to Elizabeth Willing, the popular wife of the Patriot Mayor?\n\nRebel Gun   The Place: Mercer, Pennsylvania   Local lore says this late 18th Century flint-lock rifle was recovered from the hideout of infamous Tory bandit Moses Doan after a raid in 1783.\n\nPrison Plaque   The Place: Philadelphia, Pennsylvania   A recently-found plaque suggests that inmates from Philadelphia's Eastern State Penitentiary were recruited to fight in World War One. Was this an extraordinarily progressive prison or just wartime desperation?","production_code":"","runtime":60,"season_number":1,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":61412,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"53b29e4a0e0a265986009d36","air_date":"2004-06-21","episodes":[{"air_date":"2004-06-21","episode_number":1,"episode_type":"standard","id":992670,"name":"Civil War Submarine / Red Cloud's Peace Pipe / Thomas Edison's House","overview":"Civil War-Era Submarine   The Place: New Orleans, Louisiana   In Louisiana's bustling French Quarter sits a surprising remnant of American warfare - a Civil War-era submarine. Salvaged from the depths of a New Orleans lake, the origin of this vessel remains a murky mystery. Now a New Orleans man wants to know if his great-grandfather helped build the iron-clad wonder.\n\nRed Cloud's Peace Pipe?   The Place: Livermore, California   Was this peace pipe given to a Californian woman's ancestor by the famous warrior Chief Red Cloud? The ancestor was the Indian agent who moved the Oglala Lakota to a Reservation in South Dakota. Would Chief Red Cloud have given such a gift to a U.S. government official? The History Detectives go back to the turbulent days of the 1870s and a battle of wills and political scandal that reached the highest levels of government.\n\nThomas Edison's House?   The Place: Union, New Jersey   This strange house is said to have been designed and built by Thomas Edison. Did the","production_code":"201","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-06-28","episode_number":2,"episode_type":"standard","id":992671,"name":"Early Monopoly / Internment Artwork / Lewis and Clark Cane","overview":"Early Monopoly?   The Place: Arden, Delaware   A man in Delaware has an old board game that bears a remarkable similarity to Monopoly, but was made 20 years before Parker Brothers patented their creation. Could he own the earliest version of the world's best-selling board game? History Detectives investigates Monopoly's history and discovers a surprising story. Rather than originating in the Great Depression of the 1930s, Monopoly could be a much older game, reflecting an economic argument that - if followed - would have created a radically different economy than today's.\n\nJapanese Internment Camp Artwork   The Place: San Francisco, California   A San Francisco archive has discovered a set of watercolor paintings of what appears to be a prison camp. Piecing them together shows they were painted on the back of a Japanese-American internment notice from 1942. What is the story behind these paintings? Who was the artist? And what was his or her fate? History Detectives uncovers the dramati","production_code":"202","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-05","episode_number":3,"episode_type":"standard","id":992672,"name":"Anti-Slavery Flag / Mail Order Brides / WWII Landing Craft","overview":"World War II Landing Craft   The Place: Bayfield, Wisconsin   A craft used for dredging and hauling rocks in Bayfield's harbor could hold a dramatic secret. A local man whose father fought in the Second World War claims that, 60 years ago, the vessel played a vital role in the D-Day landings, when it transported American tanks on to the beaches of Normandy. Could this ship really be one of the 1500 LCT103 \"\"Landing Craft Tanks\"\" designed and built to support the amphibious landings of World War II, and did it really see action off the beaches of France?\n\nThe Abolitionist Flag   The Place: Michigan   What two Michigan brothers believed was an old sheet in a family trunk may have contributed to the end of slavery in America. Was the sheet a flag an ancestor may have used to campaign for the creation of Free States? Or was it used as propaganda in a pivotal pre-Civil War campaign? History Detectives explores the politically charged abolition movement to reveal the surprising past of this fam","production_code":"203","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-12","episode_number":4,"episode_type":"standard","id":992673,"name":"First Movie Studio / Hollywood: Warner's Lighter / King Kong Camera","overview":"The First Movie Studio?   The Place: Los Angeles, California   Lincoln Heights is a quiet neighborhood in northeast Los Angeles located far from the glitz and glamour normally associated with Hollywood. But a resident there thinks the city's first motion picture studio may be located right in her very own neighborhood park. Could a broken gateway once have been the grand entrance to the beginning of Hollywood history?\n\nWarner Ufa Lighter   The Place: Los Angeles, California   A California man spends $50 at a flea market on an antique lighter that could be a piece of Hollywood history. It is engraved with \"\"Harry Warner\"\" on one side and \"\"Ufatone\"\" on the other. Harry Warner was one of the founders of Warner Brothers, whereas Ufa was Germany's largest studio and Hollywood's biggest competition. What is the connection between Harry Warner, known for his anti-fascist commitment, and a studio that became the propaganda tool of the Nazi party?\n\nKing Kong Camera?   The Place: Washington State and","production_code":"204","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-19","episode_number":5,"episode_type":"standard","id":992674,"name":"Dueling Pistols / Little Big Horn Bayonet / Nesbit Portrait","overview":"Dueling Pistols   The Place: San Francisco, California   A San Francisco bank owns two antique pistols, allegedly used in the last great duel on U.S. soil. Fought in 1856, the duel was between abolitionist Senator David Broderick and California Supreme Court Justice David Terry. 150 years later, a bank employee wants to know if these guns are authentic - and more about the duel. What really happened? Was it about slavery or honor? Did it influence the outcome of the Civil War?\n\nEvelyn Nesbit Portrait   The Place: New Jersey   A woman owns a portrait she believes is a lost masterpiece by one of America's greatest illustrators and artists, Howard Chandler Christy. The painting's subject is claimed to be Evelyn Nesbit, the actress and model who rose to fame in 1906 when her husband killed a famous architect accused of \"\"taking advantage\"\" of her. The resulting scandal rocked New York in the early 1900's and became the \"\"trial of the century\"\". But is the painting authentic?\n\nLittle Big Horn Bay","production_code":"205","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-02","episode_number":6,"episode_type":"standard","id":992675,"name":"Home of Lincoln Assassination Plot / Preston Brooks' Riding Crop / Revolutionary War Cannon","overview":"Preston Brooks' Riding Crop   The Place: Long Island, New York   A man claims that a beautiful riding crop was given to a family ancestor by the President of the Confederacy, Jefferson Davis. He believes that it was no ordinary present, but was given to Preston Brooks to congratulate him for beating into senselessness an anti-slavery campaigner, Charles Sumner. Many regard this public attack in the Senate as a significant moment in America's move toward division and Civil War. History Detectives visits New York City, Columbus, Georgia and Sea Cliff, New York, to unravel a startling story of politics, filibusters and mistaken identity.\n\nHome of Lincoln Assassination Plot   The Place: Greenwich Village, New York   A woman has a question about the home she's been living in for the last few years. She's heard a rumor that John Wilkes Booth, the infamous assassin of Abraham Lincoln, spent some time in her house. Not only that, she's heard that her home is where the plot for the assassination","production_code":"206","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-16","episode_number":7,"episode_type":"standard","id":992676,"name":"Chinese Poem / Ventriloquist's Dummy / Witch's House","overview":"Ventriloquist Dummy   The Place: Brooklyn, New York   An African American woman in Brooklyn, New York, has her father's black ventriloquist dummy, \"\"Sam.\"\" Her father, John Cooper, was the first famous African American ventriloquist. In a time of minstrel stereotypes, did \"\"Sam\"\" help transform how Americans viewed race in the early 20th century? How was this dummy created and was it meant to be a protest against racial prejudice?\n\nWitch's House?   The Place: Essex County, Massachusetts   Did this house once belong to an accused witch? History Detectives heads to New England to research the likelihood with local historians and a descendant of the accused witch, Martha Carrier, who was executed by hanging in 1692 during the infamous Salem Witch Trials.\n\nMigrant Poems   The Place: San Francisco, California   In the first half of the 20th century, nearly 250,000 Chinese immigrants attempted to enter the United States. Because of discrimination against Chinese and laws meant to impede their pass","production_code":"207","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-23","episode_number":8,"episode_type":"standard","id":992677,"name":"Bonnie & Clyde Bullets / George Washington Portrait / Revolutionary War Poem","overview":"Bonnie & Clyde   The Place: Brodhead, Wisconsin   Could 5 spent bullets in the possession of a Wisconsin woman have been responsible for the demise of the notorious Bonnie Parker and Clyde Barrow? History Detectives travels to cities all over the country in an attempt to link the bullets to the crime spree of the murderous twosome.\n\nRevolutionary War Poem   The Place: Salem, Oregon   History Detectives goes to Salem, Oregon to look into the story of a Revolutionary War poem found 25 years ago, hidden in an antique trunk. The document appears to have been written by an American named Dan Goodhue while imprisoned in 1780 as a POW in England. Who was this man and how did his poem travel for over two centuries, across the sea and nation, to end up in Oregon?\n\nPortrait of George Washington   The Place: Frederick, Maryland   Could a drawing passed down through a Maryland family actually be an authentic portrait of the nation's first president, George Washington? The investigators attempt to pr","production_code":"208","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-06","episode_number":9,"episode_type":"standard","id":992678,"name":"Lost Gold Ship / John Hunt Morgan Saddle / Cesar Chavez Banner","overview":"Lost Gold Ship   The Place: Alaska   Environmentalist Gabriel Scott was working in the Copper River Delta near Cordova, Alaska, when he came across the wreckage of an old ship. According to locals, these are the remains of the SS Portland, the famous steamship that carried 68 miners and nearly two tons of gold from the Klondike River to Seattle harbor and began the great Klondike Gold Rush of 1897. The History Detectives team mixes maritime history and forensic science to reveal the dramatic story of the SS Portland and confirm that the remains are of this legendary ship.\n\nJohn Hunt Morgan Saddle   The Place: Paris, Kentucky   A Kentucky man owns a beautifully preserved, Western-style saddle, believed to have been used by Confederate General John Hunt Morgan on his audacious raid into Kentucky, Indiana and Ohio in July 1863. History Detective Wes Cowan has a surprising personal connection to the case - his great-grandfather was actually one of \"\"Morgan's Raiders\"\" and was captured alongsi","production_code":"209","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-13","episode_number":10,"episode_type":"standard","id":992679,"name":"Continental Army Muster Roll / Pop Lloyd Baseball Stadium / Pretty Boy Floyd's Gun","overview":"\"\"Pretty Boy\"\" Floyd's Handgun   The Place: La Verne, California   A man owns a vintage Colt automatic handgun, which family legend suggests once belonged to the Depression-era desperado, Charles \"\"Pretty Boy\"\" Floyd. According to the legend, Floyd gave the gun to the man's uncle, who had served as the criminal's lookout. History Detective Wes Cowan travels to California, Oklahoma and Missouri to discover why gangsters became heroes to the rural population of the Midwest and to reveal the true story behind the dramatic rise and fall of a man who ranks alongside Bonnie and Clyde and John Dillinger as one of the most colorful bank robbers in American history.\n\nContinental Army Muster Roll   The Place: Las Vegas, Nevada   A man owns an old Continental Army muster roll issued by the town of Falmouth, Massachusetts in July 1780. Among the 16 men listed is \"\"Paul Cuffee, and the contributor wants to know if this could be evidence of a previously unknown episode in the life of Cuffee, a remarkable","production_code":"210","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-20","episode_number":11,"episode_type":"standard","id":992680,"name":"Charlie Parker's Saxophone / Koranic School Book / Prison Plaque","overview":"Charlie Parker's Saxophone?   The Place: Oakland, California   A woman owns a beautiful old alto saxophone that belonged to her father and according to family legend was once owned by the legendary jazz musician Charlie \"\"Bird\"\" Parker. Her late father, a white musician, told her that when they lived in Portland, Oregon, Charlie Parker came to a practice session without his horn. The story goes that when her father chided Parker for selling his instrument, Bird said, \"\"If you want the horn so much, here's the pawn ticket.\"\" Is the story true? Did these two musicians ever meet? Would troubled musical genius Charlie Parker abandon his horn?\n\nPrison Plaque   The Place: Philadelphia, Pennsylvania   In the heart of Philadelphia stands the abandoned Eastern State Penitentiary building. Founded by Quakers in 1829, this castle-like structure set new standards for prisons across the country with its progressive ideas for rehabilitation. Recently, a group in charge of preserving this historic structu","production_code":"211","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-27","episode_number":12,"episode_type":"finale","id":992681,"name":"Body in the Basement / Newport U-Boat / Shippen Golf Club","overview":"Body in the Basement\n\nNewport U-Boat\n\nShippen Golf Club","production_code":"212","runtime":60,"season_number":2,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":61413,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"53b29e4b0e0a26598c00a2e1","air_date":"2005-06-27","episodes":[{"air_date":"2005-06-27","episode_number":1,"episode_type":"standard","id":992682,"name":"The Spirit of St. Louis","overview":"The Spirit of St. Louis   Two brothers from New Jersey suspect that their uncle may have built the engine in Charles Lindberghâ€™s Spirit of St. Louis plane.\n\nSuicide Pin   A Kansas City man bought a used toolbox that contains two pins similar to the â€œpoison pinsâ€ U2 pilot Francis Gary Powers had with him when he was shot down in 1960 over the Soviet Union.\n\nImage of Apache Warrior Geronimo   A woman in New Mexico has a photo that she thinks is the Apache warrior Geronimo.","production_code":"","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-07-11","episode_number":2,"episode_type":"standard","id":992683,"name":"Black Star Line Certificates","overview":"Black Star Line Certificates\n\nMickey Mouse's Origin\n\nPro-Nazi Newspaper in Texas","production_code":"302","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-07-18","episode_number":3,"episode_type":"standard","id":992688,"name":"Arthur Szyk's Earliest Cartoons","overview":"Arthur Szyk's Earliest Cartoons\n\nProfessor Lowe's Hot Air Balloon\n\nChemical Warfare Map","production_code":"303","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-07-25","episode_number":4,"episode_type":"standard","id":992684,"name":"Cherokee Bible","overview":"Cherokee Bible\n\nSlave Banjo\n\nUnited Empire Loyalists","production_code":"304","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-08-01","episode_number":5,"episode_type":"standard","id":992685,"name":"Portrait of George Washington","overview":"Portrait of George Washington\n\nRevolutionary War Poem\n\nRevolutionary War Cannon","production_code":"305","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-08-15","episode_number":6,"episode_type":"standard","id":992686,"name":"Secrets of the Tape","overview":"Secrets of the Tape\n\nMountain Mail Bag\n\nBanned Birth Control Box","production_code":"306","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-08-22","episode_number":7,"episode_type":"standard","id":992687,"name":"Doc Holliday's Watch","overview":"Doc Holliday's Watch\n\nCivil War Female Soldiers\n\nJapanese Internment Camp Artwork","production_code":"307","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-08-29","episode_number":8,"episode_type":"standard","id":992689,"name":"Hermann Goering's Shotgun","overview":"Hermann Goering's Shotgun\n\nCalf Creek Arrow\n\nThe Edison House","production_code":"308","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-05","episode_number":9,"episode_type":"standard","id":992691,"name":"Coney Island Lion","overview":"Coney Island Lion\n\nLegacy of a Doll\n\nBallet Shoes","production_code":"309","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-12","episode_number":10,"episode_type":"standard","id":992692,"name":"Leisureama Homes","overview":"Leisureama Homes\n\nJim Thorpe Tickets\n\n1667 Land Grant","production_code":"310","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-19","episode_number":11,"episode_type":"finale","id":992693,"name":"Home for Unwed Mothers","overview":"Home for Unwed Mothers\n\nLong Expedition Encampment\n\nEvelyn Nesbit Portrait","production_code":"311","runtime":60,"season_number":3,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":61414,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"53b29e4d0e0a26598900a079","air_date":"2006-06-19","episodes":[{"air_date":"2006-06-19","episode_number":1,"episode_type":"standard","id":992694,"name":"The Chisholm Trail; Harry Houdini Poster; McKinley Casket Flag","overview":"Puzzles involving the Chisholm Trail, Houdini posters and a flag that may have draped the coffin of President William McKinley, assassinated in 1901. Included: determining how far south the Chisholm Trail extended; checking the authenticity of Harry Houdini posters for a Chicago magic show; learning if a flag handed down to the great-grandson of McKinley's bodyguard actually adorned the 25th president's casket.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-06-26","episode_number":2,"episode_type":"standard","id":992695,"name":"Wartime Baseball; Confederate Eyeglass; Howard Hughes' Invention","overview":"Questions surrounding a baseball autographed by Dizzy Dean, a brass eyeglass containing an image of Jefferson Davis, and a question on credit for an oil-drilling device. Included: investigation of a 1944 baseball game in which the players supposedly included Dean, Satchel Paige and an Air Force staff sergeant; whether an eyeglass belonged to a Confederate supporter; whether a twin-cone roller-rock bit was invented by Howard Hughes or a San Jose resident's grandfather.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-07-03","episode_number":3,"episode_type":"standard","id":992696,"name":"Coca-Cola Trade Card; Vicksburg Map; Lawrence Strike","overview":"Puzzles involve an 1886 Coca-Cola trade card, a map connected to a Civil War battle and a billy club from a 1912 textile-factory strike in Lawrence, Mass. Included: a trip to Coca-Cola headquarters in Atlanta to try to verify the trade card info; digging up details pertaining to the 1863 siege of Vicksburg, Miss.; a journey to Lawrence to investigate the Bread and Roses strike.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-07-10","episode_number":4,"episode_type":"standard","id":992697,"name":"Alternative Service Certificates; Carolina Mystery Books; Mickey Mouse’s Origin","overview":"Puzzles pertaining to 1943 certificates labeled “alternate service to war”; a set of books that may have belonged to 19th-century politician John C. Calhoun; and a toy mouse named Micky that bears a patent date of 1926 (two years before Walt Disney created Mickey).","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-07-17","episode_number":5,"episode_type":"standard","id":992698,"name":"U.S.S. Indianapolis; Highlander Badge; Spirit of St. Louis","overview":"Puzzles concerning items believed to have come from a WWII kamikaze attack; a badge that may have belonged to a British soldier in the Revolutionary War; and two New Jersey brothers who suspect that their uncle built the Spirit of St. Louis's Wright Whirlwind J-5C engine.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-07-24","episode_number":6,"episode_type":"standard","id":992699,"name":"Orphan Film Reel; Chinese Opium Scale; Hermann Goering’s Shotgun","overview":"Puzzles involve a film reel of 1920s stuntman Eddie Polo; scales used by Chinese immigrants in the early 20th century; and a shotgun that belonged to Nazi henchman Hermann Goering.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-07-31","episode_number":7,"episode_type":"standard","id":992700,"name":"Survivor Camera; Alcoholics Anonymous Letter; Tallahassee Mystery Cross","overview":"Puzzles involve a camera that belonged to a Holocaust survivor; the link between a 1942 letter and the early days of Alcoholics Anonymous; and a cross found at a Tallahassee excavation of a 17th-century mission.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-08-14","episode_number":8,"episode_type":"standard","id":992701,"name":"Calf Creek Arrow; Doc Holliday’s Watch; Black Star Line Stock Certificates","overview":"Puzzles include a bison skull that may date to 3000 B.C.; a watch that may have belonged to gambler-gunman Doc Holliday; and stock certificates possibly signed by black nationalist Marcus Garvey.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-08-21","episode_number":9,"episode_type":"standard","id":992702,"name":"Grace Kelly Automobile; Illicit P.O.W. Photos; Mystery Motorcycle","overview":"Puzzles involve a car that may be the one driven by Grace Kelly in “To Catch a Thief”; possible Civil War POW photographs; and a 1914 motorcycle that might have been used in WWI France.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-08-28","episode_number":10,"episode_type":"standard","id":992703,"name":"Lou Gehrig Autograph; Cleveland Electric Car; Philadelphia Freedom Paper","overview":"A baseball ticket possibly signed by Lou Gehrig on the day of his farewell speech; an electric streetcar from Cleveland; and a document that may have granted freedom to a slave.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-09-04","episode_number":11,"episode_type":"finale","id":992704,"name":"Superman Sketch; Lost Musical Treasure; Rebel Whiskey Flask","overview":"A Superman sketch apparently signed by the comic strip's creators; a metal master used to press records in the 1920s and '30s; and a whiskey flask that may date to the time of George Washington.","production_code":"","runtime":60,"season_number":4,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":61415,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"53b29e4e0e0a26597d009ef7","air_date":"2007-06-25","episodes":[{"air_date":"2007-06-25","episode_number":1,"episode_type":"standard","id":992707,"name":"3D Cuban Missile Crisis; Amos 'n Andy Record; Women's Suffrage Painting","overview":"The fifth season begins with a portable projection screen that may have been used by President Kennedy to view spy photos during the Cuban Missile Crisis. Also: an aluminum record that might contain an original recording of the “Amos 'n' Andy” program; and a painting that may have been an original portrait used in the women's suffrage movement.","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-02","episode_number":2,"episode_type":"standard","id":992718,"name":"Continental Currency; Short-Snorter; Liberty Bell Pin","overview":"A possible Colonial-era $6 bill found by a Nebraska family; and a British 10-shilling note said to have been signed by FDR, Winston Churchill and George Patton. Also: A North Carolina woman has a pin she claims was made from metal taken from the Liberty Bell.","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-09","episode_number":3,"episode_type":"standard","id":992720,"name":"GAR Photograph; Jefferson Pledge; Dempsey Fight Bell","overview":"A fight bell that may have been used in a Jack Dempsey boxing match; a photo that may depict white Civil War soldiers standing with two black men, all of whom are thought to be members of the Grand Army of the Republic. Also: a document that may have Thomas Jefferson's signature on it, along with a pledge that would help finance a school.","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-16","episode_number":4,"episode_type":"standard","id":992708,"name":"Atocha Spanish Silver; Ernie Pyle's Typewriter; Lucy Parsons Book","overview":"Two bars of silver that may have been from a Spanish ship that went down off Florida; a book that might have belonged to social activist Lucy Parsons; a typewriter that may have belonged to WWII journalist Ernie Pyle.","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-23","episode_number":5,"episode_type":"standard","id":992719,"name":"Great Mexican War Posters; Muhlenberg Robe; Nora Holt Autograph Book","overview":"Movie posters for a film that might contain footage of fighting during the Mexican Revolution; and an autograph book that may have signatures from Warren G. Harding and Calvin Coolidge. Also: a robe that might have belonged to Gen. Peter Muhlenberg, who led troops during the American Revolution.","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-30","episode_number":6,"episode_type":"standard","id":992710,"name":"NC-4: First Across the Atlantic; Howard Hughes Crash; Civil War Balloon","overview":"A square of fabric that may have been part of an NC-4 aircraft, which was the first to fly across the Atlantic; and an altimeter that might have been part of the XF-11 aircraft flown by Howard Hughes in 1946. Also: a piece of material that may have been part of a Civil War-era hot-air balloon designed for the U.S. Army.","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-06","episode_number":7,"episode_type":"standard","id":992711,"name":"Grace Kelly Car; Harley-Davidson Motorcycle; Civil War POW Photos","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-13","episode_number":8,"episode_type":"standard","id":992712,"name":"Coca-Cola Trade Card; Lawrence Strike; Vicksburg Map","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-20","episode_number":9,"episode_type":"standard","id":992713,"name":"Red Cloud Letter; '32 Ford Roadster; Cast Iron Eagle","overview":"A 1932 Ford Roadster that may have been used in dry-lake races; a letter that may have been written by Mount Rushmore sculptor Gutzon Borglum to James Red Cloud of the Lakota tribe; a cast-iron eagle that might have been a decoration for a New York post office","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-27","episode_number":10,"episode_type":"standard","id":992714,"name":"Lincoln Letter; Quaker Map; U.S.S. Indianapolis","overview":"A letter that may have been signed by Abraham Lincoln; a map that might have markings for the Underground Railroad in Ohio; and artifacts that may have been aboard the USS Indianapolis when the ship was sunk by a Japanese sub during WWII.","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-09-03","episode_number":11,"episode_type":"standard","id":992715,"name":"Bill Pickett Saddle; Hitler Films; McKinley Casket Flag","overview":"A saddle that may have been owned by cowboy legend Bill Pickett; a flag that might have been draped over the casket of President William McKinley; and film cans that may contain archival footage of Nazi officials.","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-09-10","episode_number":12,"episode_type":"finale","id":992716,"name":"USS Thresher; Pete Gray Cartoon; Manhattan Project Letter","overview":"The fifth season ends with documents that may be related to the USS Thresher, a nuclear sub that sank in 1963; storyboards that may be for a comic strip about one-armed baseball player Pete Gray; and handwritten documents that may pertain to the Manhattan Project during World War II.","production_code":"","runtime":60,"season_number":5,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":61416,"poster_path":null,"season_number":5,"vote_average":0},"6":{"_id":"53b29e500e0a265986009d3c","air_date":"2008-06-30","episodes":[{"air_date":"2008-06-30","episode_number":1,"episode_type":"standard","id":992721,"name":"WWII Diary; Annie Oakley Coin; 1856 Mormon Tale","overview":"WWII Diary: Does this diary hold the key to understanding the fate of a missing bomber pilot from World War II?\n\nAnnie Oakley Coin: Was this coin a target for one of the Wild West's most popular female sharpshooters?\n\n1856 Mormon Tale: Is this tattered book a true account of female slavery in the old West?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-07-07","episode_number":2,"episode_type":"standard","id":992722,"name":"Red Hand Flag; Seth Eastman Painting; Isleton Tong","overview":"Red Hand Flag: Is this peculiar flag one that African-American soldiers marched under in the war to end all wars?\n\nSeth Eastman Painting: Is this painting an original depiction of Native American life from one of the premiere painters of the American West?\n\nIsleton Tong: Was this building a safe haven for persecuted immigrants, or a hub for organized crime?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-07-14","episode_number":3,"episode_type":"standard","id":992723,"name":"Japanese Balloon Bomb; Society Circus Program; Camp David Letter","overview":"Japanese Balloon Bomb: Is this scrap of fabric evidence of a secret wartime attack on the United States' mainland?\n\nSociety Circus Program: Why are some of New York's wealthiest planning a high society circus at the very depth of the Great Depression?\n\nCamp David Letter: Could a box found in a dumpster hold information about the founding of a top-secret Presidential retreat?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-07-21","episode_number":4,"episode_type":"standard","id":992724,"name":"China Marine Jacket; Airstream Caravan; Lincoln Forgery","overview":"China Marine Jacket: Can the symbols on this unusual item of clothing identify a marine who may have witnessed a Chinese paradise tumbling into disaster?\n\nAirstream Caravan: Was this mobile home part of a modern-day wagon train halfway across the world?\n\nLincoln Forgery: Could this piece of sheet music have come from Abraham Lincoln's private collection?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-07-28","episode_number":5,"episode_type":"standard","id":992725,"name":"Hindenburg Artifact; Bonus Army Stamp; Dempsey Fight Bell","overview":"Hindenburg Artifact Was this device snatched from the burning wreckage of the ill-fated zeppelin?\n\nBonus Army Stamp: Is this stamp connected to a moment when the U.S. Army advanced with fixed bayonets against fellow soldiers in the nation’s capital?\n\nDempsey Fight Bell: Is this the bell that sat ringside at the world's first boxing superstar's legendary match?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-04","episode_number":6,"episode_type":"standard","id":992726,"name":"GAR Photograph; Bill Pickett Saddle; Hitler Films","overview":"GAR Photograph: How did two African Americans come to be part of this photograph of about 20 older white men in Reconstructionist-era America?\n\nBill Pickett Saddle: Did this saddle ride into cowboy history with one of rodeo's most daring innovators?\n\nHitler Films: Could these rusting film canisters contain unknown footage of one of the 20th century's most heinous murderers?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-11","episode_number":7,"episode_type":"standard","id":992727,"name":"Black Tom Shell; USS Olympia Glass; Front Street Blockhouse","overview":"Black Tom Shell: Is this shell from a devastating act of foreign sabotage on American soil?\n\nUSS Olympia Glass: Could this farmhouse door have sailed into battle in one of the country's greatest naval victories?\n\nFront Street Blockhouse: Did this unassuming house once protect an American colony from attack almost 300 years ago?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-08-18","episode_number":8,"episode_type":"standard","id":992728,"name":"John Adams Book; Mankato Spoon; NC-4: First Across the Atlantic","overview":"John Adams Book: Do these tattered pages open the book on a President who built a nation even as his own son fell into ruin?\n\nMankato Spoon: What does this delicate silver spoon have to do with the largest mass execution in American history?\n\nNC-4: First Across the Atlantic: Is this piece of fabric a remnant from the first transatlantic flight, eight years before Lindbergh?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-08","episode_number":9,"episode_type":"standard","id":992729,"name":"Shipwreck Cannons; Connecticut Farmhouse; Kahlil Gibran Painting","overview":"Shipwreck Cannons: Are these the last remains of a navy schooner that fought in a border dispute with the mighty British Empire?\n\nConnecticut Farmhouse: How is this Connecticut farmhouse connected to the assassination of a Russian tsar?\n\nKahlil Gibran Painting: Is this painting an unknown work by an immigrant poet whose words inspired an American generation?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-15","episode_number":10,"episode_type":"standard","id":992730,"name":"Blueprint Special; Monroe Letter; Atocha Spanish Silver","overview":"Blueprint Special: Did this record play a dramatic role in the Allied victory during the Second World War?\n\nMonroe Letter: Does this letter link America's fifth President to the high seas piracy of U.S. merchant ships in the early 1800s?\n\nAtocha Spanish Silver: What is the meaning of these markings on a silver bar discovered in the wreck of the Spanish ship?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-23","episode_number":11,"episode_type":"finale","id":992731,"name":"Slave Songbook; Josh White Guitar; Birthplace of Hip Hop","overview":"Slave Songbook - Are these tattered pages the earliest record of music created by slaves?\n\nJosh White Guitar - What role did this guitar play in the transformation of the music industry in the 1960's?\n\nBirthplace of Hip Hop - Did this Bronx apartment building give birth to a culture that now spans the globe?","production_code":"","runtime":60,"season_number":6,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":61417,"poster_path":null,"season_number":6,"vote_average":0},"7":{"_id":"53b29e520e0a26598c00a2e6","air_date":"2009-06-22","episodes":[{"air_date":"2009-02-23","episode_number":0,"episode_type":"standard","id":992744,"name":"Slave Songbook; Josh White Guitar; Birthplace of Hip Hop","overview":"","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-22","episode_number":1,"episode_type":"standard","id":992732,"name":"Psychophone; War Dog Letter; Pancho Villa Watch Fob","overview":"Season 7 begins with a closer look at the \"Psycho-Phone,\" a device presumed to have been built by Thomas Edison and was designed to communicate with the dead. Then, a WWII letter between two soldiers which talks about a third man's qualifications to become a dog trainer. Lastly, a watch fob which commemorates Pancho Villa's infamous raid on Columbus, New Mexico in 1916.","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-29","episode_number":2,"episode_type":"standard","id":992733,"name":"Manhattan Project Patent; Galleon Shipwreck; Creole Poems","overview":"Manhattan Project Patent - Could this drawing have been part of America's secret plans to fuel the atomic bomb?  Galleon Shipwreck - Is this a piece of treasure from a Spanish galleon washed up on an Oregon beach? Creole Poems - Does this manuscript contain words of love or illegal acts of rebellion?","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-06","episode_number":3,"episode_type":"standard","id":992734,"name":"St. Valentine's Day Massacre; Booth Letter; Cemetery Alarm","overview":"Items include a shotgun believed to have been used by a member of Al Capone's gang during the St. Valentine's Day Massacre; a threatening letter to President Andrew Jackson believed to have been written by John Wilkes Boothe's father; and an alarm which is thought to have been an alarm against grave robbers in a cemetery.","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-13","episode_number":4,"episode_type":"standard","id":992735,"name":"Sideshow Babies; Lubin Photos; Navajo Rug","overview":"A woman wonders whether her mother was used as an infant as part of the incubator expedition at the 1933 World's Fair in Chicago. Also, a look at the Siegmund Lubin Studios, which made silent films in Philadelphia. And lastly, a closer look at a Navajo rug which may have a taboo symbol on it of a man in a feathered headdress holding lightening bolts.","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-20","episode_number":5,"episode_type":"standard","id":992736,"name":"Tokyo Rose; Crazy Horse; World War II Diary","overview":"Items explored include a recording believed to be from the trial of Iva Toguri, better known Tokyo Rose, the Japanese American woman who made propaganda broadcasts for the Japanese during WWII; a possible photograph of the legendary Crazy Horse, the Lakota warrior. Also, a diary written by a pilot during WWII who perished in action is returned to his family.","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-27","episode_number":6,"episode_type":"standard","id":992737,"name":"Amelia Earhart Plane; Fillmore Pardon; Boxcar Home","overview":"A Honolulu flight mechanic's grandson believes he possesses a piece of Amelia Earhart's airplane but needs help identifying it. Next, the 1851 presidential commutation of a death sentence to life in prison in the case of See See Sah Mah, a Native American who was charged with murdering a a St. Louis trader. Lastly, a home in Colorado which is believed to have been built solely from railroad boxcars.","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-10","episode_number":7,"episode_type":"standard","id":992738,"name":"Hindenburg Artifact; John Adams Book; Birthplace of Hip-Hop","overview":"A man from New Jersey claims to have the instrument panel from the Hindenburg in his possession, in which his family lore claims it came from the blimps 1937 crash site. Then, an 18th-century book titled \"Trials of Patriots,\" may contain John Adams signature and an inscription to his son, Charles. And a search is on at 1520 Sedgwick Avenue in the Bronx to see, as legend has it, the origins of hip-hop music.","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-17","episode_number":8,"episode_type":"standard","id":992739,"name":"Mussolini Dagger; Liberia Letter; N.E.A.R. Device","overview":"A man from Nevada believes he holds a dagger which was owned by Italian dictator Benito Mussolini, including a letter which indicates it was retrieved from Mussolini's apartment following his death. Also, a stack of letters from post-Civil War from a freed slave emigrating from the US to Liberia; and a Cold War era, hand size device that has \"National Emergency Alarm Repeater, Civilian Warning Device\" printed across them.","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-24","episode_number":9,"episode_type":"standard","id":992740,"name":"WPA Mural Studies; George Washington Miniature; Japanese Balloon Bomb","overview":"Items look at include six paintings by Thelma Johnson Streat, which may have been mural studies commissioned by the WPA in the 1930s or '40s; a 1790 miniature color portrait of a \"G. Washington\" which was found stored above a Manhattan tavern in a box of documents; and a scrap of material believed to have come from a Japanese balloon bomb used during WWII.","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-31","episode_number":10,"episode_type":"standard","id":992741,"name":"Stalag 17 Portrait; Seadrome; Black Tom Shell","overview":"A woman from Arizona wants to find out the fate of the man who sketched a picture of her father while in a WWII P.O.W. camp in Krems, Austria. Next, the Seadrome was a floating airport which would enable transatlantic flights was proposed in the 1920s, is investigated for a man in New York who inherited photos of Seadrome from his grandfather. Also, a woman in New Jersey has possession o an unusual artifact: a live artillery shell believed to date to the 1916 sabotage attack of Black TomIsland , N.Y., munitions depot by a German spy ring.","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-07","episode_number":11,"episode_type":"standard","id":992742,"name":"Duke Ellington Plates; Scottsboror Boys Stamp; Civil War Bridge","overview":"Duke Ellington Plates - Are these plates the first edition of Duke Ellington’s “Take the A Train”?\n\n\"Scottsboro Boys\" Stamp - Did a penny stamp help save the Scottsboro Boys from the electric chair?\n\nCivil War Bridge - Has a new discovery rewritten Civil War history?","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-14","episode_number":12,"episode_type":"finale","id":992743,"name":"Shipwreck Cannons; Connecticut Farmhouse; Kahlil Gibran Painting","overview":"Shipwreck Cannons - Are these the last remains of a navy schooner that fought in a border dispute with the mighty British Empire?\n\nConnecticut Farmhouse - How is this Connecticut farmhouse connected to the assassination of a Russian tsar?\n\nKahlil Gibran Painting - Is this painting an unknown work by an immigrant poet whose words inspired an American generation?","production_code":"","runtime":60,"season_number":7,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":61418,"poster_path":null,"season_number":7,"vote_average":0},"8":{"_id":"53b29e530e0a26598c00a2ec","air_date":"2010-06-21","episodes":[{"air_date":"2010-06-21","episode_number":1,"episode_type":"standard","id":992745,"name":"Space Boot; Satelloon; Moon Museum","overview":"Was this magnetic boot designed to allow walking in space? Could a three-inch square of metallic material be part of America's first satellite program? Did the Apollo 12 space mission smuggle Andy Warhol's artwork to the moon?","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-28","episode_number":2,"episode_type":"standard","id":992746,"name":"Iwo Jima Map; Copperhead Cane; Theremin","overview":"Iwo Jima Map -  What role did this map play in one of WWII’s fiercest battles?\n\nCopperhead Cane - How did this cane inspire a fiery political movement that threatened Lincoln’s presidency?\n\nTheremin - How did this strange instrument help spark a rock n’ roll revolution?","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-05","episode_number":3,"episode_type":"standard","id":992747,"name":"Lauste Film Clip; Baker's Gold; Transatlantic Cable","overview":"","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-12","episode_number":4,"episode_type":"standard","id":992748,"name":"Barton Letter; Andrew Jackson's Mouth; Spybook","overview":"Sculpture piece may be part of one that featured Andrew Jackson; Clara Barton letter; a notebook may have belonged to a World War I spy.","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-19","episode_number":5,"episode_type":"standard","id":992749,"name":"Cromwell Dixon; Bartlett Sketchbook; Duke Ellington Plates","overview":"Cromwell Dixon: A four-inch square of fabric tells the story of one of America's first barnstorming pilots. Bartlett Sketchbook: Does this sketchbook illustrate scenes from the first ever US-Mexican border survey? Duke Ellington Plates (R): Could this dumpster find be the printing plates for Duke Ellington's hit \"Take the A Train\"?","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-26","episode_number":6,"episode_type":"standard","id":992750,"name":"Korean War Letter, Diana, Lookout Mt. Painting","overview":"Korean War Letter: What does this letter reveal about a forgotten act of heroism during the final days of the Korean War?\n\nDiana: How did this alleged lesbian autobiography escape censorship in the 1930’s?\n\nLookout Mountain Painting: What can this painting tell us about a turning point in the Civil War?","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-09","episode_number":7,"episode_type":"standard","id":992751,"name":"St.Valentine's Day Massacre; G. Washington Miniature; Stalag 17 Portrait","overview":"St.Valentine's Day Massacre: Family lore says their shotgun played a role in the Chicago St. Valentine's Day Massacre.\n\nG. Washington Miniature: Why is this miniature of Washington more than a piece of art?\n\nStalag 17 Portrait: A portrait sketched in a WWII prison leads to a meeting 65 years later.","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-16","episode_number":8,"episode_type":"standard","id":992752,"name":"Hot Town Poster, Face Jug, Lost City of Gold","overview":"Hot Town Poster: What role did this striking poster play in the explosive events of 1960s America?\n\nFace Jug: Did the artist mean to scare someone with the grimace on this face jug?\n\nLost City of Gold: What does the inscription on a rock tell us about when Spain first arrived in America?","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-23","episode_number":9,"episode_type":"standard","id":992753,"name":"Jackie Robinson All-Stars; Modoc Basket; Special Agent Five","overview":"JACKIE ROBINSON SCORECARD\n\nWhat does this scorecard reveal about the desegregation of our national pastime?\n\nMODOC BASKET\n\nWhat tales does this basket weave of the heroism of an American-Indian woman?\n\nSPECIAL AGENT FIVE\n\nHow did this tale of robbery and murder help FBI director J. Edgar Hoover consolidate his power?","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-30","episode_number":10,"episode_type":"standard","id":992755,"name":"WB Cartoons; Galvez Papers; Mussolini's Dagger","overview":"WB Cartoons:This box of cartoon drawings and cels tells an unexpected story about animation's early days. Galvez Papers: Why did a regional governor care enough about a slave to sign her emancipation papers? Mussolini's Dagger: Did this dagger once belong to Benito Mussolini?","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-06","episode_number":11,"episode_type":"finale","id":992756,"name":"Chicago Clock; Universal Friends; War Dogs","overview":"Chicago Clock: How could one clock regulate time for an entire region, and is this it? Universal Friends: A document seems connected to an early controversial religion, the first founded by an American-born woman. War Dogs: What went wrong during a WWII dog-training program on Cat Island?","production_code":"","runtime":60,"season_number":8,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"","id":61419,"poster_path":null,"season_number":8,"vote_average":0},"9":{"_id":"53b29e550e0a265983009ee2","air_date":"2011-06-21","episodes":[{"air_date":"2011-06-21","episode_number":1,"episode_type":"standard","id":992757,"name":"Yakima Canutt's Saddle; The Ni'ihau Incident; Civil War Cannon","overview":"A veteran collector of cowboy gear, our contributor thinks he may have a saddle that once belonged to rodeo champion and Hollywood legend, Yakima Canutt.\n\nHistory Detectives’ first ever Hawaii story takes us to the island of Ni’ihau, the backdrop for a fascinating tale often overshadowed by the enormity of the raid on Pearl Harbor.  \n\nA Charleston, SC antique dealer discovered a century old puzzle in a corked test tube. The tube contained what appeared to be metal filings along with a note that reads: \"Old Secession was rebored at the Charleston Iron Works May 4/99 and fired by Palmetto Guard Company U.C.V. in honor of U.C.V. reunion May 10/99.\"","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-28","episode_number":2,"episode_type":"standard","id":992759,"name":"Spanish Civil War Eulogy; Word War II Leaflets; Tiffany Window","overview":"War traumatized Sol Fellman. He rarely discussed his Spanish Civil War experience until shortly before his death when he passed on his mementos.  \n\nGoing through her brother’s belongings in El Paso, TX, a History Detectives fan came across a leaflet with Japanese writing and startling war images.  \n\nOur contributor cherishes a small, framed watercolor handed down from his great-great grandmother, Anne Weston.But he has reason to believe the value of this painting may extend beyond his family bond.","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-05","episode_number":3,"episode_type":"standard","id":992770,"name":"Siberian Bullet; John Brown Pike; Ronald McDonald Costume","overview":"Rummaging through a box of shells and bullets at a Colorado gun show, a History Detectives fan discovered a World War I vintage cartridge with a curious etching: Leo V. Thompson, CO E 31st Inf., A.E.F. Siberia.  \n\nOur contributor bought a spear, or pike, from an antique shop in Chagrin Falls, Ohio. He knows abolitionist John Brown lived near Chagrin Falls and wonders if rebels used this blade in John Brown’s famous raid at Harpers Ferry, VA.  \n\nHave we found the original costume that launched Ronald McDonald?  The label credits a well-known costume designer, and the costume looks similar to the suit we see in an early Ronald McDonald commercial: the yellow balloon coverall, red and white striped shirt and long stockings, and red oversized shoes.","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-12","episode_number":4,"episode_type":"standard","id":992760,"name":"African American Comic Book; Lindberg-Sikorsky Fabric; Civil War Letters","overview":"Our contributor found an unusual 1950's comic book at an auction, titled Negro Romance.\n\nFor over 50 years our contributor has cherished an object he inherited from his late father. It’s a piece of fabric in Plexiglass with signatures of Charles Lindbergh and Igor Sikorsky and dated August 1943.  \n\nA couple of stamp enthusiasts found far more than stamps in a box they purchased. In the box, along with Civil War era stamps, we find letters addressed to a William Blackford, Senate Post, Washington, D.C.","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-19","episode_number":5,"episode_type":"standard","id":992771,"name":"Drone Propeller; Clara Barton Letter; Teddy Roosevelt War Club","overview":"Tucked into the pages of an antique book, our contributor from Osceola, Indiana found what he thinks may be a letter written by Clara Barton, founder of the American Red Cross.\n\nMore than 30 years ago, while tearing the aluminum roofing from a farm house, a Chicago man discovered an oddly carved piece of wood in the dark recesses of the attic.  \n\nWorking beside a rural airstrip, an Illinois man dug up an intriguing find:  an eight-foot long wooden airplane propeller. A little research online made him believe that his propeller might be from a TDR-1 plane, a pioneering U.S. drone plane from World War II.","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-26","episode_number":6,"episode_type":"standard","id":992762,"name":"Baker's Gold; Kittery Telescope; Japanese Carved Cane","overview":"A viewer from Colorado thinks he may have discovered a gem of Gold Rush memorabilia when he found an unusual drawing.\n\nWhen a Kittery Point, ME man moved into his great aunt’s house he discovered an unusual wooden telescope.  No one in his family knows where it came from or how long it’s been in the family. \n\nA California man hopes the Japanese characters on this hand-carved cane will unlock the mysteries of his family’s past.","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-23","episode_number":7,"episode_type":"standard","id":992763,"name":"Andrew Jackson's Mouth; Modoc Basket; Hot Town Poster","overview":"A 1960s poster suggests a battle between citizens and police; carving of Andrew Jackson; a basket tells the story of a Modoc War heroine.","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-30","episode_number":8,"episode_type":"standard","id":992764,"name":"Drug Smuggling Doll; Florida Map; Marion Carpenter Camera","overview":"A camera may have been used to photograph President Truman; Civil War doll may have been used to smuggle medicine; a 15th-century map shows how Europe colonized Florida.","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-06","episode_number":9,"episode_type":"standard","id":992766,"name":"1775 Almanac; Exercise Records; Moon Museum","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-20","episode_number":10,"episode_type":"standard","id":992765,"name":"Leopold Medal; Suffrage Pennant; WB Cartoons","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-27","episode_number":11,"episode_type":"standard","id":992767,"name":"Continental Club Card; Saint Valentine's Day Massacre; Society Circus Program","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-11","episode_number":12,"episode_type":"finale","id":992768,"name":"Ince Ledger; Harlem Heirs; Chandler Tintype","overview":"Two Castaic, CA teens found a 1915 ledger in their great grandfather's attic after he  passed away. They found the names of more than \n\nTwenty-five years ago, a Roselle Park, NJ man bought an 1892 stock certificate because he suspected it was a fraud. The certificate bears the name Harlem Associated Heirs Title Company and includes a detailed map of Harlem. \n\nFor the first time History Detectives teams up with Antiques Roadshow to trace the story behind two people in a fascinating photograph.","production_code":"","runtime":60,"season_number":9,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"","id":61420,"poster_path":null,"season_number":9,"vote_average":0},"10":{"_id":"53b29e570e0a26598c00a2f1","air_date":"2012-07-17","episodes":[{"air_date":"2012-07-17","episode_number":1,"episode_type":"standard","id":992772,"name":"Bob Dylan Guitar; Beatles Autographs; Frank Zappa Collage","overview":"The Season 10 premiere investigates the history of an electric guitar to determine if Bob Dylan played it at the 1965 Newport Folk Festival. Also: possible Beatle autographs from 1964 Miami Beach; a $5 thrift-store find that may have a Frank Zappa link.","production_code":"","runtime":60,"season_number":10,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-24","episode_number":2,"episode_type":"standard","id":992773,"name":"Civil War-era pistols; KKK records; Motown Amp","overview":"A matched set of Civil War-era pistols; a 78 rpm record from KKK Records that features the songs \"The Bright Fiery Cross\" and \"The Jolly Old Klansman.\" Also: Eduardo Pagán attempts to prove that Motown bassist James Jamerson owned an Ampeg B-15 amp that the Rock and Roll Hall of Fame wants to display.","production_code":"","runtime":60,"season_number":10,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-24","episode_number":3,"episode_type":"standard","id":992774,"name":"100th Episode: Clint Black's book of wanted posters; Molten metal; Pinup Slide","overview":"Country star Clint Black learns about an old book of wanted posters that he owns. Also: a chunk of molten metal that may be from a B-25 bomber that crashed into the Empire State Building in 1945; a 1950s-era slide that may be of pinup queen Bettie Page.","production_code":"","runtime":60,"season_number":10,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-31","episode_number":4,"episode_type":"standard","id":992775,"name":"World War II patches; Cheyenne possessions; Lincoln note; Civil War Fabric","overview":"Whether two patches that feature a symbol of a bird dropping a bomb are from a World War II unit; if a neckpiece and leggings belonged to Chief Black Kettle, a Cheyenne leader; whether a President Lincoln-signed note is authentic. Also: A tattered piece of red fabric is linked to a pivotal moment in the U.S. Civil War.","production_code":"","runtime":60,"season_number":10,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-07","episode_number":5,"episode_type":"standard","id":992776,"name":"Picture Frame from the Titanic or Lusitania; Woolworth Signs; Toy Soldiers","overview":"Is this picture frame a piece from the Titanic, Lusitania or neither?\n\nWere these signs part of the scene in an early victory for Civil Rights?\n\nDid a Nazi spy buy these toy soldiers?","production_code":"","runtime":60,"season_number":10,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-02","episode_number":6,"episode_type":"standard","id":992777,"name":"N. Vietnamese soldier's diary; Notebook with recipes for large volumes of liquor; Hollywood ledger","overview":"A North Vietnamese soldier's diary; Notebook with recipes for large volumes of liquor; ledger sheds light on how American Indian actors were treated in Hollywood.","production_code":"","runtime":60,"season_number":10,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-09","episode_number":7,"episode_type":"standard","id":992778,"name":"WWI poster; Map of Valley Forge; Transistor radio; Prohibition-era business card","overview":"World War I poster; a map of Valley Forge that George Washington may have used during the American Revolution; Transistor radio; business card may tie a man's father to Prohibition-era underworld crime.","production_code":"","runtime":60,"season_number":10,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-02","episode_number":8,"episode_type":"standard","id":992780,"name":"A Kit Carson Biography; Yakima Canutt Saddle; Inscription on Sheet Music; Modoc Indian Basket","overview":"A Kit Carson biography that may have belonged to his family members; a saddle linked to Hollywood stuntman Yakima Canutt; \"Tumbling Tumbleweeds\" sheet music with curious inscription; a basket that may have been woven by a pivotal player in the Modoc Indian wars.","production_code":"","runtime":60,"season_number":10,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-08","episode_number":9,"episode_type":"finale","id":992779,"name":"A Bill of Sale for a 17-Year Old Black Girl; Powder Horn; Handwritten Score of","overview":"A bill of sale for a 17-year-old black girl; powder horn; handwritten score helps make \"Star-Spangled Banner\"  the national anthem; 1775 almanac.","production_code":"","runtime":60,"season_number":10,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"","id":61421,"poster_path":null,"season_number":10,"vote_average":0},"11":{"_id":"53b29e590e0a265986009d44","air_date":"2014-07-01","episodes":[{"air_date":"2014-07-01","episode_number":1,"episode_type":"standard","id":992784,"name":"Civil War Sabotage?","overview":"The 11th season premiere of \"History Detectives,\" which has been reformatted to focus on one iconic mystery per episode, opens with a look at the April 27, 1865, explosion of the Mississippi steamboat SS Sultana, which was packed with Union soldiers. One of the worst maritime disasters in U.S. history, the official death toll was 1547. The team reviews the original investigative report; and examines theories about the cause, including that it was an act of sabotage by a Confederate agent.","production_code":"","runtime":60,"season_number":11,"show_id":14679,"still_path":"/qnXfXliTQrm0JILavjhtOi9VByG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-08","episode_number":2,"episode_type":"standard","id":992783,"name":"The Disappearance of Glenn Miller","overview":"An investigation into the disappearance of Glenn Miller during World War II. On December 15, 1944, the Army Air Force plane carrying him from England to France vanished while flying across the English Channel. The report makes use of a plane spotter's notebook that was discovered in 2012 to pinpoint the path of Miller's plane; and digs into several theories, including one that friendly fire downed the plane and another that he was on a secret mission to end the war.","production_code":"","runtime":60,"season_number":11,"show_id":14679,"still_path":"/eSjBUSMNyxMT614Mk7pyAYu09Bc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-15","episode_number":3,"episode_type":"standard","id":992782,"name":"Texas Servant Girl Murders","overview":"The unsolved case of the Servant Girl Murders in 1884-85 Austin, Texas, is investigated. Over the course of a year, six African-American servants and two white women were brutally murdered. The modus operandi was similar in each instance: the assailant attacked the victim with an ax while she slept in bed; and then he dragged her outside, where he raped and mutilated her.","production_code":"","runtime":60,"season_number":11,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-22","episode_number":4,"episode_type":"finale","id":992781,"name":"Who Killed Jimmy Hoffa?","overview":"An investigation into the disappearance of Jimmy Hoffa, the former Teamsters president, who was last seen outside the Machus Red Fox Restaurant in Bloomfield Township, Mich., on July 30, 1975.","production_code":"","runtime":60,"season_number":11,"show_id":14679,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 11","overview":"The 11th season of \"History Detectives\" premiered on July 1st, 2014.  In past seasons, several mysteries were explored in each episode.  This season however, \"History Detectives\" has been reformatted to focus on one iconic mystery per episode and the show is now called \"History Detectives Special Investigations\".","id":61422,"poster_path":"/6n6p23sUsrtBe5HlmZOC6Et3Ldx.jpg","season_number":11,"vote_average":0}}}