{"adult":false,"backdrop_path":null,"created_by":[{"id":1212380,"credit_id":"52583878760ee36aaa96ba21","name":"Jacques Antoine","gender":2,"profile_path":null}],"episode_run_time":[60],"first_air_date":"1989-07-19","genres":[],"homepage":"","id":15168,"in_production":false,"languages":["en"],"last_air_date":"1990-01-01","last_episode_to_air":{"id":536126,"name":"Cornwall","overview":"Contestant Clive was successfully ambushed by the Interceptor but had a plan to save his partner Sarah from the Interceptor on a lifeboat. Contestant Sarah had a mini hovercraft ride before coming with the Interceptor but was protected by locals. Clive had arranged for a RAF helicopter to come and get her to meet him at the lifeboat but in a dramatic chase, the Interceptor's and the RAF helicopter race. The episode was memorable for the Interceptor going to the extreme of going up to Sarah's face, shrieking, shooting his infra-red gun only for the locals to protect her. Unfortunately, whilst Sarah's backpack opened, Clive had the money.","vote_average":0,"vote_count":0,"air_date":"1990-01-01","episode_number":8,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":15168,"still_path":"/xAfMrHFI86lBitgpZmO3LyZbBhC.jpg"},"name":"Interceptor","next_episode_to_air":null,"networks":[{"id":9,"logo_path":"/oz9pjTHnBUmlju8OkaTymhKbh6C.png","name":"ITV1","origin_country":"GB"}],"number_of_episodes":8,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Interceptor","overview":"Interceptor is a British game show created by Jacques Antoine, Jean Jacques Pasquier and Malcolm Heyworth. It was produced by Chatsworth in association with Thames and shown on the ITV network during the summer of 1989, with one last episode held back and shown on 1 January 1990 for a New Year special. It was made in between Treasure Hunt and The Crystal Maze, game shows from the same production company.\n\nThe show was hosted by former tennis player and Treasure Hunt sky-runner Annabel Croft. The eponymous Interceptor was played by actor Sean O'Kane.\n\nInterceptor was received well by critics and viewers, yet only eight episodes were made. Nonetheless, the show has something of a cult following, which influenced re-runs on digital TV channel Challenge from 2001 onwards. A public vote by UKGameshows.com in 2002 saw the series voted the UK's 13th best game show.","popularity":1.436,"poster_path":null,"production_companies":[],"production_countries":[],"seasons":[{"air_date":"1989-07-19","episode_count":8,"id":26791,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"52583877760ee36aaa96b96b","air_date":"1989-07-19","episodes":[{"air_date":"1989-07-19","episode_number":1,"episode_type":"standard","id":536119,"name":"Kent","overview":"Contestant Mark (to get his key) had to get it from a hive of bees. The Interceptor chased contestant Candy (who was travelling in a Rolls Royce) on horseback. Towards the end of the episode, the Interceptor successfully sneaked up on an oblivious Mark and zapped his backpack at point-blank range. After doing so, he screamed into his ear. Mark and Candy did not meet up within the 40-minute time limit.","production_code":"","runtime":60,"season_number":1,"show_id":15168,"still_path":"/ylOVSWsnkTMw0HTedMJmunyXjdk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-07-26","episode_number":2,"episode_type":"standard","id":536120,"name":"Norfolk","overview":"While contestant Roger tried to get his key in the middle of a maze in a stately home, the Interceptor planned an ambush. However, Roger got away before the Interceptor could zap him. Contestant Claire went on a pleasure cruise to get near her key on a river as Roger approached. The Interceptor hijacked a boat and attempted to stop them, but Roger and Claire met up within the time limit and won the £1,000. The Interceptor was arrested by the police because he went over the speed limit on the river.","production_code":"","runtime":60,"season_number":1,"show_id":15168,"still_path":"/su3sMGO3MqvgXGX2TBURwH0L0ik.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-08-02","episode_number":3,"episode_type":"standard","id":536121,"name":"Wye Valley","overview":"Contestant Mark enlisted the help of the army to find his key while at the end of the episode, the Interceptor screeched over a bridge in his Maserati. Although the two contestants met up with 1 minute remaining, the Interceptor had zapped their backpacks.","production_code":"","runtime":60,"season_number":1,"show_id":15168,"still_path":"/A19N8XkOYX4ivyBIsravBzznVe5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-08-09","episode_number":4,"episode_type":"standard","id":536122,"name":"Cumbria","overview":"Contestant Max made his way on the Ravenglass and Eskdale Railway to his key challenge and the Interceptor climbed along the train in pursuit of Max. Contestant Suzanne got soaked in Wast Water while trying to get her key. At the end of the episode, the Interceptor blocked the entrance to the Eskdale Outward Bound Centre where contestant Suzanne was coming but her partner Max grabbed her just in time before the Interceptor. They won the money with 6 seconds to spare. Additionally, it turned out that the Interceptor had failed to zap both backpacks.","production_code":"","runtime":60,"season_number":1,"show_id":15168,"still_path":"/bkFPDqi98NOF0CfsP1BK6X2TD9L.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-08-16","episode_number":5,"episode_type":"standard","id":536123,"name":"Derbyshire","overview":"Contestant Martin had a brief chase with The Interceptor but got away in the nick of time. Contestant Hillary was unaware that she was taken on a ride in a tractor by the Interceptor. The farmers at the farm where she got the tractor even go as far as helping him, all because of a money bribe of ten pounds, and a further ten pounds if his ambush was a success. When he locked Hillary's pack, he shrieked many times and yelled in joy, only for Hillary to jump on a nearby van, jokingly threatening to hit The Interceptor with a spade if he didn't leave her alone. Nevertheless, the ambush effort was all in vain, as even if the trick did not work, the contestants still would have failed as they did not meet each other within the 40-minute time limit.","production_code":"","runtime":60,"season_number":1,"show_id":15168,"still_path":"/xDDuenYMZBnvEyZTHZEH9TlY6nn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-08-23","episode_number":6,"episode_type":"standard","id":536124,"name":"Borders","overview":"The Interceptor wouldn't leave contestant Mike alone as he got his key from the top of a factory, but while attempting an ambush, he was spotted by Mike and gave up. Contestant Sarah cycled down from her starting position to get to her key challenge on a river, only to see the Interceptor nearby in a dinghy. Mike and Sarah failed to meet up within the 40-minute time limit, and it turned out that the Interceptor had failed to zap Sarah's backpack — which contained the £1,000.","production_code":"","runtime":60,"season_number":1,"show_id":15168,"still_path":"/f2eCeDHgbq9UoFBihrEuEM15rn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-08-30","episode_number":7,"episode_type":"standard","id":536125,"name":"Cotswolds","overview":"Contestant Marcel had to escape the chasing Interceptor by quadbike. Contestant Nikki was taken to her key at the top of a burning building and when he started chasing her on foot she finds a way to escape quicker and the Interceptor lost her and at the end of the episode, Marcel was getting his key on a chariot race and the Interceptor was ready to zap him but he was too late and the contestants won the £1,000 prize money.","production_code":"","runtime":60,"season_number":1,"show_id":15168,"still_path":"/2psAPraoQEBU6oXcVLyhSTFV2HV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-01-01","episode_number":8,"episode_type":"finale","id":536126,"name":"Cornwall","overview":"Contestant Clive was successfully ambushed by the Interceptor but had a plan to save his partner Sarah from the Interceptor on a lifeboat. Contestant Sarah had a mini hovercraft ride before coming with the Interceptor but was protected by locals. Clive had arranged for a RAF helicopter to come and get her to meet him at the lifeboat but in a dramatic chase, the Interceptor's and the RAF helicopter race. The episode was memorable for the Interceptor going to the extreme of going up to Sarah's face, shrieking, shooting his infra-red gun only for the locals to protect her. Unfortunately, whilst Sarah's backpack opened, Clive had the money.","production_code":"","runtime":60,"season_number":1,"show_id":15168,"still_path":"/xAfMrHFI86lBitgpZmO3LyZbBhC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":26791,"poster_path":null,"season_number":1,"vote_average":0}}}