{
    "adult": false,
    "backdrop_path": "/nnbo0RIs3LJPThJHLOPHzKaC2so.jpg",
    "created_by": [
        {
            "id": 1886522,
            "credit_id": "61af04c943494f0064200994",
            "name": "David F. Mewa",
            "original_name": "David F. Mewa",
            "gender": 0,
            "profile_path": null
        }
    ],
    "episode_run_time": [
        45
    ],
    "first_air_date": "2021-03-03",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        },
        {
            "id": 10751,
            "name": "Family"
        }
    ],
    "homepage": "https://www.hgtv.ca/shows/farmhouse-facelift/",
    "id": 152499,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2022-03-15",
    "last_episode_to_air": {
        "id": 3626962,
        "name": "Home Sweet Homestead",
        "overview": "",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2022-03-15",
        "episode_number": 1,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 45,
        "season_number": 2,
        "show_id": 152499,
        "still_path": null
    },
    "name": "Farmhouse Facelift",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 1672,
            "logo_path": "/iQgW9a6kOgMbxCVYB97643ICVDn.png",
            "name": "HGTV Canada",
            "origin_country": "CA"
        }
    ],
    "number_of_episodes": 11,
    "number_of_seasons": 2,
    "origin_country": [
        "CA"
    ],
    "original_language": "en",
    "original_name": "Farmhouse Facelift",
    "overview": "Siblings Billy Pearson, a craftsman contractor, and Carolyn Wilbrink, a designer, tackle the toughest farmhouse renovations for their clients, bringing stunning designs and customized modern conveniences to each new project.",
    "popularity": 0.994,
    "poster_path": "/oSfOeojedzYYA25uMmAQrAcDkMH.jpg",
    "production_companies": [
        {
            "id": 22702,
            "logo_path": "/l4eSl1sbXdzgBtMkxdTUIGzAJX6.png",
            "name": "Sonar Entertainment",
            "origin_country": "US"
        }
    ],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2021-03-03",
            "episode_count": 10,
            "id": 234458,
            "name": "Season 1",
            "overview": "Siblings Billy Pearson, a craftsman contractor, and Carolyn Wilbrink, a designer, tackle the toughest farmhouse renovations for their clients, bringing stunning designs and customized modern conveniences to each project",
            "poster_path": "/kN6tW1H9CoG3MDvsR2L30LKyMWs.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2022-03-15",
            "episode_count": 1,
            "id": 285387,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 8,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "61ade5ee0d2f53008c1a6c3a",
            "air_date": "2021-03-03",
            "episodes": [
                {
                    "air_date": "2021-03-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3379974,
                    "name": "Make It Ours",
                    "overview": "Homeowners John and Kristine need help renovating a tired farmhouse that has been in the family for four generations.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-03-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3379976,
                    "name": "First Farmhouse",
                    "overview": "After years of longing to live in the country, Ashley and Lucas found their dream property, but it needs a facelift. Farmhouse renovation siblings Carolyn and Billy help to transform this home into a stunning modern farmhouse.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-03-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3379977,
                    "name": "A Main Floor Overhaul",
                    "overview": "Nathan was born and raised on the property that he and his wife Morgan call home. The middle of five children, Nathan took over the 100-acre family farm, dedicating his life to raising the livestock and growing crops. This young couple wants to start a family, but with Morgan’s hectic elementary school teaching schedule and Nathan working long days on the farm, they haven’t had the time to renovate. Enter farmhouse renovation duo Billy and Carolyn. The rural renovators help modernize this historic farmhouse and give Nathan and Morgan a stunning and functional home that is perfect for their future family.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-03-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3379979,
                    "name": "Attic Appeal",
                    "overview": "Niki and Jordan are a young couple who are used to the hustle and bustle of the big city - but city life can be exhausting. They longed to escape to the country with their young daughter. When their ideal property – a 1904 farmhouse, with an adjacent 40-acre apple orchard – came up for sale, they jumped at the chance to buy the farm. While the property is beautiful, and the farmhouse is huge, it needs some serious work. This enterprising couple tried to take on the renovation themselves, but with Niki’s work as an artist and Jordan’s busy work travel schedule, they feel like they’re stuck in a house that will never get finished. They need farmhouse renovation siblings Carolyn and Billy to turn a half-renovated room into their growing daughter’s stylish bedroom and convert an unfinished attic into a beautiful principle suite for this young couple to enjoy.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-03-31",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3379980,
                    "name": "A Baker’s Dream",
                    "overview": "Jeff and Christine’s farmhouse has been in his family for six generations since 1891! After purchasing it from his grandparents a few years back and doing some basic updates on their own, they soon realized that they need help to tackle the full renovation of the historic home. This diamond-in-the-rough needs to be made safer and functional for their family of six. The pressure is on! Can farmhouse renovation team Carolyn and Billy successfully update Jeff and Christine’s 128-year-old farmhouse for the next generations?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-04-07",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3379981,
                    "name": "Upstairs, Downstairs",
                    "overview": "Moving to the country is something that Tracy never imagined she’d do. Country living took some adjusting but by now, Tracy’s grown accustomed to rural life and wouldn’t trade her busy life on the farm with John and their almost-grown children for anything. The aging house, however, no longer works for this family and their needs, and Tracy is at her wit’s end. With their active and busy family life, they need farmhouse renovation team Carolyn and Billy to help renovate this outdated farmhouse and make it functional and beautiful for their family of six.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-04-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3379982,
                    "name": "Bought Unseen",
                    "overview": "Michael’s dream has always been to live on the farm that has been in his family for generations, but after the home was sold a few years back, he thought that dream was shattered. When the opportunity came up for him to purchase the farm, he saved what he could, and bought it back. It was purchased without his wife Kristen being able to see it - and they quickly realized they could not move into this rundown farmhouse with their three kids. They are currently living in a trailer on the property until the renovation is complete. They need farmhouse renovation team Carolyn and Billy to create a stylish, functional home that will work for this young family – and do it quickly so the family can get out of the trailer and into their home.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-04-21",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3379983,
                    "name": "A Rock & A Reno",
                    "overview": "When Katie married her husband Scott, she packed up her life in suburbia and moved to the country where Scott grew up. The location of their farmhouse couldn’t be more idyllic and has allowed them to embrace the great outdoors with their two children. The house itself, however, is another story. With age, it’s losing its old elegance and the space isn’t conducive to hosting the large family gatherings they love to hold. It also has a huge safety issue in the form of a dangerous rock ledge that prevents this family from really embracing their time together at home. They’re hoping farmhouse renovation duo Carolyn and Billy can help them transform their charming family farmhouse into a beautiful and stylish home for their family of four.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-04-28",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3379984,
                    "name": "Dual-Purpose Farmhouse",
                    "overview": "Chris and Lauren are quickly outgrowing their home in the city. With a one-year-old baby, and plans for more, they realized the need to move to a larger property. They didn’t have to look too far for their dream farm property, as Chris and Lauren purchased the family home from his parents. They can’t move into the farmhouse in its current state, as it needs a serious overhaul to make it work – both as a family home, and as a base for Lauren’s holistic nutrition business. Can farmhouse reno siblings Carolyn and Billy design a home that honours the history of the home while making it a beautiful yet functional space for family and business? Will they be able to get the balance right?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-05",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 3379985,
                    "name": "Farmhouse With A View",
                    "overview": "Sarah and Brian have long dreamed of living in the country in a big old farmhouse, where their two girls could grow up with lots of space and freedom. Sure, their dream farmhouse has lot of history and character, but that also means it has major problems. They thought this century home would be an undertaking, but they weren’t prepared for just how unsuited the main floor layout would be for their active family life. Can farmhouse renovation siblings Carolyn and Billy give them a safe, comfortable home, while keeping the stunning old charm that attracted them to the house in the first place? The pressure is on!",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "Siblings Billy Pearson, a craftsman contractor, and Carolyn Wilbrink, a designer, tackle the toughest farmhouse renovations for their clients, bringing stunning designs and customized modern conveniences to each project",
            "id": 234458,
            "poster_path": "/kN6tW1H9CoG3MDvsR2L30LKyMWs.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "6242d51a223a8b004ae4d0f6",
            "air_date": "2022-03-15",
            "episodes": [
                {
                    "air_date": "2022-03-15",
                    "episode_number": 1,
                    "episode_type": "finale",
                    "id": 3626962,
                    "name": "Home Sweet Homestead",
                    "overview": "",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 152499,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 285387,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    }
}