{
    "adult": false,
    "backdrop_path": "/92B82oAnQLzA4eaLXCA5ygd6hYy.jpg",
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2021-12-04",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "https://www.reelz.com/show/frontman/",
    "id": 153393,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2022-03-05",
    "last_episode_to_air": {
        "id": 4180790,
        "name": "Axl Rose: Guns N' Roses",
        "overview": "Axl Rose, lead singer of Guns N' Roses, famous for hits like \"Paradise City\" and \"Sweet Child of Mine,\" is one of the most unpredictable rock stars of all time. At the height of his fame he systematically went about destroying everything around him -- the band, his relationships, even himself. But why? In this seminal two hour biopic, told by some of those who knew him the best, we explore the tortured life of this most iconic of frontmen -- a man damaged by his strict, abusive upbringing who suffered from manic depression coupled with an immense talent that he didn't know how to control; a man who seemed to bask in chaos and controversy; a man who for years alienated everyone around him, before disappearing from public view for ten years. When he finally emerged and reunited with Guns N' Roses he was almost unrecognizable, his demons seemingly vanquished; finally at peace with himself.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2022-03-05",
        "episode_number": 8,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 90,
        "season_number": 1,
        "show_id": 153393,
        "still_path": "/1xRoFr7tZC8T3Uej7Uvojo7WP5C.jpg"
    },
    "name": "Frontman",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 367,
            "logo_path": "/ngpAA1R1mOkiwC7RAxTbgbip6DZ.png",
            "name": "Reelz",
            "origin_country": "US"
        },
        {
            "id": 6590,
            "logo_path": null,
            "name": "Vibrophil Media (DE)",
            "origin_country": ""
        }
    ],
    "number_of_episodes": 8,
    "number_of_seasons": 1,
    "origin_country": [
        "GB"
    ],
    "original_language": "de",
    "original_name": "Frontman",
    "overview": "In this tell-all drama documentary series, we lift the lid on these titans of music. Hearing from friends, family, band members, partners and the people who were all part of the journey, we piece together the turbulent childhoods, explosive teenage years, relationships with parents, girlfriends, wives and the band members of these unique individuals. We take those that knew them best back to the places where their legends were born – the apartments, clubs, dives, houses and cars in which these men were forged. From crippling drug addictions to scandalous affairs, we’ll uncover the shocking reality of what it takes to be a frontman; we’ll tap into the vast musical archive, use rare band interviews and remarkable off stage footage to piece together each dramatic tale.",
    "popularity": 0.987,
    "poster_path": "/272v7Ax5JiQVBPBCS5JGlLlYjxU.jpg",
    "production_companies": [
        {
            "id": 166218,
            "logo_path": "/lOpDavR8FVJk5P4gcotUwbSbon.png",
            "name": "Honey Bee",
            "origin_country": "GB"
        },
        {
            "id": 191535,
            "logo_path": null,
            "name": "Vibrophil Media",
            "origin_country": ""
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        },
        {
            "iso_3166_1": "US",
            "name": "United States of America"
        }
    ],
    "seasons": [
        {
            "air_date": "2021-12-04",
            "episode_count": 8,
            "id": 235759,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 1,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "61b62f4993828e006555a108",
            "air_date": "2021-12-04",
            "episodes": [
                {
                    "air_date": "2021-12-04",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3390831,
                    "name": "Ozzy Osbourne: Black Sabbath",
                    "overview": "Ozzy Osbourne is renowned as one of the craziest frontmen of all time. His antics include biting off a bat head and snorting ants on stage will go down in the annals of rock history. But what made Ozzy so frenetic? In this revealing look at the legendary lead vocalist of heavy metal band Black Sabbath see Osbourne's roots and the childhood trauma that forged the entertainer and made him want to 'out crazy' his peers. Sharing their experiences with Osbourne are his friends and colleagues including Black Sabbath's first manager Jim Simpson and friend Geoff Lucas who help chart his life from his poverty-stricken upbringing in England through his rise to the top as frontman of Black Sabbath and his eventual dismissal after his drink and drug addiction overwhelmed him. Viewers will also see how his wife Sharon saved him from ruin and how she helped harness Osbourne's wild side and turn him into one of the world's most successful stars.",
                    "production_code": "",
                    "runtime": 90,
                    "season_number": 1,
                    "show_id": 153393,
                    "still_path": "/AnOO2kfjv843iee9rQ6ZkuiTHYF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-12-05",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3391019,
                    "name": "Bruce Dickinson: Iron Maiden",
                    "overview": "Nicknamed 'The Air Raid Siren' for his trademark soaring high-pitched voice the frontman of Iron Maiden Bruce Dickinson is widely considered to be one of the greatest rock vocalists of all time. From humble beginnings attending an exclusive English boarding school where he defied the bullies and began his love of singing to joining Iron Maiden and becoming a celebrated frontman this is the real story of Dickinson. The ultimate overachiever he was also an award winning author, radio show host and a commercial airline pilot in addition to battling cancer, performing in war torn Sarajevo and becoming an international fencer. Sharing their stories of knowing and working with one of the most dynamic frontmen of all time are childhood friend Mike Jordan and Iron Maiden producer Tony Platt who worked with Dickinson to shape his now unmistakable vocal style and range.",
                    "production_code": "",
                    "runtime": 90,
                    "season_number": 1,
                    "show_id": 153393,
                    "still_path": "/vWi3cE8Q7c3hQRG1Dz0YSsqCXJS.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-12-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3391020,
                    "name": "David Lee Roth: Van Halen",
                    "overview": "One of the most famous, flamboyant and charismatic frontmen in the world David Lee Roth is unlike most lead singers. The frontman of Van Halen is the same person both on and off stage and craves attention and adulation at all times. Growing up in rural Indiana Roth showed early brilliance turning himself into a ferociously bright teenager. His determination to become a frontman led him to convince the Van Halen brothers to let him join their band and Roth's infectious personality and memorable acrobatic stage presence helped make Van Halen one of the most popular rock bands in the world. His notorious rock 'n' roll lifestyle and fun-loving demeanor cemented Diamond Dave as, for some, the band's only \"real\" frontman. Sharing their personal stories of Roth are childhood friend George Perez and former Van Halen band manager Marshall Berle.",
                    "production_code": "",
                    "runtime": 90,
                    "season_number": 1,
                    "show_id": 153393,
                    "still_path": "/zhZp6AeDuueEpmaNT0t2KKxaxlF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-12-12",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3391021,
                    "name": "Alice Cooper",
                    "overview": "Alice Cooper started life as Vince Furnier, an all-American son of a pastor, but rose to fame in the early 70s as his hell raising onstage alter ego Alice Cooper adopting and crafting a role as a rock music villain. His bloody stage antics and outrageous persona made him beloved by kids and hated by parents. But behind the scenes the demonic character of Alice Cooper would ultimately consume him as Vince Furnier began to confuse the two characters blurring the lines in dangerous fashion hitting rock bottom when he used so many drugs that his eyes bled and his wife threatened to divorce him. Even after he emerged from the experience sober it wasn't long before the demons of the Alice Cooper character return and threaten to end it all. This is the extraordinary story of the man who would become the godfather of shock rock with personal stories from college friend Linda Thompson Smith, fellow rockers Doro Pesch and Dee Snider along with Alice Cooper guitarist Ryan Roxie.",
                    "production_code": "",
                    "runtime": 90,
                    "season_number": 1,
                    "show_id": 153393,
                    "still_path": "/mhAwxpdncERkcc6dkJjwPms8vWb.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-05",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4180776,
                    "name": "Steven Tyler: Aerosmith",
                    "overview": "As lead singer of Aerosmith Steven Tyler was one of the most iconic, bombastic and charismatic frontmen to ever take the stage. Aerosmith saw major chart and commercial success with hits like \"Dream On,\" \"Walk This Way\" and \"Love in an Elevator\" selling more than 150 million albums making them the biggest-selling hard rock back in U.S. history. But despite phenomenal success time and time again Tyler's career nose-dived into a negative spiral with drug and alcohol addiction almost killing him yet every time he fell Tyler came back even bigger and better than before. The story of the man with self-confessed 'lead singer's disease' is told by some of the people who know Tyler best including former band manager Steve Leber and childhood friend and former bandmate Ray Tabano among others.",
                    "production_code": "",
                    "runtime": 90,
                    "season_number": 1,
                    "show_id": 153393,
                    "still_path": "/7mnTQBD7e9kimTJGW21db24GYvf.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4180779,
                    "name": "Gene Simmons & Paul Stanley: KISS",
                    "overview": "KISS has always been different. They have two frontmen in Gene Simmons and Paul Stanley who somehow shared the stage and gave fans a spectacle like no other with fire bombs, smoking guitars and spitting blood all part of their famed act. Both their backgrounds were scarred by childhood trauma and together they created alter egos named the Starchild and the Demon, masked characters that would take on the world. But hiding behind their personas was a recipe for disaster and their soaring ride to the top would face a mighty challenge when sales plummeted leaving Simmons and Stanley to take drastic measures to keep the music playing. This is the story of how two of the most legendary frontmen managed to share a vision and a stage forming a band that became one of the best-selling rock acts of all time with insight from those close to them including former KISS manager Larry Mazer and Stanley's childhood friend Binky Philips.",
                    "production_code": "",
                    "runtime": 90,
                    "season_number": 1,
                    "show_id": 153393,
                    "still_path": "/2UmQpPN5zLOuiq2D4yC7SuRqiqG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-27",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4180785,
                    "name": "Jon Bon Jovi: Bon Jovi",
                    "overview": "For almost 40 years Jon Bon Jovi has fronted one of the world's biggest rock bands. With power ballads including \"Livin' On A Prayer\" and \"It's My Life\" Bon Jovi album sales topped 130 million. Jon Bon Jovi is equally successful as a solo artist and Hollywood actor. Despite mountains of money, global fame and certified rock legend status that often leads to the cliches of drug addictions and bad headlines Jon Bon Jovi took a different route as a laser focused and a highly successful businessman. Frontmen explores the story of the star who avoided the trappings of fame and what led to his disciplined approach to being one of the most successful frontmen of all time. It was also this determined mindset and unwavering dedication to a vision that nearly destroyed what he loved most. Sharing their stories of knowing and working with Jon Bon Jovi are Mercury Records executive Derek Shulman, childhood friend and bandmate Wil Hercek and friend Lonn Friend among others.",
                    "production_code": "",
                    "runtime": 90,
                    "season_number": 1,
                    "show_id": 153393,
                    "still_path": "/lNDZVUPuth3NZI5Uy2PlThliexK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-05",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 4180790,
                    "name": "Axl Rose: Guns N' Roses",
                    "overview": "Axl Rose, lead singer of Guns N' Roses, famous for hits like \"Paradise City\" and \"Sweet Child of Mine,\" is one of the most unpredictable rock stars of all time. At the height of his fame he systematically went about destroying everything around him -- the band, his relationships, even himself. But why? In this seminal two hour biopic, told by some of those who knew him the best, we explore the tortured life of this most iconic of frontmen -- a man damaged by his strict, abusive upbringing who suffered from manic depression coupled with an immense talent that he didn't know how to control; a man who seemed to bask in chaos and controversy; a man who for years alienated everyone around him, before disappearing from public view for ten years. When he finally emerged and reunited with Guns N' Roses he was almost unrecognizable, his demons seemingly vanquished; finally at peace with himself.",
                    "production_code": "",
                    "runtime": 90,
                    "season_number": 1,
                    "show_id": 153393,
                    "still_path": "/1xRoFr7tZC8T3Uej7Uvojo7WP5C.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 235759,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    }
}