{"adult":false,"backdrop_path":"/vXea3pNCE25PPue12mD8izVAhzo.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2008-03-09","genres":[{"id":10764,"name":"Reality"}],"homepage":"https://www.history.com/shows/ax-men","id":15563,"in_production":false,"languages":["en"],"last_air_date":"2019-09-13","last_episode_to_air":{"id":1914498,"name":"Untethered","overview":"Jason Rygaard races to clear a hillside in time to fill four logging trucks; Jay R Harkness fights to control the untethered Tigercat on a steep, snow-covered mountainside; Bucking Billy and his son Hogan battle a forest of hang-ups and widow-makers.","vote_average":0,"vote_count":0,"air_date":"2019-09-13","episode_number":10,"episode_type":"finale","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null},"name":"Ax Men","next_episode_to_air":null,"networks":[{"id":65,"logo_path":"/9fGgdJz17aBX7dOyfHJtsozB7bf.png","name":"History","origin_country":"US"}],"number_of_episodes":163,"number_of_seasons":10,"origin_country":["US"],"original_language":"en","original_name":"Ax Men","overview":"Danger is a full-time job for these brave men who put everything on the line each and every day to retrieve the Pacific Northwest timber with which we build our country. Snapped cables, runaway logs and razor-sharp chainsaws are just some of the dangers that threaten their lives daily. Even with new technology that should make the job easier, anything and everything can and does go wrong.","popularity":17.728,"poster_path":"/nnkwFrsyP1fXhSl1L2UMsEK2K3l.jpg","production_companies":[{"id":24824,"logo_path":"/l9qV55gF4sVK6ZMitwH9csTSOgH.png","name":"Original Productions","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2008-05-25","episode_count":2,"id":62487,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2008-03-09","episode_count":13,"id":62488,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2009-03-02","episode_count":12,"id":62489,"name":"Season 2","overview":"Two of Oregon's top logging companies from last year, J.M. Browning Logging of Astoria and Vernonia's Pihl Logging returns. Adding to the competition are three newcomers, each bringing something different to the table. Rygaard Logging of Port Angeles, Washington, a fiery father-son team; R&R Conner Aviation of Conner, Montana, which utilizes helicopters to maximize its output; and S&S Aqua Logging of Aberdeen, Washington, a team of diving loggers who fish for timber in some of the Pacific Northwest's most treacherous waters.","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2010-01-10","episode_count":13,"id":62490,"name":"Season 3","overview":"The loggers work during the dead heat of summer, with stakes that are higher than ever. In the rugged mountains of the Pacific Northwest, industry titan J.M. Browning Logging, reigning champion Rygaard Logging and underdog Pihl Logging vie for the title \"King of the Mountain.\" But this year, they are only half of the story: S&S Aqua Logging heads to Florida in search of new beginnings; R&R Conner Aviation, the Montana-based helicopter logging firm, must find a new ace pilot; and, for the first time, we wade into the swamps of Louisiana to meet a man unlike any other, Shelby Stanga, and explore the fascinating business of swamp logging.","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2010-12-12","episode_count":20,"id":62491,"name":"Season 4","overview":"Father-and-son team Gabe and Craig Rygaard return to battle their nemesis, reigning \"King of the mountain\" J.M. Browning. But this year, the crews from Washington and Oregon have more than each other to worry about - there's been a changing of the guard at Pihl Logging as Leah Proctor, a female greenhorn, is brought on to keep the men on their toes. Newcomers Papac Logging of Alaska and Lemare Logging of British Columbia are also throwing their hats into the ring. These companies specialize in conquering the rugged Pacific wilderness, as far removed from civilization as one can get. Each morning, Papac crews load into boats that take them across miles of the roughest water in Alaska. On the other end is Suemez Island, one of the most difficult jobs Papac has ever attempted. Down south, \"Swampman\" Shelby Stanga is back and his sights are set on the biggest logs in the Louisiana bayous. But to claim them, he'll need help from a crew of sidekicks as colorful as he is. In Florida, James Smith and the S&S Aqua/Collins crew return to do battle on the Suwannee River. Rounding out the water logging crews is newcomer Olson Marine, a unique tugboat operation in Alaska that transports millions of dollars in timber through hundreds of miles of the most violent waters and unpredictable weather in the world.","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2012-01-08","episode_count":20,"id":62492,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0},{"air_date":"2012-12-09","episode_count":20,"id":62493,"name":"Season 6","overview":"","poster_path":null,"season_number":6,"vote_average":0},{"air_date":"2013-11-10","episode_count":20,"id":62494,"name":"Season 7","overview":"","poster_path":null,"season_number":7,"vote_average":0},{"air_date":"2014-11-30","episode_count":20,"id":63746,"name":"Season 8","overview":"","poster_path":null,"season_number":8,"vote_average":0},{"air_date":"2015-11-22","episode_count":15,"id":72223,"name":"Season 9","overview":"","poster_path":null,"season_number":9,"vote_average":0},{"air_date":"2019-07-12","episode_count":10,"id":127648,"name":"Season 10","overview":"","poster_path":null,"season_number":10,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Reality","vote_average":5.7,"vote_count":10,"season_data":{"1":{"_id":"5407f7f0c3a3685833000828","air_date":"2008-03-09","episodes":[{"air_date":"2008-03-09","episode_number":1,"episode_type":"standard","id":1006081,"name":"Man vs. Mountain","overview":"Deep in the woods of the Pacific Northwest, rugged men make their living doing one of the deadliest jobs in the world... logging. Their mission is to retrieve timber perched on mountainsides too steep to access with machines, but it's no easy task. Plagued by mechanical failures, relentless weather, and unpredictable terrain, these brave men risk their lives retrieving the timber with which we built our country. Meet four companies trying to survive each day. Pihl Logging--a rag-tag group of loggers based in Vernonia, Oregon. Gustafson Logging--a close-knit crew working one of the most dangerous jobs in the region. J.M. Browning--the best of the best. Stump Branch Logging--the young guns with a lot to prove. These are the Ax Men.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-16","episode_number":2,"episode_type":"standard","id":1006082,"name":"Risk and Reward","overview":"Just days into the fall logging season, the Ax Men are already being put to the test. J.M. Browning races to meet a big deadline. Stump Branch Logging tempts fate by jury-rigging their old equipment. The Gustafson Company races mother nature as they attempt to build a road to access their logging site. Father teaches son the lessons of logging as the men of the Pihl Company haul in the forest's cash crop.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-23","episode_number":3,"episode_type":"standard","id":1006083,"name":"Storm Season Strikes","overview":"As a storm closes in on the Oregon coast, the Ax Men race to stay one step ahead. Jesse continues to push the J.M. Browning crew to meet its looming deadline, while muddy roads trap trucks on their way to the Stump Branch site. Robby battles for control of the Gustafson crew. Pihl Logging feels the effects of the slumping lumber market.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-30","episode_number":4,"episode_type":"standard","id":1006084,"name":"The Big Hit","overview":"Across Northwest Oregon, the Ax Men continue to grind it out. Storm season arrived with a vengeance--shutting some crews down while others struggled to stay afloat. Now a bigger storm is brewing. The stalled housing market's effects are hitting the Ax Men hard. Jobs will be shut down; men will be put out of work. This week, the housing market hits home.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-06","episode_number":5,"episode_type":"standard","id":1006085,"name":"Market Meltdown","overview":"The loggers of the Pacific Northwest perform what is said to be North America's most dangerous job. Watch as the men react to news of upcoming layoffs. Gustafson Logging tries to get back on track, Browning Logging races to meet a big deadline and Pihl Logging needs to finish the Pig Farm Job. Despite Melvin's best efforts to keep up with his old equipment, Stump Branch Logging loses one of its most important machines.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-13","episode_number":6,"episode_type":"standard","id":1006086,"name":"Reversal of Fortune","overview":"Logging has been called North America's most dangerous job. Logging giants throughout Oregon are falling. Two of the biggest--J.M. Browning and Gustafson Logging--are fighting to survive. Jay Browning, usually flush with lucrative deals, is forced to make tough decisions. Gustafson Logging is down but not out. Smaller outfits, like Stump Branch and Pihl, find winning strategies in their young leaders.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-20","episode_number":7,"episode_type":"standard","id":1006087,"name":"The Close Call","overview":"The season is halfway through, and the gap between winners and losers is widening. Stump Branch tests a new but more dangerous logging strategy... and it poses great danger to the men in the rigging. The Pihl men play while the bosses are away. Browning Logging is a team divided. Jesse struggles to prove himself to his father... but faulty equipment isn't helping matters. A mistake on the Gustafson crew may end one man's career.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-27","episode_number":8,"episode_type":"standard","id":1006088,"name":"Loggers Under Fire","overview":"In the wake of the plummeting logging market, the Ax Men are barely surviving. The Gustafson bosses have a close call while taking over for their laid-off crew. An old hook tender returns to the Browning team, stopping Jesse's ascension to company management. Pihl loses a crucial member of the team as it struggles to finish Pig Farm. At Stump Branch, the young guns take matters into their own hands when Melvin has to leave the site.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-05-04","episode_number":9,"episode_type":"standard","id":1006089,"name":"A Logger's Thanksgiving","overview":"Thanksgiving arrives; winter weather strikes and the men of Pihl lose one man after another to illness. The younger crew members of Gustafson blow off steam while the bosses toil away. Jay is forced to ax some of the Browning gang staff. The season's first snow is a warning of things to come for the Stump Branch crew.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-05-11","episode_number":10,"episode_type":"standard","id":1006090,"name":"Black Friday","overview":"Thanksgiving is over, but the return to work brings more trouble for the Ax Men. The Gustafson crew now faces a nearly impossible deadline after returning from a devastating two-week layoff. Pig Farm is close to its deadline, but half of the Pihl crew skips work, leaving greenhorn Cody to pick up the slack. Mistakes and inexperience at Stump Branch put profits and lives at risk. Jay Browning makes a troubling discovery about his next job.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-05-18","episode_number":11,"episode_type":"standard","id":1006091,"name":"Storm of the Century","overview":"The town of Vernonia is declared a disaster area as the worst storm in 25 years pounds the Oregon coast. Members of Pihl and Stump Branch are forced to flee. Jay Browning can't be found. Darrell must act fast to save his house from falling trees as the town of Astoria descends into a blackout. The future of the logging industry is in jeopardy.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-06-01","episode_number":12,"episode_type":"standard","id":1006093,"name":"Picking Up the Pieces","overview":"The loggers try to put the storm behind them, so they can get back to work; Darrell makes a discovery that startles the crew; Jay struggles to motivate his crew without phone service; the Pihl crew comes to the rescue of one of its own.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-06-08","episode_number":13,"episode_type":"finale","id":1006094,"name":"The Final Haul","overview":"The loggers toughest season begins to wind down; Jesse begins to wonder about the family business; rumors begin to spread, to the other crews, that the Gustafson crew is pulling out.","production_code":"","runtime":60,"season_number":1,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":62488,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5407f7f2c3a36858180008de","air_date":"2009-03-02","episodes":[{"air_date":"2009-03-02","episode_number":1,"episode_type":"standard","id":1006095,"name":"Ax Men Cometh","overview":"J.M. Browning and Pihl Logging are joined by two new teams of newcomers, Rygaard Logging and S&S Aqua Logging, in a race to see which team can cut down the most timber in the year's most dangerous season.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-09","episode_number":2,"episode_type":"standard","id":1006096,"name":"Initiation Day","overview":"After just starting the race, men from the groups begin quitting; Jay Browning's big financial gamble shows that it won't pay out; the Aqua Logging crew attempts to reel in what could be a once in a lifetime catch.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-16","episode_number":3,"episode_type":"standard","id":1006097,"name":"\"By Air, Land and Sea\"","overview":"A helicopter logging company makes it's presence know in the competition; Dustin tries to convince his father into returning to Pihl Logging; a member of the Rygaard team must face his fear when he has to climb a 100-foot tall tree; Jimmy and James watch their prized log fall through their hands.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-23","episode_number":4,"episode_type":"standard","id":1006098,"name":"Moby Dick Strikes","overview":"R&R Conner Aviation have to make a decision to either keep their workers safe or to amp up production; Jimmy and James battle a deadhead log known as \"Moby Dick.\"","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-30","episode_number":5,"episode_type":"standard","id":1006099,"name":"The King Crumbles","overview":"A member of the Rygaard crew fights to save his job; Jimmy heads into minefield laced waters; the pilot from R&R gets trapped in fog.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-13","episode_number":6,"episode_type":"standard","id":1006100,"name":"Lost in the Fog","overview":"A helicopter is trapped when a fog rolls over a mountain; Jimmy's barge is threatened to be destroyed; and a crew of a downhill logging site faces challenges.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-20","episode_number":7,"episode_type":"standard","id":1006101,"name":"One Weak Link","overview":"Jimmy discovers a once-in-a-lifetime log, as the Pihl Logging team is challenged by formidable lumber. Also, the helicopter's team finds their weak link in their operation, the new pilot.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-27","episode_number":8,"episode_type":"standard","id":1006102,"name":"The Ax Falls","overview":"The bosses weigh through some tough decisions concerning the new guys, and one greeenhorn will be released.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-04","episode_number":9,"episode_type":"standard","id":1006103,"name":"Fresh Meat","overview":"The crews receive some new loggers. Then, a search is conducted when a cutter disappears. Also, tempers flare among the aqua loggers.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-11","episode_number":10,"episode_type":"standard","id":1006104,"name":"Clash of the Titans","overview":"A new pilot endangers the helicopter when he becomes reckless. Bad weather delays the aqua loggers; and a greenhorn attempts to prove himself.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-18","episode_number":11,"episode_type":"standard","id":1006105,"name":"The Reckoning (1)","overview":"The crews rush to meet their goals as logging season nears it's end, and one logger is let go.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-18","episode_number":12,"episode_type":"finale","id":1006106,"name":"The Reckoning (2)","overview":"The season two finale finds a fight erupting within one crew. Elsewhere, Jimmy has trouble with his barge, and a pair of crews are facing disasters.","production_code":"","runtime":60,"season_number":2,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"Two of Oregon's top logging companies from last year, J.M. Browning Logging of Astoria and Vernonia's Pihl Logging returns. Adding to the competition are three newcomers, each bringing something different to the table. Rygaard Logging of Port Angeles, Washington, a fiery father-son team; R&R Conner Aviation of Conner, Montana, which utilizes helicopters to maximize its output; and S&S Aqua Logging of Aberdeen, Washington, a team of diving loggers who fish for timber in some of the Pacific Northwest's most treacherous waters.","id":62489,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"5407f7f3c3a368581e0008e7","air_date":"2010-01-10","episodes":[{"air_date":"2010-01-10","episode_number":1,"episode_type":"standard","id":1006107,"name":"Ax to Grind","overview":"The third-season opener introduces new locations as crews begin work in the summer. In addition to sites in the Pacific Northwest, loggers will battle the terrain and heat of Florida and Louisiana.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-17","episode_number":2,"episode_type":"standard","id":1006108,"name":"Deeper into the Swamp","overview":"Greenhorns are tested by Rygaard; Jay Browning hires a new yarder operator; and an argument brews between two members of the Pihl crew.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-24","episode_number":3,"episode_type":"standard","id":1006109,"name":"Diving for Dollars","overview":"Jimmy and James arrive in Florida and realize that the challenges are tougher than they expected; Rygaard runs into problems when a cable snaps; and Browning learns that rapid production has a high price.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-31","episode_number":4,"episode_type":"standard","id":1006110,"name":"Boiling Point","overview":"Mistakes at Browning threaten the safety of the loggers; the Rygaard greenhorns receive an ultimatum; Melvin and Leland compete for the yarder seat; and Jimmy has a dangerous first dive.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-14","episode_number":5,"episode_type":"standard","id":1006111,"name":"Surviving the Swarm","overview":"Melvin endangers other crew members with his recklessness; Jimmy has an encounter with an alligator; Shelby battles debris caused by Hurricane Katrina; and Jay Browning collapses while working.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-21","episode_number":6,"episode_type":"standard","id":1006112,"name":"Showdown","overview":"Tempers erupt, especially among the Pihl loggers; Jay Browning suffers shock from an allergy; and a Rygaard greenhorn is let go.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-28","episode_number":7,"episode_type":"standard","id":1006113,"name":"Chopping Block","overview":"Loggers are fired, and one disappears; Shelby takes a risky job searching for a sunken raft of logs; and Jay Browning gets some bad news.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-07","episode_number":8,"episode_type":"standard","id":1006114,"name":"Assault by Air","overview":"The loggers struggle to get back on track after losing a man. At Browning, a weak cable threatens to kill half the crew, while the only remaining greenhorn at Rygaard is in the line of fire during a log-alanche. Shelby's camera crew gets lost in the swamp overnight. In Florida, Jimmy and James set out alone and score the season's first big catch. And, Conner Aviation returns to face the most dangerous heli-logging job of their career.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-14","episode_number":9,"episode_type":"standard","id":1006115,"name":"Crash and Burn","overview":"Shelby's desperate dash for cash is halted when he crashes in the swamp. A monster gator stalks the S&S boys, pushing Jimmy to his breaking point. At Rygaard, Gabe competes against his own team and at Browning, Jay recruits DJ and Cody for a dangerous environmental mission. At Conner, a giant load breaks the belly hook off the chopper, grounding the heli-loggers.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-21","episode_number":10,"episode_type":"standard","id":1006116,"name":"Curse of Kalina","overview":"Jimmy and James come face-to-face with the 12-foot gator that has stalked them for weeks. In the swamps of Louisiana, Shelby goes solo on a challenging mission. At Rygaard, greenhorn Dave disappears and at Browning, a string of setbacks makes Jay question if the Kalina job is cursed. The rookie pilots at Conner get the ride of their lives.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-04","episode_number":11,"episode_type":"standard","id":1006117,"name":"End of the Line","overview":"Dave persuades Gabe to give him one last chance at Rygaard, but a careless error puts Craig on the verge of firing him; Jimmy's desperate decision to snatch a log already marked by the other Collins crew has Joe questioning his ethics; Swamp Man tries to pull a massive log from Lake Pontchartrain and stay ahead of both a fierce storm and a buyer's deadline; Josh and Kevin get their first practice at dropping cargo to the Conner ground crew; as Browning pulls in the last loads from its current job, Jay tells the crew that he has no new work lined up and must send them home.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-11","episode_number":12,"episode_type":"standard","id":1006118,"name":"Eleventh Hour","overview":"Craig storms off the Rygaard site and Dave fails to show up, leaving Gabe to manage a shorthanded crew alone; after Jimmy's log-poaching last week, James goes out on the Suwannee by himself to hunt timber with Collins' other crew; when Jesse secures a new job for Browning, Jay brings in every available crew member to put wood on the ground; as Swamp Man makes a second try for the huge log stuck in Lake Pontchartrain, Shelby's old hernia flares up and sends him to the hospital; Josh and Kevin each make an actual heli-logging run, after which Bart evaluates their performance and hires Josh to fly for Conner.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-18","episode_number":13,"episode_type":"finale","id":1006119,"name":"King of the Mountain","overview":"It's an all-out fight to the finish for Browning and Rygaard, as Gabe mounts a last minute surprise comeback. Shelby vows revenge on the lake log, and at Conner, it's up to the junior pilot to save the season. In Florida, it's the end of the road for Jimmy, but Joe Collins makes James an offer he may not be able to refuse.","production_code":"","runtime":60,"season_number":3,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"The loggers work during the dead heat of summer, with stakes that are higher than ever. In the rugged mountains of the Pacific Northwest, industry titan J.M. Browning Logging, reigning champion Rygaard Logging and underdog Pihl Logging vie for the title \"King of the Mountain.\" But this year, they are only half of the story: S&S Aqua Logging heads to Florida in search of new beginnings; R&R Conner Aviation, the Montana-based helicopter logging firm, must find a new ace pilot; and, for the first time, we wade into the swamps of Louisiana to meet a man unlike any other, Shelby Stanga, and explore the fascinating business of swamp logging.","id":62490,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"5407f7f5c3a36858180008e4","air_date":"2010-12-12","episodes":[{"air_date":"2010-12-12","episode_number":1,"episode_type":"standard","id":1006120,"name":"Alaska","overview":"The fourth season of Ax Men returns and this year, the stakes are higher than ever. Father-and-son team Craig and Gabe Rygaard are back to take down reigning top dog J.M. Browning... but newcomer Papac Logging is gunning for both of them. Braving a remote island off the coast of Alaska, these guys play by their own rules and will stop at nothing to conquer one of America's final frontiers. Pihl Logging also returns, this time with a secret weapon whose arrival shocks the entire crew. While the mountain's top dogs battle it out in the northwest... in the other corner of the country, the aqua loggers also return. Jimmy Smith is back to reclaim his son and challenge rival Collins to a Log-Off in the black waters of the Suwannee River, while swamp logger Shelby Stanga is on a mission to find an assistant in the backwoods of Louisiana. It's the start of the most explosive season yet in the race to get the country's green gold and get out alive.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-19","episode_number":2,"episode_type":"standard","id":1006121,"name":"Sink or Swim","overview":"Rygaard tries to tame two monsters at the same time--the super-juiced Mean Bean and the downhill site on which it's deployed. Pihl's greenhorn must prove herself to the crew but a deadly mistake could cost her everything. Jimmy encounters trouble on his way to the river. Shelby and his new assistant take drastic measures to unearth a monster log. And at Papac, tempers boil over, sending one man running for the hills.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-26","episode_number":3,"episode_type":"standard","id":1006122,"name":"Day from Hell","overview":"On the edge of America's final frontier, it's every logger's worst nightmare: one of Papac's men has disappeared into thin air. Logging country is rattled to its core when logger Van Huffman goes missing in Alaska's remote wilderness. But when Papac's crew braves the harsh terrain and weather that batters Suemez Island, they find many reasons for concern and few for hope. Down south, the mountain's newbies are in hot water. At Pihl, Leah creates an upender that threatens the entire crew and at Rygaard, Dave's \"work ethic\" meets Craig's wrath. In Louisiana, Shelby messes with a lethal dose of TNT that could sink him and his swamp friends for good, while the Collins crew lands on the wrong end of a runaway boat.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-02","episode_number":4,"episode_type":"standard","id":1006123,"name":"Manhunt","overview":"At Papac Alaska, time is running out for missing logger Van Huffman. At Rygaard, Gabe gambles on a helicopter... and loses. At Pihl, rigging slinger Eric Davis is rushed to the hospital after a gruesome fall. In Louisiana, Shelby pulls an all-nighter to save his dog P* Willy. And in Florida, Collins puts the Smith boys in their place.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-09","episode_number":5,"episode_type":"standard","id":1006124,"name":"Battle for Survival","overview":"It's a battle for survival in logging country. In Bayou country, Shelby's nighttime mission brings him face-to-face with an alligator. In Florida, Jimmy and James push their luck to get one of the biggest logs in the Suwannee. At Rygaard, Dave goes down with an injury, while at Papac Alaska, the Colonel goes out in a blaze of glory. The tides are turning in logging country... and after tonight, nothing will be the same.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-16","episode_number":6,"episode_type":"standard","id":1006125,"name":"Judgment Day","overview":"Logging country is turned upside down when one of the mountain's best bows out. At Papac, the men suffer under the reign of a new yarder operator. At Rygaard, it's machinery gone wild when a half-baked plan goes bad and threatens to take out a fellow man. In Florida, Jimmy and James are hunted by a venomous snake, while in Louisiana, Shelby is hunted by an old foe.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-23","episode_number":7,"episode_type":"standard","id":1006126,"name":"Under Fire","overview":"Logging country is teetering on the edge. At Rygaard, Gabe lands on the wrong end of a volatile log pile. At Papac Alaska, Coatsy risks sending their million-dollar yarder over the edge of a steep cliff. Down south, Shelby Stanga dodges gunfire on the Louisiana bayou, and in Florida, James Smith walks out on his father.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-30","episode_number":8,"episode_type":"standard","id":1006127,"name":"Overboard","overview":"Ax Men is hitting the freezing waters of southeast Alaska when a new tug boat company enters the fold. Charged with towing Papac Alaska's million-dollar payday to the mill, this veteran crew is getting a new addition: former Pihl hothead Dustin Dethlefs. At Papac Alaska, Coatsy faces competition when a former rigger returns. At Pihl, the new greenhorn leaves a lot to be desired. In Florida, Jimmy Smith goes it alone, and at Rygaard, Craig goes over Gabe's head in an attempt to push chaser Dave Schroeder out.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-13","episode_number":9,"episode_type":"standard","id":1006128,"name":"Lock & Load","overview":"At Rygaard, Craig's secret weapon arrives with a bang... but the crew's welcome of the new guy is far from warm. In Florida, Collins and Smith go log-for-log as both teams take a run at the lead in the Log-Off. At Olson, a broken log raft requires quick thinking from greenhorn Dustin Dethlef. At Papac Alaska, Joe and Coatsy face-off in a log rolling competition, and in Pihl country, a dangerous thinning site and temperamental equipment are a deadly combination for the rigging crew below.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-20","episode_number":10,"episode_type":"standard","id":1006129,"name":"Fallout Zone","overview":"As the season reaches the halfway mark, logging country is feeling the pressure. In Florida, Swilley gets hooked in a pile of rusty metal while Jimmy and James ride a wave of high times. At Rygaard, Gabe puts his entire crew on the line when he decides to fall standing trees from directly under the skyline. In Oregon, Pihl's greenhorn lands on the wrong end of a 2,000-lb falling tree, and in bayou county, Shelby launches a dangerous nighttime mission in a part of the swamp known as \"Alligator Alley\".","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-27","episode_number":11,"episode_type":"standard","id":1006130,"name":"Tipping Point","overview":"Logging country is coming unglued. Rygaard is a war zone when the battle between chasers threatens to tear apart the entire crew. At Papac Alaska, Joe and Coatsy let the fists fly. In Florida, Jimmy suffers a season-ending injury. In the swamp, Shelby Stanga pushes his Log Dog past the tipping point... and for Pihl, the end is sooner than they think.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-06","episode_number":12,"episode_type":"standard","id":1006131,"name":"King of the Hill","overview":"In this episode of Ax Men, it's out with the old, in with the new. King of the Mountain J.M. Browning returns with son Jesse leading the charge. At Rygaard and Pihl, both companies face season-ending crises. In Florida, James hires a new deckhand but takes a serious blow to the head...and in Cajun country, Shelby's got a new toy.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-13","episode_number":13,"episode_type":"standard","id":1006132,"name":"Fraying at the Edges","overview":"While the competition between American loggers is more heated than ever... up north, there's a new game in town. Canadian top dogs Lemare Lake Logging are facing one of the toughest jobs of their career--a remote patch of land accessible only by boat. But when a major piece of equipment goes down, it threatens to end their season before it ever gets going. Down south, Browning's punishing pace comes at a price. In Alaska, rivals Joe and Coatsy settle their differences with an old school ax-chopping competition. In Florida, Joe Collins conjures up the spirits of the Suwannee, and in the backwaters of the bayou, Shelby's putting his swamp buggy to work.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-20","episode_number":14,"episode_type":"standard","id":1006133,"name":"This Means War","overview":"From coast to coast, logging companies are willing to do anything to stay on top. At Browning, the crew gambles on a slipping skyline. In the bayou, Shelby puts his swamp buggy to the test pulling one of the biggest logs of the season. At Rygaard, Craig mounts an assault to get rid of Dave. In Florida, Joe Collins takes the plunge into the black waters of the Suwannee while S&S tries to regroup with the help of local deckhand Casey Roberson. And in Canada, Lemare receives devastating news that could end their season before it ever gets going.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-03","episode_number":15,"episode_type":"standard","id":1006134,"name":"The Mouth from the South","overview":"There's a new crop of loggers in Ax Men country... but fitting in with the old guard ain't easy. In Louisiana, a beauty queen quickly pushes all of Shelby's buttons at once. At Lemare, Steve and the greenhorn butt heads that ends with one of them quitting. In Florida, S&S's newest deckhand gets more Jimmy Smith than he can handle. At Papac Alaska, Joe and Coatsy get a chance to bury the hatchet... but at Rygaard, the bad blood between Craig and Dave is worse than ever and is on the verge of tearing the crew apart.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-10","episode_number":16,"episode_type":"standard","id":1006135,"name":"Blast Off","overview":"From Canada to Louisiana, desperate times call for desperate measures. At Lemare, a washed out road threatens to trap their logs on the landing... until Gord decides to blast half the mountainside to make new gravel. At Rygaard, Gabe's got a surprise for his crew to put them back on track, while in Oregon, Jay Browning has a close call with a barberchair. In Louisiana, Shelby's bringing in a surprising new assistant: his wife Donna. And in Florida, Joe and Swilley hook a bigger log than they can handle and end up sinking their boat in the process.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-17","episode_number":17,"episode_type":"standard","id":1006136,"name":"Man Down","overview":"As the logging season winds down, the pressure to produce, heats up. In Alaska, a family emergency takes Mark from the yarder seat and with no time for a shut down... Papac calls on the only guy with experience running the massive machine: Joe Linderborg. Meanwhile the men of Rygaard are feasting at the Honey Hole, pulling big wood and riding high. Down south on the Suwannee, Jimmy and James try to close the gap in the Log-Off while Joe and Swilley just try to get back on the water. And in the Louisiana bayou, a ghost threatens to derail Shelby.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-24","episode_number":18,"episode_type":"standard","id":1006137,"name":"Final Countdown","overview":"It's time to finish the season strong. In Florida, the Log-Off is locked in a dead heat, and with Joe and Swilley sidelined after sinking their second boat, Jimmy and James are poised to take the top spot. Swamp man Shelby Stanga's log buyer is due in the morning, but a bite from a water moccasin may kill his plans for success. At Rygaard, Craig kicks Dave off the landing, but one moment of inattention could be the end for former chaser. At Browning, the crew battles a patch of tangled timber, and north of the border, the men of Lemare are racing to stay ahead of winter storms that could shut them down at any time.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-01","episode_number":19,"episode_type":"standard","id":1006138,"name":"Fever Pitch","overview":"Across logging country, the final push begins. At Papac, Joe Linderborg's reign on the yarder has everyone running scared. At Browning, Jay receives devastating news that could mean the end of his career. On the Suwannee, S&S and Collins almost come to blows over a pair of logs. In the swamp, Shelby mounts his final and most important mission of the season--saving his Log Dog. And at Rygaard, one chaser blows up and bows out of the competition for good.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-08","episode_number":20,"episode_type":"finale","id":1006139,"name":"Down To The Wire","overview":"It's the final week of Ax Men, and as the clock counts down, tempers heat up. In the bayou, Shelby races to raise his rig before offshore storms force the end of the season. In Florida, S&S and Collins cash in on the season's take... but for these bitter rivals, it's not over until it's over. At Lemare, Gord rushes to deliver a season's profit to the mill in time. And at both Papac and Rygaard, last minute gambles backfire and push the race to become King of the Mountain to the final seconds of the season.","production_code":"","runtime":60,"season_number":4,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"Father-and-son team Gabe and Craig Rygaard return to battle their nemesis, reigning \"King of the mountain\" J.M. Browning. But this year, the crews from Washington and Oregon have more than each other to worry about - there's been a changing of the guard at Pihl Logging as Leah Proctor, a female greenhorn, is brought on to keep the men on their toes. Newcomers Papac Logging of Alaska and Lemare Logging of British Columbia are also throwing their hats into the ring. These companies specialize in conquering the rugged Pacific wilderness, as far removed from civilization as one can get. Each morning, Papac crews load into boats that take them across miles of the roughest water in Alaska. On the other end is Suemez Island, one of the most difficult jobs Papac has ever attempted. Down south, \"Swampman\" Shelby Stanga is back and his sights are set on the biggest logs in the Louisiana bayous. But to claim them, he'll need help from a crew of sidekicks as colorful as he is. In Florida, James Smith and the S&S Aqua/Collins crew return to do battle on the Suwannee River. Rounding out the water logging crews is newcomer Olson Marine, a unique tugboat operation in Alaska that transports millions of dollars in timber through hundreds of miles of the most violent waters and unpredictable weather in the world.","id":62491,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"5407f7f7c3a36858250008b0","air_date":"2012-01-08","episodes":[{"air_date":"2012-01-08","episode_number":1,"episode_type":"standard","id":1006141,"name":"Ax Is Back","overview":"It's a new season of Ax Men and a new battle for \"king of the mountain.\" Papac returns as reigning king of the mountain, but the stress of maintaining the title pushes hook tender Coatsy over the edge. Rygaard's dangerous blowdown site fights them at every turn. Shelby Stanga needs to start this season strong, but a gruesome accident puts him dead in the water. Veteran Pihl cutter Levi Brown breaks out on his own, and a new yarder company joins the competition. S&S logging returns to Florida to log against new rivals, but infighting trumps the competition.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-15","episode_number":2,"episode_type":"standard","id":1006142,"name":"Damage Control","overview":"Swamp Man Shelby Stanga is hired to remove a log from private property, but complications lead to disaster. Infighting reaches a fever pitch at S&S Aqua Logging, while the competition has a run-in with Mother Nature. A familiar face returns to Papac, much to Coatsy's dismay. Gabe Rygaard takes Dave out cutting, but things go awry. And the rookies of Big Gun Logging are adding to their ranks.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-22","episode_number":3,"episode_type":"standard","id":1006143,"name":"No Pain, No Gain","overview":"Jimmy Smith is smitten with his new assistant, while rivals Uncle Buck and Swilley push their equipment to the breaking point. Shelby Stanga scouts his newest log order with his darling wife Donna. Big Gun Logging faces an uncertain future when owner Levi Brown is admitted to the hospital. And at Rygaard and Papac, the chainsaws bite back.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-29","episode_number":4,"episode_type":"standard","id":1006144,"name":"Hell Hole","overview":"At Papac Alaska, the site is turned upside down when the yarder operator walks off in the middle of the day. In Florida, Swilley's determination to beat S&S in the Suwannee River Log Off leads to a life threatening mistake. With their leader still in the hospital, Big Gun Logging loses control of the Ole Keasy site. At Rygaard, the rigging crew is learning safety lessons the hard way. And in the swamp, the bigger they are, the harder they fall.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-12","episode_number":5,"episode_type":"standard","id":1006145,"name":"Cowboy Up","overview":"Start-up outfit Big Gun Logging hits a snag as their deadline approaches. In Florida, Buck & Swilley make a run for the lead in the Log-Off while Jimmy deals with a crew crisis. Shelby Stanga enlists the help of a voodoo team to get his cousin's ghost under wraps. In Washington, a string of accidents on Craig's watch threatens to shut down the site. And in the mountains Montana, a new company joins the ranks of the Ax Men, forcing everyone to \"cowboy up!\"","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-19","episode_number":6,"episode_type":"standard","id":1006146,"name":"Fists of Fury","overview":"It's a fight to the death between Shelby Stanga and a massive standing tree. At Rygaard, the bad blood between Dave and Fernando boils over. In Alaska, Papac's men are on the run when two machines get tangled up while in Florida, Buck and Swilley raise the stakes. And in Montana, the newcomers from Siderius Logging are gambling on life and limb.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-26","episode_number":7,"episode_type":"standard","id":1006147,"name":"Wake-up Call","overview":"Shelby Stanga takes his newest assistant loggin' and froggin'. In Montana, young Siderius cutter Travis earns his stripes when he's forced into a deadly situation. The father and son team of S&S hits bottom, then hits gold. In Washington, a close call puts an end to the infighting, and at Papac, Joe lets loose.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-04","episode_number":8,"episode_type":"standard","id":1006148,"name":"Out of Control","overview":"When a back injury puts Danny out of action on Big Gun's new job, Levi starts trying out two greenhorns, Josh and Ryan; turns of massive logs bring a widow maker down on the Papac camera crew and threaten to rip out the new tail hold; Shelby and another cousin fight bumblebees and underwater wildlife in search of valuable timber for Swamp Man's latest order; after Rygaard's heavy-duty carriage breaks loose and hurtles all the way down the skyline, Gabe gets in an argument with Craig and storms off the site; Jimmy kicks James off the S&S boat again and works alone while dodging speedboating locals; as Uncle Buck chases down the pieces of a 300-year-old sunken raft, Swilley gets pinned at the bottom of the Suwannee.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-11","episode_number":9,"episode_type":"standard","id":1006149,"name":"Rygaard vs. Rygaard","overview":"Unable to see eye to eye, Rygaard runs two yarders side by side, doubling their production but increasing their odds of making errors. Meanwhile, Jimmy and James Smith are tired of fighting and look to an anger management counselor for help.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-18","episode_number":10,"episode_type":"standard","id":1006150,"name":"Down & Dirty","overview":"The season hits the halfway mark, and everyone is upping his game. In the swamp, Shelby and cousin Belinda are under the gun to find a huge Cypress. In Florida, S&S hires a new diver but says goodbye to an old one. In Montana, the cowboys of Siderius must break in their greenhorn without breaking him for good. And at Rygaard, two yarders bring in twice the wood and twice the trouble.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-25","episode_number":11,"episode_type":"standard","id":1006151,"name":"Let 'Er Rip","overview":"As the season moves on, everyone's going to greater lengths to stay on top. At Papac, an accident sends one man over the edge of the landing. In horse country, the loggers take to new heights in order to get the final tree of the job on the ground. At Siderius, greenhorn Jesse Kelleher is in need of redemption. And in the bayou, the swamp man gets into a shootout with another logger who's after Shelby's profits.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-01","episode_number":12,"episode_type":"standard","id":1006152,"name":"Burning the Bear","overview":"In the swamp, the battle between Shelby Stanga and his nemesis Richard comes to a head. On the river, Buck and Swilley's boat goes boom. At Big Gun, one of their greenhorns shows his dark side. And at Papac, Joe and Coatsy bury the hatchet.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-08","episode_number":13,"episode_type":"standard","id":1006153,"name":"Where's Willy?","overview":"On the mountain, Gabe's two-yarder plan goes further off track when one crew member defects to the other team. Big Gun races their tightest deadline yet, while in Alaska, Joe and the new guy get into it. On the river, an accident could take S&S out of the Log-Off for good, and in the swamp, Shelby's trusty assistant Willy goes missing.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-22","episode_number":14,"episode_type":"standard","id":1006154,"name":"Falling Apart","overview":"From Alaska to the bayou, the hits are coming fast and hard. At Rygaard, a crew shakeup leaves everyone scrambling. In Florida, the tides are turning as S&S suffers a blow while Buck & Swilley get unexpected help from James. In Alaska, Papac takes to the open seas for a fishing trip, while, Big Gun must bring in a new yarder operator to have a chance at conquering their dangerous downhill site. And in the swamp, an accident may cost Shelby another one of his assistants.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-22","episode_number":15,"episode_type":"standard","id":1006155,"name":"Up in Flames","overview":"As the season enters the homestretch, everyone is risking more to stay on top. Jimmy Smith braves the depths of the Suwannee River for the first time in three years, but his fears may get the better of him. In the swamp, Shelby also takes on an old enemy--the log that flipped his winch last season. In Montana, the boys of Siderius are playing fast and loose, while at Rygaard, the crew pushes their yarder to the brink of disaster.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-29","episode_number":16,"episode_type":"standard","id":1006156,"name":"Family Rivalry","overview":"At Rygaard, Gabe's two yarder sides are reunited, but the infighting that's plagued them all year is worse than ever. In Florida, the alliance between Team Buck and James Smith comes to a bitter end. At Papac, Joe's hard-yarding style sends the rigging crew running for cover. In the swamp, Shelby Stanga won't stop until he gets his revenge. And in New Hampshire, two new teams of ox loggers enter the race.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-06","episode_number":17,"episode_type":"standard","id":1006157,"name":"Swamp Gold","overview":"Shelby stumbles upon something of potentially great value in the swamp; Craig and Wayne prank Dave in Washington; personality clashes in New Hampshire lead to ox-logger walk-offs; and James returns to S&S on the Suwannee.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-13","episode_number":18,"episode_type":"standard","id":1006158,"name":"Up in Smoke","overview":"Shelby searches for gold in Lake Pontchartrain; a log-off in Florida goes to sudden death; and a potentially disastrous mistake occurs at Big Gun.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-20","episode_number":19,"episode_type":"standard","id":1006159,"name":"Betting It All","overview":"From Alaska to Florida, one of the toughest seasons on record is almost over. At Papac, pushing hard pushes Joe to his breaking point, while at Rygaard, Dave has officially worn out his welcome. On the Suwannee, the teams are fighting to win the final round of the Log-Off, but a season's worth of bad blood between Jimmy and James comes to a head. In Louisiana, the Swamp Man gambles on a helicopter to search for a multi-million dollar sunken log raft.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-20","episode_number":20,"episode_type":"finale","id":1006160,"name":"The Ax Stops Here","overview":"It's the nail-biting conclusion of the race to be crowned King of the Mountain. While Papac battles to bring their yarder operator back from the brink, Craig Rygaard forces Gabe to choose between him and Dave. At Big Gun, Levi drops a bomb, while in the swamps of Louisiana, Shelby's in a desperate race to find swamp gold. And in Florida, the Great Suwannee River Log-Off comes to a close, but when Jimmy doesn't like the results, he takes matters into his own hands.","production_code":"","runtime":60,"season_number":5,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":62492,"poster_path":null,"season_number":5,"vote_average":0},"6":{"_id":"5407f7f8c3a368582c00085b","air_date":"2012-12-09","episodes":[{"air_date":"2012-12-09","episode_number":1,"episode_type":"standard","id":1006161,"name":"All or Nothing","overview":"An all-new season of Ax Men starts with a bang. Swamp Man Shelby Stanga is in search of a million-dollar payday, but nemesis Richard is hot on his trail. In Florida, S&S Aqua Logging gets a new captain, but a rocky first day signals trouble on the horizon. In the northwest, reigning King of the Mountain Rygaard Logging returns with a surprising new addition, and in Alaska, the rowdy boys of Papac Alaska begin another season battling the toughest terrain in the country.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/jt237QP7RuIJawYfUa3XFfyFBYn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-16","episode_number":2,"episode_type":"standard","id":1006162,"name":"We're Not Alone","overview":"The season has only just begun, and already, things are off to a rough start. In Alaska, Joe Linderborg is back in the yarder seat and the whole crew is paying the price. At Rygaard, DJ comes face-to-face with Craig after two years and the reunion isn t a happy one. In the swamp, Shelby and niece Stephanie stumble into a wasp s nest, and in Florida, S&S realizes they aren t alone on the Withlacoochee River.\n\nTVPG","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/9mzbfdPc3r2MQZL4SYTeKFTJ14.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-23","episode_number":3,"episode_type":"standard","id":1006163,"name":"Sabotage","overview":"It s week three and logging country is falling apart. In the swamp, Shelby must rely on niece Stephanie and cousin Belinda to do his dirty work. At Rygaard, the rigging guys formulate a plan to get rid of DJ. In Alaska, wild man Joe Linderborg takes it out on a choker-setter, and in Florida, James must cope with his dad s health issues while also leading his crew.\n\nTV14 D-L","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/5rJ0PmTm5Xqjb1TVnJFdpQy8WQh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-30","episode_number":4,"episode_type":"standard","id":1006164,"name":"Put Up or Shut Up","overview":"As the season picks up speed, not everyone can keep up with the pace. At Rygaard, odd man out DJ Jeremiah is pushed to his breaking point. In Alaska, Coatsy boots Joe Linderborg from his seat in the yarder, but the consequences could prove deadly. In Florida, The Dreadknots find themselves on the wrong end of a falling log, and in the swamp, Shelby and his assistants fight to claim the biggest Cypress of the season.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/omd5RCIcpD32c4LtddJG071jAK4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-06","episode_number":5,"episode_type":"standard","id":1006165,"name":"Cage Match","overview":"Tempers have reached a fever pitch in logging country. At Rygaard, three years of tension between Craig and DJ comes to a head. In the swamp, the Swamp Man is on a special mission for wife Donna. At Papac, the end of the North Thorn site may mean the end of their season. And in Florida, the Dreadknots are in the line of fire, while Jimmy Smith takes a final ride down the river.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/odsSqzJQwdGsMYJxaXx1ktFkX9q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-13","episode_number":6,"episode_type":"standard","id":1006166,"name":"Flipping Logzilla","overview":"In Louisiana, the Swamp Man targets a money log, but it s in dangerous territory. At Rygaard, DJ gets put on notice, while in Florida, Brad and Swilley struggle to keep S&S from running off the rails. And from Canada, a new company is about to give them all a run for their money.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/a9TstYC0FzW5sWWNNGPOuwTvGkE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-20","episode_number":7,"episode_type":"standard","id":1006167,"name":"Rock Slide","overview":"Tempers are on the rise across logging country, and some are pushed to their breaking point. At Rygaard, Gabe faces a crew mutiny. At Lemare, the guys put their chaser to the test logging on a rock slide. In the swamp, Shelby and Belinda take to the open road to bring home a money log, and in Florida, James Smith lashes out against his own crew.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/dlkdAc2OgEpf2EBMBDIKBzCM9fV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-27","episode_number":8,"episode_type":"standard","id":1006168,"name":"Shelby's New Toy","overview":"As the season gets more competitive by the week, it takes more than ever to stay on top. In Louisiana, Shelby is building his new empire one big toy at a time. In Florida, the men of S&S Aqua Logging deal with last week s fallout. In Washington, DJ suffers an injury that could take him out of the season, and from the Midwest comes a whole new kind of logging.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/hN4MwDIt59JlZjp69TppXUQ1zZM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-10","episode_number":9,"episode_type":"standard","id":1006169,"name":"Gators & Hand Grenades","overview":"In Florida, the Dreadknots come face-to-face with one of the most fearsome creatures in the river, while over in the swamp, Shelby and Donna are putting his new paddle barge to work. In Washington, DJ returns to work but faces another battle with Craig. And in Wisconsin, the Woodchucks are pushing hard to meet their deadline, but dangerous shortcuts could bring the whole operation down.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/8Vw2ZgJKW6J4bqGyJdH6NBEoUU5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-17","episode_number":10,"episode_type":"standard","id":1006170,"name":"Goldmine","overview":"In the swamp, Shelby puts his new toys to work and discovers a huge payday right in his own backyard. At Rygaard, runaway logs send Craig over the edge, while in Montana, Joe and Coatsy strike out on their own. In Wisconsin, the Woodchucks battle a crumbling wall and in Florida, Jimmy Smith says goodbye.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/nxVsd8RqL21Z5poLfQPba084iR9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-24","episode_number":11,"episode_type":"standard","id":1006171,"name":"The Hurricane Hits","overview":"When Hurricane Isaac hits the bayou, Shelby Stanga must race to save his logging empire and neighbors. At Rygaard, a string of crew meltdowns sends the site into chaos. In Florida, Brad and Swilley struggle to get S&S back in the Log-Off after losing their captain. In Canada, Lemare faces an equipment breakdown that could end their whole season, and in Wisconsin, a major accident at the Woodchucks causes the site boss to quit.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/mP0exfsLJPhVDMRJs71xAG6qIci.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-07","episode_number":12,"episode_type":"standard","id":1006172,"name":"Calling it Quits","overview":"In Louisiana, the Swamp Man attempts a daring rescue of his aging relatives from the rising storm waters. In Wisconsin, the Woodchucks don't make their deadline and their company hangs in the balance. S&S finally hits a honey hole with the help of Swilley's \"brother from another mother.\" And In Canada, Hook tender Mike has finally had enough and calls it quits on Lemare.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/n6oHQoRT2rhO4KtW7YDtcvgil09.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-14","episode_number":13,"episode_type":"standard","id":1006173,"name":"The Aftermath","overview":"At Rygaard, Gabe is desperate to fill out his shorthanded crewand brings in someone very unexpected. In Florida, S&S' bad luck streak continues when they wreck their boat and get into a fight with the Dreadknots. Joe and Coatsy start roadbuildingto catastrophic results, and then come up with a new plan to start their own company. And The Swamp Man tries to assist his neighbors and relatives in the aftermath of Hurricane Isaac.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/xZSFR2vqAJ36LN7Cr55LFYNSiJ2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-21","episode_number":14,"episode_type":"standard","id":1006174,"name":"Unlucky Charm","overview":"In the Bayou, Shelby goes on a treasure-hunting mission, and ends up in a race against Belinda. At Big Gun Logging, Jesse's lesson on the whistles almost takes Luke out. On the river, S&S continues to struggle, while the Dreadknots' lucky charm gets destroyed. And at Rygaard, Dave's arrival turns the site upside-down.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/bzEdMFb4WfK9e9AYGqBEFnVy4XN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-28","episode_number":15,"episode_type":"standard","id":1006175,"name":"Slippery Slope","overview":"Shelby finds a legendary old grave site and the crew has an accident. Big Gun has yet another yarder accident and Levi decides to make some major crew changes. Brad and Swilley are the victims of a prank and they lose yet another assistant. Joe and Coatsy are having a tough time keeping steady work, while at Rygaard, Craig and Gabe attempt to bury the hatchet, and Dave is forced to eat some humble pie.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/rvmwflxGlWR6uEmKs8amI9fOXyQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-05","episode_number":16,"episode_type":"standard","id":1006176,"name":"Hell or High Water","overview":"In the Swamp, Shelby tries out a new assistantand meets his match. In Florida, Brad has an MMA title fightand wins himself a new assistant. In Canada, a new, inexperienced hook tender causes major chaos. In Oregon, the entire Big Gun crew heads out to cut the next roadin high winds. And at Rygaard, Craig drops a bomb.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/etJnwTrNx3Yc1B5oHl5AmT2LrOy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-12","episode_number":17,"episode_type":"standard","id":1006177,"name":"The Final Straw","overview":"Shelby is reunited with his old assistant DaVi and together, they go on a mission to help the people of New Orleans. In Oregon, the Big Gun crew is scrambling to finish up the Grindstone site, but a yarder malfunction leads to near-catastrophe. In Canada, the Lemare company is finally pulling the big wood. But site boss Gord gets greedy and loses a load of logs in a dramatic way. And at Rygaard, the new site is proving challenging. And when Craig loses his cool it pushes him to make a shocking decision.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/jz4cQS6IySZCazV9D4iPiqit9WW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-19","episode_number":18,"episode_type":"standard","id":1006178,"name":"Risking it All","overview":"In Louisiana, after Shelby and DaVi have an argument, Shelby makes it up to DaVi by giving him a very unusual gift. In Washington, Gabe Rygaard rushes his crew to finish the site, which leads to careless and dangerous decisions. In Montana, Joe and Coatsy get a jobin Alaskaand have no way to get back. And in Florida, Brad decides to take a risk and dives into a river cave looking for logs, but gets trapped and has to be rescued by his enemies.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/8GgL1NrzHrXkeMtQVaspJkR3aco.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-02","episode_number":19,"episode_type":"standard","id":1006179,"name":"In Too Deep","overview":"In Florida, Brad and Swilley fight against a massive logand lose. Then, when they get back to the landing, they are greeted by a very unexpected guest. The Swamp Man goes gar fishing with his cousin Cheyenne and they find what could be the log raft! At Rygaard, a tight landing is making everyone nervous. But when a loose log tumbles, Craig's reaction takes everyone by surprise. And at Lemare, a terrifying road scares everyone away.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/bKxSDtrAipK1VuBz6IMvC0EAb9t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-02","episode_number":20,"episode_type":"finale","id":1006180,"name":"Fight to the Finish Line","overview":"In the dramatic Ax Men season conclusion, Shelby hits the lake with a squad of assistants to have one last confrontation with Richard. In Florida, the Dreadknots and S&S struggle to pull enough logs to help out their ailing leader, Jimmy. In Canada, Gord's whip cracking doesn't help as their final site offers lethal challenges. And in Washington, Craig Rygaard and the crew push to finish on time, and Gabe has a surprise for his father on his last day as a logger.","production_code":"","runtime":60,"season_number":6,"show_id":15563,"still_path":"/lKd7GEU2QMRDznW0gy5JqrCzbkC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":62493,"poster_path":null,"season_number":6,"vote_average":0},"7":{"_id":"5407f7fac3a368581b0008c3","air_date":"2013-11-10","episodes":[{"air_date":"2013-11-10","episode_number":1,"episode_type":"standard","id":1006181,"name":"Axes and Allies","overview":"An all-new season of Ax Men explodes on to the scene. Swamp Man Shelby Stanga continues his search for the million-dollar log raft but a rough first day and a new opportunity change his mission. In Florida, the Dreadknots have a new deckhand and a new enemy. While in the northwest, last year's King of the Mountain winner Gabe Rygaard returns but this year he's defending his title with a whole new crew and without his dad. While in Alaska, the boys of Papac are back and ready to reclaim the title, but they face a site so treacherous it's considered to be unloggable.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-17","episode_number":2,"episode_type":"standard","id":1006182,"name":"Pain in the Ax","overview":"The season is just beginning, and already, things are off to a rough start. At Rygaard, worried about his son's rocky start, Craig stops by and gets an unwelcome surprise of his own. In Alaska, Joe Linderborg and Mike Coatsy are taking two new greenhorns to school but it's looking like one of them might drop out. In the swamp, Shelby is loosing his assistant, his dog, his jet boat and his mind. In Florida, both Dreadknots and Chapman river teams are fighting just to stay afloat.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-24","episode_number":3,"episode_type":"standard","id":1006183,"name":"Burying the Hatchet","overview":"It's week three and the surprises keep on coming. In Washington, Gabe's king of the mountain title is in the hands of a novice crew, until he gets some help from an unlikely family member. Down in the swamp, Shelby's log buyer stops by for a surprise visit and things aren't looking good for the Swamp Man. On the Withlacoochee, the Kraken and Katelyn find that logging without Capitan Clint might not be as easy as they thought. At Chapman the newest member of the team fights for his life.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-15","episode_number":4,"episode_type":"standard","id":1006184,"name":"Out on a Limb","overview":"It's week four and the season is already running off the rails. On the Olympic Peninsula, Gabe runs a hung-over greenhorn into the ground but Jason disagrees with Gabe's management style. In the swamp, Belinda is too hurt to log so she's brought in a new assistant who almost drowns Shelby's dream of rebuilding his logging empire. Up in Alaska, Mike Papac decides to shake things up and brings in a long time family friend to help in the rigging. The battle for river supremacy rages on in Florida as the Chapman team fights amongst themselves and the Dreadknots divide to conquer.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-15","episode_number":5,"episode_type":"standard","id":1006185,"name":"Swamp Man Sabotage","overview":"The competition is heating up a quarter of the way through the season. Down in the Bayou, Shelby brings in a new assistant, but the logging gets put on hold when the Swamp Man finds that all his equipment has been sabotaged. In the Pacific Northwest, Joe tries to muscle his way through his mistakes but his shortcuts land him in hot water with the boss. In Washington, Gabe's greenhorns aren't living up their potential, and things get heated when Jason oversteps his boundaries and takes matters into his own hands. In Florida, the Dreadknots have their hands full with some surprise help on the boat, while Swilley fights for his place on the boat with the Chapman crew.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-22","episode_number":6,"episode_type":"standard","id":1006186,"name":"Large Barge","overview":"In Cajun country, Shelby has found a huge cash of logs, but to get it, he has to navigate the paddle barge through a narrow canal surrounded by private homes and docks. On the Olympic Peninsula, Gabe goes it alone and risks his own life trying to do too much. Down in Florida, the competition is heating up as the Chapman team discovers someone is poaching their logs and the Dreadknots suffer a crippling injury when Kraken gets his hand caught in a winch. Up in Alaska, Joe is sent to teach new logger Adrienne while topping a tree.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-29","episode_number":7,"episode_type":"standard","id":1006187,"name":"Father Knows Best","overview":"In Washington, Gabe Rygaard is in over his head when a logging legend bails him out of trouble and gets him back in the race for King Of the Mountain. Down in Louisiana, Shelby and old friend Mike Chatellier use brute force to pull two of the biggest logs they have ever seen. With the Kraken injured, the Dreadknots bring in a new diver to brave the muddy waters of the Withlacoochee, but she soon finds out river logging isn't easy. Down on the Saint John's River, the Chapman team is pulling ahead, but a log poacher needs to be caught and Jeter is just the guy to do it.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-05","episode_number":8,"episode_type":"standard","id":1006188,"name":"A Frayed Knot","overview":"The Rygaard family is back on the mountain and firing on all cylinders, until new yarder team Oakes Logging crashes onto the site, challenging Gabe face-to-face for the title of King of the Mountain. Down in the swamp, Shelby and Mike use redneck ingenuity to pull a huge and rare heart-pine log. In Alaska, the Papac team is down a yarder engineer, leaving them no choice but to make reckless Joe the new operator in order to stay in the race. In Florida, the Dreadknots newest diver Erin is finally getting the hang of river logging, but Kraken's fear of another diver taking his place causes a rift with Captain Clint. Meanwhile, the Chapman team gets revenge on a suspected log poacher.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-12","episode_number":9,"episode_type":"standard","id":1006189,"name":"Log Jam","overview":"In the bayou, Shelby goes diving in gator infested waters. Up north, rivals Rygaard and Oakes square off on a one-way road and a Rygaard driver is nearly killed when his truck flips. Down in Florida, the Dreadknots go their separate ways as Kraken and Katelyn set sail with their own boat. And in Alaska, the hottest day of the season gets even hotter for the Papac crew when a fire breaks out on the mountain.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-19","episode_number":10,"episode_type":"standard","id":1006190,"name":"Logger Down","overview":"It's half way through the season and time to go old school. Down in the Bayou, Shelby's wild ride could end his season early. In the Pacific Northwest, Rygaard and Oakes compete in a no-holds barred turf war. Up in Alaska, an accident sidelines one of the Papac crew. And in Florida, Logzilla continues to derail Kraken.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":"/64IKup94emPeowlK395TLYot7qv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-26","episode_number":11,"episode_type":"standard","id":1006191,"name":"Bombs Away","overview":"In the Bayou, Shelby goes on the hunt for the thief who stole his boat. Up north in Washington, the battle between rivals explodes as Rygaard refuses to allow Oakes to pass through their landing. Down in Florida, Clint's boat nearly goes up in smoke. And Swilley pulls up a prize from the bottom of the lake, the Chapman crew will never forget.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-09","episode_number":12,"episode_type":"standard","id":1006192,"name":"Who'll Stop the Reign?","overview":"Big noise and big toys turn the season upside down. In Alaska, a misstep by Joe cripples the yarder for Papac. In Washington, Gabe Rygaard pulls out a massive feller buncherone of the largest machines in the logging industry. Down in Florida, the skies open up on the Dreadknots and Chapman crews as they try to make it through a dangerous lightning storm.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-16","episode_number":13,"episode_type":"standard","id":1006193,"name":"Ax Marks the Spot","overview":"On Snag Hill, the war between Rygaard and Oakes explodes after Kelly demolishes a Rygaard pick-up truck. At Papac's site, tensions between Coatsy and Joe also reach a fever pitch as Coatsy makes a drastic decision regarding Joe's employment. Down in Florida, the Chapman crew may have found the treasure of a lifetime. On the other side of the Sunshine State, with Logzilla still stalling, The Kraken steals Clint's boat. And in the Bayou, Shelby's spin in his new ATV ends in disaster.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-23","episode_number":14,"episode_type":"standard","id":1006194,"name":"End of a Legend","overview":"In the Bayou, Shelby teaches his new puppy how to hunt for wood. On Snag Hill, the Rygaard crew breaks out their biggest weapon, but the increased production leads to total chaos. In Alaska, the Papac team struggles as Coatsy tries his hand in the yarder. Down south, Chapman's night logging expedition clashes head on with a band of alligators. And the end of a legend turns the Dreadknots season upside down.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-02","episode_number":15,"episode_type":"standard","id":1006195,"name":"Dog Days","overview":"In Washington, a battle erupts when Oakes is accused of stealing Rygaard's logs. In Alaska, tensions soar as a runaway log nearly wipes out the crew. In the Bayou, Shelby brings out his puppy to help him with a special assignment. Down in Florida, when Swilley gets snagged underwater, it's up to Jeter to save him. And in Louisiana, Ax Cut Lumber uses a homemade invention to float a monster log home.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-09","episode_number":16,"episode_type":"standard","id":1006197,"name":"Albie Damned","overview":"In the Bayou, Shelby and his new hand hit pay dirt with one of the biggest logs of the season. In Alaska, Coatsy's misstep in the yarder puts the crew in danger. Down in Florida, the Dreadknots reunite and take the fight directly to Chapman's home turf. And in the pacific northwest, tensions rise and hard hats roll when Rygaard and Oakes are forced to share the same landing.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-16","episode_number":17,"episode_type":"standard","id":1006198,"name":"Tooth and Nail","overview":"In Washington, Rygaard's quest for king of the mountain hits the skids when the crew nearly topples the yarder. Down the road, the Oakes crew capitalizes on their sidelined rivals and one team member learns first hand a drastic remedy for a toothache in the brush. In the Bayou, while trying to bring in a land-locked monster cypress, Shelby pushes his boat to the limit. On Alaska's Kupreanof Island, Joe returns, determined to whip the crew back into shape. And down in Florida, Chapman races against a lightning storm to find river gold, while the Dreadknots conspire with a Chapman enemy to secure their lead.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-23","episode_number":18,"episode_type":"standard","id":1006199,"name":"Battle Ax","overview":"In Washington, frustration boils over as Rygaard and Oakes are forced to share the same landing. Down in the bayou, Shelby gets in hot water with the law over a contested log. Up in Alaska, Joe and Coatsy struggle to get the Papac crew back on track. In Florida, the Dreadknots have a run-in with fish and wildlife while the chapman crew works through the night to catch up in the log count. And on the Pearl River, the Ax Cut team races against a fast moving tropical storm.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-30","episode_number":19,"episode_type":"standard","id":1006200,"name":"Trucked Up","overview":"As the loggers close in on the end of the season, one log could be the difference between winning and losing, reeling in fortunes or coming up short. In Louisiana, Shelby is only a log away from completing his big order when a boat crash stops him in his tracks. Up north, Gabe Rygaard unleashes fury on his own crew when he catches them doing a favor for the Oakes team. On Alaska's Kupreanof Island, Joe employs a dangerous strategy to make up for their slow yarder engineer. On Florida's St. Johns River, the Chapman crew closes in on the Dreadknots' lead. And a mistake forces the Ax Cut crew to log into the night, desperately trying to finish up their order.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-06","episode_number":20,"episode_type":"finale","id":1006201,"name":"Cutting it Close","overview":"In the season finale, battles and fortunes are all on the line. On Alaska's Kupreanof Island, a chainsaw accident leaves the crew short-handed on the last and most dangerous site of the season. In Washington, Gabe Rygaard's ferocious push to move the final loads proves too dangerous when Jason flips a loaded trailer. In the Bayou, it's Shelby's big day as he heads to the mill to find out if he's successfully filled his 200,000 board foot order. And down on Florida's St. Johns River, Greg's mistake could cost his crew a victory over the Dreadknots when a broken propeller leaves them dead in the water.","production_code":"","runtime":60,"season_number":7,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":62494,"poster_path":null,"season_number":7,"vote_average":0},"8":{"_id":"548de1f7c3a36820b800508f","air_date":"2014-11-30","episodes":[{"air_date":"2014-11-30","episode_number":1,"episode_type":"standard","id":1024292,"name":"Logged and Loaded","overview":"Rygaard heads into the groups roughest territory yet, hoping to recapture the title. Papac dreams of a repeat in Alaska, but Coatsy's injury hinders that thought.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":"/gfI5B4YAFTPr1ca9K2Hq0AMBdSL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-07","episode_number":2,"episode_type":"standard","id":1024293,"name":"Falling Fast","overview":"A replacement is sought for Coatsy; the Rygaard crew bring in a second yarder; and the Dreadknots pull the wrong kind of wood in Florida.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":"/3M1ozBXmmHDuViNlf8BZHj66n4u.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-14","episode_number":3,"episode_type":"standard","id":1024251,"name":"Failure to Communicate","overview":"A dangerous process is instituted in Alaska; Rygaard boosts production by doubling its number of yarders.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-21","episode_number":4,"episode_type":"standard","id":1024295,"name":"The Swampman Cometh","overview":"","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-28","episode_number":5,"episode_type":"standard","id":1028905,"name":"Hire Wire Act","overview":"Shelby and his assistant Bob search the area for scrap metal they can use to repair the wheels on the Swamp Man buggy; Coatsy's return to Papac is marred by arguments with Joe and an uprooted tail hold stump, prompting him to leave Joe in charge until he has fully healed; a topping operation leads to lost time at Rygaard when the tree's cut section falls on the skyline and brings it down; assisted by Levi, David does some high-altitude limbing and topping to fill a special order for Zitterkopf; with Katelyn cleared to resume work, Dreadknots risks working into the night to bring in a stash of logs marked by Clint; Kellie's injuries in a weekend car accident leave Triack shorthanded.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-05","episode_number":6,"episode_type":"standard","id":1032569,"name":"The Log and Winding Road","overview":"Ax Men is the first-ever non-fiction series about the treacherous life of Pacific Northwest timber cutters. From History and Original Productions, the same team responsible for the mega hit, Ice Road Truckers, this series looks at the legacy that the pioneers of our country laid for the present and future generations of loggers. Deep in the woods of the Pacific Northwest, rugged men make their living doing one of the most dangerous jobs in history... Logging","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-11","episode_number":7,"episode_type":"standard","id":1140081,"name":"Swamp Man Boogie","overview":"Shelby, Belinda, and Bob have their hands full trying to free a log stuck in the mud of Lake Pontchartrain for Swamp Man; Chapman employs a heavy-duty barge and extreme tactics in a second bid to capture the Gump Log; a breakdown in the Rygaard processor forces a frustrated Jason to shut down the site and send the crew home; soft soil and heavy turns bring down the skyline lift tree on a new section of the Papac site; a shorthanded Triack crew has to contend with extreme steep slopes that send logs sliding and crashing into Alec's equipment; David must stay in the hospital for a week's treatment, leaving his sons to keep cutting wood on the Zitterkopf site.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-18","episode_number":8,"episode_type":"standard","id":1037223,"name":"Teepee of Death","overview":"In Washington, Rygaard's remaining veterans go old school to keep the team on track. Deep in the Bayou, Shelby and Bob discover a valuable sinker cypress, but reeling it in is easier said then done. In the high plains of Wyoming, the Zitterkopf crew tries to tackle a dangerous tangle of logs known as \"the teepee of death.\" In Alaska, the Papac crew takes on \"shotgun logging,\" one of the most dangerous forms of logging in the industry. In Florida, the Dreadknots get on a hot streak, while on the Saint Johns River, the Chapman crew's season could go up in smoke as an engine overheats. In British Columbia, the Triack crew tries to fight through the hottest temperatures of the season.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-08","episode_number":9,"episode_type":"standard","id":1140082,"name":"Old Log, New Tricks","overview":"Shelby, Belinda, and Bob take the Swamp Man buggy out on a log hunt to pay for upgrades to the jet boat; with the Rygaard machines back in action, Gabe hires DJ to fill a crew opening; Joe has to fill in on yarder duty at the Papac site when the regular operator ends up in the hospital with dizzy spells; Chapman deploys both boats and the barge in a last brute-force effort to haul in the Gump Log; David returns to the Zitterkopf site, going against both doctor's orders and Levi's warnings as he resumes cutting trees.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-15","episode_number":10,"episode_type":"standard","id":1140083,"name":"All's Fair in Loggin' War","overview":"While waiting on the parts for the Swamp Man jet boat, Shelby takes flyboard lessons and borrows a jet ski to scout the bayou; a flat section of the Rygaard site puts so much stress on the skyline that a cable breaks, forcing the crew to trust an improvised repair job; Dave's attempt to pull a valuable log up from a steep drop-off on the Triack site threatens to topple the excavator; after Dreadknots spends a productive day searching for logs upstream, Clint suffers an ear injury that may put him out of action for weeks; Zitterkopf's rush order for a specialty log challenges David and Zane to bring down the needed tree safely and without damage.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-22","episode_number":11,"episode_type":"standard","id":1140084,"name":"Don't Cross the Boss","overview":"DJ's unexpected absence leaves the Rygaard crew shorthanded and prompts Gabe to fire him the following day; Papac takes a risk by bringing in a substitute yarder operator long out of practice; Shelby and Stephanie use the swamp buggy to wrestle a log free of the mud for Swamp Man; Ethan hires his friend Ike to assist on the Zitterkopf site, but Ike's mistakes endanger and annoy the rest of the family and lead David to fire him after one day; Triack faces pressure from its buyer to pull a load of valuable timber from the bottom of a deep canyon during a storm.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-01","episode_number":12,"episode_type":"standard","id":1140085,"name":"DaVi and Goliath","overview":"High water and strong currents test Shelby and DaVi during their search for the last logs needed to fund the Swamp Man jet boat upgrades; as the Papac crew moves the yarder to a new section of the site, Joe ends up hanging upside down from a tree as he tries to hang a pulley for the skyline; on Kellie's first day back at Triack following his car accident, he and the track hoe both come within inches of sliding off a cliff; Clint and Dave come to Katelyn's aid during her confrontation with a couple of fishermen who refuse to move out of the way of the Dreadknots boat; David gets an early start clearing a new access road on the Zitterkopf site, then gets bogged down while using it to haul out a load in the rain.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-08","episode_number":13,"episode_type":"standard","id":1140086,"name":"Jet Logged","overview":"Shelby and Bob test the upgraded Swamp Man jet boat by trying to haul in a capsized fishing boat; newly promoted hook tender Jeremy tries to send up an oversized log without bucking it, breaking a support tree on the Rygaard skyline; Triack purchases a rock truck powerful enough to haul out wood on its own, but using it poses risks both on the road and at the unloading point; with the Zitterkopf skidder broken down, David's plan to have Zane use his pickup truck to move logs sparks a fight between the two; the Chapman crew incurs Greg's wrath after they forget to hook up the boat's underwater sonar sensor and accidentally drop it to the riverbed.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-15","episode_number":14,"episode_type":"standard","id":1140087,"name":"Log Runners","overview":"Trucker Todd Dewey (featured on seasons 7 and 8 of the History series Ice Road Truckers) must negotiate a treacherous access road while hauling out loads for Rygaard; after modifying the Swamp Man jet boat to increase its pulling power, Shelby and his crew target a log stuck on the shore of the bayou; slick, muddy conditions on the steep Papac site cause logs to slide toward the rigging crew as they race to keep up production; the rival who tried to steal logs from Chapman in the previous season makes a new attempt to commandeer the crew's latest find; Ethan's shift as the Zitterkopf skidder operator ends abruptly after he breaks a cable while trying to pull a stuck log free.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-22","episode_number":15,"episode_type":"standard","id":1140088,"name":"Cuts Like a Knife","overview":"A jet boat breakdown leaves Shelby wit no good logs to show off for an unexpected visit by the Swamp Man buyer, but his cousin gives him a tip on a promising location; Jeremy's inexperience in using the Rygaard \"knife\" to move turns enrages Gabe and damages the equipment badly enough to force a shutdown; falling debris puts the Papac crew at risk as they try to bring a massive, valuable log down over a 50-foot vertical drop to reach the landing; Chapman's day on the river is briefly derailed when Swilley gets caught in an underwater fishing net; in his haste to move logs to the Zitterkopf landing, Zane pulls down a group of standing trees and nearly crushes Ethan; Dave's son Cory, called in to help finish the current section of the Triack site, must maneuver the log truck on a precariously narrow landing.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-29","episode_number":16,"episode_type":"standard","id":1140089,"name":"Fall of a Legend","overview":"With the Swamp Man jet boat repaired, Shelby trades favors with a friend to get help pulling in the log his cousin showed him, now floating among an expanse of tree stumps; while trying to untangle a cable on the Rygaard yarder, Craig slips and suffers multiple severe injuries to his leg; as Triack races to get loads out before their site permit expires at the end of the day, a log rolls free and nearly hits Kellie; fed up with Greg's constant criticism over the logs he is finding, Swilley quits Chapman; David berates Zane and crew member Khaymon for goofing off and breaking logs with their pastime of \"tractor jousting\" during his absence from the Zitterkopf site; new Dreadknots hire Jenna, filling in for Katelyn after her ankle injury, has trouble steering the boat but surprises Clint and Dave by finding a log on her first dive.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-05","episode_number":17,"episode_type":"standard","id":1140090,"name":"Rock Bottom","overview":"With Rygaard crippled by equipment damage, and both Craig and the yarder operator out due to injuries, Gabe calls in his crew from previous seasons to jump-start production; one of the Papac riggers falls into a hole and impales his hand on a piece of wood; after nearly dropping a tree on Khaymon, Ethan decides that the Zitterkopf job is too much for him and goes home; now ahead of schedule on the Swamp Man order, Shelby takes a break to hunt squirrels and crows for the day's meals; when Roger has trouble fighting the strong river currents due to his age, Greg tries to dive in his place without success, then reluctantly decides to hire Swilley back at Chapman.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-12","episode_number":18,"episode_type":"standard","id":1140091,"name":"Great Logs of Fire","overview":"Shelby pulls a log off private property in order to make sure he has enough wood on hand to meet the Swamp Man buyer's expectations; after the Zitterkopf skidder rolls downhill and breaks a cable, David tries a risky topping strategy to improvise a yarding system as a storm moves in; as Dreadknots scouts a distant upriver site for new logs, Swilley rejoins Chapman, accepting Greg's apology and an offer to let him keep the proceeds from the first log he finds that day; during a visit from Gabe and Jason at the Rygaard family home, a convalescing Craig starts to agree with their suggestion that he retire for good; fires started by stray sparks are the least of Triack's worries after the log truck starts to roll off the road.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-19","episode_number":19,"episode_type":"standard","id":1140092,"name":"All Hands on Deck","overview":"Mike joins the crew on the landing and brings in Skooby, a veteran from past years, to help with an area full of huge logs; Rygaard must overcome yet another knife breakdown and a narrow, twisting access road in order to have any chance of finishing their site on time; on the last, steepest section of the Triack site, Kellie throws logs down to Dave's brother Jim without a clear line of sight, putting him in danger; David's improvised skyline works well, but the Zitterkopf crew still falls behind in production after Khaymon accidentally drops a tree on it; with $75,000 to go on the $500,000 order, Dreadknots decides to salvage Logzilla, the former S&S boat that Dave sank during the previous season, and put it back in service alongside their main boat.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-26","episode_number":20,"episode_type":"finale","id":1140093,"name":"Axpocalypse","overview":"Joe's misstep brings his spiked boot down on a Papac man's hand, but the crew continues working to finish out the season; Dreadknots sends out both its new and old boats to get every possible log and out-produce Chapman; after Swilley's discovery of a massive log nearly sinks one of the Chapman boats, Greg marshals his forces to haul it in; a stuck clamp stops the Rygaard skyline carriage, but the crew is able to repair it and keep pulling loads; Dave is determined to finish out Triack's season by reeling in a giant log stuck on a steep incline above the landing; while cutting trees on the last acre of the Zitterkopf site, Zane nearly drops a group of huge trees on Khaymon's head; with his last logs on display, Shelby negotiates with the Swamp Man buyer in hopes of building up funds for next season.","production_code":"","runtime":60,"season_number":8,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"","id":63746,"poster_path":null,"season_number":8,"vote_average":0},"9":{"_id":"56539ffbc3a36850f6001050","air_date":"2015-11-22","episodes":[{"air_date":"2015-11-22","episode_number":1,"episode_type":"standard","id":1140094,"name":"Shelby Strikes Back","overview":"Swamp Man receives an order from furniture designer Brandon Morrison to find logs for a table and benches that he plans to donate to the local Boys & Girls Clubs of America chapter. After the search gets off to a slow start, Shelby and Brandon venture deep into the swamp and start finding valuable wood for both the table/benches and some lamps that one of Shelby's neighbors needs for her house. Brandon assembles the pieces with help from an old friend; after he and Shelby deliver them, he suggests that the two may be able to work together again in the future.","production_code":"","runtime":60,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":2,"episode_type":"standard","id":3811133,"name":"Episode 2","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":3,"episode_type":"standard","id":3811134,"name":"Episode 3","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":4,"episode_type":"standard","id":3811135,"name":"Episode 4","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-20","episode_number":5,"episode_type":"standard","id":1148427,"name":"Episode 5","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-27","episode_number":6,"episode_type":"standard","id":1150062,"name":"Madman of the Mountain","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":7,"episode_type":"standard","id":3811136,"name":"Episode 7","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":8,"episode_type":"standard","id":3811137,"name":"Episode 8","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":9,"episode_type":"standard","id":3811138,"name":"Episode 9","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":10,"episode_type":"standard","id":3811139,"name":"Episode 10","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":11,"episode_type":"standard","id":3811140,"name":"Episode 11","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-14","episode_number":12,"episode_type":"standard","id":1165703,"name":"Take This Log and Shove It","overview":"Mike Papac is forced to step in as Joe and Coatsey's arguments threaten to bring the job to a halt. At Rygaard Logging, Gabe gives his son Aidan a baptism of fire in the rigging, which pushes him over the edge and raises doubts about his future in the family business. Down in Wyoming, David Zitterkopf is back to work after an injury that almost ended his season, but he pushes his body to the limit again to get back into the game. In Florida, Greg Chapman is back to logging and desperately needs to make some money, but a huge storm may have other plans for them.","production_code":"","runtime":60,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":13,"episode_type":"standard","id":3810339,"name":"Episode 13","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-28","episode_number":14,"episode_type":"standard","id":1172551,"name":"Back in Black","overview":"With only two weeks remaining in the season, the Ax Men are sprinting to the finish line. The Rygaards are back in full force with all three generations of loggers on the site, fighting to regain the King of the Mountain crown. Papac Alaska is moving on to their final section, dubbed \"The Mother Lode\", but will this be the ultimate test for the worn out crew? Down in Louisiana, Gary and Eddie are about to see if their gamble to try swamp logging has paid off. Just across the swamp, Shelby is trying to finish his hundred thousand board foot order, but only has a few hours left. He must call in reinforcements to come up with his plan of attack. Meanwhile, David Zitterkopf must come up with a unique plan to hit the bullseye and finish his job. Down in Florida, Greg Chapman is not ready to call it a day and is back on the hunt for the Lost Logging Train.","production_code":"","runtime":60,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-06","episode_number":15,"episode_type":"finale","id":3810338,"name":"Episode 15","overview":"","production_code":"","runtime":null,"season_number":9,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"","id":72223,"poster_path":null,"season_number":9,"vote_average":0},"10":{"_id":"5d2a25a2be4b36756aa277d4","air_date":"2019-07-12","episodes":[{"air_date":"2019-07-12","episode_number":1,"episode_type":"standard","id":1850501,"name":"Back to the Woods","overview":"The Ax Men return, facing tougher conditions than ever before. This season, industry titans Pihl Logging and Rygaard Logging tackle some of their most challenging jobs yet, attempting to thrive in a turbulent industry. Newcomer Frank Harkness makes a name for himself, logging where no one else will, and Buckin' Billy Ray takes to the tree tops of Vancouver Island, risking his life to keep other people safe.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-07-19","episode_number":2,"episode_type":"standard","id":1914482,"name":"A Legend Returns","overview":"Mike Pihl looks for help from a logging legend; Jason Rygaard faces his biggest test as the new boss and his father Craig's future at Rygaard logging is questioned; The Harkness crew battles winter storms and vertical terrain in the Cascade Mountains; and Wade Etienne goes after valuable hardwood giants with custom machines in Indiana.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-07-26","episode_number":3,"episode_type":"standard","id":1914484,"name":"Uphill Battle","overview":"Brandon Harkness fights his way up a mountainside in the 29-ton Tigercat; Mike Pihl get his 52-ton yarder lodged between trees; Wade Ettiene's \"Big Mama\" takes a two-inch steel sawtooth to her face; and Buckin' Billy's son Hogan loses his grip while cutting a tree 60-feet off the ground.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-02","episode_number":4,"episode_type":"standard","id":1914486,"name":"Steel Knot","overview":"Danny Pihl gambles on horsepower to untangle a massive steel knot that's shut down the jobsite. Rygaard blows out the cobwebs as the company begins logging on their massive, new job. Wade Etienne battles rising mud, trying to get his logs off the jobsite and Buckin' Billy's forced to take down multiple trees at the same time.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-09","episode_number":5,"episode_type":"standard","id":1914489,"name":"The Longest Road","overview":"Rygaard Logging fights to fix a crooked skyline, crossing a deep valley on their longest road yet. Danny Pihl pushes himself physically and mentally while running his first jobsite on his own. Frank Harkness' fast work ethic proves too much for his equipment while on a steep, snow- covered mountainside and Wade Etienne doubles down on a risky plan to custom fabricate a one-of-a-kind log-hauler.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-16","episode_number":6,"episode_type":"standard","id":1914492,"name":"White Out","overview":"A breakdown forces Jason Rygaard to choose between his crew's safety and finishing the job. Frank Harkness is caught in a whiteout while moving the excavator on a narrow mountainside logging road. Wade Etienne finally tests his six-wheel, custom- fabricated, log-hauler and Buckin' Billy tests his son, Hogan, on a solo cutting mission 100 feet above the ground.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-23","episode_number":7,"episode_type":"standard","id":1914493,"name":"Measure Twice, Cut Once","overview":"Danny Pihl relies on the experience of veteran cutters Dwayne and Chuck to take down massive old-growth trees; Craig Rygaard discovers son Jason made a catastrophic and costly miscalculation; Frank Harkness races to transport $100,000 worth of logs.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-30","episode_number":8,"episode_type":"standard","id":1914495,"name":"Man Down","overview":"Rygaard Logging races to complete four settings and three yarder moves in a single day in an effort to stay on schedule and on budget; Frank Harkness fights for traction while driving the processor up an ice-covered logging road.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-06","episode_number":9,"episode_type":"standard","id":1914496,"name":"Snappin' Trees","overview":"Jason Rygaard fights the weather while hauling heavy, slick trees on the steepest setting of the season; Danny Pihl and his veteran crew precisely drop 250-foot, old-growth cedars next to a group of cabins; Wade Etienne struggles to control his customized, new, track cutter: Brutus; and brothers Jay R and Brandon Harkness overload their skyline and blow out the tail-hold.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-13","episode_number":10,"episode_type":"finale","id":1914498,"name":"Untethered","overview":"Jason Rygaard races to clear a hillside in time to fill four logging trucks; Jay R Harkness fights to control the untethered Tigercat on a steep, snow-covered mountainside; Bucking Billy and his son Hogan battle a forest of hang-ups and widow-makers.","production_code":"","runtime":60,"season_number":10,"show_id":15563,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"","id":127648,"poster_path":null,"season_number":10,"vote_average":0}}}