{"adult":false,"backdrop_path":"/szj45NQNl4wnrjzxKmvjQLvH32d.jpg","created_by":[{"id":1225676,"credit_id":"52570d20760ee3776a087857","name":"Jim Coane","gender":0,"profile_path":null}],"episode_run_time":[30],"first_air_date":"1999-09-06","genres":[{"id":16,"name":"Animation"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"","id":1585,"in_production":false,"languages":["en"],"last_air_date":"2005-04-11","last_episode_to_air":{"id":81219,"name":"Flip Flop / Just for Laughs","overview":"#30601   \\\"\\\"Flip Flop\\\"\\\"\n\nWhile rummaging through a Cave Swap, a sort of Dragon Land garage sale, Wheezie is astounded by a nice two-headed golden statue. Zak chimes in, starting an argument with Wheezie on her junk collection. While holding on the statue, Zak and Wheezie wish they could understand how the other feels. The statue starts to glow causes them to flip flop! Zak acts like Wheezie, and Wheezie acts like Zak! The switched personalities could help each to understand each other better, assuming that they can get back to normal.\n\n#22201   \\\"\\\"Just for Laughs\\\"\\\"\n\nRepeat of a Dragon Tales story first aired as part of Season Two. In addition, this is the series finale of \\\"Dragon Tales\\\".","vote_average":0,"vote_count":0,"air_date":"2005-04-11","episode_number":30,"episode_type":"finale","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":"/g1iBxxsVNe4P0xdzXX5qgb56Zjt.jpg"},"name":"Dragon Tales","next_episode_to_air":null,"networks":[{"id":122,"logo_path":"/sTYUkII9IC015VMZEDkUVMnbpFt.png","name":"PBS Kids","origin_country":"US"}],"number_of_episodes":95,"number_of_seasons":3,"origin_country":["CA","US"],"original_language":"en","original_name":"Dragon Tales","overview":"Dragon Tales is an American-Canadian animated pre-school children's television series created by Jim Coane and Ron Rodecker and developed by Coane, Wesley Eure, Jeffrey Scott, Cliff Ruby and Elana Lesser. The story focuses on the adventures of two siblings, Max and Emmy and their dragon friends Cassie, Ord, Zak, Wheezie, and Quetzal. The series began broadcasting on the Public Broadcasting Service on their PBS Kids block on September 6, 1999, with its final episode aired on November 25, 2005. Re-runs ceased in 2010.","popularity":6.72,"poster_path":"/pwAe79bXMfzjD4l4s2k1ZFXq8T2.jpg","production_companies":[{"id":3673,"logo_path":"/nDLYSGvTaIUU7LRFLwSk2xG9KLo.png","name":"Sesame Workshop","origin_country":"US"},{"id":10471,"logo_path":"/tHIwIKoXdLKA8Nt3XeRInh71OvD.png","name":"Columbia TriStar Television","origin_country":"US"},{"id":11073,"logo_path":"/aCbASRcI1MI7DXjPbSW9Fcv9uGR.png","name":"Sony Pictures Television Studios","origin_country":"US"},{"id":5061,"logo_path":"/7snDCNoCC1pMNqPYCC6pvKVk19b.png","name":"Children's Television Workshop (CTW)","origin_country":"US"}],"production_countries":[{"iso_3166_1":"CA","name":"Canada"},{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"1999-09-06","episode_count":40,"id":4345,"name":"Season 1","overview":"","poster_path":"/Bv5trKD6YhC4zyTjwHTKH2obZQ.jpg","season_number":1,"vote_average":10},{"air_date":"2001-06-04","episode_count":25,"id":4346,"name":"Season 2","overview":"","poster_path":"/v1yUepPrgGZiUoOSUC4YxvBMqwE.jpg","season_number":2,"vote_average":0},{"air_date":"2005-02-21","episode_count":30,"id":4347,"name":"Season 3","overview":"","poster_path":"/Bv5trKD6YhC4zyTjwHTKH2obZQ.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.351,"vote_count":37,"season_data":{"1":{"_id":"52570d19760ee3776a087056","air_date":"1999-09-06","episodes":[{"air_date":"1999-09-06","episode_number":1,"episode_type":"standard","id":81132,"name":"To Fly With Dragons - The Forest of Darkness","overview":"#10101  \"\"To Fly With Dragons\"\"\n\nMax and Emmy (especially Max) aren't too happy about moving into their new house. Inside, there's a nice playroom and all of their toys have been brought in. Then, Max discovers a secret drawer. Inside is a box containing a dragon scale. Emmy shows Max a picture of dragon scales in her dragon book. As both hold the dragon scale, Emmy utters some words found on the box. \"\"I wish, I wish, with all my heart, to fly with dragons, in a land apart.\"\" They arrive in Dragon Land, but have no idea where they are. They observe Ord and Cassie flying. After the introductions, they fly to Singing Springs where they meet Zak and Wheezie, who are actually two dragons, but share one body. Meanwhile, Ord's lost his baby tooth and wants to find it so that he can make a wish on it. At the end of the episode, Ord wishes","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/anETWah643iUQqXto0kQazQcX3P.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1999-09-07","episode_number":2,"episode_type":"standard","id":81133,"name":"To Kingdom Come - Goodbye Little Caterpoozle","overview":"#10201  To Kingdom Come\n\nOrd doesn't want to share his possessions with anyone\n\n#10202  Goodbye Little Caterpoozle\n\nCassie thinks she has lost her pet caterpoozle forever.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/2RBE2pF6aQKz0FEBa2gUoD8U5hy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-08","episode_number":3,"episode_type":"standard","id":81129,"name":"Knot a Problem - Ord's Unhappy Birthday","overview":"#10301  Knot a Problem\n\nEmmy loves new shoes, but Max thinks getting a balloon is better. One of the dragons calls them to Dragon Land. They go and we observe Ord holding the dragon scale. (unusual) Ord's called them because this is the one day a year that the magical merry-go-round comes to Dragon Land. They can't ride yet though because the youngest pony, Whinni, has wandered off. They have to find her before the merry-go-round leaves. Quetzal comes to help and they pick partners. Quetzal's brought rope so they can lead the pony back when they find it. But Max can't tie a knot! Can he learn this essential skill and help them find the pony?\n\n#10302  Ord's Unhappy Birthday\n\nEmmy and Max are preparing presents for Ord. We see Max is still having a bit of trouble tying knots. Max's finger ends up getting tied to his present. When they reach Dragon Land and see Ord, he's eager to tell them about his birthday, but they're very skiddish","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/sURQWR4eSQPHooALXpp8UwqChpg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-09","episode_number":4,"episode_type":"standard","id":81130,"name":"Tails You Lose - Calling Dr. Zak","overview":"#10401  \"\"Tails You Lose\"\"\n\nMax is trying to amuse Emmy with an imitation of Ord, but she's not interested. She's upset because she lost a soccer game. She declares that she's never playing again. She goes with Max to Dragon Land and finds that Zak and Wheezie are conducting a game called \"\"Freeze Dance.\"\" At first, she wants to play, but when she ends up losing, and is told to stand aside with a \"\"Yer' out!\"\" she becomes indignant and declares that she's going back home. But is winning all that matters?\n\n#10402  \"\"Calling Dr. Zak\"\"\n\nMax and Emmy go to Dragon Land and bring musical instruments with them. Today's the day for Zak and Wheezie to be in the two-headed dragon contest. They're singing a dragon version of \"\"Knick-Knack-Patty-Whack.\"\" Just then, a spiny-pine appears, attracted by some fruit that spilled from Wheezie's decorative hat and Zak accidentally steps on it.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/iBYxCnTc3sjESx9Ky1RhgoG7hkL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-10","episode_number":5,"episode_type":"standard","id":81134,"name":"Pigment of Your Imagination / Zak's Song","overview":"#10501  \"\"Pigment of Your Imagination\"\"\n\nMax is having fun with a toy plane and ends up knocking down a block structure that Emmy was making. He's upset because he broke the plane and now it won't fly anymore. There's something even better they can fly though- dragons. They go to Dragon Land, where the dragons are making presents for I Love My Mommy Day. For example, they're using clay to make flower-holders and baking them with their firebreath. Max gets some dandelions for his flower-holder and Ord sneezes because he's allergic. Their paint gets spilled and they go to Quetzal for more, but he's running low. He sends them to Rainbow Canyon and provides them with a map.\n\n#10502  \"\"Zak's Song\"\"\n\nThe dragon scale is glowing. It's late at night though and Max and Emmy are in their pajamas and have a serious case of bedhead. Never","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/wz8O8K0LZxhFZVumtDu0GACKof4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-20","episode_number":6,"episode_type":"standard","id":81128,"name":"Snow Dragons / The Fury Is Out On This One","overview":"#10601  \"\"Snow Dragons\"\"\n\nMax and Emmy are dressed warmly, as Quetzal is taking them to Snowy Summit. Max wants to bring along a lot of toys, but Emmy explains that you don't need toys to have fun in the snow. When they get to Dragon Land, Quetzal enjoys a short reminisce about playing at Snowy Summit. Emmy wants to know where Cassie is and Quetzal explains that she's getting over a cold. Emmy styas behind to keep Cassie company and Quetzal takes Max and Ord to Snowy Summit. When Ord finds a log that looks like a sled, they forget Quetzal's advice to stay together. It's not long before they're lost. At first, they're not too worried, but when they can't find Quetzal (who's looking for them), they become more concerned. Can they work together to find Quetzal?\n\n#10602  \"\"The Fury is Out on This One\"\"\n\nWhen Max gets hot and bothered over the outcome of a game of Dragon Tag, he finds he has a new annoying partner --- a gremlin called a Fury who feeds off","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/pdRbDgKQkiIiMP8uTAxBjbbgYAf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-21","episode_number":7,"episode_type":"standard","id":81131,"name":"The Giant of Nod / The Big Sleep Over","overview":"#10701  \"\"The Giant of Nod\"\"\n\nZak and Wheezie are performing in a big Dragon Land concert, but find themselves bickering over song-choice. Their bicker wakes the Giant of Nod, who turns out not to be such a giant after all.\n\n#10702  \"\"The Big Sleepover\"\"\n\nZak and Wheezie are having a sleepover, but Emmy has trouble convincing Cassie to go. After she finally comes, Cassie finds her own unique way to enjoy the sleepover.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/1C4tiHwv0PlkEGMsQKJ7YgwCDGy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-22","episode_number":8,"episode_type":"standard","id":81127,"name":"A Picture's Worth a Thousand Words / The Talent Pool","overview":"#10801  \"\"A Picture's Worth a Thousand Words\"\"\n\nThe dragons call Emmy and Max to Dragon Land. Ord's looking for giggle flowers, lots of them. They're his Mom's favorite and he wants them for her birthday. But he's only found one! When the gang goes searching, they encounter a Doodle Fairy, who may be able to help them. But she can't talk! Only doodle. Can they use her drawings to find the giggle flowers?\n\n#10802  \"\"The Talent Pool\"\"\n\nThe dragons are having a talent show, and Cassie desperately wants to be in it. The thing is, though, she doesn't feel that she has any special talents. She talks to Quetzal, who tells her about an amazing device called the \"\"Talent Pool,\"\" but when she visits it, it's less than cooperative.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/vwzRnSuACunj2058QmuV16urXEV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-23","episode_number":9,"episode_type":"standard","id":81135,"name":"Emmy's Dream House / Dragon Sails","overview":"#10901  \"\"Emmy's Dream House\"\"\n\nThe gang decides to build a treehouse in the branches of Sid Sycamore. Emmy, however, keeps bossing everybody around, and pretty soon, they leave her to do it herself. Can she win them back and get the help she needs to complete the treehouse?\n\n#10902  \"\"Dragon Sails\"\"\n\nOrd finds himself too big for a sailing adventure in Dragon Land. Max, Emmy and the other dragons work on a fix to the problem.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/r866iZYOLPcK3IGZRwhjfiovvHK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-24","episode_number":10,"episode_type":"standard","id":81136,"name":"Eggs Over Easy / A Liking to Biking","overview":"#11001  \"\"Eggs Over Easy\"\"\n\nCyrus the sneaky serpent tricks our friends so that he swipe a Rhyme Bird egg. Cassie feels guilty and shy because she can't seem to speak up about what happened to the egg.\n\n#11002  \"\"A Liking to Biking\"\"\n\nOn a rainy day, Max and Emmy visit Dragon Land for some fun biking. There, they teach the dragons how to do it too.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/w3g5R0RMNMvaLlurcXMTuIlreCv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-04","episode_number":11,"episode_type":"standard","id":81137,"name":"Sky Pirates / Four Little Pigs","overview":"#11101  \"\"Sky Pirates\"\"\n\nMax and Emmy find a box of their Mom and Dad's old toys and decide they're quite boring. They figure that there are better toys in Dragon Land. When they get there, Wheezie's got a \"\"Monster Mega Ball.\"\" She pulls something on it and it inflates to humongous size. So huge that it starts to bounce away. When they reach it, a flying pirate ship appears in the sky. Inside it, they find Captain Scaliwag. He's no pirate, but he has a buried treasure and can't find it anywhere. He lets Max, Emmy and our dragon friends be his crew and they sail with him to find his treasure, using a series of pictures he drew when he was young.\n\n#11102  \"\"Four Little Pigs\"\"\n\nMax, Emmy, and the dragons decide to put on a production of \"\"The Three Little Pigs.\"\" Trouble arises when Zak & Wheezie announce that they want to play the wolf, and Emmy won't let them.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/jkGtKZ9kr955Cvxhpd60V8UBeLH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-05","episode_number":12,"episode_type":"standard","id":81145,"name":"Zak and the Beanstalk / A Feat on Her Feet","overview":"#11201  \"\"Zak and the Beanstalk\"\"\n\nEmmy and Max bring Zak & Wheezie breadcrumbs and binoculars. Zak is convinced that something bad's happened to the do-re-mi birds. They're gone! Where could they be? The gang begins to search for them, but then Sid Sycamore summons them. Mungus the Giant took all of them! Why?\n\n#11202  \"\"A Feat on Her Feet\"\"\n\nCassie has some Jingle Flowers in need of a special type of water. Rollerskating will help to get them to it fast, but unfortunately Cassie doesn't know how to skate.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/35Frpm0eBTNPcDKA3mL1KJVeD5t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-06","episode_number":13,"episode_type":"standard","id":81141,"name":"Not Separated at Birth / A Kite For Quetzal","overview":"#11301  \"\"Not Separated at Birth\"\"\n\nZak and Wheezie are growing quite irritated with each other over the things each does that annoy the respective sibling. After a problem with a school project, the issue comes to a head and Quetzal provides them with a way to become two separate dragons. They think it's great for a while, but soon find themselves missing the way they thought together.\n\n#11302  \"\"A Kite For Quetzal\"\"\n\nProper planning is an issue when our friends want to create a kite for Quetzal. They know they need certain types of materials, but find themselves all getting the same materials when nobody decides who should get what.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/uYwl6qcISwyZgFb7NjnCEQj1pTr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-07","episode_number":14,"episode_type":"standard","id":81140,"name":"Dragon Drop / Cassie Loves a Parade","overview":"#11401  \"\"Dragon Drop\"\"\n\nIt's the day of the Dragon Fair and one of the fun activities is a game called Sackberry Toss. Sackberrys are a lot like water balloons, but unlike them, they have a sticky purple juice inside. This is a big problem for Zak and Wheezie, who want to join in the game, but don't know how to catch. Emmy helps them out by teaching them the basics.\n\n#11402  \"\"Cassie Loves a Parade\"\"\n\nCassie is abslutely beside herself when she's not chosen to be in the big Dragon Land parade. She soon finds a friend who's upset over exactly the same thing.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/xLmxfSrapgzoHMPnjVbeSGWot86.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-08","episode_number":15,"episode_type":"standard","id":81142,"name":"A Cool School / Max's Comic Adventure","overview":"#11501  \"\"A Cool School\"\"\n\nWe open the show with Emmy bringing in a pair of backpacks into the playroom - one for herself and one for Max. She can't find Max anywhere and so she calls out name a couple of times. Eventually, she finds Max under a cardboard fortress. Max explains that he's scared about going to school. Emmy decides to take Max to the School in the Sky in Dragon Land in the hopes that might help him feel better about going to school. They go to Dragon Land and materialize in front of Ord and Cassie. Ord's mom gives him his lunch. They then call Zak and Wheezie out of their knuckerhole. Emmy elaborates her plans to them. They then go see Quetzal to get permission. Emmy takes Quetzal aside, where she whispers to him that Max is afraid of going to school and that her idea is for them to intend the School in the Sky. Quetzal agrees, as \"\"all are welcome.\"\" Zak finds Wheezie's cubbyhole dusty.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/mQcAIBJdrtqq6QkRabASTxaXFbR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-18","episode_number":16,"episode_type":"standard","id":81144,"name":"It Happened One Nightmare / Staying Within the Lines","overview":"#11601  \"\"It Happened One Nightmare\"\"\n\nMax is stacking bottles in the playroom. Emmy enters and asks if Max is ready to go to Dragon Land. Max tries to knock the bottles down, but without success. They head for Dragon Land and arrive near the entrance of a carnival. There's a dragon nearby hawking roasted marshmallows. Max and Emmy both want some. He gives them a marshmallow, but Emmy complains that it's not roasted. So the dragon toasts it with his firebreath. They go in and look around. There's lots of fun things to do. They see Quetzal manning a \"\"throw the rings into the unicorn's horn\"\" booth and Cassie's taking a shot. She tries and misses. Emmy takes a shot and wins a plush dragon teddy. She turns to talk to Cassie, but Cassie's fallen asleep, standing. She wakes up and Zak and Wheezie pop up out of a knuckerhole. Zak keeps snoozing off while explaining that they were having a sleepover at Ord's place, when Ord had a nightmare and kept them up all night.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/tsQCfi9Wd4b7UR2hxz07zDiMtor.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-19","episode_number":17,"episode_type":"standard","id":81147,"name":"Follow the Dots / A Smashing Success","overview":"#11701  \"\"Follow the Dots\"\"\n\nMax and Emmy are working on activity books in the playroom. Max sticks a sticker of two airplanes next to the number 3, then realizes that he has made a mistake. He tries to fix the problem, but has problems with the sticker. The dragon scale glows- they're being called to Dragon Land. The dragons are playing a game they call \"\"whack-it-back,\"\" a slightly modified version of badminton with is played with a whistling shuttlecock (called a - you guessed it - whistler) and wooden rackets. The whistler is sent hurling into Zak's nose. He's not amused and blows it out. Max tries playing, but misses hitting the whistler. Ord hits the whistler with his tail, but it's with such force that he sends it a long way and loses it. Ord's upset, as that was a special whistler that his Dad gave him. They have to find it. As they go looking for it, they encounter a funny little guy named Norm the Number Gnome.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/vGIBEiVVdLRPVe8qS81E5ATEqsR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-20","episode_number":18,"episode_type":"standard","id":81138,"name":"Quibbling Siblings / Wheezie's Hairball","overview":"#11801  \"\"Quibbling Siblings\"\"\n\nZak is excited about trying to find a rare Jugglebug for school Sharing Time. But Wheezie's being a real pain - she makes noise when he's trying to sleep, ruins his breakfast and loses his magnifying glass. He retreats by placing a large cone over his head so he can't hear her. She doesn't understand why he's so angry, so Emmy and Max explain and Wheezie begins to realize how important the mission is to Zak.\n\n#11802  \"\"Wheezie's Hairball\"\"\n\nEmmy and Max are greeted in Dragon Land by a strange orange fur ball, Zak and Wheezie's new pet, Slurpy. They're learning how to take care of him, and it isn't easy! Since he can't talk, Slurpy tries to communicate by bouncing twice and spinning around.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/rCIcQkxtkpDuEJlMgQHX7yEMTq3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-21","episode_number":19,"episode_type":"standard","id":81139,"name":"A Tall Tale / Stormy Weather","overview":"#11901  \"\"A Tall Tale\"\"\n\nMax is playing with blocks in the playroom, but he finds that he's too short to reach the top of his block structure. He complains about being too short to reach the top of it because that's what Max does: complain about being too short to do anything. The dragon scale glows, as Max and Emmy are once again called to Dragon Land. When they get there, Ord introduces them to Eunice, an unicorn with purple mane and a gold horn. Eunice tries to say hi to Max and Emmy, but she ends up greeting a dragonberry bush. She's nearsighted and she can't see very well without her glasses. She describes them: a pair of pink glasses with sparkles on them. She finally finds Max and Emmy, but she has the idea that Max is a dragon, and without her glasses, she has to be told differently before realizing that Max is a kid. Zak and Wheezie pop out of their knuckerhole and help the others with searching. They ask her where she was before her glasses went missing.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/nMezynFC8V1iJBET4WLfeOTGMl7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-22","episode_number":20,"episode_type":"standard","id":81143,"name":"Blowin' In the Wind / No Hitter","overview":"#12001  \"\"Blowin' in the Wind\"\"\n\nMax and Emmy are in the playroom, singing variant of \"\"Here We Go 'Round the Mulberry Bush\"\" that replaces \"\"mulberry\"\" with \"\"dragonberry.\"\" They then decide to go to Dragon Land. It's pretty windyj, which isn't really suitable for Ord's picnic. Max steps on Ord's sandwich. Cassie explains that a wind has been following them since morning. Windy, the wind, is practicing to be a blustery wind. She's allowed to blow some clouds to Snowy Summit and tries to show off, but she isn't very good at whistling. She thinks that she's whistled, but Emmy breaks the news to her that she hasn't. Emmy and Cassie, along with the others, take Windy to Echo Cave to teach her to whistle. They yell nonsense into the cave. (\"\"It really does echo, see?! And for my next trick...\"\")  Max's attempt at whistling just ends up with him blowing raspberry and Ord ends up blowing firebreath. Emmy and Cassie explain the first step in whistling.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/tXEGLHOKdY9hcqtPVJWA1RI9ORc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-17","episode_number":21,"episode_type":"standard","id":81146,"name":"Do Not Pass Gnome / Treasure Hunt","overview":"#12101  \"\"Do Not Pass Gnome\"\"\n\nAs we open the program, Emmy is playing with a yo-yo. Max wants to play, but Emmy says no - he might break it. She puts the yo-yo up somewhere high. Max, determined to try it, gets it down. Predictably, he breaks it. Emmy's fuming mad. Max hopes that the dragons can help. Emmy hopes so too, otherwise, she's out of a yo-yo. They go to Dragon Land. The dragons are jumping rope and singing a jump-rope-related version of \"\"London Bridges.\"\" Zak and Wheezie get tangled up and land with a hard thud. Max and Emmy appear and explain the problem with the yo-yo. Wheezie tries to repair it with chewing gum. It didn't work. Ord tries using tape. Emmy asks how are they going to get to the string. Ord suggests using the tape as the string. That's not a good idea, as Ord ends up \"\"mummifying\"\" his hand with the tape, he gets wrapped all around. Simon, a gnome and one of the funniest looking characters in the series appears.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-18","episode_number":22,"episode_type":"standard","id":81148,"name":"The Jumping Bean Express / Get Offa My Cloud","overview":"#12201  \"\"The Jumping Bean Express\"\"\n\nIn the playroom, Max and Emmy are playing with a miniature basketball set. Emmy shoots and scores a 3-pointer. Suddenly Dragon Scale glows - they're being summoned to Dragon Land. So, we hear the rhyme that we're now all familiar with, and the dragon decorations on the wall come alive and surround them. In Dragon Land, Ord, Cassie, Zak, and Wheezie are holding on to a cage. Max and Emmy arrive and Ord hands them a hug. A bug? Well, it has to do with what's in the cage: two jumping beans that are unlike the kind in the real world - these beans have faces and can do animal tricks. Quetzal then shows up and briefs our friends on what to do: they are to return the beans to Quetzal's brother, Fernando. So, the kids and the dragons set off to do Quetzal's bidding. Halfway through, Emmy comments on the beans doing tricks. This causes Wheezie to want to show off, and in the lieu of confusion.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/deQD6fZ0KXJD3kkvZnvxXGsUzWh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-19","episode_number":23,"episode_type":"standard","id":81154,"name":"Backwards to Forwards / Sounds Like Trouble","overview":"#12301  \"\"Backwards to Forwards\"\"\n\nIt's a mixed-up backwards episode, as Max, Emmy and the dragons play a game and end up being sprinkled with a special type of water that causes things to go backwards. It's a lot of fun, until it creates a lot of confusion. They then have to work together to get things moving in the right direction again.\n\n#12302  \"\"Sounds Like Trouble\"\"\n\nA ball-game sends Max, Emmy and the dragons scrambling into a dark cave after losing a goo ball. There, Ord must come face-to-face with his long-held fear of the dark.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/2f4EONSg5hIJkMuejoo2V05ygZO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-20","episode_number":24,"episode_type":"standard","id":81152,"name":"The Greatest Show in Dragon Land / Prepare According to Instructions","overview":"#12401  \"\"The Greatest Show in Dragon Land\"\"\n\nThe show opens with Max playing on a slide made out of pillows. Emmy enters the room. Max asks her if she is interested in playing with his slide. She says no because they're going to Wonderworld with their friends in Dragon Land. So, they take the magical dragon scale out of the drawer and wish upon it like they always do. In Dragon Land, Ord and Cassie are sitting under a tree, on the lookout for Emmy and Max. Emmy and Max appear and Ord gives them a hug. Now, where's Zak and Wheezie? A knuckerhole opens up, and Zak and Wheezie crawls out of it. Wheezie hurt her wing falling off the swing the day before. The gang takes off for Wonderworld. Zak and Wheezie too try to take off, but ended up spinning around - Wheezie can't fly because of the cast on her wing. So, they can't go - or can they? Emmy suggests they walk. Zak and Wheezie are reluctant at first, but decide to go ahead. They soon come upon their first obstacle - Dragoon Lagoon.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-21","episode_number":25,"episode_type":"standard","id":81149,"name":"Wheezie's Last Laugh / Frog Prints","overview":"#12501  \"\"Wheezie's Last Laugh\"\"\n\nMax wants to play soccer, but Emmy explains that she can't. Dad's mowing the lawn. But perhaps they can play in Dragon Land! They go there, and when the soccer ball bounces into a flower patch, Ord finds a dragon frog sitting atop it. The dragon frog cock-a-doodle-dos like a rooster. What?! The gang meets up with a creature called Mister Pop, who's a green troll dude wearing a blue and yellow jester's type outfit and with a red top hat with a single pink stripe. Mister Pop possesses a device called a Super Duper Sound Switcher. When Wheezie laughs, Mister Pop will do anything to get the laugh for himself. But when Wheezie won't give it up freely, Mister Pop steals the laugh and takes off!\n\n#12502  \"\"Frog Prints\"\"\n\nMax grows attached to a frog that he finds when he, Emmy and the dragons visit Dragoon Lagoon. He then has a hard time letting go when he learns that it won't","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/estcsZBFZzINddsDftO7ZRC1Oxo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-24","episode_number":26,"episode_type":"standard","id":81153,"name":"Crash Landings / The Big Cake Mix-Up","overview":"#12601  \"\"Crash Landings\"\"\n\nMax and Emmy are in the playroom, Emmy dressed as a coach complete with a whistle. She's going to coach the dragons for the big relay race that's happening in Dragon Land. Max wants to help and Emmy says that he can be her assistant. They head for Dragon Land. There, Zak and Wheezie are admiring the gold trophy that's the prize for winning the race. As they admire it, Max and Emmy materialize, inside the trophy. Everybody heads for the School in the Sky, where Quetzal explains the relay race, using his big storybook as an aid. He shows them that Cassie takes off first. She'll fly for a while and then tag a waiting Ord. Ord will then race and tag Zak and Wheezie. Zak and Wheezie do the final leg of the race, heading for the finish line. It's not as easy as it sounds though, as there are two other teams competing. They head out and Coach Emmy starts coaching the dragons. She has them do warmup and Max asks what he can do to help.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-25","episode_number":27,"episode_type":"standard","id":81151,"name":"Quetzal's Magic Pop-Up Book / My Way or Snow Way","overview":"#12701  \"\"Quetzal's Magic Pop-Up Book\"\"\n\nIt's Storytime, but everybody has their own story that they want Quetzal to read. Quetzal can't read them all, so he introduces them to his magic pop-up book, an amazing book in which you imagine the story, and it comes to life. At first, nobody can agree on what story to tell, or what order to go in, but then Cassie comes up with an idea to solve their problem.\n\n#12702  \"\"My Way or Snow Way\"\"\n\nWhen Emmy and Max arrive at Dragon Land, it's snowing. Emmy and Max suggest a game of hide and seek. When Max wanders upon a snowman, it turns out to be a live, talking snowman. His name is Chilly and he's from Stickleback Mountain. He lost Nippy, his pet snow puppy, and he needs to find him before he melts. Can Max and Emmy and our dragon friends help find him? Wheezie has a \"\"whistle\"\" of a good idea, but when it doesn't work the first (or second) time, everyone becomes irritated when Wheezie wants to try it again.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-26","episode_number":28,"episode_type":"standard","id":81150,"name":"Sand Castle Hassle / A True Blue Friend","overview":"#12801  \"\"Sand Castle Hassle\"\"\n\nEmmy and Max are eager to help out the dragons in creating sand castles for Turtle Dragons, who will then lay their eggs in them. It's something that happens every year, but this year, a high-tide washes the castles away. Everyone must think of a creative way to get the Turtle Dragons to come back before they miss their opportunity to lay their eggs.\n\n#12802  \"\"A True-Blue Friend\"\"\n\nMax, Emmy and the dragons have a fun time painting with Zak and Wheezies' finger-paint, but it turns out it wasn't finger-paint after all. It's \"\"permanent paint\"\" and it's turned them all completely different colors. Now they must work together to follow exact instructions to get it off.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-27","episode_number":29,"episode_type":"standard","id":81157,"name":"Zak Takes a Dive / Under the Weather","overview":"#12901  \"\"Zak Takes a Dive\"\"\n\nThe gang's having a fun time swimming, but Zak doesn't know how to swim. After meeting a new friend, who he teaches to fly, he gains the confidence to try learning to swim.\n\n#12902  \"\"Under the Weather\"\"\n\nThe weather in Dragon Land is very strange. Three forms of precipitation seem to be happening at the same time and it's disrupting our friends' plans for a fun day at the beach. They decide to investigate the problem and find that Pollynimbus the weather-dragon has a cold and her machinery has fallen into disrepair.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-28","episode_number":30,"episode_type":"standard","id":81156,"name":"My Emmy or Bust / Light My Firebreath","overview":"#13001  \"\"My Emmy or Bust\"\"\n\nMax finds himself in a real situation when he's summoned to Dragon Land while Emmy is off at the store. He reluctantly goes and finds that even though he misses Emmy, there are still things he can do by himself.\n\n#13002  \"\"Light My Firebreath\"\"\n\nWheezie encounters a nasty flower and its nectar causes her firebreath to turn to fire-smoke. Now she must follow Dr. Booboogone's instructions exactly to regain the flame.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-17","episode_number":31,"episode_type":"standard","id":81158,"name":"Follow the Leader / Max and the Magic Carpet","overview":"#13101  \"\"Follow the Leader\"\"\n\nA squirrel appears at the window of Max and Emmy's playroom and both make the same comment on it at the same time. Emmy declares that Max is jinxed, and he can't talk until someone says his name, so Max has a clever idea. He grabs the dragon scale and has Emmy grab on and recite the rhyme to go to Dragon Land. Of course, when they get there, their presence is immediately announced by name. They decide to play a game and end up going with Emmy's choice of \"\"Follow the Leader.\"\" Emmy's game is difficult for Max though and though the Dragon friends try to get Emmy to make things easier (after all, easier rhymes with \"\"Wheezier\"\", she won't, saying that it won't be any fun if it's easy. Then, Emmy is kidnapped by Pooky the Troll from Towering Troll Village, who tries to make Emmy her play doll. Pretty soon, Pooky wants to play Follow the Leader.\n\n#13102  \"\"Max and the Magic Carpet\"\"\n\nMax and Em","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-18","episode_number":32,"episode_type":"standard","id":81160,"name":"Rope Trick / Baby Troubles","overview":"#13201  \"\"Rope Trick\"\"\n\nJump-roping can be fun, but not when the rope takes on a life of its own. This happens to Zak and Wheezie when they accidentally spill a bottle of potion of Quetzal's, and now they need Emmy's help to jump just right to make the rope become still again.\n\n#13202  \"\"Baby Troubles\"\"\n\nCassie is looking after her baby sister Kiki and her friends all want to help. It comes time for Kiki's nap, but she doesn't want to sleep without her favorite toy, a fruit she affectionately calls a \"\"squishy.\"\" Ord, however, has squashed the squishy and now he and Max must hunt for the perfect replacement, while Emmy, Cassie, Zak and Wheezie try other ways to lull Kiki to sleep.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/oXPu8Hm1vSHzu8Ox0SOfDFzWePy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-19","episode_number":33,"episode_type":"standard","id":81163,"name":"Small Time / Roller Coaster Dragon","overview":"#13301  \"\"Small Time\"\"\n\nMax is practicing driving the bumpercars at Funland. He and Emmy are going on Saturday. Emmy's not sure if he'll be tall enough to drive the bumpercars, which annoys Max, who's forever lamenting the problem of being too small to do stuff. In the meantime, the dragons are calling. Yet when Max and Emmy arrive at Dragon Land, no one's around. They figure the dragons are on their way and practice playing kickball. After kicking the ball into a patch of flowers, both accidentally touch shrinking violets, causing them to shrink down to the size of bugs. How can they get the dragons to find them and keep from getting stepped in the process?\n\n#13302  \"\"Roller Coaster Dragon\"\"\n\nEmmy is taking forever to tie her shoes, which is seriously bugging Max, who can't wait to go to Dragon Land. He decides to speed things up, by grabbing the dragon scale while Emmy finishes ty","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52570d1a760ee3776a0872f3","order":504,"adult":false,"gender":2,"id":45924,"known_for_department":"Acting","name":"Ian James Corlett","original_name":"Ian James Corlett","popularity":6.14,"profile_path":"/idVH8zLzuKrOrjtwLWvbgE4L338.jpg"}]},{"air_date":"2000-04-20","episode_number":34,"episode_type":"standard","id":81164,"name":"Up, Up and Away / Wild Time","overview":"#13401  \"\"Up, Up and Away\"\"\n\nMax and Emmy join the dragons in a game of  Pop the Bubble. It's great until Ord breaks the bucket. While Zak, Wheezie, Cassie and Emmy go to get a new bucket, Ord and Max stay behind and decide to blow bubbles using the nearby pond instead. There's lots of bubbles, but a bit too many and one gets so big that it forms around Ord and won't be popped! Nothing seems to do the trick and even Quetzal's big storybook doesn't have any answers.\n\n#13402  \"\"Wild Time\"\"\n\nWhen Emmy is annoyed by Max's silliness, they both seek a respite in Dragon Land, but Max finds nobody there is in the mood for games either. He just wants to play and goof off, but ends up ruining his dragon friends' craft creations for the Dragon Scale Festival. Quetzal tells him that there is a time to play and a time to be serious and he starts working to make good to his friend","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/4cYhlI9Y246Jd4eA1xSdE2ee9vF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-21","episode_number":35,"episode_type":"standard","id":81155,"name":"Bad Share Day / Whole Lotta Maracas Goin' On","overview":"#13501  \"\"Bad Share Day\"\"\n\nMax whines to Mom, who suggests Max do something else. Max grabs the dragon scale and starts to say the rhyme to go to Dragon Land and Emmy cries, Wait for me! They both go. When they get there, it seems that no one has anything to play with, until Cassie arrives and pulls out her crayon. No one's impressed until they learn that it's a magic crayon, which can change to any color you want. Also, anything drawn with it comes to life. Everybody wants to use it, but Cassie needs it to make a Get Well Card for her Mom. How can she tell her friends that she needs it, without upsetting them? When the crayon starts getting disgusted with what everyone's drawing with it, how can she stop it from drawing stuff to impress her so that she can make her card?\n\n#13502  \"\"Whole Lotta Maracas Goin' On\"\"\n\nMax is tired and wants to go to sleep. But it's Teacher Day in Dragon Land and Emmy wants Max to go with he","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/vz7qQp5aLzpI5n0eSeEvnErLzQd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-24","episode_number":36,"episode_type":"standard","id":81159,"name":"Ord Sees the Light / The Ugly Dragling","overview":"#13601  \"\"Ord Sees the Light\"\"\n\nMax has found his frog friend Hoppy and enjoys a reunion, but Hoppy hops away. Now, he and our other friends must search for him in a dark cave, but Ord is still scared of caves. Max and Emmy remind him that he's done okay in the past and they even help him to think of some new ways to beat his fear.\n\n#13602  \"\"The Ugly Dragling\"\"\n\nThe gang meets a new dragon, Priscilla, who has rather large feathers, and gets rather upset when she thinks that people are staring at them. Meanwhile, objects are raining down from the sky. It's Mungus the Giant, who's having a sneezing fit. Priscilla's feathers turn out to be quite useful.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-25","episode_number":37,"episode_type":"standard","id":81162,"name":"Out With the Garbage / Lights, Camera, Dragon","overview":"#13701  \"\"Out With the Garbage\"\"\n\nZak has a big surprise for Wheezie, but to his own surprise, she does not lovvvvvvve it! It turns out that he cleaned up her side of the room, but now she says the \"\"junk\"\" he threw out was her \"\"treasure.\"\" This means its time for a trip to the Dragon Land dump to get them back.\n\n#13702  \"\"Lights, Camera, Dragon\"\"\n\nEmmy's using her Dad's video camera. Max wants to pretend to be a superhero, but Emmy has a better idea. They can take the camera to Dragon Land. Ord has a new pet, a dragonmouse named Cheddar. Emmy decides that the dragonmouse shoudl be in her video. Max wants to be in the video too, but Emmy says that the video is only about dragons. When the dragonmouse takes off, Emmy calls it a mystery and states that the video needs a detective. Max wants that part, but Emmy gives the role to Cassie. As Emmy continues to stonewall Max, he decides that he wants nothing to do with her video.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-26","episode_number":38,"episode_type":"standard","id":81161,"name":"Bully For You / The Great White Cloud Whale","overview":"#13801  \"\"Bully For You\"\"\n\nQuetzal introduces the gang to a new dragon named Spike, who turns out to be something of a bully. When he's partnered on a dragonberry picking expedition with Cassie, he chooses her as a target. Is he really such a mean guy, though, or is something troubling him?\n\n#13802  \"\"The Great White Cloud Whale\"\"\n\nMax and Emmy meet up with their dragon friends to go fishing. It's the dragons' first time. Before they can start, their old friend, Captain Scaliwag, appears. He's searching for the great white cloud whale who swallowed his ship. The gang agrees to help them and they go hunting. But the cloud whale is one strong and elusive beast.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":"/8err82pXXRakdEHRFtTafYa2qDO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-27","episode_number":39,"episode_type":"standard","id":81166,"name":"To Do or Not To Do / Much Ado About Nodlings","overview":"#13901  \"\"To Do or Not To Do\"\"\n\nCassie, the dragons, Emmy and Max have been playing an ill-advised ball game in a grove of trees. Cassie didn't want to play there becuas they could lose ball. It does indeed get lost, in the belly of a beast called a Dragonocerous. Pretty soon, everyone else except Cassie is stuck inside too. She has a great idea for getting them out, but finds herself giving in to trying everyone else's solutions for the problem.\n\n#13902  \"\"Much Ado About Nodlings\"\"\n\nMax ruins the wagon of a group of a tiny nodlings and incurs the wrath of the Giant of Nod. He wants Max to set the situation right and together with Emmy and our dragon friends, he works to do just that.","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-28","episode_number":40,"episode_type":"finale","id":81165,"name":"Don't Bug Me / Over and Over","overview":"#14001  \"\"Don't Bug Me\"\"\n\nEverybody in the gang is impressed with Quetzal's amazing butterfly collection. From what they can tell, he has one of every kind of butterfly in Dragon Land. As it turns out, though, he's missing one, a very elusive type of butterfly called the Flutterby. Finding it will complete his collection. They notice how displeased he is about not having it, and decide to go and look for it themselves. But Ord's not happy about it because they're likely to encounter bugs, which he's afraid of. When Max later tries to scare Ord with his rubber spider, Ord becomes very upset. Max doesn't understand at first, as he's not scared of anything, except snakes and well, that's different. Can Max make up with him and get his aid in finding the Flutterby?\n\n#14002  \"\"Over and Over\"\"\n\nOnce, Max practiced school at Dragon Land when he was scared to go, and now he's trying something else. After having problems swinging on monkey bars, he gets help from Emmy and the dragons","production_code":"","runtime":30,"season_number":1,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":4345,"poster_path":"/Bv5trKD6YhC4zyTjwHTKH2obZQ.jpg","season_number":1,"vote_average":10},"2":{"_id":"52570d19760ee3776a087060","air_date":"2001-06-04","episodes":[{"air_date":"2001-06-04","episode_number":1,"episode_type":"standard","id":81168,"name":"Lucky Stone / The Mefirst Wizard","overview":"#20101   \"\"Lucky Stone\"\"\n\nWhen Max gets to Dragon Land, he finds Max's lucky stone. He doesn't realize what is however, and tries to use it as a skipping stone. It ends up getting lost and Ord gets upset, as \"\"Fly Time\"\" is coming up in Dragon Ed and he needs the lucky stone in order to do well with his flying tricks. The gang goes on an underwater expedition to hunt for it, but Ord is too large to fit on the submarine, so Max remains with him to help him search on the surface. There, Ord learns that luck isn't so important as believeing in his own abilities.\n\n#20102   \"\"The Mefirst Wizard\"\"\n\nThe dragons have built a new obstacle course, and everyone, including Max and Emmy, wants to try it out right away. This leads to the yelling of \"\"Me first! Me first!\"\" which causes an annoying, two-headed guy called the Mefirst Wizard to appear. He proceeds to start racing around the obstacle course, over and over, continually yelling \"\"Me first! Me first!\"\" and not giving anyone else a chance to get on. How","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":"/7tbfV7po4hGEUekPKN82wMyLYN6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-05","episode_number":2,"episode_type":"standard","id":81167,"name":"Cassie Catches Up / Very Berry","overview":"#20201   \"\"Cassie Catches Up\"\"\n\nCassie finds herself having a lack of confidence when she can't seem to win a prize at the Dragon Land fair. She learns from her friends that she just needs to believe in herself and she can come up with a creative solution to the problem.\n\n#20202   \"\"Very Berry\"\"\n\nOrd faces his fear of the darkness once again when he's stuck in a dark cave. He and his friends all work together to get him un-stuck.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":"/1feyonVdLz2knNd2VeSvMjaz4YX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-06","episode_number":3,"episode_type":"standard","id":81169,"name":"Finders Keepers / Remember the Pillow Fort","overview":"#20301   \"\"Finders Keepers\"\"\n\nMax and Emmy are excited to get to Dragon Land as today is the big opening of the Dragon Land Aquarium. It's an exciting place, with food and rides and even a squirt fish, the only type of fish in Dragon Land that can walk on land. They arrive at Dragon Land and head for the aquarium, but not before getting Zak and Wheezie out of their knuckerhole, since they have the tickets to the aquarium. Or do they? When Wheezie gets there, she can't find the tickets. She asks the ticket-taker if they can get in anyway, since she really did have the tickets, she promises, but the ticket-taker is the same Poor Man's Rodney Dangerfield that was in the Season One episode \"\"Roller Coaster Dragon\"\" and he's not willing to let them in without tickets. Emmy suggests retracing Wheezie's steps to find where she put the tickets and the gang does so, cleaning Wheezie's room in the process.\n\n#20302   \"\"Remember the Pillow Fort\"\"\n\nMax and Emmy have a box with various custome outfits and ar","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52570d1a760ee3776a0872f3","order":504,"adult":false,"gender":2,"id":45924,"known_for_department":"Acting","name":"Ian James Corlett","original_name":"Ian James Corlett","popularity":4.466,"profile_path":"/idVH8zLzuKrOrjtwLWvbgE4L338.jpg"}]},{"air_date":"2001-06-07","episode_number":4,"episode_type":"standard","id":81171,"name":"Big Funky Cloud / Copy Cat","overview":"#20401   \"\"Big Funky Cloud\"\"\n\nMax and Emmy are playing at home, when they receive a call from the dragons. They grab the dragon scale and head to Dragon Land, where they are told that something terrible has happened to Ord. It turns out that he's lost his favorite blanket down the \"\"lost-forever hole.\"\" The blanket was very special to him and now he's sad, so sad that a black raincloud is continuously hovering over his head and raining on him. The dragons tell Max and Emmy that this type of big, funky cloud appears whenever a dragon is really sad about something. In order to get rid of the cloud, they have to find a way to make Ord feel some way other than sad. They first try surprising him, but it only succeeds in scaring him. Then they try putting on a parade to make him happy, but this ends up causing Ord to remember how he used to watch parades sitting on his blanket, which makes him sad again. What else can they do to keep Ord from feeling sad?\n\n#20402   \"\"Copy Cat\"\"\n\nEmmy is starting to g","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-08","episode_number":5,"episode_type":"standard","id":81172,"name":"One Big Wish / Breaking Up Is Hard to Do","overview":"#20501   \"\"One Big Wish\"\"\n\nMax is getting really tired of being little. So after a bad experience in a baseball game in Dragon Land, he wishes that he could be bigger. It works, and he does get bigger, and bigger, and bigger, until pretty soon, he's bigger than Mungus the Giant. At this point, he's ready to take his wish back. How can he get back to his normal size?\n\n#20502   \"\"Breaking Up Is Hard to Do\"\"\n\nMax and Ord work on a project together, but then find themselves at odds over who should take possession of it. Their friendship seems to be in jeopardy when they keep arguing and then when the project ends up in two pieces.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-18","episode_number":6,"episode_type":"standard","id":81174,"name":"A New Friend / Have No Fear","overview":"#20601   \"\"A New Friend\"\"\n\nThe gang meets a new dragon, Lorca, who uses a wheelchair to get around. He shows them a treasure map, and they go off to look for the treasure, navigating a series of obstacles.\n\n#20602    \"\"Have No Fear\"\"\n\nIt's time for Show and Tell at the School in the Sky. Emmy brings a pomegranate to show the class. That interests them for a short while, but then they become far more interested in Cassie's new pet butterfrog. When Ord starts avoiding the butterfrog, he's forced to admit that he's afraid of them. Then, when the butterfrog escapes, can Ord overcome his fears to help his friends search for the butterfrog?","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-19","episode_number":7,"episode_type":"standard","id":81170,"name":"Cassie, the Green-Eyed Dragon / Something's Missing","overview":"#20701   \"\"Cassie The Green-Eyed Dragon\"\"\n\nEmmy and Max go to Dragon Land, eager because Cassie said that she was bringing a surprise to the School in the Sky. It's her little brother, Finn! He's a small, light green dragon with a blue belly. When everyone starts laughing at Finn's antics, and begins ignoring Cassie, Cassie gets irritated with her little brother. And when he ruins her portion of the class diorama after an ill-advised attempt at flight, she can't help but be angry, even though she knows that Finn didn't mean to. She put a lot of work into it! What to do about Finn?\n\n#20702   \"\"Something's Missing\"\"\n\nEmmy is going to sleep-away camp for a week. She says that even so, he can still have \"\"lots of fun in Dragon Land.\"\" The dragons help Max out by doing some of the stuff Emmy's doing: going swimming, taking a nature hike, and sitting around a campfire. Nevertheless, Max is still upset. Emmy's missing all the fun. Then Max has a great idea--- photography!","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-20","episode_number":8,"episode_type":"standard","id":81173,"name":"A Crown For Princess Kidoodle / Three's a Crowd","overview":"#20801   \"\"A Crown For Princess Kidoodle\"\"\n\nEmmy and Max are dressed snappily. They're going to watch Princess Kidoodle be crowned queen of the doodle fairies. While practicing for the royal parade, they come across Sir Doodle, a worker for Princess Kidoodle. He can't carry the crown because the wind is too strong for him to fly. Cassie's reluctant to carry it because she might drop it. Everyone decides to help and they take Sir Doodle with them. They navigate a series of obstacles to get there. They reach a gate, but can't get it open. It's locked! Can Cassie remember a secret password to get in? Can she speak up for herself? Let's just say that by the end of this episode, every dragons' badge has shined at least once.\n\n#20802   \"\"Three's a Crowd\"\"\n\nEmmy's eager to go to Dragon Land to pick crystals with Cassie. She and Max go to Dragon Land. The rest of them fly a kite and Emmy and Cassie go off to pick the crystals. Quetzal approaches and introduces them to Nicki, a visiting dragon. Nicki","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-21","episode_number":9,"episode_type":"standard","id":81178,"name":"Knuck Knuck, Who's Where? / Just Desserts","overview":"#20901   \"\"Knuck Knuck, Who's Where?\"\"\n\nEmmy and Cassie find themselves lost in a dark series of underground tunnels after some pick-up-sticks from their game are inadvertently taken by the Giant of Nod. They get worried about becoming lost, but fortunately come up with a great solution to help them keep their way.\n\n#20902   \"\"Just Desserts\"\"\n\nMax, Emmy and the dragons accidentally ruin a giant jiggly dessert that Mungus the giant made for his Mom. Together, they help him to create a new one.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-22","episode_number":10,"episode_type":"standard","id":81177,"name":"Dragonberry Drought / A Snowman For All Seasons","overview":"#21001   \"\"Dragonberry Drought\"\"\n\nWhen the gang goes dragonberry-picking they find that there's not a dragonberry anywhere to be found. Which is, needless to say, weird, since this is time when the dragonberry bushes are supposed to be in full bloom. What happened to all the dragonberries?\n\n#21002   \"\"A Snowman For All Seasons\"\"\n\nA mysterious weather problem is placing Chilly the snowman and his dog Nippy in danger. Max, Emmy and the dragons try everything possible to keep them cool, before finally deciding to get to the source of the problem.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-03","episode_number":11,"episode_type":"standard","id":81179,"name":"I Believe In Me / Bye, Bye Baby Birdie","overview":"#21101   \"\"I Believe In Me\"\"\n\nCassie decides to try out for a school play. She's never been in one before and her shy nature threatens to keep her from even trying. Her friends help her to find the confidence she needs to try out for a role.\n\n#21102   \"\"Bye, Bye Baby Birdie\"\"\n\nEmmy finds a baby bird and grows attached it, but has a hard time letting go when it's separated from its family. Max and the dragons help to convince her that it's for the best.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-04","episode_number":12,"episode_type":"standard","id":81176,"name":"Back to the Storybook / Dragon Scouts","overview":"#21201   \"\"Back to the Storybook\"\"\n\nCassie's little sister's Kiki and Finn are getting tired of the same old stories. The gang decides to take them into Quetzal's Pop Up Book and there, they create their own stories using their imaginations. It's a lot of fun, but also a lot of work for the two little dragons.\n\n#21202   \"\"Dragon Scouts\"\"\n\nEmmy is invited to become part a dragon Girl Scout group called \"\"Dragon Scouts,\"\" but worries that she doesn't fit in. Things only get worse when Cassie has to leave her for a while, but she finds her own way to make friends.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-05","episode_number":13,"episode_type":"standard","id":81180,"name":"The Serpent's Trail / Head Over Heels","overview":"#21301   \"\"The Serpent's Trail\"\"\n\nMax and Emmy have a brand-new detective kit and they're eager to show it the dragons. Once in Dragon Land, they find a real mystery --- Cyrus the serpent is swiping dragongull eggs. They have to use not only their kit but their wits as well to solve this mystery.\n\n#21302   \"\"Head Over Heels\"\"\n\nThe gang is enlisted by Quetzal to help bring some soup to his ill brother Fernando. Unfortunately, they encounter a grumpy old troll and have to perform cartwheels to make him let this pass. This is a particular problem for Emmy, who is usually good at athletics, but has never done one before in her life.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":"/bEqqVFrQpbIaumR5JxYX7W3W8HC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52570d1a760ee3776a0872f3","order":504,"adult":false,"gender":2,"id":45924,"known_for_department":"Acting","name":"Ian James Corlett","original_name":"Ian James Corlett","popularity":4.466,"profile_path":"/idVH8zLzuKrOrjtwLWvbgE4L338.jpg"},{"character":"","credit_id":"52570d1b760ee3776a087437","order":505,"adult":false,"gender":2,"id":27145,"known_for_department":"Acting","name":"Dale Wilson","original_name":"Dale Wilson","popularity":1.269,"profile_path":"/pvze2KdWMK16UEvJuSrJBTVL4Iy.jpg"}]},{"air_date":"2001-09-06","episode_number":14,"episode_type":"standard","id":81175,"name":"Sticky Situations / Green Thumbs","overview":"#21401   \"\"Sticky Situations\"\"\n\nMax is assigned to guard a fence holding some animals, but neglects in his duties, letting a baby pig out. Max decides to join the search for the pig and finds that it's a lot like him.\n\n#21402   \"\"Green Thumbs\"\"\n\nMax, Emmy and the dragons find a baby flower in need of help. They learn just the right things to care for her, before searching for her family.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-07","episode_number":15,"episode_type":"standard","id":81184,"name":"Teasing is Not Pleasing / Team Work","overview":"#21501   \"\"Teasing is Not Pleasing\"\"\n\nEmmy, Max and the dragons are playing Dragonbasketball game across the team from the School on the Lake. This team has a lot of bullies and they try to make star player Emmy lose her confidence by teasing her. At first, the teasing seems to be having an effect, but then Quetzal and Emmy's friends help her to ignore it and focus on the game.\n\n#21502   \"\"Team Work\"\"\n\nZak and Wheezie have a smelly problem --- they've been sprayed by a Stinkydink bug. They blame each other for it, but find that they're going to have to work together to solve the problem.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-10","episode_number":16,"episode_type":"standard","id":81181,"name":"On Thin Ice / The Shape of Things to Come","overview":"#21601   \"\"On Thin Ice\"\"\n\nEveryone's invited to Willie the Snow Seal's birthday. It's like a typical birthday party, but one of the required activities is ice skating, which Zak and Wheezie have never done before. The gang gives them both pointers how to do it, until finally they're skating together with style.\n\n#21602   \"\"The Shape of Things to Come\"\"\n\nZak has a new dragondisk that needs cleaning. The only place for it is the Crystal Fountain, but in order to use it, the dragons, Max and Emmy must first solve a puzzle involving shapes.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":"/wSOQMmK6HuBtADdARFYk0jfpgEJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-11","episode_number":17,"episode_type":"standard","id":81182,"name":"Hide and Can't Seek / The Art of Patience","overview":"#21701   \"\"Hide and Can't Seek\"\"\n\nOrd is not good at hide-and-seek and find himself not enjoying the Doodle Fairys' game of it. Some tips from his friends help him to make his first find and he comes to enjoy the game.\n\n#21702   \"\"Art of Patience\"\"\n\nOn Quetzal's birthday, Max is eager to celebrate, but impatient at the waiting the accompanies the party preparations. He gets a lesson in patience when he ruins some clay sculptures after opening the oven before they had finished baking.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-12","episode_number":18,"episode_type":"standard","id":81183,"name":"So Long Solo / Hands Together","overview":"#21801   \"\"So Long Solo\"\"\n\nZak and Wheezie are practicing for a talent show. Zak needs a Jugglebug for his act, but Wheezie's practice with her trumpet keeps scaring it away. At first, they try using the Alone Cone to get some peace from each other, before finally working together and coming up with a new use for it.\n\n#21802   \"\"Hands Together\"\"\n\nOn Dragontines day, everyone celebrates with a special dance, but Ord can't seem to catch onto the moves. His friends come together to give him some practical tips to learn the dance.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-13","episode_number":19,"episode_type":"standard","id":81186,"name":"Sneezy Does It / Try It You'll Like It","overview":"#21901   \"\"Sneezy Does It\"\"\n\nMax, Emmy and the dragons are out for some kite flying. Unfortunately, the wind in Dragon Land seems to have died down completely. It turns out the Big Whistling Wind has caught a cold, so the gang all helps him to feel better.\n\n#21902   \"\"Try It You'll Like It\"\"\n\nEveryone is excited about the new attractions at the Dragon Land amusement park, except for Zak. He's scared of the new foods and fast new rides. Our friends try to help him to see that trying new things can be fun.","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-14","episode_number":20,"episode_type":"standard","id":81188,"name":"Just For Laughs / Give Zak a Hand","overview":"#22001   \"\"Just For Laughs\"\"\n\nCassie, Emmy and the dragons team to find eggs in a special Dragon Land \"\"Custard Egg Hunt.\"\" They have fun searching for the eggs, but have their hands full watching Cassie's sisters Kiki and Finn.\n\n#22002   \"\"Give Zak a Hand\"\"\n\nThe dragons, Max and Emmy are all invited to Spike's fiesta, now that he's not such a bully anymore. However, Zak injures his wrist and wants to go home. Everyone manages to convince him to stick around for a game of \"\"Head, Shoulders, Knees and Toes.\"\"","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-17","episode_number":21,"episode_type":"standard","id":81189,"name":"Make No Mistake / The Balancing Act","overview":"#22101   \"\"Make No Mistake\"\"\n\nMax has a clapping CD and he's playing it obsessively. He's playing it in anticipation of the applause he'll get after performing the lead role at the School in the Sky play. Emmy gets tired of it and turns it off. She says it's time to go to Dragon Land. They get there, where Quetzal is having them do a rehearsal for the play, entitled Paint Your Dragon. Max overhears Wheezie correcting a mistake Zak made in one of his lines and gets nervous. What if he makes a similar mistake? He'll be embarrassed in front of a whole, huge audience. Cassie tells him that it's okay to make a mistake during rehearsal, it's only practice for the real thing and it lets you know what you need to work on. Max, however, gets afraid and vows not to make any mistakes during rehearsal. He makes one anyway and freezes up. When it's time for the next act, Cassie finds him hiding backstage. And then, when it's time for the play, Max is nowhere to be found. The gang searches and searches","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":"/u4vNCY6qeJ3V3JCZ02bXWSei5j1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-24","episode_number":22,"episode_type":"standard","id":81187,"name":"Room For Change / The Sorrow and the Party","overview":"#22201   \"\"Room For Change\"\"\n\nEmmy and Max are playing with toy cars and trucks. Emmy's car breaks down, so Max offers the services of his tow truck. Then, the dragon scale glows, they're being called to Dragon Land. In Dragon Land, they materialize outside Cassie's cave. Ord comes for them, they need to come in because something bad is happening to Cassie. Inside, Cassie tells them the bad news. Her family is about to hatch a couple more eggs and she has to move out of her current room and into a new bigger room, so that the babies can have her current room. Cassie doesn't want to move. She likes her current room. Everybody agrees to help out. They go to check out her new room. It's large and dark. Well, it's dark at first, but that's before they open the blinds and turn on the friendly looking light. Cassie's still worried about it and then they realize that it would look a lot more familiar if all of her stuff was in there. They bring in her bed, her stuffed animals, her books and ever","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":"/ykf5Fb8jv5amcanusGXEXDUFjh0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-01","episode_number":23,"episode_type":"standard","id":81185,"name":"The Grudge Won't Budge / Putting The Fun In Fun Houses","overview":"#22301   \"\"The Grudge Won't Budge\"\"\n\nMax is looking for some cold fun. However, there's none to be had outside the playroom. That's not a problem, the dragons are all going to Dragon Ice Park, so Emmy and Max go to Dragon Land to join in the fun. There, they find that Zak is upset with Wheezie. It seems that she was being careless and ended up breaking his prized snoot flute. Emmy doesn't understand why Zak's still upset with Wheezie. Didn't Wheezie apologize? She did, but Zak's still angry. She never should have been messing with it in the first place. Zak doesn't seem to be in the mood to forgive Wheezie, so the matter is dropped for the time being and everybody heads to the Ice Park. On the way there, Zak and Wheezie have some trouble with their flight. Wheezie thinks Zak's playing some sort of game, but Zak denies doing anything. Everybody else arrives ahead of Zak and Wheezie at the Ice Park, where they see an odd and disturbing sight: the frozen form of  Quetzal. They're worried tha","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52570d1b760ee3776a0874a0","order":500,"adult":false,"gender":2,"id":74363,"known_for_department":"Acting","name":"Scott McNeil","original_name":"Scott McNeil","popularity":6.216,"profile_path":null}]},{"air_date":"2002-10-08","episode_number":24,"episode_type":"standard","id":81190,"name":"Puzzlewood / Let's Dance","overview":"#22401   \"\"Puzzlewood\"\"\n\nMax and Emmy are at home working on a cow puzzle in their playroom. Max is having a hard time finding a particular piece and wants to give up and play with something different. Emmy begins to encourage him to keep trying, but then the dragon scale glows, calling them to Dragon Land. They drop the cow puzzle without further comment and head off. In Dragon Land, they find themselves in a forest called Puzzlewood. It turns out that it's the dragons' first time playing there, but they got lost and now they don't know how to get out. They can't fly because there's large branches blocking the way. It's suggested that they see if they can find anybody who lives in the forest who they might be able to ask how to get out. They find a dragon fairy and ask her. She explains that there are three doors and they have to solve the doors' puzzles. She leads them in the direction of the first door. The first door has the face and voice of an old lady and she asks them to find a fl","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-02","episode_number":25,"episode_type":"finale","id":81191,"name":"Let's Start a Band","overview":"\"\"Let's Start a Band\"\"\n\nNina, the babysitter, introduces herself and says that sometimes she thinks morning comes too soon. However, she says that the sooner she gets up, the sooner she can see some special friends, who really know how to get up with some pep in their step.\n\nMusical #1: \"\"Wake and Say Good Morning\"\"\n\nNina says that there's nothing better than singing dragons to get your energy going. She promises lots of surprises and introduces the viewers to Sam and Jennifer, two young kids who just moved to the neighborhood. Sam and Jennifer are just sitting around. They say that they're bored and there's nothing to do. Nina asks Jennifer if they watch Dragon Tales and Jennifer says that they do. Everybody does. Nina says that she knows what the dragons would tell them to do if they're bored:\n\nMusical #2: \"\"Doodli-Do\"\"\n\nAfter the musical, we see the Sam and Jennifer were trying to dance along with the song. However, Jennifer trips and jokes that she \"\"tripped like a tripping bear.\"\" Looking for","production_code":"","runtime":30,"season_number":2,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":4346,"poster_path":"/v1yUepPrgGZiUoOSUC4YxvBMqwE.jpg","season_number":2,"vote_average":0},"3":{"_id":"52570d19760ee3776a08706a","air_date":"2005-02-21","episodes":[{"air_date":"2005-02-21","episode_number":1,"episode_type":"standard","id":81195,"name":"To Fly With a New Friend Pts. 1 and 2","overview":"\"\"To Fly With a New Friend\"\"\n\nPart 1\n\nMax and Emmy have a new neighbor --- Enrique. He's just moved in from Colombia and hasn't had much luck at making new friends. After thinking it over for a bit, Max and Emmy decide to introduce Enrique to Dragon Land. At first, he's disbelieving, then a bit scared, but soon finds himself making friends just like Max and Emmy did when they first came to Dragon Land. He then joins them all on his first Dragon Land adventure --- taking a growing fish named Chips to the Dragon Land Aquarium.\n\nPart 2\n\nEnrique is happy at having so much fun at Dragon Land, but still feels like he doesn't quite fit in. Zak and Wheezie agree to help out --- they'd love to give him a tour of Dragon Land! As Zak and Wheezie show Enrique all their favorite places, they discover a mystery along the way.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":"/rRpHpMvD1RYfrjPMu1BzNoOrKXS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-22","episode_number":2,"episode_type":"standard","id":81193,"name":"Rise and Bloom / Super Snow Day","overview":"#30201   \"\"Rise and Bloom\"\"\n\nMax wants to see the once-a-year event of all time in Dragon Land, the Bursting Blossoms blooming! But it happens at sunrise, and Max has trouble shaking off his tiredness. Later, they find out the Bursting Blossoms need help waking up as well! It's up to the kids and dragons help them wake up so they can bloom, assuming that Max can be helped first.\n\n#30202   \"\"Super Snow Day\"\"\n\nEnrique arrives one warm spring day to find Max and Emmy in their winter clothes! Max and Emmy are going to Dragon Land to sled on Snowy Summit. They really want Enrique to go along with them, but Enrique has never experienced snow before, and is afraid of sledding as well. Max and Emmy do their best to help him have some great fun in the snow.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-23","episode_number":3,"episode_type":"standard","id":81192,"name":"Musical Scales / Hand in Hand","overview":"#30301   \"\"Musical Scales\"\"\n\nMax taught Zak and Wheezie a Spanish/English song to perform for Princess Kidoodle, and they have practiced it very hard. When performance day arrives, Max, Emmy and Enrique (wearing a special hat) meet up with Cassie and Ord only to find Zak and Wheezie refusing to come out of their cave. They later found out that Zak and Wheezie are shedding their beautiful scales! It looks like the performance could be cancelled unless the gang can help them out. They try all sorts of plans, including painting Zak and Wheezie and covering them in clothes.\n\n#30302   \"\"Hand in Hand\"\"\n\nMax and Emmy's arguing upsets Enrique, so he goes to the magical wishing well in Dragon Land. Enrique wishes that they two would become, well, \"\"closer together.\"\" His wish works out in a way he didn't hope --- Max and Emmy literally become stuck together. Another wish will set them right, but first they have to work together to deliver Wyatt's huge load of coins to the First Dragon Land Bank.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-24","episode_number":4,"episode_type":"standard","id":81194,"name":"Sky Soccer / Making it Fun","overview":"#30401   \"\"Sky Soccer\"\"\n\nOrd and the other dragons are trying out for the sky soccer team --- a special variation on soccer in which the ball must stay in the air and you can only use tail, chest, knees and feet. Ord has never played soccer before and thinks it can't be too hard, but tries to quit when he ends up not doing well at all. His friends tell him he can't quit and soon help him out with a number of drills. Ord is frustrated at first, but finds his confidence growing as he gets better at the sport.\n\n#30402   \"\"Making it Fun\"\"\n\nThe Junior Unicorn Race is in peril --- Eunice the unicorn asked for Mungus the Giant's help in putting up signposts, but he put them up way too high. Our friends help out by painting the path, but they find it to be tiring work and soon grow bored. Realizing that they're committed to the job, they come with some tactics to keep moving and interesting. They try painting in fancy colors such as dragonberry red, taking fun breaks and even having a little race of","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52570d1c760ee3776a087552","order":503,"adult":false,"gender":1,"id":86788,"known_for_department":"Acting","name":"Janyse Jaud","original_name":"Janyse Jaud","popularity":3.219,"profile_path":"/7ZvfIfmgkU2B8jA25czUoKXXq6e.jpg"}]},{"air_date":"2005-02-25","episode_number":5,"episode_type":"standard","id":81196,"name":"Itching for a Cure / The Big Race","overview":"#30501   \"\"Itching for a Cure\"\"\n\nOur friends have a fun game of card house building in mind, but a giant earthquake puts an end to that plan. The earthquake is actually the giant Mungus, scratching up a storm from an awful rash on his back. Dr. Booboogone can treat it, but is out of the needed Itch-Be-Gone cream. So Max, Emmy, Enrique and the dragons gather up chile peppers, honey and limes to help, facing obstacles such as an angry bee, slime and bugs along the way.\n\n#30502   \"\"The Big Race\"\"\n\nThe time has come for the Dragon Land Road Race --- an event in which at least two people are paired together and race in whichever way they can (other than flying) down a set course. Enrique has joined Lorca on his modified wheelchair, but when he modifies it further, he leaves Lorca out, upsetting him. Pretty soon, they aren't working together, and neither are the other teams, slowing their progress. Quetzal shows up with some advice and Enrique remembers a song to help as well.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-01","episode_number":6,"episode_type":"standard","id":81202,"name":"Lucky Stone / Max Loves a Train","overview":"#20101   \"\"Lucky Stone\"\"\n\nRepeat of a Dragon Tales story first aired as part of Season Two.\n\n#30702   \"\"Max Loves a Train\"\"\n\nMax has been anticipating riding the Dragonland Express for days and now it's finally arrived in Dragon Land, bearing a #8 and a loud train whistle. The conductor Isabella invites our friends to hop aboard, but the journey grinds to a screeching halt when it turns out that some of the train tracks are missing. The group goes on a search for the tracks, but when they can't find them at first, they look for other ways to have fun and cheer Max up.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-02","episode_number":7,"episode_type":"standard","id":81197,"name":"A New Friend / El Dia del Maestro","overview":"#20601   \"\"A New Friend\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.\n\n#30802   \"\"El Dia del Maestro\"\"\n\nEnrique arrives just in time to help out with El Dia Del Maestro, a celebration held every year on a different day in Dragon Land as a surprise for Quetzal. One of the big attractions is Quetzal's favorite food, chalupas, but when Cassie's older sister Sophie doesn't show up, Cassie's convinced that there aren't going to be any. Emmy suggests that Cassie could take over the task, as she knows what to do. Meanwhile, Enrique teaches everyone a special song in Spanish and English to sing to Quetzal.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-03","episode_number":8,"episode_type":"standard","id":81204,"name":"Finn's Blankie / Let's Dance","overview":"#30901   \"\"Finn's Blankie\"\"\n\nWhen Cassie's Mom accidentally throws Finn's blankie in the laundry, Finn is devestated. His constant tantrums prompt Cassie to take him on a trip to retrieve the blankie. Until then, it's up to the group to help Finn survive without, assuming they can find it at all.\n\n#22401   \"\"Let's Dance\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-04","episode_number":9,"episode_type":"standard","id":81199,"name":"Express Yourself / A Snowman for All Seasons","overview":"#31001   \"\"Express Yourself\"\"\n\nMax, Emmy and Enrique all decide to visit Dragon Land after the threat of an oncoming storm forces them to abandon their plans for chalk-drawing outside. Once there, they're invited to join the dragons to see the new painting that the doodle fairies are unveiling for Princess Kidoodle. As they fly there, Enrique reveals his new nickname for Cassie, Pinky. It reminds him of his cousin Rosa, but what he doesn't know is that it reminds Cassie of a mean dragon at school who called her \"\"Pinky Shrinky.\"\" When Pollynimbus asks everyone to help out at her weather-station while she helps a sick friend, Cassie is so upset at the nickname that her mind can't focus on the task. After she explains her problem to Emmy, Emmy gives her some tips for letting Enrique know how she feels.\n\n#21002   \"\"A Snowman for All Seasons\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-07","episode_number":10,"episode_type":"standard","id":81203,"name":"Prince For a Day / So Long Solo","overview":"#31101   \"\"Prince For a Day\"\"\n\nMax and Emmy are having a dispute about who should clean the playroom when the dragons call. With Enrique, they arrive in Dragon Land and join the dragons in heading to the Doodle Fairy Kingdom Flower Festival. Once they're there, Ord stops an accident from happening, saving Princess Kidoodle from some serious pain. He becomes a sort of a kingdom hero and when Princess Kidoodle is called to a meeting, she appoints him the temporary prince, with the power to make decisions regarding the entire kingdom. He has fun assigning his friends royal jobs and then is faced with a decision that seems like it should be right up his alley --- the choice as to whether nuts or fruit should be served as a snack. However, he finds that the kingdom seems be split evenly on which snack they prefer and the decision turns out to be rather tough.\n\n#21801   \"\"So Long Solo\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-08","episode_number":11,"episode_type":"standard","id":81205,"name":"The Balancing Act / A Small Victory","overview":"#22102   \"\"The Balancing Act\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.\n\n#31202   \"\"A Small Victory\"\"\n\nMax is at that point again where he's a bit unhappy about always being too small to do things. On a trip to Dragon Land, he's paired with a Lorca for a scavenger hunt that involves collecting rare plants for the School in the Sky garden. He thinks that since he's so small, they can't fly and Lorca's in a wheelchair, it'll be a real problem for them to find their plant. Lorca, however, has other ideas and shows Max that they actually have an advantage and they can use their minds to solve the problem.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52570d1c760ee3776a087637","order":501,"adult":false,"gender":2,"id":74364,"known_for_department":"Acting","name":"Brian Drummond","original_name":"Brian Drummond","popularity":2.855,"profile_path":"/oNKCHFuMZTASvyayEj3cRXLEjJL.jpg"}]},{"air_date":"2005-03-09","episode_number":12,"episode_type":"standard","id":81200,"name":"Feliz Cumpleaos, Enrique / On Thin Ice","overview":"#31301   \"\"Feliz Cumpleaos, Enrique\"\"\n\nAfter receiving a present from Max and Emmy, Enrique arrives with them in Dragon Land where he's treated to a surprise birthday party. Everybody's gone all out with cake, balloons, Dragonblowers and other fun things. Enrique, however, finds himself missing Columbian birthday traditions from back home. Our friends try to help him by simulating some of those traditions, but Enrique still finds himself feeling sad. He decides to go see Quetzal, who has some very useful advice.\n\n#21601   \"\"On Thin Ice\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-10","episode_number":13,"episode_type":"standard","id":81201,"name":"Teasing is Not Pleasing / Down the Drain","overview":"#21501   \"\"Teasing is Not Pleasing\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.\n\n#31402   \"\"Down the Drain\"\"\n\nEmmy, Max, and Enrique are going on a sky sailing adventure with Captain Scaliwag and their good old dragon friends. When Captain Scaliwag pulls up the ship's anchor, though, he releases the plug that holds the water in Dragoon Lagoon, leaving the lagoon's inhabitants panicking. Arrrr --- these pirates will have to think fast to save their friends.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52570d1b760ee3776a0874a0","order":500,"adult":false,"gender":2,"id":74363,"known_for_department":"Acting","name":"Scott McNeil","original_name":"Scott McNeil","popularity":6.216,"profile_path":null}]},{"air_date":"2005-03-11","episode_number":14,"episode_type":"standard","id":81198,"name":"All That Glitters / Dragonberry Drought","overview":"#31501   \"\"All That Glitters\"\"\n\nAfter Quetzal reads a story about \"\"El Dorado\"\" with the gang, he shows them a shiny golden Dragon Scale, given to Quetzal by the Gilded Dragon. Max asks if he can take it out in the sun to see the scale shine, and Quetzal lets him, if he promises to be careful with it. When the time comes to let the sun shine on the scale, the worst happens. The scale is gone! And there is a huge hole in Max's pants pocket. Now Max is worried that Quetzal will think him irresponsible.\n\n#21001   \"\"Dragonberry Drought\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52570d1c760ee3776a0875ab","order":502,"adult":false,"gender":2,"id":26089,"known_for_department":"Acting","name":"Garry Chalk","original_name":"Garry Chalk","popularity":9.198,"profile_path":"/jESGnBSP0OjFxJejN1OPsjXA9sJ.jpg"}]},{"air_date":"2005-03-14","episode_number":15,"episode_type":"standard","id":81206,"name":"A Crown For Princess Kidoodle / Play It and Say It","overview":"#20801   \"\"A Crown For Princess Kidoodle\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.\n\n#31602   \"\"Play It and Say It\"\"\n\nMax, Emmy and Enrique head to Dragon Land for a game of hopscotch, where they find Ord in a very out-of-sorts mood. He doesn't even offer his usual hug and it turns out that he's upset because he can't seem to remember his numbers in Spanish that Quetzal has been teaching. Since they all know Spanish rather well, Max, Emmy and Enrique offer to help. The idea comes up that Ord can learn the numbers while they play their hopscotch game, which Enrique knows from Colombia as rayuela. Just as the game gets going, Norm the Number Gnome shows up and swipes the numbers. It turns out that he better likes the game that the dragons were playing just when our friends arrived --- Hot and Cold. He hides the numbers and Ord gets to learn how to say them in Spanish as everyone searches for them based on Norm's rhyming clues.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-15","episode_number":16,"episode_type":"standard","id":81208,"name":"Moving On / Head Over Heels","overview":"#31701   \"\"Moving On\"\"\n\nMax, Emmy and Enrique are called to Dragon Land for a going-away party for Cassie's big sister, Sophie. Sophie's heading off to cooking school and Cassie's really going to miss her and the times she spent together with her, learning about cooking. After Sophie leaves, her friends to help her cheer up by playing, but everything reminds her of Sophie. Then, Enrique gets a new idea of doing something that will bring Cassie closer to Sophie. Cassie tries it out, but still feels like it's not the same and, worse, a grumbly bee has taken an interest in what's happening, hoping to land some free food!\n\n#21302   \"\"Head Over Heels\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":"/pUJamVWl924qqhBhkq89EFywdvh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-16","episode_number":17,"episode_type":"standard","id":81207,"name":"All Together Now / Team Work","overview":"#31801   \"\"All Together Now\"\"\n\nMax wants to play with Emmy and Enrique, but they're working on a whale project together for school. He hopes that a trip to the Dragon Land Carnival will change things, but he finds that once they're there, they still continue to play with each other. He continues to feel left out and even after taking some advice from Quetzal, still can't help but feel like he's unwanted. After asserting himself, having some more fun, and trying some new things, he begins to learn that he's still cared about too and that he and Emmy both have a new friend.\n\n#21502   \"\"Team Work\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":"/s8i7Csa5euteiZbDJXXzyolgMSc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-17","episode_number":18,"episode_type":"standard","id":81209,"name":"Making it Fun / The Sorrow and the Party","overview":"#30402   \"\"Making It Fun\"\"\n\nRepeat of a Dragon Tales story first aired earlier in the season.\n\n#22202   \"\"The Sorrow and the Party\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-18","episode_number":19,"episode_type":"standard","id":81215,"name":"Itching for a Cure / Cassie Catches Up","overview":"#30501   \"\"Itching for a Cure\"\"\n\nRepeat of a Dragon Tales story first aired earlier in the season.\n\n#20202   \"\"Cassie Catches Up\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-21","episode_number":20,"episode_type":"standard","id":81214,"name":"Sad Little Star / Try It You'll Like It","overview":"#32101   \"\"Sad Little Star\"\"\n\nCeleste, a star, comes down to Dragon Land during the day. She enjoys being a star, but misses out on all the daytime activities, especially the rainbow which she really wants to see.  Max, Emmy and our dragon friends try to help her, but find a surprising shortage of rainbows in Dragon Land. Still, they're determine not to give up and race to help Celeste before she has to return to the night sky.\n\n#21902   \"\"Try It You'll Like It\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-22","episode_number":21,"episode_type":"standard","id":81216,"name":"The Big Race / Bye, Bye Baby Birdie","overview":"#30502   \"\"The Big Race\"\"   The time has come for the Dragon Land Road Race --- an event in which at least two people are paired together and race in whichever way they can (other than flying) down a set course. Enrique has joined Lorca on his modified wheelchair, but when he modifies it further, he leaves Lorca out, upsetting him. Pretty soon, they aren't working together, and neither are the other teams, slowing their progress. Quetzal shows up with some advice and Enrique remembers a song to help as well.\n\n(Repeat of a Dragon Tales story first aired earlier in the season.)\n\n#21102   \"\"Bye, Bye Baby Birdie\"\"\n\nEmmy finds a baby bird and grows attached it, but has a hard time letting go when it's separated from its family. Max and the dragons help to convince her that it's for the best.\n\n(Repeat of a Dragon Tales story first aired in Season Two.)","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-23","episode_number":22,"episode_type":"standard","id":81211,"name":"Sky Soccer / Room For Change","overview":"#30401   \"\"Sky Soccer\"\"\n\nRepeat of a Dragon Tales story first aired earlier in the season.\n\n#22201   \"\"Room for Change\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-24","episode_number":23,"episode_type":"standard","id":81212,"name":"Rise and Bloom / Dragon Scouts","overview":"#30201   \"\"Rise and Bloom\"\"\n\nRepeat of a Dragon Tales story first aired earlier in the season.\n\n#21202   \"\"Dragon Scouts\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-25","episode_number":24,"episode_type":"standard","id":81213,"name":"Musical Scales / Something's Missing","overview":"#30301   \"\"Musical Scales\"\"\n\nRepeat of a Dragon Tales story first aired earlier in the season.\n\n#20702   \"\"Something's Missing\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":"/gFDM0SqVpMQEjii56k5ezxKYbmz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-28","episode_number":25,"episode_type":"standard","id":81210,"name":"Green Thumbs / Hand in Hand","overview":"#21402   \"\"Green Thumbs\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.\n\n#30302   \"\"Hand in Hand\"\"\n\nRepeat of a Dragon Tales story first aired earlier in the season.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-29","episode_number":26,"episode_type":"standard","id":81217,"name":"Cassie, the Green-Eyed Dragon / Hello, Ms. Tipps","overview":"#20701   \"\"Cassie, the Green-Eyed Dragon\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.\n\n#32702   \"\"Hello, Ms. Tipps\"\"\n\nMax, Emmy and Enrique don't have school today, but they are joining the dragons at the School in the Sky. Quetzal was going to read them the story of Prince Griffin and the Golden Unicorn, about Dragon Lands' greatest hero, but it turns out that he has to leave for the day to attend a conference on the other side of Dragon Land. He leaves the class in the hands of his former student Ms. Tipps, a nymph with an always-excited-sounding voice and her own special way of doing things. At first, everyone finds it hard to get used to Ms. Tipps' changes, but Lorca especially misses Quetzal's way of doing things. Still, he finds himself enjoying some of the new things and finds his fear of Ms. Tipps' changes lessening.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":"/ra5SLJDQ4mt98l3i74oKMxWE9zG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-30","episode_number":27,"episode_type":"standard","id":81218,"name":"Super Snow Day / Make No Mistake","overview":"#30202   \"\"Super Snow Day\"\"\n\nRepeat of a Dragon Tales story first aired earlier in the season.\n\n#22101   \"\"Make No Mistake\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-31","episode_number":28,"episode_type":"standard","id":81221,"name":"Finders Keepers / A Storybook Ending","overview":"#20301   \"\"Finders Keepers\"\"\n\nRepeat of a Dragon Tales story first aired in Season Two.\n\n#32902   \"\"A Storybook Ending\"\"\n\nIts time for Quetzal to read from the Magic Story Book, but Enrique has never chosen a story. Searcheing through pages of amazing 3D imagery, he comes across the story that has a young Quetzal in it. Quetzal begins to tell the story of Quetzal's Fabled Quest and the gang is whisked into the story. Now Enrique too, shares in the actual live story experience that Max, Emmy and the dragons have so enjoyed in the past.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-01","episode_number":29,"episode_type":"standard","id":81220,"name":"Just the Two of Us / Cowboy Max","overview":"#22501   \"\"Just the Two of Us\"\"\n\nOn a strange weather day in Dragon Land, Zak and Wheezie are working on a secret project that they don't want to let anyone know about until it's finished. They keep getting ideas for new things to do and find that things turn out better when they invite their friends to help them with their project.\n\n#22502   \"\"Cowboy Max\"\"\n\nWhen some traveling ponies come to Dragon Land, Max wants to ride. He'll make just like a Mexican charro with Ord, but finds himself scared of riding. His friends come up with ways to help him get over his fear.","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-11","episode_number":30,"episode_type":"finale","id":81219,"name":"Flip Flop / Just for Laughs","overview":"#30601   \\\"\\\"Flip Flop\\\"\\\"\n\nWhile rummaging through a Cave Swap, a sort of Dragon Land garage sale, Wheezie is astounded by a nice two-headed golden statue. Zak chimes in, starting an argument with Wheezie on her junk collection. While holding on the statue, Zak and Wheezie wish they could understand how the other feels. The statue starts to glow causes them to flip flop! Zak acts like Wheezie, and Wheezie acts like Zak! The switched personalities could help each to understand each other better, assuming that they can get back to normal.\n\n#22201   \\\"\\\"Just for Laughs\\\"\\\"\n\nRepeat of a Dragon Tales story first aired as part of Season Two. In addition, this is the series finale of \\\"Dragon Tales\\\".","production_code":"","runtime":30,"season_number":3,"show_id":1585,"still_path":"/g1iBxxsVNe4P0xdzXX5qgb56Zjt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":4347,"poster_path":"/Bv5trKD6YhC4zyTjwHTKH2obZQ.jpg","season_number":3,"vote_average":0}}}