{"adult":false,"backdrop_path":"/qge31yAWAFb5S48UEeuzt9UEqs5.jpg","created_by":[{"id":1219449,"credit_id":"5d92b9c1168ea30025948351","name":"Rick Ungar","gender":1,"profile_path":null}],"episode_run_time":[24],"first_air_date":"2006-08-06","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"","id":16815,"in_production":false,"languages":["en"],"last_air_date":"2008-03-22","last_episode_to_air":{"id":1942502,"name":"Cats and Dogs and Dragons","overview":"Our heroes set out to search for Dr. Beverly Wallis, an archaeologist friend of Master Chin's, who went missing.","vote_average":0,"vote_count":0,"air_date":"2008-03-22","episode_number":4,"episode_type":"standard","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null},"name":"Legend of the Dragon","next_episode_to_air":null,"networks":[{"id":15,"logo_path":"/12roOdtGhLUriCtk1Qwu9eD5Nab.png","name":"CBBC","origin_country":"GB"}],"number_of_episodes":39,"number_of_seasons":2,"origin_country":["GB"],"original_language":"en","original_name":"Legend of the Dragon","overview":"Legend of the Dragon is an animated series consisting of 26 episodes followed by 13 additional episodes for a total of 39 episodes. It is produced by BKN and premiered in October 2006 as part of the Jetix block on Toon Disney. Subsequently, the two part episode \"Trial by Fire\" was shown as a Jetix Blockbuster on ABC Family in August before all Jetix programming moved to Toon Disney.\n\nIn the UK, the first 26 episodes have aired across CBBC. It premiered in Summer 2005 on the CBBC channel. It is unclear of whether the additional 13 episodes will be shown or not. Episodes 27–39 have begun airing in Australia on Network Ten's Toasted TV as of March 19, 2008.","popularity":6.373,"poster_path":"/1haLf3upZNAJprM6SKiyRgvkyAE.jpg","production_companies":[{"id":125458,"logo_path":null,"name":"BKN International","origin_country":""}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"},{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2006-08-06","episode_count":26,"id":133351,"name":"Season One","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2008-03-19","episode_count":13,"id":133352,"name":"Season Two","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8,"vote_count":6,"season_data":{"1":{"_id":"5d92ba05168ea3002e945b8c","air_date":"2006-08-06","episodes":[{"air_date":"2006-08-06","episode_number":1,"episode_type":"standard","id":1942471,"name":"Trial by Fire, Part One","overview":"The last Golden Dragon has died and a new one must be chosen. There are only two individuals available: Ang Leung and Ling Leung, fifteen year-old twins who are both highly accomplished in martial arts and knowledgeable of the ancient philosophies of the Golden Dragon. They both start out having a martial arts workout at their Dojo as usual, accompanied by Beingal. Suddenly, Master Chin arrives and tells them a new Golden Dragon needs to be selected. Master Chin also tells Beingal to travel back to her temple since she has been selected as Guardian of the Temple of the Tigers. Everyone sets off, but not before a certain Snake sees and follows them.\n\nMeanwhile, in a forest, warriors invade a temple and go right into the center to find a statue of Snake. In the middle of the body, they find a pit full of Snakes, which start to form a tower and reveals a woman. She is Cobra, Guardian of the Temple of the Snakes, and they have violated her temple. She pulls the Powerband of the Snakes out of the Snake Statue’s Mouth and empowers her band, attacking the warriors and managing to defeat them. However, before she can defeat the last one, a person appears from behind the statue wearing the Zodiac sign and green clothes: he reveals himself as the Zodiac Master. He immediately places a small tiny disc bomb in the Snake Statues Mouth, causing it to explode and blow all the debris towards Cobra. It pins her down, allowing enough time for the Zodiac Master to steal her mystical Powerband from her.\n\nBack in Hong Kong, Ling cannot contain herself. She is overconfident that she will be the Golden Dragon. Ang is also certain that Ling will be chosen, which would place a great responsibility upon one of them besides great power. Soon they arrive at the Dragon Temple, entering to find themselves in front of a Dragon head with flames in its mouth. Master Chin approaches a stage in front of the head showing all the signs of the Zodiac symbols. The temple begins to glow from the mouth and reveals the Powerband of the Dragons.\n\nThe Powerband chooses Ang to be the new Golden Dragon. Ling, who was too confident in thinking she was going to be the new Dragon, is bitten with jealously. Feeling humiliated, she tries to take the band away from him but has no luck. Then, the same man who took Cobra's powerband arrives with his warriors in the temple. He introduces himself as the Zodiac Master, but Master Chin reveals him as Woo Yin, one of his former students, even though Zodiac Master rejects that name. Ling immediately attacks the warriors. Master Chin keeps Ang from fighting until Ling actually defeats all the warriors and is tangled up by King Cobra Snake (Zodiac Master’s Pet). Ang then empowers the Dragon band and the new Golden Dragon fights the Zodiac Master. He is eventually defeated and the Snake Powerband now teleports itself to Ang.\n\nThe Zodiac Master is now defeated, his Snake Powerband has gone, his warriors are defeated, along with that his plan has failed. With that, he decides to leave. Master Chin tells Ang that upon defeat, the Powerbands go to the victor, even to dark forces. He turns to Ling to tell her that the Golden Dragon has to be someone who knows the responsibility of the power and then leaves. Ling, vowing that one day she will wear that band, runs out of the temple.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-08-14","episode_number":2,"episode_type":"standard","id":1942472,"name":"Trial by Fire, Part Two","overview":"With Ang being the new Golden Dragon, he searches inside the Dragon Dojo for Ling and finds her by the entrance but is still angry until Master Chin arrives and she yells at him for not being picked as the next Dragon and tells him that she will have it no matter what she has to do to get it and leaves. Ang tries to go after her, but is stopped by Master Chin because she must choose her own path and they have much work to do.\n\nThey descend into the Dragon Temple, where Master Chin gives Ang a lesson on the 12 symbols in front of the Dragon head. He explains that once the Golden Dragon has managed to get the other Guardians bands back from the Zodiac Master, the bands are to be placed on top of the Zodiac Symbol. Ang tests with the Snake Powerband they retrieved from the Zodiac Master and places it on top of the Snake Symbol and the image of a Snake then takes the band back to the Temple of the Snakes. Master Chin goes on to explain these also act as warning beacons: whenever a temple is in danger or has been violated or the Guardian themselves are in danger the symbol will glow and right that second, the Dragon symbol begins to glow, suggesting that someone has broken into the Dragon Temple. Ang powers up and finds a small male wearing a white-red mask hopping mad round the temple trying to evade Ang.\n\nOutside, Ling is upset and is approached by the Zodiac Master to step into the dark of Yin, while stepping out of the light of Yang. He takes her to his hideout on a small island filled with all sorts of technology and the Shadow Dragon temple and offers her the chance to be a Dragon as the Shadow Dragon.\n\nBack at the Dragon Temple, Ang eventually catches the fleeing male, Master Chin identifies him as Xuan Chi, Guardian of the Temple of the Monkeys. He tells his tale of why he is there: three temple raiders raided his temple and kidnapped him along with his Powerband and took much of everything out of the temple. Xuan Chi however managed to escape and came to the Dragon Temple for help to retrieve his band back, but Ang says he cannot because he says that the band could be anywhere by now and that he has a \"nut case called the Zodiac Master\" after his own band and has to find Ling.\n\nLater on in the evening, Ang introduces technology to a confused Xuan Chi and watches him play a game on his computer. Before he can carry on, Ling shows up and Ang asks where she has been, but Master Chin answers it with the Zodiac Master. At first Ang is in denial that she would not join the Zodiac Master. But when he empowers his band and sees Ling full of dark energy and asks her what she has done, she replies that she chose her own destiny. Master Chin confirms that his sister is now their enemy. Ling then empowers her new band, reveals that she is the new Shadow Dragon and begins to fight Ang.\n\nAng dodges every attack and does not want to fight her, but soon has no choice when she defeats Xuan Chi in the fight and he defeats her with a single power blast. She makes a hasty retreat, while Ang wonders how is he ever going to stop the Zodiac Master, now along with the Shadow Dragon, but Master Chin manages to say he will find a way in the long journey ahead of him. Xuan Chi now joins the two of them on their journey.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-04","episode_number":3,"episode_type":"standard","id":1942473,"name":"Eye on the Tiger","overview":"The Zodiac Master and the new Shadow Dragon go after Beingal for the Powerband of the Tigers. It becomes a matter of time for Ang to get to the Tiger Temple to stop them destroying the Temple itself and to keep the band safe. When Ling defeats Beingal, she yells \"no\" and jumps down and catches Beingal, the Zodiac Master says she is weak and that she saved her because she was once her friend, but she says it's because they need Beingal to lure the Golden Dragon to the Tiger Temple.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-05","episode_number":4,"episode_type":"standard","id":1942474,"name":"Hero Worship","overview":"After the Zodiac Master's defeat, he targets Ang’s number one actor. Ang must now protect his number one stubborn actor at the Dragon Dojo, while not trying to let Master Chin know.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-06","episode_number":5,"episode_type":"standard","id":1942475,"name":"Terra Unfirma","overview":"The Zodiac Master goes after the Earth Signs, which include Dog, Ram, Ox and Dragon. The Shadow Dragon (Ling) attacks the Dog temple and manages to get the Dog Power Band and the Zodiac Master gets the Ram Power Band. They both go after the Ox as their next target, thus Ang must stop them, but the question is can the Zodiac Master really control all that power he is using?","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-09","episode_number":6,"episode_type":"standard","id":1942476,"name":"Master of Sarcasm","overview":"Ang and Xuan Chi travel to Vietnam to a guy named Shoong, who is a master of sarcasm and is seen by Ang and Xuan Chi as bossy until it is revealed that he is the Guardian of the Temple of the Pigs.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-10","episode_number":7,"episode_type":"standard","id":1942477,"name":"Temple of Changes","overview":"Ang has a rough time as he goes through a series of tests, which every Golden Dragon must take like entering the Temple of Changes.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-11","episode_number":8,"episode_type":"standard","id":1942478,"name":"Mindbender","overview":"During a fight with Ling in the Dragon Temple, Ang loses his memory after getting struck by falling rocks from the ceiling. She convinces him that he works with a man called the Zodiac Master.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-12","episode_number":9,"episode_type":"standard","id":1942480,"name":"Chow Chow","overview":"Ling is in trouble after the Emperor gives her power but tries to pull her into his tomb. When Ling arranges to meet Ang to ask for his help, the Zodiac Master reads her email and turns up, making Ang believe it is all an act. Ang has hidden his band somewhere and the Zodiac Master threatens to destroy Ling if he does not give up the band. Ang gives in and when they go to the hiding place, the band is not there. Meanwhile, the other temple guardians have turned up to the Temple of the Dragon to honor the new Dragon but they find he is not there. So Chow, the Dog guardian, as well as Xuan Chi go looking for Ang, when Xuan Chi finds the Dragon band.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-13","episode_number":10,"episode_type":"standard","id":1942481,"name":"Monkey Mission","overview":"Xuan Chi senses that the Monkey Powerband may have not been taken by the Temple Raiders. He goes back to his temple to go and find out, but so does the Zodiac Master.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-16","episode_number":11,"episode_type":"standard","id":1942482,"name":"The Emperor of the Darkest Yin","overview":"Ang encounters a fierce but incompetent fighter who calls himself 'the Master of Red Chi'. After defeating and embarrassing him, he takes him back to the Dragon Dojo, where the Red Chi Master alleges he wants revenge on the Zodiac Master for leaving him. Master Chin gives Ang an important message \"When you try to use the force of evil, it is the evil that ends up using you\"","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-17","episode_number":12,"episode_type":"standard","id":1942483,"name":"The Last Dragon","overview":"Ang and Ling discover that the last Golden Dragon was their own father. They discover this during a special time of year where all twelve guardians meditate while their Powerbands recharge to full strength and mystic energy. The Zodiac Master sees this as an opportunity to strike. Ling and Ang work together and they hug. Ang thinks Ling will come back, but she chooses differently.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-18","episode_number":13,"episode_type":"standard","id":1942484,"name":"Spy Hard","overview":"Ang travels off to the Rooster Temple to take care of trouble after the warning rose in the Dragon Temple. But it is a trap as the Zodiac Master brings a sorceress to corrupt the Dragon Temple spirit.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-19","episode_number":14,"episode_type":"standard","id":1942485,"name":"Sister, Sister","overview":"The Shadow Dragon takes the Rabbit Power Band, but it is damaged and has created four copies of Ling, each with their own personality, causing trouble for Ang and even the Zodiac Master. It is seen that Ang seems to have a bit of a crush on the Rabbit Guardian, Hye.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-20","episode_number":15,"episode_type":"standard","id":1942486,"name":"Associating With Vermin","overview":"Ang is lured into Ling’s traps again, this time tricking Ang to think the Guardian of the Temple of the Rats (Ming) is Ling in disguise.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-23","episode_number":16,"episode_type":"standard","id":1942487,"name":"Shell Game","overview":"Xuan Chi’s Monkey Powerband has been found by Ang, but he is unable to take it because it is on display at the museum. But Zodiac Master has other ideas. As he is about to take it, he spots a suit of armor that the emperor of the darkest Yin wore in fights and brings the suit to life. He gives the Monkey band to him and chaos ensures, as Xuan Chi is mad on getting his band back.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-24","episode_number":17,"episode_type":"standard","id":1942488,"name":"Thief of Power","overview":"An ex-guardian escapes from jail, with the help of Master Chin and Shoong (Guardian of the Pig). Meanwhile, back at the Dragon Dojo, the escaped convict who identifies himself as Tommy wants Master Chin, but gets nowhere and leaves. Ang, Beingal and Xuan Chi travel to Vietnam to find some answers.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-25","episode_number":18,"episode_type":"standard","id":1942489,"name":"Horse Play","overview":"The Guardian of the Temple of the Horse is in danger, but Ang has to find the Temple first. What sort of test faces him?\n\nThe Horse band is seen in this episode. But it is not seen as being empowered.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-26","episode_number":19,"episode_type":"standard","id":1942490,"name":"It's Always Darkest Before Xuan","overview":"Xuan Chi is now starting to get tired of the one who does not have a Powerband and is useless. It does not help when the former Monkey Guardian arrives and criticize him how he disgraced the name of Monkey. He begins to sink so low that he travels back to his own temple and finds the Shadow Monkey Powerband and wears it.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-27","episode_number":20,"episode_type":"standard","id":1942491,"name":"Venom","overview":"The Snake Guardian is in mortal danger as the Zodiac Master’s pet King Cobra has bitten her and taken the Snake Powerband himself. Soon Ang must face him when he gets Beingal’s Powerband of the Tigers, but using his own band and the Shadow Dragon Band borrowed by Ling.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-28","episode_number":21,"episode_type":"standard","id":1942492,"name":"Empower the Darkest Ling","overview":"When the Emperor of the darkest Yin possess the Zodiac Master, they also possess Ling, who is then turned into a green Dragon. She goes off to find four Powerbands to return the Emperor of the Darkest Yin to life.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-31","episode_number":22,"episode_type":"standard","id":1942493,"name":"Hair of the Dog","overview":"A mad scientist turns himself into a big Dog, prompting the Dog Guardian to stop him and is defeated. Ling joins forces with Ang in order to protect the Dog Guardians pet Dog from harm, as well as to go and find and defeat the mad scientist.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-01","episode_number":23,"episode_type":"standard","id":1942494,"name":"X-Games Guardians","overview":"A street urchin girl steals the Ram Powerband from the Zodiac Master, leaving the Shadow Dragon (Ling) to get the band from her and Ang, Beingal and Xuan Chi then join in pursuit of the band.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-02","episode_number":24,"episode_type":"standard","id":1942495,"name":"Lost and Found","overview":"The Zodiac Master goes after the Ram Powerband again and manages to take it, along with the Snake Powerband. However, when Ling touches it, she has a vision of her long-lost mother of being the Ram Guardian and asks Ang to help her find information about her.\n\nSoon they found out she was the Ram Guardian and had frequently worked alongside their father, the previous Golden Dragon, against the Zodiac Master. In time, they fell for one another, married, and had fraternal twins Ang and Ling. However one day, Zodiac Master attacked her. She survived the attack, but lost all her memory of who she was and of her new family. They both set off to see their mother at the Ram Temple, but not without the Zodiac Master interfering.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-03","episode_number":25,"episode_type":"standard","id":1942496,"name":"Monkey See Monkey Do","overview":"Its Xuan Chi’s birthday and his present is the Monkey Powerband, but it is found on a ship tanker. But the Zodiac Master gets the Band first. Will Xuan Chi get his Powerband back or lose it again?","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-06","episode_number":26,"episode_type":"finale","id":1942497,"name":"Double Dragon","overview":"The Emperor of the darkest Yin has returned to life thanks to the Zodiac Master and Ling with four Powerbands. He sets a test for Ling to get the Powerband of the Golden Dragon. She goes to the Dragon Dojo and defeats Ang, Beingal and Xuan Chi, but the Band is not teleporting itself to Ling. Master Chin informs her to take the band from her brother, she must kill him. She cannot do it and ends up crying, tossing the Shadow Dragon Band across the room and telling Master Chin she does not want it anymore. However, Master Chin tells her she has passed her test.\n\nMaster Chin tells Ang, Ling, Beingal and Xuan Chi that this was a test for Ling to see if she herself can be the Golden Dragon. Master Chin retrieves the Shadow Dragon Band, gets Ang’s Golden Dragon Band and tosses them in the air. The bands combine and fuse for a moment, killing the Shadow Dragon Spirit, then separate to become two Golden Dragon bands, meaning Ang and Ling are now twin golden Dragons. They now both go on to take on the Emperor of the Darkest Yin, along with all the other Temple Guardians.","production_code":"","runtime":24,"season_number":1,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season One","overview":"","id":133351,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5d92ba27168ea30012946c13","air_date":"2008-03-19","episodes":[{"air_date":"2008-03-19","episode_number":1,"episode_type":"standard","id":1942498,"name":"The Temple of the Shadow Dragon, Part One","overview":"The Emperor destroys the Temple of the Golden Dragon, forcing Ang and Ling to look for the Shadow Dragon Temple.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-20","episode_number":2,"episode_type":"standard","id":1942499,"name":"The Temple of the Shadow Dragon, Part Two","overview":"Ang and Ling to travel to the Shadow Dragon Temple, to recharge their bands with Dark Yin Energy. Master Chin turns the Shadow Dragon Temple into the Double Golden Dragon Temple.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-21","episode_number":3,"episode_type":"standard","id":1942500,"name":"Enter the Wolf","overview":"Ang and Ling encounter K-Ho, the Guardian of the Temple of the Shadow Wolf.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-22","episode_number":4,"episode_type":"standard","id":1942502,"name":"Cats and Dogs and Dragons","overview":"Our heroes set out to search for Dr. Beverly Wallis, an archaeologist friend of Master Chin's, who went missing.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":5,"episode_type":"standard","id":1942503,"name":"Shadow Tiger Take Two","overview":"Our heroes test Ling's latest amphibious super craft and play tourists where Wang Lee and his famous new co-star Karin Kwan are making an action packed movie.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":6,"episode_type":"standard","id":1942504,"name":"A Horse of a Different Color","overview":"Our heroes set out to White Horse in England to see if the Shadow Horse temple is indeed hidden below the famous cliffs.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":7,"episode_type":"standard","id":1942505,"name":"Rat Attack","overview":"Yin-Wi's repeatedly failed attempts to steal the twin power-bands of the Golden Dragons' have left everyone drained of nearly all of their mental and spiritual energies, Ang's in particular.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":8,"episode_type":"standard","id":1942506,"name":"Spellbound","overview":"Yin-Wi concocts a plan to show her older brother, the Emperor of the Darkest Ying, what she can do to further develop his dark powers, as well as increase them to tremendous levels","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":9,"episode_type":"standard","id":1942507,"name":"Friend or Foe","overview":"Yin-Wi is captured by Ang and Ling's combined Dragon Fire power. As such, she forfeits her dark power band.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":10,"episode_type":"standard","id":1942508,"name":"The Golden Baby-Sitter Blues","overview":"After Sabre-Claw runs the Ox Guardian out of the Temple of the Ox, the eight-year-old boy seeks refuge at Master Chin's dojo.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":11,"episode_type":"standard","id":1942509,"name":"Gone Shadow Ape","overview":"Ang and Master Chin are off in Hong Kong following a lead on the missing Monkey Power Band, while Ling and Beingal keep an eye on the Dragon Temple in San Francisco.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":12,"episode_type":"standard","id":1942510,"name":"It's A Dog-Eat-Wolf World","overview":"Along with Ang, K-Ho goes to the wintry region and learns that a trio of ruthless men in a chopper are harassing the wolves for pleasure and for profit.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":13,"episode_type":"finale","id":1942511,"name":"The Heart of the Dragon","overview":"The Emperor and his sister, the Empress, discover the location of a supremely powerful, mystical artifact known as \"the Heart of the Black Dragon.\" However, Ang and Ling are in search of the mystical Heart of the Golden Dragon itself. With it, Ang and Ling succeed in finally obliterating the Emperor of the Darkest Ying, and break the dark Heart of the Black Dragon in the process.","production_code":"","runtime":24,"season_number":2,"show_id":16815,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season Two","overview":"","id":133352,"poster_path":null,"season_number":2,"vote_average":0}}}