{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2000-03-05","genres":[],"homepage":"","id":17560,"in_production":false,"languages":["en"],"last_air_date":"2001-03-24","last_episode_to_air":{"id":556799,"name":"Viva Zapatos","overview":"After his team stops at a diner where he meets Celeste, Cuban soccer player Lazaro decides to defect to the U.S.  The FBI asks Danny to keep Lazaro at the Arno house for a few days to find out if he's really a defector or, perhaps, a terrorist.  A suspicious Danny puts a tracking device in Lazaro's sneakers, and then follows Celeste and Lazaro when she offers to take him to the mall. On the way there, Lazaro asks Celeste to stop at a hotel where his teammates are staying.  As a surprised Celeste watches, Lazaro tries to convince his frightened girlfriend Marisol to defect also, and they agree to meet secretly at the sports arena the next day.  Meanwhile, Danny has learned from the FBI that Lazaro is probably carrying a bomb.  Are the FBI's suspicions correct?  And if so, is Marisol also involved-and can Celeste stay out of a potentially explosive situation?","vote_average":0,"vote_count":0,"air_date":"2001-03-24","episode_number":25,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null},"name":"Cover Me: Based on the True Life of an FBI Family","next_episode_to_air":null,"networks":[{"id":30,"logo_path":"/g1e0H0Ka97IG5SyInMXdJkHGKiH.png","name":"USA Network","origin_country":"US"}],"number_of_episodes":25,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Cover Me: Based on the True Life of an FBI Family","overview":"Cover Me: Based on the True Life of an FBI Family is an American television series which ran from March 5, 2000 to March 24, 2001 on the USA Network.","popularity":2.941,"poster_path":"/oRPFTNvlogg6IuBJ7uKUWCQ3UKo.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2000-03-05","episode_count":25,"id":28449,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":1,"vote_count":1,"season_data":{"1":{"_id":"52585245760ee34661066827","air_date":"2000-03-05","episodes":[{"air_date":"2000-03-05","episode_number":1,"episode_type":"standard","id":556776,"name":"Just Act Normal","overview":"The Arnos go undercover to bring down vicious mobster Freddie Jacon, who firebombs building contractors who refuse to work with him. Danny suits up as a crooked union official, Barbara plays a seductress, the girls get involved with the mobster's teenaged son, and Chance witnesses first-hand how unpredictably dangerous his father's work can be.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-12","episode_number":2,"episode_type":"standard","id":556777,"name":"The Line","overview":"The Arnos go undercover to bring down Steven Kesseling, a crooked stockbroker who is stealing from his clients and selling worthless stock at inflated prices. Celeste's involvement with Kesseling's son winds up putting her in great danger, while Chance fears his father may have gone too far undercover as he watches Danny fall under the spell of a beautiful female suspect. Is Dad just doing his job - or has he crossed the line?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52585245760ee34661066860","adult":false,"gender":2,"id":160161,"known_for_department":"Acting","name":"Shaun Cassidy","original_name":"Shaun Cassidy","popularity":5.994,"profile_path":"/vUodMfHaiJT4k9cSF5yI71kjOeb.jpg"},{"department":"Directing","job":"Director","credit_id":"52585245760ee34661066870","adult":false,"gender":2,"id":75342,"known_for_department":"Acting","name":"Tony Dow","original_name":"Tony Dow","popularity":5.766,"profile_path":"/b1j04svpGN0YVJFKC8UukUutDRi.jpg"},{"department":"Writing","job":"Writer","credit_id":"52585245760ee34661066852","adult":false,"gender":2,"id":1223736,"known_for_department":"Writing","name":"Mark Saraceni","original_name":"Mark Saraceni","popularity":2.076,"profile_path":null}],"guest_stars":[]},{"air_date":"2000-03-19","episode_number":3,"episode_type":"standard","id":556778,"name":"Domestic Terrorism","overview":"A routine surveillance assignment winds up putting the Arno's lives in danger when Chance and Ruby witness a gangland murder while working undercover as baby-sitters at a crooked councilman's house. Now Danny must risk his life to prevent the killers, led by mobster Rudy Novatny, from hunting down his entire family.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-02","episode_number":4,"episode_type":"standard","id":556779,"name":"Where Have You Gone, Sandy Koufax","overview":"While working to implicate a wealthy accountant in the murder of his partner, the Arnos cross paths with Spiros Damalis, a crooked New Jersey club owner they investigated eight years earlier for the murder of a cocktail waitress. Is Damalis connected to the current crime? Will he blow the Arnos cover? And does he still hold a dangerous torch for Barbara?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-09","episode_number":5,"episode_type":"standard","id":556780,"name":"Perfect Frank","overview":"Danny is assigned to investigate Eddie Breeze, who is running a bookmaking ring from the back room of his local ice cream parlor. Breeze is part of a larger criminal organization, the head of which the FBI wants to nail for several murders. Hoping to implicate Breeze, Danny makes a number of big bets guaranteed to lose, but Breeze keeps covering his losses. Chance is placed on the inside as a counterman at the ice cream parlor, and Barbara also attempts to make some bad bets, but no one is able to make any headway in the investigation.  Finally, Danny lets his family convince him to seek the assistance of a seasoned bookie from his past: his imprisoned brother, Frank.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-16","episode_number":6,"episode_type":"standard","id":556781,"name":"Beauty Marks","overview":"When three young Mexican girls trying toget into the U.S. are found dead in the trunk of a car from carbon monoxide poisoning, the FBI suspects fashion designer and possible sweatshop owner Gabrielle Vega is to blame, and Danny is assigned to the case.  Danny poses as a buyer from an East Coast department store interested in Vega's new line, while Ruby enters Vega's beauty pageant/fashion show. Barbara hams it up as a \"\"stage mom,\"\" while Chance poses as a \"\"youth-in-media photographer\"\" and snaps pictures of potential suspects -- especially the pretty ones.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-23","episode_number":7,"episode_type":"standard","id":556782,"name":"Our Mister Brooks","overview":"While investigating a dangerous heroin dealer named Gina, Agent Brooks is shot by an unknown assailant and dies in Danny's arms.  Unwilling to blow his cover-and convinced the shooting is related to the drug bust-Danny strikes out on his own to find the culprit. Meanwhile, Barbara, Celeste and Ruby host a birthday party for Chance and four of his friends, and havoc soon ensues in the Arno house as the party guests discover incriminating family secrets that threaten their cover.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-07-26","episode_number":8,"episode_type":"standard","id":556783,"name":"The Fever Flip","overview":"Danny has been telling \"\"The Fever Flip\"\" story to his kids for years, but Barbara hates the story and wishes Danny would stop talking about it. It's all about a case he and a \"\"talented female partner\"\" worked on before the kids were born. Cary Fever had been a pornographer who brought under-aged girls across state lines to be in his pictures. But when they brought him down, Danny and his partner went too far while busting Fever-they wound up ruining Fever's whole life. Now Fever has tracked Danny down, and he's seeking revenge. Fever starts toying with Danny, but his real target is actually Danny's old female partner. And now Barbara's seemingly irrational fears about the story have become justifiable: SHE was Danny's talented female partner...","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-08-02","episode_number":9,"episode_type":"standard","id":556784,"name":"Turtle Soup","overview":"A rare albino turtle has been stolen, Celeste has found a new \"\"cause,\"\" and Danny's not happy about any of it. After attending a meeting of animal rights activists, Celeste decides to help the group rescue some kittens from a local medical research facility. This means breaking and entering, and Danny is furious that she will be breaking the law, even if it is for a noble reason. The situation goes from bad to worse when Danny discovers that the activists' ringleader, Peter Logan, is under Federal investigation for animal smuggling. That investigation takes a strange turn when Peter is mysteriously killed-while Celeste is talking to him on the phone. Now Celeste is a suspect in the police's murder investigation, and it's up to Danny, Barbara, and the kids to find a turtle ...  and a killer.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52585246760ee346610668f3","adult":false,"gender":0,"id":1237280,"known_for_department":"Writing","name":"Joanne Waters","original_name":"Joanne Waters","popularity":0.6,"profile_path":null},{"department":"Directing","job":"Director","credit_id":"52585246760ee34661066903","adult":false,"gender":2,"id":1225933,"known_for_department":"Directing","name":"Philip Sgriccia","original_name":"Philip Sgriccia","popularity":0.676,"profile_path":"/6Con9mY0G3XbzKheDg8nSLIf9ED.jpg"}],"guest_stars":[]},{"air_date":"2000-08-09","episode_number":10,"episode_type":"standard","id":556785,"name":"F.B.I.V.","overview":"When aging Mafia kingpin Joe Collado retreats to a luxury resort-style hospital, the FBI suspects he's only pretending to be crazy in order to escape an indictment. To find out for sure, Danny checks in as a patient, and the family tags along to help him check out the mobster. Their biggest obstacle: the mobster's brother Anton, a murderer with too much to loose if the ruse fails. He's put up a strong wall of defense so far, but even he has a soft spot-Vicky, a beautiful nurse from the hospital who he's been dating. Chance is immediately smitten with her as well. While Celeste flirts with Danny's doctor and Ruby helps set up surveillance equipment, Barbara discovers that one of the other residents at the hospital is a crook she and Danny put in jail 15 years ago. Unsure if this other criminal is involved as well, Danny sends Chance to check him out, but instead, Chance discovers his favorite nurse could be the key to bringing down a killer.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-08-16","episode_number":11,"episode_type":"standard","id":556786,"name":"Bazooka Joe","overview":"Danny goes undercover as a small-time gun dealer to infiltrate a local mob crew, but just when he's making headway with one of the crew boys, his contact turns up belly-up in the ocean. Was he whacked by his own crew? Danny slowly establishes contact with the remaining mobsters and gets them interested in a phony bazooka heist, hoping to gain their trust and uncover the murderer. Meanwhile, the Arno family becomes completely \"\"Italianized\"\" as the Andreotti's, and even get access to an undercover home to entertain mob boss Charlie \"\"Diggs\"\" Digliero. But the bazooka plan arouses suspicion, and when Chance accidentally blows their cover on the docks, the undercover cover house meets with an explosive end-right before Chance's eyes. Is Chance the only Arno left?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52585245760ee34661066860","adult":false,"gender":2,"id":160161,"known_for_department":"Acting","name":"Shaun Cassidy","original_name":"Shaun Cassidy","popularity":5.994,"profile_path":"/vUodMfHaiJT4k9cSF5yI71kjOeb.jpg"},{"department":"Writing","job":"Writer","credit_id":"52585245760ee34661066852","adult":false,"gender":2,"id":1223736,"known_for_department":"Writing","name":"Mark Saraceni","original_name":"Mark Saraceni","popularity":2.076,"profile_path":null}],"guest_stars":[]},{"air_date":"2000-08-23","episode_number":12,"episode_type":"standard","id":556787,"name":"The Book of Danny","overview":"The Arnos are settling into their new home in Utah when they receive a visit from an FBI accountant. Danny is shocked when he is told that he's being investigated for \"\"misappropriation of funds.\"\" In an even more bizarre twist, Danny's brother Frank suddenly shows up at the house after having been released from prison early. Danny meets with Aubrey Lang, the head of the Utah FBI, and soon becomes convinced that Lang is out to get him. Later, at his hearing, Danny finds out that Lang made a deal with Frank to get incriminating evidence on Danny's past.  Hoping to redeem himself to Danny, Frank follows a hunch, and discovers it may not be Lang who's out to get Danny after all.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-09-13","episode_number":13,"episode_type":"standard","id":556788,"name":"In Plain Sight","overview":"Danny and Chance leave town for a few days to work on a case at a nearby Indian reservation, where Danny thinks he'll be able to show Chance how to gamble. But the case isn't as child-friendly as Danny had anticipated: it seems that Clifford Harris, a teacher at the local high school, may be molesting one of his students. Meanwhile, Celeste is having school trouble of her own-she doesn't know how to make new friends because of the way the Arnos have to live. She finally meets a girl in her class, Robin, who she seems to have a lot in common with. But Ruby realizes there's trouble when she discovers that Robin's mother is on the FBI's \"\"Most Wanted\"\" list.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-09-20","episode_number":14,"episode_type":"standard","id":556789,"name":"Killing Me Softly","overview":"On the trail of known arsonist and murderer Anthony Rossi, Danny and Barbara stage a divorce-without confirming for the kids that it's all for show. The plan: to catch Rossi in the act of offering his known hitman services to Danny. The murder-for-hire offer comes as anticipated, but Danny is unsuccessful at getting the offer on tape. Now the only way to get a conviction that will stick is to catch Rossi in the act of killing Barbara.  The danger becomes worse when Rossi insists on including an unpredictable, trigger-happy partner in the plan, a partner who soon begins to suspect a set up and winds up being a threat to the entire Arno family.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52585246760ee34661066970","adult":false,"gender":2,"id":159823,"known_for_department":"Writing","name":"Michael Angeli","original_name":"Michael Angeli","popularity":2.438,"profile_path":null},{"department":"Directing","job":"Director","credit_id":"52585246760ee34661066903","adult":false,"gender":2,"id":1225933,"known_for_department":"Directing","name":"Philip Sgriccia","original_name":"Philip Sgriccia","popularity":0.676,"profile_path":"/6Con9mY0G3XbzKheDg8nSLIf9ED.jpg"}],"guest_stars":[]},{"air_date":"2000-09-27","episode_number":15,"episode_type":"standard","id":556790,"name":"The Hit Parade","overview":"Danny goes undercover as an assassin, and is hired to whack two guys by Michael Pappas, a middleman for a number of higher-up criminals. Danny and Chance stage the \"\"hits\"\" and take the intended victims, Barrett and Gil, to an FBI safe house. Both claim no knowledge of anyone who would want them whacked, and deny having previously met one other.  But it is soon revealed that they do know each other-and Pappas. The case turns out to be much bigger than originally realized: the three are responsible for the largest Brinks truck robbery ever, and have been trying to knock one another off ever since.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-01-07","episode_number":16,"episode_type":"standard","id":556791,"name":"Absolution","overview":"Just two days before his execution, the last confession of condemned killer Henry Crowe has suddenly become very important. Someone has kidnapped the son of Adam Kondos, the District Attorney who successfully prosecuted Crowe for murdering a family.  Now the kidnapper is threatening to kill the young boy if Crowe doesn't receive a stay of execution. The Feds enlist Danny to impersonate a death row priest, in order to try to get Crowe to end his life by doing good and revealing the kidnapper's location. Can Danny get the information he needs in time to prevent a second life from ending?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-01-14","episode_number":17,"episode_type":"standard","id":556792,"name":"Vegas Mother's Day (1)","overview":"The Arnos travel to Las Vegas when Danny is assigned to go to a fading, off-the-strip casino to protect Linson, the casino's owner and a former mobster who's been cooperating with the FBI. The casino is the perfect place for Danny to revive his lounge act, but when mobster Lon Colomby and his mother arrive for a \"\"vacation,\"\" playtime is quickly over. Colomby fully intends to buy Linson out-using whatever means necessary.  Complicating matters further, another undercover agent, Ellen Lederer, is also at the casino working on the case, but her interest in Columby may be more than professional. Can she be trusted? The case even takes a personal turn, as Danny begins to suspect that Colomby may be the man behind the murders of his very first partner and his partner's family. Part one of two.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-01-21","episode_number":18,"episode_type":"standard","id":556793,"name":"Vegas Mother's Day (2)","overview":"The Arnos are still in Las Vegas, where Danny's assignment-to protect Linson, a casino owner and former mobster who's been cooperating with the FBI-has taken a turn for the worse. Without telling Danny, Linson has sold his casino to known mobster Lon Columby, and has now mysteriously gone missing. What's the real story behind the sale? Even worse, the sale means Columby is now the boss at the nightclub where Danny's been resurrecting his lounge act-and one of Columby's first moves is to fire Danny.  Danny appeals to Ellen Lederer (photo attached), another FBI agent who's been working the casino, for help, but her personal relationship with Columby may get in the way of bringing him to justice. Now Columby is bringing in his old Mob cronies to help him create his vision of a new (and Mafia-controlled) Las Vegas-and the best hope for stopping him might just be his mother.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-04","episode_number":19,"episode_type":"standard","id":556794,"name":"Borderline Normal","overview":"Celeste's volunteer work at a local hospital turns out to be an entry point into a scary, slightly surreal murder mystery when two nurses vanish under mysterious circumstances. After enlisting her parents' help, Celeste's fears about the nurses' whereabouts turn out to be well-founded when Danny locates their bodies. But who killed them-and why?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52585246760ee346610669d9","adult":false,"gender":2,"id":42106,"known_for_department":"Writing","name":"Chip Johannessen","original_name":"Chip Johannessen","popularity":0.938,"profile_path":null},{"department":"Directing","job":"Director","credit_id":"52585246760ee346610669e9","adult":false,"gender":2,"id":1213618,"known_for_department":"Directing","name":"Sanford Bookstaver","original_name":"Sanford Bookstaver","popularity":3.202,"profile_path":null}],"guest_stars":[]},{"air_date":"2001-02-11","episode_number":20,"episode_type":"standard","id":556795,"name":"Stings Like a Bee","overview":"Danny is assigned to bring down Pic Rocker, a notoriously sleazy boxing promoter known to do anything to win a fight-even commit murder. When the Feds learn that one of Rocker's boxers is willing to blow the whistle on him, Danny (posing as a fight manager) and Chance go to the boxer's fight to make contact  and are forced to come up with a new plan when the boxer mysteriously drops dead in the ring. Determined to get his man, Danny decides to approach Buddah Jones, a disillusioned ex-boxer formerly represented by Rocker who retired three years earlier after killing an opponent in the ring. The Arnos' influence has a healing effect on Buddah, and he finally agrees to help by announcing his return to the ring and fixing his fight with Rocker in advance. But now that the fix is in, is Buddah really working for the Feds-or for himself?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-18","episode_number":21,"episode_type":"standard","id":556796,"name":"Home for the Holidays","overview":"Following the fiery end of the Arno house and getting everyone they know in San Diego to believe that the entire family (except Chance) is dead, the Arnos set up shop in Salt Lake City, Utah. Danny is assigned to go undercover as a policeman in order to check out a suspected dirty cop, Mario Holiday.  Meanwhile, Lt. Lisa Ramone of the San Diego Police Department has lost her credibility and her job due to her obsession with finding out the truth about what really happened to the Arno family. With the help of a private detective, she learns that the Arnos may be in Salt Lake City, and she immediately heads out in hot pursuit. Her investigation soon threatens to blow Danny's cover and puts the entire Arno family in danger. Can Danny solve his case and keep Lisa from forcing his family to move again?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-25","episode_number":22,"episode_type":"standard","id":556797,"name":"The River","overview":"The FBI assigns Danny to find a young woman in rural Utah who is missing and feared dead. She was part of a polygamist community, where men take multiple wives and everyone avoids contact with the outside world. To infiltrate the clan, the Arnos pose as a polygamist family, but Celeste is none to happy to be Danny's second wife. Eli, the oldest son in the clan (photo attached) falls in love with Ruby, who tries to ditch him one night and stumbles, literally, over a dead body by the side of the river. It isn't the girl the Arnos are looking for, but she appears to have been severely beaten. Barbara then discovers a diary that talks about a shed where disobedient girls are taken to be punished. Can the Arnos discover what's going on before there are any more deaths -- and before Ruby is forced into an arranged marriage with Eli?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52585246760ee34661066a28","adult":false,"gender":1,"id":1219929,"known_for_department":"Writing","name":"Joan Rater","original_name":"Joan Rater","popularity":2.677,"profile_path":"/i227263WtQwuxLj5E3DkyqxPcFz.jpg"},{"department":"Directing","job":"Director","credit_id":"52585246760ee346610669e9","adult":false,"gender":2,"id":1213618,"known_for_department":"Directing","name":"Sanford Bookstaver","original_name":"Sanford Bookstaver","popularity":3.202,"profile_path":null}],"guest_stars":[]},{"air_date":"2001-03-04","episode_number":23,"episode_type":"standard","id":556798,"name":"Rasho Mom","overview":"When Celeste and Ruby attend a rave party, a mischievous Chance decides to plant a bug on an unsuspecting Ruby. The microphone picks up a conversation about drugs at the party, and Danny and Barbara immediately leave to retrieve their kids.  After arriving at the rave, they hunt for Celeste and Ruby, and Barbara decides to check the ladies room. Seconds later, Danny hears two gunshots, and rushes into the bathroom to find Barbara on the floor, critically wounded-and a gunman (photo attached) pointing a gun at him.  Now Barbara is in the hospital, Danny is under investigation for wrongful homicide, and the cops may be the reason behind why any of it happened in the first place.  Can Danny clear his name-and will Barbara recover from her injuries?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52585246760ee34661066a4f","adult":false,"gender":2,"id":160177,"known_for_department":"Directing","name":"Adam Davidson","original_name":"Adam Davidson","popularity":3.41,"profile_path":"/3tpuepUlvPxuAQB8HpNPhBiPgoh.jpg"}],"guest_stars":[]},{"air_date":"2001-03-17","episode_number":24,"episode_type":"standard","id":556800,"name":"Sub Zero","overview":"When a murder occurs at the children's school, Danny masquerades as a substitute teacher in order to investigate.","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-24","episode_number":25,"episode_type":"finale","id":556799,"name":"Viva Zapatos","overview":"After his team stops at a diner where he meets Celeste, Cuban soccer player Lazaro decides to defect to the U.S.  The FBI asks Danny to keep Lazaro at the Arno house for a few days to find out if he's really a defector or, perhaps, a terrorist.  A suspicious Danny puts a tracking device in Lazaro's sneakers, and then follows Celeste and Lazaro when she offers to take him to the mall. On the way there, Lazaro asks Celeste to stop at a hotel where his teammates are staying.  As a surprised Celeste watches, Lazaro tries to convince his frightened girlfriend Marisol to defect also, and they agree to meet secretly at the sports arena the next day.  Meanwhile, Danny has learned from the FBI that Lazaro is probably carrying a bomb.  Are the FBI's suspicions correct?  And if so, is Marisol also involved-and can Celeste stay out of a potentially explosive situation?","production_code":"","runtime":60,"season_number":1,"show_id":17560,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52585246760ee34661066a28","adult":false,"gender":1,"id":1219929,"known_for_department":"Writing","name":"Joan Rater","original_name":"Joan Rater","popularity":2.677,"profile_path":"/i227263WtQwuxLj5E3DkyqxPcFz.jpg"}],"guest_stars":[]}],"name":"Season 1","overview":"","id":28449,"poster_path":null,"season_number":1,"vote_average":0}}}