{"adult":false,"backdrop_path":null,"created_by":[{"id":1213141,"credit_id":"525852d1760ee3466107072a","name":"Mark Cronin","profile_path":null},{"id":1220972,"credit_id":"525852d1760ee34661070730","name":"Cris Abrego","profile_path":null}],"episode_run_time":[60],"first_air_date":"2008-10-20","genres":[],"homepage":"","id":17651,"in_production":false,"languages":["en"],"last_air_date":"2009-10-26","last_episode_to_air":{"id":557768,"name":"Animals Are Awesome","overview":"Flirty wanted more connection from Chance, but Blonde Baller wants her to switch to Real for less competition. The next day, their challenge is to write and perform a song called \"Animals are Awesome\", with each girl writing and singing a verse about an endangered animal and all girls from each team to sing the chorus. It ended that Team 2 named EES (Exotic Endangered Species) won. That night, Real and Chance took Classy and Hot Wings went to a fancy restaurant for their double date. The next day, Real and Chance took Blonde Baller, Flirty, and Doll to a local tennis court to play tennis. On the way there, Flirty opened up to Chance about her troubled past. The group played tennis with Blonde Baller disgusted about Chance giving Flirty more attention than her. During one-on-one, Blonde Baller gave Chance the scoop about the rest of Chance's girls, including Flirty. Flirty denied what Blonde Baller said about her on her one-on-one with Chance. After the date, Flirty told the rest of the girls about Blonde Baller, which causes most of the girls to turned on Blonde Baller. Chance had one-on-ones with Spanish Fly and Mamacita (finding Spanish Fly boring, but Mamacita fun and interesting), while Real had a one-on-one with Pocahontas, which she opens up about her past. At elimination, it was down to Blonde Baller and Spanish Fly. In the end, Chance chose Blonde Baller to stay another night, shocking the Chance's girls.","vote_average":0,"vote_count":0,"air_date":"2009-10-26","episode_number":7,"episode_type":"standard","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null},"name":"Real Chance of Love","next_episode_to_air":null,"networks":[{"id":158,"logo_path":"/w9oUxxUiXTC1O1MzJSvsMjQbgft.png","name":"VH1","origin_country":"US"}],"number_of_episodes":26,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Real Chance of Love","overview":"Real Chance of Love is an American reality television dating game show featuring two brothers Ahmad Givens and Kamal Givens, of the rap group The Stallionares, and former contestants on I Love New York, who are looking for love.\n\nThe show was first brought up in August 2007 when Mr. Boston and Tango of I Love New York were offered to star in their own reality show. Mr. Boston declined and the plans eventually fell through, leaving the show to be picked up for Real and Chance.","popularity":3.629,"poster_path":null,"production_companies":[],"production_countries":[],"seasons":[{"air_date":"2008-10-20","episode_count":14,"id":28532,"name":"Season 1","overview":"Real Chance of Love (season 1) is the first season of the VH1 reality television dating series entitled Real Chance of Love. Brothers Ahmad Givens and Kamal Givens, former contestants on I Love New York are the central figures. The show, which premiered October 20, 2008, featured seventeen female contestants taking part in various challenges in a format similar to other VH1 and MTV dating contest programs. Each week, women were eliminated until the final episode where the brothers had to make their final selections. Ultimately, Ahmad selected \"Corn Fed\", while Kamal did not select a winner. The series consisted of 14 episodes.","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2009-08-03","episode_count":12,"id":28533,"name":"Season 2","overview":"Real Chance of Love 2: Back in the Saddle is the second season of the VH1 reality television dating series Real Chance of Love. Ahmad Givens and Kamal Givens, former contestants on I Love New York are the central figures. The show premiered August 3, 2009. The show features twenty female contestants taking part in various challenges. Real and Chance appeared on Chelsea Lately on May 25, 2009 to talk about the second season of Real Chance of Love, which was in production at the time. Ultimately, Ahmad selected Doll, while Kamal selected Hot Wings.","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5,"vote_count":1,"season_data":{"1":{"_id":"525852ce760ee34661070679","air_date":"2008-10-20","episodes":[{"air_date":"2008-10-20","episode_number":1,"episode_type":"standard","id":960250,"name":"Love is in the Stallion-Air","overview":"Real and Chance are back and they're looking for love again, but this time they'll be ones doing the eliminating. The two brothers show up to find 17 lovely ladies waiting outside of their mansion. After the traditional nickname ceremony, they proceed to a back yard mixer where they get to know the girls a little better. Personalities pop and things heat up as some girls gravitate toward the sensitive brother, while others go after the hot-headed player. In the end the two brothers pick from the pool of girls, dodge-ball style until they have 7 girls each. Unfortunately for 3 girls, however, the ride is over before it begins.","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-27","episode_number":2,"episode_type":"standard","id":960252,"name":"Don't Cross Me Bra!","overview":"The brothers have the girls put on a county fair for them, but the one booth that Real is the most interested in, belongs to one of Chance's girls! Later on, when Chance, spying from his bedroom window, catches Real putting the moves on his woman, he decides to go after one of his brother's girls to get back at him. When the girl wants nothing to do with Chance, he makes up a lie about her to Real! Will blood prove to be thicker than the truth?","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-03","episode_number":3,"episode_type":"standard","id":960246,"name":"Slam, Bam, Thank You Ma'am","overview":"Because professional wrestling is one of the Stallionaires' favorite forms of entertainment, the guys decide to have the girls put on wrestling matches. After the ladies slam and drop kick each other to the brothers' content, the winning team is taken on a date to the fishing hole. While there, one of Chance's girls proves to be \"too much\" sexually, getting down and dirty with him, even in front of little children and families! Things blow up on Real's side, as well, when one his girls accuses another being a lesbian and hitting on her. Strap in for this one!","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-10","episode_number":4,"episode_type":"standard","id":960247,"name":"Who Wants to be a Stallionaire?","overview":"The Stallionaires are looking for a woman who can be part of the family and take care of business. When the girls arrive at the family ranch, they come to realize that their job is to restore order to a barn that is in utter chaos. Chickens, Geese, Pigs, Goats, Horses, Cows, Donkeys and even a Llama run wild, and the girls must use their ranch hand skills to regain order. Later, one of the girls shows her true crazy side and possibly buys herself a one way ticket home.","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-17","episode_number":5,"episode_type":"standard","id":960251,"name":"Great Balls of Fire!","overview":"When the guys have the girls put on a dance concert at MacArthur Park, Real, once again, becomes enamored by one of Chance's girls. Later, Real and Chance have lunch with the other brother's girls, to get to know them a little better. This proves to be the perfect time for Real to make a move on his new prospect, but what will Chance think of his brother trying to steal one of his girls again? Meanwhile, one of Chance's girls, tries to desperately to connect with him, even going so far as to make him a special meatball dinner. But when Chance gets indigestion and the romance of the moment is lost, it sends the girl into a spiral.","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-24","episode_number":6,"episode_type":"standard","id":960249,"name":"From One Brother to Another","overview":"The Stallionaires are into their cars, and the challenge of the day is to pimp out some rides for the brothers. Girls from the winning team get a private, drive-in date with the brothers, at the top of the Griffith Park. But when Real picks one of Chance's girls, the other girls and Chance are shocked. On the date, Chance becomes extremely jealous, and he continuously tries to ruin any possibility of a romantic connection between Real and the girl. Will Chance be able to talk his ex-girl back over to his side? Meanwhile, Real's girls become jealous of one woman they consider to be an old cougar, with whom Real has a strange and powerful connection. When the girls attack her, she slips with private information about Real and gets herself in hot water.","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-01","episode_number":7,"episode_type":"standard","id":960734,"name":"Kid's Games and Old Flames","overview":"There are eight girls left in the house and while some \"love\" connections are growing stronger, others have reached a standstill. But Real and Chance need a girl who's got patience and good mothering skills, so it's time to put these girls to the test and see what they're really made of. The girls are paired up with a child, who's talent they must find and nurture, for the \"Mommy and Me\" talent show. For one of the girls who is missing her little boy, this challenge hits a little too close to home, and it sends her into an emotional spiral. Later, one of the other girls crumbles when something from her past is exposed, leaving Chance to wonder if she is the right woman for him.","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-08","episode_number":8,"episode_type":"standard","id":960253,"name":"Ride or Die","overview":"The guys decide to take the girls out for a night on the town for some drinks. When a random guy hits on one of Chance's girls, he becomes irritated. A fight breaks out moments later between the brothers and the fellow, and Real breaks a bottle over the man's head. Chaos ensues, and the girls are escorted out of the bar. Nervous and crying, the girls arrive back at the house to find police officers waiting there to question them. One at a time, the girls are interrogated, but who will hold up under questioning and who will sell their man down the river?","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-15","episode_number":9,"episode_type":"standard","id":960255,"name":"The Parent Trap, Part I","overview":"Now that Real and Chance have narrowed it down to three girls each, it's time to take things to the next level and meet mom and dad. The brothers enlist in their parents help, hoping to get an endorsement for their remaining ladies. And what better a place to do this than beautiful Palm Springs. But things turn ugly when a few of the girls gang up on their biggest competition, leaving mom and dad with a bad taste in their mouth rather than a great first impression. When an explosive secret is revealed, a mutiny among the girls takes things from bad to worse.","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-29","episode_number":10,"episode_type":"standard","id":960256,"name":"The Parent Trap, Part II","overview":"Continuing on the heels of a massive fight, an angry mob of girls marches into the guys' villa, and reveals shocking information about one of the other girls. When Real comes to learn that all the trouble is coming from his favorite girl, he is forced with a tough decision and must decide whether his connection with her is strong enough to overcome the drama she causes. The following day Chance takes his ladies out on a date with the parents. Conversations get heated and the real personalities begin to appear in front of Chance's parents. Going into elimination the outcome is uncertain; one girl's relationship with both the brothers has been exposed, and another girl's aggression has surfaced. One more girl is sent home, and the four remaining girls will be off to Puerto Rico.","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-05","episode_number":11,"episode_type":"standard","id":960254,"name":"The Clip Show","overview":"Over the past months the lovable brothers Real and Chance have lived with 17 women in an attempt to find that special connection, but along the way was a lot of drama and heartache. As the finale in Puerto Rico is upon them, the brothers spend tonight reminiscing on their experiences, and introducing some never seen before clips in this outrageous episode.","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-12","episode_number":12,"episode_type":"standard","id":960257,"name":"Thunder in Paradise","overview":"It's down to the final four and the Stallionaires are going all out. Real and Chance fly their ladies to Puerto Rico for the show's finalé, and show them the island in style. Our Stallionaires take the girls on dates by horseback through the romantic rainforest and on a multi-million dollar yacht, exploring both the island and their own hearts in a final effort to make the right choice. Real must decide if he really has chemistry with a girl that says all the right things, or will his connection with a more sensitive girl outweigh that. Meanwhile, Chance needs to figure out if he only has a purely physical connection with one girl or if the other can let her guard down. When the dust settles, who will be left standing in the final showdown with a Real Chance of love?","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-26","episode_number":13,"episode_type":"standard","id":960259,"name":"Reunion Show","overview":"It's been three months since Real and Chance risked it all in their quest to find true love. On the final night in Puerto Rico, one brother chose a woman with whom he hoped to spend the rest of his life, while the other broke the hearts of two finalists, each of whom hoped that they had a Real Chance of Love with him. On the reunion show, Real, Chance and all of the women will gather to relive the highs and lows of a season that changed their lives forever. Along the way, voices will be raised; tears will be shed and Real will be reunited with his choice to see if their love has survived. The girls are back and they all have a something to share with the guys. Will Real continue with the girl he chose or is it all over?","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-21","episode_number":14,"episode_type":"finale","id":960258,"name":"Memoirs of a Stallionaire","overview":"Now that the world has seen the Real Chance of Love Finale, and the Stallionaire brothers have decided their fate, it's time for a no-holds-barred look back at the ultimate journey for love. Perched in their directors chairs outside of a Hollywood soundstage, just moments before heading inside the studio to shoot the Real Chance Reunion, the boys will let us in on their own personal favorites from the season — the hilarity, the drama, and the ultimate unseen moments!","production_code":"","runtime":60,"season_number":1,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Real Chance of Love (season 1) is the first season of the VH1 reality television dating series entitled Real Chance of Love. Brothers Ahmad Givens and Kamal Givens, former contestants on I Love New York are the central figures. The show, which premiered October 20, 2008, featured seventeen female contestants taking part in various challenges in a format similar to other VH1 and MTV dating contest programs. Each week, women were eliminated until the final episode where the brothers had to make their final selections. Ultimately, Ahmad selected \"Corn Fed\", while Kamal did not select a winner. The series consisted of 14 episodes.","id":28532,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"525852ce760ee34661070684","air_date":"2009-08-03","episodes":[{"air_date":"2009-08-03","episode_number":1,"episode_type":"standard","id":557769,"name":"Back in the Saddle Bros","overview":"Chance and Real have returned for a second season, after both failed to making a lasting connection in season one; Chance selected no one, and Real's romantic relationship with Corn Fed ended soon after the show. In season two, the Stallionaires have twenty new women looking for love, and it will be up to Real and Chance to find their \"Stallionettes\". The season features new twists such as no \"Real girls\" or \"Chance girls\" yet, leading to \"double the competition for their men.\" This twist leads to \"calculated game-play\" for some of the women. After eliminations, only sixteen women will remain in the competition.[8]","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-10","episode_number":2,"episode_type":"standard","id":557766,"name":"Love is in the Stallionaire","overview":"Real and Chance ask the sixteen remaining women to give a \"door-to-door sales pitch\" outlining their qualities. The contestant with the best pitch will win a date.[9] Blonde Baller, Junk, Pocahontas, Sassy, and Spanish Fly (which Hot Wings thought was unfair) were chosen as winners. All the girls get to go to prom, but the winners were given nice dresses while the rest were given sloppy ones. The winners also went with Real and Chance to a place where a real prom was held, while the others were stuck in the house. Later, before Real and Chance were ready to go to bed, Wiggly came into the room to impress Real, but she \"came off a little too strong\". The next day, Lady talk to Real and confessed that she used to date women, but it's all in the past. Both Real and Chance had a conservation with Mamacita, questioning if she is there for the boys or for TV. She jokingly said \"all the above\". During elimination, Mamacita and Wiggly were in the bottom 2. Mamacita confirmed she was there for the boys, not for TV, eliminating Wiggly.","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-17","episode_number":3,"episode_type":"standard","id":557767,"name":"Girls Gone Viral","overview":"The fifteen remaining girls have their booty shaking skills put to the test when they audition for the Stallionaire's viral music video. Gloria Velez made a guest appearance, getting them into \"booty camp\". Then Pocahontas, Baker, and Lady were chosen as team captains and they chose teams. Apple was not confident doing the challenge, while Lady's team had many ideas that they cannot come to the conclusion of. Real and Chance came to judge all the teams' performances, and Real and Chance made the decision that Baker's team wins the challenge. Both of the boys took Aloha, Baker, Flirty, Mamacita, and PS to the Hollywood Park Race Track. PS, who was undecided about who she like, decides she likes Real better than Chance. Meanwhile at the house, Junk eavesdropped on Blonde Baller talking to her \"best friend\", which Junk believes it is her boyfriend. The next day, PS called out Blonde Baller for having a boyfriend and Chance doesn't know what to believe. Aloha had became emotional; even more crazy after Real told her to \"domesticate\" herself, after Real was disgusted that Aloha was eating raw fish. At elimination, Real and Chance gave out Real chains and Chance chains. It came down to Aloha and Apple. Aloha was cracking up and Chance confirmed that Aloha is indeed crazy, leading Real to eliminate her.","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-24","episode_number":4,"episode_type":"standard","id":557765,"name":"Yeti Set Go","overview":"After elimination, Blonde Baller gets a call from one of her friend that her best friend died in Michigan, which Junk found very suspicious. The girls' next challenge is to find Big Foot and bring him back, with the winners getting a date with the boys. But little do the girls know that Big Foot is actually the boys' brother Micah. The Pink Team won the challenge with Blonde Baller tackling the Yeti. Baker and Doll had a date up in Real and Chance's bedroom, having a foot psychic reading. Both girls were able to open up to the boys about their insecurities. The next morning, Apple made Real breakfast, but he still has some concern about Apple fitting into his lifestyle. That day, Real and Chance took PS, Blonde Baller, and Junk to the zoo. Both Junk and Blonde Baller got into an argument. When Real asked if Sassy is a good fit for him as a question to Junk's peeping, PS mocks her. Blonde Baller tells Sassy, but starts another argument with Junk right after. During elimination, it was down to Apple and Sassy for Real and Junk and Blonde Baller for Chance. Real eliminated Apple, but Chance doesn't eliminate either girl.","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-31","episode_number":5,"episode_type":"standard","id":960261,"name":"Take a Chance or Get Real","overview":"After elimination, Blonde Baller tells Chance that she is real and she doesn't have a boyfriend at home. The next day, Real and Chance are reviving a tradition of wrestling as a challenge. Whichever team puts on a great show wins dates with the boys. The first match was produced by the black team, with Hot Wings (as Handspring) & Doll (as Dollface) vs. PS (as Port Mortem) & Baker (as Backbreaker). The second match was produced by the pink team, with Blonde Baller (as Blonde Mauler) & Classy (as Classy Daze) vs. Spanish Fly (as Flapper) & Lady and Junk (as Lady Cyborg and Junk). The third match was produced by the purple team, with Pocahontas (as Poca the Warrior) & Flirty (as Dirty Flirty) vs. Mamacita (as Senorita Mamacita) & Sassy (as Sassy Sphynx). Because of collective chemistry, it ended up that the purple team won the challenge, leaving Hot Wings upset without another date. Sassy and Mamacita get to go on romantic dates that night. On the way there, Chance drank too much tequila, causing him to act obnoxious towards Mamacita during their date. Chance pasted out that night while Real bring both Mamacita and Sassy back to the house. Meanwhile, Hot Wings was so frustrated about not getting a date that she decided to pack and leave, but Sassy encouraged her to stay. The next day, Real and Chance took Flirty and Pocahontas to the studio where the TV show Chelsea Lately was flimed, where the girls get to see the boys on TV. Mamacita was jealous that Flirty had a better date than her, causing her to break down to tears. So Real comforted her and tells her she doesn't have to be there for Chance. Junk had one-on-one with Chance and Lady had one-on-one with Real. Junk talks more about Blonde Baller and Lady doesn't know what to tell Real. During elimination, it was down to Mamacita, Lady, and Junk. Both Real and Chance wanted to give their chains to Mamacita. She was confused who to pick, but in the end, she chose Real because she wanted to teach Chance a lesson. Lady was eliminated, and shortly after, Junk, who thought she would survive another elimination, was also eliminated.","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-11","episode_number":6,"episode_type":"standard","id":960260,"name":"Pushin Product","overview":"After elimination, Mamacita felt strange being a Real girl, but Real told her to give him a shot to getting to know her. Meanwhile, Sassy saw PS flirting with Chance and tells her if he likes Chance, she should stay by Chance instead. Angry, PS went outside and demanded Sassy what was that about. Sassy yelled at her that she shouldn't switch from brother to brother. The challenge the next day was to present an infomercial based on Real and Chance's products, having the Real and Chance girls competing against each other. It ended that Chance's girls won because of their outstanding energy in their presentation. Shortly after, PS called them \"ghetto\", surprising Real, Chance, and the girls. Real, Chance, and the winning girls went to a club that night. Meanwhile, Mamacita is still having feelings for Chance, but might be afraid that she might get eliminated by both of them. The next day, Chance invited his tattoo parlor to the house and he and some of the girls are getting tattoos. Real was upset that Mamacita is flirting with Chance. Hot Wings also felt upset about Mamacita flirting with Chance, trying hard to get his attention, but ended up yelling at him when she took his sense of humor seriously. Meanwhile, Blonde Baller told Classy about the joke Chance made at her, which Baker believe Blonde Baller to be shady and a manipulator. During elimination, PS went up to Real and said she doesn't want to be in the house anymore. Real said she was going to go home anyway because of her offensive \"ghetto\" comments towards him, Chance, and the girls, including Sassy. Real called down Mamacita and said that she should accept his brother's chain because she was feeling Chance more. The brothers decided to not to give out the chains to the rest of the girls that night.","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-26","episode_number":7,"episode_type":"standard","id":557768,"name":"Animals Are Awesome","overview":"Flirty wanted more connection from Chance, but Blonde Baller wants her to switch to Real for less competition. The next day, their challenge is to write and perform a song called \"Animals are Awesome\", with each girl writing and singing a verse about an endangered animal and all girls from each team to sing the chorus. It ended that Team 2 named EES (Exotic Endangered Species) won. That night, Real and Chance took Classy and Hot Wings went to a fancy restaurant for their double date. The next day, Real and Chance took Blonde Baller, Flirty, and Doll to a local tennis court to play tennis. On the way there, Flirty opened up to Chance about her troubled past. The group played tennis with Blonde Baller disgusted about Chance giving Flirty more attention than her. During one-on-one, Blonde Baller gave Chance the scoop about the rest of Chance's girls, including Flirty. Flirty denied what Blonde Baller said about her on her one-on-one with Chance. After the date, Flirty told the rest of the girls about Blonde Baller, which causes most of the girls to turned on Blonde Baller. Chance had one-on-ones with Spanish Fly and Mamacita (finding Spanish Fly boring, but Mamacita fun and interesting), while Real had a one-on-one with Pocahontas, which she opens up about her past. At elimination, it was down to Blonde Baller and Spanish Fly. In the end, Chance chose Blonde Baller to stay another night, shocking the Chance's girls.","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":8,"episode_type":"standard","id":960262,"name":"Stallionaire Court","overview":"After elimination, Blonde Baller realize that she needs more romantic towards Chance so she went up to his room to chill. The next day, the next challenge is to present a case against another girl of an opposing team in Stallionaire Court, because Real and Chance are tired of the drama in the house. The Contemptresses (Baker, Hot Wings, Pocashontas) automatically targets Blonde Baller for being a liar and a snitch. The Pleading Hearts (Doll, Flirty, Mamacita) decided to go for Hot Wings for threatening to leave the house. The Impeaches (Blonde Baller, Classy, Sassy) went for Flirty because of her legal issues, which Blonde Baller is the only girl on the team that has knowledge. It was time for go to court and the Pleading Hearts were first to go up. Hot Wings told Real and Chance that she wanted to leave because she was frustrated that she didn't get a date with Chance. Mamacita suddenly said that Hot Wings is indeed there for Chance, causing the judges to find Hot Wings innocent and the Pleading Hearts to lose their case. The Impeaches presented that charges about Flirty not being the true definition of a Stallionette. Even though Flirty was honest about her legal issues, the evidence the Impeaches presented was overwhelming that she was found guilty. The Contemptresses opened their case with Pocahontas asking if BB's father knows where she is, with Blonde Baller saying that she didn't tell her father where she is, but she told him that she's on a TV show, exposing herself as a liar. Baker asked Classy to come to the stand as a witness, asking her what Blonde Baller said to her the other day about Chance. Classy relayed what Blonde Baller said to her, exposing her as a snitch. Ultimately, Blonde Baller was found guilty. The Impeaches won the challenge, winning dates. Chance also announced that there will be elimination that night. Back at the house, Blonde Baller overheard Flirty threatening to beat her up. Her solo date with Chance went well until Blonde Baller told him about Flirty, disappointing Chance. Meanwhile, Flirty was breaking down because Blonde Baller had blown her legal trouble out of proportion and Chance started to worry about that. During elimination, it was down to Flirty and Blonde Baller. Blonde Baller repeatedly said she was here for Chance, but Chance felt betrayed that he has been lied to the whole time, giving his chain to Flirty, eliminating Blonde Baller.","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":9,"episode_type":"standard","id":960263,"name":"Whine's and Cheese","overview":"After elimination, the girls celebrated the departure of Blonde Baller. The next day, the girls were invited by the boys to the Robert Hall winery at Paso Robles, CA. Real and Chance wanted take wine-tasting, but also announced that each of them will take two girls out on a date. Chance had a one-on-one with Flirty, who told him that all her troubles are all in the past and it will not affect their relationship. Real had a one-on-one with Pocahontas, wanting more time with her. On the way the hotel, Sassy was so drunk that the limo had to pull over for her to puke. After they arrive at the Madonna Inn and Sassy sobering up, it was announced that Flirty, Mamacita, Classy, and Pocashontas get to go on dates with Real and Chance. As soon as the girls sat down, Chance had to use the bathroom, having Flirty and Mamacita wait for him. Classy attempted to crack some jokes to Real, but it made Real uncomfortable. Pocahontas then gave him an embarrassing dance that made Real laugh. Once Chance came back, Flirty open up more about her life, which Chance found strange and perceived her as a liar. Real chose Pocahontas and Chance chose Mamacita for night caps. The next day, the girls got back to the house and that night was elimination. Chance spend some one-on-one with Hot Wings. After that, he went to the kitchen and found a cake made from Baker, which was supposed to be a surprise and made Baker upset after Chance autographed it with cream. Real also spend some one-on-one with Doll, but then Sassy surprised Real, draped in lingerie. Then she told him she's unsure if she's the right woman for him, which concerns him. During elimination, it was down to Classy and Sassy for Real and Baker and Flirty for Chance. Classy and Flirty were eliminated","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":10,"episode_type":"standard","id":960264,"name":"Poca Face","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":11,"episode_type":"standard","id":960265,"name":"Clip Show","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":12,"episode_type":"finale","id":960248,"name":"Welcome in Miami, Beeotch","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":17651,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"Real Chance of Love 2: Back in the Saddle is the second season of the VH1 reality television dating series Real Chance of Love. Ahmad Givens and Kamal Givens, former contestants on I Love New York are the central figures. The show premiered August 3, 2009. The show features twenty female contestants taking part in various challenges. Real and Chance appeared on Chelsea Lately on May 25, 2009 to talk about the second season of Real Chance of Love, which was in production at the time. Ultimately, Ahmad selected Doll, while Kamal selected Hot Wings.","id":28533,"poster_path":null,"season_number":2,"vote_average":0}}}