{"adult":false,"backdrop_path":"/zRZohPYDsD8kCjEemeMOvmDveCD.jpg","created_by":[{"id":13594,"credit_id":"5aca1dfcc3a36834d7062b3e","name":"Joseph Barbera","gender":2,"profile_path":"/lpjg99DpaK0RDbbe6mqk1Z7YIke.jpg"},{"id":13620,"credit_id":"5aca1e090e0a26497705d02f","name":"William Hanna","gender":2,"profile_path":"/zf5WRsouQN0ozuJ4vFosXylPjaZ.jpg"}],"episode_run_time":[21,30],"first_air_date":"1969-09-13","genres":[{"id":16,"name":"Animation"},{"id":10762,"name":"Kids"},{"id":10751,"name":"Family"}],"homepage":"","id":1765,"in_production":false,"languages":["en"],"last_air_date":"1970-01-17","last_episode_to_air":{"id":106802,"name":"London Town Treachery","overview":"In one peril she's tied to a pole slowly being wound in bandages from her feet to her head, yet before they can cover her all the way the Ant Hill Mob comes along to save her. And in this one there's also a formidable Clock Tower wherein she's trapped and The Hooded Claw has her in another elaborate peril again, this time involving a cat and mouse.","vote_average":0,"vote_count":0,"air_date":"1970-01-17","episode_number":17,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/oKGu71tyCQQZZHAcOGsZrHTW3h7.jpg"},"name":"The Perils of Penelope Pitstop","next_episode_to_air":null,"networks":[{"id":16,"logo_path":"/wju8KhOUsR5y4bH9p3Jc50hhaLO.png","name":"CBS","origin_country":"US"}],"number_of_episodes":17,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"The Perils of Penelope Pitstop","overview":"The Perils of Penelope Pitstop is an American animated television series produced by Hanna-Barbera Productions that premiered on CBS on September 13, 1969. The show lasted two full seasons, with a total of 17 half-hour episodes produced and released, the last first-run episode airing on January 17, 1970. Repeats aired until September 4, 1971. It is a spin-off of the Wacky Races cartoon, reprising the characters of Penelope Pitstop and the Anthill Mob. This show airs reruns on Cartoon Network classic channel Boomerang.","popularity":8.918,"poster_path":"/tEyhRt3ZlBdrIV03pdiK0OW4oZD.jpg","production_companies":[{"id":1353,"logo_path":"/yXhCcOFK5Fy3ZBQwhBYx8Zu9ZIw.png","name":"Hanna-Barbera Productions","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":null,"episode_count":6,"id":4949,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"1969-09-13","episode_count":17,"id":4948,"name":"Season 1","overview":"","poster_path":"/39KxVB2XFnLrlLsbgeLgHh3Qsys.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5.7,"vote_count":30,"season_data":{"1":{"_id":"5257142d19c295711406e014","air_date":"1969-09-13","episodes":[{"air_date":"1969-09-13","episode_number":1,"episode_type":"standard","id":106786,"name":"Jungle Jeopardy","overview":"In this one the Hooded Claw captures her and she is in peril of wild animals. In one peril she is put inside a sack which is cinched at the top, she is being guided down a pulley while a giraffe eats a bit of hay stuffed at the top of of the sack, thereby propelling her way downward to where another animal tries to kill her. It's one of those times she tries calling for help and the Ant Hill Mob come to save her.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/9ShUnRdDrtiZKEqb2Yew56n8upc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-09-20","episode_number":2,"episode_type":"standard","id":106787,"name":"The Terrible Trolley Trap","overview":"The Hooded Claw and the Bully Brothers tie Penelope to some trolley tracks hoping to get rid of her once and for all. After that, she is taken into the ocean, on a ship that belongs to the Hooded Claw, where he plans to get rid of her permanently. Will the Ant Hill Mob be able to find Penelope before it is too late?","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/5WVUvNoIvUcDWehvtxAjH8oy3GE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-09-27","episode_number":3,"episode_type":"standard","id":106788,"name":"The Boardwalk Booby Trap","overview":"Penelope is spending a relaxing day at the beach being buried in the sand by the Ant Hill Mob. The Hooded Claw has mixed in cement with the sand so she cannot get out. Along comes a bulldozer driven by the Bully Brothers. The Ant Hill Mob cannot pull her up, so they dig a tunnel to pull her down. They save her in the nick of time. Later, Penelope is kidnapped by the Bully Brothers during a scavenger hunt and taken to an abandoned fishing village, where the Hooded Claw awaits her. Will the Ant Hill Mob come crashing in to save her in time?","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/arO9ylLt69J6TfnLaURfaAmhgYY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-10-04","episode_number":4,"episode_type":"standard","id":106789,"name":"Wild West Peril","overview":"In one peril The Hooded Claw ties Penelope to a giant boulder using a spring tree, but the Ant Hill Mob foil him. She is also left tied, sitting on top of a runaway stagecoach. Then a tipi is set on the edge of a cliff, designed to lure the Mob in and fall off the edge, hitting a board that will catapult Penelope in a barrel, and the Ant Hill Mob into the near-bottomless canyon. To lure them there is a gramophone inside the tipi playing Penelope's famous call for \"\"Help!\"\". She is then finally placed in a miner's car filled with explosives which is set to rocket down to the bottom of a steep and deep mine shaft.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/fcH4MEpvAMTpk7yHs61T0bfNOG2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-10-11","episode_number":5,"episode_type":"standard","id":106790,"name":"Carnival Calamity","overview":"Penelope and the Ant Hill Mob go to a carnival. While Penelope is riding the loop-the-loop, the Hooded Claw locks the door on her and spins the ride rapidly, hoping to launch her into space.   She manages to pick the lock and escapes. The Hooded Claw grabs her again and ties her to an oversized duck in a shooting gallery. The trap is set to drop a suspended merry-go-round over the game tent after a shooter hits enough ducks to light up the score counter. Dum-Dum wanders in and is persuaded by The Hooded Claw to give it a try. Dum-Dum, not knowing that Penelope is in danger, says that he is a born sharpshooter. Soon the rest of the Ant Hill Mob step in, rescue Penelope, and the merry-go-round crashes in upon The Hooded Claw and the Bully Brothers.\n\nIn the final peril, Penelope is tied to the tracks of a rollercoaster. A lever that releases the rollercoaster is set up to be struck by a counterbalance when a bird has finished eating its birdseed in a bowl. The coaster then must complete a","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/4aX52ITMStoSuAp7lQ9EhnyW389.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-10-18","episode_number":6,"episode_type":"standard","id":106791,"name":"The Treacherous Movie Lot Plot","overview":"In this one The Hooded Claw lures Penelope onto a fake film set by pretending to make a movie with her and a giant mechanical gorilla. In one peril she is tied to a torpedo set to launch off, and when it does takes her through the blue waters of an ocean. The Ant Hill Mob come in their car and, in the water, manage to save her, but you'll never guess how. They make a chain of themselves on top of their car with Penelope sitting at the very top as if she were in a director's chair. In another peril she is tied to a buoy. And in another one The Hooded Claw is cranking   up a strange looking machine while Penelope is trapped in a small   room below.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/q1U7mJBvrSEOA5KQzSUkA6apUrM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-10-25","episode_number":7,"episode_type":"standard","id":106792,"name":"Arabian Desert Danger","overview":"The Hooded Claw attempts to sabotage Penelope's plans to escort a rare baby camel to its home in Egypt. In one peril she is trapped inside a tent with a sandstorm about to come knock it down. And in another one she is kept inside a chest with a bomb    nearly ready to go off. The Ant Hill Mob find the caravan the chest is in and save her.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/rRaCKrRjTWDXROUp1dfnBoR2Gbh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-11-01","episode_number":8,"episode_type":"standard","id":106793,"name":"The Diabolical Department Store Danger","overview":"When Penelope goes to a department store to attend a fashion   show she finds herself in all kinds of trouble. Trapped inside an elevator that goes out of control, she nearly gets crushed, but likely her worst peril is when she is tied up and pinned to a slide with a lawn mower precariously tied above her which threatens to come mowing her down. And, if the little choo choo train cuts the string that is attached to the lawn mower then it will come down on her. The Ant Hill Mob make it there to help her, but she ends up going out through a window, subsequently getting caught by the hook of a crane. It's operated by the Hooded Claw who begins to swing her into a pile driver at a construction site next to the store. After a few close calls she swings to an open window of the Pitstop Department Store and gets a beachball. She pops it, using the air jet to escape. Then, back in the store, she is sent waterskiing with her hands tied to the tow bar of a pilotless speedboat. She goes through t","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/cbhgv7meb79j0rbUAoegH9KMSv5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-11-08","episode_number":9,"episode_type":"standard","id":106794,"name":"Hair Raising Harness Race","overview":"The Hooded Claw attempts to sabotage Penelope's efforts of winning a harness race.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/aymZCClPpp0REUW85mklgKkdT59.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-11-15","episode_number":10,"episode_type":"standard","id":106795,"name":"North Pole Peril","overview":"Stuck inside a cabin atop a snowy hill, Penelope must await her terrible fate when a snowball rolls down hill, gaining momentum and growing larger so it can ultimately crush the cabin she is in. Luckily, the Ant Hill Mob come in their car, Chuggaboom, and saves her just in time. In another peril she is tied to a pole and about to be killed inside a bear trap which she escapes from.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/uiALJUGTyJbGyTrtmakCl0fBaHf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-11-22","episode_number":11,"episode_type":"standard","id":106796,"name":"Tall Timber Treachery","overview":"The Bully Brothers kidnap her from inside a forest. In one peril she is tied to a log and sent on a stream to go over the side of a waterfall. In a second one she is dangling above a pit of alligators. And in another she is suspended by a rope inside a cave about to fall dozens of feet to her doom. On board a train, Penelope finds herself being chased and then trapped in one of the train compartments. Tied up to the wall, she helplessly watches while the compartment is fast filling up with water. Afraid she will perish by drowning, she soon finds a way to escape. She slips off one of her long, white boots and hits the lever so the water stops. Some pretty narrow escapes this time, but she makes it.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/7CNf2Q7yDPHLaCgBEPlABw6iNAL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-11-29","episode_number":12,"episode_type":"standard","id":106797,"name":"Cross Country Double Cross","overview":"Penelope finds herself in peril when she wants to go an important ceremony. The Bully Brothers are in here and they along with the Hooded Claw try to make a couple traps for her which she manages to escape. When skiing she escapes an avalanche, escapes a bunch of logs that are about to fall on her. And she usually does it with only a little help.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/xCFC7YcKkLUL4qDCopw9lAm6oTG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-12-06","episode_number":13,"episode_type":"standard","id":106798,"name":"Big Bagdad Danger","overview":"In one peril she is trapped inside a tent.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/knAfbAejhPsvypzrkiP67Urb0Hj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-12-13","episode_number":14,"episode_type":"standard","id":106799,"name":"Bad Fortune In a Chinese Fortune Cookie","overview":"Penelope first finds herself trapped inside the mouth of a Chinese dragon heading towards a crash. But thanks to the bubble gum she has, she is able to make a bubble large enough that cushions her crash and bounces her to safety at the same time. In another peril she is bound in dough and set on a conveyor   belt ready to be cut up in Chinese Fortune Cookie like pieces   by a formidable machine.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/2pppQD25AXAIFAuhAoGb5MYlX7g.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-12-20","episode_number":15,"episode_type":"standard","id":106800,"name":"Big Top Trap","overview":"Penelope is kidnapped and taken to the circus.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/sZHvXyKPpBa9Wv6XZCgtAj2JIQF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-01-10","episode_number":16,"episode_type":"standard","id":106801,"name":"Game of Peril","overview":"In this one The Hooded Claw thinks he's going to make a game of it, and in one peril, a piano is playing by itself while Penelope is tied to a post that keeps going round, which is about to fall with the whole roof and everything about to collapse on top of her. And The Ant Hill Mob come to rescue her just in time.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/wqwcvuQZq6JTXm5fgXq4JtVm9Mu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-01-17","episode_number":17,"episode_type":"finale","id":106802,"name":"London Town Treachery","overview":"In one peril she's tied to a pole slowly being wound in bandages from her feet to her head, yet before they can cover her all the way the Ant Hill Mob comes along to save her. And in this one there's also a formidable Clock Tower wherein she's trapped and The Hooded Claw has her in another elaborate peril again, this time involving a cat and mouse.","production_code":"","runtime":null,"season_number":1,"show_id":1765,"still_path":"/oKGu71tyCQQZZHAcOGsZrHTW3h7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":4948,"poster_path":"/39KxVB2XFnLrlLsbgeLgHh3Qsys.jpg","season_number":1,"vote_average":0}}}