{
    "adult": false,
    "backdrop_path": null,
    "created_by": [],
    "episode_run_time": [
        60
    ],
    "first_air_date": "2008-01-22",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "http://www.channel4.com/programmes/supersize-vs-superskinny",
    "id": 17918,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2013-03-12",
    "last_episode_to_air": {
        "id": 559249,
        "name": "Hayley vs Geoff - Revisit",
        "overview": "The show catches up with sugar fan Hayley Payne and snackaholic Geoff Milton, one year after they met in the feeding clinic.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2013-03-12",
        "episode_number": 10,
        "episode_type": "standard",
        "production_code": "",
        "runtime": 60,
        "season_number": 6,
        "show_id": 17918,
        "still_path": null
    },
    "name": "Supersize vs Superskinny",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 26,
            "logo_path": "/hbifXPpM55B1fL5wPo7t72vzN78.png",
            "name": "Channel 4",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 56,
    "number_of_seasons": 6,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Supersize vs Superskinny",
    "overview": "Supersize vs Superskinny is a British television programme on Channel 4 that features information about dieting and extreme eating lifestyles. One of the main show features is a weekly comparison between an overweight person, and an underweight person. The two are brought to a feeding clinic, and live together for five days, swapping diets all supervised by Dr Christian Jessen.\n\nThe show also featured Anna Richardson in the 1st, 2nd and 3rd series, who examined new methods to lose weight by trying diets she finds on the Internet, some of which have shocking side effects. For example, Anna attempted Laser lipolysis, which went drastically wrong and resulted in severe bruising. Also, she discovered Diabulimia and spoke to Isabelle Caro, a French actress, renowned for her underweight figure and anorexia campaign.\n\nDuring the first series in 2008, one feature involved Gillian McKeith, who tried to find a way to \"ban big bums\" in the UK. She tested out different exercises to tone the buttocks of different groups of ladies, and made a leader board for the most effective.",
    "popularity": 15.059,
    "poster_path": "/yCAUatRQZY8LXykOlMa12RY8jZZ.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2008-01-22",
            "episode_count": 8,
            "id": 28652,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2009-01-20",
            "episode_count": 10,
            "id": 28653,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2010-03-23",
            "episode_count": 9,
            "id": 28654,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2011-03-29",
            "episode_count": 8,
            "id": 28655,
            "name": "Season 4",
            "overview": "",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2012-02-28",
            "episode_count": 10,
            "id": 28656,
            "name": "Season 5",
            "overview": "",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2013-01-08",
            "episode_count": 11,
            "id": 28657,
            "name": "Season 6",
            "overview": "",
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 5,
    "vote_count": 5,
    "season_data": {
        "1": {
            "_id": "525853bb760ee3466107ae8e",
            "air_date": "2008-01-22",
            "episodes": [
                {
                    "air_date": "2008-01-22",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 559197,
                    "name": "Tatiana Moxey vs Sandra Andrew",
                    "overview": "At just 6 stone 10lbs, 19-year-old Tatiana Moxey is extremely underweight and desperate for people to stop asking her if she's got an eating disorder. Weighing in at 23½ stone, jazz singer Sandra Andrew is a late-night food lover, enjoying home-cooked West Indian food through the day before feasting on junk food all night long. In the feeding clinic, under the supervision of Dr Christian Jessen, Tatiana and Sandra take part in an extreme diet swap to fatten up skinny Tatiana and slim down overweight Sandra.\n\nMeanwhile, size 14 journalist Anna Richardson immerses herself into the world of serial dieters and attempts to drop a dress size or two by following their faddy diets and lifestyle regimes. This week she looks behind the glamorous façade of modelling and exposes the body-abusing methods some models use to stay skinny as she embarks on an extreme apple-only 'model' diet.\n\nAnd it's no wonder we're obsessed with the size of our bottoms: Britain has the biggest bums in Europe; so Gillian McKeith is on a nationwide campaign to reduce the size of our rears. And with the help of 101 women, the latest treatments, hi-tech gadgets and machinery that claim to achieve a perfect rear are put through their paces. This week a group of Nottinghamshire lasses are lassoed to horse-riding simulators to gee up their chances of success.\n\nAnd if you wise up to calorie content you can still indulge without the bulge. Gillian McKeith heads to Billingsgate Market to find out if the fishmongers of London know a high-calorie breakfast when they see one.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-01-29",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 559198,
                    "name": "Darryl Weston vs Yasmin Smith",
                    "overview": "Fussy eaters put up a food fight in the feeding clinic as Superskinny Yasmin Smith is forced to swallow a gargantuan diet of snack foods and diet drinks, while Supersize Darryl Weston weighing in at a whopping 33 stone and one pound suffers on Yasmin's lactose, wheat, sugar and fat free diet. Dr Christian Jessen referees the match.\n\nJournalist Anna Richardson takes the nip and tuck route to slimming by investigating the world of cosmetic treatments, but she meets with unforeseen complications during the procedure. Gillian McKeith is sent to Coventry as part of her nationwide campaign to turn bountiful bottoms into bums of steel. This week can the personal services of a gym bunny reduce their rears?\n\nAnd there's no need to battle the bulge if you know the calories of your favourite foods. With Cornish pasties, chicken salad and ham rolls on offer, do the market traders of St Albans know a high calorie lunch when they see one?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-02-05",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 559199,
                    "name": "Andy vs Amy-Jo",
                    "overview": "This week Dr Christian Jessen tackles the eating habits of Amy-Jo, a superskinny undereater, who is due to spend five days in the 'feeding clinic' with 38½-stone Andy. The participants' attitudes towards food couldn't be more different, but they are both putting their health in danger.\n\nAmy-Jo may look perfect on the outside but her extreme exercise regime and diet, which restricts carbs, could lead to her body crumbling inside. To shock her into a new way of eating, she must gorge on the gigantic meals and colossal snacks of the biggest supersize of the series. Meanwhile Andy must learn to survive on the limited calorie intake of Amy-Jo. The aim is for them both to learn how they are affecting their bodies\n\nJournalist Anna Richardson tries another extreme diet, taking the star-studded route to dropping a dress size: living on tiny jars of baby food. She also meets former Liberty X star Michelle Scott-Lee, who spills the beans on the pressures for celebrities to be thin.\n\nGillian McKeith has a shock in store for a team of large-bummed female rugby players from York as she continues her quest to reduce the nation's rears. Gillian also tests the knowledge of a bunch of London taxi drivers. With cheesy jackets, ploughman's and scampi and fries on the canteen menu, can they recognise a high calorie option when they see one?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-02-12",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 559200,
                    "name": "Stefan Ginesi vs Elizabeth Young",
                    "overview": "Tipping the scales at just over six stones, 41-year-old Elizabeth Young thinks she's found the elixir to eternal youth: an extremely disciplined diet. She exists on a radical diet of Brazil nuts, rice, garlic and not much else. In the feeding clinic, Dr Christian Jessen, begs to differ and has the challenge of persuading her that her lack of eating is doing the exact opposite; it's prematurely ageing her.\n\nDr Jessen's prescription is a short, sharp shock, a week of eating the food of 34 stone 9lbs supersized milkman Stefan Ginesi, the fattest contributor of the series. The Northern Irish 'carb junkie' lives on potatoes and Irish stew and is keen to lose weight to start dating and get involved in a relationship.\n\nInto the fourth week of her diet, journalist Anna Richardson goes nil by mouth when she swaps food for diet pills. On the way she meets Denise Townsend, whose prescription pills left an unsightly and permanent residue in her pants… and her toilet. And more alarmingly she encounters two young pill poppers whose cocktail of diet pills is potentially seriously damaging their health.\n\nCorporal Gillian McKeith gives a posse of Portsmouth girls their marching orders as they attempt to reduce their rears with the help of Masai technology, a trainer designed to get the wearer to copy the tribe's long-distance walking technique.\n\nAnd do the high-rollers at the dogs know a high calorie takeaway when they see one? With pizza, a burger and an Indian on offer which one is odds on favourite for a feast? Gillian McKeith reveals how to indulge and avoid the bulge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-02-19",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 559201,
                    "name": "Julie Mead vs Kevin Calladine",
                    "overview": "Dr Christian Jessen comes face to face with twenty-six-year-old Kevin Calladine from Brighton who hasn't had a decent meal since he left home. Short on time and money, his weight has plummeted to just 8 stone 5lbs, two and a half stone underweight, which is no great surprise because Kev lives on a diet of coffee and cigarettes for breakfast, pre-packed sandwiches for lunch and a liquid dinner of orange juices.\n\nMeanwhile, supersized super-eater Julie Mead from Essex weighs in at 26 stone 6lbs. Julie hopes some motherly love will help fatten Kev up while she learns to curb her excessive food consumption. \n\nJournalist Anna Richardson continues her weight-loss crusade, hoping that hypnosis will help her drop a dress size.\n\nSurfer girl Gillian McKeith dons her wetsuit to get some Welsh rare-butts to reduce their rears. \n\nAnd how to have your cake and eat it: with three posh puddings on offer – Pavlova, Belgian chocolate cake and apple tart – can the horsey set guess a high-calorie pudding when they see one? Gillian offers some low-calorie alternatives.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-02-26",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 559202,
                    "name": "Rosemarie Palmer vs Jenette Nolan",
                    "overview": "In the feeding clinic this week with Dr Christian Jessen are two women at opposite ends of the weight spectrum but with one thing in common: they both want to look wonderful in their wedding dresses.\n\nWafer-thin Jenette Nolan from Lancashire refuses to marry her husband until she can fill her wedding dress but she's got a long way to go. Weighing just 6 stone 8lbs, she's two stone underweight. \n\nMeanwhile Rosemarie Palmer, who lives on the Isle of Man, is hoping that a week's food swap will kick start her weight-loss plan to get from over 21 stone to a size 14 in time for her wedding this summer.\n\nMeanwhile, journalist Anna Richardson looks into the dark world of extreme dieting. She meets Lisa Bond who became partially blind by taking the radical decision to stop taking insulin in order to lose weight. Anna also talks to ex-Big Brother housemate Nikki Graham about the extremes she has gone to in order to stay thin.\n\nAnd when it comes to reducing the size of the nation's rears, Gillian McKeith is cleaning up the act of a group of Brummie bottoms with a device that promises to vacuum away the fat.\n\nAnd after dealing with the ladies of Birmingham Gillian's off to test some ten-pin bowlers on what they know about the calories in some typical party food.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-02-04",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 559203,
                    "name": "Desroy Gordon vs Louise Sapsford",
                    "overview": "Dr Christian Jessen faces a bumpy ride this week in the feeding clinic as superskinny size zero Louise Sapsford, who clocks in at 6 stone 2lb, faces up to supersize 28 stone 13 pounder Desroy Gordon's challenging diet of non-stop take-aways.\n\nLouise comes to terms with the fact that size zero is not a good look and changes her eating habits for good. Stuffing herself with Desroy's gigantic meals and a relentless run of take-away dinners teaches Louise she can eat more than the tiny meals she never normally finishes.\n\nJournalist Anna Richardson nips across the pond to New York City where she discovers the very latest fat-busting techniques, including cheerleader aerobics!\n\nGillian McKeith has a powerful arse-busting technique in store for some London lasses as she continues her quest to reduce the nation's rears.\n\nFor this week's Extra Helpings Gillian finds out if a bunch of jive dancers know their calories as well as their moves as she offers them a variety of romantic dinners for two. Can they tell which dishes they can dine out on without building up their love handles?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-03-11",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 559204,
                    "name": "Tracy Morgan vs Alex Law",
                    "overview": "Long and lanky, 22-year-old Alex Law from Stockport hits the scales at just over ten stone because he barely eats a meal. Tired and exhausted he lives on a diet of caffeine pills supplemented by stodgy cakes and snacks despite holding down the physically demanding job of a plasterer. Dr Christian Jessen decides to hit him where it will hurt most with a stiff warning about his manhood.\n\nHis diet swap partner Tracy Morgan from Wales has a mouth that's constantly on the move. If she's not talking at the call centre where she works she's snacking, just like Alex, but the trouble is she's snacking before, after and in between her already substantial daily meals which has caused her weight to soar to nearly 20 stone. Deprived of the meals and forced to eat just Alex's snacks she soon realises where she's going wrong.\n\nJournalist Anna Richardson meets Isabelle Caro, the actress who unwittingly found herself a worldwide celebrity as the star of a media campaign to highlight the shocking affects of anorexia.\n\nAnd for the first time in her life Gillian McKeith pigs out as she gets a group of ladies from Basingstoke to reduce their rears with a workout at a pig farm followed by trying out the bum-shrinking effects of mud-packs. \n\nDoes mum know best when it comes to counting calories? The nation's favourite family meals are checked out by supermarket check-out girls for their highest calorie content as Gillian dishes up spaghetti Bolognese, good old-fashioned sausage, mash and gravy, and a traditional roast beef meal.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 28652,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "525853bb760ee3466107ae99",
            "air_date": "2009-01-20",
            "episodes": [
                {
                    "air_date": "2009-01-20",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 559205,
                    "name": "Colin and Tracey",
                    "overview": "Weighing in at just 6 stone 8 pounds is superskinny working mum Gillian. The 24-year-old Inverness nurse is so busy caring for others she's forgotten how to look after herself and her weight has plummeted.\n\nHer polar opposite is another nurse, 26-stone self-confessed foodie Philippa, whose typical daily supersize menu includes a generous breakfast, followed by burger and fries, Yorkshire pudding and shepherd's pie.\n\nBoth women get shocking wake-up calls: Gillian discovers the devastating effects her diet has had on her body and Philippa comes face to face with the consequences of a lifetime of overeating when she meets Lisa, a woman about to undergo life-threatening weight-loss surgery.\n\nMeanwhile, Anna Richardson travels to LA to investigate the continuing obsession with thinness. Back in the UK, she launches her very own Flab Fighters club and teaches a group of serial failed dieters from Newport how to indulge in their favourite treats and still lose weight.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-01-27",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 559206,
                    "name": "Kim and Trudy",
                    "overview": "Checking into the feeding clinic is marathon-running, superskinny Kim Fawke. Following a stressful divorce, her weight has plummeted to just over six stone.\n\nIn her race to get her relationship with food back on track, she's joined by supersized scoffer and takeaway queen, 23 1/2 stone Trudy Alexander.\n\nMeanwhile, Anna and her Flab Fighters club swap gorging on cheddar for a hike in the Cheddar Gorge.\n\nAnd four young women in the grip of the eating disorder anorexia nervosa reveal their extreme eating habits, and are forced to discuss the causes, symptoms and anxieties around their distorted relationship with food.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-02-03",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 559207,
                    "name": "Gillian and Philippa",
                    "overview": "Featherweight father-of-two Colin Hunt barely tips the scales at nine stone by living on chocolate and little else.\n\nJoining him on the five-day diet swap is a supersizer twice his weight, Tracey Hibbert, who binges on bread. Her post-baby weight has rocketed to 18 and a half stone and she is desperate to lose the pounds.\n\nMeanwhile, the Flab Fighters weigh in before heading for the hills for a dog-walking session. Will they bank their calories or binge on a barrel of biscuits?\n\nAnd in the home of size zero, Anna Richardson discovers where the overweight go to in LA. At a fat-fighting farm she goes for the burn with an extreme workout and meets the residents of Club Bounce, the dating disco for larger lovelies.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-02-10",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 559208,
                    "name": "Martin and Christine",
                    "overview": "Swapping diets are 18-year-old superskinny Georgetta, who under-eats to look good but at a cost to her model looks. She will be paired with 28-stone supersizer Ameer, who is determined to lose weight so he can find a girlfriend.\n\nAnna Richardson's Flab Fighters are four weeks into their battle of the bulge, and this epsiode embark on a calorie-burning rowing trip. But will they choose to have their cake and eat it?\n\nThere's also an update on the progress of four young women suffering from anorexia nervosa, where a shopping trip reveals the devastating physical affects of their body dysmorphia. Dietician Ursula Philpot then confronts the four young women's food anxieties by getting them to eat a highly calorific sandwich.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-02-17",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 559209,
                    "name": "Georgetta and Ameer",
                    "overview": "Promotions girl Christine thinks her diet is healthy because she's following the government's advice on eating fruit and veg. At the opposite end of the scale is Martin, who's living on fatty, starchy and salty junk food.\n\nDr Christian Jessen oversees their dietary wake-up call, while Anna Richardson shows the Flab Fighters how to combat their crisp calorie cravings by trimming the maze at Longleat.\n\nAnna then heads to LA to prepare dishes for a celebrity meals-on-wheels service and meets the A-lister personal trainer who keeps Hollywood stars red-carpet ready.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-02-24",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 559210,
                    "name": "Wayne and Martin",
                    "overview": "Pint-sized Tiffany Patterson had to grow up quickly when her mum left home, leaving her to become the breadwinner and meal-maker. Too busy to eat, the seven stone 25-year-old lives on a daily dose of energy drinks and little else.\n\nJoining her for the five-day diet swap is DJ Keith Kelsey, whose out-of-hours eating has caused his weight to balloon to 30 stone. Dr Christian Jessen accompanies him to see 45-year-old Lisa Wheeler as she undergoes life-threatening weight-loss surgery.\n\nIt's ping pong in exchange for pizza as Anna Richardson takes on the Flab Fighters with a game of table tennis to show them how to have their favourite treats and still lose weight.\n\nPlus four young women battling with anorexia nervosa face their food fears in the kitchen of a gourmet curry house, where they have to prepare and eat a highly calorific meal.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-03-03",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 559211,
                    "name": "Keith and Tiffany",
                    "overview": "Two men confront their lifelong eating problems in the feeding clinic. A former jockey obsessed with keeping his weight down swaps diets with a man whose booze-binging is out of control.\n\nIn Los Angeles, Anna Richardson discovers that a fascination with celebrity mums lies behind the dangerous trend of extreme post-baby weight-loss regimes. She meets the Hollywood housewife who won't leave her Beverly Hills mansion until she's lost her pregnancy weight, and joins in an exercise class where babies are used as dumb-bells.\n\nThe Flab Fighters descend on Cardiff's Millennium Stadium for another lesson in how to enjoy their favourite treats and still lose weight. Will they be tempted by a tub of ice cream after a marathon session of step-running?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-03-10",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 559212,
                    "name": "Charlotte and Heather",
                    "overview": "This week's show features Charlotte, whose dreams of being a pin-up model have fallen flat so far due to her desperate diet. She weighs just six stone and her childlike portions are doing nothing to help her gain the womanly curves she craves.\n\nJoining her in the final five-day diet swap is 22-year-old Heather, who's passing on her terrible eating habits to her toddler daughter. The bride-to-be's reliance on ready meals is keeping her at over 20 stone - and no closer to getting into her perfect wedding dress.\n\nThree weeks after two thirds of her stomach was cut away in life-threatening surgery, Lisa Wheeler reveals her dramatic weight loss.\n\nDitching diets in favour of a glamorous photo shoot, Anna Richardson discovers the Hollywood cheat's route to a slimmer body, including inch-reducing designer frocks and digital liposuction.\n\nAnd the Flab Fighters' latest calorie-burner takes them to Silverstone for the dirty job of rally car washing in exchange for a celebratory glass of bubbly. While, at the end of their course of therapy, four anorexia sufferers describe their feelings as they visit a spa for a massage and face their biggest challenge of the course.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-03-17",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 559213,
                    "name": "Kevin and Stefan",
                    "overview": "One year on, Dr Christian Jessen invites diet swappers back to discover how they're getting on with their new healthy lifestyles, and whether they've finally managed to banish their bad eating habits for good.\n\nTwenty-six-year-old Kevin from Brighton weighed just 8 stone 5 lbs; he was living on coffee, cigarettes, pre-packed sandwiches and takeaways. He regularly skipped breakfast or lunch - or replaced them with chocolate or crisps.\n\nWe also catch up with Stefan, a 36-year-old milkman from Northern Ireland. A self-confessed 'carb junkie', Stefan weighed in at 37 stone and was keen to lose weight in a bid to get on the dating scene and boost his confidence.\n\nSo how are they both faring 12 months later?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-03-24",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 559214,
                    "name": "Yasmin, Darryl, Tatiana and Sandra",
                    "overview": "Dr Christian Jessen checks up on diet swappers one year on.\n\nDarryl from Derbyshire was a hefty 33 stone, and was keen to lose weight in a bid to be more active with his two young sons. The self-titled 'Blobbie Williams' lived on fry-ups, roast dinners, crisps and kebabs - often all in the same day. Darryl swapped with London mum Yasmin, whose diet was free of wheat, dairy, gluten, lactose and preservatives . Yasmin hoped to gain more curves and boost her energy.\n\nLondon-based jazz singer Sandra was desperate to lose weight to combat her chance of developing diabetes, which runs in her family. She met seven-stone Tatiana in the food clinic. Tatiana, from Brighton, hated her skinny body, but couldn't bring herself to eat anything that wasn't lean and fat-free. How has the last year been for them?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 28653,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "525853bb760ee3466107aea4",
            "air_date": "2010-03-23",
            "episodes": [
                {
                    "air_date": "2010-03-23",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 559215,
                    "name": "Julie and Jade",
                    "overview": "It's fireworks in the feeding clinic as 24 stone call centre agent Julie meets superskinny caffeine addict Jade.\n\nJade weighs just five and half stone, and is desperate to regain her pre-pregnancy size for the sake of her young son. While Jade barely eats a thing, Julie, whose lack of confidence is stopping her from following her dream to be a schoolteacher, binges on huge platefuls of home cooked food, from massive cream filled curries to cheesy topped shepherds' pies.\n\nDr Christian pushes the diet swappers to look beyond what's on their plates to explore the psychological triggers that lead to their dangerous diets. But Julie goes into meltdown when she's accused of lying about what she eats by Jade.\n\nIn 'Postcards from America', a new strand of hard-hitting short films featuring morbidly obese Americans, 37 stone Alaina Morgan from Santa Rosa, California, makes a plea to Julie to lose weight before it's too late.\n\nPresenter and serial dieter Anna Richardson is two stones lighter than when she two years ago, but admits that she continues to be obsessed with getting the perfect body. In this film she investigates the very latest diet products and exercise fads.\n\nThe show also takes a glimpse into the lives of three women and one man in the grip of the mental illness anorexia nervosa, following their progress over the series as they explore the causes of their condition under the guidance of eating disorder specialist Dr Peter Rowan.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-30",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 559216,
                    "name": "Lucy and Leighton",
                    "overview": "Emotions run high in the feeding clinic as Dr Christian Jessen pushes calorie-counter Lucy Lee and buffet-binger Leighton Davies to the limit.\n\nLucy weighs in at just under eight stone. She became addicted to dieting after shaking off her post pregnancy weight, and is terrified she'll end up too ill to care for her child. Trying to wolf down Leighton's gigantic portions of take away food brings all of her anxieties rushing back to the surface.\n\nTwenty three and a half stone Leighton breaks down when he receives a video message from the morbidly obese Edward Ledesema in Los Angeles, urging Leighton to wake up to the true dangers of his deadly diet.\n\nAnna Richardson continues her investigation into getting the perfect body. Desperate for smaller, firmer looking breasts, she meets a top glamour model who gives her some secret tips of the trade.\n\nThe show also takes a glimpse into the lives of three women and one man in the grip of the mental illness anorexia nervosa. This time the quartet go to supermarket shopping for a lunch consisting of the high calorie ingredients they would normally avoid. But this proves a step too far for Ashley.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-06",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 559217,
                    "name": "Scott and Emma",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-13",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 559218,
                    "name": "Wayne and Lucia",
                    "overview": "Binge eater Wayne swaps diets with fussy eater Lucia. And Anna Richardson tries tower running, ultrasound and infra red, as she bids to get herself a perfect pair of legs.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-20",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 559221,
                    "name": "Andy and Hannah",
                    "overview": "Junk food addict Andy moves into the feeding clinic with `too-busy-to-eat' Hannah, who battles with Andy's junk food medley as she forces down pizzas, burgers and kebabs. And Anna Richardson tries to get perfectly honed and toned arms.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-27",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 559219,
                    "name": "Alyson Mawunga, Nick Wood",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-05-04",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 559220,
                    "name": "Louise and Carly",
                    "overview": "In the feeding clinic Louise Knox, queen of convenience food, meets Carly Pitman, who's so busy she never finds the time to eat.\n\nLouise weighs 18 stone, nine pounds. She gorges on pizza, burgers, fried chicken and chips, and is worried her weight is hampering her chances of a second child, while also leaving her too tired and unfit to play with the one she's got.\n\nLouise receives a shocking video postcard from America, in the form of Laurie who weighs in at a staggering 30 stone, and can't stand up for more than two minutes at a time.\n\nCarly, meanwhile, is a tiny seven stone, and consumes a fraction of the vitamins and minerals her body needs. She never finishes a meal and is constantly tired as her body struggles to run on empty. Dr Christian warns Carly that this sort of behaviour, if unchecked, can spiral into a serious eating disorder.\n\nThe four anorexics are tested to the limit, as they attempt to make and then eat their food nemesis, pizza!\n\nAnd Anna Richardson uncovers a disturbing new procedure in which a patient's own blood is literally sucked out and re-injected into their skin to make it look younger.\n\nAnna also heads back to ballet classes, where she tries, and fails to move like a prima ballerina.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-05-11",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 559223,
                    "name": "Louise and Eddie",
                    "overview": "Food hater Louise swaps diets with 39-year-old biker Eddie, who needs to change his diet before it's too late. And Anna Richardson gives up on perfection and accepts what she was born with.\n\nFood hater Louise Tighe from Hartlepool weighs in at a miniscule six stone 13 pounds. She works long hours as a waitress and barely finds the time to eat. When she does, she eats a few mouthfuls and the rest goes in the bin. Louise bursts into tears as she makes the connection between her bad eating habits and her unhappy childhood.\n\nEddie tips the scales at a whopping twenty seven and a half stone and is a ticking time bomb. With a history of obesity related illness and death in his family he needs to radically change his diet before it's too late. Eddie breaks down when he receives a shocking video postcard from America, in the form of 40 stone Quentin from Hawaii.\n\nMeanwhile the four anorexics reach the end of their series-long journey, and celebrate with a three course meal.\n\nAnd Anna Richardson's investigation into getting the body beautiful ends at the beach, as she celebrates her lumps and bumps by running stark naked into the sea!",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-05-18",
                    "episode_number": 9,
                    "episode_type": "finale",
                    "id": 559222,
                    "name": "Heather and Gillian",
                    "overview": "Dr Christian invites diet swappers back to the feeding clinic to discover how they are getting on with their healthy new lifestyles.\n\nPreviously superskinny Gillian entered the feeding clinic with Phillipa to see if she could unlock her dysfunctional relationship with food. Has she been able to do this?\n\nIt's been a year since full time working-mum Heather attempted to curb her enormous appetite. Catch up with her story.\n\nThis revisit also looks back at the harrowing stories of four brave women who sought treatment for anorexia nervosa.\n\nAnd serial dieter Anna Richardson returns to show a group of friends how to have their cake and eat it.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 28654,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "525853bb760ee3466107aeaf",
            "air_date": "2011-03-29",
            "episodes": [
                {
                    "air_date": "2011-03-29",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 559225,
                    "name": "Louise and Josh",
                    "overview": "The new series starts with tears and tantrums as 21-stone Louise Hayes swaps with Josh Evan, whose diet barely features a proper meal.\n\nLouise is determined to get through the swap as deep down she's terrified her five-year-old son is picking up her supersize habits and will end up as big as her. She gets a personal message from America, from 41-stone Texan Karen Ferguson, who is so disabled by her weight that she's been forced to move into a care home. Louise is also flown out to America to witness first hand the horrors of being super-obese.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-05",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 559224,
                    "name": "Amy vs Ami",
                    "overview": "In the feeding clinic, supersize Amy Green, who tips the scales at a staggering twenty-stone plus, swaps with superskinny Ami Walsh, who only weighs seven stone ten .\n\nTwenty-one-year old comfort eater Amy gorges on enough food for three women and is terrified that she's going to pass on her poor eating habits to her baby daughter.\n\nMeanwhile 18-year-old Ami is always too busy to eat, and her poor diet has left her lacking in energy and confidence. It's an emotional week for both women, who are desperate to turn their eating habits around.\n\nAlso, throughout this series, the show follows the ongoing story of women with eating disorders. This time, dietician Ursula Philpot urges the group to face their fear of foods head on in the supermarket.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-12",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 559226,
                    "name": "Dawn vs Charlene",
                    "overview": "It's war in the feeding clinic as Dawn goes into meltdown when calorie-counting Charlene doesn't eat her mountainous meals.\n\nMeat addict 47-year-old Dawn Grant tips the scales at a whopping eighteen stone four lbs. Over a year Dawn wolfs down 208 whole chickens, 1716 rashers of bacon, 3800 sausages, 36,000 slices of deli meat, and 36 kilos of minced beef.\n\nCharlene Sequiera weighs less than six stone. Her diet is so restrictive that she lacks energy and is constantly sleeping. This is seriously affecting her life at uni. Charlene desperately needs to eat more, but it's one excuse after another until Dr Christian gives her a stern dressing down.\n\nDietician Ursula Philpot challenges the regular group of eating-disordered women to have 3-D plaster casts of their torsos made to face the reality of what their dangerous eating habits have done to their bodies.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-19",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 559227,
                    "name": "Janet and Tara vs Joanne and Keith",
                    "overview": "It's a first for the show with a double swap as mother and daughter Janet and Tara Wells swap diets with too-busy-to-eat Joanne Evans and Keith Linage.\n\nJanet and Tara weigh in at nearly half a ton. Their diet of cholesterol-crammed Chinese meals and cakes aplenty have left them both morbidly obese.\n\nJoanne and workaholic Keith have no time for food in their hectic lifestyles. But, with a gallery of superskinny horrors, Dr Christian shocks them into realising the potential dangers of their deficient diets.\n\nAnd the show's group of eating disordered people bravely face their food fears head-on as they attempt to confront the overwhelming choices offered at a breakfast buffet.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-26",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 559228,
                    "name": "Stu vs Alice",
                    "overview": "It's an emotional rollercoaster in the feeding clinic as Supersize cheese addict Stu Preston takes on Superskinny portion controller Alice Duran. At 27 stone 13lbs Stu is digging himself an early grave with a knife and fork and desperately needs help.\n\nTwenty-five-year-old mum of two Alice weighs a lightweight 7 stone 13lbs by obsessively controlling her diet and weighing her food but she's hiding a supersize secret, she once weighed a staggering 17 stone.\n\nStu's deadly diet of fast food and excess cheese pushes Alice into meltdown and Dr Christian wades in to confront her about her food phobias.\n\nPlus eating disorder dietician Ursula Philpot asks the show's group of eating disordered people to look back to childhood times when eating was enjoyable, which forces the girls to face up to the fact food should be fun.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-03",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 559229,
                    "name": "Mark vs Dale",
                    "overview": "Forty-two-year-old Mark's daily diet of mountains of greasy food has left him 11 stone overweight. He goes head-to-head with self-conscious food casualty Dale who weighs less than ten stone.\n\nMark Hughes is a heart attack waiting to happen. His continuous consumption of greasy mountains of food has left him weighing 22 stone 3lbs. He's not slept in the marital bed for seven years because of his loud snoring, and relations with his wife are becoming tense. He's checked into the feeding clinic as a last ditch attempt to shift some pounds and start becoming an active dad again.\n\nMark's diet-swap partner is 21-year-old Dale who's been running his body on empty and now weighs a lightweight nine stone six lbs. His skinny frame has knocked his self confidence and left his family worried.\n\nDale wastes no time getting stuck into Mark's colossal portions but the mountains of grease and fat soon turn his stomach - and he just can't keep it down! This sickening wake up call helps Mark realise just how appalling his diet really is.\n\nPlus the show's eating disordered group are challenged to confront their distorted body images with a day of clothes shopping. It's a struggle for all of the girls but particularly the youngest member of the group Erin, who has an emotional realisation about the extent of her illness.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-10",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 559230,
                    "name": "Danni vs Vicki",
                    "overview": "Sugar junkie Danni Brooke swaps with 21-year-old Vicki Smith from Glasgow.\n\nIt's a highly emotional week in the feeding clinic for 29-year-old Danni Brooke from Lincolnshire. Danni's constant gorging on cakes and snacks has left her a staggering twenty-four stone five.\n\nFood-phobic Vicki Smith's picky eating habits have reduced her to a lightweight six stone four. Swapping diets brings extreme emotions to the surface as Danni opens up to Vicki about a foodie secret from her childhood.\n\nDr Christian shocks Vicki with a superskinny gallery designed to highlight the potential dangers of her appalling diet, while Danni breaks down as she gets a wake-up call from America.\n\nEating disorder dietician Ursula Philpot takes the remaining two members of her group to a spa to try and reverse their feelings of low self-esteem.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-17",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 559231,
                    "name": "James vs Modasser",
                    "overview": "Second-hand car dealer James Collier goes head to head with uninterested undereater Modasser Zafar in a tense diet swap.\n\nThirty-two-year-old James loves supersized portions of greasy food - sometimes getting through four platefuls in a sitting. James weighs in at over 24 stone six and is terrified that his steady weight gain will end up giving him a heart attack and prevent him seeing his kids grow up.\n\nThirty-one-year-old credit controller Modasser is at the opposite end of the scales at a tiny eight stone three. He skips meals and rarely finishes dinner.\n\nJames receives a 32 stone wake-up call from America in the form of Mike Eak from Florida. Mike not only lost his job because of his weight but his enormous size has left him incontinent and his lack of mobility has meant he's taken to urinating in cups.\n\nAlso, the remaining two members of the eating disordered group reach the end of the course and celebrate with a two course meal.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "",
            "id": 28655,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "525853bb760ee3466107aeba",
            "air_date": "2012-02-28",
            "episodes": [
                {
                    "air_date": "2012-02-28",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 559232,
                    "name": "Supersize vs Superskinny",
                    "overview": "Dr Christian flies out to Evansville, Indiana, officially America's 'Fattest City', where 38% of the population is obese.\n\nExperts predict that by 2020 a third of adults in the UK will be obese. But in America this milestone has already been reached. He meets a woman who lost her foot to obesity-related diabetes, and visits a funeral home where the coffins are the size of hot tubs!\n\nIn the Feeding Clinic, Supersize and Superskinny go on a shocking diet swap. But before they swap diets, Christian gives his Supersizer a terrifying glimpse into the future by sending them to the US, to spend time with somebody whose obesity has ruined their life.\n\nThe new series also examines a variety of eating disorders as six men and women reveal their very personal stories. In this episode, 18-year-old it's Ellie Lambert, whose anorexia was triggered by a jaw operation that prevented her from eating.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-06",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 559233,
                    "name": "Rob vs Hayley",
                    "overview": "Foodaholic Rob Gillett goes head to head with foodphobic Hayley Payne in the Feeding Clinic. And Dr Christian goes for a ride on a supersize ambulance in America's fattest town.\n\nRob Gillett's obsession with donuts and cream cakes has seen him eat his way to an enormous 35 stone 10 pounds. While on the other end of the scale, for busy-bee Hayley food isn't a priority - which has left her weighing in at just 6 stone 12 pounds.\n\nAnd the warning signs of bulimia are revealed through the eyes of 20-year-old Lucy Glover, who regularly binges and purges on a staggering 8000 calories at a time.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-13",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 559234,
                    "name": "Hugh vs Lynsey",
                    "overview": "In the Feeding Clinic comfort eater Hugh meets Lynsey, who has a fear of choking. And fashion student Laura reveals how an eating disorder has left her addicted to exercise and surviving on just 600 calories a day.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-20",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 559236,
                    "name": "Geoff vs Josh",
                    "overview": "Snackaholic Geoff Milton meets sweet-toothed meal skipper Josh Bryson in the Feeding Clinic. And Dr Christian visits an after-school nutrition class in America's fattest city.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-27",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 559235,
                    "name": "Jo vs Emma",
                    "overview": "Head to head in the Feeding Clinic are Jo from Staffordshire and Emma from Lincolnshire.\n\nFormer anorexic Rosemary recounts her story, from the depths of the disease through to her amazing recovery.\n\nAnd in Evansville, America's fattest town, Dr Christian witnesses life-saving surgery for the super obese, meeting the bariatric surgery team who perform the very latest gastric bypass operation.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-03",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 559237,
                    "name": "Chris vs Nathan",
                    "overview": "Takeaway addict Chris Longley swaps diets with meal-skipping hairdresser Nathan Smith - and gets a shock when he is sent to stay with a 32st American man whom doctors believe has five years to live. A 19-year-old reveals why his disordered eating has caused him to lose 11st in nine months, and Christian Jessen visits an overeaters' support group in Evansville, Indiana (Christian Jessen)",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-12",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 559238,
                    "name": "Saskia vs Nick",
                    "overview": "Saskia Roberts, a 23-year-old Caribbean cuisine enthusiast, trades diets with 25-year-old food analyst Nick Harvey, who refuses to eat anything without identifying its contents first. Dr Christian Jessen also visits Evansville, Indiana, to tuck into a rack of baby back ribs containing 2,300 calories, and introduces 30st Lisa Bockus, who had to terminate a pregnancy because of her weight (Christian Jessen)",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-17",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 559239,
                    "name": "Brooke vs Marie",
                    "overview": "Supersize medical student Brooke meets superskinny Marie Sheratt in The Feeding Clinic. And in America's fattest city Dr Christian hits the airwaves to urge the townsfolk to change their ways.\n\nTwenty-year-old Brooke Gamble is worried her size 28 body will stop future patients taking her seriously as a doctor. Dr Christian sends Brooke to America to meet 32-stone Christina White, who is confined to living and sleeping in just one room.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-24",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 559240,
                    "name": "Josh vs Louise vs Vicki",
                    "overview": "This edition revisits three former Supersize vs Superskinny feeding clinic inmates: chronic food dodger Josh Evans, five-course food-lover Louise Hayes and foodphobic Vicki Smith.\n\nOne year down the line have they managed to ditch their dangerous eating habits for good?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-01",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 559241,
                    "name": "James, Modasser and Ami - revisit",
                    "overview": "One year after checking into the Feeding Clinic, have over-eater James and under-eaters Modasser and Ami stuck to their new eating plans or reverted to their old, very unhealthy ways?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "",
            "id": 28656,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "525853bb760ee3466107aec5",
            "air_date": "2013-01-08",
            "episodes": [
                {
                    "air_date": "2013-01-08",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 559242,
                    "name": "LJ vs Katie",
                    "overview": "Dr Christian visits McAllen's mortuary, which is having to be supersized to cope with wider doorways and autopsy tables. In the feeding clinic, LJ Marley, a takeaway addict who tips the scales at 24 stone, with a 59 inch waist, swaps diets with Katie Reeve, whose childlike portions see her weigh in at a paltry 6st 11lb. LJ visits the US for some shock therapy, being forced to face up to the damage his eating habits could be doing to his body. And Emma Woolf reveals how she developed anorexia and lost half her body weight after a break-up while a student at Oxford.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-15",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 559247,
                    "name": "Joanne vs Ross",
                    "overview": "In the feeding clinic this time Joanne Leadley goes head to head with Ross Clarke from Cardiff. Ross is a meal dodger who never finds time to eat, while 41-year-old Joanne is a giant-portion gorger. Their swap is packed with drama, tantrums and tears. Dr Christian shows Ross the damage his diet is doing to his body and sends Jo to Georgia, America, to meet a woman whose life has been destroyed by overeating. Dr Christian visits America's fattest town, where he meets doctors who treat a huge variety of obesity-related illnesses and patients who have lost toes, limbs and even their eyesight. Recovering anorexic and journalist Emma Woolf explores whether anorexia is inherited.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-22",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 559248,
                    "name": "Julie vs Zoe",
                    "overview": "Forty-two- year-old super snacker Julie Menzies swaps diets with 24-year-old fussy eater Zoe Hughes-Blinston in an emotional encounter. Dr Christian discovers how the funeral parlour in America's fattest town copes with bigger and bigger bodies. And journalist Emma Woolf investigates the little known world of male eating disorders.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-01-29",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 559244,
                    "name": "Simon and Craig",
                    "overview": "Facing off in the Feeding Clinic is 24-stone takeaway addict Craig Nellies and superskinny cola addict Simon Tacaks, who's just too lazy to bother to eat. Dr Christian shows skeletal Simon how concentrated amounts of the chemicals found in cola can cause extreme damage to teeth. In America's fattest town, where levels of obesity-related diabetes have hit epidemic proportions, Dr Christian visits a patient suffering chronic wounds and organ damage. Plus, former anorexia sufferer Emma Woolf investigates anorexia during pregnancy.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-05",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 559246,
                    "name": "Hannah vs Victoria",
                    "overview": "There's a tense and emotional swap in the feeding clinic as teenage comfort eater Victoria Madden goes head to head with fussy food avoider Hannah Pidgley, whose picky eating has already led to her being diagnosed with malnutrition. Hannah's terrified that her terrible diet is wrecking her fertility and her dreams of being a mum, while student nurse Victoria's huge meals and non-stop snacking sees her tip the scales at a mighty 19st 12lb. Dr Christian visits an American women's hospital to find out how obesity affects pregnancy and birth. Emma Woolf looks at eating disorders in older women.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 559243,
                    "name": "Julie vs Dougie",
                    "overview": "Twenty-stone comfort eater Julie Henry swaps diets with coffee addict Dougie Reid. Emma Woolf explores the importance of the early diagnosis of eating disorders. And in America, Dr Christian takes a ride on a bus that's helping Texans battle the bulge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-19",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 559245,
                    "name": "Emma vs Robert",
                    "overview": "It's all out war as round-the-clock snacker Emma Cain goes head to head with Robert Musgrove, who can't be bothered to eat. Dr Christian shows lager-guzzling Emma just what her favourite tipple is doing to her body. In America's fattest town he visits an after-school scheme that aims to help combat childhood obesity. And Emma Woolf travels to Holland to investigate online therapy in the treatment of eating disorders.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-26",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 559251,
                    "name": "Thomas vs Linda",
                    "overview": "Pizza delivery driver Thomas Barnes weighs 27 stone 10 lbs, largely due to his weakness for pizza. Glamourous granny Linda Chik loves fruit and veg, but doesn't eat enough for her busy-bee lifestyle, so weighs in at only seven stone. Before they swap diets, Dr Christian prescribes a supersized wake up call for Thomas - sending him to visit 35 stone Robin Jones from Missouri. Robin is registered disabled and suffers from a host of health problems due to her obesity. And Emma Woolf concludes her investigation into eating disorders with a meeting with 21-year-old Aria Valzano who developed anorexia aged 14.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-06",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 559250,
                    "name": "Nathan, Chris and Jo - Revisit",
                    "overview": "The show revisits three of last year's feeding clinic inmates - meal dodger Nathan Smith, takeaway king Chris Longley, and convenience queen Jo Palmer. One year on, have they managed to ditch their dreadful diets for good? Plus, it revisits Dr Christian's time in Evansville, Indiana - the US city that topped the polls in 2011 as America's Fattest. At the local Deaconess Hospital, he meets patients suffering the severe effects of obesity, and staff on the front line dealing with the crisis.He also visits Keith Davis from Goliath Caskets, who knows all about the ever expanding population - because he makes the biggest coffins in the United States. Twenty-four stone 6 Chris gorged on up to a dozen takeaways a week. His body was paying a very high price when he checked in to the Feeding clinic. Sharing the diet swap dinner table with Chris was 21 year old meal dodging hairdresser Nathan Smith - who had a head full of excuses for his puny 8 stone 5 frame.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-12",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 559249,
                    "name": "Hayley vs Geoff - Revisit",
                    "overview": "The show catches up with sugar fan Hayley Payne and snackaholic Geoff Milton, one year after they met in the feeding clinic.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 11,
                    "episode_type": "finale",
                    "id": 559252,
                    "name": "Episode 11",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 17918,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 6",
            "overview": "",
            "id": 28657,
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        }
    }
}