{"adult":false,"backdrop_path":"/p0OhjSxBbJPGe7fbPkWXq5V0yaF.jpg","created_by":[{"id":1227240,"credit_id":"5257157c19c2957114081f39","name":"Lee Falk","profile_path":null},{"id":33313,"credit_id":"5257157c19c2957114081f3f","name":"Alex Raymond","profile_path":null}],"episode_run_time":[21],"first_air_date":"1986-09-08","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"}],"homepage":"http://www.hearstent.com/defendersofearth.html","id":1794,"in_production":false,"languages":["en"],"last_air_date":"1986-12-05","last_episode_to_air":{"id":957278,"name":"Ming's Thunder Lizards","overview":"The Defenders fly to Alaska to inspect a dinosaur alert. While following dinosaur tracks, Rick and L.J. discover that a long-dormant volcano, with an artificial dome placed over it, is mysteriously heating up. The senior Defenders and Jedda spot Ming and Garax, while the Defenders are attacked by two Allosauruses! After a narrow escape in a mountain cave, the group discovers Ming's evil scheme- he's used an earth drill to thaw out tens of thousands of beasts buried in the frozen tundra, and is sending them out to destroy the cities of the Earth! The young Defenders figure out how to work Ming's drill, and use it to blow up the drilling station. The volcano explodes, ripping off the dome, and the arctic climate returns --obliterating the Valley of the Dinosaurs.","vote_average":0,"vote_count":0,"air_date":"1986-12-05","episode_number":65,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/aydnfmXjGrxPxr7z2fl2tvZQmrL.jpg"},"name":"Defenders of the Earth","next_episode_to_air":null,"networks":[{"id":19,"logo_path":"/1DSpHrWyOORkL9N2QHX7Adt31mQ.png","name":"FOX","origin_country":"US"}],"number_of_episodes":65,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Defenders of the Earth","overview":"Defenders of the Earth is an American animated television series produced in 1986, featuring characters from three comic strips distributed by King Features Syndicate—Flash Gordon, The Phantom, and Mandrake the Magician—opposing Ming the Merciless in the year 2015. Supporting characters include their children Rick Gordon, Jedda Walker, Kshin, Mandrake's assistant Lothar, and Lothar's son L.J. The show lasted for 65 episodes; there was also a short-lived comic book series published by Star Comics, created by Gerry Conway, Ross Andru and John Romita, Sr.. The closing credits credit Rob Walsh and Tony Pastor for the main title music, and Stan Lee for the lyrics. The series was later shown in reruns on the Sci Fi Channel as part of Sci Fi Cartoon Quest.","popularity":10.802,"poster_path":"/cuRklKSdUyQOSI9WR2BxAkRylAf.jpg","production_companies":[{"id":2301,"logo_path":"/qdPhBEP8sjK3Eb3rKc94554gcZt.png","name":"Marvel Productions","origin_country":"US"},{"id":1488,"logo_path":"/ds4vzeoDAcUk2izdf0pIkR19pbW.png","name":"King Features Syndicate","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":null,"episode_count":7,"id":5080,"name":"Specials","overview":"","poster_path":"/klQaVm1JqRAhd1ZzV8AyZa9Xia5.jpg","season_number":0,"vote_average":0},{"air_date":"1986-09-08","episode_count":65,"id":5079,"name":"Season 1","overview":"","poster_path":"/ubO8ym93FbeTM0mgEQbd5zA9V3y.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.622,"vote_count":82,"season_data":{"1":{"_id":"5257157719c2957114081c48","air_date":"1986-09-08","episodes":[{"air_date":"1986-09-08","episode_number":1,"episode_type":"standard","id":958568,"name":"Escape from Mongo","overview":"When Ming the Merciless leaves Mongo to invade Earth, his old enemy Flash Gordon and the latter's son, Rick, join forces with six others - the youngest a pre-teenaged boy named Kshin - to form the Defenders of the Earth.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/2jpcPdKg8hNHLNPPerinVAhHeqk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-09","episode_number":2,"episode_type":"standard","id":959956,"name":"The Creation of Monitor","overview":"Aided by Flash's Krell allies, the Defenders begin building their base. But Ming has learned of their existence and resolved to put an end to them.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/5Gy2WIzzTZfVot2TBP8sLk0rSj8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-10","episode_number":3,"episode_type":"standard","id":957227,"name":"A Demon In His Pocket","overview":"Some boys try to pick a fight with Kshin so, rather than break the Defenders' Code of Honour, he reads up on summoning spells - against Mandrake's orders - and calls forth a demon named Shogoff (sp?). But Shogoff isn't content with just beating up a few pre-teenaged bullies and starts causing havoc in Central City; at one point, Mandrake collapses on stage when he senses the demon's presence. Kshin, meanwhile, is faced with a dilemma - should he let Shogoff continue his rampage or confess to his part in the trouble and risk expulsion from the Defenders?","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/itXR52hqoYMZxJy5DBmrk1cZeF4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-11","episode_number":4,"episode_type":"standard","id":959955,"name":"A House Divided","overview":"When Africa suffers a sudden and unexplained climate change, the Phantom and Jedda head there to investigate. In the process, the Phantom learns that his estranged brother, Kurt - whom he has never mentioned to Jedda - has (courtesy of Ming) acquired the power to control the weather.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/lWac36gk1LHt6jVmN4xwHvfDkHc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-12","episode_number":5,"episode_type":"standard","id":957230,"name":"Bits and Chips","overview":"When the Defenders receive an invitation to pit Dynak-X against a chess-playing computer, they little suspect that it is part of Ming's plot to implant an electronic maggot into Dynak's circuits in order to turn her against them and ultimately give Ming access to the world's weapon's systems. When Mandrake learns of the maggot's existence, he shrinks Rick, LJ, Jedda and Kisa (Jedda's panther friend) to microscopic size (using Rick's new Microniser ray rather than magic) so they can get inside Dynak and track the creature down.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/rUf9OZQ3t5EUK4ZPgTlfEwV0Hgi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-15","episode_number":6,"episode_type":"standard","id":958569,"name":"The Root of Evil","overview":"Dr. Whitestead's plant food formula goes haywire--spilling on him and turning him into a plant! Ming seizes the scientist, the fomula, and his daughter.\n\nLothar and Mandrake use their skills to save Whitestead, and the defenders must stop Ming from using the forumla to transform the whole planet into plants.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/xMhyxaRHEgBDPWyW3wnvCLll8X2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-16","episode_number":7,"episode_type":"standard","id":957228,"name":"Cold War","overview":"Ming needs Rick Gordon's ring to complete a weather control machine, and having caught Flash in a battle, uses him as bait to lure the impulsive Rick to Ice Station Earth.\n\nIt is up to the remainging defenders to escape the fearsome Mongor, and rescue Rick and Flash.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/gNOxe2uRRYUVDh11YR7A4B8aBrc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-17","episode_number":8,"episode_type":"standard","id":958570,"name":"The Sleeper Awakes","overview":"Eaons ago, a giant robot crash landed on Earth. Ming learns of The Annihilator, which now sleeps beneath Central City, and distracts all but one of The Defenders long enough to activate the robot.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/lmb33ZzhEsrstJ6rkJCYOegUrUT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-18","episode_number":9,"episode_type":"standard","id":957232,"name":"The Revenge of Astra","overview":"The vengeful space princess Astra creates an army of clay soldiers. The daughter of Princess Aura, Astra is convinced by Ming that Flash Gordon was behind her mother's death. She uses blue clay from the Bandar village to create her army.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/5FcluJI9mjJdQSNYhwCsNu9Tk31.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-19","episode_number":10,"episode_type":"standard","id":959957,"name":"The Hall of Wisdom","overview":"The incredible Hall of Wisdom pays its-2000-year, 24-hour visit to the Galaxy. It's a once-in-a-lifetime chance for Ming to get his hands on the dreaded Quasar Weapon, with which he can conquer the Earth.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/yZdwud2ZrM4SAyWb0LeMkiec4NY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-24","episode_number":11,"episode_type":"standard","id":957231,"name":"The Mind Warriors, Part I","overview":"Ming lures Kshin to Ice Station Earth by kidnapping Zuffy, then probes the dark side of Kshin's imagination to create fearsome warriors capable of destroying the Defenders. While the heroes work diligently to dismantle the Doomsday Warhead, a device left in the universe from an earlier holocaust, they are invaded by RADIAN, BI-NINJA, RIPPER, ZALZAR, JAMMER HEAD, and NEUTRON MAN, all products of Kshin's mind. Two of the evil warriors recapture the Doomsday Warhead and transport it to Ming's asteroid base, while the rest stay on to finish off the Defenders. Meanwhile, the young Defenders fly to Ice Station Earth to rescue Kshin. With the help of Dynak Y the super heroes\n\ntrick the mind warriors into thinking they're dead. With Kshin free and the Doomsday Warhead moments from being launched against Earth, Kshin uses the good side of his imagination to make all the Defenders even stronger, enabling them to defeat the mind warriors and reset the guidance controls in the Doomsday Warhead, thereby blowing up Ming's asteriod base and saving Earth.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/dMoNUtVFClsa21t7kytabN2YvcZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-22","episode_number":12,"episode_type":"standard","id":957234,"name":"The Mind Warriors, Part II","overview":"The Defenders add a new twist to the Battle Simulation Room--a Thought-Transference Cap. It transmits the wearer's imagination directly into the simulation; Kshin loves to use it to scare the other Defenders the best he can. But Ming the Merciless has found a way to tap into the Room. Using his ghastly power source, he can use his own evil thoughts and intensify them into reality! What starts out as a thrilling simulation under Kshin is taken over by Ming and turned into a terrible fight to the death in the all-too-real Haunted World. While the older Defenders fight monsters, harpies and skeleton warriors, the desperate young Defenders destroy the simulator and end the horror.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/pl223NWlQvdEyWDvimYzEnxtu7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-23","episode_number":13,"episode_type":"standard","id":957235,"name":"The Lost Jewels of Tibet","overview":"Ming is seeking the Jewels of Power, but a female archeologist named Atuskedero is also after them and travels to Tibet with Lothar and Mandrake (the latter worked with her in his pre-Defender days) to find the Jewels before Ming's forces do. But, when the trio discover the Jewels, it becomes clear that they have the power to hypnotise anyone who touches them. Can the remaining six Defenders reach their two companions in time to prevent an ancient legend - which predicts that the Dragon of Vengeance will appear if the Jewels are ever disturbed - from coming true?","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/6qvvpVuxFaM3mkaukMWLVuBWxNb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-25","episode_number":14,"episode_type":"standard","id":957237,"name":"The Evil of Doctor Dark","overview":"Mandrake's old enemy, Damian Dark, and the latter's Psychic Warrior cohorts escape from jail and join forces with Ming's troops to search for the legendary Well of Essence.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/8hl52Os7Vd7CZ4LYYHq423e1ZrM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-26","episode_number":15,"episode_type":"standard","id":957233,"name":"Diamonds are Ming's Best Friends","overview":"Ming enlists the aid of the ruthless Beastmaster to create an army of Crystal Soldiers, beings grown from diamonds and invulnerable to everything except an extremely rare mineral called Orcite.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/xaWoT9Y7FSLDEuYEWfjgV9q8GrJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-29","episode_number":16,"episode_type":"standard","id":957238,"name":"The Men of Frost","overview":"For Ming's plan to blanket the earth with a veneer of frost to be successful, the satellite requires the strength of a Starblue Crystal, of which only three exist. During a ceremony in which Mandrake donates his Starblue Crystal to the Central City Museum, the Defenders fight off an invasion by Ming's forces and capture two of his Men of Frost, Elgar and Zikry. Rick makes good use of a new invention which re-humanizes Men of Frost and Elgar tells the Defenders of Ming's plan to conquer earth. Zikry however, remains loyal to Ming and sabotages Dynak X before our heroes discover his true \"evil\" side. When Ming locates the last remaining Starblue Crystal he launches the satellite. It appears that it may be too late to stop Ming, but the Defenders fly out in their battle ships, engage Ming's roboships in an outer-space dog-fight, and explode the satellite with seconds to spare.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/eiYddddwxNzT1EVipDbmR6jbSW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-30","episode_number":17,"episode_type":"standard","id":957236,"name":"Battleground","overview":"Ming's forces travel to the planet Grubor, where they use his freeze-ray weapon to capture six Cave Slugs- invincible alien creatures the size of semi-trucks who can and do eat anything, including rock, metal and laser beams. They are harmless unless provoked, whereupon they counterattack with tremendous force. The Merciless One deploys his first Cave Slug in a mine tunnel beneath Monitor, and as the alien munches its way towards the Defenders headquarters, Kshin and Zuffy stumble upon it and must be rescued by the Defenders. At the time the Cave Slug breaks through the top of the Volcano and heads to Central City, Ming places the five other Cave Slugs in major cities all over the world. The Defenders make the costly mistake of attacking the Cave Slug, sending it on a rampage until Jedda uses her animal telepathic contact abilities to make peace with the alien monster. Infuriated, Ming decides that if our heroes won't provoke the creatures, he will; however, his attack on the earth is crushed when the Cave Slugs counterattack Ming's forces. The misunderstanding settled, the Defenders happily transport the Cave Slugs back to Grubor.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/wAZd6qhpRrPLCZyr47ccd7DdbA1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-01","episode_number":18,"episode_type":"standard","id":957240,"name":"The Panther Peril","overview":"When the famous explorer Andrew Huxley encounters the wrath of Ming the Merciless while on expedition in Africa, he immediately calls in the Defenders. Ming kidnaps the Chief of the Bandar tribe after destroying their village, and forces him to lead the way to the hidden Temple of Pantheria. Before the Defenders depart for Africa they confine Kisa in a forcefield- for her own, as well as the other's, safety- leaving the key card with Kshin, under strict orders not to let Kisa out or give the key card to any-one else, especially Jedda. A short time later Kshin, disobeying direct orders, hands over the card to Jedda, who lets Kisa free. Meanwhile Ming reaches the Temple of Pantheria, locates the sacred tooth and with its powers orders Kisa to attack and destroy the Defenders. Kisa obeys, wreaking havoc all over Central City. Rick and Jedda track Kisa down and just as Rick is about to shoot her, the Defenders locate Ming in Africa and, with the help of Mandrake's illusory power, wrest control of the sacred tooth. He reverses Ming's orders just in time to save Kisa and our heroes.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/57taLiDpdUp7BUi3jEiTARMVv6Z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-02","episode_number":19,"episode_type":"standard","id":958571,"name":"Fury of the Deep","overview":"Ming's attack on an oil platform, to capture a main computer containing the earth's entire energy network, is foiled by the Defenders, but all is not lost as he spots oceanographer Maurice Quiston using a brainwave transmission helmet to communicate with sea creatures. Ming appeals to Quiston's love of the sea world and convinces him to join forces in battling the ocean-destructive forces of modern society. With Qusiton operating out of Ice Station Earth, all the ocean's inhabitants obey his orders, joining together to attack oil tankers, undersea food farms and sewage systems all over the globe. Meanwhile the Phantom, and old friend of Quistons, finds the oceanographer's floating sea-platform vacant, while Falsh, Lothar, Jedda and Mandrake try to save the food farm from destruction. Quiston discovers that Ming has double-crossed him when the Evil One destroys his sea platform. He joins forces with the Phantom to stop the ocean life's attacks and then blows up his brainwave transmission helmet and computer in the control room of Ming's Ice Station Earth.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/uZiUfHdZir969uin2gud7XYTquf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-03","episode_number":20,"episode_type":"standard","id":957239,"name":"Family Reunion","overview":"Ming captures the Phantom and Jedda as they return from the race against N'Dama (really the Phantom's brother Kurt Walker) for the Jewel of Zandoon. Once again his old self, Kurt Walker stows away on Ming's ship, and back at Ice Station Earth he watches as Ming places the Phantom in the Deep Freeze Chamber. Small Fry, a monkey the Phantom and Jedda picked up in Africa, sabotages the wiring of the Freeze Chamber, buying the Phantom more time and allowing Jedda and Kurt to escape into the corridors of Ming's hideout. Jedda saves Kurt's life more than once before he finds the Golden Chamber and turns himself back into N'Dama; however, he refuses to help Jedda save the Phantom until she promises to reject the Phantom's birthright and becomes his protege. Using his skull ring the Phantom escapes the Freeze Chamber and is horrified to find Jedda in the uniform of the Weather Demon. N'Dama steals the valuable mineral Thalacitrate, which will allow him to remain N'Dama forever, from Ming. The Phantom and Jedda, poised for take-off from Ice Station Earth, benevolently save N'Dama's life, prompting the Spirit of the Winds to restore her birthright before he disappears in a mysterious flash of light.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/anag3oknHJ4IsB9bolwcsqCu9ia.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-06","episode_number":21,"episode_type":"standard","id":957241,"name":"The Defense Never Rests","overview":"The Defenders fly into space to investigate a mysterious comet and discover, too late to break from the tractor beams dragging them toward the comet, that in reality it is an Ilyrian spaceship. Inside the ship the Defenders are informed that they will be tried as the greatest criminals in the galaxy, with Ming as the accuser!! In exchange for his irrefutable evidence against the Defenders, the Evil One receives, under the pretense of \"tools to rebuild the Earth\", an anti-gravity device, a space warp drive, a machine to quadruple food harvests, and an energy shield to make all weapons obsolete, but these \"tools\" will actually serve to help Ming conquer the world. When the evidence is presented in court- film of the Defenders (actually Ming's Android Clones)- committing heinous crimes against the people of earth, things look bleak for our heroes. Rick, L.J. and Jedda manage to escape and invade Ice Station Earth, where they locate the androids and uncover Ming's plan. Back on the Ilyrian ship the Defenders are found guilty and sentenced to banishment to a galaxy 300 light years from earth, however just prior to their transport the young Defenders burst into the courtroom with the androids and save the day.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/dSvKIJmH108wKAoEB8wHmadcYvC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-09","episode_number":22,"episode_type":"standard","id":957245,"name":"Like Father, Like Daughter","overview":"Ming's estranged daughter, Aura, crash lands her ship on Monitor and informs the Defenders of her father's latest scheme to enslave the population of earth with his Mind Neutralizer. Flash, an old friend of Aura's who once saved her and her husband, Barin, from destruction at the hands of Ming, immediately sets out for Grand Junction with Aura, Rick, Jedda and L.J. Upon arriving they discover that all the city's officials are already under Ming's hypnosis and that Aura's motivation is revenge- pure and simple. As Mandrake, the Phantom and Lothar rush to the rescue, the Defenders escape and convince Aura that she is an unwitting dupe in Ming's evil scheme. Briefly captured but now free, Mandrake and Lothar, with the Phantom set to work on reversing the polarity of Ming's neutralizer before he hypnotizes the entire world, while Flash, Rick, L.J., Jedda and Aura fly to an alien planet to rescue Barin. Seconds before Ming's scheme enslaves the world Dynak X completes the reversal, and all those previously under Ming's spell are once again free-thinkers.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/sS2UWf9OIvoNWmE9LaAAISGGibK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-10","episode_number":23,"episode_type":"standard","id":957243,"name":"The Would be Defender","overview":"At the dedication ceremony for a new courthouse built in honor of our heroes, 13 year-old Earl Sump, bespectacled and dressed in a homemade superhero suit, captures two pick-pockets in the crowd. His reward- a day spent at Monitor with his idols, the Defenders of the Earth. Immediately Earl's overzealous nature endangers our heroes --he almost causes the Defender ship to crash, and when the Defenders fly out to a distant planet to investigate some strange behavior, Earl stows away, his antics on board causing Flash's ship to run aground and nearly be destroyed. Back on Monitor Earl locks Jedda in a storage compartment and hijacks a ship which he pilots to Ice Station Earth. Unintentionally he rewires Octon, turning the evil computer into his amicable sidekick, and brings him back to Monitor. Earl then plans a day of celebration in his honor, inviting all of Central City to take part. This all invokes the wrath of Ming, who invades the party. Earl unintentionally turns Octon back into his old self, and it looks as if Ming will destroy the residents of Central City, however the Defenders arrive in the nick of time to drive Ming away and save the populace.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/swmNcj7GfCCXy8If9XH936ACYUp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-13","episode_number":24,"episode_type":"standard","id":957244,"name":"Doorways into Darkness","overview":"Deep in Africa Ming locates an anti-energy source enabling him to open the Nightgiant Doorway and unleash 7-story tall nightgiants to destroy the earth. Flash flies out to space to destroy a Ming satellite, but his ship is immoblized by the Merciless One's roboships, while the Phantom goes to Africa to terminate Ming's activities in the Forgotten City. As the nightgiants terrorize various parts of the globe Rick intercepts a transmission from Ming to Garax and discovers that a transport invertor will eliminate the monsters. Mandrake, Lothar, Rick, L.J., Jedda, Kshin and Zuffy take on two nightgiants outside of Central City while racing to the stadium to retrieve the saving invertordevice. As they recover the device, Rick is captured by one of the creatures. Jedda departs for Africa, where her father will use the transport invertor to close the nightgiant doorway, while the other Defenders save Rick. Out in space Flash finally fights off all of Ming's minions and blows the satellite. Jedda delivers the transport invertor to the Phantom and they battle Ming's troops before employing the device and sending the nightgiants back to their own world.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/bJCT4sJJltDfT0oUny7VpqCWnmM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-14","episode_number":25,"episode_type":"standard","id":957246,"name":"Deal With The Devil","overview":"While captives in Ming's jail, Rick and Jedda overhear Octon and Garax's plans to revolt against Ming. In exchange for their freedom, the Defenders offer to help in the scheme. When the uprising begins, Octon contacts Monitor in a plea for help, however Flash and the other Defenders recognize this as another in a long line of Ming's vile attempts to destroy the Defenders. Rick, L.J. and Jedda disagree and with Kshin and Zuffy as stowaways, the three fly off to Ice Station Earth to help defeat Ming. They arrive at Ming's devastated headquarters to discover that it is indeed another of Ming's schemes- the Three Sorcerers Of Teros created the illusion of a battle torn command center explicitly to lure the young Defenders there so that Ming can probe Rick's mind for the plans to Monitor's defense system. When Flash, Mandrake, Lothar and the Phantom arrive to rescue the kids they engage the Sorcerers in combat. Flash uses his sonic-ray blaster to destroy the crystals encircling the Sorcerers, while Mandrake and Lothar unstrap Rick from Ming's mind-draining device. United with Jedda and L.J., the Defenders of the Earth destabilize the shifting ice flow under Ice Station Earth before mounting their ships for the flight back to Monitor, once again victorious in battle- but yet to win the war.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/dO6cZgNSkqIYl0EtmChYaTiPKaR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-15","episode_number":26,"episode_type":"standard","id":957242,"name":"Terror In Time","overview":"After retrieving a vat of deadly mutant slime from Ming's laboratory, six of the Defenders (LJ and Kshin do not appear in this episode) are chased through a time warp and go back to the days of King Arthur. There, they meet and join forces with Prince Valiant who tells them that his wife, Alita, is being held prisoner by the evil Warlock who has stolen the fabled Eternity Stone. And, to further complicate matters, the mutant slime - which has already infected Mandrake - escaped from the Shuttle when the Defenders crashed into the sea and begins to spread.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/11WAgveAChOLFfUWHVOTSVWA1pz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-16","episode_number":27,"episode_type":"standard","id":957250,"name":"Ming's Household Helpers","overview":"The household helper robot, designed by Ming the Merciless in another of his evil schemes, is the hottest selling item on the market, deployed in over one million homes worldwide- including Monitor. Ming plans to use a space satellite to direct a hypno-beam through the robots to hypnotize their owners and make them slaves of the evil emperor. At the behest of Jedda, Rick examines his robot and discovers the plot, alerting the Defenders. When Flash flies out to space to destroy the satellite, he discovers Ming has a few tricks up his sleeve- a tractor beam renders his ship powerless and drags him towards Ice Station Earth!! Splitting up, Lothar, Mandrake and the Phantom penetrate Ming's fortress to save Flash. While Ming captures the Jamaican and the Magician, the Phantom wreaks havoc on the robot production lab. Ming activates his hypno-beam and sets the final stages of his plan into motion, however back at Monitor Rick mobilizes his frequency inhibitor, overloading the household helper robots and rendering them useless. Back at Ming's fortress, Mandrake uses telekenesis to overload the main generator, enabling he, Lothar and Flash to escape with the Phantom. As the robot production lab blows, Ming evacuates safely- surviving to return and fight another day.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/tCIwO0H143uDczVayx4SNlbXXCL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-17","episode_number":28,"episode_type":"standard","id":957248,"name":"The Starboy","overview":"While transporting Starchild, a child-like alien who has landed on earth, through the woods around Monitor, the young Defenders encounter two alien scouts who attempt to destroy their new acquaintance. With the help of the elder Defenders the scouts are run from the planet, but not before identifying the alien as an evil monster and promising to return. Back at Monitor, Dynak X informs our heroes that an armada of 200 alien ships are on their way to Earth, prompting Flash, Mandrake, Lothar and the Phantom to fly into space to investigate. Meanwhile, Starchild blasts his way out of Monitor and rampages through Central City, with the young heroes on his trail. Amongst the stars, the senior Defenders talk to Roarke, a reptile-like alien, who tells them that Starchild is a genetically engineered being created by the great scientist Shoar Koron, and he has limitless powers- which he has previously used to wipe out entire civilizations. The aliens intend to destroy Earth, thereby ridding the galaxy of the child. The young Defenders learn that Starchild is not really evil, but like any child he requires love and attention. Mandrake impersonates Koron to explain to Starchild that he must use his powers for good, not bad, and the little alien makes peace with all the space ships, before streaking away into the star system.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/zKKSKqpGBNAKT7vZfKyR4veXYSJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-20","episode_number":29,"episode_type":"standard","id":959958,"name":"The Gods Awake","overview":"When statues of ancient gods mysteriously come to life the Defenders are summoned to the Himalayas by Mandrake's old magic teacher, Theron. Our heroes learn that Ming and a mystic are behind the bizarre occurances, another element in a plan to recover a sacred dorje which will bestow upon Ming the power to rule the world. When Ming gains control of the sacred dorje, Mandrake tries to warn him about the danger of his mystic collaborator, but to no avail. The mystic snatches the dorje from Ming and uses it to turn himself back into Shiva- the destroyer god- who was banished from his dimension of Bodhidarma ages ago. As Shiva proclaims \"Let the time of destruction begin\" and he fades into his other dimension, Mandrake must follow. Ming, true to his cowardly nature, flees the scene, leaving the Defenders to amend the world-threatening situation he brought about. In the other dimension Mandrake battles valiantly against Shiva, however it appears his efforts are not enough to defeat the god, until an image of Theron appears and informs Mandrake that in Bodhidarma his illusory powers are REAL, not products of his imagination. Mandrake uses this nifty piece of information to conquer Shiva, and Lothar manages to open up the portal back to our earthly dimension just in time for Mandrake to slip through- with the powerful dorje.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/i6OYeMIlD39KkJas5DYpLa1uUvh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-21","episode_number":30,"episode_type":"standard","id":957249,"name":"The Ghost Walks Again","overview":"When industrial tycoon/hypochondriac Kent Madden's plan to buy a magic health elixer from Partha, son of Chief Ajuna of the of r ican Fallu tribe, goes awry, he makes a deal to obtain use of Ming's forces to steal the potion. The Phantom and Jedda learn of the plot and immediately fly to Africa in the skullcopter. On the way the Phantom is shot out of the sky by Madden and is believed killed. The Fallu implore Jedda to take up where her father left off- as Phantom, protector of their tribe- and after some heavy soul searching she does just that. As Madden and Ming invade in full force, Jedda valiantly leads the Fallu in counter-attack. Unbeknownst to her, the Phantom raises himself from the jungle- he is alive- and must call forth the strength of ten tigers just to muster the power to fly the skullcopter. With the father-daughter team together again Ming and Madden flee for their lives. The Fallu people are saved, however the sanctity of their location is violated, forcing them to abandon their obscurity and join civilization.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/cLvLt5qWebJU6suCcfqPlTnHqQc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-20","episode_number":31,"episode_type":"standard","id":958572,"name":"The Book of Mysteries","overview":"When a two-hundred square mile area of Morocco mysteriously disappears, the Defenders investigate- sans Kshin, who is instructed to choose any book from Mandrake's library for a book report. While Kshin flips through the blank pages of a book titled \"Enigmas\", Flash, Rick, L.J. and Jedda enter the unexplained area and discover a primitive wall with a door in it. Suddenly the wall image appears in Kshin's book, along with an inscription telling how to get inside. As our heroes are nearly crushed by falling rocks, Kshin relays the information and stops the avalanche. Kshin, once again reading from the book, instructs the Defenders, who are now inside the shrine, to push the gold keys on the control panel, revealing the lost city and removing the jamming field surrounding the area. Mean-while Mandrake and Lothar track down a notorious jewel thief and recover the Eye of the Dragon which is missing from the wall. Back inside the shrine our heroes awaken the Sleeping God before Kshin warns them that he is unstoppable, and it looks like certain death for the Defenders. As Flash, Rick, L.J. and Jedda are about to be boiled in oil, Kshin arrives on the scene and convinces the creature that they are here to help; while Mandrake produces the crystal which will allow the Sleeping God to return home, thereby saving our Champions.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/pBdLbs6DJgWm9zOrMwdxfEWjvtL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-21","episode_number":32,"episode_type":"standard","id":957255,"name":"The Future Comes But Once","overview":"While engaging Ming's roboships in battle over the North African Desert, Flash discovers the remains of an ancient pyramid, where he finds an obelisk that produces visions when touched. The other Defenders arrive on the scene and Mandrake informs Flash that the sacred obelisk was believed to foretell the future. Unbeknownst to our heroes, Ming is in the area- in search of the very same obelisk, which he needs to tell the future so that he may propel his time drive device four-times the speed of light. When Rick and L.J. touch the obelisk they see themselves defeat Octon, giving them the confidence to set out for Ice Station Earth. They get as far as Ming's desert hideout, where they are taken prisoner. Mandrake informs our heroes that the obelisk cannot foretell the future, but rather what a person fears or desires for the future. Scavenger, the desert Arab whose home Ming commandeered as a base for his search, breaks free and sends for the Defenders, who raid Ming's headquarters. Mandrake destroys the evil emperor's time drive device, sending the obelisk beyond the reach of mortal men and Ming fleeing for the coolness of Ice Station Earth.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/cOhZI9QMTsOoYIAiweeQX2Y6nN4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-22","episode_number":33,"episode_type":"standard","id":957254,"name":"Kshin And The Ghost Ship","overview":"While on vacation in Jamaica with the Defenders, Kshin sees a ghost ship; however, no one believes him. Determined to get proof of the ship's existence, Kshin rows a dinghy out into the bay one night, and he not only finds the ship, but is taken on board by its ghost pirates!! Meanwhile our heroes are busy trying to figure out why Ming's roboships are in the area. Unbeknownst to them, the warlord is searching for Morgan's Compass, which he will use to turn the ghost pirates into his unconquerable slaves. On board the ship, the pirate captain tells Kshin that they have been searching for years for Morgan's Compass- the only object which can release them from their aimless wandering. Kshin offers help, and with the ghost first mate he goes ashore and returns with a sonic probe to locate the compass on the ocean floor. While Kshin is lowered into the water in a makeshift diving bell, Ming's roboships attempt to fire a freezebeam on the ship putting the ghosts in his power. However, the Defenders blow Ming's minions out of the sky! Kshin emerges with the compass, freeing the pirates and sending them on their way.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/waIKeRpyZxj1FJlUPzmLWUhoYEc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-23","episode_number":34,"episode_type":"standard","id":958573,"name":"The Carnival of Dr. Kalihari","overview":"Dr. Kalihari's carnival is in town and the Defenders are on hand to see the show. What they don't know is that Dr. Kalihari has taken over the carnival from its owners and populated it with collaborators in his get-rich-quick scheme. Kalihari is infuriated when the Defenders embarass his mediocre performers, so to get revenge he dupes Kshin into unleashing a magic shrinking potion on them! Steadily getting smaller --until they will eventually vanish- our senior heroes battle Kalihari, his cohorts, dogs and common household items which pose significant obstacles to 3 inch people, before finally locating the magic antidote potion which restores them to their original size. Once again the \"normal\" Defenders of the Earth, they waste no time in disposing of Kalihari's gang and restoring the carnival to its rightful owners.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/pohL88eCyakGdrud2EYX628qS6a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-24","episode_number":35,"episode_type":"standard","id":957252,"name":"The Mystery of the Book","overview":"Dynak X picks up a bizarre energy transmission from Stonehenge prompting the elder Defenders to investigate. Kshin consults the book of enigma which shows him a blueprint of the ancient stone circle. In England, Flash, Lothar and the Phantom are lured inside Stonehenge by Kronos, a mysterious dark cloud, and turned into statues. Mandrake consults his old magic teacher, Theron, who informs him that Kronos is an evil monster who drove the great magician, Enigma, out of the Land of Magic, then destroyed the dimension. Kronos needs the book, which is actually the old master of magic in \"book form\", to materialize on Earth and destroy the planet. Our young heroes- including Kshin and the book, Enigma,- rush to the rescue; however, Rick, L.J. and jedda are also turned into statues by Kronos. Mandrake, with the help of Theron, fights off Kronos while Enigma guides Kshin into the Stonehenge circle, where he convinces Kronos to give him a blue crystal which allows Enigma to materialize and defeat the evil monster. The benevolent wizard then restores the Defenders to their natural state, before departing for the Land of Magic.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/6smMPoDSSdmhhkQrpE08fdZmcmx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-27","episode_number":36,"episode_type":"standard","id":957253,"name":"Flash Times Four","overview":"Ming knows that Flash Gordon is the only man alive who could effectively fly his state-of-the-art warplane The Scorpion, so he lures our hero to Ice Station Earth, where he has created four Flash Gordon clones! The evil warlord places Flash under his vile inquisitor with Flash's clones at the receiving end of the contraption to gather his exceptional flying skills. However, Flash brilliantly manages to dismantle the control box to the machine, therefore only facets of his personality are transferred to the clones. While the Defenders beat a hasty trail to Ice Station Earth, Flash wakes up in Ming's dungeon. When he again meets his clones he finds four distinct personalities- #1, an authoritarian; #2, a braggart fighter pilot; #3, an intellectual planner; and #4, a cool, Burt Reynolds type. Ming places clone #4, who has a bomb in his chest, in the dungeon so that the Defenders rescue him and bring him back to Monitor. Meanwhile he sends the other three against our heroes. Flash manages to escape from Ice Station Earth, destroys the three clones in a superb example of excellent dog-fighting, and confronts #4 in Monitor, disarming the bomb with seconds to spare.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/AryGkMyxd5m9oHH2VNHZc81E5co.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-28","episode_number":37,"episode_type":"standard","id":957256,"name":"The Frozen Heart","overview":"Ming's forces kidnap LJ's girlfriend, Kate, turning her into a Frost Person, and have her trick LJ, Rick and Jedda into handing the Defenders' Space Station - now armed with a lethal laser-cannon - over to Ming. When the Swordship is shot down, the adult Defenders initiate the Space Station's self-destruct program but, having survived the crash, they learn that Rick, LJ and Jedda are on the Space Station. There follows a race against time to abort the self-destruct program before it is too late.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/cgBx4ZzIj2HDL2q71TKXPn5Qv1b.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-29","episode_number":38,"episode_type":"standard","id":108717,"name":"Rick Gordon, One Man Army","overview":"Rick Gordon's new friend at Central City High ! Carlotta Vallejo- requires his help when Ming backs revolutionary forces to dethrone her father from the Presidency of the tropical island of Esmerelda. While Ming gathers all the blue orchid flowers on the island for use turning the world's population into Frost People, Rick and Carlotta fly to Esmerelda and search for her father, but are captured by El Jefe, the mercenary leader of the upsurge. Back at Monitor Dynak X informs the Defenders that the temperature of the island is being unnaturally lowered, posing potential weather problems and prompting the heroes- sans Mandrake and Lothar- to board the Terry and set out to investigate. Rick and Carlotta escape from El Jefe, discover that Ming has diverted irrigation waters to build a huge glacier, and locate the President. To their horror, they find he has been turned into a Man of Frost before they are once again captured. The Defenders arrive and walk right into a trap, however Mandrake and Lothar, who arrived later disguised as a Man of Frost and an Ice Robot, spring them from Ming's dungeon. They invade El Jefe's jungle mercenary camp and rescue Rick, Carlotta and her father- who by now is returning to normal because the Frost Serum only works for two days. Furious, Ming blows up his glacier, causing a raging avalanche, which Rick subsides by employing a solar mirror to direct the sun's rays to melt the ice and divert it underground destroying the Ice Caves and all of Ming's blue orchid Frost Serum.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/yC7G2LznVRGoBGqR7wy3LExerRv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-30","episode_number":39,"episode_type":"standard","id":957257,"name":"The Rites of Zesnan","overview":"While trying to prove their individual prowess during an obstacle course competition, Rick, Jedda and L.J. get a bit too serious, endangering themselves individually and as a flying unit. When the youngsters again risk their safety during a dogfight with Ming's roboships, their parents take them to the Amazon to compete in the Rites of Zesnan, a tribal warrior contest to develop good warriors. Ming intercepts a Dynak X transmission and arrives in South America before our heroes. Posing as a god he preconditions the natives against the Defenders. While Rick, Jedda and L.J. are on their respective paths of the warrior course, the Merciless One traps the elder heroes in a grid pattern with deadly sensor beam canons. Meanwhile our young Defenders, after fighting off an attack from the local tribesmen, band together. Discovering from one native the presence of Ming, they rush back to the Terry and working again as a well-oiled unit, turn all four laser canons against one another, blowing them to pieces and sending Ming fleeing for his cowardly safety.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/kEtGrq8PNTA1xvfPRmGSZ5LbgOP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-31","episode_number":40,"episode_type":"standard","id":957258,"name":"Audie and Tweak","overview":"Ming's computer, Octon, has created the ultimate trap- Tycos, a machine designed by a machine, completely devoid of human flaws- which the evil leader will use to destroy the Defenders. Meanwhile Kshin tries to make friends with Audie, a boy genius whose only companion is his personally constructed robot, Tweak, made with living matter rather than silicon microchips. The elder Defenders are lured to a mountain bunker in Colorado by Tycos and the Phantom is captured. Tycos then shuts down all computer circuitry in the Western Hemisphere, except for Tweak, who is impervious to Tycos' efforts because of his non-silicon makeup. The young Defenders' plea for Audie's assistance falls on deaf ears; however, the fact that they come to his rescue when he is captured by Ming persuades him to help our heroes. Arriving at the mountain bunker, the youngsters discover that Mandrake and Flash are also Tycos' captives. Tweak enters first, sacrificing himself to dismantle the nerve gas which frees the three heroes and clears the way for the others to join in the effort. Audie creates a makeshift lighter to ignite Tycos' power supply and deactivate the evil computer, while the rest of the Defenders escape and prepare to blow the bunker to smithereens. Back at Monitor Audie is made an honorary Defender.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/g1GBDGaypckfzR6JI2KNqA9QqZm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-03","episode_number":41,"episode_type":"standard","id":957262,"name":"Return of the Skyband","overview":"When an ore transport ship in deep space is looted and notes are found announcing the RETURN OF THE SKY BAND, the Phantom is apprehensive. He recounts the story of his grandfather, who defeated an all-women pirate group in the 1930's whose \"Sky Band Leader\" was accidently killed. The Defenders fly out to rescue a mining ship in an asteroid belt, and the Phantom comes face to face with Kristina, the new leader of the Sky Band and the grandaughter of the woman killed in the 1930's. While the other Defenders engage the band members in combat, the Phantom chases Kristina through the asteroid-ship which is headquarters for the pirates. Unable to defeat the Phantom, Kristina plans to blow up the entire steroid and to kill both the superhero and herself. The Phantom delays the destruction and rescues her- thereby vindicating his grandfather- before turning Kristina over to the authorities.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/zNRrCmhkJhjMM2gnEfbpryBgbo1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-04","episode_number":42,"episode_type":"standard","id":957259,"name":"Dracula's Potion","overview":"The Defenders set out for Transylvania to investigate the disappearance of John Harker, a young archeologist doing re-search in the area. Upon arrival, they are invited to the castle of Vlad, a mysterious local who serves them dinner at midnight. When Vlad proposes a toast, everyone joins in, except the Phantom, who doesn't trust the shifty host. The next day all the Defenders, with the exception of the Phantom, turn into animals reflecting their personality characteristics- Vlad had spiked their dinner beverages with a magic potion. Dynak X launches an antidote to our heroes via a guided rocket. Kshin, now enjoying himself as a spider monkey, retrieves the antidote from the garden and, with the Phantom, frees the Defenders/animals from their cages and administers the antidote. Restored, the Defenders turn bright lights on Vlad, trans-forming him into John Harker! The young man had been possessed by the older vampire, Vlad.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/d0qx1qRJej1mWTyLOq0pPh6sJrA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-05","episode_number":43,"episode_type":"standard","id":958574,"name":"One of the Guys","overview":"Rick and L.J. accompany Kshin's class, which includes Marty, a wheelchair-bound boy, on a field trip to the Amazon where they encounter hostile natives. When Kshin and Marty are separated from the group, L.J. and Rick search for them, prompting the teacher to call in the Defenders. Stumbling upon a field of strange flowers cultivated by Ming's minions, Kshin is sprayed by a plant and rendered paralyzed from the waist down. At first he believes the situation hopeless, but Marty points out that they still have their brains. Captured by Ming, Marty uses his remote control device to summon his air-wheelchair and attempts a getaway from Ming. Meanwhile, the Phantom locates Rick and L.J. in the jungle. Ming, furious at being outwitted by two \"helpless\" boys, stalks Marty and Kshin. Just before he corners them, the Defenders arrive in Terry and foil the Merciless Ming's scheme to take over the world. Kshin's paralysis wears off and Marty is made an honorary Defender.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/pdUnnCOeir6cTW1uDM3o3aywZiV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-06","episode_number":44,"episode_type":"standard","id":957261,"name":"100 Proof Highway","overview":"At school, Jedda is invited to a party by Eric, who freely admits that, \"Everything looks better with a little vodka\". At first a bit hesitant, Jedda eventually agrees- she thinks Eric is cute and exciting. Rick and L.J. warn Jedda to steer clear of the trouble-maker, but she reminds them that they are neither her brothers nor her father. At the party that night, Erick is dead drunk, and his best friend Sam spikes Jedda's punch to \"loosen her up\". Confused and dizzy, Jedda asks Eric for a ride home. On the way he passes out at the wheel, with Jedda barely gaining control in time to avert disaster. Jedda gives a repentant Eric a second chance and attends a drag race with him. Disturbed by the drinking and dangerous driving, she once again demands that Eric, secretly drunk, take her home. This time they crash into a lake where Rick and L.J. must dive in for a risky rescue. The incident finally opens Eric's eyes to his alcoholism and he begins daily counseling, confident that although sobriety is a tough road, it's worth it.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/vQ4GUjxBt1mhAqYo1jSiNsPPzfj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-07","episode_number":45,"episode_type":"standard","id":957260,"name":"The Time Freezer","overview":"The Defenders attend an inter-galactic science convention in Monaco which coincides with a junior magician's competition that Kshin enters. Mandrake tells the boy the secret to opening locks through telekenetic activity, a trick which he uses to win the competition. When a big, roughhousing alien named Brutan steals a Time Freezer device from Yonda, a soft-spoken scientist at the fair, and uses it to rob the casino and local jewelry stores, Kshin is a suspect in the robberies. Kshin, with Zuffy, set out to clear his name, discovering from Yonda that Brutan plans to rob Fort Knox! They inform the Defenders and our heroes arrive on the scene to discover Brutan in the act. Using another version of his Time Freezer, Yonda captures the thief.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/7JlsuZFvMORWcFuf05hQijm2FLs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-10","episode_number":46,"episode_type":"standard","id":957264,"name":"The Prince Makes His Move (1)","overview":"Prince Kro-Tan reduces his father to nothing more than a microbe and seizes control of his empire, determined to conquer earth and destroy the Defenders himself....","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/3k70Rvw9d3Cegch8VCRggK5ZOwP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-11","episode_number":47,"episode_type":"standard","id":957263,"name":"The Prince Triumphant (2)","overview":"Pursuing Kro-Tan to a small kingdom in india, Flash and Rick are astonished to find that Kro-Tan is revered as a benevolant and trusting being, deemed worthy of ruling earth","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/jFGCP6djaOSThqQ6aAZXlh1aqsB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-12","episode_number":48,"episode_type":"standard","id":108718,"name":"The Prince Weds (3)","overview":"Continuing his power play, Kro-Tan's next step is to secretly attach miniature, mind-controled explosives to the Defenders and take Jedda captive. They arrive in Mongo, where he announces that they'll soon wed.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/hewLAriQH8q2qWHt9Obo4IUqAef.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-13","episode_number":49,"episode_type":"standard","id":957265,"name":"The Prince's Royal Hunt (4)","overview":"Locked in the prince's palace, Jedda uses her gift to communicate with animals as a means of escape before the wedding. In a subterranean area, Kshin discovers a race of small, peaceful creatures who are known for singing a special tune. The Defenders, via a tip from Jedda, discover the explosive devices and remove them.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/5IBAp3OKHmbQfkS5Rwf2oyoDk0h.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-14","episode_number":50,"episode_type":"standard","id":957269,"name":"The Prince Dethroned (5)","overview":"The witch who's aided Kro-Tan from the start manages to revive the original King of Mongo, and is revealed to be his Queen while having her youth restored. They lock Kro-Tan away and later do the same with the Defenders via a magical transportation. The King then disposes of his Queen. In the cell, Kro-Tan reveals that the King has returned, and the Phantom, after enhancing his strength, frees the Defenders.\n\nThe showdown with the King is interrupted by the arrival of the creatures Kshin discovered earlier, whose singing brings about his downfall once again. Ming is restored, and angrily takes his son off for punishment.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/1DWRToa3uFfakTVsvCPl00qMtZI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-17","episode_number":51,"episode_type":"standard","id":957268,"name":"Lothar's Homecoming","overview":"The Defenders accompany Lothar to his hometown in Jamaica, where the new children?s wing of a hospital will be dedicated in his honor. While there, Dr. Barbeau informs then that a new wonder drug is doing fantastic things for the children, but is difficult to obtain because a mythical sea serpent has been stealing it. A cult, led by Papa Duke, worships the serpent, and L.J.?s new friend, Felice, tells him that her brother has joined. While spying on a ceremony L.J. is captured and Felice escapes, but not before learning that Papa Duke plans to lead the youth of the town on a campaign to seize power from their elders. L.J. is forced to drink the breath of the serpent, which gives him super-human strength and hypnotizes him into following Papa Duke. L.J. kidnaps Kshin for a sacrifice while Rick and Jedds search the water submarine for the monster. The Defenders invade the cult and rally the town citizens to control the kids. L.J. becomes his old self when the drug wears off, Kshin is rescued and Papa Duke turns out to actually be Dr. Barbeau! Barbeau has been operating a mechanical sea serpent and stealing the drug.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/fLYUQHFTkhv6aE4KhPmuDmSkMJD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-18","episode_number":52,"episode_type":"standard","id":957266,"name":"Suspended Sabotage","overview":"While Rick and L.J. test out Rick's new invention- a wave interference device that scrambles any signal transmitted through the air- Rick is kidnapped by Ming, who then places an implant on L.J.'s head which will monitor his thought patterns. In exchange for Rick's safety, Ming orders L.J. to sabotage Flash's spaceship the night before our heroes plan to battle Ming's minions. During the fight our heroes are forced to retreat to Monitor. Ming then forces L.J. to divert the Defenders to South America while Ming invades New York City. L.J. recovers Rick's wave-interference device and rescues him. By the time the other heroes discover that L.J. is the saboteur, L.J. is able to explain himself and inform the Defenders of Ming's actual target. They arrive just in time to defeat the Merciless One.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/sKa0nq55lxO6vDpCRMPDj4eFWgJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-19","episode_number":53,"episode_type":"standard","id":957267,"name":"Call of the Eternals","overview":"Ming sends a look-alike Defender ship to provoke the Beacon of the Eternals- a computer operated ship searching for a long lost benevolent society- which thereby releases its three Guardian Robots to retaliate against our heroes. The Guardian Robots are the most powerful form of robot in the known universe. When Flash destroys one of them, its strength transfers to the other two, increasing the danger to both the Defenders and the Earth. With one of the two remaining robots hot on their tail, L.J., Kshin and Zuffy fly to New York to retrieve Mandrake and Lothar, while Flash, Rick and Jedda lock the third robot in a force (stasis) field surrounding Monitor. In New York Mandrake defeats the second robot through a brilliant illusion. However, this was Ming's plan. The final Guardian doubles in size, draining Monitor of its power source and transforming itself into an unbeatable machine. Rick conceives a plan which the Defenders put into action- a homing torpedo is outfitted with a mock signal from the Eternals and launched into a black hole, thereby tricking the Beacon into sending the final robot to investigate the signal. The final robot is destroyed and our heroes and the Earth are safe from Ming's grasp- temporarily.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/jw24UDSVMbU88aRFfdZh7Zf56Ko.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-20","episode_number":54,"episode_type":"standard","id":957271,"name":"The Return of Doctor Dark","overview":"Ming sets out to rule the entire universe by stealing the first of the three shards of the Orb of Konos from the Yucatan rain forest. At Monitor, Mandrake picks up telepathic signals from Mara, prompting Rick's journey to the Well of Essence, where he finds her in a cocoon. Dr. Dark locates the second shard with Ming, but in a confrontation between the two the evil ex-shadow lord drains the crystal's power, capturing it in his own body. Flash and Mandrake travel to a frozen planet to recover the third shard, only to discover that Ming has beat them to it. Back at Monitor Mara emerges from her cocoon, now a shadow lord. The Defenders rush to the Amber Keep on Rylos --the only place where the Orb of Konos can be reassembled- to discover that Dr. Dark has double crossed Ming and entered the Shadow Void to become the supreme ruler of the universe. Mara enters Dr. Dark's mind and prevents him from regaining control, thereby allowing the Orb to take back the power he stole from it, and destroying the evil warlock in the process. The Defenders escape the planet and Mara stays to become the new shadow master, ensuring that no one ever again splits the Orb of Konos.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/jKp5NScv7btfgLN4YlNtk8a41ka.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-21","episode_number":55,"episode_type":"standard","id":957272,"name":"The Deadliest Battle","overview":"Rick feels the pressure that results from his efforts to live up to Flash's reputation, and all aspects of Rick's life are suffering- school, personal and Defender work. A \"friend\" gives him a vial of drugs which Kshin sees Rick take in an effort to better perform when Ming, supercharged by an electrode machine, invades Monitor. Because Rick forgot to activate the defense system, Flash must lead Ming away from Monitor. Flash, along with the other senior Defenders, is trapped under a subway tunnel which Ming collapses on top of them. Back at Monitor Rick, under the influence of drugs and frustrated at his inability to perform, throws a temper tantrum. Ming again attacks Monitor and injures Kshin, forcing Rick to see the consequences of the drugs he has taken. To vindicate himself, Rick leads Ming through a Defender battle training exercise, driving the evil emperor mad with simulated attacks. As his \"supercharging\" wears off, Ming hallucinates as Rick, Jedda and L.J. drive him away from Monitor, sending him fleeing back to Ice Station Earth. Kshin calls Rick a hero, but Rick disagrees. Kshin is the hero for saying \"NO\" to drugs.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/oWiLsq2SsC5HX42bEeYoGOtFCtn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-24","episode_number":56,"episode_type":"standard","id":108719,"name":"The Necklace of Oros","overview":"As part of Jedda's coming of age, the Phantom takes her to the Skull Cave to choose a gift from among the family treasures. She is drawn to the mysterious Necklace of Oros, but an evil interdimensional being named Graviton needs the Necklace for his own purposes and will stop at nothing to get it.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/3MVf5En1InmUF7JEAiROfLddQik.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-25","episode_number":57,"episode_type":"standard","id":108720,"name":"Torn Space","overview":"The fabric of the universe is weak and stretching under the stress of Graviton's bridge, and the evil alien must have the Necklace of Oros if he is to survive. When the reptile/humanoid corners Jedda in Monitor, demanding the powerful necklace, Ming uses the opportunity to invade the Defenders' headquarters. An inter-dimensional rift materializes above Monitor, threatening to destroy the world. Ming stops his attack and makes a temporary peace agreement with the Defenders, so they may join together and defeat Graviton. With Dynak X hooked up to Octon, Rick reverses the polarity of Monitor's energy generator, creating an energy flow which sends Graviton back to his dimension, however he takes Jedda with him!!! Monitor's generator is depleted of its power, leaving our heroes defenseless against Ming --his plan all along! As Flash fights the invading robo-ships in the sky, Rick finally repairs the generator, which powers the defense lasers and defeats the attackers. Jedda is caught between two dimensions and Rick and L.J. work together to reach into the rift and pull her to safety.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/4Iu60wC72rnEZY8lrDTXsLkc75o.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-26","episode_number":58,"episode_type":"standard","id":957273,"name":"Ming Winter","overview":"Flash receives a distress call from Prince Barin, summoning him to Mongo to save the planet from Ming's evil son Kro-Tan. Back at Monitor our heroes uncover Ming's plan- Kro-Tan has turned the population of Mongo into slaves who mine the planet of Oceanite, which is turned into slabs and used by Ming to encircle the Earth, thereby blocking out all sunlight and plunging the planet into endless winter. When L.J.'s foolish heroics against attacking robo-ships backfire, the Defenders (sans Flash) counter-attack Ice Station Earth. As Flash and Barin start a slave uprising on Mongo, L.J. is seriously injured at Ming's headquarters, forcing our heroes to surrender. On Mongo Flash and Barin destroy the transporter-computer, breaking apart the oceanite wall and sending it crashing towards Kro-Tan's home planet, while the other Defenders escape from Ming's dungeon and rush back to Monitor to obtain much-needed medical help for L.J.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/mkyhqrTFArvrkQ3asQpYVEj5PIn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-26","episode_number":59,"episode_type":"standard","id":957274,"name":"The Golden Queen (1)","overview":"As Ming teams up with Queen Hadea of the Netherworld, elsewhere, Jedda suffers injury from an experiment intended to examine the Neckless of Oros. The Phantom takes her to a village to be healed, accompanied by Rick and LJ. With a crew of soldiers, Hadea suddenly holds the village hostage and captures the group of Defenders, seeking the neckless for herself.\n\nMeanwhile, Graviton continues to pressure Ming into retrieving the neckless for him. At the Netherworld, the others and a still-unconscious Jedda are brought before Hadea's feet and an offer is made: the Queen will heal Jedda if the Phantom agrees to be the new King, which he apparently does. Hadea keeps the Neckless of Oros and gives Jedda a fake before reviving her. Ming then enters unexpectedly with troops and abruptly seizes all of the Defenders except Phantom, who's been locked in the main chamber.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/utEqrHoKSzq9qbqkwpTVwaZp8Y3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-27","episode_number":60,"episode_type":"standard","id":957275,"name":"The Gravity of Ming (2)","overview":"Graviton discovers that the neckless Jedda's wearing is a fake, and Ming vows to punish Hadea. The Phantom escapes from Hadea's palace with the real neckless and heads for Ming's fortress, where he's captured just as the other Defenders show up to witness it. Hadea and her soldiers later arrive and win a brief struggle with Ming's robots, before having a face-to-face showdown with Ming himself. Hadea states she wants her neckless and King back. Graviton then enters and claims he wants the neckless as well. Suddenly, Ming says that they should all reach an accord.\n\nAs Graviton is given the fake neckless and becomes momentarily distracted when he discovers this again, Ming has his people, via some form of technology, suddenly transport both Graviton and Hadea to a banishment that's soon identified as the Kingdom of \"\"Oblivion,\"\" where they are to remain indefinitely. Back at the fortress, Flash makes an air raid and the captured Defenders are able to escape. Later, Jedda privately destroys","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/4614mkraBEKaMHmgc8x08wTPVOl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-01","episode_number":61,"episode_type":"standard","id":957276,"name":"Flesh and Blood","overview":"The Defenders must fight a fanatic cult calling themselves the \"\"Leauge of Flesh and Blood\"\" who are opposed to the existence of robots, beleivng that they are crippling human independence.\n\nFlash develops a romantic bond with the female member of the group, Kala.\n\nWhen a shocking revelation about the League is exposed, Ming the Merciless, hoping to imoprove his army's robotics, takes advantage of the League's shameful secret and strikes a bargain with them, and it involves kidnapping the young Defenders. Can Flash and the Defenders save them?","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/oI3Z0BMI2R55FUtntu71XE2dROO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-02","episode_number":62,"episode_type":"standard","id":958575,"name":"Drowning World","overview":"Ming constructs a dam near the sea of Japan. This diverts the warm currents of the Japenease oceans towards the antartic, causing the polar Ice caps to melt, which results in major worldwide flooding and certain disaster. The Defenders race to the Artic to prevent the glaicers from further collapsing, when they are attacked by Ming's Ice Robots and Garax.\n\nThe Defenders do battle with the Ice Robots and are able to fend them off long enough to escape back to the U.S.A, where they discover that Ming's Dam is the source of the worldwide flooding.\n\nLothar suggests they take out the dam with the untested X-26 missile, whilst Ming takes control of an iceberg and sends it hurtling in the direction of New York City...","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/oTY8RvFQIJ5WrlOw1xskMFWLrVA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-03","episode_number":63,"episode_type":"standard","id":957277,"name":"The Adoption of Kshin","overview":"During the court proceedings of Mandrake's adoption of Kshin, Hai, an old Asian man, enters with proof that he Is the boy's grandfather. Hai's return sparks Kshin's memory- he was three years old and with his parents on the search for the Lost City of Dreams when the Dragon Queen attacked and his parents were killed. Mandrake re-counts his introduction to Kshin in the streets of Singapore, and the discovery of one half of a mysterious map on the boy. Hai pulls out the other half, displaying the full directions to the Lost City of Dreams. Kshin, Hai, Mandrake and Lothar decide to set out on an expedition to locate the city. In Shanghai, the Dragon Queen gets wind of the expedition and follows our group on its quest- through jungles, dangers and traps- into the Lost City. Once inside, the evil Queen captures our group and throws them into a well. They escape and are aided by the rest of the Defenders in defeating the Dragon Queen. However, in the process old Hai is killed. His dying wish is fulfilled when Mandrake completes his adoption of Kshin.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/uzdUDHMIXdPY5DjCPW7XuEeUcJK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-04","episode_number":64,"episode_type":"standard","id":957279,"name":"Street Smarts","overview":"In battle simulation with Jedda, L.J. refuses to take part- he thinks it is only \"kid stuff\". Flash transports Morlag, a lizard-like leader of the rebellion on Mongo to Monitor, where Rick and the Phantom will deliver from Peru the Sun Medallions necessary for his people's fight to continue. Ming attacks the medallion base in Peru, destroying all the precious Firestones which focus their energy, then uses Octon to plant a virus program inside Dynak X so he can invade Monitor and capture Morlag. Meanwhile Flash and Kshin fly to an underwater volcano off the coast of Peru- the only other place to mine Firestones. When Ming attacks Monitor, L.J. thinks it is only another battle simulation, so he doesn't help when Jedda and Morlag are captured and taken away by Ming's forces. When he discovers the truth, L.J. feels horrible- prompting him to invade Ice Station Earth and conduct his own rescue. Flash and Kshin return with the Firestones, and L.J. learns a valuable lesson about adulthood.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/nPtLkcaMZRHPMuZErZVNggJrwor.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-05","episode_number":65,"episode_type":"finale","id":957278,"name":"Ming's Thunder Lizards","overview":"The Defenders fly to Alaska to inspect a dinosaur alert. While following dinosaur tracks, Rick and L.J. discover that a long-dormant volcano, with an artificial dome placed over it, is mysteriously heating up. The senior Defenders and Jedda spot Ming and Garax, while the Defenders are attacked by two Allosauruses! After a narrow escape in a mountain cave, the group discovers Ming's evil scheme- he's used an earth drill to thaw out tens of thousands of beasts buried in the frozen tundra, and is sending them out to destroy the cities of the Earth! The young Defenders figure out how to work Ming's drill, and use it to blow up the drilling station. The volcano explodes, ripping off the dome, and the arctic climate returns --obliterating the Valley of the Dinosaurs.","production_code":"","runtime":30,"season_number":1,"show_id":1794,"still_path":"/aydnfmXjGrxPxr7z2fl2tvZQmrL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":5079,"poster_path":"/ubO8ym93FbeTM0mgEQbd5zA9V3y.jpg","season_number":1,"vote_average":0}}}