{"adult":false,"backdrop_path":"/lvaaEYyFufdIAa56m53ZEEgPv81.jpg","created_by":[],"episode_run_time":[22],"first_air_date":"1989-09-09","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"","id":1824,"in_production":false,"languages":["en"],"last_air_date":"1991-10-26","last_episode_to_air":{"id":110311,"name":"The Fractured Fantasy of Captain N","overview":"Lana, Kevin, Mega Man, and Kid Icarus go to the medieval world of Final Fantasy to have lunch with the Prince (who is a good friend of Lana's). Kevin would rather see some game action instead. A couple of armored bandits rob a man's magic shop. The N Team members meet Matoya the witch and her talking broom. The evil Astos discovers Captain N is visiting the Prince. At the Prince's castle, Kevin is bored of hearing the Prince talk of all his adventures. Astos comes to Kevin when he's alone and offers to help him gain popularity. He places Kevin under a spell and has him give the Prince a sleeping potion. Kevin and Astos then warp away to Astos' castle. Lana, Mega Man, and Kid Icarus go to a shopkeeper and get passage through a witch's warp. They fall into quicksand, but climb out using Kid Icarus' rope arrow. They meet Matoya again, who turns Lana into stone. She turns Lana back to normal, however, when she realizes who she is. Matoya says the light crystal can break the spell on Kevin,","vote_average":0,"vote_count":0,"air_date":"1991-10-26","episode_number":7,"episode_type":"finale","production_code":"","runtime":22,"season_number":3,"show_id":1824,"still_path":null},"name":"Captain N: The Game Master","next_episode_to_air":null,"networks":[{"id":6,"logo_path":"/cm111bsDVlYaC1foL0itvEI4yLG.png","name":"NBC","origin_country":"US"}],"number_of_episodes":34,"number_of_seasons":3,"origin_country":["CA","US","JP"],"original_language":"en","original_name":"Captain N: The Game Master","overview":"A teenager from Earth, is brought to another universe known as Videoland to defeat the evil villainess, Mother Brain, as foretold in an Ancient Prophecy.","popularity":12.352,"poster_path":"/uvPvl5KAzHoWXSKPsTRP1sHpCo.jpg","production_companies":[{"id":20477,"logo_path":"/u0zjebYOFWdLcpR4hxE8o2zwHKQ.png","name":"DiC Entertainment","origin_country":"US"},{"id":12288,"logo_path":"/e4dQAqZD374H5EuM0W1ljEBWTKy.png","name":"Nintendo","origin_country":"JP"},{"id":2106,"logo_path":"/3ymjxYcUFEwCdMf2SoVyGd1aHef.png","name":"Saban Entertainment","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"1989-09-09","episode_count":13,"id":5176,"name":"Season 1","overview":"","poster_path":"/7CniDoHQKtm0rs65tF8xkUaVxin.jpg","season_number":1,"vote_average":0},{"air_date":"1990-09-08","episode_count":14,"id":5178,"name":"Season 2","overview":"","poster_path":"/cnz8AGDAztt0I8fdFaJ8UH98eQZ.jpg","season_number":2,"vote_average":0},{"air_date":"1991-09-14","episode_count":7,"id":5177,"name":"Season 3","overview":"","poster_path":"/y1quBovDjhDiWoq8lrBYONDEMMc.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.35,"vote_count":20,"season_data":{"1":{"_id":"5257161b19c2957114089bdd","air_date":"1989-09-09","episodes":[{"air_date":"1989-09-09","episode_number":1,"episode_type":"standard","id":110288,"name":"Kevin in Videoland","overview":"Mother Brain has been laying siege to the Palace of Power for seven years. When it seems like all is lost, the Ancient Prophecy declares a young warrior (Captain N: The Game Master), who would lead them to victory. The Ultimate Warp Zone opens in the room of Kevin Keene, who is playing video games when he's supposed to be cleaning his room. The warp zone pulls Kevin in through his TV and his dog, Duke, jumps in after him. Kevin arrives in Video Land, at the feet of several Nintendo game heroes (Mega Man, Kid Icarus and Simon Belmont). Princess Lana tries to give Kevin his mission, but he would prefer to leave. Meanwhile, Mother Brain sends two of her incompetent goons, Eggplant Wizard and King Hippo, to kidnap Lana. After failing to stop them, Kevin tries to get the N-Team to come up with a plan. Can they save Lana in time and stop Mother Brain's forces.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":"/xo4eCzEV11uRPRCVR0EXEuXLxb4.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257161c19c2957114089c1b","adult":false,"gender":2,"id":107029,"known_for_department":"Writing","name":"Jeffrey Scott","original_name":"Jeffrey Scott","popularity":1.388,"profile_path":null}],"guest_stars":[]},{"air_date":"1989-09-16","episode_number":2,"episode_type":"standard","id":110292,"name":"How's Bayou","overview":"Mother Brain finds out that Kevin stinks at The Adventures of Bayou Billy. She has Dr. Wily make a robo-cat for her that she can control. It is sent to the Palace of Power. Meanwhile, Kevin is giving Lana dance lessons. Kevin suggests they go to Earth to impress Kevin's friends. Lana says some other time. Duke chases the robo-cat through the warp to Bayouland. Kevin goes after him. King Hippo and Eggplant Wizard go to Bayouland to make sure Kevin doesn't leave. After a few hours, the robo-cat sneaks back into the Palace. Mega Man catches it and shows it to Lana. Lana decides to go to Bayouland and warn Kevin that something's up, but she has to agree to a candlelight dinner with Simon in order to get him to come along. After falling through some quicksand, Kevin lands in a cave. An alligator is there, but Bayou Billy prevents it from eating Kevin. Billy agrees to help Kevin look for Duke, but first he teaches Kevin how to survive in the bayou. Kevin learns to use a whip. Billy goes to r","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":"/agvTmUduuo88fa5AaD2KcTbwJRp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-09-23","episode_number":3,"episode_type":"standard","id":110293,"name":"The Most Dangerous Game Master","overview":"Dr. Wily creates an android of Mike Vincent, a bully that used to beat Kevin up on Earth, programmed from Kevin's memories. Kevin and the android become friends, and \"\"Mike\"\" is destroyed saving Kevin's life.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":"/aRqahpL5owFQDPptlYiQvXBfA0B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-09-30","episode_number":4,"episode_type":"standard","id":110294,"name":"Videolympics","overview":"Mother Brain and her minions challenge the N Team to an athletic event. Whoever wins gets the Throne to Videoland. But Mother Brain's real intention is to steal the Three Sacred Treasures from Mount Icarus. She uses them to send the N Team into the Warp Zone to Oblivion.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-10-07","episode_number":5,"episode_type":"standard","id":110290,"name":"Mega Trouble For Megaland","overview":"The N Team travels through a Warp Zone and ends up a week in the future. Mother Brain has already begun to conquer most of Videoland. The N Team goes to Dr. Wily's base to destroy the Three Sacred Treasures.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257161c19c2957114089c1b","adult":false,"gender":2,"id":107029,"known_for_department":"Writing","name":"Jeffrey Scott","original_name":"Jeffrey Scott","popularity":1.388,"profile_path":null}],"guest_stars":[]},{"air_date":"1989-10-14","episode_number":6,"episode_type":"standard","id":110295,"name":"Wishful Thinking","overview":"Kid Icarus is upset because he's too short. When Duke finds a magic lamp with a genie inside, Kid Icarus wishes himself big. He grows into a giant!!! When King Hippo and Eggplant Wizard steal the lamp, they make Mother Brain their servant! The N-Team, sans Kid Icarus, goes to Metroid to retrieve the lamp. When Kid Icarus comes to their rescue, he's shrunken. He uses his extremely small size to get into the lamp and wish everything back to normal. He then sets the genie free from the lamp, and the two of them become very good friends.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-10-21","episode_number":7,"episode_type":"standard","id":110297,"name":"Three Men and a Dragon","overview":"Dragon Lord, with the help of Mother Brain, tries to turn all the dragons on Dragon's Den evil. The N Team arrives and rescues Puff, the last good baby dragon. Using magic lightning, the spell on the dragons is removed, and Dragon's Den is saved.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-10-28","episode_number":8,"episode_type":"standard","id":110298,"name":"Mr. & Mrs. Mother Brain","overview":"Lana invites Mother Brain over to sign a peace treaty. Kevin and Mega Man are pretty eager about this, but Kid Icarus isn't taking any chances. Simon gets ahold of Kid Icarus's love-at-first-sight arrow and decides to use it on Lana. But when Mother Brain arrives, Simon mis-aims, and it winds up hitting him. He takes a look at Mother Brain and falls in love with her. Mother Brain, confused, attacks and her team imprisons Simon. This love spell will be permanent unless they shoot Simon with an antidote soon. Therefore, Kid Icarus and Mega Man have to go to Mt. Icarus to get it. So while they're doing that, Kevin and Lana head for CastleVania to find Simon. Meanwhile, over at Metroid, Dr. Wily suggests that Mother Brain have Simon prove his love to her by helping her capture CastleVania. Kevin and Lana arrive at CastleVania just in time to see that it's being attacked, and have an encounter with, making his Captain N debut, Count Dracula! Simon appears and whips Drac good, but then drops","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-11-04","episode_number":9,"episode_type":"standard","id":110299,"name":"Nightmare on Mother Brain's Street","overview":"In her secret lair within the frightful world of Metroid, Mother Brain asks a question to her all-knowing Computer Mind Mirror...who's the most fairest of them all? The Computer Mind Mirror says that Princess Lana is the most beautiful of them all and she has Eggplant Wizard to make a poison apple that'll make Princess Lana fall asleep. When this works, Princess Lana is warped to Excalibur, the land of Wizards and Warriors. Kevin, Simon, and Duke head there to rescue her. They're told that they can rescue Lana if they fall asleep, so they each take a bite of the apple. Meanwhile, back at the palace, Kid Icarus and Mega Man are also given apples and are warped to Excalibur. In their dreams, which are actually their nightmares come true, Kevin suggests that they fall asleep to wake up in their own world. It works. The N Team goes back to the Palace and they put Mother Brain and her servents to sleep.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-11-11","episode_number":10,"episode_type":"standard","id":110300,"name":"Simon the Ape-Man","overview":"Simon loses his memory while ironboarding. The N-Team tries to help him get his memory back. Mother Brain, meanwhile, gets King Hippo and Eggplant Wizard to brainwash him into thinking he's an N-Team hunter, Then he think he's Donkey Kong Jr. when he loses his memory again when Donkey Kong finds him. Finally, after being hit on the head with a coconut, Simon regains his memory.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-11-18","episode_number":11,"episode_type":"standard","id":110301,"name":"In Search of the King","overview":"Kevin, Lana, Simon, and Duke go to the Mirror World to rescue Lana's father, King Charles. Meanwhile, their opposites travel to their world. Finally, Kid Icarus and Mega Man send the opposites (except Lana's opposite) through the Mirror Warp. Kevin, Simon, Duke, and King Charles go back to their world. King Charles takes Lana's opposite back to the Mirror Warp and Lana goes back to her world safely. With the opposites and King Charles in the Mirror World, the Mirror Warp is destroyed leaving King Charles is trapped in the Mirror World.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-11-25","episode_number":12,"episode_type":"standard","id":110302,"name":"Metroid Sweet Metroid","overview":"Mother Brain tricks the N-Team into thinking she's been defeated. She then opens up a warp zone, with Kevin's neighborhood shown on the other side. Thinking it's the Ultimate Warp Zone, Kevin goes through. Mother Brain captures the remaining N-Team members and sentences them to banishment in the Black Hole Warp Zone. Kevin, who's really on Metroid, finally gets back to the Palace and rescues the N-Team.","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-12-02","episode_number":13,"episode_type":"finale","id":110303,"name":"Happy Birthday, Mega Man","overview":"It's Mega Man's birthday, but he's upset because he's not human. Then he finds out about the Warp of Life. He must pass the Three Challenges. He, the N Team, and Dr. Light set off, accompanied by another Dr. Light creation, Mega Girl. Mega Man passes the Three Challenges, after numerous instances of the N Team insisting that they turn back. Mega Man goes through the Warp of Life and becomes human. He then finds out that the N Team was playing along with the Warp of Life all along. They wanted to see if Mega Man really had what it takes to pass the Three Challenges. Mega Man also finds out that Roll already passed the Three Challenges, and she's alive also. Before they leave, the Warp of Life wishes Mega Man a Happy Birthday!","production_code":"","runtime":22,"season_number":1,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":5176,"poster_path":"/7CniDoHQKtm0rs65tF8xkUaVxin.jpg","season_number":1,"vote_average":0},"2":{"_id":"5257161b19c2957114089bfd","air_date":"1990-09-08","episodes":[{"air_date":"1990-09-08","episode_number":1,"episode_type":"standard","id":110312,"name":"Gameboy","overview":"King Charles is about to come home through a warp zone that only opens every 1000 video years. But he decides to send a supercomputer called Game Boy in his place. Game Boy turns out to be nothing but trouble for the N-Team. Mother Brain gets Game Boy, and Dr. Wily turns him into Game Brain. When the N Team comes to Metroid to rescue Game Boy, Game Brain sends monsters after them. Duke comes to the rescue, pulling the cords out of Game Boy with his teeth! The monsters disappear. Back at the Palace, the gang officially welcomes Game Boy to the N-Team.","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-09-22","episode_number":2,"episode_type":"standard","id":110313,"name":"Queen of the Apes","overview":"The N-Team is invited to Kongoland by Prince Plenty. Dr. Wily invents a brain swapper so Mother Brain can get a body. She chooses Princess Lana as the donor. However, when they go to Kongoland, Donkey Kong kidnaps Mother Brain and Game Boy. The brain swapper is accidentally attached and activated. Donkey Kong gets Game Boy's body, Game Boy gets Mother Brain's body, and Mother Brain get Donkey Kong's body. Simon and Kevin go to find \"\"Gape Boy\"\", Kid Icarus and Mega Man search for Game Boy's \"\"brain-in-a-bottle\"\", and Lana decides to give \"\"Mother Kong\"\" a makeover. Donkey Kong's family elect Simon their new leader! Everyone's brain is swapped back to the right place, and the Kong family carries Simon off.","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-09-29","episode_number":3,"episode_type":"standard","id":110314,"name":"Quest for the Potion of Power","overview":"Across the vastness of Videoland, on the magical world of Hyrule, years have past since the fall of the evil wizard Gannon, and peace reigned throughout the land. Until one dark day, rumor spread that the evil Gannon would rise again. That becomes true. Kevin and the N Team head to Hyrule to meet Kevin's favorite game hero Link and Princess Zelda. Mother Brain gives the Potion of Power to Gannon that restores the evil wizard to his rightful form. Mother Brain tries to get Gannon to serve her, but he refuses and sends Mother Brain, Eggplant Wizard, and King Hippo through the ceiling. Can the N Team and Link stop Gannon and his minions?","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-10-13","episode_number":4,"episode_type":"standard","id":110315,"name":"The Trouble With Tetris","overview":"The N-Team is playing a shooting game, while Mother Brain, King Hippo, and Eggplant Wizard watch on Metroid. The game ends, and they're about to go back to the Palace, when the Warp Wagon is pulled down to the world of Tetris by a powerful force. Mother Brain sends Hippo and Eggy to Tetris to find the source of that power, so she can get it for herself. It turns out that on Tetris, everything is square- and cubed-shaped. The N-Team is greeted by Mayor Squaresly, who declares today \"\"Her Royal Roundness Day\"\". The people of Tetris love holidays! The mayor takes the N-Team to CUBIES, \"\"home of the best square meal in town\"\", where they meet Lyle, Lana's clumsy older brother. The two siblings hadn't seen each other for two years. Lyle's been on Tetris all this time, and doesn't even know that his father is missing. He's a Keeper of the Sacred Square (the powerful force that pulled down the Warp Wagon). According to legend, the Square is so powerful that it built the entire world of Tetris. Ly","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-10-20","episode_number":5,"episode_type":"standard","id":110316,"name":"The Big Game","overview":"Dr. Wily discovers competition energy. He creates a power vacuum to collect it. After running a test, he plans to use it to power his Warp Zone Shifter and send the N Team into the Earthquake Warp Zone. At the Palace of Power, Kevin is homesick. Mega Man builds a skateboard for Kevin to cheer him up. Dr. Wily lures the N Team to California Games by letting Kevin think he won a contest. Dr. Wily and his robots go to California Games and set up base in a hot dog stand. As the N Team has fun competing in the games, Dr. Wily collects competition energy to power his Warp Zone Shifter. However, Dr. Wily is impatient and sends his robots to increase the competition. The N Team discovers Wily's presence on California Games, and the games lose their fun. In order to collect more competition energy, Dr. Wily puts his Warp Zone Shifter through a test run. In Northridge, California, Rick Walker, a football player named Romeo, yet another football player, and a cheerleader named Stacey, along with","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-11-10","episode_number":6,"episode_type":"standard","id":110318,"name":"The Lost City of Kongoland","overview":"The Lost City of Kongoland rises after a thousand years. Along with it comes a treasure belonging to Konga, the leader of the Ancient Konkas, who had a magical power over plants. Meanwhile, at the Palace of Power, Lana fears she's not forceful enough to be Ruler of VideoLand. Prince Plenty (from \"\"Queen of the Apes\"\") informs the N-Team of the treasure, and Lana vows to destroy it. Mother Brain also learns of the treasure and plans to steal it after the N-Team finds it. The treasure turns out to be Konga's hat, and when it falls on Lana's head, the Princess becomes possessed by Konga's spirit. She (he?) kidnaps Simon. Mother Brain tells the Eggplant Wizard to volunteer to join Konga in conquering Kongoland, so Mother Brain can get the hat later on. Donkey Kong helps the N-Team fight Konga's forces. The N-Team is about to be destroyed, when Lana, with encouragement from Kevin, takes off the hat. Donkey Kong destroys it, and the Lost City of Kongoland sinks again, this time forever. Lana d","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-11-17","episode_number":7,"episode_type":"standard","id":110319,"name":"Once Upon a Time Machine","overview":"While on a picnic on Hyrule, Kevin's Power Pad and Zapper are stolen. Kevin and Link follow the thieves through a warp zone. They end up going through time with a cat named Pero. He's trying to get back to his own time. The thieves are using Kevin's weapons to power their time machine. Kevin eventually gets them back. He and Link return to Hyrule, leaving Pero to get back to his own time on his own.","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-11-24","episode_number":8,"episode_type":"standard","id":110320,"name":"The Feud of Faxanadu","overview":"While playing football, the N Team warps to Faxanadu, which is the home of two races: the Elves and the Dwarves. While trying to get back home, Kevin and Simon decide it would be more fun to see who gets back home faster, so they divide into teams. Each team is led to believe that the Elves or the Dwarves stole a powerful crystal from the other race. Only Lana has enough sense to know that the others are behaving like little kids. Then, a being known as The Evil One gets the crystal. With it, he plans to destroy Faxanadu. Only when everyone works together are they able to overcome the power of the crystal. The crystal is destroyed, and The Evil One vows to return.","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-12-01","episode_number":9,"episode_type":"standard","id":110321,"name":"Having a Ball","overview":"King Hippo and Eggplant Wizard go through a warp zone and eventually, after an unliked stop and realized that they were on the warp to oblivion, arrive in Hyrule. It is midnight in Hyrule and, in the throne room, the two idiots arrive. King Hippo falls onto the ground and Eggplant Wizard onto him. King Hippo tries to find the paper with the spell to release the Triforce but is unable to. He tries to recite it from memory, but is unable to. He triggers the Triforce's defense systems and they run off and back into the warp. Link runs in, ready to do battle, right after Zelda turns off the alarm. She complains of the alarm's ‘malfunctioning' and tells Link to organize the sentries to guard the Triforce after turning off the alrm. Mother Brain kicks out King Hippo and Eggplant Wizard. The two idiots pack up their items and ponder over what they'll do. Eggplant Wizard suggests joining the N-Team. Returning from a trip to Kongoland, Simon reminices about the good old days and the parties and","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-12-08","episode_number":10,"episode_type":"standard","id":110322,"name":"The Trojan Dragon","overview":"Dragons have stolen the Palace's Sun Stone to hatch the legendary Golden Dragon, which will become a mighty warrior. While Gameboy keeps the Palace's systems running, the rest of the N Team head to Dragon's Den. In order to sneak in, they construct a giant wooden dragon with the help of Link and Princess Zelda. When Dragon Lord discovers them, he places the Cursed Necklace on Simon which will draw the Golden Dragon to him when it hatches. Lana uses magic fairy water to remove it and Simon places the Cursed Necklace on Dragon Lord. Dragon Lord removes the necklace with the fairy water and throws it at the Golden Dragon, destroying it. Simon catches the Sun Stone and the N Team take it back to the Palace.","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-12-15","episode_number":11,"episode_type":"standard","id":110323,"name":"I Wish I Was a Wombatman","overview":"Kid Icarus is a big fan of Wombatman, VideoLand's version of Batman. When they see the TV studio under attack by a giant robot, the N Team warps to the TV studio's video world and defeats the robot. One woman, who looks like a squid, develops a crush on Simon, but he feels very uneasy around her! When Kid Icarus meets Wombatman and gets his autograph, he's crushed to learn that Wombatman doesn't do his own stunts anymore. Wombatman sends the N Team on a tour of the studio. It turns out Mother Brain is behind the attack on the studio. She kidnapped Nikki, Wombatman's co-star and girlfriend, and used her to get Wombatman to lure the N-Team here. After he does this, she refuses to let Nikki go. She sends King Hippo and Eggplant Wizard to sabotage the studio tour and kill the N Team. The N Team escapes, however, so Mother Brain decides that the best way to defeat the N Team is on the show. During the filming of the episode, in which the N Team guest-stars as themselves, King Hippo and Eggp","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-12-22","episode_number":12,"episode_type":"standard","id":110324,"name":"The Invasion of the Paper Pedalers","overview":"Dr. Wily goes to Kongoland to extract sap from trees. He uses it to make special hypnotic ink. Whoever read anything printed with the ink would be turned into a zombie whenever the words \"\"MOTHER BRAIN IS YOUR MASTER\"\" appeared in the text, and would have to obey Mother Brain's every command. Dr. Wily began taking over everyone on News World. A week later, the Paperboy, Julio, summons the N-Team to investigate. At first they're skeptical, but when Julio's mom gets turned into a zombie and tries to kill Kevin, they believe the story. Mother Brain finds out the hypnotic ink will also let her control machines. The N-Team finds King Hippo and the Eggplant Wizard at the Daily Sun. Kid Icarus shoots them with love arrows, and the two servants spill the beans on Mother Brain's plan: to take over VideoLand using the ink. Eggy also tells them the antidote: the sap of another tree on Kongoland. It turns out Julio hasn't turned into a zombie because he can't read. He's been skipping school to earn","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-12-29","episode_number":13,"episode_type":"standard","id":110325,"name":"Germ Wars","overview":"Kevin returns from Kongoland with a strange rock. Simon starts twirling it like a basketball, and it gives off a bright flash. Kevin ends up with blue strips on his face, and he swallowed his gum. Dr. Light is called to the Palace, and he says that Kevin has been bitten by a video virus. Kevin falls asleep, and inside Kevin's body, his life force does battle with Viroid. Because Kevin isn't from VideoLand, his body doesn't know how to fight off the video virus. Lana sends out a message to all of VideoLand begging people to contact her if they can help. Lana decides, from a statement made by Simon, to fight the virus from inside Kevin's body. Dr. Light gives Lana a map of Kevin's body and a videocom to contact him. Kid Icarus uses his special shrinking arrow to make Lana, Simon, Mega Man, and himself small enough. They enter Kevin's body through his right ear, but miss the shortest route to his heart, which is where Viroid has established his stronghold. They end up in the stomach, and","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-01-05","episode_number":14,"episode_type":"finale","id":110326,"name":"When Mother Brain Rules","overview":"A retrospective look on the time since Kevin Keene arrived in Videoland. Oddly, there were two versions...one with voices...and one (the first shown version) without. The entire tone of the episode makes it one of the most confusing episodes as it doesn't seem entirely restrospective in how it's done...thus making many wonder...with as many battles as we've won, did we lose the war?","production_code":"","runtime":22,"season_number":2,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":5178,"poster_path":"/cnz8AGDAztt0I8fdFaJ8UH98eQZ.jpg","season_number":2,"vote_average":0},"3":{"_id":"5257161b19c2957114089bed","air_date":"1991-09-14","episodes":[{"air_date":"1991-09-14","episode_number":1,"episode_type":"standard","id":110304,"name":"Misadventures In Robin Hood Woods","overview":"After a successful mission on Dragon's Den, Kevin, Kid Icarus, and Duke stop off on the medieval world of Nottingham to power-up the Warp Wagon. The three of them find the evil Sheriff of Nottingham and Prince John robbing the Ye-Olde Weapon Shoppe and fight them. They meet Robin Hood, who helps them out. Kevin, Kid Icarus, and Duke are introduced to the Merry Men, who make fun of Kid Icarus due to his size and wings. Kid Icarus decides to prove he's a better archer than them by entering the Tournament of the Golden Arrow that afternoon. Robin also decides to enter to win the golden arrow for himself. The Sheriff and Prince John plot to capture Robin Hood at the tournament, deciding that whoever wins must be Robin. Maid Marian overhears their plot, but she can't do anything about it. At the tournament, Robin, Kevin, and Duke are in disguise. Prince John dresses up as Maid Marian, since the real one won't cooperate. Kevin tries to win a gift for Lana. Kid Icarus does really good in the","production_code":"","runtime":22,"season_number":3,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-09-21","episode_number":2,"episode_type":"standard","id":110306,"name":"Pursuit of the Magic Hoop","overview":"Hoop-De-Doo-Dah-Day, the one day of the year when everyone has a shot at their dearest wish, is celebrated on Hoopland. Kevin, Lana, and Duke arrive on Hoopland to try and wish King Charles home. Kevin, Lana, and Duke meet Larry Bird. Hoopless, a young boy who is the inventor of everything on Hoopland, is too short to make a shot at getting a wish, so he has his robot, Rebound, make the shot for him. Rebound gets to make a wish, but, instead of wishing Hoopless tall, he accidentally wishes himself the tallest. He hits his head, which messes up his programming, and becomes evil. Larry, Kevin, Lana, Hoopless, and Duke climb Hoop Mountain, passing a series of challenges by Clockman, Guardian of the Magic Hoop, along the way. Lana wins a wish. However, instead of wishing her father back home, she wishes Rebound back to normal, and everybody's happy.","production_code":"","runtime":22,"season_number":3,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-09-28","episode_number":3,"episode_type":"standard","id":110307,"name":"Return to Castlevania","overview":"Kevin and Simon go to CastleVania to attend The Simon Belmont Awards, where Simon is going to be honored for being a hero like his great-grandfather, Trevor Belmont. The Poltergeist King appears on stage, where Simon expects to be presented with the weapons his ancestor made famous. Instead, the King calls Trevor a coward, and accuses him of stealing the credit after the King defeated Dracula. He curses the Belmont family with a thousand years of shame. He then disappears, taking the weapons with him. The audience begins booing Simon and throwing food at him. Simon escapes by running into a warp. It turns out that the Count was impersonating the King. With Simon no longer considered a hero, the Count could easily take over CastleVania. Igor, a small winged creature sitting on top of the King's staff, warns the Count that the real Poltergeist King was escaping from the tower when he was being held captive. He was climbing down a bedsheet. The Count flies up and uses the King's magic sta","production_code":"","runtime":22,"season_number":3,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-05","episode_number":4,"episode_type":"standard","id":110308,"name":"Totally Tetrisized","overview":"","production_code":"","runtime":22,"season_number":3,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-12","episode_number":5,"episode_type":"standard","id":110309,"name":"A Tale of Two Dogs","overview":"Dr. Wily has turned over a new leaf and is helping Dr. Light build a peace robot named Gamma?! It may sound bizzare, but really, Wily is faking this niceness! Mega Man, Kevin, Rush, and Duke are sent to eight other planets to collect eight energy tanks to power Gamma. All the while, Mega Man and Kevin argue about whose dog is awesomer. After getting all the tanks, they go to California Games for some rest and relaxation. But Dr. Wily warps the dogs to Skull Castle as bait for Kevin and Mega Man. Kevin and Mega Man go to Skull Castle to find their dogs. Leaving Doc Man (a robot from Mega Man 3 who can take on the powers of the Robot Masters from Mega Man 2) in charge of Skull Castle, Wily goes to Dr. Light's laboratory, reprograms Gamma, and steals it so he can take over VideoLand. Mega Man, Kevin, and their dogs escape from Skull Castle, destroying Doc Man in the process. Dr. Light warps to outside Skull Castle to inform them of what Dr. Wily has done. Wily arrives, controlling Gamma.","production_code":"","runtime":22,"season_number":3,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-19","episode_number":6,"episode_type":"standard","id":110310,"name":"Battle of the Baseball Know-It-Alls","overview":"The N-Team is on Baseball World, playing a game against Bo Jackson and the VideoLand All-Stars. Suddenly, Mother Brain opens a warp to the cellar of Baseball World, and all but Lana and Game Boy are sent through. In the cellar, the good guys can't agree which way to go to get out. They split up and go two different ways. At the Palace of Power, Mother Brain takes control and assigns Princess Lana to cleaning duty. Lana and Game Boy manage to get into the Communications room, and Lana contacts Kevin and the others in the cellar. She opens up a warp for them. After being in a confrontation with the Baseball Card King and evil baseball equipment, Kevin and the rest of the group go through a warp to the Palace. At the Palace, King Hippo and Eggplant Wizard present Mother Brain with a huge cake and a crown. A warp opens in the ceiling, and the good guys land on the cake. The cake moves to Mother Brain, King Hippo, and Eggplant Wizard and forces them up through the warp to the cellar of Base","production_code":"","runtime":22,"season_number":3,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-26","episode_number":7,"episode_type":"finale","id":110311,"name":"The Fractured Fantasy of Captain N","overview":"Lana, Kevin, Mega Man, and Kid Icarus go to the medieval world of Final Fantasy to have lunch with the Prince (who is a good friend of Lana's). Kevin would rather see some game action instead. A couple of armored bandits rob a man's magic shop. The N Team members meet Matoya the witch and her talking broom. The evil Astos discovers Captain N is visiting the Prince. At the Prince's castle, Kevin is bored of hearing the Prince talk of all his adventures. Astos comes to Kevin when he's alone and offers to help him gain popularity. He places Kevin under a spell and has him give the Prince a sleeping potion. Kevin and Astos then warp away to Astos' castle. Lana, Mega Man, and Kid Icarus go to a shopkeeper and get passage through a witch's warp. They fall into quicksand, but climb out using Kid Icarus' rope arrow. They meet Matoya again, who turns Lana into stone. She turns Lana back to normal, however, when she realizes who she is. Matoya says the light crystal can break the spell on Kevin,","production_code":"","runtime":22,"season_number":3,"show_id":1824,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":5177,"poster_path":"/y1quBovDjhDiWoq8lrBYONDEMMc.jpg","season_number":3,"vote_average":0}}}