{"adult":false,"backdrop_path":null,"created_by":[{"id":212161,"credit_id":"548e7842925141031b00231b","name":"Les Stroud","gender":2,"profile_path":"/j533gxcMWaL7YFcBo09zgvAC2CF.jpg"}],"episode_run_time":[30],"first_air_date":"2009-04-07","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.ytv.com/programming/shows/survive_this/","id":18487,"in_production":false,"languages":["en"],"last_air_date":"2010-07-12","last_episode_to_air":{"id":565236,"name":"Search and Rescue Finale Season 2","overview":"Part two of a two-part finale. Each teen is led to a cache of survival gear. They are told to turn their shelter into a raft, and paddle to safety. Each surviving teen is reunited with their family and the teens who left the show. Les Stroud declares one teen the \"Ultimate Survivor.\"","vote_average":0,"vote_count":0,"air_date":"2010-07-12","episode_number":13,"episode_type":"finale","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null},"name":"Survive This","next_episode_to_air":null,"networks":[{"id":46,"logo_path":"/1vBZP6weH5iSbSVHkJWi3pDpIpJ.png","name":"YTV","origin_country":"CA"}],"number_of_episodes":26,"number_of_seasons":2,"origin_country":["CA"],"original_language":"en","original_name":"Survive This","overview":"Eight teenagers with limited survival skills training are taken into a forest and confronted with a number of survival challenges to test their skills and perseverance.","popularity":2.983,"poster_path":null,"production_companies":[],"production_countries":[],"seasons":[{"air_date":"2009-04-07","episode_count":13,"id":29107,"name":"! (2009) season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2010-04-19","episode_count":13,"id":29108,"name":"! (2009) season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Reality","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"52585695760ee346610b13af","air_date":"2009-04-07","episodes":[{"air_date":"2009-04-07","episode_number":1,"episode_type":"standard","id":565213,"name":"Impact","overview":"Eight teens are sent out into the wilderness from Survival School to face their first challenge: To survive a bus crash in an isolated forest. They must now work together to salvage what they can from the wrecked bus, build shelters, make a fire, and boil water to drink.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-14","episode_number":2,"episode_type":"standard","id":565214,"name":"Shelter","overview":"As punishment for placing their food in an unsafe location, Les Stroud takes away some of the group's rations. The girls and boys compete to see who can create the better shelter. Catarina suffers from heat stroke, and Zac catches frogs for dinner.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-21","episode_number":3,"episode_type":"standard","id":565215,"name":"Hunger","overview":"The group splits up into pairs to find food: Zac and Catarina hunt for frogs, Kareem and Holden fish, Adam and Jen search for edible plants, and Becca and Becky hunt for edible insects. Les takes away the group's fire-starting materials, and the fire must be kept going despite rain. Laziness sets in. Adam catches and kills a pheasant, but accidentally cuts his leg with a knife and suffers a deep cut.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-28","episode_number":4,"episode_type":"standard","id":565216,"name":"Navigation","overview":"Les Stroud rousts the group from their beds at night, and sends them on a night hike armed with nothing but a GPS device and a set of geographical coordinates. Becky leaves the show.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-05","episode_number":5,"episode_type":"standard","id":565217,"name":"River","overview":"Les sends the group down a river on a whitewater rafting challenge, but the inflatable boat is punctured on a sharp stick and sinks. Les meets the group and orders them to the other side of the river without food or sleeping gear. They must avoid injury, make a fire, prevent hypothermia, and stay out of the poison ivy.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-12","episode_number":6,"episode_type":"standard","id":565218,"name":"Deep Woods, pt. I","overview":"The group is split into two teams—Team 1 (those with strong survival skills: Adam, Jen, and Zac) and Team 2 (those with weak survival skills: Becca, Catarina, Holden, and Kareem)—and each is left in the deep woods. They must find food, shelter, and water, and make a fire. Adam kills a porcupine, Jen makes fire, and Team 1 builds a shelter and locates water. The other team fails in everything, and gives up. Kareem tries to build a shelter, but falls ill and a paramedic assists him. Kareem's illness worsens as the episode ends.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-19","episode_number":7,"episode_type":"standard","id":565219,"name":"Deep Woods, pt. II","overview":"Kareem, suffering from exhaustion, is declared fit to continue by the parademic. The next morning, Team 1 makes a breakfast of flour and water cooked over a fire. Team 2 goes hungry. The two teams are told to hike east, forcing them to navigate around lakes and across a swamp—navigating by using the sun and a watch. Team 1 heads east but goes the long way around a lake, that a five-hour hike becomes a 10-hour hike. They meet Les Stroud at their destination. Team 2 becomes lost, but finds sphagnum moss and squeezes water from it. The Team 2 members quarrel with one another, and by nightfall end up almost where they started from. Becca, Catarina, and Holden leave the show.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-26","episode_number":8,"episode_type":"standard","id":565220,"name":"Swamp","overview":"Adam, Jen, Kareem, and Zac canoe across a swamp to an abandoned beaver lodge. Catarina returns to the show. Forced to abandon their canoes and with limited supplies (including plastic garbage bags, a magnesium fire-starter, and a teakettle), the five must swim and walk across the swamp to a marshy area, build a shelter on the water, find food and water, and spend the night on the water. Catarina has an emotional breakdown after crossing the swamp; Kareem and Zac try to calm her while Adam and Jen build the sleeping platform on the water. The five walk and swim across the swamp to reach dry land again. Catarina leaves the show once more.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-02","episode_number":9,"episode_type":"standard","id":565221,"name":"Rock Face","overview":"Les Stroud tells Jen she must pretend to have one broken leg, and Adam must pretend to have two broken legs. Adam and Jen are separated, forcing Zac to care for Jen and Kareem to take care for Adam. The team must stay one night in bear territory. Jen and Zac must build a signal fire which can be seen from the air, and light it in time for a rescue helicopter to see it. Jen and Zac become friends, while Kareem struggles to provide food and water for Adam.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-09","episode_number":10,"episode_type":"standard","id":565222,"name":"Mountain","overview":"Adam, Jen, Kareem, and Zac must scale a vertical cliff face using climbing gear. The team are given one match, some pemmican, and a harmonica and told to build a fire, find water, and make a shelter. Adam and Jen collect firewood and complain that Kareem and Zac aren't pulling their weight. Kareem and Zac have difficult finding water, and Zac successfully lights the fire. The next morning, all four rappell back down the cliff. Les is critical of the failure to build a shelter, and how Adam and Jen turned survival into a competition.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-16","episode_number":11,"episode_type":"standard","id":565223,"name":"Island","overview":"Adam, Jen, Kareem, and Zac are given few supplies and forced to swim to an isolated island in the middle of Lake Huron. They experience difficulty building a fire on the windswept island, worry about when Les might return, and build a lean-to the following day. Adam spots an abandoned canoe on a nearby island, swims to retrieve it, and finds it is too rotten to use. Jen criticizes the building of the shelter. Zac spots a passing ship, but they are unable to catch its attention. The teens catch some crayfish, and Jen criticizes Kareem and Zac's fishing abilities. Morale drops, Adam and Zac build a signal fire, Kareem starts to fall ill, and Jen criticizes how much Kareem is sleeping. The signal fire draws the attention of a boat, which Les is piloting. Les tells the four teens that their next mission is a solo one. No one drops out.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-23","episode_number":12,"episode_type":"standard","id":565224,"name":"Solo Missions","overview":"The first of a two-part episode. Les assesses the strengths and weaknesses of each of the four remaining teens. He gives each teen a survival sack and warns them they may be in the wilderness for days. Each surviving teen is taken to a different spot. Jen is taken to a swamp (because she dislikes damp and has poor fire-starting skills), and is given mesh netting. Zac is taken into the deep woods (where he exhibited the poorest self-initiative), and is also given a snare wire. Kareem is taken to the top of a rocky outcrop (which tested him the most previously), and given two garbage bags. Adam is taken to an island (where the cold almost made him break down), and is given fishing line and hook. Adam and Kareem reconnoiter their area; Jen and Zac don't. Adam finds food, builds a shelter, and starts a fire easily. The next day, he finds a fishing lure in the water, catches fish to eat, and finds rock tripe and plantain leaves to eat. Kareem also finds rock tripe to eat and starts a fire (although it takes him an hour), but neglects to build a shelter or bear-proof his camp. Kareem finds water, but forgets to bring anything to filter it with and expends a lot of calories retrieving his bandana. He begins to suffer from dehydration and starvation, and eats paper. Zac builds a shelter and a fire, but later realizes there was a better site. He moves his campsite, expending a lot of calories. Plastic bins he finds prove useless. Zac locates water, but finds only wintergreen leaves to chew. Jen realizes too late that her camp site is not the best, takes more than three hours to get a fire going, and spends most of the second day unsuccessfully trying to catch frogs. She gets wet and depressed, and pines for Adam.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-30","episode_number":13,"episode_type":"finale","id":565225,"name":"Search and Rescue Finale","overview":"The second of a two-part episode, and an hour-long episode. During the first 15 minutes of the episode, Les reviews the season's developments. Becca, Becky, Catarina, and Holden as well as the surviving four teens' families assemble to welcome Adam, Jen, Kareem, and Zac home. Each surviving teen's situation is assessed after three days in the wilderness. Only Adam has eaten a substantial amount of food (he caught a smallmouth bass), while the others are depressed, hungry, tired, and not doing much work. The teens spend a third day in the woods. Rescue workers search for the teens. Zac doesn't make a signal fire, delaying his rescue. Jen injures her foot, but regains her sense of purpose. Adam moves his camp to the open shoreline. Jen is rescued first (by ground searchers), and Zac is found soon after by a search and rescue dog team. Kareem's despair at not being rescued leads him to stop seeking food and ignore his signal fire. Adam is rescued late on the third day after his smoke signal draws a rescue boat. Kareem is rescued at the very end of the day by a search and rescue helicopter after finally lighting his signal fire. Each teen has an emotional reunion with their family.","production_code":"","runtime":30,"season_number":1,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"! (2009) season 1","overview":"","id":29107,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"52585695760ee346610b13ba","air_date":"2010-04-19","episodes":[{"air_date":"2010-04-19","episode_number":1,"episode_type":"standard","id":565226,"name":"Season 2, Episode 1","overview":"The eight teens are dropped near the shore of a large lake, the \"victims\" of a floatplane crash. Justin and Nicole are parted from the others, and must survive the night on their own.[4] Les Stroud reveals that he will declare one of the teens \"Ultimate Survivor\" at the end of the series.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-26","episode_number":2,"episode_type":"standard","id":565227,"name":"Season 2, Episode 2","overview":"Les requires the main camp of teens to boil water using two different methods. If they succeed, Justin and Nicole will be returned. Meanwhile, the two teens separated from the group try to find food and water and keep calm while waiting for rescue.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-03","episode_number":3,"episode_type":"standard","id":565238,"name":"Snakes on a Plate","overview":"The participants must gather as much food as they can during the next day. Les Stroud helps them out by providing them with a live snake which they can kill for meat. The participants decapitate and kill the snake for food.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-10","episode_number":4,"episode_type":"standard","id":565237,"name":"Sick and Tired","overview":"Les sends the teens on a hike that will take several days to complete. They start out at night. Partway through the ordeal, Ian collapses from a real illness. The group splits up, dividing their resources. The teens debate how best to survive, and how to get reunited.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-17","episode_number":5,"episode_type":"standard","id":565228,"name":"Season 2, Episode 5","overview":"The days-long hike continues. The teens are confronted by a cliff and a swift river with rapids. Deciding to risk it, they jump into the river but lose all their supplies. Les Stroud helps them by offering a single match.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-24","episode_number":6,"episode_type":"standard","id":565229,"name":"Season 2, Episode 6","overview":"Les Stroud asks each teen to find a nearby cave and make a survival tool out of what they find there. Each teen must then build a fire. Michael, Manaal and Patricia leave the show.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-30","episode_number":7,"episode_type":"standard","id":565230,"name":"Season 2, Episode 7","overview":"Nicole is required to fake a medical emergency. The other four must transport the \"injured\" participant to a nearby log cabin, using only a compass for direction. If they make it to the cabin, they may use whatever supplies they find there. For some of the teens, the supplies prove more of problem than a solution.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-07","episode_number":8,"episode_type":"standard","id":565231,"name":"Season 2, Episode 8","overview":"Les Stroud challenges each participant with a \"fishing trip gone wrong.\" Each teen must now perform a task set by Les. At the end of the challenge, Les gives each teenager a fish, an axe, and a compass. They must find shelter and build a fire, but Justin and Nicole decide to leave the show.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-14","episode_number":9,"episode_type":"standard","id":565232,"name":"Season 2, Episode 9","overview":"The remaining three teens must move a fire across some open water. Then they must build a fire and keep it going while building a shelter from items found on the shoreline. The three teens have a very bad argument. Colin and Jade succeed in the challenge, but Ian has a much more difficult time.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-21","episode_number":10,"episode_type":"standard","id":565233,"name":"Season 2, Episode 10","overview":"Colin, Jade and Ian are dropped into the cold waters of Lake Huron. They are allowed to climb into a life raft, but must spend 24 hours on the open water while surviving wind, wet, and cold.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-28","episode_number":11,"episode_type":"standard","id":565234,"name":"Season 2, Episode 11","overview":"After their difficult night on the open water, the life raft is beached on a deserted island in Georgian Bay (part of Lake Huron). Each surviving teen must build three unique signals of some kind which will draw a rescuer's attention. But a thunderstorm rapidly approaches, putting the signals at risk.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-05","episode_number":12,"episode_type":"standard","id":565235,"name":"Season 2, Episode 12","overview":"Part one of a two-part finale. Each teen is given a flare gun, headlamp, knife, paddle, whistle, and a single match. Each teen must survive for several days, and demonstrate their survival skills. Ian fails to light a fire, putting himself at risk.","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-12","episode_number":13,"episode_type":"finale","id":565236,"name":"Search and Rescue Finale Season 2","overview":"Part two of a two-part finale. Each teen is led to a cache of survival gear. They are told to turn their shelter into a raft, and paddle to safety. Each surviving teen is reunited with their family and the teens who left the show. Les Stroud declares one teen the \"Ultimate Survivor.\"","production_code":"","runtime":30,"season_number":2,"show_id":18487,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"! (2009) season 2","overview":"","id":29108,"poster_path":null,"season_number":2,"vote_average":0}}}