{"adult":false,"backdrop_path":"/7mk2zSXpC3wSGsDEUe3TohN3F52.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2010-04-19","genres":[{"id":18,"name":"Drama"},{"id":35,"name":"Comedy"}],"homepage":"https://www.mytvsuper.com/en/programme/flywithme0003_125826/Fly-With-Me/","id":18853,"in_production":false,"languages":["cn"],"last_air_date":"2010-05-21","last_episode_to_air":{"id":569246,"name":"Episode 25","overview":"CHI does not want to shirk her responsibility and decides to confess.  In the hospital, KEUNG suddenly appears and takes CHI abroad to escape from the punishment.  They quarrel at the pier.  KEUNG suddenly kisses CHI by force.  In the day of court hearing, CHI disappears, giving up her bail and slipping away.  The people are at a loss.  BIN watches secretly.  CHEUNG and the family are sad about CHI’s disappearance.  And she finds the three obscene maniacs work hard in YUNG’s.  BIN realizes something.  FAI is very regret for what he did about KUI’s death.  He snivels in front of HING.  BIN appears and takes him to Phuket.  Because of CHI’s encouragement, YIN braces up and catches a thief on the street bravely.  BIN appears again and takes YIN and the thief to the police station.  She tells YIN’s supervisor that she was caught by YIN.  In the court, BIN confesses she kidnapped CHI and faked up evidence to set CHI up……","vote_average":0,"vote_count":0,"air_date":"2010-05-21","episode_number":25,"episode_type":"finale","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null},"name":"Fly with Me","next_episode_to_air":null,"networks":[{"id":48,"logo_path":"/v78f4q6DYdRB8dLj4rQBpqQG8pW.png","name":"TVB Jade","origin_country":"HK"}],"number_of_episodes":25,"number_of_seasons":1,"origin_country":["HK"],"original_language":"cn","original_name":"飛女正傳","overview":"Fly With Me is an TVB modern comedy-action series.","popularity":3.406,"poster_path":"/93KqW9iLj1sNxAd4fPrVpQrblax.jpg","production_companies":[{"id":79261,"logo_path":"/4OKzkasr0IV8CSqejjgRfKw7e0m.png","name":"TVB","origin_country":"HK"}],"production_countries":[{"iso_3166_1":"HK","name":"Hong Kong"}],"seasons":[{"air_date":"2010-04-19","episode_count":25,"id":29383,"name":"Season 1","overview":"","poster_path":"/jS0lQvOTcBL1yfsqEqXE0OIK1Sl.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Cantonese","iso_639_1":"cn","name":"广州话 / 廣州話"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"52585877760ee346610d351d","air_date":"2010-04-19","episodes":[{"air_date":"2010-04-19","episode_number":1,"episode_type":"standard","id":569223,"name":"Episode 1","overview":"The career woman LEUNG HAU-CHI is not very pretty but she has several admirers.  One day, CHI is held under duress by her admirer LAW CHUN-KEUNG.  CHI convinces him to surrender and successfully preserves company’s confidential information.  She is appraised by the company.  The junior boss of the company even invites her for a dance.  CHI’s requirement is very high.  Ten years has passed.  She experienced several romances but is still single.  Time flies, she is downgraded from “Hong Kong lady” to “Mid-aged lady”.  There is only TSU WING-FAI, her only admirer keeps waiting for her.  CHI’s career is stuck.  She loses all her money from investment.  She is envy about the new pretty colleague KWOK HIU-LAM and wants to have a breast surgery.  However, she finds out she is suffered from breast cancer at the same time.  Having discharged from the jail, KEUNG holds CHI to the roof top of the building……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-20","episode_number":2,"episode_type":"standard","id":569224,"name":"Episode 2","overview":"CHI wakes up in the hospital and finds her body is fine.  The tumor is disappeared.  She is so surprised.  The old colleague UNCLE KWAN tells CHI that her position is replaced by LAM.  CHI is enraged and wants to set up a plan having LAM to confess she is promoted because of her body.  CHI intends to let the three obscene maniacs, the top management of the company, know that there are used by LAM.  However, the truth goes against her will.  Moreover, CHI is shocked by the death of her neighbor, who is also a “Hong Kong lady”.  She then decides to get rid of her status which does not work eventually.  Because of a sudden kiss, CHI changes to a perfect lady and she can even fly.  But the transformation time is short, CHI falls down to the sea.  Having surfed in the internet, CHI infers that the reason of her transformation is because of a kiss.  CHI intends to kiss FAI but she has changed her mind after meeting the handsome YIN……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-21","episode_number":3,"episode_type":"standard","id":569222,"name":"Episode 3","overview":"YIN is the star in the police force.  He uses CHI to catch KEUNG.  CHI likes YIN.  Having heard that LAI would return to Hong Kong, CHI tries to get a chance to kiss with a man and changes to attend LAI’s wedding party.  However, because of FAI, the effective time shortened.  She is knocked down by the surgery doctor KAN MING-HIN twice while she is changing back.  After the sick leave period, CHI is badly treated by LAM.  CHI then decides to tease LAM.  On the other hand, CHI could not control the force she has while saving LAI, who is trapped in the elevator.  LAI falls into coma.  The adopted son, NGAN CHUN-BONG, of the big boss, YUNG PAK-KUI takes this opportunity to fire all LAI’s employees.  LAM is transferred to the Admin Department.  CHI visits the LAI in the hospital but is expelled by LAM.  She then moves to the hospital’s tuck shop of her second uncle KAM YAU-FU……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-22","episode_number":4,"episode_type":"standard","id":569226,"name":"Episode 4","overview":"YIN is assigned to investigate the cases associated with the “S-Woman”.  Whenever the “S-Woman” appears, they also find CHI is around.  YIN suspects CHI is a key person associated with “S-Woman” so he orders everyone to watch her.  CHI kisses a male patient in the hospital by force in order to save HIN as she thinks him is going to jump out from the roof.  But she finds a wrong person to kiss then is changed back to herself.  Luckily YIN saves her immediately.  CHI invites YIN for a lunch hoping to develop with him.  She then knows YIN is investigating the cases of “S-Woman” and LAI’s injury.  During the lunch, CHI is kissed by a man.  She is so embarrassed in order to hide her “S-Woman” identity.  Later on, she travels to take a break and chances upon HIN.  She is touched as he still cares about her and tries hard to save people.  FAI resigns from insurance agent and joins Yung’s.  His sister TSU WING-KA objects……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-23","episode_number":5,"episode_type":"standard","id":569225,"name":"Episode 5","overview":"LAM is under arrested because of FAI’s injury.  CHI feels guilty and decides to surrender herself to the police but chances upon the robbers with YIN.  In order to save CHI, YIN distracts the robbers but is forced to a dead end.  Luckily CHI changes and saves him.  The incident is taped by the reporter and blows up.  The story of “S-Woman” has become a hot topic in the city.  The “New” CHI has been named “JANET BIN” which is a literal translation of “Super Smart”.  YIN is so popular among the women’s group which has terrified his girl friend CHEUK-NGA.  She plays many tricks to prevent YIN getting too close to them.  YIN forces CHI to tell truth about BIN.  CHI then changes to BIN and explains LAI’s case.  However, it has frustrated YIN severely.  FAI has started working in Yung’s.  Because of a trivial matter, FAI meets with KUI and finds they have good rapport with each other.  On the other hand, LAI has awaked……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-26","episode_number":6,"episode_type":"standard","id":569227,"name":"Episode 6","overview":"CHI changes to BIN and joins LAI’s recovery party and thinks she will be LAI’s girl friend.  But in fact LAI is betting on BIN with the other playboys.  LAI even intends to ravish BIN by infatuations.  Having known that, CHI is enraged and gives LAI a lesson.  CHI is disappointed by men because of LAI’s incident.  She changes to BIN and punishes bad men.  Because of revealing the men’s shameful conduct, it has become a hot topic in the city.  CHI thinks of HIN when she is upset.  She peeps in HIN’s apartment and finds out an important tape which makes her fascinated about HIN.  In fact, HIN is a perfectionist like an artist which hazes SZE, his business partner & ex-girl friend.  SZE protects HIN a lot.  On the other hand, CHI’s grand uncle is enraged and died because of BIN’s punishment to the bad men.  CHI’s father hates BIN a lot because of it.  And he declares LEUNG’s family will be at daggers drawn towards BIN.","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-27","episode_number":7,"episode_type":"standard","id":569228,"name":"Episode 7","overview":"CHI finds out BONG’s intention to kidnap KUI because of his lost in the stock market.  FAI does not aware.  KUI and FAI are both kidnapped when they chances upon each other at the airport.  FAI guards KUI by his body.  In order to protect FAI, KUI tells the kidnappers that FAI is his illegitimate son.  YIN is assigned to investigate this case.  He asks LAI to throw the ransom on the street but finds out $1M is lost afterwards.  At first, YIN will be able to take the kidnapper and saves the hostages.  But BIN suddenly “helps” to arrest the kidnapper which has made the kidnappers and LAI falls into coma.  They cannot find out the head of this kidnapping case.  YIN is blamed by his supervisor.  FAI is fine but has conflicts with LAI and BONG after he is back.  KA pays to bribe CHI and wants to have FAI leave Hong Kong as well as Yung’s but it is revealed by FAI.  FAI argues with KA and leaves home……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-28","episode_number":8,"episode_type":"standard","id":569230,"name":"Episode 8","overview":"KUI falls into coma for several days.  His wife CHIU FUNG-HING, LAI and BONG all have plans and all want KUI never wake up.  FAI thinks YIN is pinpointing him while CHI wants to help YIN to tackle the case.  YIN falsely declares that another kidnapper has not been caught yet in order to attract the head of the kidnapper.  In fact, BONG has fallen into that trap and arranges his people to see the kidnapper but is ruined by BIN.  BONG’s people fells into coma.  BIN wants to be a witness but eventually chokes everybody up.  While KUI has fallen into coma, BONG and LAI form their territories in the company.  On the other hand, FAI is smacked by several people.  He has nothing to do with it but grumble in KUI’s office.  KUI pretends being sick severely and expels FAI in order to let him free from the power struggle and finds a chance to punish his sons……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-29","episode_number":9,"episode_type":"standard","id":569231,"name":"Episode 9","overview":"CHI is disfigured after crashing with HIN’s car.  HIN feels guilty and decides to fix CHI’s face for free as compensation.  He even breaks up with his business partner because of it.  KUI takes over the company and relocates his two sons to mainland China as punishment.  And he asks FAI to be back to help his business.  In order to trace BIN, YIN visits CHI in the hospital frequently.  NGA makes up a story to hold YIN’s heart which makes him laugh.  On the other hand, CHI tries to kiss a man to “fix” her face but she cannot do it because of her injury.  People think she is going to attack someone because of her trauma after severe injury.  NGA pretends being admired by someone forcing YIN back to her.  FAI and KA reconcile and FAI moves back home.  In the office, KUI employs FAI to handle big projects and introduce business partners to him.  In order to avoid FAI being recognized by KUI, KA destroys all the things left by FAI’s mother.","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-30","episode_number":10,"episode_type":"standard","id":569229,"name":"Episode 10","overview":"HIN visits CHI in LEUNG’s family and wants to talk to her.  CHI looks at HIN trying to kiss him but fails.  HIN stays with CHI which has touched her.  One day, CHI passes out on the street and HIN rescues her by artificial respiration.  It makes CHI recovered.  CHI finds out a wedding ring in HIN’s car and she is so happy and thinks HIN is going to propose to her.  In fact, the wedding ring is for the wedding of HIN’s mother.  Furthermore, HIN just treats CHI as one of his friend.  It is just a misunderstanding.  CHI is so annoyed and tells HIN she has already recovered which is surprised HIN.  The police investigate in pimp’s bar while CHI goes there on her own.  Drugs are found in CHI so she is under arrested.  On the other hand, YUNG finds SZE and HIN’s ex-girlfriends as the bridesmaids.  The girls say HIN is so skin-deep and just looking for good outlook and nice figures.  He does not know how to appreciate the girls’ inner beauty.","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-03","episode_number":11,"episode_type":"standard","id":569233,"name":"Episode 11","overview":"The underground gangs are afraid of BIN for punishing them so they do not get closer to YIN.  YIN is angry and hurts somebody which discontents his superior.  CHI’s cousin bail CHI out from the police station.  She introduces a “safe” pimp’s bar to CHI.  She cannot debate anymore.  HIN tries to date a girl with good heart.  But he cannot accept her imperfection eventually.  He gives up and depresses.  CHI feels so hurt because of HIN and she even gives up herself.  FAI treats everyone for karaoke in order to make CHI happy but she cannot take it.  She is irritated by the love songs and change to find HIN in order to scold him.  However, BIN’s perfect body surprises HIN.  In order to find BIN, HIN seeks help from CHI.  But CHEONG and the team dislike HIN.  HING asks for LAM’s help to attack FAI.  She pretends caring to get FAI’s trust and even helps FAI to approach CHI.  FAI then dates CHI for dinner in order to confess his love to her……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-04","episode_number":12,"episode_type":"standard","id":569232,"name":"Episode 12","overview":"HING does not satisfy with LAM’s performance and she decides to take care of FAI by herself.  FAI is under arrested for stealing company’s money but he does not.  KUI is not in town and HING pretends to help FAI.  FAI knows that KA is sick severely, his brother-in-law losses a lot in his business, his nephew is under arrested because of computer’s crime, and he witnesses CHI accepting YIN.  All frustrates FAI.  NGA hires a private investigator and finds out YIN getting too close with CHI.  She then tries to ruin their dinner in the restaurant.  FAI does not want CHI to get hurt so he stops her.  NGA asks YIN to explain in the police station.  In order to avoid NGA ruining his plan to investigate CHI, YIN proposes to NGA.  CHI hears about FAI’s incident from the other colleagues.  She then finds out the tragedy happened in FAI’s family.  FAI is sent in the jail and suffers a lot.  KUI is cheated by HING so he does not care about FAI……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-05","episode_number":13,"episode_type":"standard","id":569234,"name":"Episode 13","overview":"HIN tries hard to find BIN through CHI.  LEUNG’s family is now starting a good relationship with YUNG but still discontented by HIN.  YIN invites CHI and colleagues to sailing in order to attract BIN to appear.  CHI goes to the hospital and finds out KA has passed away.  FAI is shocked when he knows that.  CHI introduces YIN as her boyfriend.  HIN is so happy for her.  YIN gets the information and wants to catch the underground gangsters.  CHI changes to BIN and help.  Luckily BIN saves YIN.  YIN’s superior blames YIN for embarrassing the police force.  In several occasions, CHI wants to tell YIN that she is BIN but she cannot grasp the chance.  YIN wants to attract BIN to appear by SMS.  CHI is so angry because she thinks YIN wants to approach BIN.  Having talked to YUNG, CHI makes up her mind.  The key point is BIN’s departure.  However, YIN thinks BIN reveals his plan so does not appear and ruins the whole plan.  He hates BIN……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-06","episode_number":14,"episode_type":"standard","id":569235,"name":"Episode 14","overview":"After BIN has disappeared, the society is in a mess with many crimes.  YIN has problems one by one.  Because of him, his two colleagues get injured.  Afterwards, his superior gets injured.  YIN is so cold to NGA.  NGA pretends pregnant and hopes YIN will marry her.  But YIN does not get it.  NGA thinks YIN is irresponsible and decides to revenge.  Having been back to the clinic, SZE finds everything is in chaos.  She misunderstands and thinks HIN has quarrels and killed his partner CHEUNG WAI-SHUN.  She then immediately help to wash out all the evidences and pushes SHUN’s car into the sea.  However, everything is just a misunderstanding.  Before the operation, NGA changes all the bullets from YIN’s gun.  YIN is fine but his subordinates get injured and are sent to the hospital.  YIN decides to marry NGA in order to “change” his destiny.  SZE departs from Hong Kong in order to avoid embarrassing HIN.  HIN feels guilty……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-07","episode_number":15,"episode_type":"standard","id":569236,"name":"Episode 15","overview":"BIN suddenly appears and save YIN and HIN from the elevator.  She tells YIN that HIN is his boyfriend and wants YIN to give up his hope to BIN and concentrates on his career and relationship with CHI.  BIN attends a charity ball with HIN in high profile in order to let everybody knows she and HIN are in a relationship.  On the other hand, YIN tells CHI that he has a mission and needs to leave Hong Kong for a while.  In fact, he goes out with NGA for a wedding trip.  BIN treats HIN good sometimes but also neglects him sometimes which has been disappointing HIN.  SZE wants SHUN speaking for her and makes HIN back to her.  However, it does not affect HIN.  All males in the city are affecting by BIN’s affairs.  Everyone admires HIN but is also jealous on him.  They all treat HIN as their enemy.  HIN thinks he is only a screen in front of the media.  While he is quarreling with BIN at home, a man sneaks into his home trying to kill him……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-10","episode_number":16,"episode_type":"standard","id":569237,"name":"Episode 16","overview":"In fact, the weakness of BIN is the tattoo on her chest.  If something causes it damage, the changing process will fail.  After rescue, HIN is recovering.  He worries about BIN which is touching her.  She lies to HIN that her changing attitude towards HIN is taught by CHI which has enraged.  Having discharged from the jail, FAI promises he will revenge.  He plays tricks and KUI offers him a job at YUNG’s.  He starts revenging one by one.  First of all, he gets closed to BONG and get his criminal evidence which causes BONG and KUI against each other.  BONG finally left Hong Kong.  FAI takes over all the work from BONG.  FAI leaves his will in CHI’s home in advance.  CHI worries him.  She changes to BIN and find him.  However, she thinks HIN is being attacked so rushes to the hospital.  In order to flee from the media, BIN and HIN fly to the roof and have intimate chat.  SZE is angry of their relationship……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-11","episode_number":17,"episode_type":"standard","id":569239,"name":"Episode 17","overview":"YIN and NGA are back from honeymoon.  YIN is still passion about investigating BIN.  NGA interrogates YIN even more frequent then before which makes YIN feel bad.  In order to avoid BIN loving another person, CHI keeps on telling herself YIN is her boyfriend.  She even changes to BIN to meet HIN and separates with him.  However, HIN presents BIN the diamond accessories when they meet.  BIN is so pleased and forgets to break up with HIN.  YIN wants to break up with CHI.  But when he hears from CHI that BIN has a weakness, he changes his mind to reconcile with CHI.  When LAI tries to harm FAI, he is suddenly knocked down by a car and died.  FAI can finally get rid of all his enemies and become the senior management of YUNG’s.  YIN arranges NGA to handle many things and dates CHI secretly.  However, they chances upon NGA while tea time.  Meanwhile, some robbers held them as hostages in the restaurant……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-12","episode_number":18,"episode_type":"standard","id":569238,"name":"Episode 18","overview":"YIN lies to CHI that he is beaten hard by BIN.  CHI and BIN quarrel.  FAI moves to YUNG’s house.  On business side, he helps to follow up the project of a highway in Taiwan.  HING wants to use the three obscene guys to attack FAI’s business.  But FAI plays some treats to get closed to the guys.  HING pretends argue with LAM so LAM can get closed to FAI.  She steals the tender and accuses FAI of bribe.  FAI uses a fake tender to cheat LAM but LAM can steal the real tender.  LAM finds out the real identity of FAI from HING’s relative, CHAN WING-YAN.  She suddenly changes her plan to help FAI which ruins HING’s plan.  Taking this opportunity, LAM becomes an important person in FAI’s team.  On the other hand, CHI changes to BIN and BIN brings HIN to Phuket to celebrate his birthday.  YIN pretends injured severely and cheats CHI to tell him the weakness of BIN……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-13","episode_number":19,"episode_type":"standard","id":569241,"name":"Episode 19","overview":"BIN gets onto YIN’s plan and plays some tricks to tell YIN that she has no　weakness.  She also plays some tricks to let NGA thinks YIN has another woman.  YIN is accused of unnecessary use of authority and being suspended his job.  YIN is so upset and even angry on NGA.  They finally divorce.  In order to attack the same enemy, SZE finds NGA.  CHI realizes YIN uses him to investigate BIN.  She is so sad and does not want to see anyone.  She gets mad when seeing the police.  In order to help CHI getting back her confidence, he brings CHI to see YIN.  YIN scolds CHI for cheating him about BIN’s weakness.  CHI finally gives up her hope about YIN.  CHI’s family uses HIN and plays mahjong with CHI so as to giving her more confidence.  However, CHI gambles a lot and even loans from the underground loaner.  BIN wants to celebrate HIN’s birthday but HIN just thinks about CHI’s loan.  BIN blames HIN for not appreciating her arrangement……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-14","episode_number":20,"episode_type":"standard","id":569240,"name":"Episode 20","overview":"FAI settles the entire loan for CHI.  Meanwhile, he tells BIN that he does not love CHI anymore.  Because of money, BIN accepts FAI.  CHI and FAI do not talk anymore.  HIN is rescued and back to Hong Kong.  CHI asks HIN not to worry about her and take good care about BIN.  HIN uses the TV broadcast and apologizes to BIN and requests for a date.  CHI helps HIN to prepare everything and wants to touch BIN.  However, BIN joins FAI’s party and forgets about the date with HIN.  HIN waits BIN on the roof for a long time and suffers from flu.  BIN decides to have both men at the same time.  In order to stop BIN from doing it, CHI decides not to change.  LAM provides the evidence for embezzlement of company funds so as to stop FAI being too closed to BIN.  However, YAN suddenly changes his stance so FAI is on the alert.  LAM is fired eventually.  SZE recruits LAM and forms an alliance with NGA and SHUN to against BIN……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-17","episode_number":21,"episode_type":"standard","id":569244,"name":"Episode 21","overview":"CHI comforts HIN who was abandoned by BIN.  But HIN goes to Phuket with sorrow.  CHI decides not to change in order to avoid BIN appearing again.  FAI suddenly dates CHI and tells her that he approaches BIN in order to revenge HIN as he makes CHI gambles and loans money.  However, CHI does not accept FAI’s way of doing things.  FAI and HING quarrel at home and HING falls down from the staircase by accident.  HING becomes paralyzed and FAI can do anything to her.  BIN’s behavior is worsened.  She induces KEUNG, who just discharged from prison, to find CHI.  On the other hand, CHI finds YIN to help confronting BIN.  HIN returns to Hong Kong but his attitude is changed and becomes boastful.  In order to get more customers, he gives up his principles.  CHI fights with KEUNG and fells into coma in the elevator.  HIN does artificial respiration for CHI which triggers BIN appearing again……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-18","episode_number":22,"episode_type":"standard","id":569243,"name":"Episode 22","overview":"BIN wants to kill YIN but luckily YIN can make it.  BIN goes to YUNG’s house for FAI.  FAI thinks BIN is coming for revenge.  However, he finds BIN talking with KUI happily.  KUI even invites BIN to stay in YUNG’s house.  BIN pretends CHI and leaves a letter stating that she will go abroad.  CHEUNG is angry.  KUI arranges BIN to join YUNG’s and BIN takes the opportunity to tease the three obscene maniacs.  The three obscene maniacs ask FAI to help.  FAI wants to relocate BIN abroad.  BIN uses KUI to change FAI’s decision.  And it cause FAI misunderstands KUI using BIN to control him.  SZE finds someone to pretend metaphysician and says BIN is a walking disaster.  BIN then cannot get married with FAI.  FAI is happy about it.  However, BIN uses HIN’s metaphysical cosmetology to enhance her image in order to avoid that attack.  SZE blames HIN giving up his principles and playing tricks because of money……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-19","episode_number":23,"episode_type":"standard","id":569242,"name":"Episode 23","overview":"YIN attacks BIN when she goes to visit CHEUNG in the hospital.  However, he fails and is almost killed.  Luckily NGA saves him.  NGA suspects that CHI and BIN are the same person.  HIN organizes some exaggerating and outstanding seminars to get more business.  He uses BIN as their spokesperson.  His business is getting better and better but SZE is disappointed and sad because of the change of HIN.  HIN and BIN have good relationship in front of people but in fact they are using each other.  FAI succeeds KUI’s estate and prepares to get married with BIN.  But BIN feels disappointed about FAI’s fake love.  In the seminar, BIN is being attacked by someone and HIN saves her.  BIN is touched by HIN.  YIN decides to jump from the roof with BIN for CHI.  However, CHI would rather give up her freedom in order to prevent YIN from sacrificing.  FAI thinks CHI’s disappear is because of BIN so he refuses to kiss BIN……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-20","episode_number":24,"episode_type":"standard","id":569245,"name":"Episode 24","overview":"In order to revenge FAI, YAN tells KUI about FAI’s real identity.  KUI and FAI go to sail.  However, they quarrel and both fall into the sea.  KUI disappears.  BIN helps FAI to cheat the police in order to control FAI.  But she finds out FAI missing CHI.  BIN is angry and decides to attack CHI and make her disappear…… CHI appears again but she feels she will die soon.  She persuades FAI to get rid of BIN’s control.  Also, she advises YIN to have a fresh start and not to give up himself.  CHI wants to see HIN but she cannot reach him.  CHI is under arrested for killing KUI.  Luckily FU bails her out.  CHEUNG fells into coma and admits to hospital again.  CHI then realizes herself and BIN are the same person.  SZE’s union is dismissed.  LAM does not want to give up and threatens FAI by the evidence of his crime.  FAI seems understanding everything and does not care about it.","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-21","episode_number":25,"episode_type":"finale","id":569246,"name":"Episode 25","overview":"CHI does not want to shirk her responsibility and decides to confess.  In the hospital, KEUNG suddenly appears and takes CHI abroad to escape from the punishment.  They quarrel at the pier.  KEUNG suddenly kisses CHI by force.  In the day of court hearing, CHI disappears, giving up her bail and slipping away.  The people are at a loss.  BIN watches secretly.  CHEUNG and the family are sad about CHI’s disappearance.  And she finds the three obscene maniacs work hard in YUNG’s.  BIN realizes something.  FAI is very regret for what he did about KUI’s death.  He snivels in front of HING.  BIN appears and takes him to Phuket.  Because of CHI’s encouragement, YIN braces up and catches a thief on the street bravely.  BIN appears again and takes YIN and the thief to the police station.  She tells YIN’s supervisor that she was caught by YIN.  In the court, BIN confesses she kidnapped CHI and faked up evidence to set CHI up……","production_code":"","runtime":45,"season_number":1,"show_id":18853,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":29383,"poster_path":"/jS0lQvOTcBL1yfsqEqXE0OIK1Sl.jpg","season_number":1,"vote_average":0}}}