{"adult":false,"backdrop_path":"/5Zg0vnxN5Ojces5PzYbADqgFsvW.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"2008-09-04","genres":[{"id":35,"name":"Comedy"}],"homepage":"http://comeback.nova.cz/","id":19384,"in_production":false,"languages":["cs"],"last_air_date":"2011-10-24","last_episode_to_air":{"id":574654,"name":"Slepák","overview":"","vote_average":0,"vote_count":0,"air_date":"2011-10-24","episode_number":21,"episode_type":"finale","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null},"name":"Comeback","next_episode_to_air":null,"networks":[{"id":711,"logo_path":"/twuMX6vryssdv8oY01ZD5eNTKLt.png","name":"TV Nova","origin_country":"CZ"}],"number_of_episodes":51,"number_of_seasons":2,"origin_country":["CZ"],"original_language":"cs","original_name":"Comeback","overview":"Comeback is a Czech television sitcom which premiered on TV Nova on September 4, 2008.","popularity":9.456,"poster_path":"/jBhF1ZoMDb4EPYgFmgRQY7CY9yP.jpg","production_companies":[{"id":119646,"logo_path":null,"name":"CET 21","origin_country":"CZ"}],"production_countries":[{"iso_3166_1":"CZ","name":"Czech Republic"}],"seasons":[{"air_date":"2008-12-31","episode_count":14,"id":29746,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2008-09-04","episode_count":30,"id":29747,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2010-03-03","episode_count":21,"id":29748,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"Czech","iso_639_1":"cs","name":"Český"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.9,"vote_count":7,"season_data":{"1":{"_id":"52585adc760ee346610f79b7","air_date":"2008-09-04","episodes":[{"air_date":"2008-09-04","episode_number":1,"episode_type":"standard","id":574604,"name":"Křeslo","overview":"Pacovským dosloužila stará dobrá pohovka. Přesněji řečeno Iva ji už dál odmítá čistit. A když ji nebude čistit Iva, nebude ji čistit nikdo. Lepší nová a čistá pohovka než stará a špinavá. Jenže kde vzít peníze na novou, když obchod s hudbou vázne a do krámku Pacovských přicházejí zákazníci jenom omylem? A pokud si už přece jen někdo přijde koupit cédéčko, Ozzák ho většinou zastraší a vyžene pryč.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-11","episode_number":2,"episode_type":"standard","id":574605,"name":"Gott ex machina","overview":"Prach padá na cédéčka a Tomáš přitom musí splácet obchod a platit nájem. Jedna stařenka dychtící po Evě a Vaškovi tržbu nevytrhne. Ani pubertou paralyzovaný Lexa nemíní nakupovat, jeho sestra Saša aspoň nenaštve, protože je neviditelná. Jenže dluhy narůstají jako sněhová koule a jednoho dne vtrhnou do obchodu vymahači dluhů. Je to pro Tomáše potupa, když místo své fotografie musí podepsat splátkový kalendář. Ještěže po jeho autogramu touží také jeho letitá fanynka Marcelka, která zabrání nejhoršímu.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-18","episode_number":3,"episode_type":"standard","id":574607,"name":"Souboj Titánů","overview":"Dva kohouti na jednom smetišti, to nikdy nedělá dobrotu. Marcelka a Ozzák v jednom obchodu, to je snad ještě horší.\n\nTihle dva si jdou od prvního setkání po krku jako jeleni v říji. Ale jenom jeden z nich se může stát šéfem prodeje. Kdo to bude? Tomáš rozhodne, že ten, kdo do konce týdne prodá nejvíce desek. Následující hon na zákazníky zastíní i Iviny problémy s učitelkou matematiky, která sice už žákům nemlátí hlavou o lavici, ale uši jim kroutí pořád. Marcelčino Kolo štěstí přiláká do obchodu hejno zákazníků, ale Ozzákova sleva s pivním bonusem zabírá také.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-25","episode_number":4,"episode_type":"standard","id":574606,"name":"Pomáhat a chránit","overview":"V rodině Pacovských se odehrává detektivka. Tomáš totiž pojal důvodné podezření, že jeho dcera Iva má kluka.\n\nChce ho vypátrat, prolustrovat a případně zneškodnit jako nášlapnou minu. Jde zarputile za svým cílem od indície k indícii a jeho podezření přitom nabývá obludných rozměrů. Už není pochyb o tom, že Iva s někým chodí. Tomáš bije na poplach. Chce dceři randění zakázat, ale se zlou se u Simony potáže, a tak své dceři alespoň valí moudra do hlavy. Marně. V přesexované době se jeho varování míjejí účinkem. Ale Tomáš má konečně stopu.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-02","episode_number":5,"episode_type":"standard","id":574608,"name":"Pravidla rodinného provozzu","overview":"Televizní pořad Boží mlýny si vytkl za úkol exhumovat někdejší hvězdy šoubyznysu za účelem kopání do mrtvol.\n\nKdyž Tomáš zjistí, že naposled si jeho tvůrci posvítili na Pavla Horňáka, nemůže se ubránit dojmu, že tentokrát je na řadě on. Vždycky šel přece po Horňákovi. Tomáš dostane strach z televizního štábu a snaží se přejít do ilegality. To Ozzák je naopak vidět až moc, při jízdě v autoškole zapomene vzít s sebou do auta instruktora, splete si dvanáctistupňové stoupání s Plzeňským pivem a havaruje. Kdyby se jenom o tomto incidentu dozvěděly Boží mlýny, uvažuje Tomáš, vznikly by o Pacovských rovnou dva díly. A to je jenom špička ledovce. Marcelka si naštěstí jako vždycky ví rady. A zbytek dokoná řidič Ozzák.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-09","episode_number":6,"episode_type":"standard","id":574609,"name":"Je jaro...","overview":"Na Ozzáka přišlo jaro; kromě svého prostěradla mění i slovník, chování a vkus.\n\nJsou i svědkové, kteří tvrdí, že ho viděli, jak se chová galantně k ženám. Iva a Tomáš jsou znepokojeni, tohle nevěstí nic dobrého. Když totiž na Ozzáka přijde jaro, vyhlídne si svou ženskou oběť, zahrne ji přízní, využije a nakonec zahodí jako papírový kapesník. A taková odhozená ženská se pak ošklivě mstí celé rodině.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-16","episode_number":7,"episode_type":"standard","id":574611,"name":"Lupiči","overview":"Iva by ráda vyrazila na pokojnou demonstraci proti fašismu, ale Tomáš je rezolutně proti, obzvláště když vidí, že její zakuklený doprovod Lexa s sebou bere dlažební kostky.\n\nIva se nakonec smí zakuklit jedině doma. Jenže do obchodu vtrhnou zakuklenci další, ti ovšem nechtějí demonstrovat, ale krást. Ještě netuší, že v pokladně je jenom padesát korun a odznak Arakainu. Tomáš, Ozzák, Iva a Marcelka postupně končí spoutaní v kumbále. Teď už jsou na svobodě jenom Saša a Lexa, kteří marně čekají na Ivu v obýváku. Začínají tušit něco nekalého.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-23","episode_number":8,"episode_type":"standard","id":574610,"name":"Zdravý a nemocný","overview":"Ve škole se neučí kvůli nakažlivé nemoci. Žáka Beneše odvezli do nemocnice s podezřením na nigerijskou úplavici, protože ho v Tunisku poplival velbloud.\n\nTomáš, který se jinak prakticky pořád diví, teď doslova žasne: Taková nebezpečná nemoc a ona je skoro u nich doma! Jako správný hypochondr si hned sežene odbornou literaturu a studuje příznaky nemoci. Brzo se nemůže ubránit dojmu, že je to právě on, kdo trpí nigerijskou úplavicí a vyžaduje nadstandardní péči.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-30","episode_number":9,"episode_type":"standard","id":574612,"name":"Modelka","overview":"Iva a Saša si nechaly udělat fotky na pas. Tomáš okamžitě pojal podezření, že se Iva chystá zdrhnout za kopečky.\n\nVůbec mu nevadí, že tu fotku potřebuje jen na legitimaci do půjčovny DVD. Vodou na jeho mlýn se stane dopis z pařížské modelingové agentury, který Iva dostane. Stojí v něm, že přijali její přihlášku a žádají ji o další fotografie. Iva nechápe a Tomáš protestuje. Zato Marcelka jásá. Být modelkou je podle ní skvělé.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-06","episode_number":10,"episode_type":"standard","id":574613,"name":"Lexa a porno","overview":"Každému film podle jeho vkusu. Zatímco Tomáš, Iva a Saša jdou do kina na film Vše o mé matce, Lexa někde vyhrabal kazetu s pornem.\n\nChce se dívat s Ozzákem, ale ten tím není nijak nadšený, filmy ho nudí. Vadí mu, že když si člověk v kině na hodinku schrupne nebo než vystojí frontu na pivo, už neví, která bije. Nakonec však svolí a porno ho nečekaně chytne, ne kvůli sexu, zaujme ho děj. Ozzák konečně objevil filmy, kterým rozumí. Zato Lexa je z porna v šoku, zjistil totiž, že v něm hraje jeho matka Simona. Přestal komunikovat s okolím, je mimo ještě víc než obvykle.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-13","episode_number":11,"episode_type":"standard","id":574614,"name":"Giganti","overview":"Ivu štve, že se Tomáš může od rána do večera cpát kalorickými bombami, aniž by přibral gram, zatímco ona tloustne i po šrotu a sušeném celeru.\n\nVymyslí proto pomstu. Vypere mu kalhoty tak, že se srazí. Když Tomáš zjistí, že se nevejde do svých oblíbených džín, pokusí se své stravovací návyky přehodnotit. Marcelka ho zahrne dietami a zeštíhlujícími přípravky, po kterých by zhubla i kudlanka nábožná, ale Tomášův hlad je silnější. Lednička ho přitahuje podvědomě, jako žárovka mouchu. Když si to v plné míře uvědomí, nastolí doma i v obchodě absolutní dietu. Pacovským hrozí hladomor.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-20","episode_number":12,"episode_type":"standard","id":574615,"name":"Zlatá rybka","overview":"Ozzák strhal pípu, a tak Simona musí jet pro novou na pivovarnický veletrh. Tomáš udělá dobrý skutek a odveze ji tam.\n\nIva, Saša a Lexa jsou bez rodičů těhotní touhou udělat nějakou rebelii, třeba si zajít na pánský striptýz nebo si večer nevyčistit zuby. Jenže Ozzák, který je také bez hlídání, potřebuje svůj pravidelný servis: horkou vodu na grog a noční transport z hospody domů.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-27","episode_number":13,"episode_type":"standard","id":574616,"name":"Sliby chyby","overview":"Tomáš už čtyři roky slibuje Ivě snowboard, ale pak jí stejně dá jen své staré lyže, na kterých kdysi porazil ve slalomu Víťu Vávru a několik branek.\n\nNení proto divu, že ho Iva obviní z neplnění slibů. Ani Lexa a Saša se letos od Simony snowboardů nedočkají. Naše teenagerská trojka proto vezme osud do svých rukou a přihlásí se na brigádu do supermarketu. Také Ozzák chce po Tomášovi, aby plnil sliby, a sám mu jde příkladem: Tři dny drží bobříka mlčení, jak kdysi slíbil.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-04","episode_number":14,"episode_type":"standard","id":574617,"name":"Simonina volba","overview":"Simonin bývalý manžel si chce vzít do péče jedno ze svých dětí a Simona neví, jestli se má zbavit Lexy, nebo Saši. Porovnává tedy jejich provozní náklady a spotřebu na kilometr...\n\nNakonec ale podlehne svým mateřským pudům a nevydá dítě ani jedno. Její bývalý muž na ni za trest posílá sociálku. Pokud Simona nepředvede, že všichni žijí v harmonické rodině s pravidelnými stravovacími a hygienickými návyky, může přijít dokonce o obě děti! Řešení se nabízí samo: infiltrovat se k Tomášovi do rodiny.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-11","episode_number":15,"episode_type":"standard","id":574619,"name":"Taneční","overview":"Mládež se chystá do tanečních. Tomáš vybral Ivě tmavé šaty, které se hodí spíš na pohřeb.\n\nOna by ráda něco odvážnějšího, ale její staromódní otec je rezolutně proti a hledá oporu v Marcelce. Jenže ta nečekaně přizná, že sama chodila do tanečních v šatech, které byly nejodvážnější ve všech zemích RVHP. Saša je na tom ještě hůř než Iva; v šatech od Simony, které mají jen historickou cenu, je neviditelná snad i na přechodu pro chodce. Lexu taneční nejdřív moc neberou, nakonec ho ale začnou vzrušovat, bohužel jinak, než by si přál.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":"/m5f6NFOM1ply1DJ6EUEKr6S2eDG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-18","episode_number":16,"episode_type":"standard","id":574618,"name":"Heavy christmas","overview":"Dokonce i Ozzák se těší na Vánoce, jenom mu vadí, že tyhle svátky poslední dobou moc vyměkly. S Lexou se dohodnou, že je letos patřičně přitvrdí.\n\n Už se nebudou péct rohlíčky, ale rohlíky. A rumové kuličky nahradí rumové koule. Zabíjet kapra paličkou je podle Ozzáka zbabělost. Správný chlap jde o Vánocích s palicí na žraloka. Obchod s cédéčky před svátky jenom kvete.\n\nVšichni chtějí technokoledy Křečka Mirečka. Normálně by si je stáhli z internetu, ale dávat bližnímu vypálené cédéčko se nehodí. Štědrý večer se blíží.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":"/fiNjhzNbefMlrvTgwtWA626kHkf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-04","episode_number":17,"episode_type":"standard","id":574620,"name":"Jmenuje se Dagmar!","overview":"Internetové bankovnictví Tomáše nadchne. Konečně nebude muset chodit do banky, kde se mu úřednice potají pošklebují. Při kontrole účtu v počítači ale zažije šok - každý měsíc mu z něj odcházejí peníze do Indie!\n\nIva se přizná, že jde o příspěvek na chudou indickou holčičku, kterou potají adoptovala. Tomáš je zpočátku nedůvěřivý, ale když vidí fotografie roztomilé dívky a dozvídá se o jejích úspěších ve škole, postupně se s ní smíří. Jenom to její jméno... Raději jí bude říkat Dagmar.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":"/sQ6IZdl4dotIwX0Y5ZZwFLSH61G.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-11","episode_number":18,"episode_type":"standard","id":574621,"name":"CzechSteh","overview":"Ozzák zapomněl na sporáku hrnec s buřtgulášem a Pacovští mohli vyhořet, kdyby včas nedorazila hasička Majka, která uhasila oheň a zároveň v Ozzákovi zažehla vášeň.\n\nTomáše tento požár postavil před jinou výzvu - musí koupit nový hrnec, aby měla Iva v čem vařit. Naštěstí jsou tady nákupní zájezdy, díky kterým získá nejen nádobí, ale i nové kamarády, se kterými může chodit do parku krmit labutě!\n\nIvě Tomáš zakáže účast na festivalu CzechTek. Když mu ovšem oznámí, že tedy pojede o víkendu na kurs vyšívání, není otec proti.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-18","episode_number":19,"episode_type":"standard","id":574622,"name":"Mrtvý muž","overview":"Tomi Paci svou kariéru pohřbil už dávno, teď se ale z encyklopedie popu dozvídá, že umřel i fyzicky.\n\nPro média ale má, jak se ukáže, zapomenutý popový zpěvák větší cenu mrtvý než živý – po létech se díky svému úmrtí Tomáš dostane na titulní stránky novin.\n\nZatímco si zoufá, jeho obchod s CD začíná po letech prosperovat, stane se totiž kultovním shromaždištěm Tomášových obstarožních fanynek.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-25","episode_number":20,"episode_type":"standard","id":574623,"name":"Berňák","overview":"Tomáš s Marcelkou čekají kontrolu z finančního úřadu. Znamená to prokousat se účetnictvím jejich obchodu, které bohužel po léta vedl Ozzák. Když zkolabuje fosilní účetní program Helenka, je opravdu zle.\n\nBude se chtít obávaný kontrolor berňáku Oto Šlus probírat záznamy, z nichž ta nejlépe vedená část je zapsána na futrech ode dveří?\n\nSaša s Ivou mezitím vytáhnou Ozzáka na přednášku Jeho Svatosti dalajlámy a ta nezůstane bez následků. Ozzák začne hledat osvícení a taky účty ze září 2005, které trochu uletěly.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-08","episode_number":21,"episode_type":"standard","id":574624,"name":"Scrabble trable","overview":"Ozzák s Lexou se hroutí: nesehnali lístky na koncert Rolling Stones.\n\nZáchranou by mohly být dva volňásky, které dostala Marcelka. Ta o Stouny nestojí, ovšem její vztahy s Ozzákem jsou na obvyklé mrazivé úrovni a nevidí důvod, proč mu udělat radost.\n\nVymyslí si rafinovanou zábavu: vyzve rodinu Pacovských, aby na ní zkusili lístky vyhrát v některé z jejích oblíbených her – začíná se scrabblem. Ukáže se ale, že snad neexistuje hra, ve které by se Marcelka dala porazit!\n\nVypadá to, že Ozzák s Lexou koncert neuvidí.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-19","episode_number":22,"episode_type":"standard","id":574625,"name":"Koprovka","overview":"Marcelka přihlásila Tomáše do televizní soutěže Když hvězdy vaří. Pokud se mu podaří zaujmout porotu a diváky, může to pomoci jeho návratu na koncertní pódia.\n\nNaneštěstí je Tomáš naprostý kuchařský antitalent a ani věrná Marcelka mu tentokrát příliš nepomáhá, protože se musí věnovat nemilosrdné chorvatské tchyni.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-22","episode_number":23,"episode_type":"standard","id":574626,"name":"Narozzeniny","overview":"Datum Tomášových narozenin je střeženým tajemstvím: ničeho se totiž Tomáš nebojí víc než toho, že by mu Ozzák zase uspořádal oslavu.\n\nMinule se probudil v Popradu, letos by to mohlo být horší. Když nic netušící Marcelka zmíní Tomášovo datum narození před Ozzákem, začnou Tomáš s Ivou panikařit a vymlouvat se. Ale Ozzák už pojal podezření a nedá se zastavit.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-06","episode_number":24,"episode_type":"standard","id":574627,"name":"Rozzvod","overview":"Marcelčin chorvatský manžel Zoran je typickým příkladem horkokrevného Balkánce. Když nabude dojmu, že se Marcelka příliš přátelí s Tomášem, začne být horko i Pacovským.\n\nA žádné zlepšení nenastane ani poté, co naopak Marcelka přistihne Zorana v choulostivé situaci s atraktivní slečnou. Spíš naopak – zhrzená Marcelka se totiž stěhuje k Tomášovi do bytu a rozhodne se vnést rodině do života řád a pořádek.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-13","episode_number":25,"episode_type":"standard","id":574628,"name":"Prohozz","overview":"Každý má své problémy: Saša je pro kluky neviditelná, Iva má naopak pocit, že je pro některé (třeba pro Lexu) viditelná až moc, Ozzák v krámu přivádí k šílenství jednak Marcelku, jednak zákazníky, krám nevydělává a z toho je zase na prášky Tomáš...\n\nV zoufalství nad Ozzákovými výstřelky se Tomáš nechá zlákat posledním hitem z oblasti užité psychologie - tajně pustí Ozzákovi motivační CD s názvem Objevte své lepší já. Netuší ovšem, že stvořil nestvůru.\n\nA co teprve, když Marcelka sama na sobě vyzkouší CD s opačným efektem – Objevte své horší já...","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-20","episode_number":26,"episode_type":"standard","id":574630,"name":"Těžká hodina","overview":"Iva chytí chřipku, leží doma a nudí se. Hypochondr Tomáš se jí vyhýbá, aby se nenakazil a nepřišel o kulturní událost sezóny, nový muzikál Michala Davida.\n\nIva zažije šok - zjistí, že Lexa píše básně. Bohužel o ní, a to musí přestat. Ovšem díky Lexovým básničkám se o ni konečně začne zajímat třídní idol Beneš, a dokonce ji chce přijít v nemoci navštívit.\n\nTomáš si ale básničky přečetl taky, nabyl dojmu, že Iva chodí s Lexou, a hlídá ji jako ostříž. Navíc se třídní kickboxerka Machová rozhodla, že s Benešem chodí ona, a zbije každou spolužačku, která se na něj jenom podívá.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-27","episode_number":27,"episode_type":"standard","id":574629,"name":"Pan Prase odchází","overview":"Ozzák je smutný – zemřel jeho nejlepší kamarád, pivní turista jménem Prase.\n\nTomáš je taky smutný, protože podle Ozzáka je Prase jejich příbuzný a Tomáš by mu měl zaplatit pohřeb. I Iva je smutná: dozvídá se, že akvarijní rybičky Špekáček a Uzenka, které v dětství milovala, možná vůbec nebyly rybičky.\n\nJediná Marcelka má dobrou náladu. Chodí totiž k doktoru Stehnovi na kurs kreativního konfliktu a cítí, jak se jí zvedá sebevědomí. A metalový pohřeb kamaráda Prasete se blíží.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-03","episode_number":28,"episode_type":"standard","id":574631,"name":"Absťák","overview":"Ozzák zděšeně zjistí, že metalisté v Čechách vymírají. S několika posledními vyznavači tvrdé hudby se rozhodnou pro zoufalý krok: musí se rozmnožit!\n\nVymyslí, jak toho dosáhnout, ale to by musel Ozzák vydržet tři dny střízlivý. Tomáš prožívá těžké chvíle: Ozzák bez denní dávky piva je nebezpečný sobě i okolí a navíc jakási slečna pod přezdívkou Vačice vyzrazuje na internetovém blogu tajemství ze života jejich rodiny.\n\nZvládne Ozzák muka abstinence? A přežije to jejich lednička?","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-14","episode_number":29,"episode_type":"standard","id":574633,"name":"Krev, pop a slzy","overview":"Tomáš se nestačí divit: v rádiích se najednou znovu začal hrát jeho největší (a jediný) hit Vsákneš se do mě jako déšť!\n\nRadost ale netrvá dlouho – zjistí, že jeho song byl hanebně zneužit. Z deprese se pokusí dostat pracovní terapií: začne žehlit. Iva se obává, že se otec postupně stává na žehlení závislým.\n\nMarcelka ví, co by Tomášovi dokázalo vrátit psychickou rovnováhu – úspěšný koncert. Jak ale zařídit vystoupení vyhaslé popové hvězdy, o kterou nikdo nestojí?","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-21","episode_number":30,"episode_type":"finale","id":574632,"name":"Boží mlýny","overview":"Bulvární televizní magazín Boží mlýny s oblibou likviduje popové ikony z období totality. Další na řadě je Tomáš.\n\nTelevizní štáb Božích mlýnů měl Tomiho Paciho v merku už jednou, ale tehdy zasáhl Ozzák, když autem srazil kameramana a zničil natočený materiál. Při druhém pokusu se reportér Božích mlýnů Lubo Žák neštítil ničeho - od rafinovaných převleků přes nasazení skryté kamery po únos Ivy, aby dostal Tomáše do studia.\n\nTomáš se hroutí pod palbou otázek nelítostně rozebírajících nejen jeho pěveckou kariéru, ale třeba i to, zda národu netají nemanželské dítě.","production_code":"","runtime":30,"season_number":1,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":29747,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"52585adc760ee346610f79c2","air_date":"2010-03-03","episodes":[{"air_date":"2010-03-03","episode_number":1,"episode_type":"standard","id":574634,"name":"Změna je pivo","overview":"Ozzáka postihla největší katastrofa jeho života. Hospoda U jezevce se bude bourat, místo ní má být fastfood!\n\nOzzák se na protest připoutá k barpultu, Lexa se k němu přidá. Tomáš si zoufá z připoutaného bratra, a aby toho nebylo málo, ukradnou mu obstarožní bicykl – dar od Ally Pugačevy.\n\nJediný spokojený člověk je kupodivu Simona, které už šestnáctihodinové šichty v hospodě lezly krkem. Navíc se objeví obávaná učitelka Kobrová, která přišla do Jezevce zkontrolovat, jestli se Lexa na připoutání jen nevymlouvá, aby se vyhnul písemce.","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-10","episode_number":2,"episode_type":"standard","id":574635,"name":"Děvečka z Lidečka","overview":"Tomáš jezdí po koncertech a snaží se zavděčit publiku za každou cenu, i kdyby si měl vzít lidový kroj.\n\nPřibere spoluhráče, mlčenlivého klávesistu Šimaru, jehož specialitou je svatební pochod z Lohengrina. Simona se rozhodla k zásadnímu kroku – nastoupí do fastfoodu, který stavějí místo zbouraného Jezevce. Všichni se shodnou, že uniforma jí moc sluší.\n\nOzzák si už za Jezevce našel důstojnou náhradu. V hospodě u Maříků se mu líbí, jen mu vadí, že se po návratu bůhvíproč neprobouzí doma, ale v neznámém bytě vedle ukřičeného trpaslíka. Iva se Sašou tuto záhadu nakonec vyřeší, ale trpaslíku Venouškovi Ozzák chybí...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-17","episode_number":3,"episode_type":"standard","id":574636,"name":"Komu zvoní hrany","overview":"„My vezmem svět pod naše křídla!“ Tak začíná hymna fastfoodu HappyChick, ráje kuřecích specialit, kam nastoupila Simona.\n\nTomáš prožívá uměleckou krizi – tři platící návštěvníci koncertu se Marcelce zdají málo. Navrhuje mu zviditelnit se skandálem, ale její a Tomášova představa skandálu se výrazně liší a krást v supermarketu Tomáš odmítá.\n\nOzzák je zoufalý, od Maříků jej vyhnali trempové a on marně hledá novou hospodu. Simona mezitím smaží hranolky a snaží se vyjít s vedoucím Rudim, pro kterého HappyChick znamená všechno. Naštěstí může nosit domů zbytky jídla, které dvojčatům moc chutnají – možná až příliš.","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-24","episode_number":4,"episode_type":"standard","id":574637,"name":"Zlatá ledvina","overview":"Ozzák usilovně trénuje na Pivní pětiboj – letos jej čeká tvrdá mezinárodní konkurence včetně obávaného německého profesionála Fibingera. Marcelka domluvila Tomášovi koncert v Bruntálu a k smrti ho tím vyděsila – zásada číslo jedna v šoubyznysu praví: \"Bruntál nebrat.\" Simona po vyhazovu z fastfoodu bojuje s pracovním úřadem, kde se zbláznil informační systém a zařadil ji mezi blanokřídlé. \n\nÚčastníky Pivního pětiboje čeká finále a Tomáš se musí rozhodnout, zda fandit bratrovi, nebo odjet do Bruntálu, kde zrovna vrcholí celoroční období dešťů. Naštěstí se do věci vloží legendární silák Železný Zekon...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-31","episode_number":5,"episode_type":"standard","id":574638,"name":"Boží frisbee","overview":"Celá republika je vzhůru nohama – má přijet papež! Marcelka hbitě objedná Zmožkovy křesťanské songy a knihu Biografie Boha. Tomáš má jiné starosti – chystá se domovní schůze a vypadá to, že tentokrát je správcová za Ozzákovy křesťanské žertíky opravdu exemplárně potrestá. Postavila se proti nim i sousedka Vojtíšková, náboženská fanatička; nebo má pravdu Ozzák, když tvrdí, že ho ta baba balí? Tomáš navíc ke své hrůze jistí, že Simona krade a (podle Sašina svědectví) chodí s Horváthem v noci do tunelu! Návštěva Svatého otce se blíží a pěst boží dopadne i na Ozzákovu oblíbenou hospodu U satana...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-07","episode_number":6,"episode_type":"standard","id":574639,"name":"Cesta do Vtelna","overview":"Konečně se dozvíme něco o příbuzných rodiny Pacovských! A také o velikonočních rituálech: Iva pere záclony (dvakrát), Ozzák odkudsi přináší podezřele dlouhé proutí na pomlázku, Tomáš mu ho závidí. Lexa má z blížících se svátků jara těžkou hlavu: máma mu letos zvýšila normu, bude muset vymrskat tři sta vajec. A také není jasné, jak dopadne návštěva Pacovských u babičky ve Vtelně, když ta přece jezdí každé Velikonoce k Maruně do Rybné...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-14","episode_number":7,"episode_type":"standard","id":574641,"name":"Sbohem, Káhiro","overview":"Marcelka má nového koníčka, břišní tance, a zlákala na ně i Ivu a Sašu. Tomáš z toho nemá zrovna radost, nelíbí se mu, že se Iva někde nakrucuje polonahá. Ještě víc začne vyvádět, když Iva přijde s úžasnou novinou – mají tančit před katarským princem! \n\nOzzákovi leze na nervy, když Marcelka trénuje tanec v krámu. Jednou to ale zkusí taky a objeví, že na něj mají břišní tance zvláštní účinek, díky kterému hodně ušetří za pití. Možná si bude moci našetřit na svého vytouženého velblouda! Simona postupně vybavuje novou hospodu. Je ale otázka, co si počne s lamou, která se k ní omylem dostala...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-21","episode_number":8,"episode_type":"standard","id":574640,"name":"Bejk","overview":"Marek Vašut poprosí Tomáše o pomoc – potřebuje o víkendu ohlídat synka. Je mu devět, říká si Bejk a táta jej vychovává jako skutečného tvrďáka. Bohužel Vašut, když vyprávěl Bejkovi o strýci Tomášovi, trochu nadsazoval. Je potřeba úsilí celé rodiny, aby Bejk nepřišel na to, že drsný „Bourák Tom“ je ve skutečnosti nevýbojný milovník kakaa a semlbáby. Saša nechápe, co se s panem Pacovským děje, a navíc vymýšlí, co dát mámě k svátku – srdce vyřezané z brambory asi nebude to pravé. Jediný Ozzák si mumraje kolem nevšímá a chystá se na turnaj ve svém oblíbeném sportu – ježelkách.","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-16","episode_number":9,"episode_type":"standard","id":574642,"name":"Křik Kormorána","overview":"Iva je z toho jako každý rok nešťastná, protože otec tráví dovolenou tím, že žehlí Ozzákovy maléry nebo ji hlídá. A letos to bude ještě horší, Ozzák se s Tomášem pohádal a nepojede. To, že Ozzák zůstává doma, vytočilo z neznámého důvodu i Simonu.\n\nTa trávívá dovolenou - samozřejmě bez dětí, jinak by to nebyla dovolená - v penzionu U dvou fíkusů (italská kuchyně a pod oknem křičí kormorán). Saša a Lexa se připravují na to, že až máma odjede, musí vykonávat její povinnosti – Saša vaří domovním skřítkům a Lexa plaší netopýry sající lidskou krev.","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-06","episode_number":10,"episode_type":"standard","id":574644,"name":"Třinácté pivo","overview":"Tomáš rozhodne, že všichni členové rodiny musí začít šetřit. A v případě Ozzáka to znamená, že dostane denní limit pouhých 13 piv. Po 13. pivu však bývá Ozzák nesnesitelně chytrej...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-13","episode_number":11,"episode_type":"standard","id":574643,"name":"Bez kláves neodejdu","overview":"Tomi Paci měl koncert v Jablůnkově - městě dětí a nebyla to žádná procházka růžovou zahradou. Klávesista Jaromír se dokonce vrátil bez svého legendárního nástroje a chce ho tvrdošíjně zpátky. Vrátit se znovu do Jablůnkova však už nikdo nechce...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-20","episode_number":12,"episode_type":"standard","id":574645,"name":"Let mouchy","overview":"Tomáš je jako slavný absolvent pozvaný do školy na besedu se studenty. Podmínkou ředitele ale je, že si Tomáš koupí nové sako...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-27","episode_number":13,"episode_type":"standard","id":574646,"name":"Obraz paní Rybkové","overview":"Saša dostane po zemřelé sousedce Rybkové obraz jejího oblíbeného psa. Aby ho uchránila před Simonou a mohla si ho nechat, musí se naučit lhát. Ale začátky jsou těžké...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-05","episode_number":14,"episode_type":"standard","id":574647,"name":"Zabijačka","overview":"Tomáš se namazal a navykládal v hospodě strejdovi Květošovi, aby jej trumfnul, spoustu nesmyslů. Že je ředitelem Metrostavu a Ozzák pracuje jako notář. A nejhorší je, že se nejspíš všechno brzo \"provalí\", Květoš je totiž pozval na zabíjačku!","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-12","episode_number":15,"episode_type":"standard","id":574649,"name":"Sulc","overview":"Ozzák se mírumilovně chystá vařit sulc, ale Tomáš zůstává na stráži, ví, že bratr je katastrofa na pochodu. Co vybuchne dřív, kotel sulcu nebo Tomáš po třídní schůzce?","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-19","episode_number":16,"episode_type":"standard","id":574648,"name":"Holter","overview":"Kdo jsou Starý tygr a Zrzavá vrána? Kde se berou v domě kódované zprávy? A proč Ozzák pozval skauty na grog? Simona má jasno: v baráku bydlí tajný agent. Ale možná tyhle záhady spíš souvisí s tím, že Iva s Lexou jedou se čtvrťáky lézt do skal a Tomáš se to nesmí dozvědět. Mohlo by se mu přitížit – tentokrát si totiž diagnostikoval pro změnu infarkt. Doktor mu na to skočil a nařídil mu, že musí celý den nosit krabičku, která zaznamenává srdeční činnost, a pečlivě si zapisovat, kdy zažil jaký stres. A má opravdu co zapisovat, i když za to zavařené kotě tentokrát Ozzák opravdu nemůže...","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-26","episode_number":17,"episode_type":"standard","id":574650,"name":"Strakonický bubák","overview":"Poté, co Tomáše zařadil časopis Blondýna mezi kandidáty na titul Tupan roku, Marcelka se nejdřív opila a pak se rozhodla, že takhle to dál nejde. Chudák Tomáš ze sebe musí narychlo udělat intelektuála, nebo to aspoň předstírat! A tak Tomáš zjišťuje, kdo napsal Kafku, a poslouchá z cédéčka světové literární klasiky v podání Felixe Holzmanna. Ozzák se taky rozhodne dovzdělat a začne s nebezpečnou důkladností studovat knihu O pejskovi a kočičce. A Iva musí vysvětlit Saše, že asi něco popletla, když si do školy na hodinu sexuální výchovy nachystala banán.","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-03","episode_number":18,"episode_type":"standard","id":574651,"name":"Havárie","overview":"","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-10","episode_number":19,"episode_type":"standard","id":574652,"name":"Francouzská restaurace","overview":"","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-17","episode_number":20,"episode_type":"standard","id":574653,"name":"Snad to vyjde příště","overview":"","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-24","episode_number":21,"episode_type":"finale","id":574654,"name":"Slepák","overview":"","production_code":"","runtime":30,"season_number":2,"show_id":19384,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":29748,"poster_path":null,"season_number":2,"vote_average":0}}}