{"adult":false,"backdrop_path":"/eWw9QZL65Fe8k3f3DFXemgjFKNd.jpg","created_by":[{"id":1645476,"credit_id":"62d3d7f49f51af0768b86a51","name":"Ha Myung-hee","gender":1,"profile_path":"/gzMMmhqBRj1Z9eYUmu4dKtwmTY8.jpg"}],"episode_run_time":[70],"first_air_date":"2022-04-02","genres":[{"id":35,"name":"Comedy"},{"id":18,"name":"Drama"},{"id":10751,"name":"Family"}],"homepage":"https://program.kbs.co.kr/2tv/drama/beautifulnow","id":196532,"in_production":false,"languages":["ko"],"last_air_date":"2022-09-18","last_episode_to_air":{"id":3635452,"name":"Out Of Time","overview":"Soo Jung's health deteriorates, and she gets admitted to the hospital. Everyone worries for her well-being, especially Hyun Jae, who is determined to convince Kyung Ae and Soo Jung to accept his decision to be the liver donor. Fortunately, Kyung Ae has a change of heart, and she decides to talk with Soo Jung.","vote_average":0,"vote_count":0,"air_date":"2022-09-18","episode_number":50,"episode_type":"finale","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/3oZNM3Lr66LktIACznXUE1H4r1y.jpg"},"name":"It's Beautiful Now","next_episode_to_air":null,"networks":[{"id":342,"logo_path":"/nFmWwUAf2D3iAtizUcmkxufaM0q.png","name":"KBS2","origin_country":"KR"}],"number_of_episodes":50,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"현재는 아름다워","overview":"Three brothers search for marriage partners in order to win the apartment offered by their family elders.","popularity":10.872,"poster_path":"/9AQ94tFirqWX8Ob9Z1ycM7upCoD.jpg","production_companies":[{"id":172185,"logo_path":"/u89w62EzN9WxzSxFEfHaZ09LXc7.png","name":"DramaHouse","origin_country":"KR"},{"id":86981,"logo_path":"/8FwCT7KohE031xFLBeRMZlbuzSr.png","name":"SLL","origin_country":"KR"},{"id":126468,"logo_path":"/bPL10u0CNVqmSovalrbcZiwWvre.png","name":"Content Zium","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2022-04-02","episode_count":50,"id":285832,"name":"Season 1","overview":"Kyung Chul is the grandfather and spiritual leader of the Lee family. He became a widower at a young age and also lost his daughter. When he was at his lowest, he adopted Min Ho, and the two have maintained a strong familial bond ever since. Along with Kyung Chul, Min Ho and his wife Kyung Ae want their three sons, who have all grown up to be decent young men with good jobs, to get married and have bustling families soon. Kyung Chul makes his grandsons a big offer. The first one to get married will get an apartment.","poster_path":"/9AQ94tFirqWX8Ob9Z1ycM7upCoD.jpg","season_number":1,"vote_average":7.3}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.2,"vote_count":4,"season_data":{"1":{"_id":"6246a5bc8ee49c00a1267db3","air_date":"2022-04-02","episodes":[{"air_date":"2022-04-02","episode_number":1,"episode_type":"standard","id":3635311,"name":"The Lee Brothers","overview":"Kyung Chul is the head of the Lee Family and lives with his son, daughter-in-law, and two of his three grandsons. Hyun Jae, the second grandson, is a talented divorce lawyer. Hyun Jae goes to meet a very special client on behalf of his boss, Hae Jun. Meanwhile, Kyung Ae goes to a wedding and gets upset when her friends point out that none of her sons are married yet.","production_code":"","runtime":71,"season_number":1,"show_id":196532,"still_path":"/5edBFwPfz2Gs8k9X4PvPO5sY3TT.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-04-03","episode_number":2,"episode_type":"standard","id":3635387,"name":"The Marriage Project Begins","overview":"Mi Rae desperately wants Hyun Jae to take her on as a client and convinces him to do so. She goes around collecting evidence, even meeting with Jun Hyung. Meanwhile, Kyung Ae gets Min Ho and Kyung Chul together to come up with a plan to get her boys married. They decide to make the boys' competitive nature come out by putting up a tempting prize.","production_code":"","runtime":72,"season_number":1,"show_id":196532,"still_path":"/b0gYSGvxcUgg8SQ7HQ2MiNsav4L.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-04-09","episode_number":3,"episode_type":"standard","id":3635389,"name":"Joining The Race","overview":"The three brothers find themselves being offered an apartment unit for the Marriage Project. Soo Jae is excited to take part in it, but Yoon Jae and Hyun Jae are just baffled by it all. They wonder if they should actually agree to participate in this race. Meanwhile, Mi Rae continues to struggle with cutting ties with Jun Hyung.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/uZUntFc3xuEXTvsuTBepC6wvMv2.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-04-10","episode_number":4,"episode_type":"standard","id":3635391,"name":"Yu Na Changes Her Mind","overview":"Hyun Jae and Mi Rae find out about the assault charge that Jun Hyung filed. Mi Rae is scared that Jun Hyung might cause more trouble in her life. Meanwhile, Yu Na goes to take her exam with Soo Jae's enthusiastic support. However, when things don't go as she planned, she reconsiders Soo Jae's offer.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/6uF4r6ZpJWE0xLYpGGg5qmgu6Wr.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-04-16","episode_number":5,"episode_type":"standard","id":3635392,"name":"Soo Jae Brings Yu Na Home","overview":"Soo Jae's family gets caught off guard when he brings Yu Na home as someone he will marry. However, he casually introduces her to them, and the family's elders become fond of her. Meanwhile, Hyun Jae's mind keeps thinking about the divorce case his ex-girlfriend So Young Eun brought to him that he refused to take on.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/wXcjidSKMy2PgnsXiU6ci2ikeHl.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-04-17","episode_number":6,"episode_type":"standard","id":3635393,"name":"Hyun Jae’s TV Appearance","overview":"Mi Rae does her best to help Hyun Jae with his sudden TV appearance. Hyun Jae thanks her for her support and takes her home, making Mi Rae's parents question their relationship. Meanwhile, Soo Jae's friend asks him about signing a contract for the gym, and Yoon Jae's plans for starring on the dating show don't go as he expected.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/w5bPE5sXjzDZs2UHTZSIvctboMb.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-04-23","episode_number":7,"episode_type":"standard","id":3635396,"name":"Young Eun Re-enters Hyun Jae’s Life","overview":"Hyun Jae feels uncomfortable with Young Eun reentering his life. Mi Rae also feels awkward between the two former lovers. Meanwhile, Hae Jun contemplates what to do about her feelings for Yoon Jae after he gets drunk and passes out on her couch. Soo Jung works hard to persuade Jung Ja to let her bring her mother to live with them.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/v6YmSXMTYc5ZodnryGbTPq4uMoC.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-04-24","episode_number":8,"episode_type":"standard","id":3635397,"name":"Mi Rae Starts Her Own Business","overview":"Soo Jung is upset that Mi Young refuses to come to live with her. Meanwhile, Mi Rae opens up her new office. Despite the happy occasion, she feels bothered by Young Eun as she keeps lingering around Hyun Jae. While Soo Jae and Yu Na continue to sense weird feelings between themselves, Yoon Jae finds himself wanting to see and talk to Hae Jun more and more.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/dNY4gtI1AwF4rJLTlpWeO5JS5lD.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-04-30","episode_number":9,"episode_type":"standard","id":3635399,"name":"Mi Rae Confesses Her Feelings","overview":"Mi Rae regrets showing Hyun Jae her feelings for him. Hyun Jae also feels confused as to how he should react. Meanwhile, Soo Jae and Yu Na's relationship also gets more complicated when he asks her for a kiss. Yu Na also feels guiltier about lying to Soo Jae's family since they're so nice to her. Also, Hae Jun gets upset that Yoon Jae hasn't called her.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/bDQgmuCzGqO4D7ueHePhoFhTChj.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-05-01","episode_number":10,"episode_type":"standard","id":3635400,"name":"Hyun Jae Rejects Mi Rae","overview":"Hyun Jae politely rejects Mi Rae's confession that she likes him. Mi Rae feels sad, despite the fact that she understands where he's coming from. Meanwhile, Soo Jae gets ready to actually marry Yu Na at his mom's insistence. He gathers his brothers to ask for their support, but it only seems to make Yoon Jae and Hyun Jae more competitive.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/9IvYF5VBB0Fyj32exfTfjMMSYJE.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-05-07","episode_number":11,"episode_type":"standard","id":3635402,"name":"Soo Jae And Yu Na Begin A New Relationship","overview":"Mi Rae frantically tries to find her client who has disappeared. Hyun Jae tries to calm her down and helps her out. Meanwhile, Soo Jae and Yu Na confirm their feelings for one another. Although they feel elated about their new relationship, they also feel somewhat confused as to where they are headed in terms of their business deal.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/ad9FAhzOpbIrmhL1mOySR8yO7Ot.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-05-08","episode_number":12,"episode_type":"standard","id":3635403,"name":"Hae Jun And Yoon Jae Start Casually Dating","overview":"Hae Jun goes to meet Yoon Jae, expecting to hear that he likes her. However, all she gets is a lukewarm response, leaving the two in an awkward pre-dating phase. Meanwhile, Kyung Ae goes to talk to Hyun Jae at his office about the marriage project and runs into Hae Jun in the elevator. Later on, Hyun Jae finally realizes what his feelings are for Mi Rae.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/ey2QRiBATSBQoLTgwVTr3EXyz4z.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2022-05-14","episode_number":13,"episode_type":"standard","id":3635405,"name":"Hyun Jae Confesses His Feelings For Mi Rae","overview":"Hyun Jae finally figures out his feelings for Mi Rae and confesses to her. Mi Rae is rather surprised by his sudden confession but not in a bad way. Meanwhile, Soo Jae feels threatened by Yoon Jae's declaration that he has been seeing someone. With the race for the apartment still on, Soo Jae tries to speed things up with his marriage plans.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/giMqEvLoB6LbAPInFcFkhaFR2Rk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-15","episode_number":14,"episode_type":"standard","id":3635406,"name":"Mi Rae Feels Disappointed By Hyun Jae","overview":"Mi Rae feels disappointed when Hyun Jae cancels their plans at the last minute. Hyun Jae feels sorry but goes to attend an urgent meeting with a client, then heads over to see his family. Meanwhile, Kyung Chul keeps the car accident a secret from Min Ho and returns home. Yoon Jae and Hae Jun go on a date on their day off.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/onDw230K0tz7e6wdYCHkz9kyZTq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-21","episode_number":15,"episode_type":"standard","id":3635408,"name":"Hyun Jae Gives Mi Rae Driving Lessons","overview":"Hyun Jae teaches Mi Rae how to drive, but Mi Rae keeps noticing the incoming phone calls from the screenwriter she saw Hyun Jae with at his office. They still enjoy going on dates and spending time together. Meanwhile, Min Ho feels a mix of emotions when he sees Kyung Chul getting teary while talking about his hidden feelings.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/mwj71ev6ECNG8VQ8EncKdTGET2r.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-22","episode_number":16,"episode_type":"standard","id":3635409,"name":"Yu Na’s Guilt Continues To Grow","overview":"Mi Rae feels utterly happy about her relationship with Hyun Jae, but Soo Jung worries that Mi Rae might be hurt. She advises Mi Rae to pace herself in terms of her emotions. Meanwhile, Soo Jae is somewhat bothered by Yu Na's boss, Jung Hoo. Later on, Kyung Ae takes Yu Na to try on wedding dresses, making Yu Na feel guiltier than ever.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/ucdRnTkElpfn7C6hYJUMvl3etxT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-28","episode_number":17,"episode_type":"standard","id":3635410,"name":"Yu Na Has An Outburst","overview":"Kyung Ae is surprised by Yu Na's sudden outburst but soon consoles her. Kyung Ae also tells Soo Jae to ease Yu Na's mind about getting married. Meanwhile, Hyun Jae contemplates what he can do to make Mi Rae feel more assured about their relationship. Yoon Jae wonders why he feels like there's a shift in Hae Jun's attitude.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/ohfj6ATqEx5AqXQYWxysAjhdQMI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-29","episode_number":18,"episode_type":"standard","id":3635411,"name":"Yoon Jae Gets Nervous","overview":"Hyun Jae finishes his song for Mi Rae and runs into Yu Jin. He introduces Mi Rae as his girlfriend and the two officially say hello. Meanwhile, Yoon Jae feels nervous about Hae Jun's attitude towards him, especially after she tells him that her interest in him is now gone. Soo Jae and Yu Na go on dates all across Seoul to taste different kinds of bread at famous bakeries.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/s1S0jYgKRJvcfsgUaFPCZK9ws4q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-04","episode_number":19,"episode_type":"standard","id":3635413,"name":"Yoon Jae And Hae Jun Start Officially Dating","overview":"Yoon Jae and Hae Jun become an official couple after they share a kiss, but Hae Jun worries that Yoon Jae will find out about the lie she told Ms. Sun about him. Meanwhile, Soo Jae gets nervous about both Hyun Jae and Yoon Jae entering into relationships. He rushes to seal the deal on taking over the gym.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/fO2ehbUsHczmmqOvuFH877WuEJq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-05","episode_number":20,"episode_type":"standard","id":3635414,"name":"So Ra Figures Out Who Yoon Jae Is Dating","overview":"Min Ho and his family go to pay their respects at his birth parents' graves. Once they return home, they enjoy a family meal with Kyung Chul and Kyung Soon. Meanwhile, So Ra hears that the woman Yoon Jae is seeing is a patient around Yoon Jae's age. She figures out the identity of this woman, although Yoon Jae tries to deny it.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/nFhjeTvJd2lkJQMiEjQbVZjAKXN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-11","episode_number":21,"episode_type":"standard","id":3635416,"name":"Soo Jae Gets A Strange Feeling","overview":"Hyun Jae suddenly comes knocking at the door, sending Hae Jun and Yoon Jae into a frenzy to hide the evidence that Yoon Jae was there. Hae Jun pretends to be nonchalant as she lets him into the house. Meanwhile, Soo Jae gets a strange feeling when the gym that he took over isn't open. He calls his friend Chang Yeol, but he doesn't answer.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/pbyoAkNXsv0tJ9ix4jdwcSHvqgE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-12","episode_number":22,"episode_type":"standard","id":3635419,"name":"Secret Relationships Revealed","overview":"Hyun Jae is surprised to find out that Yoon Jae and Hae Jun have been dating, and Hae Jun also feels betrayed by Hyun Jae and Mi Rae deceiving all this time. Meanwhile, Yu Na finds it strange when Soo Jae keeps avoiding her calls. She decides to get him a present for his new gym and finds out what he has been hiding from her.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/kaHC160tBTW6YXRT6FT9mHl5WuO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-18","episode_number":23,"episode_type":"standard","id":3635420,"name":"The Double Date","overview":"Yoon Jae hurts his back carrying Hae Jun. Hae Jun feels slightly responsible and treats him the best she can. Meanwhile, Mi Rae nurses Hyun Jae throughout the night at his house. However, Soo Jung notices that Mi Rae still hasn't returned home from work and begins to worry about her.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/nMsAu1369c7CcBLgceb1auv51JR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-19","episode_number":24,"episode_type":"standard","id":3635422,"name":"Yu Na Confesses","overview":"Yu Na can't contain the guilt inside her anymore and tells Kyung Ae the truth. Kyung Ae becomes furious at her betrayal and tells her she doesn't want to see her anymore. Kyung Ae frantically gets a hold of Soo Jae, tells him what she knows, and screams at him to come home. However, Soo Jae doesn't and ignores her calls.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/68WjLyeSVrkPguLjtg4kUQrNEPN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-25","episode_number":25,"episode_type":"standard","id":3635424,"name":"Soo Jae’s Repentance","overview":"Yu Na won't accept Soo Jae's words of breaking up and grabs him from behind. Meanwhile, Soo Jung meets with Hyun Jae but talks to him sternly, showing little amiability toward him and upsetting Mi Rae. Later, Yoon Jae and Hyun Jae try to give Soo Jae the brotherly talk, but in the end, Soo Jae walks out on them.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/u6aaRsN2A2ZY4XAvQMnbh9jY4aB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-26","episode_number":26,"episode_type":"standard","id":3635425,"name":"Soo Jae Worries His Family Again","overview":"Soo Jae suddenly gets detained by police officers and ends up at the police station. Min Ho receives the call about what happened. Soo Jae gets an earful and feels sorry for worrying his family again. However, he knows for sure he wants to be with Yu Na and gives her a call.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/AjoMNFsLocjYzbAQ5Je5nYVpXKK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-02","episode_number":27,"episode_type":"standard","id":3635426,"name":"Yu Na Ends It With Soo Jae","overview":"Yu Na makes up her mind and ends things with Soo Jae. Soo Jae can't stop her from walking away but asks her one last time to reconsider. Meanwhile, Hae Jun proposes marriage to Yoon Jae, but he can't give her an answer. Later, an unhappy client shows up at the law firm to see Hae Jun.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/yMXFyV8BXa4pqsbAPgVxgIhZCjG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-03","episode_number":28,"episode_type":"standard","id":3635427,"name":"Soo Jung Worries About Her Mother","overview":"Mi Young falls out of bed and gets taken to a bigger hospital. Soo Jung receives the call from the doctor and rushes frantically to see her. Meanwhile, Hyun Jae suggests to his father that he should meet Mi Rae for the first time. Later, Yoon Jae formally proposes marriage to Hae Jun and introduces her to the family.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/owGHWVdXNVz6Iu7kW4UVISOzo9q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-09","episode_number":29,"episode_type":"standard","id":3635428,"name":"A Daughter’s Past","overview":"After hearing what Mi Young said, Jin Ju becomes suspicious of Soo Jung's background. She also becomes jealous and spiteful toward Soo Jung when Jung Ja tells her she'd leave the building she owns to Soo Jung. Meanwhile, Kyung Ae gets shocked and displeased when she sees Hae Jun at her house.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/r0UTsrAcnHta9IYMmji4rzb6xw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-10","episode_number":30,"episode_type":"standard","id":3635429,"name":"Jin Ju Confronts Soo Jung","overview":"Kyung Ae meets Mi Rae, but she feels strangely nervous and knocks over a glass of water by accident. Meanwhile, Hae Jun becomes upset at her brother and his wife after meeting them with Yoon Jae, thinking they don't highly support her plans for marriage. However, it's an eye-opener for Yoon Jae.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/laOIBjtG33tKrTFeQpZeBqn1T8n.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-16","episode_number":31,"episode_type":"standard","id":3635430,"name":"Soo Jung Confesses","overview":"Jung Ja can't believe Soo Jung's secret past and almost faints at her confession. Soo Jung leaves the house to stay with her mother at the hospital. Meanwhile, Yoon Jae and Hae Jun march straight ahead with their wedding plans. However, Kyung Ae begins to show her disapproval of their marriage.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/e8uIJ7HYy7iZ5f8Uwwrveg8tpmv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-17","episode_number":32,"episode_type":"standard","id":3635432,"name":"The Family Meeting","overview":"Yoon Jae's shirt explodes as he enters the room with everyone watching, but he manages to pull through the family meeting with the help of his brothers. Hae Jun's brother and her brother's wife say things that don't sit well with Kyung Ae. It bothers her a lot, and she gets into an argument with Yoon Jae. Meanwhile, Hyun Jae meets Jin Heon for the first time while visiting Mi Young at the hospital.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/dvR8AECvMU1EGJmxyEx6Tk71ZSR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-23","episode_number":33,"episode_type":"standard","id":3635433,"name":"Mi Young’s State Becomes Worse","overview":"Mi Young loses consciousness with pneumonia and gets rushed to the intensive care unit. Soo Jung is devastated and doesn't know what to do. Meanwhile, Hae Jun receives a call from a hotel regarding a vacancy for a wedding reservation. Hae Jun and Yoon Jae rush to prepare for their wedding.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/tWYfs8HrysOcyHfoiWGlTTFS1JK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-24","episode_number":34,"episode_type":"standard","id":3635435,"name":"Mi Young Passes Away","overview":"Mi Young takes her last breath and leaves Soo Jung weeping in agony. Hyun Jae gets Mi Rae's call while enjoying Hae Jun's get-together dinner and rushes out to see her. Meanwhile, the superstition of receiving bad luck from attending a wedding after a funeral keeps Hae Jun from showing her condolences and has others worried about attending Hae Jun and Yoon Jae's upcoming wedding.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/pczPJRxJBUm3cfeeEZ8BzyRe815.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-30","episode_number":35,"episode_type":"standard","id":3635437,"name":"The Big, Juicy Peach","overview":"Yoon Jae and Hae Jun successfully wrap up their wedding and head off to a hotel to enjoy the night together. Hyun Jae and Mi Rae catch up on dating and have a wonderful time together. Meanwhile, Kyung Ae comes home from the wedding and has a conception dream in her short nap.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/5juSQOUBUtFXs6OyiPt4suw0Ppp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-31","episode_number":36,"episode_type":"standard","id":3635438,"name":"A DNA Match","overview":"After thinking long and hard about looking for her birth parents, Soo Jung registers her DNA in the missing persons' database and returns home. Meanwhile, Hyun Jae and Mi Rae get ready to tell their families about their engagement and set a date for the family meeting. Later, Soo Jung gets a call from the missing persons' support center with a DNA match.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/9mVRzNKbfX0EFjWtaBq2gYj4CLy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-08-06","episode_number":37,"episode_type":"standard","id":3635439,"name":"Soo Jung Rejects Kyung Chul","overview":"Kyung Chul realizes that Soo Jung is his long-lost daughter, Jung Eun. However, Soo Jung rejects him and leaves him without saying much. Later, Min Ho meets with Soo Jung privately to see if he could change her mind about his father. Meanwhile, Hyun Jae and Mi Rae prepare for their wedding and dream of a happy marriage.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/f1aWgdd0gnmRkRT75SvApC6gcUc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-08-07","episode_number":38,"episode_type":"standard","id":3635440,"name":"Fates Entwined","overview":"After learning that Kyung Chul is Soo Jung's biological father, Jung Ja and Kyung Soon adamantly oppose Hyun Jae and Mi Rae's marriage. The elders tell Hyun Jae and Mi Rae to postpone their wedding without giving them a reason. Hyun Jae and Mi Rae find it suspicious and become anxious.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/n3yTaAnsxrLzza61IypNJq8IqhM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-08-13","episode_number":39,"episode_type":"standard","id":3635441,"name":"Hyun Jae And Mi Rae Take A Time Out","overview":"Hyun Jae gets upset at Mi Rae's words and agrees to stay apart for the time being. However, he expresses to her that he is against breaking up. Meanwhile, Kyung Chul tells Soo Jung about her past while he asks for her forgiveness.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/kTT0j71H39BXgDD0bGQbMhhhtVx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-08-14","episode_number":40,"episode_type":"standard","id":3635442,"name":"Min Ho’s Sacrifice","overview":"Kyung Chul becomes extremely upset at Min Ho after hearing him say he would remove himself from the family register for Hyun Jae's sake. However, Min Ho still thinks it's the only way for everyone to be happy. Meanwhile, Soo Jung develops suspicions about how she came to be the daughter of her late parents.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/nhsxyq49UWS3ryd23idPmYD5iDo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-08-20","episode_number":41,"episode_type":"standard","id":3635443,"name":"Hyun Jae’s Resolve","overview":"Mi Rae tells Hyun Jae they should end things, but Hyun Jae refuses to let go. He determines to do everything he can to make their wedding come true. Meanwhile, Soo Jung reads the letters Kyung Chul had written to her on her past birthdays one by one.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/igKALYm98jtJsjEv8ZMAa6bFqSg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-08-21","episode_number":42,"episode_type":"standard","id":3635444,"name":"Kyung Chul’s Blessing","overview":"Now that things have worked out between Soo Jung, Kyung Chul gives Hyun Jae and Mi Rae his blessing on their wedding. Hyun Jae and Mi Rae are stunned and ecstatic at his words. Meanwhile, Jung Ja is a little upset that nothing was discussed with her before Kyung Chul gave them the go-ahead.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/MNtWoGYcvgLqRfveGpLMPvLpou.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-08-27","episode_number":43,"episode_type":"standard","id":3635445,"name":"Hyun Jae And Mi Rae Get Married","overview":"After having their small wedding reception, Hyun Jae and Mi Rae's families see them off as they leave for their honeymoon. Soo Jae and Jung Hoo get left by themselves to drink and get through the awkwardness. Meanwhile, Yu Na visits her mother and learns her younger brother is in serious trouble.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/bEPOq93FN3Tg46ni7DzHCDZCw3R.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-08-28","episode_number":44,"episode_type":"standard","id":3635446,"name":"An Allergic Reaction","overview":"Yoon Jae apologizes to Hyun Jae for spitting water in his face and calms the situation down. Meanwhile, Hae Jun and Mi Rae shower Kyung Ae with gifts and money to win her heart. Later, Soo Jung and Jin Heon have dinner at Kyung Chul's house, but Soo Jung has an allergic reaction.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/4toAaIvQQgA5ioAMarvXrLTBWQy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-09-03","episode_number":45,"episode_type":"standard","id":3635447,"name":"Competing For Love","overview":"Kyung Ae goes to Yoon Jae and Hae Jun's house and lets her frustration out. Soo Jae takes good care of Yu Na after she hurts her leg to save him. Meanwhile, Hae Jun and Mi Rae compete to win Kyung Ae's love with a hidden secret they can't wait to share.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/5YHs2PTVwJYoSwiPoZyxRa1Txfy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-09-04","episode_number":46,"episode_type":"standard","id":3635448,"name":"Morning Sickness For Yoon Jae","overview":"The family is ecstatic to learn that both Mi Rae and Hae Jun are pregnant, and they celebrate together. However, for some reason, Yoon Jae keeps running to the toilet with morning sickness. Meanwhile, Kyung Ae sees Yu Na and Jung Hoo together grocery shopping and worries about Soo Jae.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/rASj2NakWgjU3Yw7QXLvgimIXPB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-09-10","episode_number":47,"episode_type":"standard","id":3635449,"name":"Saving Soo Jung","overview":"After learning that Soo Jung has liver cancer, Jin Heon falls into shock. However, Soo Jung tells him they should keep it a secret from Hyun Jae and Mi Rae for the time being. Meanwhile, Kyung Ae begins to feel sorry for Yu Na but also worries she might start seeing Soo Jae again.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/q1PdD9XAVTK6WqpNyYarA0GDe0V.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-09-11","episode_number":48,"episode_type":"standard","id":3635450,"name":"A Home Cooked Meal","overview":"Mi Rae finds out Soo Jung has cancer and drops to the floor. She is devastated that she can't help her mother. Hyun Jae learns about Soo Jung and offers to get tested for donor compatibility. Meanwhile, Soo Jung invites Kyung Chul, Min Ho, and Kyung Ae for a homecooked meal despite the distressing mood.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/kMYUTgV706Sao9Hwq6PzLMAQO4t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-09-17","episode_number":49,"episode_type":"standard","id":3635451,"name":"Kyung Chul Faints","overview":"Kyung Chul faints and gets rushed to the hospital. Soo Jung is shocked at the news and urgently goes to the hospital to see him. Meanwhile, Kyung Ae is upset at Hyun Jae for getting the compatibility test done without discussing it with her first. Although he explains that this is what he wants, the idea doesn't sit well with everyone.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/mN0vFZRBKe8tZLsDs5hPQXI8PjP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-09-18","episode_number":50,"episode_type":"finale","id":3635452,"name":"Out Of Time","overview":"Soo Jung's health deteriorates, and she gets admitted to the hospital. Everyone worries for her well-being, especially Hyun Jae, who is determined to convince Kyung Ae and Soo Jung to accept his decision to be the liver donor. Fortunately, Kyung Ae has a change of heart, and she decides to talk with Soo Jung.","production_code":"","runtime":70,"season_number":1,"show_id":196532,"still_path":"/3oZNM3Lr66LktIACznXUE1H4r1y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Kyung Chul is the grandfather and spiritual leader of the Lee family. He became a widower at a young age and also lost his daughter. When he was at his lowest, he adopted Min Ho, and the two have maintained a strong familial bond ever since. Along with Kyung Chul, Min Ho and his wife Kyung Ae want their three sons, who have all grown up to be decent young men with good jobs, to get married and have bustling families soon. Kyung Chul makes his grandsons a big offer. The first one to get married will get an apartment.","id":285832,"poster_path":"/9AQ94tFirqWX8Ob9Z1ycM7upCoD.jpg","season_number":1,"vote_average":7.3}}}