{
    "adult": false,
    "backdrop_path": null,
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2008-04-16",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "",
    "id": 19688,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2013-01-24",
    "last_episode_to_air": {
        "id": 576650,
        "name": "Scream",
        "overview": "Slasher film Scream, released in 1996 went on to spawn one of the most successful horror franchises in film history taking in in excess of 400 million dollars in the United States alone. The sadistic killer and his iconic mask have entertained and terrified audiences around the world. With Nightmare on Elm Street director Wes Craven at the helm, the first Scream film is credited with revitalizing the horror genre. Scream blended slasher violence with murder mystery and it played on the stereotypes and conventions of classic horror films breathing new life into the genre. Although the plot of the masked, small town serial killer targeting high-school students and picking them off one-by one may seem like pure Hollywood fiction it was partly inspired by true events and a real masked murderer who terrified students in a small town.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2013-01-24",
        "episode_number": 4,
        "episode_type": "standard",
        "production_code": "",
        "runtime": null,
        "season_number": 5,
        "show_id": 19688,
        "still_path": null
    },
    "name": "The True Story",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 65,
            "logo_path": "/9fGgdJz17aBX7dOyfHJtsozB7bf.png",
            "name": "History",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 36,
    "number_of_seasons": 5,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "The True Story",
    "overview": "The True Story is a documentary series shown on History in the United Kingdom and on the Smithsonian Channel in the US under the name The Real Story.",
    "popularity": 2.181,
    "poster_path": null,
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2003-04-17",
            "episode_count": 21,
            "id": 29964,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2008-04-16",
            "episode_count": 8,
            "id": 29965,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2007-02-27",
            "episode_count": 11,
            "id": 29966,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2012-02-12",
            "episode_count": 4,
            "id": 29967,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": null,
            "episode_count": 8,
            "id": 29968,
            "name": "Season 4",
            "overview": "",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": null,
            "episode_count": 5,
            "id": 29969,
            "name": "Season 5",
            "overview": "",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "52585bd8760ee34661108f18",
            "air_date": "2008-04-16",
            "episodes": [
                {
                    "air_date": "2008-04-16",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 576616,
                    "name": "Indiana Jones: The True Story",
                    "overview": "Documentary from award-winning director David Hickman exploring how the story of Indiana Jones was inspired by the real exploits of Roy Chapman Andrews - an American explorer and naturalist. Andrews was best known for a series of perilous expeditions to the Far East that resulted in a number of important discoveries - much like the star of Spielberg's famous movie series.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-04-23",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 576617,
                    "name": "James Bond: The True Story",
                    "overview": "A documentary chronciled the life of James Bond creator Ian Fleming and what led him to create his famous spy.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-04-30",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 576618,
                    "name": "Escape from Alcatraz: The True Story",
                    "overview": "Historical documentary examining a remarkable escape attempt from Alcatraz prison. In June 1962, three inmates successfully broke out of the jail and took to the waters of San Francisco Bay in a makeshift raft, never to be seen again.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-05-07",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 576619,
                    "name": "Al Capone and the Untouchables: The True Story",
                    "overview": "Using interviews, exclusive footage and dramatic reconstructions, this documentary explores the true story of how a small group of law enforcers led by Eliot Ness brought down notorious Mafia boss Al Capone in 1930s Chicago.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-05-14",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 576620,
                    "name": "Amityville Horror: The True Story",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-16",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 576621,
                    "name": "The Hunt For Red October: The True Story",
                    "overview": "The historical documentary series returns for a new run on Five. The first instalment explores the real-life events that inspired the Tom Clancy novel and film, ‘The Hunt for Red October’. In 1975, disgruntled Soviet officer led a mutiny on board a state-of-the-art Russian warship. Unlike the movie captain portrayed by Sean Connery, this maverick sought to cause a revolution in his own land – and almost sparked a war in the process.\n\nIn 1984, an insurance salesman-turned-author named Tom Clancy published his bestseller, ‘The Hunt for Red October’. The book, and the 1989 film starring Sean Connery, depicted the hijacking of a Russian nuclear submarine by a Soviet captain determined to defect to the West. Yet, as this\n\ndocumentary reveals, the story that inspired Clancy’s fiction was equally dramatic.\n\nClancy’s book had its roots in an uprising on the Soviet frigate Storozhevoy, or Sentry, in November 1975. The mutiny was instigated by Political Officer Valery Sablin, the second-in-command, who had grown unhappy with corruption in the Soviet state. “He saw the party elite line their pockets with oil contracts and diamond mines,” explains historian Gregory Young.\n\n \n\nInfuriated by a state of affairs that saw workers living in poverty, Sablin, a committed communist, decided to spark a new revolution. Sablin’s plan was to seize the Sentry in Riga and sail it up the Baltic Sea to Leningrad, where he would launch an uprising. He began by locking the captain in a compartment and calling the ship’s 16 officers to a meeting. With impassioned rhetoric, Sablin tried to persuade them to back the mutiny. “It really was the speech of his life,” says Young.\n\n \n\nIn the event, the officers were split down the middle. Some, including Lt Boris Gindin, saw folly in the plan. “He was going against the military Russian machine that could destroy you in a second,” he says. Gindin and seven others were locked in the hold by the plotters. However, Sablin’s plan to sail out of Riga as part of a convoy was dashed when one of the officers who had voted to back him slipped off the ship and went to raise the alarm. Sablin had no choice but to sneak out of the harbour and head for international waters.\n\n \n\nWhen the military learnt of the mutiny, they immediately assumed that Sablin was trying to defect – with nearby Sweden his likely destination. Russia’s leaders, including the premier, Leonid Brezhnev, knew they could not risk letting the Sentry fall into enemy hands. Although the ship had no nuclear capability, its state-of-the-art design was still unfamiliar to western intelligence. The officers locked in the ship’s belly were well aware that Russia would sooner sink the vessel than let itescape. “We were very scared because we knew that the Russian government would never let us go,” recalls Gindin.\n\nRussia launched boats and planes to scour the area. They were assisted by a dense fog, which forced Sablin to switch on his radar – thus alerting the military to his location. The pursuit was also being watched by the Swedish military, uncertain if they were witnessing an invasion. As the entry neared a busy shipping lane, the danger of a Russian plane attacking the wrong vessel increased. “If a merchant ship or a ferry had been hit, there would have been a really major crisis,” says Professor Eric Grove.\n\n \n\nThe turning point came when Russian jets launched an assault on the Sentry. Sablin ordered his crew not to fire back and, in the confusion, sailors opted to release the Sentry’s captain. The mutineers were rounded up and the ship returned to Russia. Sablin was later executed and the crew members were demoted or discharged. Sablin’s co-conspirators now look back on his bold plan with mixed feelings.\n\n \n\nReflecting on the book inspired by these events, Gregory Young remarks: “The true story of a political officer not leaving his motherland but determined to change his motherland... is a better story.”",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-12-27",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 576623,
                    "name": "The Bourne Identity",
                    "overview": "This documentary explores the real-life CIA history that inspired the Jason Bourne movies. Robert Ludlum’s amnesiac super-spy is a highly skilled secret agent, trained to work secret ‘black ops’. The origins of his character lie in genuine CIA programmes to brainwash people into becoming assassins – including shocking experiments that endangered the lives of psychiatric patients.\n\nJason Bourne is the super-skilled CIA spy with no memory of his past life. He is trained to  assassinate enemies of the USA without the knowledge of the government. Bourne was created by author Robert Ludlum and portrayed by Matt Damon in a trilogy of films beginning with 2002’s ‘The Bourne Identity’.\n\n \n\nLudlum used his contacts within the CIA to make his novels as realistic as possible. He even used a real-life assassin, Carlos the Jackal, as the villain. For the first Bourne movie, director Doug Liman was inspired by another true story. He changed the villain from an individual to an organisation – a secret cell within the CIA known as ‘Operation Treadstone’. He based this cell on the one exposed by the Iran-Contra affair in the 1980s, when members of the CIA were found to be operating black ops in Nicaragua.\n\nLiman had a personal connection with the Iran-Contra scandal because his father led the investigation. “I got to see how spies worked in the real world,” he says. “Bourne wouldn’t be Bourne if it weren’t for the fact that my father ran this investigation.” The guilty parties in the Iran-Contra\n\naffair provided the template for the villains in ‘The Bourne Identity’.\n\nLiman also ensured that Jason Bourne’s skills matched those of elite agents – including his stunt driving skills and his ability to fight in confined spaces. “He keeps moving, he’s got good balance and he uses whatever’s around him to accomplish his mission,” says combat instructor Brandon\n\nSommerfield. Bourne is primed to withstand torture techniques such as waterboarding.  Remarkably, real-life agents are trained the same way.\n\nAnother key piece of Bourne’s character is his inability to recall his identity. He is a ‘Manchurian Candidate’ – an operative brainwashed to become the perfect assassin. Incredibly, the CIA spent over 20 years trying to create just such an agent. Recently opened files show that these experiments began in the 1950s, when the US military suspected the Chinese of brainwashing soldiers. They resolved to develop mind-control techniques of their own.\n\n \n\nThe MKULTRA programme began by looking at hypnosis. In one experiment, a nurse was hypnotised into firing an unloaded gun at a woman. Yet hypnosis was soon found to be unreliable, so doctors turned to mind-altering drugs – including LSD. In one task, employees spiked each other’s drinks without their knowledge.\n\nA disturbing phase of tests began when CIA doctors experimented on mentally ill patients. “Psychiatric patients are a good group to experiment on because they’re disenfranchised, disempowered and they’re very easy to discredit,” says Dr Colin Ross. In the early 70s, schizophrenic Karen Wetmore spent seven months in a straitjacket under the ‘care’ of CIA doctors. On one occasion, she was given 35 electro-shocks in 40 seconds, in what may have been an attempt to induce amnesia. “I just remember wondering what I had done to be treated like this,” Karen says.\n\n \n\nIn 1975, the US Senate put an end to the programme. Yet critics argue that the CIA has continued  its efforts to harness mind control by experimenting with electromagnetic fields. Meanwhile, the issue of assassination has returned in force, with the US Government’s efforts to eliminate members of Al-Qaeda in the wake of 9/11. Doug Liman believes the public remains ambivalent on the issue – comparing it to the slaughter of animals. “We’re grateful for the meat,” he says. “Just don’t tell us how you did it.”",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-01-07",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 576622,
                    "name": "Silence of the Lambs",
                    "overview": "Silence of the Lambs tells the story of a young ambitious FBI profiler Clarice Starling as she pursues the serial killer Buffalo Bill with the help of convicted psychopath Hannibal Lecter.  \n\nWhile researching the book on which the film was based, author Thomas Harris spent days with the FBI’s pioneering Behavioural Science Unit, questioning criminal profilers and immersed in the case-files of serial killers. \n\nNow, we reveal the movie’s real-life inspirations: serial killer Ted Bundy who, like psychiatrist Lecter, evaded capture with his charming, young lawyer persona; Ed Gein, whose sickening crimes echo the movie exploits of Buffalo Bill; and a young female FBI agent who helped Harris create Agent Starling. \n\nWe also explore how Silence of the Lambs revolutionised the make-up of the profession, inspiring many women to become profilers, and reveal chilling footage of one such female entrant interviewing Gary Ridgway, considered America’s most prolific serial killer.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 29965,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "52585bd8760ee34661108f23",
            "air_date": "2007-02-27",
            "episodes": [
                {
                    "air_date": "2007-02-27",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 576624,
                    "name": "The Boston Strangler",
                    "overview": "Exploring the truth behind the murders of several women in Boston, Massachusetts, in the early 1960s. Were they the work of one person?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-03-13",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 576625,
                    "name": "Bermuda Triangle",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-03-20",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 576626,
                    "name": "Pirates Of The Caribbean",
                    "overview": "The truth behind the swashbuckling pirate Blackbeard and revealing the real pirate ship and tales that inspired the action in the series of films starring Johnny Depp.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-11-20",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 576627,
                    "name": "Blood Diamonds",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-11-13",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 576628,
                    "name": "Jonestown Cult Suicides",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-04-24",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 576629,
                    "name": "The Philosopher's Stone",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-12-04",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 576630,
                    "name": "Olympic Massacre",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-04-03",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 576634,
                    "name": "The Anastasia Mystery",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-02-06",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 576631,
                    "name": "Frankenstein",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-12-10",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 576632,
                    "name": "Casino",
                    "overview": "The historical documentary strand continues with an exploration of the events that inspired the Martin Scorsese movie ‘Casino’. The 1995 film was based on the true story of a murderous enforcer who ruled Las Vegas for the Chicago mob. Only a highly organised FBI operation was able to expose the criminal tentacles flowing through the city’s underbelly.\n\nIn the 1970s, Las Vegas was ruled by the Chicago mob. Around $1million was siphoned from the top three casinos each month to line the pockets of mob bosses in the Windy City. One of the mafia’s key men in Vegas was a ruthless enforcer named Tony Spilotro, who inspired the Nicky Santoro character played by Joe Pesci in ‘Casino’. Spilotro was sent to protect the mafia’s take – known as the ‘skim’ – from light-fingered employees.\n\n \n\nDespite orders to keep a low profile, Spilotro fuelled a wave of violence. In his first three years in Vegas, more people died in gangland murders than in the previous 25. Spilotro also established his own burglary ring – the ‘hole-in-the-wall gang’ – which targeted wealthy homes in the suburbs. By 1979, Spilotro’s activities had come to the attention of the FBI, who were keen to impose law and order on the desert town. “We had to come in here and replant the American flag,” recalls former agent Emmett Michaels.\n\nA huge FBI surveillance operation recorded thousands of hours of illicit conversations. Agents even dressed up as maintenance men in order to infiltrate mob dens and plant bugs. In late 1979, an increasingly paranoid Spilotro learned that one of his underlings, Jerry Linser, had turned informant. He ordered his right-hand man, Frank Cullotta, to deal with Linser. “I went over to Linser’s house that same night, I opened up the door and that’s when I proceeded to kill him,” recalls Cullotta.\n\n \n\nBy killing a state’s witness, the mobsters had raised the stakes. The FBI redoubled its efforts and began to follow the money flowing from Vegas to Chicago. Agents watched casino employee Phil Ponto deliver a package to a Chicago mobster. Meanwhile, local police turned up the heat on Spilotro by tailing him everywhere he went. This resulted in the fatal shooting of one of Spilotro’s associates by a Las Vegas cop.\n\n \n\nSpilotro’s response was to put a contract on the lives of the two cops involved in the shooting. Police commander Kent Clifford, a tough Vietnam veteran, became personally involved. “I’d been in war, I’d been shot at... so I wasn’t afraid of Tony Spilotro,” he says. Clifford flew to Chicago to warn Spilotro’s bosses not to harm the two police officers. Remarkably, the Chicago bosses agreed to his request and overruled their enforcer.\n\nUndeterred, Spilotro plotted a heist on a jewellery store. But the shop was under surveillance and  the hole-in-the-wall gang – including Frank Cullotta – was captured by the FBI in one fell swoop. Cullotta subsequently agreed to become a state’s witness when he heard that Spilotro had  ordered his death. “I knew then that Tony wasn’t on my side,” he says.\n\n \n\nHowever, the FBI still needed to prove that the money going to Chicago came directly from the casino floor. Agent Michaels went undercover in the casino and proceeded to gamble away  thousands of dollars in marked bills. Investigators hoped that some of these bills would show up when the Chicago delivery was intercepted. But on the day of the sting, Phil Ponto was found to be carrying nothing more than a box of cookies and a bottle of wine. Someone had tipped the gang off. “It was a bad day for the FBI,” recalls agent Lynn Ferrin.\n\n \n\nThe FBI regrouped and turned its attention to the casinos’ paper trail. The strategy paid off spectacularly when agents discovered the mafia had been forging documents to cover up their skim. The mob’s control of Vegas suffered a fatal blow and Tony Spilotro paid the ultimate price. In 1986, he was found buried in an Indiana field. Spilotro’s former nemesis, Kent Clifford, sheds no tears. “He was bad for society,” he...",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-12-16",
                    "episode_number": 11,
                    "episode_type": "finale",
                    "id": 576633,
                    "name": "The Exorcist",
                    "overview": "This documentary explores the real-life incident that inspired the 1973 film ‘The Exorcist’. In 1949, Catholic priests attempted to exorcise a 13-year-old boy who was seemingly possessed by demons. The event inspired William Peter Blatty to write his bestselling novel, but modern-day scientists now pour doubt on the veracity of the tale.\n\nIn 1949, a 13-year-old boy in Cottage City, Maryland was apparently possessed by demons. The boy, who has never spoken about his ordeal and has never been identified, demonstrated extreme behaviour shortly after the death of his beloved aunt. The family experienced strange  noises around the house and the boy’s bed began to shake violently. After bizarre markings appeared on his skin, the parents turned to the local hospital for help. When this proved fruitless, they called upon local priest Father Albert Hughes.\n\nThe late Father Hughes’s colleague, Father Frank Bober, recalls the priest’s first meeting with the boy. “He noticed a very dark stare – almost as if there was nothing behind the eyes,” he says. When Hughes asked the boy his name, he replied, “I am legions” – indicating that numerous spirits had taken up residence inside his body. Hughes attempted the then little-known practice of\n\nexorcism to dispel the demons – to no avail.\n\nThe family sought treatment in St Louis, where a priest named Father William Bowdern decided to embark upon nightly exorcisms. “Father Bowdern doesn’t want to do it. He doesn’t feel he has the training, but he feels obliged to help the kid,” explains author Tom Allen. The exorcism lasted six weeks, during which time the child swore, struggled and displayed fits of seemingly superhuman strength. Then, abruptly, his symptoms ended. The boy and his family returned to a life of relative obscurity.\n\nDecades later, author William Peter Blatty became fascinated by the tale. After reading Bowdern’s diary, he received a letter from the priest. At the end of the letter, the priest asserted his belief in the truth of what he had seen. “Had it not been for that last sentence and the fact that he had kept a detailed diary, I would not have written the novel,” says Blatty. The resulting book and film reignited interest in the centuries-old practice of exorcism.\n\n \n\nHowever, scientists now believe they can explain the boy’s symptoms without resort to the supernatural. Neuroscientist Professor Michael Persinger insists that the brain holds the key. “When it comes to religious experience, the brain generates all behaviours, no matter how  mystifying they may be,” he says. Persinger believes the abrupt loss of the boy’s aunt at a vulnerable stage in his brain’s development may have prompted his bizarre behaviour.\n\n \n\nIn Persinger’s view, the nightly “harassment” of the exorcism created a frenzied state that led to the seizures. “The treatment itself causes the phenomenon,” he explains. Experiments have\n\nshown that disrupted brainwaves can cause subjects to detect a “Godly presence”, which sometimes manifests itself as a malevolent force.\n\n \n\nDespite these theories, 40 per cent of American adults – including William Peter Blatty – say they believe in demonic possession. The Catholic church now offers exorcism training to its priests.  Father Thomas Euteneuer is an officially sanctioned exorcist. “I just love to see people become free of their evil through the power of the church,” he says. This film includes remarkable footage of a modernday exorcism. Persinger, however, warns that exorcisms can harm the treatment of people with serious mental disorders. “I see the risks associated with maintaining a fallacy,” he  says. “People are responsible for their behaviour, not bad influences.”",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 29966,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "52585bd8760ee34661108f2e",
            "air_date": "2012-02-12",
            "episodes": [
                {
                    "air_date": "2012-02-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 576635,
                    "name": "True Grit",
                    "overview": "Experts look into the reality behind True Grit, the 1968 Charles Portis story that has been given the Hollywood treatment twice.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 576636,
                    "name": "Saving Private Ryan",
                    "overview": "Historians, eye-witnesses, weapons and forensics experts provide compelling new insights into the facts behind the classic film.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 576637,
                    "name": "Braveheart",
                    "overview": "A look at how close Mel Gibson's epic film is to the true story of Sir William Wallace. Has the film changed the image of this Scottish hero?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-28",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 576638,
                    "name": "Apollo 13",
                    "overview": "This documentary reveals how Hollywood turned a disaster that NASA feared would always be an embarrassing stain on its reputation into a fascinating tale.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 29967,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "52585bd8760ee34661108f39",
            "air_date": null,
            "episodes": [
                {
                    "air_date": null,
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 576639,
                    "name": "Waynes World",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-29",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 576640,
                    "name": "Jaws",
                    "overview": "Steven Spielberg’s Jaws is one of the most successful movies of all time. According to the author of the novel behind the movie, the story is based on a spate of shark attacks off the cost of New Jersey in 1916, which left four people dead. The savageness of the attacks dramatically altered the scientific view of Great Whites. And Jaws cemented their reputation as terrifying man-eaters. \n\nMore recently however, new evidence shows that the Great White may have been unfairly blamed for the 1916 attacks.  \n\nThis documentary conducts new scientific tests using handwritten descriptions of the wounds of the 1916 victims. And, returning to the scenes of the attacks, it explores whether a Great White could really have come so close to land, finally revealing the identity of the real culprit.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-01-07",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 576642,
                    "name": "Titanic",
                    "overview": "Titanic is one of the top grossing movies of all time. Apart from the love story, most of the background events are accurate – with great attention to detail. \n\nBut the culmination of a three year research project has revealed a new discovery.  Another ship steamed to within five miles of the stricken liner and could have saved all aboard. Instead, on the orders of its fearful captain, it turned back, leaving the passengers to drown. Survivors of the wreck recalled seeing a “mystery ship” which refused to come to their aid. For decades the wrong man, Captain Stanley Lord of the Californian, bore the blame. \n\nNow, for the first time on television, we set the record straight, cross-referencing eye witness testimony from 1912, with Bob Ballard’s discovery of where the Titanic sank. We draw on archive footage, and present an astonishing voice recording that Captain Lord made in 1961, in which he reveals the identity of the man who abandoned the drowning passengers.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 576641,
                    "name": "Silence Of The Lambs",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 576643,
                    "name": "Gladiator",
                    "overview": "The historical figures who inspired the characters in the Ridley Scott film Gladiator, including Emperor Commodus, who in reality was even crueller than Joaquin Phoenix's on-screen portrayal.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-01-18",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 576644,
                    "name": "Jurassic Park",
                    "overview": "This documentary reveals the science behind Jurassic Park is based on rigorous scientific research and that the key character at the centre of the film is inspired by a real life individual. The vision of how dinosaurs could be bought back to life has now been shown to be impossible. But this documentary will feature recent remarkable breakthroughs in biology that would allow dinosaurs to walk again. Using cutting edge evolutionary biology, scientists are getting closer to bringing the dinosaur back to life.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-10-15",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 576645,
                    "name": "Close Encounters of the Third Kind",
                    "overview": "The movie was an instant smash when it hit the theaters in 1977 and reawakened man's obsession with the eternal question: \"Are we alone in the universe?\" Though a work of fantasy, few realize that Steven Spielberg's sci-fi classic was actually inspired by real-life witness testimony, as well as a series of UFO sightings in Michigan in the summer of 1966. Separate science fact from science fiction as we re-examine government documents and put old witness testimonies to the test using modern technology. http://www.smithsonianchannel.com/site/sn/show.do?series=679#episodes",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-08",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 576646,
                    "name": "Master and Commander",
                    "overview": "Master and Commander: The Far Side of the World premiered in 2003 and received 10 nominations for Academy Awards, including best picture. It was directed and co-written by celebrated Australian director Peter Weir, famous for movies The Truman Show and Dead Poets Society. The movie was drawn from the 20-volume series of seafaring novels by Patrick OBrian, following the exploits of Captain Jack Aubrey [Russell Crowe] and his close friend, surgeon Stephen Maturin [Paul Bettany]. OBrian’s novels were meticulously researched, and closely follow historical events. But in distilling 20 volumes down to a single feature the team behind the movie had to not only borrow incidents from several books, but also further bend the historical framework for creative effect. So the events of the movie are set in 1805 – when Britain fought the French – rather than 1812, when Britain was at war with the United States.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "",
            "id": 29968,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "52585bd8760ee34661108f44",
            "air_date": null,
            "episodes": [
                {
                    "air_date": null,
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 576647,
                    "name": "Star Trek",
                    "overview": "see Discovery Documentaries Season 2012 Episode 20 * I respectfully disagree. It makes much more organizational sense to keep these shows together here rather than randomly inserted within the larger DC docs. It is still the same show even though it has moved from History Channel to Discovery.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 576648,
                    "name": "Platoon",
                    "overview": "Actor Willem Dafoe and director Oliver Stone talk about the Oscar-winning 1986 film about the Vietnam War. Platoon hit the silver screen in 1986 on a small budget with a cast of then unknown actors but gained worldwide acclaim for its gritty portrayal of the horrors of the Vietnam War. Oliver Stone wanted Platoon to be the most realistic war movie of all time and it was based on his own experiences as a solider in the conflict.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 576649,
                    "name": "Die Hard 4.0",
                    "overview": "The much anticipated fourth instalment of the Die Hard franchise sees a slightly aged - but just as capable New York Cop John McClane (Willis) take on the sophisticated cyber-criminal mastermind Thomas Gabriel (Timothy Olyphant). Gabriel holds the United States to ransom as he wreaks havoc by shutting down the country remotely via the internet and only McClane can stop him. The True Story examines how likely large scale cyber terrorism actually is and what steps are being taken to stop it. In Die Hard 4.0 the cyber-attack is codenamed ‘Fire Sale’ – a term now actually being used among hacker communities.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 576650,
                    "name": "Scream",
                    "overview": "Slasher film Scream, released in 1996 went on to spawn one of the most successful horror franchises in film history taking in in excess of 400 million dollars in the United States alone. The sadistic killer and his iconic mask have entertained and terrified audiences around the world. With Nightmare on Elm Street director Wes Craven at the helm, the first Scream film is credited with revitalizing the horror genre. Scream blended slasher violence with murder mystery and it played on the stereotypes and conventions of classic horror films breathing new life into the genre. Although the plot of the masked, small town serial killer targeting high-school students and picking them off one-by one may seem like pure Hollywood fiction it was partly inspired by true events and a real masked murderer who terrified students in a small town.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 576651,
                    "name": "The Da Vinci Code",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 19688,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "",
            "id": 29969,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        }
    }
}