{"adult":false,"backdrop_path":null,"created_by":[{"id":6869,"credit_id":"52586385760ee34661150d9d","name":"Mike Fleiss","profile_path":null}],"episode_run_time":[60],"first_air_date":"2003-01-05","genres":[{"id":10764,"name":"Reality"}],"homepage":"","id":20546,"in_production":false,"languages":["en"],"last_air_date":"2010-03-03","last_episode_to_air":{"id":586645,"name":"PROMises of Love","overview":"","vote_average":0,"vote_count":0,"air_date":"2010-03-03","episode_number":8,"episode_type":"finale","production_code":"","runtime":60,"season_number":6,"show_id":20546,"still_path":null},"name":"High School Reunion","next_episode_to_air":null,"networks":[{"id":397,"logo_path":"/lOCn3EqluXoP8olsZsJHoWITwQJ.png","name":"TV Land","origin_country":"US"}],"number_of_episodes":43,"number_of_seasons":6,"origin_country":["US"],"original_language":"en","original_name":"High School Reunion","overview":"High School Reunion is a reality television series chronicling real-life high school reunions.\n\nThe program originally aired on The WB for two seasons between 2003 and 2005, and featured reunions of classes after ten years.\n\nA new version of the series began airing on TV Land on March 5, 2008, focusing on the 20-year reunion of the 1987 graduating class of J.J. Pearce High School in Richardson, Texas. Filmed in Maui, the series featured documentary-style interviews with the classmates, who are assigned \"labels\" to describe their high school roles.\n\nThe series returned to TV Land in February 2009 with members of the Class of 1988 of Chandler High School in Chandler, Arizona reuniting and the promise that one of them would reveal a major secret. Once again class members had labels such as \"The Class Clown\", \"The Cowboy\", etc.\n\nThe series returned with its third season premiering on January 13, 2010. It follows the members of the Class of 1989 of Chaparral High School in Las Vegas, Nevada.","popularity":3.057,"poster_path":null,"production_companies":[],"production_countries":[],"seasons":[{"air_date":"2003-01-05","episode_count":6,"id":30581,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2004-03-14","episode_count":8,"id":30582,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2004-12-07","episode_count":7,"id":30583,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2008-03-05","episode_count":6,"id":30584,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2009-02-18","episode_count":8,"id":30585,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0},{"air_date":"2010-01-13","episode_count":8,"id":30586,"name":"Season 6","overview":"","poster_path":null,"season_number":6,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Reality","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"52586382760ee34661150a41","air_date":"2003-01-05","episodes":[{"air_date":"2003-01-05","episode_number":1,"episode_type":"standard","id":586603,"name":"Episode 101","overview":"Tonight we get to meet some of the Class 1992 (and let me add...they are quite attractive)    *Jeff, the class clown, is going back to hook up and have sex    *Holly, the shy girl is going back because everyone thought she was stuck up.  (She's done a layout in Playboy) She wants them to know they were all wrong   *Chris was the misfit.  His objective is to hit on as many of the girls as possible   (Sounds like the guys have one objective to share)   *Patricia was considered the gossip.  She wants to prove she is on her way to success.   *Tim was the artist.  He's now in a band.   *Ben was the nerd.  He wants to change that perspective to the others.   *Amy was the chubby cheerleader.  She wants to meet or re-meet a fabulous guy.   *Jason was the pip-squeak.  He's now HUGE and a police officer.  He wants them to know he's now a man.   *Summer was the class flirt.  She tells us we can expect pretty much the same and to expect to see a typical 16 year old flirt in her now.   *Dan B was t","production_code":"","runtime":60,"season_number":1,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-12","episode_number":2,"episode_type":"standard","id":586604,"name":"Episode 102","overview":"As the day progresses, the tension seems to ease a little and they seem to be a little more comfortable, until Dan and Natasha hang out together.  In the fifties, they would call it making time.","production_code":"","runtime":60,"season_number":1,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-19","episode_number":3,"episode_type":"standard","id":586605,"name":"Episode 103","overview":"Day Five:  Rise and shine   The kitchen seems to be the place all great ideas are made in the house.  During this episode, it is not any different.  This time the idea is breakfast in bed for Holly (the shy girl).  Well, not just breakfast in bed, but it will be delivered naked.\n\nTim and Summer seem to be enjoying this newest idea.  Tim is the designated naked guy.  He gets the tray and heads into her room.  She is shocked, but seems to get a kick out of it.\n\nHolly tells the camera they all thought she was conservative in High School.  (Others to the camera commenting on her Playboy pictures describe her as HOT!)\n\nDave is bound and determined to ask Holly out if he gets a Hall Pass.\n\nOn the beach hanging out.   Ben is just being Ben.  Ben says he's going with nice.  Ben says that nice guys finish last.  (awww...)   To the camera, Natalie says that when Ben is around her he has a lot of nervous energy.  Ben just wants to gain some respect from his former classmates.\n\nBoxing Gear Arrives   Th","production_code":"","runtime":60,"season_number":1,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-02","episode_number":4,"episode_type":"standard","id":586606,"name":"Episode 104","overview":"Day Eight: Rumor Mill   The host comes to the house and gathers them together.  They get to set straight some high school rumors or rumors floating around the house.  At a house there is a podium set up for them to ask questions without a name attached to who wrote the question.  They can go there anytime (it appears to write and submit a question until they are called back together).\n\nPayback   Natasha and Patricia discuss the whole Summer pulling down Dan's pants thing that happened the night before.  (They were all drinking and getting wild and Summer with Tim and another decided to play a joke on Dan who had fallen asleep ;-) in the living room.  They ended the joke when they realized that Dan didn't have underwear on under his pants and didn't remove them)   Back to the girls, Patricia thinks that the note Summer received has made her confidence level increase.  Natasha does not like it one bit and vows to pay her back.  (While they are talking, Nicole, who has a problem with Natas","production_code":"","runtime":60,"season_number":1,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-09","episode_number":5,"episode_type":"standard","id":586607,"name":"Episode 105","overview":"Day 11 And the End is Drawing Near   Mike Richards (the host) calls the group together.  He tells them they have something special in store for some of them.  24 hour hall passes.  They just need to sign up for them as a couple and then bids them farewell and leaves.\n\nBack at the house   They have all dubbed the passes as the Sex Pass\n\nSummer invites Jeff who refuses.  (Not sure if either of them were for real or not)\n\nThe Popular Girls discuss the passes   Maya says her and Ben have been touch and go since their date.  She isn't sure if he's interested. (Of course he is!  He's just shy)   They are all excited about the passes\n\nElsewhere, Dave gets his nerve up to ask Holly.  She accepts and says she would love to spend more time with Dave.  They kiss as the others look on and then clap.  WOOHOOOO Holly and Dave are signing up!\n\nJeff almost acts like he might ask Amy, but then goes off in a different direction and doesn't.\n\nJason goes to find Patricia who is still with the Pop girls.  He g","production_code":"","runtime":60,"season_number":1,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-16","episode_number":6,"episode_type":"finale","id":586608,"name":"Episode 106","overview":"Day 13    Only One Day to go and the passholders return home   Dave and Holly return home from their 24 hour pass first.  They are greeted by all the others still at the house.  Tim tells Holly that he's asked Summer to the prom.\n\nMaya says to the camera that they had a good kiss (she and Ben).  Ben says that she seemed interested.  Prom will help them make a decision, Maya says.\n\nDan tells the camera that they had a fantastic time while Natasha says she doesn't know what will happen and is again thinking about home (and that boyfriend she has).\n\nEveryone is back at the house and Dan asks Natasha to prom (who has been waiting for him to).\n\nA King and A Queen   Mike calls them all together to tell them they have to nominate a prom King and Queen.   Maurice says in high school they nominated the popular people, this time would be different and will be fun.   Chris wants to be king.\n\nBack in the house   Summer tells the others she received another gift, this time it's a bracelet.  She thinks i","production_code":"","runtime":60,"season_number":1,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":30581,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"52586382760ee34661150a4c","air_date":"2004-03-14","episodes":[{"air_date":"2004-03-14","episode_number":1,"episode_type":"standard","id":586609,"name":"Episode 201","overview":"In the second season's premiere, we meet 17 former classmates from Round Rock High School in Austin, Texas, who are reunited for their 10-year reunion in Oahu, Hawaii. The 17 guests stayin for 2 weeks are:\n\n01. Amanda \"\"The Sophomore Flirt\"\"   02. Heather C. \"\"The Ugly Duckling\"\"   03. Chris \"\"The Class Clown\"\"   04. Daniel \"\"The Gay Guy\"\"   05. Denise \"\"The Ex\"\"   06. Heather F. \"\"The Sophomore Vixen\"\"   07. Gabe \"\"The Jock\"\"   08. Jeralyn \"\"The Wallflower\"\"   09. Jessica \"\"The Teen Mom\"\"   10. Johnny \"\"The Quarterback\"\"   11. Laura \"\"The Drama Queen\"\"   12. Lenny \"\"The Geek\"\"   13. LouAnn \"\"The Homecoming Queen\"\"   14. Stacy \"\"The Sophomore Sweetheart\"\"   15. TJ \"\"The Redneck\"\"   16. Tre \"\"The Player\"\"   17. Trevor \"\"The Pipsqueak\"\"\n\nIn this episode, LouAnn \"\"The Homecoming Queen\"\" recieves the first Hall Pass, but unable to invite someone else, she is surprised when she is reunited with her ex boyfriend Johnny \"\"The Quarterback\"\". Denise \"\"The Ex\"\" recieves the second Hall Pass and she invites her ex husband, who she still","production_code":"","runtime":60,"season_number":2,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-21","episode_number":2,"episode_type":"standard","id":586610,"name":"Episode 202","overview":"In this episode, new guest Trevor \"\"The Pipsqueak\"\" arrives and he is hardly recognizable with his good looks. He is first greeted by Amanda \"\"The Sophomore Flirt\"\" who later on invites him on her Hall Pass. Stacy \"\"The Sophomore Sweetheart\"\" and Heather F. \"\"The Sophomore Vixen\"\" had both dated Gabe \"\"The Jock\"\" in high school, and are curious to find out what had happened 10 years ago. Late at Night, Gabe \"\"The Jock\"\" pays Heather F. \"\"The Sophomore Vixen\"\" a visit. Meanwhile, LouAnn \"\"The Homecoming Queen\"\" and Johnny \"\"The Quarterback\"\" take a romantic trip to a secluded beach. Johnny \"\"The Quarterback\"\" then finds out that his first love has a boyfriend waiting at home.\n\n-Norrin Radd","production_code":"","runtime":60,"season_number":2,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-28","episode_number":3,"episode_type":"standard","id":586611,"name":"Episode 203","overview":"In this episode, it is Daniel \"\"The Gay Guy's\"\" Birthday. The Classmates decide to throw him a surprise birthday party. During the party, Daniel \"\"The Gay Guy\"\" gets a visit from an officer who is not there to arrest him, but to show him a good time. Later on, Daniel \"\"The Gay Guy\"\" challenges TJ \"\"The Redneck\"\" to a boxing match. After the match they show good sportsmanship. The Hall Passes of today are givin to LouAnn \"\"The Homecoming Queen\"\" who invites none other than Johnny \"\"The Quarterback\"\". They both have conversations about their feelings. Trevor \"\"The Pipsqueak\"\" invites Amanda \"\"The Sophomore Flirt\"\". They treat each other with massages and join each other in a rose petal bath. Finally, Heather F. \"\"The Sophomore Vixen\"\" gets what she wants when she invites Gabe \"\"The Jock\"\" on a day on Waikiki Beach. There is where she confronts him on their past, but she soon starts falling for him all over again. Denise \"\"The Ex\"\" is not happy about their Hall Pass.\n\n-Norrin Radd","production_code":"","runtime":60,"season_number":2,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-04","episode_number":4,"episode_type":"standard","id":586612,"name":"Episode 204","overview":"In this episode, after their extended 2 day trip, LouAnn \"\"The Homecoming Queen\"\" and Johnny \"\"The Quarterback\"\" finally return to the house. Trevor \"\"The Pipsqueak\"\" and Amanda \"\"The Sophomore Flirt\"\" both have a romantic picnic on the beach. Denise \"\"The Ex\"\" confronts Heather F. \"\"The Sophomore Vixen\"\" about her attitude in the situation over Gabe \"\"The Jock\"\". Meanwhile, Lenny \"\"The Geek\"\" recieves a Hall Pass and Jessica \"\"The Teen Mom\"\" and Laura \"\"The Drama Queen\"\" take him into town for a make-over he would never forget. His new look gives him the confidence to ask Stacy \"\"The Sophomore Sweetheart\"\" to go out with him. Later that night, Heather F. \"\"The Sophomore Vixen\"\" and Amanda \"\"The Sophomore Flirt\"\" decide they gonna go skinny dipping. Trevor \"\"The Pipsqueak\"\" and Tre \"\"The Player\"\" join them for a wild night. The senior girls have a little fun by taking the guys and the sophmore girls clothes.\n\n-Norrin Radd","production_code":"","runtime":60,"season_number":2,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-11","episode_number":5,"episode_type":"standard","id":586613,"name":"Episode 205","overview":"In this episode, everyone is having fun during a luau, but the sophmore girls play a nasty prank on the cheerleaders' room. When the cheerleaders find out what happened, they get very upset. Emotions run wild when the prank sparks a confrontation between Denise \"\"The Ex\"\", Heather F. \"\"The Sophomore Vixen\"\" and even Amanda \"\"The Sophomore Flirt\"\". LouAnn \"\"The Homecoming Queen's\"\" feelings grow stronger for Johnny \"\"The Quarterback\"\", but she is holding back because she feels guilty about her boyfriend back home. Later that night, Heather F. \"\"The Sophomore Vixen\"\" invites Gabe \"\"The Jock\"\" out on her Hall Pass, but he gives her his answer she wasn't hoping for.\n\n-Norrin Radd","production_code":"","runtime":60,"season_number":2,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-18","episode_number":6,"episode_type":"standard","id":586614,"name":"Episode 206","overview":"In this episode, LouAnn \"\"The Homecoming Queen\"\" and Johnny \"\"The Quarterback\"\" once again go out on a Hall Pass and spend the night at the beautiful W Hotel in Honolulu. Denise \"\"The Ex\"\" and Gabe \"\"The Jock\"\" both spend a romantic evening at the Turtle Bay Resort on Sunset Beach on their Hall Pass. On their night on the beach they talk about their relationship and Gabe \"\"The Jock\"\" is not sure if he's ready to get back together when their divorce hurt him too much. Amanda \"\"The Sophomore Flirt\"\" and Trevor \"\"The Pipsqueak\"\" travel to a private estate in Waimea Bay. They both grow more closer together and admit that they want to keep seeing each other after the reunion.\n\n-Norrin Radd","production_code":"","runtime":60,"season_number":2,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-25","episode_number":7,"episode_type":"standard","id":586615,"name":"Episode 207","overview":"In this episode, everyone gets ready for the prom. LouAnn \"\"The Homecoming Queen\"\" makes a big decision about moving to Austin to be with Johnny \"\"The Quarterback\"\". Amanda \"\"The Sophomore Flirt\"\" and Trevor \"\"The Pipsqueak\"\" have fallen in love and they want to end up together. After Gabe \"\"The Jock\"\" has held back his feelings towards Denise \"\"The Ex\"\" ever since he got to the reunion, he finally let's down his guard and makes a stunning revelation to Denise \"\"The Ex\"\" about their future. The classmates have the night of their life and is visited by the group Tag Team, who is famous for their hit \"\"Whoop There It Is\"\". Two lucky classmates get crowned King and Queen of prom. After prom everyone says their farewell as the Class of Round Rock High School Depart.\n\n-Norrin Radd","production_code":"","runtime":60,"season_number":2,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-05-02","episode_number":8,"episode_type":"finale","id":586616,"name":"Episode 208","overview":"In this episode, all 17 classmates are once again reunited after the reunion and they talk about what happened with their host Ananda Lewis. Questions are answered and never before seen footage is showned. Some of the Questions of tonight's disscussion include:\n\n01. Did Heather F. \"\"The Sophomore Vixen\"\" move on from her resentment of Denise \"\"The Ex\"\"?   02. Did LouAnn \"\"The Homecoming Queen\"\" leave her boyfriend back home for her high school sweetheart Johnny \"\"The Quarterback\"\"?   03. Did Amanda \"\"The Sophomore Flirt\"\" and Trevor \"\"The Pipsqueak\"\" find love and happiness?\n\nBack in Austin, Texas, other Round Rock High School classmates await and get to ask the questions they been wondering about. Also LouAnn \"\"The Homecoming Queen's\"\" boyfriend surprise's her and Johnny \"\"The Quarterback\"\" when he visits. We find out what were his thoughts about the whole situation. All this and more on High School Reunion The Aftermath.\n\n-Norrin Radd","production_code":"","runtime":60,"season_number":2,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":30582,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"52586382760ee34661150a57","air_date":"2004-12-07","episodes":[{"air_date":"2004-12-07","episode_number":1,"episode_type":"standard","id":586617,"name":"Episode 301","overview":"In the third installment of this series, former classmates from Cardinal Gibson High, a private Catholic school in Fort Lauderdale, are reunited on the beautiful island of Oahu for a 10-year reunion. These former classmates all have something to prove, someone they want to impress and someone they want to avenge. As the group gets settled in, Nikol (The Good Girl) is given the first hall pass, and is nervous about asking her high school boyfriend Jim (The Jock) though they both admit they have unresolved feelings for each other. Nikki (The Head Cheerleader) is also given a hall pass and invites Brien M. (The Rebel) for a night on the town.","production_code":"","runtime":60,"season_number":3,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-12-14","episode_number":2,"episode_type":"standard","id":586618,"name":"Episode 302","overview":"Gianni (The Basketball Star) gets a hall pass, and after waiting years, invites Loretta (The Dream Girl) for a romantic night on the beach. But when Jamie discovers the date has lasted all night and the two didn't sleep at the reunion house, Jamie flies into a rage. Back at the house, Carin (The Fat Girl) and Nikki (The head Cheerleader) have different memories of how Carin was treated in school and send her remembering all of her old feelings of being overnight and depressed; when Eze (The Soccer Guy) sees that Nikol and Jim are having problems getting close, he makes his move on her. Two new arrivals, sisters Tara (The Vixen) and Torie (The Hottie), arrive and turn the house into a party starting with a late night swim and a sexy game of truth or dare.","production_code":"","runtime":60,"season_number":3,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-12-21","episode_number":3,"episode_type":"standard","id":586619,"name":"Episode 303","overview":"After a decade of waiting, Gianna (The Basketball Star) and Loretta (The Dream Girl) finally get their perfect date. Except when they arrive home, Gianna's ex-girlfriend Jaime (The Obsessed Ex) lashes out at him about spending the night with Loretta. Nikol (The Good Girl) gets a second hall pass and a second chance with Jim (The Jock). Though he's still guarded with his emotions, they finally spend the night together. The next night, the girls are leave the reunion house for a wild slumber party that eventually has some unexpected crashers. While at the party, Loretta (The Dream Girl) receives another secret note and package from her secret admirer and gets whisked away to a private beach to meet him face-to-face.","production_code":"","runtime":60,"season_number":3,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-12-28","episode_number":4,"episode_type":"standard","id":586620,"name":"Episode 304","overview":"Five guys from rival Douglas High arrive on the island, including Nikol's (The Good Girl) senior year boyfriend. Tempers and egos heat up during a Cardinal Gibbons vs Douglas High football game that lands Jim (The Jock) in the hospital with a head injury and Nikol at his side. Jen (The Predator) backstabs Nikki (The Cheerleader) when they both find themselves attracted to the same Douglas hunk. Gianni (The Basketball Star) and Loretta (The Dream Girl) share another romantic evening and worry about Gianni's upcoming return to Italy.","production_code":"","runtime":60,"season_number":3,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-04","episode_number":5,"episode_type":"standard","id":586621,"name":"Episode 305","overview":"Two more classmates, Kristian (The Nerd) and Matt (The Dork), arrive in a red hot Corvette, let the classmates believe they are wealthy Internet moguls and make an impression the girls by bringing personal masseuses to the house. Brien M. (The Rebel), who feels he has connected with Torrie (The Hot Sister), invites her on his hall pass, which includes a romantic dinner, massages and bubble bath. Bill (Douglas Rival) invites Nikki (The Cheerleader) on a hall pass to set the record straight about Jen (The Predator). Nikol (The Good Girl), who is frustrated by Jim's (The Jock) lack of communication, accepts Eze's (The Shy Guy) hall pass invitation, which leaves Jim wondering if he missed his chance with her. Tara (The Baby Sister) tells Brien M. (The Rebel) and Torie (The Hot Sister) that she overheard John (The Loud Mouth) making derogatory remarks about her sister, sending Brien M. into a rage which ends in a nasty confrontation.","production_code":"","runtime":60,"season_number":3,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-11","episode_number":6,"episode_type":"standard","id":586622,"name":"Episode 306","overview":"The classmates are given one last chance to use a hall pass to invite the person of their choice on a date. Gianni (The Basketball Star) invites Loretta (The Dream Girl) to a romantic garden dinner where she lets him know she doesn't believe in long distance relationships but accepts his surprise ticket to Italy. Brian A. (The Meathead) invites Nikki (The Cheerleader) for a night on the town, and Jim (The Jock) asks Nikol (The Good Girl), where he professes his love and his desire to continue their relationship after the reunion. The rest of the classmates go into town for a night of drinking and pool but soon after arriving, Brien M. (The Rebel) and Torie (The Hot Sister) leave the group in town to spend a romantic night at the estate together. The classmates start making plans for next week's prom.","production_code":"","runtime":60,"season_number":3,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-18","episode_number":7,"episode_type":"finale","id":586623,"name":"Episode 307","overview":"At the prom, Kristian (The Nerd) and Matt (The Dork) come clean to their classmates about their real financial status, the group is surprised with performance from the popular 1994 band The Gin Blossoms, while Torie (The Hot Sister) and Brien M. (The Rebel) talk about what will happen when they leave Hawaii. Later in the evening, Jen (The Predator) and Jim (The Jock) are caught in a comprising position, leading to an angry confrontation with Nikol (The Good Girl).","production_code":"","runtime":60,"season_number":3,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":30583,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"52586382760ee34661150a62","air_date":"2008-03-05","episodes":[{"air_date":"2008-03-05","episode_number":1,"episode_type":"standard","id":586624,"name":"Meet the Mustangs","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-12","episode_number":2,"episode_type":"standard","id":586625,"name":"Who Could It Be Now?","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-19","episode_number":3,"episode_type":"standard","id":586626,"name":"Return of the Backstabber","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-26","episode_number":4,"episode_type":"standard","id":586627,"name":"Bros Before Ho's","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-02","episode_number":5,"episode_type":"standard","id":586628,"name":"Happy Birthday Steve","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-09","episode_number":6,"episode_type":"finale","id":586629,"name":"Only the Lonely","overview":"","production_code":"","runtime":60,"season_number":4,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":30584,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"52586382760ee34661150a6d","air_date":"2009-02-18","episodes":[{"air_date":"2009-02-18","episode_number":1,"episode_type":"standard","id":586630,"name":"Welcome Back Wolves","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-25","episode_number":2,"episode_type":"standard","id":586631,"name":"Reunion Crashers","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-04","episode_number":3,"episode_type":"standard","id":586632,"name":"Dennis the Menace","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-11","episode_number":4,"episode_type":"standard","id":586633,"name":"A Class Divided","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-18","episode_number":5,"episode_type":"standard","id":586634,"name":"Reunited?","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-25","episode_number":6,"episode_type":"standard","id":586635,"name":"What Happens in Hawaii Stays in Hawaii","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-01","episode_number":7,"episode_type":"standard","id":586636,"name":"Is It True?","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-08","episode_number":8,"episode_type":"finale","id":586637,"name":"Love Will Lead You Back","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":30585,"poster_path":null,"season_number":5,"vote_average":0},"6":{"_id":"52586382760ee34661150a78","air_date":"2010-01-13","episodes":[{"air_date":"2010-01-13","episode_number":1,"episode_type":"standard","id":586638,"name":"Aloha Cowboys","overview":"","production_code":"","runtime":60,"season_number":6,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-20","episode_number":2,"episode_type":"standard","id":586639,"name":"Win, Lose or Draw","overview":"","production_code":"","runtime":60,"season_number":6,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-27","episode_number":3,"episode_type":"standard","id":586640,"name":"Pair of Jokers","overview":"","production_code":"","runtime":60,"season_number":6,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-03","episode_number":4,"episode_type":"standard","id":586641,"name":"Ante Up","overview":"","production_code":"","runtime":60,"season_number":6,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-10","episode_number":5,"episode_type":"standard","id":586642,"name":"Hearts Are Wild","overview":"","production_code":"","runtime":60,"season_number":6,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-17","episode_number":6,"episode_type":"standard","id":586643,"name":"Invite Only","overview":"","production_code":"","runtime":60,"season_number":6,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-24","episode_number":7,"episode_type":"standard","id":586644,"name":"Another Wedding Day in Paradise","overview":"","production_code":"","runtime":60,"season_number":6,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-03","episode_number":8,"episode_type":"finale","id":586645,"name":"PROMises of Love","overview":"","production_code":"","runtime":60,"season_number":6,"show_id":20546,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":30586,"poster_path":null,"season_number":6,"vote_average":0}}}