{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2003-10-30","genres":[],"homepage":"","id":2063,"in_production":false,"languages":["en"],"last_air_date":"2009-05-19","last_episode_to_air":{"id":142795,"name":"Scotland and Lanzarote","overview":"Manoeuvring two families with opposing ideas about life into close quarters and letting the cameras roll may not be the subtlest way to make reality television but, as previous series of Holiday Showdown have shown, it does often make for some compulsively entertaining stuff. And so it is tonight, as the Brown family from Birmingham and the Maybes from Essex take each other on a “dream holiday” for a week. The Browns’ destination of choice is rural Scotland, for a survival holiday in which they construct their own shelters and skin their own food. None of the Maybes are happy about this, least of all their daughter Jade, a trainee beautician who sniffles that “it’s not a holiday; it’s a forest.” Still, with admirable stoicism, they put up with the indignities of outdoor latrines and dour weather and are soon whisked off to their holiday of choice in sunny Lanzarote. Were this a TV drama and not a reality show, the boozy arguments would have begun here; as it is, both families display enough charm and open-mindedness to keep the show from playing to stereotype. The Browns, with one notable exception, actually enjoy eating deep-fried ribs and larking about in the pool; and the Maybes enjoy showing the Browns how to relax, package holiday-style.","vote_average":0,"vote_count":0,"air_date":"2009-05-19","episode_number":4,"episode_type":"standard","production_code":"","runtime":60,"season_number":5,"show_id":2063,"still_path":null},"name":"Holiday Showdown","next_episode_to_air":null,"networks":[{"id":9,"logo_path":"/oz9pjTHnBUmlju8OkaTymhKbh6C.png","name":"ITV1","origin_country":"GB"}],"number_of_episodes":25,"number_of_seasons":5,"origin_country":["GB"],"original_language":"en","original_name":"Holiday Showdown","overview":"Holiday Showdown was a BAFTA-nominated and Royal Television Society Award-winning reality television programme, produced by Chris Kelly for the United Kingdom independent TV production company RDF Media. It was first broadcast in 2003 on ITV in the United Kingdom.\n\nHoliday Showdown is produced by RDF Television, part of the RDF Media Group. The executive producer is Nick Shearman, series producer is Tayte Simpson, and producer/director is Katharine Round.","popularity":2.972,"poster_path":null,"production_companies":[],"production_countries":[],"seasons":[{"air_date":"2003-10-30","episode_count":4,"id":6239,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":null,"episode_count":4,"id":6240,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":null,"episode_count":7,"id":6241,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2006-01-17","episode_count":5,"id":6237,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2007-06-21","episode_count":5,"id":6238,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"525720a619c2957114128a5f","air_date":"2003-10-30","episodes":[{"air_date":"2003-10-30","episode_number":1,"episode_type":"standard","id":142797,"name":"Menorca v Jamacia","overview":"Health- conscious middle-class Plummer family - who don't drink, smoke or eat junk food - are devastated when they are sent to Menorca for a boozy beach holiday with the working-class Dochertys.\n\nAnd the Dochertys are equally upset when they are sent to Jamaica with the Plummers, who forbid them to smoke in the house, ban them from drinking - and take them on healthy treks through the rainforest.\n\nThe two mums, Kim Docherty and Simone Plummer, almost come to blows after Simone bans Kim from smoking in their luxury villa and asks her not to drink alcohol.\n\nTearful Kim, shouts: \"Okay, I'm getting seriously p***ed off now. Why can't I have a drink? It's my holiday too. I don't like it when people tell me what I can and can't do. If you tell me I can't smoke, I'll light up right now.\"\n\nIt ends with Kim storming up to her bedroom in tears, shouting: \"If I light a fag and she says anything I will f***ing punch her. I'm going to smack her one, the stupid bitch.\"\n\nThe huge showdown comes after days of bickering. During the first week of the holiday swap the Dochertys from East London - Kim, 38, market trader Danny, 42, Kerry, 15, and Jamie, 12, - take the Plummers to Menorca for a week of drinking, karaoke and lounging by the pool.\n\nAlthough the children in both families get on well, friction between the adults is apparent almost immediately - and a crisis meeting is called just two days into the holidays.\n\nSinger and songwriter Simone moans: \"We haven't been out of the complex in 48 hours. Making us stay in one place for the whole time is not enjoyable for us.\"\n\nHusband James says of the resort: \"It's extremely tacky. It's full of Northerners - like Blackpool in Spain.\"\n\nAnd by the second week, in Jamaica, the arguments start to get really heated.\n\nThe Plummers from South East London - Simone, 44, dad James, 48, and children Aliyah, 13, and Jay, 12 - have rented a luxury villa which comes with its own cook.\n\nTheir idea of holiday heaven is to go for a long walk to a waterfall. James describes it as \"paradise\" but Kim retorts: \"It's horrible, bloody horrible.\" At the end of the holiday, Dave sums up the experience: \"It's nice in Jamaica, but I could go to East London and have a better time with real people.\n\n\"If I wanted a time like this, I'd go to a clothes shop and sit with the mannequins. They don't eat either.\"","production_code":"","runtime":60,"season_number":1,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-06","episode_number":2,"episode_type":"standard","id":142798,"name":"Cornwall v Borneo","overview":"The Glass family pitch a tent in Newquay, Cornwall, but companions the Theodores aren't happy campers, complaining about conditions on the site and coastal walks. They are much happier on a five-star break to Borneo, and can't understand why the Glasses would rather get out and about and rough it a bit to see more of the country","production_code":"","runtime":60,"season_number":1,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-13","episode_number":3,"episode_type":"standard","id":142799,"name":"Mexico v Ghania","overview":"The fun-loving Littlechilds from Essex treat Devon's Curtis family to a week at their favourite resort in Cancun, Mexico, a lavish complex complete with wild nightclubs and captive dolphins. Then the tables are turned as the Curtises - devout Christians with a penchant for charity work in Africa - repay the favour with a rather less luxurious stay in a tiny Ghanaian village without running water","production_code":"","runtime":60,"season_number":1,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-20","episode_number":4,"episode_type":"finale","id":142800,"name":"Las Vegas v Hiking","overview":"THE Simpsons meet the Flanders in this great slice of reality TV when the Harrison Wolf family meet the Lawson family.\n\nThe Harrison Wolf mob love the great outdoors while the Lawsons' favourite holiday activity is gambling. We follow the Harrison Wolf family as they go on holidays with the Lawsons to Las Vegas. For the Harrison Wolf family food is anything they can carry in their backpacks while their hosts prefer the all-you-can-eat buffet.\n\nYou'll be left dying to see the next installment when the tables are turned and the Lawsons are forced to go camping.","production_code":"","runtime":60,"season_number":1,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":6239,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"525720a619c2957114128a69","air_date":null,"episodes":[{"air_date":null,"episode_number":1,"episode_type":"standard","id":142801,"name":"St Martin v The Gambia","overview":"Upmarket Bournemouth hoteliers-cum-property-developers the Dixon-Boxes invite Blackpool strippers the Westheads along on a luxury break to French ski resort St Martin de Belleville, before joining their erstwhile guests on a jaunt to an island off the Gambian coast","production_code":"","runtime":60,"season_number":2,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":2,"episode_type":"standard","id":142802,"name":"Menorca Villa v France","overview":"The fun-loving Jefferies from Bedfordshire enjoy an alcohol-fuelled break at a Menorcan villa in the company of the more contemplative Secks from Devon, who give a mixed reaction to their hosts' endless partying. Then it is off to the French Pyrenees for a yoga-based retreat, which gradually works its magic on the initially sceptical Jefferies, who concede that a dash of spirituality can add zest to life","production_code":"","runtime":60,"season_number":2,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":3,"episode_type":"standard","id":142804,"name":"Lech v Benidorm","overview":"The Greenwoods from Yorkshire and the Barbers from Lancashire get a taste of each other's favourite holidays. The Barbers' idea of fun is a snowboarding break in the Austrian resort of Lech, while the Greenwoods prefer a spot of karaoke in Benidorm - and before long the two families are at loggerheads over such sensitive issues as swearing, football and jogging","production_code":"","runtime":60,"season_number":2,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":4,"episode_type":"standard","id":142803,"name":"New York v Salt Lake City","overview":"The Churchers from Southampton like nothing better than searching for bargains amid the hustle and bustle of New York. They meet the Bells, a family of Mormons from London who spend their holidays in Salt Lake City, the spiritual home of their faith. All goes well when the two groups sample each other's schedules - until disputes about budgets, junk food and relentless tour guides threaten to spoil the atmosphere","production_code":"","runtime":60,"season_number":2,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":6240,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"525720a619c2957114128a73","air_date":null,"episodes":[{"air_date":null,"episode_number":1,"episode_type":"standard","id":142805,"name":"Shell Island vs Florence","overview":"Tonight, what happens when a family of extreme campers is put together with a family who love the sophisticated art and culture of Florence in Italy? Sparks fly with hilarious and surprising consequences as the two families attempt to persuade each other that their holiday is the best.\n\n The Townsend family from Solihull in the West Midlands take an extreme approach to their camping on remote Shell Island, off the coast of North Wales. There’s warehouse supervisor Craig (43), Tracey (39) and their two children Katie (14) and Samantha (7). They believe in a back –to-basics camping regime where they use only one toothbrush, there’s no toilet (“One toilet roll is quite enough – it’s four sheets per pooh”), they don’t wash, and they forbid the use of watches because on holiday time is irrelevant. They’ll be subjecting the luxury-loving Cox family to their extraordinary holiday. \n\nLiving just 3 miles from Prince Charles’ home in Gloucestershire, there’s art-shop-owner Denis (44), Isabelle (54), Helena (12), Charles (11) and Henry (8). They love five-star hotels and maximum comfort. The Cox’s believe that education and culture are vitally important (“Ignorance is free, education is expensive”) and Denis in particular loves the Renaissance wonders of Florence.","production_code":"","runtime":60,"season_number":3,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":2,"episode_type":"standard","id":142807,"name":"Tenerife v Lake District","overview":"A traditional fun-loving family from West Sussex go to wild Tenerife and team up with a family from Peterborough, who love the peace and activity challenges presented by the mountains and rivers of the Lake District. But will they get along?","production_code":"","runtime":60,"season_number":3,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":3,"episode_type":"standard","id":142806,"name":"Morocco v Skegness","overview":"Psychologists Jonathon and Amanda Armes from Exeter take their children on a hectic banger-racing break in Skegness with the larger-than-life Baker family from Cambridgeshire - but find their company stressful and flatly refuse to accompany them to Morocco, even though it's their own favourite holiday destination","production_code":"","runtime":60,"season_number":3,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":4,"episode_type":"standard","id":142808,"name":"Algarve v Battlefields","overview":"The fun-loving Coppocks from Liverpool enjoy a booze-fuelled fiesta in the Algarve while the strait-laced Whites from Sutton Coldfield prefer the delights of a historical sightseeing tour near Lisbon - and feelings run high when the two families team up to see how the other half lives","production_code":"","runtime":60,"season_number":3,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":5,"episode_type":"standard","id":142810,"name":"Gran Canaria v Fishing","overview":"The football-mad Bexon-Simkin family from Church Gresley, Derbyshire, set off for a week of sun, sangria and televised soccer in Gran Canaria with the Falls from Cleveland, who then repay the favour by taking them on a relaxing break in rural Lonsdale Park near Carlisle, where fishing is the chief leisure pursuit on offer","production_code":"","runtime":60,"season_number":3,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":6,"episode_type":"standard","id":142809,"name":"Haven v Ghosts","overview":"The Angel-Guest family from Malvern all have psychic abilities (“We’re not the cereal-packet family, never have been, never will be”) and love taking holidays on ghost-busting trips to the most haunted places in Britain. Ex-police officer Julie (32) and her ex-roadie partner Christian (also 32) are both ordained Reverends of the Universal Life Church. Christian’s daughter Emily (13) is an apprentice herbalist and his nephew Danny Bennett (14) has just become an ordained Reverend and likes to draw people’s auras.\n\nThe down-to-earth Palmer family from Borrowash in Derbyshire is a total contrast – they love the action-packed child-centred fun and frolics of a Haven holiday camp in Devon. Dad Bill (42) is a gardener and Mum Tracey a beautician. They have five children, Amy (17), Jordan (15), Corey (12), Alice (11) and Amelia (7). Bill in particular is an atheist and feels that “all this ghosts and ghoulies is crap”.","production_code":"","runtime":60,"season_number":3,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":7,"episode_type":"standard","id":142811,"name":"Bordeaux v Devon","overview":"The down-to-earth Matthews family from Selsey go on a golfing break in Bordeaux with luxury-loving Hampshire couple Chris and Maggie Williams and their kids - and later repay the favour by taking them on a back-to-basics holiday in Devon, where paintballing and quad biking are among the activities on offer. As usual, much acrimony ensues","production_code":"","runtime":60,"season_number":3,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":6241,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"525720a619c2957114128a4b","air_date":"2006-01-17","episodes":[{"air_date":"2006-01-17","episode_number":1,"episode_type":"standard","id":142787,"name":"Dog Show Ireland v DJing Ayia Napa","overview":"In the rural north-east of England nestles the rustic farm of the Rogerson family. There’s mum Tricia, dad David, 13 year old Daniel, 14 year old James, Louisa 19 and 16 year old Liam. But there’s also their second family - fourteen much loved dogs. The family saves up all year for their annual holiday in Ireland’s Ring of Kerry to compete in a week of prestigious dog shows. This year they’re hoping to win with Bruno, Megan, Alex, Magnum, Chelsea, Pepsi and Brett. According to Dad David “Everything we think, dream, drive to, whatever we do, it involves the dogs”.\n\nThe complete strangers who will be joining them in Ireland are the streetwise Francis family from Streatham in South-West London. There’s Dad, Derek, Mum, Sonia, 13 year old Dylan, Nyrie, 21, and 15 year old Raphael. Dylan and Raphael MC and DJ for urban group So Solid Kids. Their family holidays are planned around the boys' DJ-ing hobby. And, for the last few years, it's been to clubbing paradise Ayia Napa in Cyprus.\n\nAlthough they are both focused on a hobby, the two holidays couldn't be more different.","production_code":"","runtime":60,"season_number":4,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-31","episode_number":2,"episode_type":"standard","id":142788,"name":"Benidorm v Sailing","overview":"The shipshape Riley family are keen sailors who spend their holidays on a boat touring around the south of England. They share holidays with the rowdy Hill family from Liverpool who love a good knees up in Spain’s largest holiday resort Benidorm.\n\nThe Rileys like to run a tight ship both on holiday and at home. John Riley is step dad to 12 year old George and nine year old Melissa and the father of four year old Fiona. Both John and Vanessa demand good manners at all times “We have to be ordered and we have to be disciplined but that’s how the children can learn what they need to know”.\n\nThe Hills are a lively family who let their kids do what they want. There is mum Tracy, dad Gareth, Bobby, 8, Natalie, 11, Nathan, 15, Natasha, 16. Although the Banderol holiday involves lots of drinking, they are planned with the children in mind “Our holiday is about the kids really, well, and us as well”","production_code":"","runtime":60,"season_number":4,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-07","episode_number":3,"episode_type":"standard","id":142789,"name":"Bristol v Thailand","overview":"The home-loving Coates family live on a council estate on the outskirts of Bristol. Step-dad Geoff is an industrial cleaner and wife Lorraine is a housewife. They have two daughters; Mary-Anne (16) and Sammy-Joe (15). The Coates family don’t just live in Bristol, it’s also where they like to holiday. Meaning they never have to leave home and haven’t done so for the past 17 years. If they do venture out of Bristol it’s to nearby Weston-Super-Mare, where annual breaks are spent sight seeing, visiting entertainment complexes and riding the local buses.\n\nThe complete strangers who will be joining them in Bristol are the Wigmore family from Newbury. There’s dad Paul, Mum Sarah, 19 year old Jade and 16 year old Harry. Unlike the Coates family, they like to get as far away from their home town as possible. Traveling the world and experiencing different cultures is the Wigmore families number one priority. But the one country they’ve fallen in love with is Thailand.\n\nFor the Coates and the Wigmores, their holidays couldn't be more different. For the globe trotting Wigmores, sharing another family’s home is going to be quite a challenge.","production_code":"","runtime":60,"season_number":4,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-14","episode_number":4,"episode_type":"standard","id":142790,"name":"San Francisco v Texas","overview":"The Richardson family live in rural Lincolnshire in the heart of middle England. They all have a strong military background. Mum Lorraine is in the navy reserves, dad John spent 26 years in the RAF and 16 year old Will and 14 year old Eleanor are both at military boarding school. The Richardson’s pride themselves on having a traditional English way of life, well suited to the Texas mindset. And their old fashioned views extend to most aspects of their life. They don’t agree with homosexuality and the men and women have very clear roles. Mum Lorraine and Daughter Eleanor cook the dinner, while John, as chief hunter – gatherer, sits at the head of the table.\n\nThe complete strangers who will be joining them in Texas are the liberal Blackwood family from London. Anarchist video artists Paul and Emma are both bisexual but were married to each other a year ago in a pagan ceremony known as broom-jumping. Paul’s now step-dad to her three children – ten year old Tanzy, 12 year old Joel and 14 year old Natasha. Gender roles don’t apply in the Blackwood household and Dad Paul is often seen vacuuming the house in drag. On holiday the Blackwood’s visit cities to collect images for their video art. Their favourite destination is San Francisco, the gay capital of America.","production_code":"","runtime":60,"season_number":4,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":5,"episode_type":"finale","id":142791,"name":"Dollywood v Jamacia","overview":"Sue Woodcock is a die-hard Dolly Parton fan who has saved up to take her family to Dollywood in Tennesse – a theme park dedicated to the country and western star. They’re a family of plain eaters, who live on tinned food and boiled potatoes. Rice ‘looks like maggots’ and ketchup is ‘too spicy’.\n\nEka Patterson is passionate about exploring her Jamaican roots and regularly takes her family to visit relatives in the rural parish of St Elizabeth. Food is very important to the Patterson family, and they especially love all things Caribbean.\n\nFirst impressions of Dollywood are a dream for the Woodcocks, but more of a nightmare for the Pattersons. They drag their heels around the Dolly attractions of Tennessee, and when Eka tells Sue she’s not enjoying herself, 13 year-old Emma Woodcock jumps to her Mum’s defense. Feeling a personal slight against her idol, Sue and Eka’s relationship quickly goes downhill and, after a row over food, the two families choose to separate for a few hours.\n\nRelationships start to improve between the families in Jamaica, but things soon take a nosedive when Eka arranges a party for her partner’s birthday. The Woodcocks have struggled to cope without decent showers and toilets at their guest house, as well as food they can’t stomach, and the loud music and the presence of people smoking cannabis pushes them over the edge. A final confrontation leads to a separation, and when the families reunite for the showdown meal there is no hope of reconciliation.","production_code":"","runtime":60,"season_number":4,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":6237,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"525720a619c2957114128a55","air_date":"2007-06-21","episodes":[{"air_date":"2007-06-21","episode_number":1,"episode_type":"standard","id":142792,"name":"Slovenia and Florida","overview":"If Christmas wasn't stressful enough with your own family, imagine sharing it with someone else's...whilst on your dream holiday. Two Christmas holidays are under the spotlight in this first programme of Holiday Showdown, and they couldn't be more different - extreme sports in the Slovenian snow against luxury living and fun at Disney World, Florida.\n\nFireman Andy Kerr, 44, and his family live in Newton Aycliffe near Durham. Every Christmas they push themselves to the limit on an extreme sports holiday in Slovenia. Before joining the fire service Andy spent 6 years in the Army Air Corp and he runs his holidays like he runs his home - with military precision. While Andy takes charge of physical fitness, mum Caroline, 41, is in charge of catering making sure Andy and their three children Chris, 18, Sean, 16, and Tasha, 14, are well fed and watered. Andy sees his family as \"a corporation with a corporate head figure!\"\n\nThe luxury-loving Jones family from Knott-End-On-Sea near Blackpool love winter sun, fast food and the larger than life entertainment of Disney World Florida. Dad Tom, 39, runs a successful locksmith business, and wife Pam, 37, and kids Tom, 16, Nick, 15, and Laura, aged 10, all live in luxury. They like lazing around in the Jacuzzi, watching TV and playing computer games.\n\nAfter Andy's military regime in Slovenia which includes 6am starts and a gruelling itinerary of ski-ing, snowboarding and snowmobiling, the Joneses reveal their Florida holiday, to the horror of Disney-hating Andy but the delight of his family who have always dreamed of visiting the States. As the Joneses plan further revenge, things go a little too far and tempers boil over in the final showdown meal, on New Years Eve.","production_code":"","runtime":60,"season_number":5,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-05","episode_number":2,"episode_type":"standard","id":142793,"name":"Egypt And Tenerife","overview":"In the second programme of the series a tee-total, Egyptian loving family team up with a partying, patriotic family who love nothing better than a right old booze up in Tenerife.\n\nThe Wilson family from the Isle of Mann love to holiday in Egypt, and away from other tourists they immerse themselves in the ancient Egyptian culture. There is step dad Tony, mum Joanne, and 15-year-old Terrance.\n\nThey live their lives with the view to always helping others, and they carry this abroad with them too. They think Egypt is a wonderful place for a holiday because of the warm and friendly Egyptian people, and they return year after year to enjoy the culture and visit the friends they have made.\n\n“All the fun of going to Egypt is to meet the people, eat the food and enjoy all their customs,” says Tony, and that means there won’t be a burger or chips in sight. Joanne says going to a foreign country and hitting the booze “is an absolute waste of time”.\n\nSharing their holiday is the party-loving Kent family from Dover – dad Paul, mum Audra and teenagers Tully, 16, and Lucy, 14. They love British food, plenty of drink, bars and clubs, and find the sun-soaked island of Tenerife the perfect holiday experience. And they only eat English food abroad.\n\n“Tenerife is a home from home for us, everything we love about Britain – the fry ups, the roast dinners, the culture is there but with the sunshine,” says Audra.\n\nIn the southern Egyptian city of Luxor, the Kents are shocked by what they see. Away from the resort centre they visit villages and markets deep in the heart of the ‘real’ Egypt, and the Kents are disgusted by the poverty and general poor conditions that surround them: “You really would think you’re back in the days of Jesus,” says Paul.\n\nBut it’s the traditional Egyptian food and no beer to wash it down with that pushes the Kents to breaking point causing a confrontational final breakfast. As tears flow the Wilson family are subjected to a torrent of abuse.\n\n“The thought of getting up and eating this sh*t for breakfast is making me heave,” says Audra. “I think it’s the most stupid place on earth, I think it’s disease-ridden and skanky.”\n\nAfter a tense final day, it’s time to leave the desert and party on in Tenerife. Paul and Audra are finally able to do things their way, and Paul quickly downs a pint of Guinness in record time. A trip to the local supermarket to stock up on provisions means one thing to Paul Kent…alcohol. The sheer amount of booze he buys astounds teetotal Tony Wilson in particular:\n\n“I don’t begrudge anyone having a drink but he has bought enough to sink a battle ship,” he says. “I think it’s a recipe for disaster.”\n\nAfter yet another night out when Audra and Paul get well and truly merry downing six shots of sambuca in a row, the Wilson’s are shocked by their parenting skills when 16-year-old Tully is just as drunk as her mum and dad.\n\nThe next morning, Tony refuses to carry on with the Kents’ holiday unless he can confront Paul about his drinking.\n\nAfter the chat, Paul feels that he was unable to defend himself against Tony’s comments about him as a parent and heavy drinker, and begins to break down. With the last evening meal ahead, will everyone air their true opinions to each other in a boisterous final showdown?","production_code":"","runtime":60,"season_number":5,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-12","episode_number":3,"episode_type":"standard","id":142794,"name":"Magaluf and India","overview":"RECLUSIVE Hare Krishnas, the Falconer-Pughs, live in the rural backwaters of mid Wales. Once a year they make a pilgrimage to Kerala, southern India.\n\nThe fun-loving Foster family, from Doncaster, meanwhile, love nothing more than socialising with fellow Brits in the home-from-home resort of Magaluf. Mum Sharon, dad Harry, pictured below, 19-year-old daughter Teri and 13-year-old Jade have returned to the resort for 15 years. Material girl Sharon is a shoe fanatic and the highlight of her holiday is blowing the family budget shopping. Her daughters share the same values. \"We don't want to be anywhere where there's no electric, we want to look glamourous,\" says Teri.\n\nHoliday Showdown, a programme somehow even more pointless than Loose Women, sees what happens when they accompany each other on their favoured vacations. In terms of contriving conflict, it's the TV equivalent of cock-fighting.\n\nAs the Falconer-Pughs arrive in Magaluf, Sharon is determined to be the perfect host – but Sharon's idea of fun isn't a hit for the Falconer-Pughs. It's not everyone who wants to bounce semi-nude on an inflatable banana.\n\nThe Foster girls, meanwhile, are reduced to tears at the prospect of slumming it in India with no make-up. And yet as the Kerala holiday progresses, something of a miracle happens as the Fosters reflect on their own way of life. As they mingle with the locals, what started as the holiday from hell becomes a life-changing journey.","production_code":"","runtime":60,"season_number":5,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-19","episode_number":4,"episode_type":"standard","id":142795,"name":"Scotland and Lanzarote","overview":"Manoeuvring two families with opposing ideas about life into close quarters and letting the cameras roll may not be the subtlest way to make reality television but, as previous series of Holiday Showdown have shown, it does often make for some compulsively entertaining stuff. And so it is tonight, as the Brown family from Birmingham and the Maybes from Essex take each other on a “dream holiday” for a week. The Browns’ destination of choice is rural Scotland, for a survival holiday in which they construct their own shelters and skin their own food. None of the Maybes are happy about this, least of all their daughter Jade, a trainee beautician who sniffles that “it’s not a holiday; it’s a forest.” Still, with admirable stoicism, they put up with the indignities of outdoor latrines and dour weather and are soon whisked off to their holiday of choice in sunny Lanzarote. Were this a TV drama and not a reality show, the boozy arguments would have begun here; as it is, both families display enough charm and open-mindedness to keep the show from playing to stereotype. The Browns, with one notable exception, actually enjoy eating deep-fried ribs and larking about in the pool; and the Maybes enjoy showing the Browns how to relax, package holiday-style.","production_code":"","runtime":60,"season_number":5,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":5,"episode_type":"finale","id":142796,"name":"Blackpool and Kenya","overview":"The O'Connors are a lesbian couple from Southend who have three sons from previous relationships. They love their winter holidays in Blackpool - choosing to go out of season to save money. By day it's arcades, ten pin bowling and fish and chips on the sea front. By night they hit the lively gay scene, spending their evenings being entertained by the flamboyant drag queens. In contrast, the Truss family from Bournemouth, like to holiday in style on a luxury safari camp in Kenya. With its fine dining and servants, being treated like kings is the order of the day.\n\nThe uptight Truss family is less then impressed with the basic accommodation and bleakness of Blackpool in winter. They struggle to cope with spending night after night in the company of drag queens and trannys but, after being won over by their hosts, they finally let their hair down and find their gay groove.\n\nThe O’Connors are initially uncomfortable with being waited on hand and foot in Kenya, and feel that they don't fit in. When they are asked to dress up for dinner, Lisa looses her temper. But the stunning scenery and opportunity to view the wildlife wins them over. Finally Dawn conquers her fear of heights and Lisa puts a stop to her 20 a day smoking habit.","production_code":"","runtime":60,"season_number":5,"show_id":2063,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":6238,"poster_path":null,"season_number":5,"vote_average":0}}}