{"adult":false,"backdrop_path":"/rMbHGg9J5jnhuIX0Lkv4r7yZ7QI.jpg","created_by":[{"id":111509,"credit_id":"5f74bae240d0fe003434257b","name":"Jean Chalopin","gender":2,"profile_path":null},{"id":176064,"credit_id":"5f74bafe35039800349689c5","name":"Robby London","gender":2,"profile_path":null},{"id":2798231,"credit_id":"5f74bad63ff2df00385088d9","name":"Jean Cheville","gender":0,"profile_path":null}],"episode_run_time":[25,20,30],"first_air_date":"1999-08-30","genres":[{"id":10759,"name":"Action & Adventure"},{"id":16,"name":"Animation"}],"homepage":"","id":20992,"in_production":false,"languages":["en"],"last_air_date":"1999-10-22","last_episode_to_air":{"id":1462274,"name":"Virtual Danger","overview":"Sonic and Manic play a game of virtual reality to enhance their pilot skills. When the two brothers decide to put their practice to use, they fly in a successful mission that intercepts a supply ship from Robotnik. To put the Hedgehogs game to an end, Robotnik decides to invade the simulated world and provoke a less successful outcome for Sonic and Manic.","vote_average":0,"vote_count":0,"air_date":"1999-10-22","episode_number":40,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null},"name":"Sonic Underground","next_episode_to_air":null,"networks":[{"id":184,"logo_path":null,"name":"Syndication","origin_country":"US"},{"id":290,"logo_path":"/fqsd09CrijoGu6qfoNIdgUQmVGO.png","name":"TF1","origin_country":"FR"}],"number_of_episodes":40,"number_of_seasons":1,"origin_country":["FR","US"],"original_language":"en","original_name":"Sonic Underground","overview":"Sonic, Sonia, and Manic are the children of Queen Aleena Hedgehog, the rightful ruler of Mobius, and are pursued relentlessly by Doctor Robotnik and his bumbling bounty hunters sidekicks, Sleet and Dingo. As infants, the siblings were separated and placed in hiding to fulfill a prophecy made by the Oracle of Delphius that the triplets would grow up to find their estranged mother, overthrow Robotnik, and take their places once more as Mobius' rightful rulers.","popularity":20.737,"poster_path":"/29FVFvLt10iFG6Lyu5tks9IWdXT.jpg","production_companies":[{"id":5370,"logo_path":null,"name":"DiC Enterprises","origin_country":""},{"id":171306,"logo_path":null,"name":"Les Studios Tex S.A.R.L.","origin_country":"FR"}],"production_countries":[{"iso_3166_1":"FR","name":"France"},{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":null,"episode_count":15,"id":30947,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"1999-08-29","episode_count":40,"id":30946,"name":"Season 1","overview":"Not long after the birth of Queen Aleena Hedgehog's children Sonic, Manic and Sonia, Dr. Robotnik dethroned the royal hedgehog family and conquering most of Mobius. However, the Oracle of Delphius fortold that Aleena and her children, as the Sonic Underground, would one day form the Council of Four and overthrow Robotnik. But for the prophecy to come to pass, Aleena had to abandon her children.[2]\n\nYears later, Sonic Underground was formed when the siblings were reunited and set on their quest by the Oracle of Delphius.[2] After getting to know each other and mastering their skills, the group set out to find their mother and bring an end to the Robotnik Empire. At the same time, the group would constantly be trailed by Robotnik's top bounty hunters, Sleet and Dingo.[3][4]\n\nAccording to the Oracle of Delphius and other prophecies, the Sonic Underground will eventually find their mother and defeat Robotnik once and for all.","poster_path":"/9I7Nivqoy5xqj5Wa1qY3FmJLnw4.jpg","season_number":1,"vote_average":8}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.9,"vote_count":133,"season_data":{"1":{"_id":"5258651d760ee3466116e122","air_date":"1999-08-29","episodes":[{"air_date":"1999-08-30","episode_number":1,"episode_type":"standard","id":1462260,"name":"Beginnings (Origins, Part 1)","overview":"The history of the Underground is told in detail, from the fall of Mobotropolis to the rise of Robotnik. Included, is a prophecy, as told by the Oracle of Delphius, that caused Queen Aleena to give up her own children so that all people of Mobotropolis could one day be redeemed. As the Queen's children grow and witness tragedy all around them, they soon learn that they are not alone in their urge to fight the evil Robotnik.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1999-08-31","episode_number":2,"episode_type":"standard","id":591666,"name":"To Catch a Queen","overview":"Argus, a captain of the Queen's guard, is captured by Sleet and Dingo before he can reach the secret rendezvous where he was to meet Queen Aleena. While listening to a scanned radio message, Sonic, Manic and Sonia overhear that a queen's guard has been captured and robotisized. The Hedgehogs then begin their pursuit to recapture captain Argus from Robotnik and get the information revealing the secret meeting place where they may be reunited with their beloved mother.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"5904bd6c92514169d000de3f","adult":false,"gender":0,"id":1806121,"known_for_department":"Writing","name":"Pat Allee","original_name":"Pat Allee","popularity":0.6,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"5904bd4dc3a3684a7600d4d9","adult":false,"gender":2,"id":1805765,"known_for_department":"Writing","name":"Ben Hurst","original_name":"Ben Hurst","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-09-01","episode_number":3,"episode_type":"standard","id":591667,"name":"Mobodoon","overview":"Sonic, Sonia and Manic return to their birthplace, Mobodoon, a beautiful, festive town. The homecoming is interrupted when Sleet and Dingo arrive to collect back taxes by order of Dr. Robotnik. Because Mobodoon has no form of currency to pay this bogus debt, Sleet and Dingo decide to raid the village and steal its most precious monuments, including the powerstone, which is the center of Mobodoon's vitality. It is up to the Hedgehogs to get the powerstone back and restore their former home to its previous blissful state.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"5904bd6c92514169d000de3f","adult":false,"gender":0,"id":1806121,"known_for_department":"Writing","name":"Pat Allee","original_name":"Pat Allee","popularity":0.6,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"5904bd4dc3a3684a7600d4d9","adult":false,"gender":2,"id":1805765,"known_for_department":"Writing","name":"Ben Hurst","original_name":"Ben Hurst","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-09-02","episode_number":4,"episode_type":"standard","id":591668,"name":"The Price of Freedom","overview":"Sonia travels to east Mobius to visit her friend Mindy at the LaTour Estate. After being given a watch by her friend Mindy, Sonia discovers that these popular timepieces are really monitoring devices for the Robotnik Intelligence Agency and are mass produced by Mindy's father Mr. LaTour. Sonia, Sonic and Manic confront Mindy and LaTour with this discovery. Realizing the error of his ways, Mr. LaTour ends production and decides to flee with his daughter. The hedgehogs skillfully put the spy devices to their own use to help the LaTour's escape.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-03","episode_number":5,"episode_type":"standard","id":591669,"name":"Underground Masquerade","overview":"Sleet and Dingo plan to collect the taxes owed to Robotnik from the Duke of Velcronia but keep it for themselves. To avoid the wrath of Robotnik, Sleet and Dingo infiltrate the Underground to corral Manic and friends to the commit the crime and take the blame. The scheme is moving along well for the evil duo until they are caught on tape by Max, Manic's friend, who stops the devious Sleet and Dingo enabling the Duke keep his money.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":8,"vote_count":1,"crew":[{"job":"Writer","department":"Writing","credit_id":"5904bfa692514169d800e34e","adult":false,"gender":0,"id":174045,"known_for_department":"Writing","name":"Len Janson","original_name":"Len Janson","popularity":0.664,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-09-06","episode_number":6,"episode_type":"standard","id":591671,"name":"Tangled Webs","overview":"The sinister Robotnik blackmails Cyrus, an old friend of Sonic's, by holding his father hostage. Robotnik makes Cyrus gain the Hedgehogs trust and then has Cyrus convince them to save his father. Cyrus reluctantly informs Robotnik of the rescue plan so Robotnik can devise a trap for the Hedgehogs. However, once Cyrus sees the Hedgehogs helping the kids of Mobius, he realizes assisting in the capture of the Hedgehogs is a bad idea. Instead, Cyrus helps the Hedgehogs and in the process they destroy another of Robotnik's swat-bot factories.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-07","episode_number":7,"episode_type":"standard","id":591670,"name":"The Deepest Fear","overview":"On a trip to Port Mobius, Sonic, Manic and Sonia are told that ships are sinking due to the Mobian sea-beast. The legendary story becomes fishy when the Hedgehogs meet Captain Squeegee who informs them of a scam in which townspeople must rely upon Robotnik for protection from the sea monster, when in reality it is Robotnik who is sinking ships, not a monster. Sonic must overcome his fear of water and the monster to find the truth and thereby ending the fears of the sea side town.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-08","episode_number":8,"episode_type":"standard","id":591674,"name":"Who Do You Think You Are","overview":"Queen Aleena's royal journals are rumored to be buried under a palace in the city of Tashistan. As Sonic and his siblings scour the city in search of the scrolls, Sonia gets into trouble when she is accidentally knocked in the head during a confrontation, causing her to lose her memory. Sonia gets into more trouble when she inadvertently sells her power medallion to a local merchant. A young boy from the village makes an attempt to keep Sonia safe, but the two are captured by Sleet and Dingo. Sonic and Manic must then work together to retrieve the power medallion, locate the journals and find the one thing that is most precious to them, Sonia.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"5904bd6c92514169d000de3f","adult":false,"gender":0,"id":1806121,"known_for_department":"Writing","name":"Pat Allee","original_name":"Pat Allee","popularity":0.6,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"5904bd4dc3a3684a7600d4d9","adult":false,"gender":2,"id":1805765,"known_for_department":"Writing","name":"Ben Hurst","original_name":"Ben Hurst","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-09-09","episode_number":9,"episode_type":"standard","id":591673,"name":"The Last Resort","overview":"While lost in the wastelands of Mobius, Sonic, Manic and Sonia stumble upon an oasis called Lake Valley Resort. Although Sonic is impressed with the beauty of this safe haven, he has a sinking feeling that this village may be under the scope of Robotnik's radar. Sonic's doubts are confirmed when he overhears Stripes, the leader of the village, informing Robotnik that the Resistance is in town.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-10","episode_number":10,"episode_type":"standard","id":591672,"name":"Come Out Wherever You Are","overview":"Sonia is invited to a debutante ball, but before she can be officially announced to society, she and her brothers, Manic and Sonic have an important mission. Robotnik has constructed an evil weapon that will capture and robotisize all members of the resistance all over the world. The Underground must hijack this weapon and insert a deactivating device before the brain of the vehicle is installed. Sonia daydreams about the party, becomes distracted and is caught while executing part of the mission. Sonic aids Sonia to help her focus on their mission and still make an appearance at the ball.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-13","episode_number":11,"episode_type":"standard","id":591676,"name":"Winner Fakes All","overview":"Robotnik organizes a track meet to lure Sonic into a trap. Robotnik is sure that Sonic will not sit out on a challenge of quickness. Sonia and Manic are also aware of Sonic's competitive nature and advise Sonic not to enter the event due to the risk that he may be caught. When Sonia and Manic cannot find Sonic, they head to the race to rescue him. Surprisingly, Sonic does not enter the race, but finds himself involved in a more challenging test of speed - the race to save his brother and sister.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-14","episode_number":12,"episode_type":"standard","id":591675,"name":"A Hedgehog's Home Is Her Castle","overview":"The Hedgehogs receive a message they believe is from their cousin. In the message, a castle is left to Sonia, who revels in the idea of having a castle for the Underground headquarters. Sonic, Manic and Sonia arrive at the castle only to see an old, dark dilapidated structure. Inside the castle, the Hedgehogs all have separate meetings with a mysterious apparition who resembles their mother.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-15","episode_number":13,"episode_type":"standard","id":591677,"name":"Artifact","overview":"The Hedgehogs steal historical artifacts of Mobuis from Robotnik before he can pawn them off at an auction. Sonic and Sonia take one of the pieces to a university professor who informs them that the artifact is actually a bomb from the Mobian war. The Hedgehogs must act fast to retrieve the bomb and protect the treasure that is the key to Mobius past.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-16","episode_number":14,"episode_type":"standard","id":591678,"name":"Bug!","overview":"A faction of the Freedom Fighters is wiped out by a swarm of metallic fly-bots. When Manic goes in search of the insects, he is stung with serum, making him loyal to Robotnik. Sonia finds Manic communicating a radio message to Robotnik and realizes her brother is under a spell. It is up to Sonic to exterminate the metallic pests.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-17","episode_number":15,"episode_type":"standard","id":1462249,"name":"Sonic Tonic","overview":"A speed enhancing fluid deemed Sonic Tonic is created by Robotnik to make him as fast as Sonic so that he may finally catch him. Robinik's plan is successful and Sonic is captured, yet when Dingo begins to feel the side effects of the tonic, Sonic is able to make a run for it with a vial of the tonic in tow. Unaware of the side effects of the tonic, Manic and Sonia, envious of Sonic's speed, decide to use the tonic on themselves.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-20","episode_number":16,"episode_type":"standard","id":1462250,"name":"Friend or Foe?","overview":"The Hedgehogs converge on the Floating Island, in their latest attempt to find their Mother. Sleet and Dingo also have an interest in this island that involves the Chaos Emerald, which is the island's life-force. But, before either party can achieve their goals, they have to get through Knuckles, the floating island's stern guardian.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Knuckles (voice)","credit_id":"642d83e20d2f5300973746b5","order":500,"adult":false,"gender":2,"id":74364,"known_for_department":"Acting","name":"Brian Drummond","original_name":"Brian Drummond","popularity":2.855,"profile_path":"/oNKCHFuMZTASvyayEj3cRXLEjJL.jpg"}]},{"air_date":"1999-09-21","episode_number":17,"episode_type":"standard","id":1462251,"name":"Head Games","overview":"As Sonic begins to chow chili dogs for a snack, he finds a message in the sack from his mother urging him to head to Speedster Island. When he, his brother and his sister arrive, what they encounter is an ancient sanctuary that is about to be overrun by Robotnik and sold off bit by bit. The Hedgehogs must persuade Bartleby to end his deal to build a resort on the beautiful island and save the people of the village from becoming slaves of Robotnik.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-22","episode_number":18,"episode_type":"standard","id":1462252,"name":"When in Rome...","overview":"Sonic becomes frustrated that maybe all of their efforts of fighting for freedom seem futile. Sonia suggests that they go to Oracle, the spiritual guide, to put everything into perspective. The Oracle makes a deal with the Hedgehogs, stating that if they can complete this next mission, he will reveal their future. Instead upon arrival in the ancient city, they discover their power medallions are missing and they are powerless.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-23","episode_number":19,"episode_type":"standard","id":1462253,"name":"The Jewel of the Crown","overview":"Robotnik has his sights set upon Queen Aleena's crown jewel, which glows as it is moved closer her. Sonic, Manic and Sonia plan to recover the jewel from the merchant owner before Robotnik, not only to find their mother, but to protect her as well. The Hedgehogs acquire the jewel and begin their search, the glow becomes more radiant the closer they travel to their destination and their hopes of finding the Queen seem to be a tangible reality.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-24","episode_number":20,"episode_type":"standard","id":1462254,"name":"Three Hedgehogs and a Baby","overview":"Sonic, Manic and Sonia find an abandoned baby in an alley and begin a search for the baby's parents. Manic grows particularly fond of the child and decides that instead of taking the baby to a shelter as Sonic and Sonia ordered, the baby would be more comfortable at the Underground sanctuary.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-27","episode_number":21,"episode_type":"standard","id":1462255,"name":"Dunes Day","overview":"Sonic and his siblings travel to the outskirts of Mobius to recruit a tribe of nomads for the Resistance. The Hedgehogs van breaks down and they are saved by the tribesman. Once they return to the camp, Manic discovers that the chief has been roboticized, which is a secret that could have the chief banished from the tribe.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-28","episode_number":22,"episode_type":"standard","id":1462256,"name":"Mummy Dearest","overview":"Sonic, Manic and Sonia invade Robotnik's lair to retrieve the Hedgehog crest. After the book is reclaimed, they discover that this book contains directions to a scroll that could be an important tool to overthrow Robotnik. The scroll is heavily protected, but Sonic leads the group in the right direction where they eventually encounter the royal Aman-Rapi.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-29","episode_number":23,"episode_type":"standard","id":1462257,"name":"Hedgehog in the Iron Mask","overview":"The Hedgehogs latest quest to find their mother takes them to the prison tower where they encounter a masked stranger who insists he is family. This stranger is actually being used as bait for another attempt by Robotnik to capture them. The stranger creates a rift between the siblings, which leaves the Underground disbanded, vulnerable and ultimately trapped.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-09-30","episode_number":24,"episode_type":"standard","id":1462258,"name":"Six Is a Crowd","overview":"The Oracle advises the Hedgehogs to undertake a mission which could reveal answers about their future. Sonic, Manic and Sonia are thrown into a universe that almost seems to parallel their own, however in this dimension, they are not the in the Underground, the Hedgehogs are the rulers of Mobius. Confused by this world, they begin to explore and suddenly find themselves confronted by a corrupted version of themselves.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-01","episode_number":25,"episode_type":"standard","id":1462259,"name":"Flying Fortress (Chaos Emerald Crisis, Part 1)","overview":"What is supposed to be a vacation for Sonic, Manic and Sonia turns into a battle to save Mobius when Robotnik attacks with his newest weapon - the Flying Fortress. Sonic investigates the ship thinking the weapon can be destroyed by removing its reactor, however his efforts fail and he goes to Knuckles for help, because he believes the weapon is powered by the Chaos Emerald.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-04","episode_number":26,"episode_type":"standard","id":591665,"name":"Wedding Bell Blues","overview":"Robotnik announces that he will marry Queen Aleena in a plot to become the king of Mobius. Upon hearing the alarming news and shocked that their enemy will become their stepfather, Sonic, Manic and Sonia become suspicious that this wedding may be a trap and decide to investigate. The Hedgehogs, aided by Bartleby, are hired to play music for the ceremony. Disguised as 18th century musicians, Sonic and his siblings crash the wedding hoping to find the Queen and bring to light this most obvious sham.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"5904bd6c92514169d000de3f","adult":false,"gender":0,"id":1806121,"known_for_department":"Writing","name":"Pat Allee","original_name":"Pat Allee","popularity":0.6,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"5904bd4dc3a3684a7600d4d9","adult":false,"gender":2,"id":1805765,"known_for_department":"Writing","name":"Ben Hurst","original_name":"Ben Hurst","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-10-05","episode_number":27,"episode_type":"standard","id":1462261,"name":"No Hedgehog Is an Island (Chaos Emerald Crisis, Part 2)","overview":"Sleet and Dingo escape the Flying Fortress with the Chaos Emerald. In a fight over who will control the Emerald's power, Sleet and Dingo drop and break the Emerald in two. Instantly, a rash of earthquakes and other natural disasters are sparked by the emerald's energy. Knuckles and the Hedgehogs turn to a relative of Knuckles for answers of how to stop Mobius from being slowly devoured by the emerald's force.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-06","episode_number":28,"episode_type":"standard","id":1462262,"name":"Getting to Know You (Origins, Part 2)","overview":"The Hedgehogs begin to learn the important lessons of what it takes to be a freedom fighter. The Oracle provides teachers to guide Sonic, Manic and Sonia to develop the necessary skills to recognize the power that comes from within. The Hedgehogs also discover the hidden magical force of the power medallions as they grow to understand that teamwork will serve them best in averting the dangers that await them.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-07","episode_number":29,"episode_type":"standard","id":1462263,"name":"New Echidna in Town (Chaos Emerald Crisis, Part 3)","overview":"Knuckles reluctantly makes a deal with Robotnik to turn over Sonic and his family in exchange for finding the Chaos Emerald that will save Mobius. Knuckles soon regrets that he ever trusted the evil dictator after Robotnik begins to follow through on his plans to roboticize the Hedgehogs.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-08","episode_number":30,"episode_type":"standard","id":1462264,"name":"Harmony or Something (Origins, Part 3)","overview":"Manic, Sonic, Sonia must end their training early when Robotnik threatens the Oracle and takes a member of the resistance hostage. During the rescue mission, the Hedgehogs fall into trouble and begin to place blame upon each other for everything that has gone awry. Queen Aleena then intervenes with an important message for her children that they must learn to work together and derive strength from their willingness to help others.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-11","episode_number":31,"episode_type":"standard","id":1462265,"name":"Country Crisis","overview":"Queen Aleena advises the Hedgehogs to travel to a valley of Mobius so that they can bring about peace between two contingents of the resistance that have split. In the meantime, Robotnik is able to build a dam that is dangerous to the peoples land because of the lack of a cohesive effort to end the construction.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-12","episode_number":32,"episode_type":"standard","id":1462266,"name":"Haircraft in Space","overview":"Robotnik is using the local hairdresser, Doo-bot, to get information on the citizens that are against him. Sonia becomes a victim of the Doo-bots trance during a shampoo and while under the spell, divulges important information that could lead Robotnik to a secret base. The Hedgehogs learn that the Doo-bot is equipped with a recording device and dash to retrieve the tape from the Doo-bot before the secret location is disclosed.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-13","episode_number":33,"episode_type":"standard","id":1462267,"name":"Healer","overview":"A self proclaimed scientist has come to Robotropolis with a device that will reverse the effects of Robotnik's roboticizer. Sonia, Manic and Sonia attend a demonstration of this new technology where Sonia decides she can use it to help her rescue a friend. Sonic, on the other hand, is skeptical that this machine is the real thing and decides to investigate.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-14","episode_number":34,"episode_type":"standard","id":1462268,"name":"Sonia's Choice","overview":"Robotnik has arranged a museum exhibit of the Royal family goblets. Knowing that Sonic, Sonia and Manic will want to reclaim their family's treasures, Robotnik expects the heirlooms will serve as perfect bait to finally capture the Hedgehogs. Sonic and his siblings are aware that this is most likely a trap and devise a counter plan of their own to avoid getting caught.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-15","episode_number":35,"episode_type":"standard","id":1462269,"name":"The Big Melt","overview":"The Hedgehogs vacation is interrupted by the news of Robotnik's latest weapon. They are shocked as the submarine melts the icy landscape from under their feet. The Hedgehogs then scurry to locate the lethal submarine before the entire planet is completely submerged underwater.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-18","episode_number":36,"episode_type":"standard","id":1462270,"name":"Sleepers","overview":"On a mission in a distant sector of Robotropolis, the Hedgehogs are informed that freedom fighters have disappeared and are going to be roboticized. Sonic races to save his friends, but he is too late. The group of freedom fighters have been robotisized, including Cyrus' father.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-19","episode_number":37,"episode_type":"standard","id":1462271,"name":"Bartleby the Prisoner","overview":"Robotnik's new weapon, Art, is the enforcer of Robotropolis new eradication policy. Art's objective is to destroy everything in sight, including Sonic, Manic and Sonia. The giant mechanical beast is seemingly unstoppable until he overhears the musical melodies of the Underground band.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-20","episode_number":38,"episode_type":"standard","id":1462272,"name":"The Art of Destruction","overview":"Robotnik's new weapon, Art, is the enforcer of Robotropolis new eradication policy. Art's objective is to destroy everything in sight, including Sonic, Manic and Sonia. The giant mechanical beast is seemingly unstoppable until he overhears the musical melodies of the Underground band.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-21","episode_number":39,"episode_type":"standard","id":1462273,"name":"The Pendant","overview":"The newly discovered Emerald Peninsula is a perfect place for Robotnik to add slaves to his empire. Sonic, Sonia and Manic are alerted of Robotnik's plan to transplant the peninsula's inhabitants and turn to a fortune teller for help. The mystic advises Sonia of a pendant that could reveal the answer to stopping Robotnik.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-22","episode_number":40,"episode_type":"finale","id":1462274,"name":"Virtual Danger","overview":"Sonic and Manic play a game of virtual reality to enhance their pilot skills. When the two brothers decide to put their practice to use, they fly in a successful mission that intercepts a supply ship from Robotnik. To put the Hedgehogs game to an end, Robotnik decides to invade the simulated world and provoke a less successful outcome for Sonic and Manic.","production_code":"","runtime":null,"season_number":1,"show_id":20992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Not long after the birth of Queen Aleena Hedgehog's children Sonic, Manic and Sonia, Dr. Robotnik dethroned the royal hedgehog family and conquering most of Mobius. However, the Oracle of Delphius fortold that Aleena and her children, as the Sonic Underground, would one day form the Council of Four and overthrow Robotnik. But for the prophecy to come to pass, Aleena had to abandon her children.[2]\n\nYears later, Sonic Underground was formed when the siblings were reunited and set on their quest by the Oracle of Delphius.[2] After getting to know each other and mastering their skills, the group set out to find their mother and bring an end to the Robotnik Empire. At the same time, the group would constantly be trailed by Robotnik's top bounty hunters, Sleet and Dingo.[3][4]\n\nAccording to the Oracle of Delphius and other prophecies, the Sonic Underground will eventually find their mother and defeat Robotnik once and for all.","id":30946,"poster_path":"/9I7Nivqoy5xqj5Wa1qY3FmJLnw4.jpg","season_number":1,"vote_average":8}}}