{
    "adult": false,
    "backdrop_path": "/7fhR6QCvpDCWwakd6BKrJFMKNWX.jpg",
    "created_by": [],
    "episode_run_time": [
        45
    ],
    "first_air_date": "2022-10-26",
    "genres": [
        {
            "id": 35,
            "name": "Comedy"
        },
        {
            "id": 18,
            "name": "Drama"
        }
    ],
    "homepage": "https://www.disneyplus.com/series/sumo-do-sumo-dont/35RKAHulSVtc",
    "id": 210345,
    "in_production": false,
    "languages": [
        "ja"
    ],
    "last_air_date": "2022-12-21",
    "last_episode_to_air": {
        "id": 4053825,
        "name": "Episode 10",
        "overview": "The last team left in the tournament is Hokuto Gakuin, Kyoritsu's long-time rival. Saki tells the guys that they can compete in the co-ed tournament with Honoka the following day if they win. Meiritsukan has already made it to the co-ed tournament, allowing Honoka to go up against Mayu once again. As she has never been allowed to compete in the national tournament as a female, Honoka strongly desires to compete in the co-ed tournament. Banding together for Honoka's sake, the match begins. However, Ren is injured, and Daiki loses in the next matchup. The pressure is on the remaining three to win all their matches.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2022-12-21",
        "episode_number": 10,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 53,
        "season_number": 1,
        "show_id": 210345,
        "still_path": "/agPhMF1lppE7fQRwf7uuIKlYpcM.jpg"
    },
    "name": "Sumo Do, Sumo Don't",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 2739,
            "logo_path": "/uzKjVDmQ1WRMvGBb7UNRE0wTn1H.png",
            "name": "Disney+",
            "origin_country": ""
        }
    ],
    "number_of_episodes": 10,
    "number_of_seasons": 1,
    "origin_country": [
        "JP"
    ],
    "original_language": "ja",
    "original_name": "シコふんじゃった！",
    "overview": "Ryota Moriyama, a senior at Kyoritsu University, receives a job offer at a first-rate company but gets dumped by Saki Nishino. His professor tells him that he can graduate on the condition that he joins the sumo club and competes in at least one match. With only a single member, Honoka Oba, for the past two years, the sumo club is on the brink of collapse. In order to graduate, Ryota endures Honoka’s strict training methods and starts to recruit other members.",
    "popularity": 7.493,
    "poster_path": "/shtZAZY03AYz4vc85jL5dxDo4Yt.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "JP",
            "name": "Japan"
        }
    ],
    "seasons": [
        {
            "air_date": "2022-10-26",
            "episode_count": 10,
            "id": 308837,
            "name": "Season 1",
            "overview": "",
            "poster_path": "/shtZAZY03AYz4vc85jL5dxDo4Yt.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "Japanese",
            "iso_639_1": "ja",
            "name": "日本語"
        }
    ],
    "status": "Ended",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 6.3,
    "vote_count": 3,
    "season_data": {
        "1": {
            "_id": "632392aabb2602007d01727a",
            "air_date": "2022-10-26",
            "episodes": [
                {
                    "air_date": "2022-10-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3958048,
                    "name": "Episode 1",
                    "overview": "Ryota Moriyama, a senior at Kyoritsu University, receives a job offer at a top company but gets dumped by Saki Nishino. On top of that, he learns he will only be able to graduate on the condition that he joins the sumo club, which is on the verge of disbanding. Ryota goes to the club and finds Honoka Oba training there, who is suspicious of Ryota’s motivation for joining. Honoka begrudgingly agrees to let him join, but only if he beats her just once out of ten matches.",
                    "production_code": "",
                    "runtime": 55,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/hm8mUwMRuJBLeFqIJhavL9XHspw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3958312,
                    "name": "Episode 2",
                    "overview": "Honoka performs at an event to showcase school clubs to new students, leading to a sudden influx of male candidates. Arisa Tazawa, the club manager, is overjoyed and enters the club into the All Japan Qualifiers. However, the candidates run away after experiencing Honoka's strict training. Saki, the chief editor of the university's editorial club, shows up with Ren Noguchi for an interview. Ren becomes a fan of Honoka after seeing her perform and asks to be in charge of covering the sumo club, after which he finds out that Honoka was runner-up at a national tournament as a middle and high schooler. Despite the shortage of members, Kumada demands that they participate in a tournament. Ryota and the others recruit new members, allowing them to participate in the tournament.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/e15Lay8ZB6EEDmwkQC1DIR4cFX2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-02",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3958313,
                    "name": "Episode 3",
                    "overview": "Honoka runs into Tomio Aoki, an alumnus of the Kyoritsu sumo club whose book inspired Honoka to enroll in Kyoritsu University. However, the book is filled with lies, and the other alumni are still angry over it. Meanwhile, Kumada promises Ryota and the others a reward should they win just one team match. A student named Shun Kato visits the club under the pretense of doing an editorial cover story. Kato heads back to the dojo and runs into Aoki, causing a major commotion.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/424nd2HoZS7IxVwL0h7uC4TUBE0.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-09",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4053819,
                    "name": "Episode 4",
                    "overview": "With four male members in the club now, Ryota and the team train hard. The day of the tournament finally arrives. Aside from Hokuto Gakuin, the other schools do not seem to be that strong. However, Ryota and the team are nervous for their first tournament. Kyoritsu's alumni gather to watch the matches with expectations. Ryota and the team are given a choice to quit. Ryota decides he has fulfilled the condition to graduate. Meanwhile, Honoka feels prepared for the female event taking place the next day and trains with the help of Kaito.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/lRv8DV0wUJSQgU83bQXuoc8MXoO.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-16",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4053820,
                    "name": "Episode 5",
                    "overview": "On the day of the women's tournament, Honoka once again meets Mayu Motohashi, the top wrestler for Meiritsukan University. Ryota distances himself from sumo but still wonders about Honoka's matches. He watches the video recordings of the matches sent by Shun, Ren, and Yuma, and is touched by Honoka's earnest attitude towards sumo. Ryota hurries to the tournament, making it in time for Honoka's semi-final match against Mayu. Although Ryota feels helpless in his own sumo skills, he realizes his love for sumo after speaking with Saki. Despite this, he cannot find an excuse to return to the dojo. Meanwhile, Honoka meets Sakurako Yoshino. She is surprised by her strong physique and invites her to join the sumo club.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/qBLsxaQGTkA5Iye8fahMB31Qqog.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-23",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4053821,
                    "name": "Episode 6",
                    "overview": "Summer's here, and the Kyoritsu University sumo club is participating in a training camp. Ryota, Shun, and Ren treat it as a fun vacation, but once they arrive, they learn that they will be training with Hokuto Gakuin, the champions of the sumo league. Exhausted by the rigorous training, Ryota and the others leave the training grounds in search of some fun. They find a bar where they eat and fall asleep, but find themselves unable to pay the bill in the morning. Told that the meal would be free if they can win one sumo match, they are brought to a place where three elderly men and children are training. However, Ryota and the others are soundly defeated. They then receive advice from a certain man to help them improve their skills. On that very night, Yoshioka confesses to Honoka.",
                    "production_code": "",
                    "runtime": 51,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/q0gu365LJAlN0OC2PUWnXBN6VUh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-30",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4053822,
                    "name": "Episode 7",
                    "overview": "During their rest day, Mayu suggests to Ryota that they go on a double date upon learning of Yoshioka and Honoka's date. Ryota keeps a close watch over Yoshioka as Honoka and Mayu have fun. Yoshioka shows up to the training session the following day ready to battle. Meanwhile, Mayu asks Honoka to join her sumo club, but Honoka insists on staying with Kyoritsu. On the last day of the training camp, something unexpected happens while Ryota is walking Saki home.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/z7MIzlzH3SPrLK0ALLchkkTeN9X.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-12-07",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4053823,
                    "name": "Episode 8",
                    "overview": "The summer training camp is over, and the fall tournament is near. The four members of the Kyoritsu sumo club are determined to win their first match. However, Ryota is unable to stay focused as he is uncertain about how he feels about that night with Saki. Meanwhile, Kawarada from the ekiden club joins the sumo club, creating a team of five. In the women's tournament, Honoka is matched up against Mayu.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/dHEgSrsauVZwxpVUxnHGmm2hO2J.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-12-14",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4053824,
                    "name": "Episode 9",
                    "overview": "Ryota trains hard for the tournament, with Honoka advising him. Natsuko and Arisa are deeply moved to see the team united. Honoka's graduation is approaching, and the thought of parting ways with Ryota saddens her. Meanwhile, she hears that Natsuko and Aoki are planning the first-ever co-ed tournament. She meets with the director and expresses her desire for Kyoritsu to join but is told that they would have to win a league tournament in order to do so. On the day of the tournament, Yuma fails to show up. Without any other choice, Ryota and the remaining members compete and go up against Shikokukan University.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/sefubrcwlan9ZwaEBhx0tsy6rz2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-12-21",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 4053825,
                    "name": "Episode 10",
                    "overview": "The last team left in the tournament is Hokuto Gakuin, Kyoritsu's long-time rival. Saki tells the guys that they can compete in the co-ed tournament with Honoka the following day if they win. Meiritsukan has already made it to the co-ed tournament, allowing Honoka to go up against Mayu once again. As she has never been allowed to compete in the national tournament as a female, Honoka strongly desires to compete in the co-ed tournament. Banding together for Honoka's sake, the match begins. However, Ren is injured, and Daiki loses in the next matchup. The pressure is on the remaining three to win all their matches.",
                    "production_code": "",
                    "runtime": 53,
                    "season_number": 1,
                    "show_id": 210345,
                    "still_path": "/agPhMF1lppE7fQRwf7uuIKlYpcM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 308837,
            "poster_path": "/shtZAZY03AYz4vc85jL5dxDo4Yt.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    }
}