{"adult":false,"backdrop_path":"/yU0wBCJXNCuSElw71HzMwOonlEh.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2020-03-17","genres":[],"homepage":"","id":211060,"in_production":false,"languages":["en"],"last_air_date":"2020-04-11","last_episode_to_air":{"id":4213692,"name":"Dorothy’s Rosy Tea-Time","overview":"The Wiggles are having a rosy tea party with Dorothy the Dinosaur. We sing and dance to Super Anto at the Wiggly Arena. Le James cafe' is serving Irish Stew, it's Anthony's favorite thing to eat. Let's join hands and do the dance from Ireland, The Irish Stew. Wags the dog plays a trick on Paul and he ends up with gooey mud cake with a dollop of cream all over his face. Oh Wags!","vote_average":0,"vote_count":0,"air_date":"2020-04-11","episode_number":26,"episode_type":"finale","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/w4MVKQ6PiIgRPNyb9sESa4hgAlX.jpg"},"name":"The Wiggles: The Wiggles World","next_episode_to_air":null,"networks":[],"number_of_episodes":26,"number_of_seasons":1,"origin_country":["AU"],"original_language":"en","original_name":"The Wiggles: The Wiggles World","overview":"New adventures from the world's number one children's act. Beloved children's entertainers The Wiggles are back with a brand new, super-sized series featuring new faces, songs and locations! This series will debut 'The Cartoon Wiggles' with six animated music videos, and will introduce new performances including Le James Café and Lachy's Curly World as well as visit old favourites, such as Emma's Bow Room. Shirley Shawn the Unicorn makes her first ever appearance, and special guests include Broadway star James Harkness (Ain't Too Proud) and Paul Knobloch (The Australian Ballet). Features many spectacular clips from The Wiggles live in concert, from some of their biggest shows from around the world. There'll be celebrations, building with blocks, games and dress ups, weather reports and a puppet show!","popularity":2.372,"poster_path":"/hAltDBa2SWi2NjJBzTsj88u6Yrr.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"AU","name":"Australia"}],"seasons":[{"air_date":"2020-03-17","episode_count":26,"id":310263,"name":"Season 1","overview":"The Wiggles are back with new friends, new songs and old favorites, plus performances from their biggest live shows all around the world. The Wiggles World opens up so many new adventures for children around the world.","poster_path":"/iPGwZyppzQGDfLm8qumR4aovY9M.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"63325cd0d3d38700822aa8f3","air_date":"2020-03-17","episodes":[{"air_date":"2020-03-17","episode_number":1,"episode_type":"standard","id":3976108,"name":"Five-Fingered Family","overview":"It's rainy outside! What could The Wiggles do Today? They decide to dress up as clowns and perform. Get your hands ready - we're off to the wiggly arena to have some fun with Five Fingered Family. Curly Bird from Curly Town has given Lachy a letter from the King of Curly Town, and Lachy has been invited to a Japanese tea ceremony- how exciting!","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/iTB4yyB8mdUbEctxoVtYtLbdFDX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-18","episode_number":2,"episode_type":"standard","id":4213654,"name":"Avo, Avo, Avocado!","overview":"It's time to go to Le James Cafe, where James and Paul the dancing waiter are serving up smash avacado, Emma's favorite, can you do the smashed avocado dance? Wags the Dog plays a trick on Paul and he ends up with custard pie cream all over his face. Oh Wags! Dance along with Henry's Dance at the wiggly arena.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/1BdoJ12xkFjhmU01P5BJMOPUKVz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-19","episode_number":3,"episode_type":"standard","id":4213660,"name":"We've Got Our Glasses On","overview":"It's time for some Romp Chomp a Stomp with Dorothy at the wiggly arena. Let's all push our arms up in the air from side to side. Let's look inside Emma's Weather Bag! She find a hat and sunglasses- it's going to be a sunny day today. Join The Wiggles as they sing and dance to the Canadian alphabet, celebrating everything Canadian. Then it's time for The Cartoon Wiggles in an all new animated music video which encourages children to wear their glasses - I've got my glasses on.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/tGTr0LYyEVIlCrpO3meyFchU4n1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-20","episode_number":4,"episode_type":"standard","id":4213661,"name":"Cowboy Fun","overview":"The Wiggles are busy putting on their shoes, taking their time and making sure their laces look fine. Anthony is off to Le James Cafe. Today's special is Cowboy Chilli! Anthony and Wags learn how to eat the cowboy way. Wags the Dog plays a trick on Paul and he ends up with ice-cream all over his face. Oh Wags! Then it's off to wiggly arena with Lachy and Ponso the Pony. Let's go riding with Ponso the Pony. Yipee-aye-aye.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/1MBgulq5YHhynHNnQzTucLDzcj0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-21","episode_number":5,"episode_type":"standard","id":4213662,"name":"Shirley Shawn the Unicorn","overview":"Emma loves to tap dance - when she was very young, she would practice all the time. Join Emma as she reminisces about learning to tap, with a little help with The Little Wiggles. It's time to Look Both Ways with The Cartoon Wiggles, as road safety is such an important issue. Join Simon and Shirley Shawn the Unicorn with Simon's Story Time and meet Billy the Butterfly. Lachy is signing and Dancing with fruit in his hat at the wiggly arena.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/b4ptEUetNdDGwUkdqSyagn6pJ5V.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-22","episode_number":6,"episode_type":"standard","id":4213663,"name":"We're All Friends","overview":"It's time for Lachy's Inventions, which never seem to work as planned! Join in with Music with Anthony and enjoy some beautiful ballet and highland dancing! Join our curly haired friend Lachy, in Curly World because we're all friends.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/uhwYfoGDpLQbNDR63VpI0pELH1C.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-23","episode_number":7,"episode_type":"standard","id":4213664,"name":"Stinky Cheese Day!","overview":"Join Simon and The Wiggles live at the Wiggly Arena for a game of Simon Says. Then it is off to Le James Cafe- but what's that strong smell? It's stinky cheese day at the cafe. Pong appetite! Lachy and Wags love their cheese snack so much that they break into dance and sing about cheese. Wags the Dog plays a trick on Paul and he ends up with Vanilla slice all over his face. Robert Rakete our New Zealand friend along with a Kapa Haha Group, Join Emma and Simon with Have a Good Day Kia Pai to Ra.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/jw5R7lp5Ro6dMiSZrBQxR6tzzeP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-24","episode_number":8,"episode_type":"standard","id":4213665,"name":"Lachy's Curly World","overview":"Join The Wiggles and Captain Feathersword as they have a little party. Lachy receives a message from the King of Curly Town - the Curly Town Ballerina would like some music so she can dance! King Sam and Lachy and joined by self-professed 'first hijab ballerina', Stephanie, as she dances some beautiful ballet. The Cartoon Wiggles sing all about allergies - do you have Ooey, Ooey, Ooey, Allergies? It's off to the Wiggles Arena, put out your arms and Let's Do the Propeller.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/jamHboY0vr1WWlkXbjBK2Sof8kk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-25","episode_number":9,"episode_type":"standard","id":4213671,"name":"World Record Dancing","overview":"Paul the dancing waiter is serving up turkey at Le James Cafe. Flap your wings and scratch, scratch, scratch with the Turkey Dance. Then It's time for The Wiggles to set a world record for dance, with the help of The Little Wiggles. They Just keep dancing and dancing and dancing. It's Irish Dancing time at the Wiggly Arena with I'll Tell Me Ma. Jump with your feet and clap your hands.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/qTBoSJoZhE43myBKMgbcG7jWdjH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-26","episode_number":10,"episode_type":"standard","id":4213672,"name":"A King Who Liked to Sing!","overview":"It's Irish Dancing Time with Anthony and Emma to the Hard Shoe Hornpipe! Lachy dances and prances and becomes a king in Curly Word today, you an be Royal too! In story time with Simon and his friend Shriley Shawn the Unicorn, we meet Terry the strutting turkey. 'Wibble Wobble, Gobble Gobble!'","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/lWLIPw2mG6ypvZGVTqiietvmJq7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-27","episode_number":11,"episode_type":"standard","id":4213673,"name":"Surfer Bop","overview":"Paul the dancing waiter serves up \"Surf and Turf\" to Anthony and Wags at Le James Cafe. Everyone grooves to the Surfer Bop, let's all Dance! Wags the Dog plays a trick on Paul and he ends up with cake all over his face. Jamaaladeen Tacuma Play his bass guitar at the wiggly arena and it's something quite special.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/o9jKvDz3Yu89umEzrhTS9aTHSDc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-28","episode_number":12,"episode_type":"standard","id":4213674,"name":"Emma's Weather Bag","overview":"Today stars with Hot Potato at the wiggly arena. Captain Feathersword reads the weather report and it's a blow me down weather day. Emma goes into her weather bag and finds a jacket, a scarf, and lip balm for her drive in the bow mobile to the wiggle house. Lachy has been up since dawn working about dear Shirley Shawn because he ripped a picture draw by Vaughn. Wow, it's Rhyme time.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/lq6X9y4wBSpQEPoEW2iYjp8cyXM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-29","episode_number":13,"episode_type":"standard","id":4213675,"name":"Sticky Rice Cake Surprise","overview":"The Wiggles are trying on all types of hats. Hats are groovy, you wear them on your head, they comes in lots of colors like puprle, green and red. It's time to guess the secret dish that will be served at Le James Cafe, what could it be? It's of the color orange and has seeds you can scoop out. Get your dancing shoes ready, it's time to make a Pumpkin Face. Wags the dog plays a trick on Paul and he ends up with sticky rice cakes all over his face. Let's all sing Toot Toot, Chugga Chugga in the Big Red Car.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/io3ErHJsATzZQx6dVpuiyQJMgrg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-30","episode_number":14,"episode_type":"standard","id":4213676,"name":"Broccoli Bunch","overview":"Join Captian Feathersword and do the Captain's Wobbly Dance! James the owner of Le James Cafe has Broccoli on the menu today! Dance along to the Broccoli Bunch which encourages us all to eat these delicious and healthy vegetables. The Wiggles have lots of catch songs about tasty food, it's time for Pappadum. Wags the Dog plays a trick on Paul and he ends up with cheesecake all over his face. Oh Wags!","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/1n9r15bgcYqshP5VXF4WJSVA7uP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-31","episode_number":15,"episode_type":"standard","id":4213677,"name":"A Puppet Show","overview":"Anthony loves the sound of the electric guitar and plays a number of songs for us to enjoy. The Little Wiggles take us back in time to see Anthony playing his guitar. The King of Curly Town would like Lachy to do a puppet show. We meet Spot the Dalmatian, Zurich the Zebra and Phil the Platypus. Wash Your Hands with The Wiggles, use soap and water while you count to fifteen.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/u5CWHj9Pzf0pOd4fO8tKoYlvw5e.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-01","episode_number":16,"episode_type":"standard","id":4213678,"name":"Funny Face","overview":"Simon dresses up as Gregory Griggs, who has 47 different wigs. Here is a song about the world's tallest (Africa's grooviest)- it's The Giraffe! Lachy shows us how to make a funny face in Curly World. It's Scotch Eggs day at Le James Cafe, The Wiggles sing a song about this delicious treat.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/4cAPUYZG9euqbuRXIQkkMT9u41J.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-02","episode_number":17,"episode_type":"standard","id":4213679,"name":"Put The Pop In The Popcorn","overview":"Meet Emma's cat 'Banjo', He Likes lots of cuddles. It's Party Day at Le James Cafe, so James is serving party food to put us in the party mood. Wags the dog plays a trick on Paul and he ends up with fruit salad and yogurt all over his face. Oh Wags! Now let's shake your hips with Wags the Dog at the Wiggly Arena.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/fMUjAMqtzMEnerj146m9TmC2mJM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-03","episode_number":18,"episode_type":"standard","id":4213680,"name":"Double Talk With Captain","overview":"With one little spray of Lachy's lavender mist, people learn to speak with a twist! It's always fun in the Wiggle House. We meet Willy the wobbly worm during Story Time with Simon and Shriley Shawn the Unicorn. Hooray! It's time for The Cartoon Wiggles singing about visiting the doctor. At the Doctors we'll help your child look forward to regular check-ups. The Wiggles Town Navy are dancing to The Sailor's Hornpipe at the Wiggly Arena, clap your hands.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/gjT08QqSUHqFdBa3T3VdmgZnF0v.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-04","episode_number":19,"episode_type":"standard","id":4213682,"name":"Hot Dog!","overview":"The Wiggles have fun building with blocks. Anthony places the last piece and it tumbles down - oh no!! Paul the dancing waiter serves up vegan hot dogs at Le James Cafe. Hot Vegan Diggity Dog! Wags the Dog plays a trick on Paul and he ends up with chocolate eclairs all over his face. Oh Wags! Emma rides on her ballet bicycle, it's ride, ride, bicycling riding at the wiggly arena.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/i0QPBoZ93qDXDbSIFEb4hVnyzzv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-05","episode_number":20,"episode_type":"standard","id":4213685,"name":"Cream Pie Fun","overview":"Dance Along with The Wiggles and Dorothy the Dinosaur at the Wiggly Arena. It's rainy and wet today, Emma looks inside her weather bag and finds lots of things to keep her dry: A raincoat, Gumboot and umbrella. Then it's time to take a plane ride to the Wiggle House. Anthony makes a delicious pie and remember when he was a Little Wiggle and Simon and Lachy ended up with pie cream on their faces. Oh Anthony!","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/hWB1Pjm5SYvrARbra8rNFc583wz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-06","episode_number":21,"episode_type":"standard","id":4213687,"name":"It's Sunny Today","overview":"Simon helps us in choosing what to wear for different weather. James the dancing waiter serves up pretzels at Le James Cafe, join in doing the pretzel. Wags the dog plays a trick on Paul and he ends up with ice-cream all over his face. Can you stand on one foot and shake your hands? We join Anthony, Lachy and Simon as we all point our fingers and do the twist.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/4Fkgv7673SkqwHa1TQeegTt1bsT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-07","episode_number":22,"episode_type":"standard","id":4213688,"name":"The Curly Bird","overview":"It's International Dance like a Octopus Day so Henry the Octopus is here to show us how to dance. Now let's clap our hands above our heads and sway from side to side. King Sam of Curly Town would like Lachy's help cheering up a yellow bird in town. The Curly Town bird joins the yellow bird to dance some beautiful ballet. It's time to Rock-a-Bye Your Bear at the wiggly arena. Lachy is sleeping and starts to dance all styles of dance while sleeping. Wake up Lachy!","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/nP6iv5wfhBVzKSu91MmCBxJqIPv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-08","episode_number":23,"episode_type":"standard","id":4213689,"name":"Dance Spectacular!","overview":"Anthony has forgotten how to laugh! Lachy, Simon and Emma can't seem to help Anthony get back his laugh so they call on the Laughing Doctor to help. Join Emma, Lachy and lots of their Wiggly Friends for a wiggletastic dance spectacular. Who Took the cookie from the cookie jar? Could it be Captain Feathersword, Dorothy or Wags? Join The Wiggles at the wiggly arena to find out who?","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/ggW3uKaDGXmMpS8wLStxc9sNxmb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-09","episode_number":24,"episode_type":"standard","id":4213690,"name":"Sensational Salsa","overview":"Meet Anthony's Dog Fergus, and we can all Scrubby, Dub Dub and wash our pets. Paul the dancing waiter is serving Chunky Salsa today at Le James Cafe. It's time to dance the Salsa to this musical dish. Wags the dog plays a tick on Paul and he ends up with homemade apple pie all over his face. Oh Wags! It's time for some bagpipe fun, clap your hand with Anthony. Join the Dancing horses and fish at the wiggly arena","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/u1nZJQdgOGOcHUYLIzfPSVta13s.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-10","episode_number":25,"episode_type":"standard","id":4213691,"name":"Little, Little, Little Lord Fauntleroy","overview":"The Wiggles are joined by Little, Little, Little lord Fauntleroy, who is here to play music. Anthony plays the director and fun ensues. The Cartoon Wiggles are here in an all new animated music video, Shirley Shawn the Unicorn. Emma sings for Little, Little, Little Lord Fauntleroy, but can she impress director Anthony. Captain Feathersowrd joins The Wiggles at the wiggly arena for Three Little Ducks. Lachy perfumes the Skeleton scat for Little, Little, Little Lord Fauntlerory, but it needs to be more up tempo - Simon and Emma come to help.","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/A6PKiPpk1cIlWC02aiYAYUVOqrO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-11","episode_number":26,"episode_type":"finale","id":4213692,"name":"Dorothy’s Rosy Tea-Time","overview":"The Wiggles are having a rosy tea party with Dorothy the Dinosaur. We sing and dance to Super Anto at the Wiggly Arena. Le James cafe' is serving Irish Stew, it's Anthony's favorite thing to eat. Let's join hands and do the dance from Ireland, The Irish Stew. Wags the dog plays a trick on Paul and he ends up with gooey mud cake with a dollop of cream all over his face. Oh Wags!","production_code":"","runtime":10,"season_number":1,"show_id":211060,"still_path":"/w4MVKQ6PiIgRPNyb9sESa4hgAlX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"The Wiggles are back with new friends, new songs and old favorites, plus performances from their biggest live shows all around the world. The Wiggles World opens up so many new adventures for children around the world.","id":310263,"poster_path":"/iPGwZyppzQGDfLm8qumR4aovY9M.jpg","season_number":1,"vote_average":0}}}