{"adult":false,"backdrop_path":"/rJPQs2GgY7SeaqmNk739qorLlNQ.jpg","created_by":[],"episode_run_time":[45],"first_air_date":"2009-07-01","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":21665,"in_production":false,"languages":["en"],"last_air_date":"2017-12-17","last_episode_to_air":{"id":2987755,"name":"There Are Twigs In My Urine","overview":"A man develops a strange growth on his wrist; a nurse finds twig-like pieces in her urine; and a pregnant woman falls ill with flu-like symptoms.","vote_average":0,"vote_count":0,"air_date":"2017-12-17","episode_number":12,"episode_type":"standard","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null},"name":"Monsters Inside Me","next_episode_to_air":null,"networks":[{"id":91,"logo_path":"/m3KrDu1g96YByhH0wp4OvyghgsG.png","name":"Animal Planet","origin_country":"US"}],"number_of_episodes":76,"number_of_seasons":8,"origin_country":["US"],"original_language":"en","original_name":"Monsters Inside Me","overview":"Part horror movie, part medical detective story, find out what happens when people fall prey to an infection from a parasite, those nasty microscopic creatures found in water, soil and even in the air. Victims' stories are retold, including how doctors and scientists attempt to unravel each case before it's too late. Biologist Dan Riskin, assisted by doctors and experts who witnessed each case, leads the scientific discussion about each parasite.","popularity":13.531,"poster_path":"/rf5uz7repORPo9B3QElI4EsFll1.jpg","production_companies":[{"id":57099,"logo_path":"/17wDGCSsPxVhuFGxCF6KALV8g6F.png","name":"Optomen Productions","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":null,"episode_count":3,"id":322427,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2009-07-01","episode_count":6,"id":31440,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2010-06-09","episode_count":10,"id":31441,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2012-10-05","episode_count":10,"id":31442,"name":"Season 3","overview":"","poster_path":"/bY9WpR97TjP4CVVoRKWXEfSfqlz.jpg","season_number":3,"vote_average":0},{"air_date":"2013-09-30","episode_count":10,"id":31443,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2014-10-09","episode_count":10,"id":85115,"name":"Season 5","overview":"","poster_path":"/hDSaFy7cLdQatQSZajtsB2WlFux.jpg","season_number":5,"vote_average":0},{"air_date":"2015-10-29","episode_count":10,"id":71662,"name":"Season 6","overview":"","poster_path":"/mnLEl8DqGi6ni3gqzCLAy2fdQ7p.jpg","season_number":6,"vote_average":0},{"air_date":"2016-10-06","episode_count":7,"id":80805,"name":"Season 7","overview":"","poster_path":"/1QTReCa5O13UsgJavqiNFM00Q4t.jpg","season_number":7,"vote_average":0},{"air_date":"2017-10-15","episode_count":13,"id":94042,"name":"Season 8","overview":"","poster_path":"/boeo2z0cDkehbxEJUq5JIhPJhzC.jpg","season_number":8,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":8,"vote_count":11,"season_data":{"1":{"_id":"52586aa2760ee346611af5d1","air_date":"2009-07-01","episodes":[{"air_date":"2009-07-01","episode_number":1,"episode_type":"standard","id":598879,"name":"Sleeper Cells","overview":"These killers lie dormant, waiting for the right time to strike. Eleven-month-old Garrett Richardson ingests the eggs of a worm, and within days the creature travels to his brain and goes about feeding on its tissue. A Vietnam veteran survived the enemy attacks on the front lines, but back at home — unknown to him — a killer is stealthily working its way through his body, laying waste to his organs and lymph system. By the time the medical evidence reveals the source many years later, the killer is long gone. And John Figge and many of his family members live for six years with unwanted hitchhikers from Africa traveling around in their bodies. Only when one of these creatures begins to attack John's brain are they discovered. Can the family get rid of these deadly parasites before the damage is critical?\n\nThese are all stealthy predators that get inside their hosts, yet work on very different timetables. Dangerous and often hard to detect, this is the story of the war on sleeper cell parasites.","production_code":"","runtime":null,"season_number":1,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-08","episode_number":2,"episode_type":"standard","id":598880,"name":"Outbreak","overview":"Across the United States, doctors and scientists are fighting a war against some of nature's deadliest creatures — parasites. It is a race against time when a mysterious organism strikes a mid-western city causing the worst parasitic outbreak in the history of the United States. Before the culprit is contained, 100 innocent people have died. In Chicago, doctors must track down a hidden killer that attacks a group of students on a spring break trip, and a flesh-eating monster is on the loose in a Texas community.","production_code":"","runtime":null,"season_number":1,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-15","episode_number":3,"episode_type":"standard","id":598881,"name":"Sex Maniacs","overview":"Perfecting the art of reproduction have made parasites the most successful life form on the planet. There are some who are violent, manipulative and have taken sex to the extreme. These parasites are sex maniacs.\n\nA New Jersey woman finds her apartment infested with one of the most ubiquitous parasites on earth — bed bugs. Part of the reason for their success is the males' aggressive approach to sex, a method known as \"traumatic insemination.\" A cyclist from Colorado discovers that the insect bites on his head are from botflies. In Oklahoma, a chemical sprayer's cough turns out to be the result of parasitic worms that multiply in the human lung.","production_code":"","runtime":null,"season_number":1,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-22","episode_number":4,"episode_type":"standard","id":598882,"name":"Masters of Disguise","overview":"Parasites are ruthless, single-minded and above all devious. To become the most prolific life forms in the world takes a degree of cunning that others can only marvel at. Meet the most deceptive parasites on the planet, the \"Masters of Disguise.\"\n\nTeenager Mallorie Greiner has Acanthamoeba keratitis, a parasite that's intent on eating her cornea. Doctors are bewildered at first because her symptoms look just like herpes. Runner Rick DiMichele is struck down with a debilitating disease. Initially, doctors think it's cancer, then malaria; eventually, they discover he has a tick-borne disease called Babesiosis. And not until he's staring death in the face do Mohammed Meah's doctors find the real cause of his problem: a parasitic worm called Strongyloides that's been lurking undetected in his small intestine and living off the steroids he was taking to combat his colitis.","production_code":"","runtime":null,"season_number":1,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-29","episode_number":5,"episode_type":"standard","id":598884,"name":"Hijackers","overview":"Nature is a war zone and parasites are the ultimate fighters. They are hungry, they are ruthless and they don't play by the rules. Parasites have evolved countless ways of hijacking their hosts' bodies: some steal food from inside the gut, others lurk in the blood sapping their host's nutrients and some even target their host's brain.\n\nThese are some of the most horrific cases of parasitic infection in the United States. In Virginia a vicious creature is on the rampage, its next victim is an innocent child. In Michigan a brutal killer has invaded a traveler's blood, and a summer's day at a Florida lake turns into a nightmare when a ruthless monster attacks a young boy's brain.","production_code":"","runtime":null,"season_number":1,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-05","episode_number":6,"episode_type":"finale","id":598883,"name":"Living with the Enemy","overview":"In Virginia a young woman is attacked by an invincible brain-eating monster that threatens to take her life. A Midwestern farmer does battle with a beast that cannot be killed and a New Yorker is infected with the deadliest parasite on the planet. Three parasites that are almost impossible to destroy; three victims, fighting for their lives. If doctors cannot cure them their only hope of survival is by living with the enemy inside them.","production_code":"","runtime":null,"season_number":1,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":31440,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"52586aa2760ee346611af5dc","air_date":"2010-06-09","episodes":[{"air_date":"2010-06-09","episode_number":1,"episode_type":"standard","id":598889,"name":"Suicide Attackers","overview":"A fit and active dance instructor is suddenly stopped in her tracks by unbearable abdominal pain and vomiting, and a mysterious mass in her colon is revealed to have decaying worms. A middle-aged banker gets seizures from a parasite he picked up from traveling to his home country, Haiti. A scientist finds worms from Africa that threaten to damage his sight living in his skin and eyes.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-16","episode_number":2,"episode_type":"standard","id":598891,"name":"Feeding Frenzy","overview":"A schoolteacher deals with an amoeba that eats at his liver and causes him high fever, abdominal pain, sweating, and chills. A young dancer gets worms from eating contaminated pork in her muscle tissue, causing her to get hives all over her body and her limbs to become stiff and painful. A retiree gets scabies from mites he got from staying in the hospital in the past.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-23","episode_number":3,"episode_type":"standard","id":598893,"name":"Cold Blooded Killers","overview":"A nine-year-old hockey player comes down with encephalitis from the Acanthamoeba, which causes him to lose his concentration and balance, almost killing him. A computer programmer gets severe malaria from the Plasmodium parasite that makes him lose control of his mind and post-malarial neurological symptoms two weeks after an apparent recovery. A marathon runner deals with Leishmaniasis, which causes his spleen to swell.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-07","episode_number":4,"episode_type":"standard","id":598890,"name":"Lurkers","overview":"The Crytosporidium parasite infects a little girl, causing her severe vomiting and diarrhea. A microscopic amoeba kills a firefighter with an autoimmune disorder by causing him meningitis. A rare, vicious tapeworm detaches the retina in a teenaged girl, destroying vision in her left eye.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-14","episode_number":5,"episode_type":"standard","id":598892,"name":"Flesh Eaters","overview":"A cat scratch leads to a horrifying result for a veterinary volunteer; strange liquid oozes from a college student's arm.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-28","episode_number":6,"episode_type":"standard","id":598894,"name":"Stowaways","overview":"Stories of parasites that reside inside their traveling hosts; an Iraq war veteran pulls a foot-long worm from his body.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-04","episode_number":7,"episode_type":"standard","id":598885,"name":"Breeders","overview":"Daily stomach cramps reveal some of the most common parasites in nature.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-11","episode_number":8,"episode_type":"standard","id":598886,"name":"Double Agents","overview":"A man tries hookworms to cure his allergies; a bloodsuckers gets into a writer's nose.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-18","episode_number":9,"episode_type":"standard","id":598887,"name":"Homegrown Enemies","overview":"A middle-aged man who has been caring for his ailing mother gets Babesiosis from walking barefoot to the mailbox. Since he lost his spleen from cancer, he gets severe diarrhea, in addition to fever, fatigue, and night sweats. An active, busy middle-aged woman experiences stomach cramps, explosive diarrhea, lightheadedness, and blurred vision from the Toxocara parasite, which she probably got from contaminated food. An older mother of five children deals with nausea, loss of appetite, muscle spasms, and vomiting from the Strongyloides worm, which she may have picked up from being in contact with infected soil. Because of steroids she took for her breathing problems, her body became more vulnerable to the parasite.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-25","episode_number":10,"episode_type":"finale","id":598888,"name":"Shape Shifters","overview":"A seven-year-old girl suffers from seizures from a pork tapeworm after being adopted at the age of three from Nepal. A forty-five-year-old machinist deals with blurry and double vision, leaving him legally blind in his left eye, from a raccoon roundworm that he picked up from his turkey hunting. A forty-one-year-old anaethesiologists, along with twenty-eight other anaethesiologists from two different counties, suffer from stomach cramps and crippling diarrhea from the Cyclospora parasite after eating raspberries infected with human feces.","production_code":"","runtime":null,"season_number":2,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":31441,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"52586aa2760ee346611af5e7","air_date":"2012-10-05","episodes":[{"air_date":"2012-10-05","episode_number":1,"episode_type":"standard","id":598895,"name":"My Child Will Only Eat Cat Food","overview":"A toddler starts worrying her parents when she loses her appetite for the foods she normally eats, but starts craving salt and even cat food. After developing a rash, her parents find out that she has been infected by the Toxocara canis parasite. A middle-aged executive of a company starts to feel pain in his abdomen, not knowing that he has been infected by a bacteria called ESBL E. coli. A married couple start to feel flu-like symptoms, which turns out they've been infected by the plague bacterium. However, the husband's condition is much worse, and even has to get his calves amputated.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-12","episode_number":2,"episode_type":"standard","id":598896,"name":"Something's Eating My Son Inside Out","overview":"A teenage boy starts complaining of nasal pain and fever after a swim in the lake. It eventually turns out that he has been infected by a rare but flesh-eating bacteria called Chromobacterium. A young actress starts to get mastitis while breastfeeding her baby. A teenage college student gets infected by a fungus called Blastomyces.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-19","episode_number":3,"episode_type":"standard","id":598897,"name":"My Face Eating Parasite","overview":"A man suddenly grows a pimple that seems minor at first, but eventually oozes and makes his face swollen. A young man that works at a homeless shelter suddenly starts to feel a sharp pain in his back. At first is seems like a simple back injury, but it eventually gets so sharp it spreads to arms and legs. A school-aged boy starts to get a headache after a visit to a friend's house. It doesn't seem too bad at first, but he eventually develops a fever and lays unconscious. It later turns out he is suffering from a condition called Valley Fever.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-26","episode_number":4,"episode_type":"standard","id":598898,"name":"My Daughter Is Losing Her Mind","overview":"A fairly young part-time student starts feeling a throbbing headache, which causes her to have the flu and then meningitis. When she starts hallucinating, it's clear she has a teratoma on her ovary that contains brain cells. An eight-year-old boy starts getting a pain in his stomach and vomiting. It seems that the cause is food poisoning at first, but he soon starts to feel intense pain and swelling in his legs, leading to the discovery that he is suffering from a disease where the flu virus attacks the muscle cells. A self-employed plumber starts to vomit just after starting to work night shifts. He tries to hide the condition, but he soon starts misspelling words.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-02","episode_number":5,"episode_type":"standard","id":598899,"name":"Something's Eating My Dreams","overview":"A teenage girl has been enjoying her life of gymnastics and nature, when she suddenly receives a scratch on her hand. The problem seems minor, but the scratch fails to heal and becomes several lesions, which also spread to her eyes. The infection appears to be caused by the MRSA bacteria, but it turns out that it is actually caused by Mycobacterium marinum. A middle-aged man suddenly feels as if he's choking and coughs hard. Initially, it appears to be a case of pneumonia, but after a surgery to fix his spine, he develops stabbing pain in his throat. The coughing returns, and it turns out that he did, indeed, swallow a can tab. A young man suddenly starts complaining of itchiness in his body. He develops a headache, nausea, body aches, and an inability to urinate. Tests show that the man has developed meningitis from rat lungworm disease.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-09","episode_number":6,"episode_type":"standard","id":598900,"name":"A Monster's Taking My Baby","overview":"A middle school teacher has been having a healthy pregnancy until suddenly, she starts experiencing abdominal cramps and diarrhea. It initially appears to be a case of the flu, but she soon starts bleeding during episodes. At this point, the young woman appears to have hemorrhoids, which progressively worsen. Tests show that she has been infected by the Cryptosporidium parasite. A retired schoolteacher enjoys his retirement with his wife, when suddenly, he feels a lack of appetite for his favorite food. It doesn't appear to be an issue at first, but his appetite continues to decline, and he starts coughing frequently. His coughing fits worsens to the point where breathing becomes incredibly difficult. It appears to be pneumonia, but it turns out that a pea has been lodged in his lung. A young truck driver has been fairly healthy, when suddenly, discovers a strange speck in his vision. Later, he develops pain, irritation, and blurry vision in his right eye.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-16","episode_number":7,"episode_type":"standard","id":598901,"name":"I Coughed Up Worms!","overview":"A young mother expecting her second child suddenly comes down with a stuffy nose and itchy throat. They appear to be typical flu symptoms, but she still feels feverish and soon starts coughing. Her breathing deteriorates to the point where she cant' breathe on her own anymore. It turns out that the young woman has developed an Acinetobacter infection. An energetic college student has been healthy, until she suddenly feels like she can't get enough oxygen and starts wheezing. She develops bouts of coughing so bad that she even coughs up worms. The student learns that she has been infected by the Ascaris worm the whole time. A teenage girl living in the countryside suddenly gets headaches. At first, it appears to be from stress, but she soon becomes irritable and develops triple vision. Worse, she even collapses and experiences a seizure. Only when it's too late that it becomes clear that the teenager has had rabies.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-23","episode_number":8,"episode_type":"standard","id":598902,"name":"My Brain Has Been Hijacked","overview":"A 1-year old boy who survived a premature birth starts resisting food, suffering a fever, and coughing up blood. After being rushed to the emergency room, the doctors find out that the cause was the boy swallowing a button battery, which burned a hole in his esophagus. A 21-year-old college student from Canada starts suffering a headache that lasts longer than it should. And soon, she starts getting hallucinations, her head starts twitching, she forgets what her age is, and she even starts having grand mal seizures. While resting in the preparation room for brain surgery, she suddenly gets up and yells, then passes out. Eventually, it is discovered that she has an abscess in her brain that caused an infection caused by Streptococcus milleri, which was caused by getting her tongue pierced. A mother/wife starts to get a headache, and soon she also experiences fever, body aches, dizziness, and foul-smelled urine. Her doctor soon discovers that she has an infection called Dengue fever.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-30","episode_number":9,"episode_type":"standard","id":598903,"name":"You Left What Inside Me?","overview":"A little girl's health begins to deteriorate when she suddenly comes down with a fever. She then develops reddish spots on her body, stops breathing on her own, and even suffers kidney and liver failure. A spinal tap reveals that the little girl has meningococcal disease. Unfortunately, the disease causes too much damage that the doctors have to amputate her left arm. A home contractor has been relatively healthy, until he suddenly begins to gain weight in his abdominal area, which turns out to be caused by a large tumor. After removal of the tumor, the man feels excruciating pain that spreads from his abdomen to his lower back and chest. Initially, it appears to be part of his recovery process, but an x-ray shows that a retractor has been left in his body after the surgery. 7-year old Kyle Lewis's life turns into a living nightmare when he starts complaining of headaches, and starts vomiting.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-07","episode_number":10,"episode_type":"finale","id":598904,"name":"Killer in My Neck","overview":"A young aspiring artist suddenly comes down with flu-like symptoms and a swollen face. To make matters worse, his eyes are yellow, he has trouble breathing, and one of his eyes protrude strangely. It turns out that he has Lemierre's syndrome. An active girl's life is put on hold when she starts feeling fatigue and out of breath. Later, she also starts experiencing extreme joint pain, and she gets diagnosed with Lyme's disease. However, further testing shows that the girl has Babesiosis, in addition to chronic Lyme's disease. An active middle-aged woman becomes concerned when she suddenly feels lumps in her chest. After getting them removed, she then starts experiencing bleeding from her right breast. After getting that taken care of, though, she feels a growing lump in her right breast, which turns out to be two surgical sponges.","production_code":"","runtime":null,"season_number":3,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":31442,"poster_path":"/bY9WpR97TjP4CVVoRKWXEfSfqlz.jpg","season_number":3,"vote_average":0},"4":{"_id":"52586aa2760ee346611af5f2","air_date":"2013-09-30","episodes":[{"air_date":"2013-09-30","episode_number":1,"episode_type":"standard","id":598905,"name":"The Flesh-Eating Monster","overview":"A 7-year-old girl contracts the bubonic plague and suffers a 107 fever, vomiting, painful buboes, and seizures; a yoga instructor finds out that what she thought was influenza is actually necrotizing fasciitis caused by Streptococcus intermedius and Peptostreptococcus; a state wrestling champion contracts angiostrongyliasis.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-07","episode_number":2,"episode_type":"standard","id":967242,"name":"There's a Worm in My Eye","overview":"A teenage ballerina suffers from painful migraines and muscle failures; a young missionary's skin crawls when he uncovers an unholy revelation.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-11","episode_number":3,"episode_type":"standard","id":967243,"name":"Choosing Between Life and Limb","overview":"A newly engaged Illinois man mysteriously collapses and suffers organ failure and gangrene from Legionnaire's disease. His fiance gazes in horror as he must choose between life and limb; a perky animal-loving eight-year-old girl survives rabies – a disease with a 99% fatality rate; a college freshmen almost goes blind from a bout of Acanthamoeba keratitis.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-18","episode_number":4,"episode_type":"standard","id":967244,"name":"It Came From a Tick...","overview":"A mother suffers with abdominal pain and nausea for four years until the true cause of her condition is discovered; a 2-year-old girl develops a mysterious lump on her neck.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-25","episode_number":5,"episode_type":"standard","id":967245,"name":"My Husband is Hallucinating","overview":"A small-town boy's summer fun is cut short by a life-threatening Neisseria meningitidis infection. An oil rig worker and daredevil experiences sensitivity to light, muscle pain and horrifying hallucinations from Trichinella spiralis after eating bear meat. A former beauty queen suffers an extreme case of asthma for one year from a nasal packing contaminated with Aspergillus niger fungi.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-11","episode_number":6,"episode_type":"standard","id":968336,"name":"Dying Abroad","overview":"A Peace Corps volunteer traveling to Burkina Faso suddenly suffers from excruciating bouts of nausea and diarrhea from Entamoeba histolytica, and must find medical help before it is too late; a young woman almost suffocates due to hantavirus pulmonary syndrome she got from breathing dust while cleaning up contaminated with mouse feces; an 18-month-old boy gets infected with Baylisascaris procyonis worms which cause his brain to swell and have neurological damage, eye fluttering, and unresponsiveness.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-11","episode_number":7,"episode_type":"standard","id":972682,"name":"Maggots Are Eating Me Alive","overview":"A teenager caught in the 2011 Joplin tornado in Missouri is recovering in the hospital when he suddenly suffers from a life-threatening case of zygomycosis. A couple traveling who visited South Africa get maggots under their skin; a man suffers coughing fits, severe headaches, vertigo, and violent episodes (including chasing his son with a wrench and punching him in the face) before doctors discover the fungus Cryptococcus neoformans has infected his brain.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-18","episode_number":8,"episode_type":"standard","id":969486,"name":"A Deadly Swim","overview":"A teenage boy develops stomach pains, starts vomiting blood and fecal matter, and has nausea from accidentally swallowing a bristle from a grill brush, which got lodged in his intestines; in 2011, a 16-year-old girl who swam in a Florida river experiences a headache, fever, vomiting, mental confusion, unusual behavior and dies from amoebic meningitis; an industrial painter has difficulties breathing and walking from Blastomyces dermatitidis.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-18","episode_number":9,"episode_type":"standard","id":969487,"name":"My Christmas From Hell","overview":"A special episode with three cases that happened during the holidays – A newlywed woman gets a constant pain in her scalp from botfly larvae; a Virginia man gets sharp back pains and develops a hole in his heart from Streptococcus viridans; a female business consultant and part-time photographer gets valley fever.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-18","episode_number":10,"episode_type":"finale","id":969488,"name":"I Almost Killed My Baby","overview":"A newborn baby develops hydrocephalus from a parasitic disease called toxoplasmosis, which was contracted from his mother; an 11-year-old boy suffers headaches, vomiting, seizures, and starts speaking gibberish from being infected with the eastern equine encephalitis virus; a teenager living on a farm suffers a severe cough and fever from Paragonimus kellicotti.","production_code":"","runtime":null,"season_number":4,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":31443,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"58a5f81ec3a3681b95001298","air_date":"2014-10-09","episodes":[{"air_date":"2014-10-09","episode_number":1,"episode_type":"standard","id":1270671,"name":"My Daughter's Going Crazy","overview":"A teenage girl begins having strange mood swings from anti-NMDA receptor encephalitis; an elderly mother gets chills, hand numbness, wrist pain, and oozing blisters from Vibrio vulnificus she got from being pricked by a crab while making a stew; an athletic military veteran from the Afghan war competing in reality shows returns home from Fiji feeling hotness, a pinching sensation in her arms and toes, and hallucinations from rat lungworm she got from eating a slug in a reality show in the jungle","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-16","episode_number":2,"episode_type":"standard","id":1270675,"name":"West Nile Attack!","overview":"A 6-year-old boy suffers a nasty cough, fever, and vomiting from valley fever; a newlywed husband becomes paralyzed from the waist down due to the West Nile virus; an international journalist suffers extreme stomach cramps, night sweats, chills, nausea, and fever from Entamoeba histolytica.","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-23","episode_number":3,"episode_type":"standard","id":1270677,"name":"A Menace in My Own Backyard","overview":"A 23-year-old athlete/construction worker suffers multiple grand mal seizures and high fevers from eastern equine encephalitis; a hard-edged tough guy suffers severe stomach pains and loss of appetite from accidentally swallowing a grill bristle; a 17-year-old cheerleader who recently got her driver's license suffers a swollen, itchy eye and excruciating eye pains from Acanthamoeba keratitis she got from contact lenses.","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-06","episode_number":4,"episode_type":"standard","id":1270680,"name":"The Killer in the Lake","overview":"A contractor gets hit in the head with a tool, and later starts getting a pounding headache, dizziness, spotty vision, and nausea from having a nail punctured into his brain; a football player in college gets extreme headaches, a stuffy nose, and blurred vision from Aspergillus fungi entering his brain; in 2012, an 8-year-old boy suffers constant vomiting, fatigue, seizures, and eventually dies from amoebic meningitis after being infected with Naegleria fowleri.","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-13","episode_number":5,"episode_type":"standard","id":1270685,"name":"There's a Worm Crawling in My What?","overview":"A Canadian science-lover and traveler suffers a painful lesion caused by botfly larvae; a video game programmer gets suffers from constant vomiting and coughing. When doctors find a large mass in his chest, it is discovered that he has histoplasmosis, which was contracted from inhaling bat droppings in a cave; a 15-year-old girl gets an extremely sore throat, a headache, nausea, and body pains from Lemierre's syndrome.","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-20","episode_number":6,"episode_type":"standard","id":1270692,"name":"Vampire Parasites Attack","overview":"A war veteran suffers fatigue, high fevers, night sweats, strange rashes, bloody urine and jaundice from babesiosis; a 15-month-old baby girl suffers fever, dry mouth, vomiting and bloody diarrhea from E. coli O157:H7, whom she got from drinking raw milk; a biologist suffers extreme fatigue, back pains, anxiety, and vertigo from Aspergillus-contaminated breast implants","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-04","episode_number":7,"episode_type":"standard","id":1270688,"name":"A Holiday in the Hospital","overview":"The second episode of the series to be Christmas-themed – a saleswoman gets a stabbing headaches and a constant burning sensation in her right eye from a Dirofilaria immitis worm that is in her eye; a store manager gets stomach pains, fatigue, nausea, vomiting and even a constantly moving stomach from a surgical sponge being left and forming a hole in his colon; a grandmother working in the forest service gets abdomen pains, fatigue, and pneumonia from Strongyloides stercoralis worms invading her intestines.","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-11","episode_number":8,"episode_type":"standard","id":1270691,"name":"My Body Is Rotting","overview":"A teenager gets coughing, shoulder pains, dizziness, and nausea from Cryptococcus gattii fungi invading her lungs; a saleswoman gets extreme pain in her breast from a brown recluse spider (Loxosceles reclusa) bite; a religious youth organizer gets swelling of multiple parts of the body over the course of three years from the Loa loa worm.","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-11","episode_number":9,"episode_type":"standard","id":1270693,"name":"The Brain Colonizer","overview":"A Canadian 13-month-old toddler gets breathing difficulties and mild vomiting from accidentally swallowing a button battery (for what the doctors originally thought was a coin); a college freshwoman gets migraines, nausea, on-and-off blindness, hallucination-like partial seizures, repulsive taste and two lesions in her brain from infection with Taenia solium; in 2008, a 6-year-old girl gets a headache, a rash, high fevers, and dies from Rocky Mountain spotted fever.","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-18","episode_number":10,"episode_type":"finale","id":1270694,"name":"I Smell Like Death","overview":"A 29-year-old man gets tooth pain and almost dies of necrotizing fasciitis caused by the bacteria Streptococcus intermedius and Peptostreptococcus; a female financial adviser gets fatigue, joint pain, mental confusion, hair loss, and muscle weakness for over three years from Lyme disease; a 7-year-old boy gets a loss of appetite, abdominal pains, a fever, diarrhea, constant vomiting, and weight loss from Cryptosporidium.","production_code":"","runtime":null,"season_number":5,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":85115,"poster_path":"/hDSaFy7cLdQatQSZajtsB2WlFux.jpg","season_number":5,"vote_average":0},"6":{"_id":"563225efc3a3681b54012dc0","air_date":"2015-10-29","episodes":[{"air_date":"2015-10-29","episode_number":1,"episode_type":"standard","id":1133149,"name":"There's Something Living In My Knee","overview":"A 4-year-old boy literally drowns in his own mucus, being a victim of an outbreak of the Enterovirus D68 virus; a 7-year old scrapes his knee on a rock at the beach, but when his father puts a liquid bandage on it, it causes it to swell the size of an orange – then, his mother squeezes the wound and finds a sea snail (Littorina scutulata) inside; a college student experiences loss of appetite, fatigue, fever, jaundice, and repetitive nightmares that turn into a reality from getting infected with malaria caused by the Plasmodium falciparum parasite after returning from a trip to Ghana.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-29","episode_number":2,"episode_type":"standard","id":1133150,"name":"Help! My Son is a Leper","overview":"An athlete gets headaches, stomach pains, breathing difficulties, and a liver mass from Entamoeba histolytica from a trip to Nicaragua; a teenager develops a leg welt and then gets fatigue and red spots on his body over the course of several years. When the spots open, the doctors discover he has leprosy from coming into contact with an infected nine-banded armadillo (Dasypus novemcinctus). A woman suffers severe headaches, nausea, vomiting, and seizures from Exserohilum rostratum fungi invading her brain.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-05","episode_number":3,"episode_type":"standard","id":1270695,"name":"My Vacation From Hell","overview":"During a fishing vacation, a soccer coach goes into septic shock from Vibrio vulnificus necrotizing fasciitis after banging his ankle on a barnacle; a 7-year-old girl gets facial tics, bouts of anxiety, and turns suicidal after a streptococcal brain infection; a makeup artist gets severe stomach cramps and watery diarrhea from Giardia lamblia.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-05","episode_number":4,"episode_type":"standard","id":1270696,"name":"There's a Fungus in My What!?!","overview":"A newlywed woman gets extreme headaches, memory problems, sinus pressure, and painful rashes, while her husband gets endless nosebleeds, breathing problems, and brain fog, both from Aspergillus; a councilman loses his spleen to visceral leishmaniasis; a 6-year-old gets a fever, red spots, a swollen mouth, loss of appetite, leg weakness, and breathing difficulties from rat bite fever caused by Streptobacillus moniliformis.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-12","episode_number":5,"episode_type":"standard","id":1270698,"name":"Worms Are Eating My Lungs","overview":"An 11-month-old boy experiences wheezing and vomiting after swallowing a button battery; a landscaper becomes infected with Paragonimus kellicotti; a female boxer gets a severe headache, a 105 fever, and impaired vision from cat scratch fever caused by Bartonella henselae.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-19","episode_number":6,"episode_type":"standard","id":1270701,"name":"An Amoeba is Eating My Brain","overview":"A 2-year-old girl experiences severe pain, trouble breathing, and vomiting from a bark scorpion sting; a neuroscientist experiences multi-organ failure and nearly dies from a leptospirosis infection that he caught while swimming in Hawaii; a 20-year-old woman suffers from severe vomiting, extreme headaches, twitching and a strange crawling sensation in her head that turns out to be caused by Balamuthia mandrillaris and dies from it.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-03","episode_number":7,"episode_type":"standard","id":1270704,"name":"The Eyeball Eater","overview":"A young college student contracts Acanthamoeba keratitis from sleeping in her contact lenses; an infant becomes temporarily paralyzed and almost dies from accidental ingestion of soil that contained the most deadly toxin known to science, botulinum toxin. A new mother has extreme pain from a piece of gauze that was left inside her abdomen during a C-section.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-10","episode_number":8,"episode_type":"standard","id":1270706,"name":"The Backyard Killer","overview":"A California teenager nearly suffocates from hantavirus pulmonary syndrome; a Hawaiian personal trainer suffers years of excruciating neuropathic pain from ciguatera poisoning caused by Gambierdiscus toxicus toxins; a Michigan health worker nearly dies from babesiosis.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-17","episode_number":9,"episode_type":"standard","id":1270710,"name":"All I Got For Christmas Is Brain Surgery","overview":"The third episode of the series to be Christmas-themed – A baby is having problems controlling the left side of her body, along with multiple miniature seizures before doctors discover the right side of her brain is malformed due to a Cytomegalovirus infection; a PR executive suffers a year-long ailment that turns out to be a cyst caused by Echinococcus granulosus tapeworms infecting her spleen; seizures ruin a schoolteacher's Thanksgiving, and when they worsen around Christmas, doctors discover a pork tapeworm cyst.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-22","episode_number":10,"episode_type":"finale","id":1270712,"name":"They Hijacked My Eyeball","overview":"A 13-year-old boy gets a cut on his leg that nearly leads to amputation when it becomes infected with Staphylococcus aureus, causing necrotizing fasciitis; a couple move into their new home, but over the course of three years, the man suffers a spreading/oozing rash, poor coordination, body aches, breathing difficulties, and weight loss, while his girlfriend suffers memory loss, fatigue, and suicidal depression, both from chronic low grade carbon monoxide poisoning; an 8-year-old girl from Hawaii gets a growing mass in her eye from Toxocara canis.","production_code":"","runtime":null,"season_number":6,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":71662,"poster_path":"/mnLEl8DqGi6ni3gqzCLAy2fdQ7p.jpg","season_number":6,"vote_average":0},"7":{"_id":"57f5ee2192514116e6001626","air_date":"2016-10-06","episodes":[{"air_date":"2016-10-06","episode_number":1,"episode_type":"standard","id":1229437,"name":"Backyard Killers","overview":"This episode looks back at three cases from past episodes: a teenage boy with a grill bristle in his intestines (A Deadly Swim); another teenage boy with leprosy (Help! My Son is a Leper); and a teenage girl whose lungs are afflicted with Cryptococcus gattii fungi (My Body Is Rotting).","production_code":"","runtime":null,"season_number":7,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-13","episode_number":2,"episode_type":"standard","id":1231462,"name":"I Have a What in my What?","overview":"A infant becomes totally paralyzed after accidental exposure to botulinum toxin; a Texas man develops severe pain in his scrotum for which doctors think is an ingrown hair, but it actually turns out to be botfly larvae which infected him while he urinated outdoors in Costa Rica; a Florida model/dentist is confounded by her mysterious weight gain, and over the course of a year she suffers continuing weight gain, blurry vision, crippling hand pain, and muscle weakness before it is discovered her breast implants are contaminated with Aspergillus fungi.","production_code":"","runtime":null,"season_number":7,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-20","episode_number":3,"episode_type":"standard","id":1231463,"name":"There's Something Living In My Hand!","overview":"An Idaho 17-year-old football player is struck with a sore throat, breathing difficulties/lung pain, confusion, kidney failure and even tackles his own mother from Group A streptococcus bacteria infecting his blood; an Illinois mother of three kids develops an itchy eye which leads to face numbness, loss of depth perception and blindness as the result of an Acanthamoeba keratitis infection; a dockmaster develops crippling pain in his hand from a Mycobacterium marinum infection along with pimples on his palm from barnacles growing in his hand.","production_code":"","runtime":null,"season_number":7,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-27","episode_number":4,"episode_type":"standard","id":1390783,"name":"My Wife is Rotting","overview":"During a family vacation cruise, a Louisiana 2-year-old is restless and drools, which leads to vomiting and kidney and liver failure due to abrin poisoning after accidentally eating a bead from a necklace made of the rosary pea plant on a trip to Jamaica; a California mother-of-two develops a bloated and descended stomach and colon, a body-wide rash, fluid in her abdomen and meningitis from valley fever caused by Coccidioides immitis; a 6-year-old boy suffers a headache, vomiting, blindness and bizarre neurological symptoms which include crossed eyes, that prove fatal. Only when it is too late is it discovered that he was infected with the Balamuthia mandrillaris amoeba.","production_code":"","runtime":null,"season_number":7,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-03","episode_number":5,"episode_type":"standard","id":1236822,"name":"My Hands Are Falling Off","overview":"A Canadian woman suffers a piercing pain in her throat and vomiting from accidentally swallowing a grill bristle (for which she thought was a sprig of rosemary) which got caught in her throat during a barbecue; an Arizona retired firefighter vacationing in Belize develops growing and eventually opening purple bumps on his limbs, lethargy, and hand pain from cutaneous leishmaniasis; a Nebraska 14-year-old girl is struck with swollen lymph nodes in her neck, dizziness, fatigue, blackouts, and body pain from Tularemia.","production_code":"","runtime":null,"season_number":7,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-10","episode_number":6,"episode_type":"standard","id":1390781,"name":"My Evil Twin is Driving Me Crazy","overview":"A four-year-old Pennsylvania boy gets a runny nose with red discharge, stomach pains, pale skin and extreme pain from accidentally putting a button battery up his nose; an Idaho college student gets a cut on her knee, but then develops agonizing leg pain followed by septic shock from an Aeromonas hydrophila infection; a Pennsylvania woman has strange outbursts and appears to lose her mind from a teratoma growing on her ovary giving her Anti-NMDA receptor encephalitis.","production_code":"","runtime":null,"season_number":7,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-15","episode_number":7,"episode_type":"finale","id":1390782,"name":"Holiday from Hell","overview":"The show's fourth Christmas-themed episode, and the second episode of the series that looks back at three past cases, including: a baby whose brain was infected with Cytomegalovirus in utero (All I Got For Christmas Is Brain Surgery); a woman whose eye is infected with the worm Dirofilaria immitis (A Holiday in the Hospital); and a man who has a surgical sponge left in his colon (also A Holiday in the Hospital).","production_code":"","runtime":null,"season_number":7,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":80805,"poster_path":"/1QTReCa5O13UsgJavqiNFM00Q4t.jpg","season_number":7,"vote_average":0},"8":{"_id":"59e396b3c3a368463a013e09","air_date":"2017-10-15","episodes":[{"air_date":"2017-10-15","episode_number":1,"episode_type":"standard","id":1380233,"name":"Help! I'm Being Eaten Alive","overview":"A young girl is brought to the hospital with stabbing pains in her scalp; a mother's mysterious symptoms threaten to tear a family apart; a deadly invader turns a relaxing vacation into a nightmare.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-15","episode_number":2,"episode_type":"standard","id":2987741,"name":"My Brain Is Under Attack","overview":"A man falls comatose; a college student has a sore throat; and a young woman's symptoms confound experts.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-22","episode_number":3,"episode_type":"standard","id":2987743,"name":"My Second Brain Is Killing Me","overview":"A man has something living in his eye; a young girl mysteriously falls ill; and a woman's bizarre symptoms push her to the brink of insanity.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-29","episode_number":4,"episode_type":"standard","id":2987745,"name":"The Monster in My Mouth","overview":"An infant falls mysteriously ill; a biology professor becomes an unexpected host; and a family man is brought to the brink.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-05","episode_number":5,"episode_type":"standard","id":2987749,"name":"There's a Maggot in My Head","overview":"A new mother is in critical condition; a young boy has an ailment that no antibiotics can cure; and a young man has an invader in his brain.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-12","episode_number":6,"episode_type":"standard","id":2987750,"name":"Something Is Eating My Baby","overview":"A young boy has a strange condition; a woman's symptoms push her to madness; and a toddler falls into a trance-like state when something begins eating his brain.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-19","episode_number":7,"episode_type":"standard","id":2987751,"name":"Braced for Death","overview":"A teenager develops mysterious blotchy sores; an athlete is hit by a rare infection; and a woman battles strange bouts of vomiting.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-26","episode_number":8,"episode_type":"standard","id":2987752,"name":"I Can't Stop Coughing Up Blood","overview":"A man coughs up blood; a newlywed husband is struck down by a rare disease; and a father struggles with abdominal pain.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-03","episode_number":9,"episode_type":"standard","id":2987753,"name":"The Organ Shredder","overview":"An infant is suddenly paralyzed; a father is infected with a monster that threatens to blind him; and a woman's excruciating pain confounds doctors.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-10","episode_number":10,"episode_type":"standard","id":2987754,"name":"My Lungs Are Rotting","overview":"A woman is struck down by a dangerous parasite; an infant falls mysterious ill; and a fungus brings a young man to the brink of death.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-17","episode_number":11,"episode_type":"standard","id":4133704,"name":"All I Got For Christmas","overview":"After a man hits his head, he's left fighting a one-on-a-million medical mystery; a boy's wounded knee becomes home to an uninvited guest; a man unwittingly feeds his own intended killer.","production_code":"","runtime":null,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-17","episode_number":12,"episode_type":"standard","id":2987755,"name":"There Are Twigs In My Urine","overview":"A man develops a strange growth on his wrist; a nurse finds twig-like pieces in her urine; and a pregnant woman falls ill with flu-like symptoms.","production_code":"","runtime":41,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-01","episode_number":13,"episode_type":"finale","id":3045898,"name":"Holiday Hell: Why Is My Abdomen Full of Boils?","overview":"Christmas time is here, and these three victims each receive a monstrous gift. In Florida, a woman is out Christmas shopping when she suddenly feels a stabbing pain in her eye so severe that she believes she sees shadows of worms in her eye.","production_code":"","runtime":42,"season_number":8,"show_id":21665,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"","id":94042,"poster_path":"/boeo2z0cDkehbxEJUq5JIhPJhzC.jpg","season_number":8,"vote_average":0}}}