{"adult":false,"backdrop_path":"/xZ1JQMu9JCx1ZDpDZ1PUHzVDqkm.jpg","created_by":[{"id":237754,"credit_id":"52586b71760ee346611ba843","name":"Tom McGillis","gender":2,"profile_path":"/bi1hZMgS5I55aiN0PNyr6jep2Ys.jpg"},{"id":1224731,"credit_id":"52586b71760ee346611ba83d","name":"Jennifer Pertsch","gender":0,"profile_path":null}],"episode_run_time":[30,22],"first_air_date":"2009-06-25","genres":[{"id":16,"name":"Animation"},{"id":18,"name":"Drama"},{"id":35,"name":"Comedy"}],"homepage":"","id":21761,"in_production":false,"languages":["en"],"last_air_date":"2011-04-28","last_episode_to_air":{"id":600253,"name":"Grom Fest","overview":"It is time for Gromfest, the biggest teen surf competition on the West Coast. Everyone's excited to participate, except for Johnny, who has to take care of Bummer, who is sick.","vote_average":0,"vote_count":0,"air_date":"2011-04-28","episode_number":26,"episode_type":"finale","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null},"name":"Stoked","next_episode_to_air":null,"networks":[{"id":83,"logo_path":"/mE2ElX5BSeUhiT3V8qUhLjd3Nbz.png","name":"Teletoon","origin_country":"CA"}],"number_of_episodes":52,"number_of_seasons":2,"origin_country":["CA"],"original_language":"en","original_name":"Stoked","overview":"Stoked is a Canadian animated TV series produced by Fresh TV Inc. It is produced by Jennifer Pertsch and Tom McGillis and premiered on Teletoon on June 25, 2009. It airs on Teletoon in Canada and ABC3 in Australia, and formerly aired on Cartoon Network in the United States. The series is from the same creators as 6teen and the Total Drama series.","popularity":18.469,"poster_path":"/7KnqmnjwsxC114ZLhuscaOoEsJx.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2009-06-25","episode_count":26,"id":31543,"name":"Season 1","overview":"","poster_path":"/vqj8jLN3A2zVog0u9jIShPNhmFC.jpg","season_number":1,"vote_average":0},{"air_date":"2010-09-16","episode_count":26,"id":31544,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.579,"vote_count":19,"season_data":{"1":{"_id":"52586b6e760ee346611ba419","air_date":"2009-06-25","episodes":[{"air_date":"2009-06-25","episode_number":1,"episode_type":"standard","id":600226,"name":"Welcome to Paradise, Dudes!!!","overview":"Emma, Fin, and Reef make it to Sunset Beach for the summer of their lives at Surfer's Paradise. When they arrive, they find the resort they are working at is a complete \"Kooksville\" resort, but they meet locals Broseph and Johnny. On their first day at the job, the groms must clean the resort after the owner's daughter, Lauren, throws a wild end-of-the-year school party.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-25","episode_number":2,"episode_type":"standard","id":600227,"name":"Another Grom Bites the Dust","overview":"The first day of work is always brutal, but the gang has it worse when Bummer is going to fire the person with the worst evaluation. After they finally get off work, Emma has to clean her clothes after it gets sprayed by a skunk, in addition to being stuck with a mean roommate, Martha McCartney who is fired at the end. Seeing how bad her first day is, Broseph teaches Emma how to surf.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-05","episode_number":3,"episode_type":"standard","id":600228,"name":"Board and Confused","overview":"The new employees get stuck with one of the worst things ever, their initiation. It's where the seniors, led by the snobbish Kelly, make them do humiliating things for the whole day. If the groms are able to endure the stuff, the seniors will take them to an secret section of the beach with the best waves, \"The Office\", which only a select few get to see.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-12","episode_number":4,"episode_type":"standard","id":600229,"name":"The Very, Very, Very, Very, Very Important Guest","overview":"The Hotel Management is anxious over the arrival of a Mr. Stanley Stevens—the well-known hotel reviewer. The groms are put through some difficult tasks in order to cater to his every whim. Meanwhile, El Duderino, the ultimate wave that hits once every 20 years, strikes Sunset Beach, which Reef and Broseph are determined to ride.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-19","episode_number":5,"episode_type":"standard","id":600225,"name":"Take Your Kook to Work Day","overview":"After receiving advice from Lo, Emma brings another surfer to \"The Office\" trying to make Ty jealous which accidentally reveals the secret location to other tourists. The groms become upset with her, so she devises a plan to make them leave. Meanwhile, Reef is stuck teaching a stubborn old man how to surf.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-26","episode_number":6,"episode_type":"standard","id":600224,"name":"Waves of Cheese","overview":"After overhearing Reef using lines from a cheesy 90s surf flick to pick up a cute guest, Fin bribes the Kahuna to run the amazing surf movie,Break Point, at the movies to expose Reef from his scamming ways. Meanwhile the rest of the gang are having problems with two children who keep pulling pranks on them and the guests.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-02","episode_number":7,"episode_type":"standard","id":600223,"name":"Hang 9","overview":"When Reef breaks his pinky toe while surfing, he gets the whole week off. Fin, on the other hand, replaces Reef as the new surf instructor for the week. When Bummer is about to fire Reef since Fin was better at the job, Fin decides to give it back. But Bummer almost fires her, that is, until she saves his life. Meanwhile, George is being humiliated by Lo in front of his crush, so he plans revenge. At the end, Reef and Fin catch a few waves.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-09","episode_number":8,"episode_type":"standard","id":600248,"name":"Fast Times when the Rip Tide's High","overview":"When trying to prove who is the better surfer, Fin and Reef get drifted out to sea, and end up on a remote island. Discovering they are the only ones there, Reef and Fin worry about dying on the island. They draw the conclusion that they will never make it back to their real lives, so the two prepare to kiss. At that moment, the rest of the gang shows up, revealing the resort was only 10 minutes down the beach. Meanwhile, Lo snags a vintage surf board tour to impress her dad. When things go wrong, the most valuable board goes missing.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-23","episode_number":9,"episode_type":"standard","id":600246,"name":"Chargin' Into The Night","overview":"Bummer goes on a blind date and leaves the hotel. The groms decide to go night surfing with the help of floodlights, but, the lights cause a power outage for the entire hotel. Emma is stuck in the elevator with her crush, Ty because of the outage.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-30","episode_number":10,"episode_type":"standard","id":600247,"name":"O Broseph, Where Art Thou?","overview":"Afraid that Emma received a bad evaluation, which would lead to her 3rd strike, Lo and Fin try to track down the paperwork before it reaches Bummer. Broseph gets kicked out of his room by Reef and Johnny, and builds a giant sandcastle to live in. When Reef and Johnny realize how much they miss Broseph, they beg him to return.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-06","episode_number":11,"episode_type":"standard","id":600230,"name":"Groms Gone Wild!","overview":"Bummer leaves for the weekend and leaves Johnny in charge. But when the groms pressure him to be the \"fun\" boss, chaos occurs. Meanwhile, Reef develops a Bromance with a pro surfer staying at the resort, who, by rumor, seems to be attracted to Emma.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Kianu Kole (voice)","credit_id":"5f2ae9418e870200372fabbb","order":500,"adult":false,"gender":2,"id":1232771,"known_for_department":"Acting","name":"Terry McGurrin","original_name":"Terry McGurrin","popularity":1.646,"profile_path":"/jRJLbmZ661XdsPwXfG8HIXWzILY.jpg"}]},{"air_date":"2009-09-16","episode_number":12,"episode_type":"standard","id":600235,"name":"Reef and that Evil Totem","overview":"Reef finds a mini-totem pole which brings him bad luck. Lo gets stuck as a babysitter for the guests' kids, but things go terribly wrong.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-01","episode_number":13,"episode_type":"standard","id":600237,"name":"Reef, Broseph and Emma's Totally Stupid Adventure","overview":"Broseph, Reef and Emma go into town for beaver tails (a local pastry), but stay too long and realize they're late for work. They try to take a shortcut through the woods, but end up lost in the woods for the day. So, Johnny does everything he can to cover for Emma's absence. Meanwhile, Fin takes photos of the messiest room in the hotel and posts them online. But when she goes out with a hot guy, she discover he's the one staying in the room.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-08","episode_number":14,"episode_type":"standard","id":600239,"name":"Boards of Glory","overview":"Lo convinces Reef and Fin to participate in a Tandem surf contest, which she is eager to score a victory to impress her father. When Reef accidentally drops Fin and dislocates her shoulder, Lo forces Broseph to become Reef's partner, with Fin as the coach. Meanwhile, Johnny and Emma pose as a couple in order to film the team Reef and Broseph are up against to see how good they truly are. At the end, Reef makes an attempt at giving Fin flowers. Surprised at the result, Mr. Ridgemount offers to let Lo back in the penthouse. However, Rosie turns up and says that Lo has been running a 'labor camp' at the hotel. Upon hearing this, Mr. Ridgemount changes his mind.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-15","episode_number":15,"episode_type":"standard","id":600232,"name":"Penthouse of Horror","overview":"Fin, Reef, Lo and Broseph get trapped in an old hotel room that Bummer claims to be haunted by a young couple who died there a month before. The gang doesn't really believe in hauntings, that's until the ghost shows up. But Fin still tries to convince the groms that ghosts aren't real. Meanwhile, the Kahuna faces off against an undead fish stick that he accidentally brought to life. At the end of the episode it is clear that Reef likes Fin.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-20","episode_number":16,"episode_type":"standard","id":600231,"name":"Chum Music","overview":"Lo is caught in a lie after claiming to date a rock star, who stays at the resort. To save her reputation, Lo keeps up the charade with the oblivious star. When Emma and Fin catch him kissing another girl, they attempt to ruin his life. Meanwhile, Reef tries to start a surf crew. But when both Broseph and Fin are unwilling to participate, he becomes desperate for whoever he can get to join.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-05","episode_number":17,"episode_type":"standard","id":600233,"name":"Mr. Wahine","overview":"When Reef tries to prove that dude surfers are better than girls, Broseph, Emma and Johnny try to vote for their favorite, but it ends in a tie. When Reef finds a Sharpie marker, he paints Ripper's and No Pants Lance's faces, and the punishment ends up dressing as a girl. While surfing, a contest coordinator asks Reef to join the Battle of the Betties, which he joins to beat Fin. He joins as \"Sandy Beaches\" in disguise, which makes Bummer fall in love with Sandy. Meanwhile, Emma joins the contest, and breaks her board, along with Broseph's. But, when she becomes desperate and works for The Kahuna, he doesn't have money to pay her with, so he gives her a vintage board.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-15","episode_number":18,"episode_type":"standard","id":600236,"name":"Grand Theft Whale Bus","overview":"When a band comes to town, but Kahuna isn't around to drive them, the groms and Johnny take the Whale Bus themselves to get them there. Meanwhile, Bummer discovers the groms have ditched work and makes it his personal mission to track them down.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-22","episode_number":19,"episode_type":"standard","id":600238,"name":"A Boy Named Leslie","overview":"Emma is devastated when her evil boss Kelly asks Ty out. Reef's mom comes to visit and Reef isn't too happy about it. The situation becomes worse when his Mom starts dating Kahuna. Meanwhile, Kelly goes on a date with Ty, only because his dad is rich, which causes a very jealous Emma to try and sabotage everything.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-29","episode_number":20,"episode_type":"standard","id":600240,"name":"Who Knows What Evil Lurks In The Heart Of Clam?","overview":"During a prank war with Captain Ron's resort, Captain Ron's \"Captain Clam\" mascot leaves Captain Ron to work at Surfer's Paradise, apparently due to Ron's crummy treatment. Everyone starts treating him like he's one of them except for a left out Wipeout, who believes the Clam is up to no good. Meanwhile Reef dates a girl from Fin's past to get her jealous, but gets more than he bargained for.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-06","episode_number":21,"episode_type":"standard","id":600242,"name":"Endless Bummer","overview":"Bummer is having a breakdown, so the groms teach him to be chill and relaxed. But they do too good of a job and Bummer's mellowness gets him fired. Lo gets a lesson from her tough-as-nails Daddy on how to deal with her daycare kids. Meanwhile, Johnny finally scores a date with Emma, but it doesn't go the way he planned.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-13","episode_number":22,"episode_type":"standard","id":600241,"name":"Slumber Party Animals","overview":"Reef, Broseph and Johnny list the hotel as a \"clothing optional\" resort with unexpected results. The girls decide to have an all-girls party in one of the suites, but Lo starts to believe that their night will be ruined when her mom joins the party. Meanwhile, Johnny becomes traumatized after seeing two male hotel guests doing naked yoga and Reef and Broseph try to snap him out of it.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-20","episode_number":23,"episode_type":"standard","id":600234,"name":"BroFinger","overview":"Fin and Reef trick Broseph into being a sponsor so they can get free stuff, meanwhile Emma goes on a date with the human fart machine Ripper.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-27","episode_number":24,"episode_type":"standard","id":600243,"name":"A Prank Too Far","overview":"After the Groms endless pranks begin to affect their jobs (and the guests) Bummer devises a secret plan to pull off the greatest prank ever in hopes of ending the Groms' prank war once and for all. The opening scene of Total Drama Action was seen during this episode; that show's theme song is played on the television in the restaurant.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-03","episode_number":25,"episode_type":"standard","id":600244,"name":"The Pirate Who Came to Lunch","overview":"Broseph gets his hair braided and mysteriously loses his surf stoke. Lo and Emma's plans backfire while getting revenge on Kelly.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-03","episode_number":26,"episode_type":"finale","id":600245,"name":"The Day the Sea Stood Still","overview":"The episode begins with Lo and Fin doing their maid duties. Lo is trying to earn enough money to buy a new pair of bikinis in the hotel gift shop. She is interrupted by a phone call from Mr. Ridgemount, asking Lo to his office. He reveals that he should be nicer to his children, so he returns Mrs. Ridgemount's credit card, lets George have a golf cart (which he later crashes) and allowing Lo out of her hotel duties and back in the penthouse.\n\nMeanwhile, the groms are annoyed that there are no waves. They soon discover that they must take up new hobbies to fill in their spare time. Reef decides to take up reading, Broseph tries to play table tennis and Fin attempts knitting. When Bummer learns of the event, he is thrilled at first, but is then shocked that no waves means no guests and could go bankrupt.","production_code":"","runtime":null,"season_number":1,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":31543,"poster_path":"/vqj8jLN3A2zVog0u9jIShPNhmFC.jpg","season_number":1,"vote_average":0},"2":{"_id":"52586b6e760ee346611ba424","air_date":"2010-09-16","episodes":[{"air_date":"2010-09-16","episode_number":1,"episode_type":"standard","id":600255,"name":"The Make-Out Fake-Out","overview":"Lo runs into Curtis, a guy she dated last summer but dumped him because he wasn't cute enough. Later it is revealed that he is going out with Fin. Lo introduces Reef as her boyfriend to make Curtis jealous (even though Reef and she aren't dating; Lo later bribes Reef into it by saying she'll get him his own mini-fridge), but Curtis proposes that he and Fin, along with Lo and Reef go on a double date.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-23","episode_number":2,"episode_type":"standard","id":600259,"name":"Surf Surf Revolution","overview":"He creates a surfing simulator video game so he can find more time to surf while still teaching his students, but his scheme backfires when the game becomes popular and it leads to him getting fired by Bummer.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-30","episode_number":3,"episode_type":"standard","id":600261,"name":"The Captain, The Grom, His Job and Her Dream","overview":"Tired of scrubbing toilets, Fin applies for a job at Captain Ron's. Reef finds out and tries everything to destroy Fin's chances at getting the job.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-07","episode_number":4,"episode_type":"standard","id":600249,"name":"Will The Real Broseph Please Stand Up?","overview":"Fin and Reef compete to see who will become special surf advisor to a hot young Hollywood star. But their plans go awry when the hunk chooses Broseph as his advisor and proceeds to steal Broseph's identity one step at at time.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-14","episode_number":5,"episode_type":"standard","id":600250,"name":"I Like Beaver Butts And I Cannot Lie","overview":"Reef and Broseph smell a way to make money based on the town's most popular food stuff: Beaver Tails. Meanwhile, Lo thinks she is starting to look pale like Emma, so she buys a tanning product that makes her smell like bacon and has to be reapplied every 20 minutes or she turns orange.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-04","episode_number":6,"episode_type":"standard","id":600271,"name":"Sick Day","overview":"When Lo sees Ty cleaning up after a littering surfer over Kelly's objections, she helps Emma by setting her up with Ty for beach clean-up duty, prompting a jealous Kelly to interfere. Meanwhile, Reef, Fin, Broseph and Johnny try to find a way to skip work and catch some waves.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-18","episode_number":7,"episode_type":"standard","id":600252,"name":"Channel Surfers","overview":"Lo and Reef struggle to keep their new romantic relationship a secret from their friends amid several close calls. Johnny sets up a spy camera to see what the waves are like. But, later shows Lo and Reef making out, causing it to become a local television show That's So Reef and Lo.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-25","episode_number":8,"episode_type":"standard","id":600265,"name":"Grommy, The Vampire Slayer","overview":"On a stormy night, Reef gets freaked out when he sees three mysterious figures outside the staff house and suspects that they are vampires.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-02","episode_number":9,"episode_type":"standard","id":600266,"name":"Grumpy Old Brahs","overview":"The groms believe that Broseph has become psychic and developed the ability to predict the location and size of waves, not knowing that one of Mr. Grizzle's hearing aids has become lodged in Broseph's afro. Meanwhile, Reef is out-surfed by two of his students – little boys.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-09","episode_number":10,"episode_type":"standard","id":600263,"name":"Hunka Hunka Burnin' Reef","overview":"Fin gets annoyed with Reef's new relationship with Lo and tries to compete against her to see who Reef really likes the most. Meanwhile, Bummer wants Emma and Broseph to get rid of the mother turtle making babies on the beach, but causes trouble when all the baby turtles are missing in the hotel.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-16","episode_number":11,"episode_type":"standard","id":600264,"name":"Boardy Brotherhood","overview":"The guys find an awesome pair of boardshorts at the surf shop and pool their money to buy them.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-30","episode_number":12,"episode_type":"standard","id":600274,"name":"Safety Last","overview":"Fearing lawsuits from injured guests, Bummer creates a hotel safety patrol and makes all the groms join up.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-06","episode_number":13,"episode_type":"standard","id":600269,"name":"Clinging in the Rain","overview":"A hurricane hits Surfer's Paradise resort and the groms get left behind.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-12","episode_number":14,"episode_type":"standard","id":600267,"name":"My Fair Leslie","overview":"Lo reinvents Reef to show her father that he is worthy. Johnny teaches Broseph how to drive the Whale Bus so he can impress a girl.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-13","episode_number":15,"episode_type":"standard","id":600268,"name":"Browatch","overview":"Ripper takes sick leave, and Broseph takes over his life saving tower. The other groms pretend that the staff house is the resort to pocket the money of guests.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-14","episode_number":16,"episode_type":"standard","id":600273,"name":"Bad Sports","overview":"Meanwhile, Emma tries on a wetsiut belonging to a famous guest who is staying at the hotel, but gets stuck and can't take it off.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-15","episode_number":17,"episode_type":"standard","id":600262,"name":"(500) Days of Bummer","overview":"Bummer falls in love with Chrissy, a guest at the hotel, but he won't ask her out, because it would violate his \"No Dating the Guest\" rule. The groms decide to play matchmaker.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-18","episode_number":18,"episode_type":"standard","id":600258,"name":"The Reefinator","overview":"Broseph eats a sandwich that makes him sick. Johnny makes lots of bets.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-19","episode_number":19,"episode_type":"standard","id":600257,"name":"Dirty Little Secret, Nerdy Little Secrets","overview":"Gromfest is coming up, and Fin is in full training mode, but there is an unexpected challenger for her crown: Emma.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-20","episode_number":20,"episode_type":"standard","id":600260,"name":"Sweet, Sweet, Meat Cheat","overview":"Lo decides to go vegetarian, and threatens to dump Reef if he doesn't join her. Unfortunately, Reef is a major meat-eater, and his friends Johnny and Broseph are tempting him with delicious meat from a local hot dog festival.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-21","episode_number":21,"episode_type":"standard","id":600251,"name":"To catch a Reef","overview":"A thief stalks Surfer's Paradise, and Bummer wants Johnny and Broseph to hunt him down. Meanwhile, Reef, who is normally broke, suddenly seems to have lots of money.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-22","episode_number":22,"episode_type":"standard","id":600270,"name":"Surfer's Got Talent","overview":"Bummer decides to make the hotel more exciting by throwing a talent contest featuring the staff. The winner gets a four day weekend, but to get it, they'll have to put on an amazing original show of talent.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-25","episode_number":23,"episode_type":"standard","id":600254,"name":"Groms on Strike","overview":"After a series of unfortunate mishaps, the groms finally get fed up with their living conditions in the old staff house and declare a strike.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-26","episode_number":24,"episode_type":"standard","id":600272,"name":"Heartbreak Hotel","overview":"The guys get a rare weekend off, and Reef decides they'll take a \"Manly Dude\" weekend, to \"get in touch with their inner dude.\" However, Fin overhears their plans and wants to join the guys.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-27","episode_number":25,"episode_type":"standard","id":600256,"name":"All We Are Saying is Give Reef a Chance","overview":"Mr. Ridgemount is tired of Lo dating a surf bum, so he bribes her with a brand new car if she'll dump Reef. When Lo takes the car but keeps seeing Reef, Mr. R vows to fire him.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-28","episode_number":26,"episode_type":"finale","id":600253,"name":"Grom Fest","overview":"It is time for Gromfest, the biggest teen surf competition on the West Coast. Everyone's excited to participate, except for Johnny, who has to take care of Bummer, who is sick.","production_code":"","runtime":null,"season_number":2,"show_id":21761,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Kianu Kole (voice)","credit_id":"5f2ae9418e870200372fabbb","order":500,"adult":false,"gender":2,"id":1232771,"known_for_department":"Acting","name":"Terry McGurrin","original_name":"Terry McGurrin","popularity":1.646,"profile_path":"/jRJLbmZ661XdsPwXfG8HIXWzILY.jpg"}]}],"name":"Season 2","overview":"","id":31544,"poster_path":null,"season_number":2,"vote_average":0}}}