{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"1986-09-21","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":218,"in_production":false,"languages":["en"],"last_air_date":"1986-12-14","last_episode_to_air":{"id":12803,"name":"Auger...for President?","overview":"Three months have passed since the last Inhumanoid attack. Derek and Stella Bright are enjoying their newlywed status as a celebrity couple even as the other members of Earth Corps increasingly find themselves basking in the media spotlight — except Auger, who seems to have been overlooked by fortune's calling. Senator Masterson's declared candidacy for the presidential race is met by a hostile public reception, prompting Blackthorne and the Inhumanoids to conspire to use intimidation tactics to terrify the other presidential contenders into withdrawing. In reaction, Auger decides to enter the race himself, challenging Masterson's undeserving political record. The Inhumanoids try to bolster Masterson's credibility with a staging of faux heroics, but when Auger wins the election regardless, he is immediately kidnapped by the enraged Inhumanoids, who invite all opponents to attempt a rescue in a final grand confrontation.","vote_average":0,"vote_count":0,"air_date":"1986-12-14","episode_number":13,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/pP3hLCht8F0aYHT7u8FJN1zKQqB.jpg"},"name":"Inhumanoids","next_episode_to_air":null,"networks":[{"id":184,"logo_path":null,"name":"Syndication","origin_country":"US"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Inhumanoids","overview":"Inhumanoids was an animated series and Hasbro toy property in 1986. In the tradition of other Hasbro properties such as Transformers and G.I. Joe, the show was produced by Sunbow and Marvel Productions and animated in Japan by Toei Animation. Inhumanoids tells the story of the scientist-hero group, Earth Corps, as they battle a trio of subterranean monsters called the Inhumanoids with the aid of elemental beings, the Mutores.","popularity":2.606,"poster_path":"/wzLyDAdkT0yUVQycSeZuosgbjSA.jpg","production_companies":[{"id":3313,"logo_path":"/10T51dh4ha4KrSksb5gAEcpRz9N.png","name":"Sunbow Productions","origin_country":"US"},{"id":2301,"logo_path":"/qdPhBEP8sjK3Eb3rKc94554gcZt.png","name":"Marvel Productions","origin_country":"US"},{"id":2598,"logo_path":"/i42C5gRq7XqlG4S9vkchuJZfrBn.png","name":"Hasbro","origin_country":"US"},{"id":5542,"logo_path":"/ayE4LIqoAWotavo7xdvYngwqGML.png","name":"Toei Animation","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"},{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"1986-09-21","episode_count":13,"id":712,"name":"Season 1","overview":"Inhumanoids tells the story of the scientist-hero group, Earth Corps, as they battle a trio of subterranean monsters called the Inhumanoids with the aid of elemental beings, the Mutores.","poster_path":"/1FancfJzfJEmha5edIQbhZa9Pu9.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.8,"vote_count":4,"season_data":{"1":{"_id":"5253467219c29579400cfe01","air_date":"1986-09-21","episodes":[{"air_date":"1986-09-21","episode_number":1,"episode_type":"standard","id":12800,"name":"The Evil That Lies Within (1)","overview":"Mysterious events start to happen when the government Earth Corps unearths an amber monolith in a forest; meanwhile, an unscrupulous businessman, Blackthorn, digs up a vine creature, Tendril, which frees the trapped undead beast, Decompose. Earth Corps must use their specially-designed armoured suits to track down the enormous monsters. In the process, the dormant Mutar species of Redwoods, Granites and Magnacore are reawakened, and join forces with Earth Corps to once again do battle with their centuries-old enemies, the Inhumanoids, in an effort to save the world.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/dbffIa4j3qEBGn3mKtXgu2cmCys.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-28","episode_number":2,"episode_type":"standard","id":12799,"name":"The Evil That Lies Within (2)","overview":"A nocturnal assault by Tendril demolishes the Earth Corps base, prompting a chase into the depths of the Earth, but even with the help of another Mutore species, the rock-bodied Granites, they are forced to retreat back to the surface. When their budget is summarily cut by Senator Masterson — a crooked politician in Blackthorne Shore's shady pocket — they are approached by Sandra Shore, Blackthorne's sister, who has learned of her brother's sinister plot to liberate Metlar. Funded by Sandra, the team constructs new vehicles and embarks back below the Earth's surface, tracking D'Compose and Tendril to the city of the Granites, where an ensuing battle frees Metlar from Magnokor's hold. Having pilfered Earth Corps' engineering schematics via his ties to Masterson, Blackthorne joins the fray, now equipped with his own battle-suit whose magnetic powers he wields against Metlar, only to be derailed by Tendril's interference while Sandra falls victim to the mutative touch of D'Compose.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/qlg5T54pBimvbPoh1MDlKkVdYYE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-05","episode_number":3,"episode_type":"standard","id":12796,"name":"The Evil That Lies Within (3)","overview":"Earth Corps manages to escape and forms an alliance with the Granites. Herc accompanies them to D'Compose's domain of Skellweb while Auger and Liquidator venture into Metlar's kingdom of Infernac, and Bright convinces the Redwoods to help defend the surface world against attempts by the Inhumanoids to acquire sources of power. Herc and the Granites are able to defeat D'Compose's reanimated soldiers and restore Sandra to normal. Blackthorne pursues Auger and Liquidator to Infernac and tries to use his magnetic powers on Metlar once again but is foiled by Magnokor and taken captive by Metlar.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/m8I0OmjRSOs9k8SuVYUYEQ9sNhH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-12","episode_number":4,"episode_type":"standard","id":12795,"name":"The Evil That Lies Within (4)","overview":"Acting on information forced from Blackthorne, the Inhumanoids raid a Soviet air base, stealing a handful of nuclear missiles. A seemingly repentant Blackthorne warns Earth Corps that the missiles are intended to shatter the divide between the Earth's crust and mantle, but upon travelling into the Earth to preclude this catastrophe, the team discovers that Blackthorne has set them up and that the missiles are actually meant to detonate the planet's core. Earth Corps is able to convince D'Compose to allow them access to Infernac — a deal made easier by the fact that the Inhumanoid already fears for his own survival in the face of Metlar's insane plan — and they manage to defuse enough of the missiles to thwart the explosive scheme.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/jbB3Zn7b0Cb69l2Xf0S2BzhP08m.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-19","episode_number":5,"episode_type":"standard","id":12797,"name":"The Evil That Lies Within (5)","overview":"Following a climactic battle, D'Compose is re-sealed in amber casing and Tendril is imprisoned by the Granites. Finally, Magnokor succeeds in neutralizing Metlar even as Blackthorne is arrested by Earth Corps. Senator Masterson provides the Earth Corps team with a new headquarters facility, but a tissue sample secured from Tendril during their first encounter with the monster has mysteriously gone missing...","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/eKINFpAAAbc59rCR9yjTxPyinFg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-26","episode_number":6,"episode_type":"standard","id":12798,"name":"Cypheroid","overview":"The tissue sample previously taken from Tendril grows into a second Tendril monster but is contained soon enough thanks to Earth Corps. The creature is then seized by Senator Masterson, who orders it placed in captivity to be studied by an advanced supercomputer, Cypher. The computer ends up freeing the Inhumanoid instead, exhibiting its own acquired sentience, soon rebuilding itself into the improved Cypheroid using technology stolen from Earth Corps. The rogue A.I. then directs Tendril to free Metlar. It also arranges for Blackthorne Shore to be released from prison along with his cellmate, the diabolical Dr. Herman Manglar, who has the fatal misfortune of encountering a pool of haphazardly discarded toxic waste during their swampy escape. The pursuit takes Earth Corps underground where the Cypheroid is ultimately destroyed, but Metlar remains at large, almost annihilating Earth Corps if not for the meddling of Blackthorne.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/z9PpoUq6sxSEjcTLEe8Ua2d0L4p.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-07","episode_number":7,"episode_type":"standard","id":12802,"name":"The Surma Plan","overview":"Blackthorne escapes Metlar's punishment and acquires Dr. Manglar's acid-rotted remains, employing D'Compose to resurrect them into a skeletal grotesquerie dubbed \"Nightcrawler\". Elsewhere, the Earth Corps team defeats the second Tendril creature, but the original manages to escape. Amid these events, Soviet forces initiate Operation: Surma, planning to flood Infernac to destroy the \"primal core\" in a massive explosion which will wipe out all Inhumanoids; however, the Soviets fail to realize that their plan will likely tear the planet itself asunder in the process. Earth Corps is forced to ally themselves with Metlar to protect the welfare of the planet. When Metlar double-crosses them, the team is saved by a turncoat Soviet military agent, Anatoly Kiev, who they gratefully welcome into their ranks. Kiev respectfully declines, thinking that it is better to independently continue on his quest against Infernac.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/tvvNwSUasSVBPKgNueO1iN5mOMa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-02","episode_number":8,"episode_type":"standard","id":12801,"name":"Cult of Darkness","overview":"Looking to land a spicy news scoop, investigative reporter Hector Ramirez infiltrates the underground compound of a growing cult movement that has become popular among San Francisco's disaffected teens. They find more than they bargained for when the gathering turns out to be a recruiting scheme fronted by Blackthorne Shore on behalf of the Inhumanoids. D'Compose uses his powers of decay to transform the teenage crowd into rampaging zombies who proceed to terrorize the city. It's up to Earth Corps to save the zombified kids without harming them, but in their decayed marauder state, the teens are proving less than cooperative, and the would-be rescue mission goes further afoul when Herc and Auger are d'composed!","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/y2224aemkZYgYRplf71leT4fqrh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-09","episode_number":9,"episode_type":"standard","id":12807,"name":"Negative Polarity","overview":"Tank (Kiev) teams up with Crygen and Pyre to harness the power of a boulder of galvacite, which will make them strong enough to vanquish Metlar once and for all. However, when they storm Infernac, their enhanced magnetic powers run amuck, inducing a reversal of the core's polarity that renders Crygen and Pyre evil while changing Metlar's personality to good. The incident further initiates a chain reaction which threatens to pull Earth's deadly Van Allen belt down to the surface of the planet. Much to his own disgust, the now-altruistic Metlar brings himself to work in concert with Earth Corps to restore the natural order: they manage to reform the galvacite boulder, returning Crygen and Pyre to normal as Metlar reverts to evil and reclaims Infernac.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/iqccR2ki6nY1knCQe1XRjkEfyEs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-23","episode_number":10,"episode_type":"standard","id":12804,"name":"The Evil Eye","overview":"Blackthorne and Nightcrawler unearth a cyclopean monstrosity with an insatiable appetite, the mindless Inhumanoid beast called Gagoyle, from its nesting chamber within the cavernous bowels of a radioactive volcano. Betrayed by Nightcrawler's subsequent manipulations of the monster, Blackthorne flees the scene, vowing to take revenge by releasing the most evil Inhumanoid of all... Nightcrawler shortly pays a visit to Skellweb, setting Gagoyle to attack Metlar's realm, although without much success. Meanwhile, a former research associate from Blackthorne Shore's earlier years in archaeological study contacts Earth Corps to convey a disturbing tale regarding Shore's interest in an ancient temple located somewhere on the isle of Borneo. But Blackthorne is already one step ahead of the group and manages to intercept their venture, hijacking their plane before parachuting down into the jungle to lay claim to his dark prize...","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/6GpRtzzUJx7qgexUN8yNYRM3XRf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-30","episode_number":11,"episode_type":"standard","id":12806,"name":"Primal Passions","overview":"Having long-pursued a cryptic trail from native legend and archaeological artifacts, Blackthorne Shore arrives at a gruesome temple hidden in the wilds of Borneo, within which a lightning-spitting Inhumanoid named Sslither has been magically imprisoned for millennia. Blackthrone frees the creature to carry out his bidding, beginning by knocking a patrolling army jet from the sky. Later, during an expedition to the Earth's mantle, the members of Earth Corps are ambushed in a trap set by the Inhumanoids. In the ensuing scuffle, a miscalculation in Liquidator's chemical spray formula sends the Inhumanoids on a mad, amorous spree: D'Compose professes his undying love for an undead Sandra Shore, Tendril tries to romance a robotic movie prop, while a starry-eyed Metlar steals away to his molten abode with the Statue of Liberty in his misbegotten embrace.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/clfDPU7diybFBUF5l23MS10fZBE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-30","episode_number":12,"episode_type":"standard","id":12808,"name":"The Masterson Team","overview":"In a reckless PR stunt, Senator Masterson and tabloid-TV journalist Hector Remirez, together with a menagerie of inept celebrity goons, mount a live televised \"journey to the center of the Earth\" aboard a fleet of dirigible vehicles, promising to rescue the Statue of Liberty from Metlar's abduction. Auger and company are content to let the inevitable televised chaos unfold, instead busying themselves with the marriage of their teammate, Derek Bright, to actress Stella Blaze, a fiery redhead recently rescued from the adoring clutches of Tendril... who also decides to crash the wedding.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/wvINGR5psP2n2NKqpNw7e8x5AVZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-14","episode_number":13,"episode_type":"finale","id":12803,"name":"Auger...for President?","overview":"Three months have passed since the last Inhumanoid attack. Derek and Stella Bright are enjoying their newlywed status as a celebrity couple even as the other members of Earth Corps increasingly find themselves basking in the media spotlight — except Auger, who seems to have been overlooked by fortune's calling. Senator Masterson's declared candidacy for the presidential race is met by a hostile public reception, prompting Blackthorne and the Inhumanoids to conspire to use intimidation tactics to terrify the other presidential contenders into withdrawing. In reaction, Auger decides to enter the race himself, challenging Masterson's undeserving political record. The Inhumanoids try to bolster Masterson's credibility with a staging of faux heroics, but when Auger wins the election regardless, he is immediately kidnapped by the enraged Inhumanoids, who invite all opponents to attempt a rescue in a final grand confrontation.","production_code":"","runtime":30,"season_number":1,"show_id":218,"still_path":"/pP3hLCht8F0aYHT7u8FJN1zKQqB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Inhumanoids tells the story of the scientist-hero group, Earth Corps, as they battle a trio of subterranean monsters called the Inhumanoids with the aid of elemental beings, the Mutores.","id":712,"poster_path":"/1FancfJzfJEmha5edIQbhZa9Pu9.jpg","season_number":1,"vote_average":0}}}