{
    "adult": false,
    "backdrop_path": "/ijD0R52Zk30aPrKYzsuRsXzfltQ.jpg",
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2018-01-09",
    "genres": [],
    "homepage": "",
    "id": 218016,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2021-07-18",
    "last_episode_to_air": {
        "id": 4151102,
        "name": "Comfort",
        "overview": "Chef Spencer Watts prepares homey classics such as Chicken Stew and Herb Butter Biscuits.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2021-07-18",
        "episode_number": 5,
        "episode_type": "standard",
        "production_code": "",
        "runtime": null,
        "season_number": 2,
        "show_id": 218016,
        "still_path": null
    },
    "name": "Spencer's BIG 30",
    "next_episode_to_air": null,
    "networks": [],
    "number_of_episodes": 35,
    "number_of_seasons": 3,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "Spencer's BIG 30",
    "overview": "Spencer's BIG 30 is a fast-paced series featuring healthy, hearty meals for four that can be made by anyone in around 30 minutes, for around 30 dollars. Keeping the pace, while guiding us from prep to plate, host Spencer Watts (Fish the Dish and Watts on the Grill) gives his top tips and tricks for cutting cooking time down, without sacrificing flavor.",
    "popularity": 1.042,
    "poster_path": "/yqG5toRNn6kebG9CS0sA48VsE2D.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "CA",
            "name": "Canada"
        }
    ],
    "seasons": [
        {
            "air_date": "2018-01-09",
            "episode_count": 13,
            "id": 323626,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": null,
            "episode_count": 14,
            "id": 323627,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": null,
            "episode_count": 8,
            "id": 323628,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "63bcb6f869d280008aca2fc1",
            "air_date": "2018-01-09",
            "episodes": [
                {
                    "air_date": "2018-01-09",
                    "episode_number": 1,
                    "episode_type": "finale",
                    "id": 4151077,
                    "name": "Chicken Bake Night",
                    "overview": "30-minute meals are all about efficiency - start with the most complicated element and finish with the simplest. First, chef Spencer Watts gives us some tips for a rustic Sweet Potato Rosti. Made with a blend of sweet yams, starchy potatoes, and acidic onion, Spencer leaves the Rosti to crisp up in a pan as he starts up his next dish. Spencer cooks up healthy Lemon Thyme Chicken Thighs, perfect for a flavoursome family dinner.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 5251656,
                    "name": "Roast Beef Night",
                    "overview": "Who knew you could make a budget-friendly beef dinner in 30 minutes? Chef Spencer Watts starts the clock and immediately butterflies a hearty sirloin roast to speed up the cooking process, sprinkles it with aromatic spices, and lets it sizzle in a cast iron pan before roasting it in the oven. Then, Spencer makes a delicious Yorkshire Pudding. This simple dish requires only three ingredients: milk, eggs, and thyme. Pop it in the oven and don't take a peak until it's time to serve. Next, Spencer roasts colourful carrots with shallots, garlic, and fragrant rosemary for a boost of flavour. To add more veg, Spencer tops fresh green beans with a delightful lemon-Dijon vinaigrette. Finally, for a healthy take on dessert - fresh Watermelon Cupcakes. Fluffy whipped cream sweetened with light and airy icing sugar and vanilla complements the crunchiness of the watermelon for a sweet healthy treat.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-23",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 5251657,
                    "name": "Lasagna Night",
                    "overview": "Spencer is an expert at 30-minute meals and Lasagna Night is no exception. Don't spend a whole afternoon baking lasagna when you can let it sizzle in a skillet. Spencer mixes together ground beef, tomatoes, passata, cottage cheese, spices, and oven-ready noodles for a deconstructed stovetop lasagna. Topped with melted mozzarella and fragrant fresh basil, this lasagna is a wonderful burst of flavour. Next, a decadent spinach side in a nutmeg-spiced cream sauce that will change your kids' opinion of the leafy green. To contrast the heavy dishes, Spencer then prepares a fresh arugula salad with a citrusy vinaigrette. Light and zesty, this refreshing salad is sure to awaken your taste buds. Finally, Spencer quickly whips up creamy banana ice cream for a delightfully sweet dessert.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-30",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 5251658,
                    "name": "Fish & Chips Night",
                    "overview": "Fish and chips are always great for a quick, inexpensive family dinner and they're even better when elevated with succulent sides and decadent desserts. Host Spencer Watts makes simple fish and chips with a twist - fish in chips. For an extra-crunchy crust, Spencer uses potato chips to coat the juicy cod and amps up the flavour with fresh dill, parsley, and zesty lime. Then, he offers a unique take on traditional French fries - Crispy Spiced Polenta Fries. These fries are loaded with aromatic spices and pair perfectly with crispy fish. Spencer then whips up a creamy Garlic Dip. Fast, simple, and bursting with flavour, this dip adds a little kick to the fish and fries. Next, Spencer prepares a Fresh Green Pea Salad with sweet apples and watercress for a light, refreshing side. Finally, a delightfully easy, melt-in-your-mouth Broken Pavlova topped with blueberries and fragrant lime curls will have your family asking for seconds.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-06",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 5251659,
                    "name": "Chinese Take-Out Night",
                    "overview": "Why order take-out when you can make it fresher, faster, and even healthier at home? Chef Spencer Watts shows us how to make his favourite Chinese take-out dishes. First, Veggie Fried Rice is on the menu. Simmered in veggie stock, this puffed up rice features delicious veg and fluffy eggs - a great way to sneak more nutrients into your kids' diet. To complement the rice, Spencer quickly cooks up some Chinese-style Broccoli doused in a garlicky sauce for extra flavour. Then, Spencer makes a zesty Asian-inspired sauce to caramelize some Sticky Pork Ribs. These easy ribs eliminate any hassle - just pop them in the oven a you're good to go. To finish, Spencer prepares a Chinese take-out classic with a healthy twist - Sweet and Sour Cauliflower. Deep-fried in a mind-blowing batter and dipped in a flavourful sweet and sour sauce, these bite-sized delights are more delicious and nutritious than the ones from the take-out restaurant.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-13",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 5251660,
                    "name": "Breakfast for Dinner Night",
                    "overview": "The best way to do a fast, inexpensive dinner for four? Make breakfast for dinner. Chef Spencer Watts starts of by whipping up a fluffy Skillet BLT Frittata. This frittata features crispy bacon, silky eggs, and juicy tomatoes and puffs up in the oven for a delightfully creamy bite. For the L in BLT, Spencer makes a refreshing butter leaf lettuce salad drizzled in a mayo dressing featuring a special kick from the reserved bacon fat. Next, mini tenderized potatoes tossed in fragrant spices and browned in butter are a great alternative to the classic breakfast hash brown. Then, Spencer bakes easy Cheese-stuffed Croissants made with delicious puff pastry. These buttery, flaky croissants melt-in-your-mouth and are perfect for a family breakfast for dinner. For dessert, Spencer prepares crunchy, homemade granola with sweet dried apricots to sprinkle on a healthy yogurt Stovetop Granola Parfait.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-20",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 5251662,
                    "name": "Pizza Night",
                    "overview": "Pizza night is a great go-to for the whole family to enjoy. Since pizza is quick and easy, host Spencer Watts make two delicious pies: one classic deep-dish and one tasty thin crust. The deep-dish pizza is cooked in a piping hot skillet and topped with savoury tomato sauce, melty mozzarella, and spicy pepperoni. The thin crust pizza is topped with creamy primavera sauce, mozzarella, asparagus, onion, and halved tomatoes and baked in the oven for crispy, golden-brown edges. Spencer then makes a light side to add a little more veg to the meal - soft Kale Caesar Salad. This healthy salad features Dijon and Worcestershire for some zing and a squeeze of lime for a tarte twist that will awaken your taste buds. Finally, Spencer prepares a sweet treat that is sure to be a hit with your kids - Peanut Butter Swirl Brownies. To make dessert hassle-free, but full of flavour, these delightfully chocolatey-peanut butter squares are cooked in the microwave.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-27",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 5251663,
                    "name": "Curry in a Hurry Night",
                    "overview": "A rich, flavourful Indian feast in under 30 minutes, for around 30 dollars? Some would say it's impossible, but chef Spencer Watts gives it a shot by using fragrant spices from his trusty pantry to make hearty Indian dishes that taste like they've simmered on the stove for hours. First, Spencer makes classic Butter Chicken for a warm, creamy dish loved by anyone. Then, Spencer cooks an aromatic Chickpea Tomato Curry for a healthy, protein-filled main. For a nutritious carb, these curries are poured over traditional Indian Spiced Rice with cinnamon, cumin seed, and star anise. Next, Spencer loves his curries with a little spice so he makes a refreshingly cool Cucumber Raita with creamy yogurt and fresh, summery cilantro to the contrast the bold flavours in the curries. For dessert, Spencer keeps the cool theme rolling with a sweet and light Mango Lassi that is sure to satisfy your taste buds.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-06",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 5251664,
                    "name": "Taco Night",
                    "overview": "Taco night is quick, delicious, and great for entertaining friends and family. First up, chef Spencer Watts caramelizes extra-thin pork tenderloin slices in a skillet loaded with a medley of aromatic Mexican spices and sweet pineapple cubes for flavourful Pineapple Pork Tacos. Next on the menu, a refreshing Roasted Corn Salad. Crunchy iceberg lettuce, roasted corn, sweet cherry tomatoes, and a chili-lime dressing is the perfect cooling side for spicy tacos. Then, taco night wouldn't be complete without Speedy Refried Beans. Rich, savoury, and delectable, these beans are sure to be a household hit. To finish, Spencer bakes some Cinnamon Sugar Twists served with a delightfully thick dulce de leche caramel dipping sauce.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-13",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 5251665,
                    "name": "Meatless Monday Night",
                    "overview": "Sneak more veg into your kids' diet with meatless Monday in around 30 minutes, for around 30 dollars. If your kids like burgers, they will love host Spencer Watts' hearty Lentil Sloppy Joes. Packed with protein and seasoned with spaghetti sauce, maple syrup, and fragrant ingredients from Spencer's go-to pantry, you wouldn't even know these extra-thick sloppy joes are vegetarian. For a punch of flavour, Spencer quickly pickles some onions to add on top of the sloppy joes. Next up, a little twist on classic coleslaw hits the menu - Brussels Slaw with Ranch Dressing. This slaw features an easy homemade buttermilk ranch dressing packed with Dijon, tarte lemon juice, and fresh chives. Then, Spencer makes a luscious White Gazpacho filled with almonds, bread, and grapes. Finally, Spencer whips up quick, simple, and ever-delicious No-bake Cheesecake. Served in single-sized mason jars with crunchy graham cracker crust, fluffy whipped cream cheese, and a hint of lemon juice.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-20",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 5251666,
                    "name": "Spaghetti Night",
                    "overview": "Everyone gets excited about spaghetti night - especially when it can be done in approximately 30 minutes, for around 30 dollars. First, chef Spencer Watts shows us a healthier version of the classic dish by using spiralized zucchini as noodles. These zoodles are seasoned with fragrant herbs and spices from Spencer's trusty pantry and cooked in a skillet with plenty of olive oil to mimic the texture of noodles. To keep the healthy theme going, Spencer uses lean turkey to craft deliciously juicy Jumbo Turkey Meatballs. Next, spaghetti wouldn't be spaghetti without a flavourful sauce. Spencer makes a simple marinara using the reserved onion juice from the grated onion in the turkey meatballs and seasons it with a medley of aromatic spices. Then, a delicious side traditionally served with spaghetti - garlic bread. To save time, Spencer makes a Pull-Apart Garlic Bread with buttery, garlicky, and cheesy flavour. To finish, Spencer cooks a delightful Deconstructed Apple Pie.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-27",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 5251667,
                    "name": "Fried Chicken Night",
                    "overview": "Quick and easy comfort food is a no-brainer in the cool winter months. Host Spencer Watts shows us all the tricks for a tasty fried chicken night in around 30 minutes, for around 30 dollars. To start, Spencer bakes up crispy buttermilk and breadcrumb coated chicken in the oven for a healthier version of fried chicken. Then, squash wedges drizzled with a honey-soy sauce dressing are sure to get your kids eating their veg. Keeping the veg theme alive, Spencer prepares a delightful Greek-style Ribbon Salad. Filled with all the fixings for a Greek salad, but with ribboned carrots, cucumber, and zucchini, this salad is fast, nutritious, and delicious. For dessert, Spencer makes a sober Bananas Foster. Traditionally made with rum or banana liqueur, this warm, flavourful, alcohol-free treat is the ultimate comfort dessert.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-04-03",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 5251668,
                    "name": "Fish Night",
                    "overview": "Fast and cheap meals can be as impressive as chef Spencer Watts' delicious fish dinner made in around 30 minutes, for around 30 dollars. To start, Spencer coats a whole trout with butter, fennel, and lemon juice and broils it in the oven for a quick, healthy, fresh Whole Broiled Trout. Next, Spencer makes a versatile French dish - Ratatouille. This dish features eggplant, zucchini, red pepper, and tomatoes seasoned with aromatic herbs to add a punch of flavour. Spoon the mouth-watering ratatouille over Spencer's herby, buttery, pearl couscous and you have yourself a delightfully elegant, plentiful side dish. To finish, Spencer shares a nutritious ingredient to his signature chocolate pudding - avocado. Ripe avocado, cocoa powder, and sweet honey mixed in a blender creates a rich, chocolatey, and creamy pudding that is sure to be a hit with your family.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 323626,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "63bcb7dba6e2d2007ebaa9c3",
            "air_date": null,
            "episodes": [
                {
                    "air_date": null,
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4151096,
                    "name": "Southern Barbeque Night",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-08",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4151098,
                    "name": "Greek Night",
                    "overview": "Chef Spencer Watts offers tips for the perfect Greek feast.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4151099,
                    "name": "Gourmet Soup and Sammies",
                    "overview": "Chef Spencer Watts offers up his favourite recipes for soup and sandwiches",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-15",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4151100,
                    "name": "Spring Fusion",
                    "overview": "Chef Spencer Watts prepares a homemade Thai feast.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-07-18",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4151102,
                    "name": "Comfort",
                    "overview": "Chef Spencer Watts prepares homey classics such as Chicken Stew and Herb Butter Biscuits.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4151104,
                    "name": "That's Amore",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4151105,
                    "name": "Night at the Pub",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-29",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4151106,
                    "name": "French Canadian",
                    "overview": "Spencer Watts shares a menu of delicious French-Canadian cuisine.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4151107,
                    "name": "Fajita Night",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 4151108,
                    "name": "Meatballs and Shakshuka",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 4151109,
                    "name": "Burgers and Fries",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 4151110,
                    "name": "Tandoori Take-Out",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 4151111,
                    "name": "Put an Egg on It",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 4151112,
                    "name": "Nope",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 323627,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "63bcb7e2fc31d300c59d41a1",
            "air_date": null,
            "episodes": [
                {
                    "air_date": null,
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4151113,
                    "name": "Lebanese Take-Out",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4151114,
                    "name": "Indian Take-Out",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4151116,
                    "name": "More Chinese Take-Out",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-31",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4151118,
                    "name": "Pizza Take-Out",
                    "overview": "Spencer Watts whips up a Quick and Easy Duo Pizza with a fresh Tomato Basil Salad.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-07",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4151119,
                    "name": "Thai Take-Out",
                    "overview": "In 30 minutes, host Spencer Watts shows how to cook a mouth-watering Thai take-out dinner for four.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4151121,
                    "name": "Japanese Take-Out.",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4151122,
                    "name": "Vietnamese Take-Out",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4151125,
                    "name": "Food Truck Take-Out",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 218016,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 323628,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    }
}