{"adult":false,"backdrop_path":"/ArKiScuolBiCsMljDt5QHzgCpzr.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"2023-03-16","genres":[{"id":18,"name":"Drama"}],"homepage":"","id":220951,"in_production":false,"languages":["ko"],"last_air_date":"2023-04-14","last_episode_to_air":{"id":4303310,"name":"Episode 10","overview":"","vote_average":0,"vote_count":0,"air_date":"2023-04-14","episode_number":10,"episode_type":"standard","production_code":"","runtime":35,"season_number":1,"show_id":220951,"still_path":"/wyBUe4xLE5PhcvPcYZhh4I1RrdJ.jpg"},"name":"Unintentional Love Story","next_episode_to_air":null,"networks":[{"id":3897,"logo_path":"/cfMtt9sNl2bDyHuoPSZouEqDB9N.png","name":"TVING","origin_country":"KR"},{"id":6316,"logo_path":"/ewwmht0dJZVia8gvmmf3rKSZynF.png","name":"iQIYI","origin_country":"MY"}],"number_of_episodes":10,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"비의도적 연애담","overview":"When Ji Won-young's direct superior at work is fired due to a corruption scandal, Won-young - in spite of being innocent of any wrongdoing - finds himself unceremoniously discharged from the company as well.","popularity":15.894,"poster_path":"/7sA7TplHI0zi20VKCzVSLObCVvM.jpg","production_companies":[{"id":154304,"logo_path":null,"name":"Number 3 Pictures","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2023-03-16","episode_count":10,"id":329849,"name":"Season 1","overview":"When Ji Won Young's direct superior at work is fired due to a corruption scandal, Won Young - in spite of being innocent of any wrongdoing - finds himself unceremoniously discharged from the company as well. Desperate to get his job back, Won Young tries to curry favor by tracking down the chairman's favorite artist. He finds the missing man running a pottery shop in a remote town, but it's clear that Yoon Tae Joon has no desire to be found. Won Young decides to hang around town and secretly report whatever he can learn about Tae Joon's self-imposed exile; but when feelings begin to develop between the two, Won Young starts to question his sexuality, his motivations, and whether he even wants to go back to his old life in Seoul. But what will happen when Tae Joon learns Won Young has been spying on him this entire time?","poster_path":"/hDBEX5USWAnsfF6sL4uOiGTD1eR.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.833,"vote_count":3,"season_data":{"1":{"_id":"63f5d5638c22c0007c7ea6d4","air_date":"2023-03-16","episodes":[{"air_date":"2023-03-16","episode_number":1,"episode_type":"standard","id":4251332,"name":"Episode 1","overview":"After his immediate manager got fired for corruption, Ji Won Young lost his job of two years as well, as he is thought to have been involved. Not knowing what to do, Won Young takes a trip outside of the city to rest. To his surprise, he meets Yoon Tae Joon, the company CEO's favorite artist. After his superior tells him that he should find out why Yoon Tae Joon disappeared without a trace two years ago, Won Young decides to pursue a part-time job at Tae Joon's pottery shop. But Tae Joon seems not in the least inclined to take on a part-timer or get close to anyone. Trying his best, Won Young helps the town and community in the hopes of landing a part-time job.","production_code":"","runtime":34,"season_number":1,"show_id":220951,"still_path":"/l1Luqpof3GcbUotwd7vvk1N2wH7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-17","episode_number":2,"episode_type":"standard","id":4303299,"name":"Episode 2","overview":"Tae Joon confronts Won Young about his intentions. With a little trick, Won Young manages to call in a favour and gets to participate in Tae Joon's pottery class. Despite originally only being interested in Tae Joon, Won Young starts to like pottery. When the class ends, Won Young asks Tae Joon for a ride back and they grow closer on the way. Won Young becomes witness to one of Ho Tae's common breakups with his girlfriends, seeing him get hit and slapped. Worried he takes him to Dong Hee's coffee shop and has him get treated, leading to an uncomfortable confrontation between Dong Hee and Ho Tae.","production_code":"","runtime":36,"season_number":1,"show_id":220951,"still_path":"/92Ips9zOMUlmQLXhD9shpI4uj0B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-24","episode_number":3,"episode_type":"standard","id":4303301,"name":"Episode 3","overview":"Won Young almost gets caught by Tae Joon while talking to the Vice-President, but he realises that Tae Joon only wants to give him his first finished pottery work as a present. Despite his happiness over the finished work, Won Young finds out that the inn he was staying at is going under construction, meaning he won't have anywhere to stay. Planning on finding a place, he continues working at the coffee shop but starts feeling ill. When arriving at the pottery class, Tae Joon sends him home to rest as he is clearly sick. After visiting the hospital and finding out it is more serious and he shall take a rest, he is taken in by Tae Joon, who offers to let him stay at his house. Despite their initial difficulties living together, they soon find common ground and grow closer. Dong Hee, who has no part-timer helping him anymore, struggles to keep the deliveries going. Ho Tae decides to come to his rescue and offers to help.","production_code":"","runtime":35,"season_number":1,"show_id":220951,"still_path":"/6YfpgDjOe7475T1VurMkRwigXDi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-24","episode_number":4,"episode_type":"standard","id":4303302,"name":"Episode 4","overview":"With Won Young and Tae Joon growing closer, Won Young feels his heart flutter even more and wonders what it might mean. After Tae Joon visits his former professor in the hospital, he has an unpleasant encounter with someone else from his past. Stressed out due to the memories, he disappears for a day, worrying Won Young, who finds him with a high fever in the living room the following evening. Desperate to help him, Won Young cares for Tae Joon until he is recovered. Tae Joon takes Won Young on a trip to his studio, and they spend the day together getting closer and learning about pottery. Ho Tae, who helped Dong Hee out while Won Young was sick, grows weary when Dong Hee doesn't seem to care about him. He reminisces over old memories of them and asks Dong Hee to take him out to eat as it is his last day in the coffee shop. At the beach, they run into Won Young and Tae Joon. A tipsy Won Young asks Tae Joon if he has someone he likes","production_code":"","runtime":39,"season_number":1,"show_id":220951,"still_path":"/feU9rPzuDgfmDoq8kV1zpdZFmlr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-31","episode_number":5,"episode_type":"standard","id":4303304,"name":"Episode 5","overview":"Asking Dong Hee to grant him a wish, Ho Tae wants them to date for a month, angering Dong Hee, who punches him. Despite this, Ho Tae continues trying to get them to date, leading to a confrontation between them. Ready to get hit by Ho Tae, Dong Hee is shocked when he receives a kiss instead but clearly refuses to believe in Ho Tae's feelings. Won Young continues living with Tae Joon and becomes increasingly confused about his feelings. Tae Joon, finally aware of his own emotions, tries to grow closer. Worried about misunderstanding their interactions and thinking Tae Joon likes someone else, Won Young declares his decision to move out.","production_code":"","runtime":33,"season_number":1,"show_id":220951,"still_path":"/tpQ3iRvu6kTUaBv1nm9clgb1djZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-31","episode_number":6,"episode_type":"standard","id":4303306,"name":"Episode 6","overview":"After moving out, Won Young tries to be still close to Tae Joon but receives the cold shoulder. Dong Hee invites Tae Joon out to drink to discuss their situation with Won Young and Ho Tae, but Tae Joon leaves in a hurry when he finds out Ho Tae and Won Young are buying study books together that evening. Ho Tae confronts Won Young about seeing Ho Tae kiss Dong Hee, but they reach a common understanding that liking someone is not wrong.","production_code":"","runtime":35,"season_number":1,"show_id":220951,"still_path":"/p1WvXJw2a3xKdnVQN6cVTB9Uv5c.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-04-07","episode_number":7,"episode_type":"standard","id":4303307,"name":"Episode 7","overview":"After Won Young and Tae Joon finally confess their feelings for each other, they spend a day at the beach before soon returning to their daily lives. While keeping their relationship secret, they grow closer and exchange more intimate details about each other. Ho Tae confronts Dong Hee about his confession and suggests that maybe Dong Hee is not angry because he asked to date but because he only said: \"for one month\".","production_code":"","runtime":null,"season_number":1,"show_id":220951,"still_path":"/fX11DqVJypD7pVAOQJd8aWHw8cE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-04-07","episode_number":8,"episode_type":"standard","id":4303308,"name":"Episode 8","overview":"With the Vice-President of the company revealing Won Young's original intentions in getting close to Tae Joon, Tae Joon is devastated but keeps his promise of visiting Won Young in his rented room. After purposefully testing him, Won Young keeps refusing to confess, angering Tae Joon, who breaks down and admits he knows the truth. Angry and hurt, he confronts Won Young about his charade and demands that they never see each other again. Won Young, devastated, tries to find an opportunity to talk but only receives the cold shoulder. To torture Won Young for breaking his heart, Tae Joon agrees to the exclusive deal with the company, resulting in Won Young getting his job back and raising his guilty conscience.","production_code":"","runtime":null,"season_number":1,"show_id":220951,"still_path":"/gwIMpkfP7OSGkROSHRdC3MP6Z3Q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-04-14","episode_number":9,"episode_type":"standard","id":4303309,"name":"Episode 9","overview":"","production_code":"","runtime":35,"season_number":1,"show_id":220951,"still_path":"/zpEt05b2svEMdAhB5GeENvRlubq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-04-14","episode_number":10,"episode_type":"standard","id":4303310,"name":"Episode 10","overview":"","production_code":"","runtime":35,"season_number":1,"show_id":220951,"still_path":"/wyBUe4xLE5PhcvPcYZhh4I1RrdJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"When Ji Won Young's direct superior at work is fired due to a corruption scandal, Won Young - in spite of being innocent of any wrongdoing - finds himself unceremoniously discharged from the company as well. Desperate to get his job back, Won Young tries to curry favor by tracking down the chairman's favorite artist. He finds the missing man running a pottery shop in a remote town, but it's clear that Yoon Tae Joon has no desire to be found. Won Young decides to hang around town and secretly report whatever he can learn about Tae Joon's self-imposed exile; but when feelings begin to develop between the two, Won Young starts to question his sexuality, his motivations, and whether he even wants to go back to his old life in Seoul. But what will happen when Tae Joon learns Won Young has been spying on him this entire time?","id":329849,"poster_path":"/hDBEX5USWAnsfF6sL4uOiGTD1eR.jpg","season_number":1,"vote_average":0}}}