{
    "adult": false,
    "backdrop_path": "/f7khMAqhMrArmQUb2Nh8NTX1ptA.jpg",
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2011-10-07",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "",
    "id": 221892,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2011-12-01",
    "last_episode_to_air": {
        "id": 4286376,
        "name": "P.F. Chang's",
        "overview": "Todd is in Scottsdale, Ariz.,, the home of P.F. Chang's and one of the most popular appetizers around, Chang's Chicken Lettuce Wraps. Todd learns at P.F. Chang's test kitchen that in Chinese cuisine, you need to have a seasoned wok, which he does not have. He also learns that the biggest secret to the recipe lies in the sauce. Todd decides to try a whole new approach to his detective work this time, and gets himself hired as a waiter at a local P.F. Chang's, gaining valuable access to the kitchen. Hilarity ensues as Todd tries to balance waiting tables and running back to the kitchen to try and uncover cooking secrets from the master chefs. Todd manages to get a meeting with the restaurant's founder, Philip Chiang, only to learn that the recipe is Philip's mother's. Todd pulls a sneaky move to land her number and actually gets her on the other line. The problem is she only speaks Chinese!",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2011-12-01",
        "episode_number": 8,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 60,
        "season_number": 1,
        "show_id": 221892,
        "still_path": "/bc6aN4bWIqHKRozajXpm85MbbHE.jpg"
    },
    "name": "Top Secret Recipe",
    "next_episode_to_air": null,
    "networks": [],
    "number_of_episodes": 8,
    "number_of_seasons": 1,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "Top Secret Recipe",
    "overview": "Each week, our food hacker host, Todd Wilbur, investigates an iconic American recipe and attempts to recreate it better than the original, proving it with a blind taste test.",
    "popularity": 0.006,
    "poster_path": "/aK4W5twR2s1KW7Ml5uUsc2ITz7a.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2011-10-07",
            "episode_count": 8,
            "id": 331729,
            "name": "Season 1",
            "overview": "Each week, our food hacker host, Todd Wilbur, investigates an iconic American recipe and attempts to recreate it better than the original, proving it with a blind taste test.",
            "poster_path": "/i4H2XnKbcURPQAJFVaQPeWO1lih.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "6408e3bcd75bd600862ebe80",
            "air_date": "2011-10-07",
            "episodes": [
                {
                    "air_date": "2011-10-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4286358,
                    "name": "KFC",
                    "overview": "Todd Wilbur is a food hacker who travels the country to crack America's favorite recipes. This week, Todd takes on one of the world's most famous secret recipes, KFC's Original Recipe Fried Chicken. In his traveling kitchen that's known as the \"Mobile Food Lab,\" Todd finds his way to Louisville, Kentucky to discover what it is that makes Colonel Sanders' recipe so Finger Lickin' Good. He finds a few of the Colonel's friends and speaks to anyone with insider info, but isn't afraid to do some undercover snooping to figure out the clues that no one will tell him. In the end Todd will attempt to fool 3 expert judges with his clone of the recipe in a taste test. Will he be able to do it?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 221892,
                    "still_path": "/lEmNcWBqGI0Eu7UJCZ6J9FSqpmn.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4286367,
                    "name": "Cinnabon",
                    "overview": "This week, Todd heads to Sandy Springs, Georgia to clone one of America's sweetest treats, Cinnabon's World Famous Cinnamon Rolls. But copying that ooey-gooey goodness of a Cinnabon Cinnamon Roll in just 3 days will be no easy feat. Todd taps into his vast knowledge of baking and uses trial and error to get as close as possible to the real deal. He is ultimately forced, however, to make a long trip to try and find proprietary ingredients, and the one person who may have all the secrets to the dough. It's a race against time, and a multi-city whirlwind adventure, as Todd tries to bake a batch of buns worthy of fooling the experts. Will his last-minute ingenuity pay off or will the door hit him in his buns on the way out?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 221892,
                    "still_path": "/3sxortwJwDPCa58uaQzvm6iLfAL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4286368,
                    "name": "Outback Steakhouse",
                    "overview": "Todd heads to Tampa, Florida, home of the original Outback Steakhouse and birthplace of the Bloomin' Onion. Everything about this recipe is top secret, from the breading, to the sauce, to how to cut the onion. In order to really understand this recipe, Todd must find the man who first created the Bloomin' Onion, but he's not so easy to track down these days. Todd gets himself into a few hairy situations in his search for Outback's secrets but finds out more than he ever thought he would from some surprising sources. With all his knowledge gained, will Todd's version of the Bloomin' Onion be able to stand up against the real thing in a taste test?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 221892,
                    "still_path": "/3iHmXHP1Xky9BVxfouNzMXBuNia.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-28",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4286370,
                    "name": "Domino's Pizza",
                    "overview": "This week, Todd takes on the world leader in pizza delivery, Domino's Pizza. His investigation takes him to Michigan, the birthplace of Domino's. Todd only has three days to clone a recipe that took two years to perfect, and with so little time, he has to supplement his own knowledge with some undercover work. He talks his way into extremely high security areas and works in disguise to uncover bits and pieces of Domino's guarded recipe. Todd even uses scientific analysis on the sauce with the help of a university professor. There's cheese, dough and sauce that have to be perfected, and this might just be Todd's most difficult challenge yet.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 221892,
                    "still_path": "/kcQ2SL7Lf1g7wkgvx3dwKwo7ErH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-10",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4286371,
                    "name": "Dippin' Dots",
                    "overview": "This week, Todd tries to clone one of America's most unique, fun-to-eat desserts - Dippin' Dots. He drives the mobile food lab to Paducah, Kentucky to begin his investigation at the Dippin' Dots HQ. This recipe requires more than just cooking knowledge, however, as Todd has to get a lesson in sub-zero freezing and dangerous liquids to pull off the challenge. Just how do they make those perfectly round, delicious beads of ice cream? Todd takes a few wild guesses of his own during his investigation, but is forced to take a road trip to another city to find some answers. Along the way he meets some interesting locals that help him out of a bind, and finds himself going to extremes to procure a rare material. In the end, will he be able to fool some of Dippin' Dots' biggest fans?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 221892,
                    "still_path": "/5f3EjhWhcgM5zQzBpeKkbhylvr3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-19",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4286373,
                    "name": "Mrs. Fields",
                    "overview": "This week Todd heads to Salt Lake City to take on the sweet treat that sparked his career as a food hacker -- Mrs. Fields Famous Chocolate Chip Cookie. There's definitely something that sets this recipe apart from your mother's, and Todd is on a mission to find out what that secret something is. In his quest to unravel the cookie mystery, he seeks help from some very special, \"little\" chocolateers, and he even finds himself doing some undercover work as an electrician in a Mrs. Fields store. Eventually, he tries to find the woman behind the cookie (Debbie Fields), but soon realizes she is impossible to find. As a last resort, Todd uses an unconventional method to make a connection to Mrs. Fields through psychic powers. Will he successfully uncover the secrets and finally get this recipe down pat, or will it take him another 20 years to crack the cookie code?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 221892,
                    "still_path": "/3YJ6Kv8JxeTOJa9rg9oVORGi5WF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-24",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4286374,
                    "name": "Chili's",
                    "overview": "This week Todd heads to Dallas to try and clone an American classic - Chili's Baby Back Ribs. After he stops off at Chili's headquarters to elicit some information, he sets out to replicate their famous entrée. In attempting to crack this recipe, however, Todd must get scientific with his microscope and resourceful with a hacksaw and a piece of his truck. After several failed attempts and a four alarm fire in his smoker, he begins to question whether or not the information he received at R&D was on the level, or purposely misleading. Luckily the Dallas Cowboys Cheerleaders lend their seasoned, BBQ taste buds to help Todd figure out what he's missing from his recipe. In the end, Todd takes it to the next level and goes in disguise once again. Will he crack the code in time or be forced to sing the \"Chili's Baby Back Ribs\" song at a busy lunch hour?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 221892,
                    "still_path": "/qf8XdOkzn3wNU7oPGdDhO0LPSRT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-12-01",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 4286376,
                    "name": "P.F. Chang's",
                    "overview": "Todd is in Scottsdale, Ariz.,, the home of P.F. Chang's and one of the most popular appetizers around, Chang's Chicken Lettuce Wraps. Todd learns at P.F. Chang's test kitchen that in Chinese cuisine, you need to have a seasoned wok, which he does not have. He also learns that the biggest secret to the recipe lies in the sauce. Todd decides to try a whole new approach to his detective work this time, and gets himself hired as a waiter at a local P.F. Chang's, gaining valuable access to the kitchen. Hilarity ensues as Todd tries to balance waiting tables and running back to the kitchen to try and uncover cooking secrets from the master chefs. Todd manages to get a meeting with the restaurant's founder, Philip Chiang, only to learn that the recipe is Philip's mother's. Todd pulls a sneaky move to land her number and actually gets her on the other line. The problem is she only speaks Chinese!",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 221892,
                    "still_path": "/bc6aN4bWIqHKRozajXpm85MbbHE.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "Each week, our food hacker host, Todd Wilbur, investigates an iconic American recipe and attempts to recreate it better than the original, proving it with a blind taste test.",
            "id": 331729,
            "poster_path": "/i4H2XnKbcURPQAJFVaQPeWO1lih.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    }
}