{"adult":false,"backdrop_path":"/6Vnaok26geOOjZvWSwMmuCj9wti.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2003-10-08","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":22211,"in_production":false,"languages":["en"],"last_air_date":"2003-10-22","last_episode_to_air":{"id":607839,"name":"The Last Prize","overview":"The final hour, \"The Last Prize,\" opens with Churchill's trip to the Normandy beaches in June, 1944. When victory in Europe finally came, Churchill led the celebrations, but in private, he brooded about the dangers of Stalin and communism. Two months later, he lost an election. To his family and close staff he admitted his bitter hurt at the ingratitude of the British nation. He returned to contest the 1951 election, pledging to lead Britain in the post-war age and determined to forge a peaceful alliance between the two superpowers, the U.S. and the USSR. After years of being branded a \"war monger,\" Churchill wanted to be a peacemaker and bring an end to the Cold War. One month short of his 77th birthday, he became prime minister again. The pressures of leadership quickly began to show, however, and in 1953 he suffered a severe stroke; in 1955 he resigned. The last 10 years of his life were a time for reflection. Depressed about Britain's lack of power and the death of the British Empire, he confided to a friend that he felt he hadn't achieved anything in life. When Churchill died in January 1965, it was not only the end of a remarkable life, but the end of an era.","vote_average":0,"vote_count":0,"air_date":"2003-10-22","episode_number":3,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":22211,"still_path":null},"name":"Churchill","next_episode_to_air":null,"networks":[{"id":9,"logo_path":"/oz9pjTHnBUmlju8OkaTymhKbh6C.png","name":"ITV1","origin_country":"GB"}],"number_of_episodes":3,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Churchill","overview":"Winston Churchill is renowned as the legendary war leader, inspiring Britain in its finest hour. This series looks at the man behind the legend, bringing you closer to the real Churchill through the eyes of those closest to him.","popularity":1.591,"poster_path":"/yZok21KsfDhTmSt5JsreLUzX3TJ.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2003-10-08","episode_count":3,"id":32091,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Miniseries","vote_average":7,"vote_count":2,"season_data":{"1":{"_id":"52586ddf760ee346611e9fd7","air_date":"2003-10-08","episodes":[{"air_date":"2003-10-08","episode_number":1,"episode_type":"standard","id":607837,"name":"Destiny","overview":"The first hour tells the story of Churchill's early life — his aristocratic birth, his search for glory on the battlefield, his rise up the political ladder and his fall from it. By his 55th birthday in 1931, Churchill had fought in five wars, contested 14 elections and raised a family of five children. Described as \"a young man in a hurry,\" he believed he was destined for greatness. Like his famous ancestor, the Duke of Marlborough, he searched for glory on the battlefield. At the height of Queen Victoria's reign in 1898, the 23-year-old Churchill took part, as soldier and journalist, in the last great cavalry charge of the British army in the Battle of Omdurman. He later fought in the Boer War in South Africa and in World War I. He was damned as an egotistical and unscrupulous medal-hunter, but his ruthless determination and ambition were rewarded with the political success he craved. His election to parliament in 1900 began a controversial and checkered political career that lasted 60 years. \"Destiny\" follows his journey from young Conservative star to leading Liberal social reformer, from the disgraced head of the British Royal Navy in WWI to the senior position of Chancellor of the Exchequer. The program ends in 1931, with Churchill no longer part of the national government.","production_code":"","runtime":60,"season_number":1,"show_id":22211,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-15","episode_number":2,"episode_type":"standard","id":607838,"name":"The Lion's Roar","overview":"Hour two explores the years between 1929 and 1939, which became widely known as the \"wilderness years,\" during which Churchill was variously described as a \"maverick,\" a \"spent force\" and a \"fanatic.\" His reactionary views about British control in India and King Edward VIII's abdication alienated him from his political peers. But the war years from 1939 to 1945 became his most famous period. After a lifetime driven by a desire to be the man who made history, history came to meet him. \"The Lion’s Roar\" traces Churchill's leadership of Britain through its finest hour during the Battle of Britain to its darkest hour in 1942. His famous speeches evoked everything about Britain that he thought was great and rallied the nation. When he visited the bombed out streets of London, his tears revealed his sensitivity. But the pressures of war forced him to make agonizing and brutal decisions. In 1940, to prevent capture by the Germans, Churchill ordered the sinking of the French fleet at Oran; 1200 French sailors were killed. The program also explores the important relationship between Churchill and President Roosevelt.","production_code":"","runtime":60,"season_number":1,"show_id":22211,"still_path":"/9Z57ihEPAr97izqgI0kvfQFXvkm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-22","episode_number":3,"episode_type":"finale","id":607839,"name":"The Last Prize","overview":"The final hour, \"The Last Prize,\" opens with Churchill's trip to the Normandy beaches in June, 1944. When victory in Europe finally came, Churchill led the celebrations, but in private, he brooded about the dangers of Stalin and communism. Two months later, he lost an election. To his family and close staff he admitted his bitter hurt at the ingratitude of the British nation. He returned to contest the 1951 election, pledging to lead Britain in the post-war age and determined to forge a peaceful alliance between the two superpowers, the U.S. and the USSR. After years of being branded a \"war monger,\" Churchill wanted to be a peacemaker and bring an end to the Cold War. One month short of his 77th birthday, he became prime minister again. The pressures of leadership quickly began to show, however, and in 1953 he suffered a severe stroke; in 1955 he resigned. The last 10 years of his life were a time for reflection. Depressed about Britain's lack of power and the death of the British Empire, he confided to a friend that he felt he hadn't achieved anything in life. When Churchill died in January 1965, it was not only the end of a remarkable life, but the end of an era.","production_code":"","runtime":60,"season_number":1,"show_id":22211,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":32091,"poster_path":null,"season_number":1,"vote_average":0}}}