{
    "adult": false,
    "backdrop_path": null,
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "1985-09-14",
    "genres": [],
    "homepage": "",
    "id": 222841,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "1985-12-07",
    "last_episode_to_air": {
        "id": 4314062,
        "name": "What's Up, Stox?",
        "overview": "It's that time again for the annual Funtime Fall Festival. Unfortunately the Wuzzles don't have enough money to buy the costumes they want. After failing to make some money for the costumes, they meet a new resident of Wuz, Tycoon. Did money ever grow on trees? Well, yes! Tycoon had a money tree and a spare seed that he offered to the Wuzzles for all their good stuff. Unfortunately when the seed was planted, every Wuzzle couldn't wait for their turn and started pruning money from the tree until it was bare. Crock manages to find out that Tycoon has a money tree and steals it. Soon after Tycoon offers to give back all the Wuzzles' stuff to help him get back his money tree. The attempt to get the money tree fails and the Wuzzles learn that they were being just as greedy as Crock and that snorses do not sit on whoopee cushions.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "1985-12-07",
        "episode_number": 13,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 25,
        "season_number": 1,
        "show_id": 222841,
        "still_path": null
    },
    "name": "The Wuzzles",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 16,
            "logo_path": "/wWA5mILSAyahtdNQh1WiADi6PRI.png",
            "name": "CBS",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 13,
    "number_of_seasons": 1,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "The Wuzzles",
    "overview": "Disney's Wuzzles was an American animated television series created for Saturday morning television, and was first broadcast on September 14, 1985 on CBS. Wuzzles features a variety of short, rounded animal characters (each called a Wuzzle, which means to mix up). Each is a roughly even, and colorful, mix of two different animal species (as the theme song mentions, \"...livin' with a split personality\"), and all the characters sport wings on their backs, although only Bumblelion and Butterbear are seemingly capable of flight. All of the Wuzzles live on the Isle of Wuz. Double species are not limited to the Wuzzles themselves. From the appleberries they eat to the telephonograph in the home, or a luxury home called a castlescraper, nearly everything on Wuz is mixed together in the same way the Wuzzles are. The characters in the show were marketed extensively.",
    "popularity": 0.474,
    "poster_path": "/3xNctO3CcsHHI2xDVYJiD0WEBGt.jpg",
    "production_companies": [
        {
            "id": 3475,
            "logo_path": "/jTPNzDEn7eHmp3nEXEEtkHm6jLg.png",
            "name": "Disney Television Animation",
            "origin_country": "US"
        }
    ],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "1985-09-14",
            "episode_count": 13,
            "id": 333713,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "641c1cab95c0af0084eba8fb",
            "air_date": "1985-09-14",
            "episodes": [
                {
                    "air_date": "1985-09-14",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4313934,
                    "name": "Bulls of a Feather",
                    "overview": "It's a beautiful day for the Wuzzles to have a picnic until a swarm of flants (part fly, part ant) flies in to spoil it. While trying to save Hoppo's applemellon, Eleroo manages to crash into a banana pine tree and knocks an egg right into his pouch. They decide to hatch the egg and Crock gets word that it's a Brahma Bullfinch. Crock manages to trick the Wuzzles as the Bullfinch's mother to get at the valuable tail feathers. Soon after, it's not very long for the Bullfinch's real mother goes after the Wuzzles for taking her baby. The Wuzzles finally stop Crock and return the baby bullfinch to it's mother.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-09-21",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4313936,
                    "name": "Hooray for Hollywuz",
                    "overview": "The Wuzzles had a very unpleasant awakening due to Hoppo practicing for her role in the musical \"\"Cinderwuzzle\"\", as the fairy godmother. The others feel that it won't work because she's too heavy for the part. Hoppo realizes that she'd be better off in bigger productions and head to Hollywuz. As Hoppo writes back to the Wuzzles about the great success she's having, her friends decide to visit. Soon after, the Wuzzles finally realize that Hoppo was a big flop and she realizes that her friends are much more important.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-09-28",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4313937,
                    "name": "In the Money",
                    "overview": "When Eleroo advises Bumblelion to make a wish when getting the biggest part of the wishbone, it means trouble for poor Rhinokey for losing two bank bags of money. Bumblelion starts spending the money and looses his friends while Rhinokey manages to escape from Officer Eaglebeagle. Rhinokey tries to convince Bumblelion to return the bank bags, but Bumblelion decides to run off thinking that Rhinokey wants to steal his money. Soon after, Bumblelion realizes how Rhinokey lost the bank bags and returns the money to the police.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-10-05",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4313939,
                    "name": "Crock Around the Clock",
                    "overview": "The weather in the Land of Wuz is a little strange, especially tropical fruit storms. Unfortunately it leaves Crock homeless when his roof caves in. He manages to get Butterbear to look after him which starts to get a little suspicious. When Bumblelion realizes of Crock's trick, he and the Wuzzles make sure that Crock will never pull another stunt like this again.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-10-12",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4313969,
                    "name": "Moosel's Monster",
                    "overview": "Moosel's wild imagination manages to get him into a lot of trouble while the Wuzzles were picking appleberries. It finally gets so bad that boulder manages crash into the dam. When Moosel is sent home, he suddenly thinks that he's imagining a big monster that keeps following him around. It's actually a real monster with a very bad toothache. When the other Wuzzles see it and convince Moosel that it's a real monster, it offers to help save the leaking dam.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-10-19",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4313980,
                    "name": "Klutz on the Clutch",
                    "overview": "Due to when the trophy for the Wuzzle Rally is thrown out of Rhinokey's cab, Bumblelion manages to convince Eleroo that Rhinokey is a sure bet to win back his Uncle Kanga's trophy. Unfortunately Rhinokey is almost thrown out of the Wuzzle Rally when he crashes into Officer Eaglebeagle. When the Wuzzles try to help Rhinokey become a safe driver. He falls into one of Crock's tricks and nearly kills Bumblelion. As a result, Rhinokey drops out of the Wuzzle Rally and quits driving. Hoppo and Eleroo take over, but the Rhinokey Roadster manages to fall into another one of Crock's plans and falls apart. Rhinokey then suddenly convinces himself that he'll re-enter the race and manages to win it by a horn.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-10-26",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4313990,
                    "name": "Bumblelion and the Terrified Forest",
                    "overview": "When Bumblelion starts to act like a hero, Hoppo gets a make over, and Butterbear manages to get captured by a pair of dingbats (part dingo, part bat.) Soon Butterbear tries to convince Transylvia that she can make her the most ugliest vampirewitch in the forest. When Bumblelion and Hoppo arrive for Butterbear's rescue, Transylvia sends Bumblelion to her castle to get some butter berries to cure her pet gorantula (part gorilla, part tarantula.) Sounds like an easy task but her pet has turned into a monster. Finally the Bumblelion manages to retrieve the butter berries but Hoppo now needs to be rescued from the clutches of the gorantula.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-11-02",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4313991,
                    "name": "Eleroo's Wishday",
                    "overview": "It's that time again for the Wuzzles to climb up a mountain to the old wishing well and be granted three wishes. This time it's Eleroo who get them and wishes that he could fly. Unfortunately he manages to crash onto his friends and all the birds fly away. Finally Crock tries to trick Eleroo out of his wishes but he learns that it's much more safer to be on the ground.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-11-09",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4313993,
                    "name": "Ghostrustlers",
                    "overview": "The Wuzzles are forced to leave their homes when a toonado of humbugs (part humming bird, part locust) create a lot of noise in Wuz. They decide to camp out, but end up in a ghost town named Wuzzle Gulch. When some very strange ghosts arrive, it's time to call in the Ghostrustlers. When the ghosts tell the Wuzzles that Crock is digging for gold, they manage to scare him out of the Gulch for good.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-11-16",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 4314005,
                    "name": "A Pest of a Pet",
                    "overview": "When Rhinokey decides to play a trick during Hoppo's audition for the ballet \"\"The Dying Swanpig\"\", the other Wuzzles manage to get a mockingbirddog to teach him a lesson. When he tries to hide from his new pet, he gets laughed at by his friends and feels ashamed about it and runs away. Suddenly all the mockingbirddogs get loose and raise havoc in the Land of Wuz. The Wuzzles realize that Rhinokey is the only one who can out mock the mockingbirddogs and convince him to come back. Rhinokey finally manages to capture all the mockingbirddogs, but also plays one last practical joke on Hoppo.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-11-23",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 4314020,
                    "name": "The Main Course",
                    "overview": "When Hoppo convinces the Wuzzles to take a vacation, they manage to meet up with the pirats (part parrot, part rat.) Soon after, they manage to get on an Island and Hoppo nearly gets sacrificed by the pigmice (part pig, part mouse.) The Wuzzles find a mine and convince the angry miner that the pigmice are dropping party favors and other stuff into it, not to mention a whole lot of potamus to follow. As soon as the miner reveals himself to the pigmice, they throw away Hoppo in fright and the Wuzzles begin their journey home back to the Land of Wuz.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-11-30",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 4314028,
                    "name": "Class Dismissed",
                    "overview": "When Butterbear is asked to invite the Wuzzles to a big social, she changes her mind and convinces them that their class standards wern't high enough to attend. Crock soon challenges Butterbear to make Brat a gentleman before the big event while the other Wuzzles learn how to be classy. When it comes time for the big night, Crock tries to sabotage the party and the Wuzzles start being in a class all to themselves.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1985-12-07",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 4314062,
                    "name": "What's Up, Stox?",
                    "overview": "It's that time again for the annual Funtime Fall Festival. Unfortunately the Wuzzles don't have enough money to buy the costumes they want. After failing to make some money for the costumes, they meet a new resident of Wuz, Tycoon. Did money ever grow on trees? Well, yes! Tycoon had a money tree and a spare seed that he offered to the Wuzzles for all their good stuff. Unfortunately when the seed was planted, every Wuzzle couldn't wait for their turn and started pruning money from the tree until it was bare. Crock manages to find out that Tycoon has a money tree and steals it. Soon after Tycoon offers to give back all the Wuzzles' stuff to help him get back his money tree. The attempt to get the money tree fails and the Wuzzles learn that they were being just as greedy as Crock and that snorses do not sit on whoopee cushions.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 222841,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 333713,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    }
}