{
    "adult": false,
    "backdrop_path": "/ruTatPBEaymYaWm06pVtR0b4VHp.jpg",
    "created_by": [],
    "episode_run_time": [
        30
    ],
    "first_air_date": "2017-10-12",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        },
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "https://gustotv.com/shows/the-latin-kitchen/",
    "id": 223826,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2017-10-12",
    "last_episode_to_air": {
        "id": 4342537,
        "name": "Venezuelan Corn Recipes",
        "overview": "Venezuelan host Juan Pablo Gonzalez inspires us with corn recipes from his home country. Corn plays an important role in Venezuelan cuisine and is used in all sorts of dishes. To start, Juan Pablo prepares cachapas, a fried corn pancake that brings back memories of his childhood walks to school. Topped with pork and cheese, this crispy pancake can be enjoyed either savoury or sweet. Next up, Juan Pablo shares another Venezuelan culinary tradition: grilling. Using a hot grill, he cooks up a tender, juicy steak and an irresistible charred corn salad. He then shows us an easy beef stew, perfect for those days when you want to enjoy a delicious meal without spending the day in the kitchen. His secret? Keep the corn on the cob and the meat on the bone while they simmer. To finish things off, Juan Pablo whips up a corn-based dessert, adding another traditional Venezuelan ingredient, coconut, to make a divine pudding treat.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2017-10-12",
        "episode_number": 1,
        "episode_type": "standard",
        "production_code": "",
        "runtime": 30,
        "season_number": 1,
        "show_id": 223826,
        "still_path": null
    },
    "name": "The Latin Kitchen",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 2764,
            "logo_path": "/xhoPVvSmHRm1984Sd8GWmEQ6YQa.png",
            "name": "Gusto",
            "origin_country": "CA"
        }
    ],
    "number_of_episodes": 15,
    "number_of_seasons": 1,
    "origin_country": [
        "CA"
    ],
    "original_language": "en",
    "original_name": "The Latin Kitchen",
    "overview": "The Latin Kitchen is an upbeat half-hour of culinary favourites from Mexico, Spain, and Venezuela. In their very own rustic Latin Kitchen, Juan Pablo (Venezuela), Luis (Mexico) and Tigretón (Spain) give us fresh takes on traditional Latin meals. Our hosts introduce us to simple techniques and new ingredients sure to spice up any dinner party or weeknight meal.\n\nIn each fast-paced episode, we’ll explore Spanish, Mexican, or Venezuelan cooking, with hosts focusing on an ingredient or regional flavour for four mouth-watering recipes. The hosts bring their own unique culinary style to the table, sharing stories of growing up in Latin kitchens with recipes passed down through the generations to inspire and entertain audiences.",
    "popularity": 0.939,
    "poster_path": "/kq20Bk4lPdGaleGj3x49qNMJWT.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2017-10-12",
            "episode_count": 15,
            "id": 335707,
            "name": "Season 1",
            "overview": "An upbeat half-hour of culinary favourites from Mexico, Spain, and Venezuela. Three charming hosts, skillful techniques and wholesome ingredients are sure to spice up any dinner party or weeknight meal.",
            "poster_path": "/kq20Bk4lPdGaleGj3x49qNMJWT.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "642c215f8de0ae00d5f4cb53",
            "air_date": "2017-10-12",
            "episodes": [
                {
                    "air_date": "2017-10-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4342537,
                    "name": "Venezuelan Corn Recipes",
                    "overview": "Venezuelan host Juan Pablo Gonzalez inspires us with corn recipes from his home country. Corn plays an important role in Venezuelan cuisine and is used in all sorts of dishes. To start, Juan Pablo prepares cachapas, a fried corn pancake that brings back memories of his childhood walks to school. Topped with pork and cheese, this crispy pancake can be enjoyed either savoury or sweet. Next up, Juan Pablo shares another Venezuelan culinary tradition: grilling. Using a hot grill, he cooks up a tender, juicy steak and an irresistible charred corn salad. He then shows us an easy beef stew, perfect for those days when you want to enjoy a delicious meal without spending the day in the kitchen. His secret? Keep the corn on the cob and the meat on the bone while they simmer. To finish things off, Juan Pablo whips up a corn-based dessert, adding another traditional Venezuelan ingredient, coconut, to make a divine pudding treat.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-21",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4342550,
                    "name": "Arepas: Venezuela's National Bread",
                    "overview": "Venezuelan-born Juan Pablo Gonzalez is an expert in his home country's national bread, the arepa. To kick things off, he shows us how to make the basic arepas, then adds fresh tomatoes and cheese to make a simple and rich arepa a queso. Next, it's a chicken salad sandwich, Venezuelan style. Juan Pablo combines fresh herbs, sweet peppers, creamy avocado and shredded chicken, showing us a street food favourite that is sure to become a staple on your family's lunch menu. Now, it's time for a refreshing shrimp arepa. Juan Pablo mixes shrimp with the delicious and fresh flavours of lemon and cilantro, making a meal that's perfect for the beach or your patio. For his final arepa recipe, Juan Pablo whips up a crowd favourite: arepa pelúa. He piles fresh vegetables with cheese and moist, fall-off-the-bone brisket onto an arepa, to make a hearty meal that leaves just enough room for a cold beer.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-09",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4342552,
                    "name": "Plantain Recipes",
                    "overview": "Plantain is one of the most popular ingredients in Venezuelan cuisine and passionate cook Juan Pablo Gonzalez shows us how it can be used in both sweet and savoury dishes. While it may look like a banana, the plantain has a completely different but delicious flavour, especially when fried up and transformed into savoury French fry-like tostanes. Next up, Juan Pablo shows us how to make plantain lasagna - yes, lasagna. He layers savoury fried plantain strips with a mouthwatering halibut and veggie stew, topped with delicious cotija cheese. Then our host shows us how to make a pescado frito con patacones, a simple but incredible feast, featuring red snapper with tostanes. Finally, Juan Pablo introduces us to the plantain's sweet side with a dessert that won't last long on your plate: a decadent pudding pie with a sticky syrup base.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-17",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4342553,
                    "name": "Traditional Venezuelan Recipes",
                    "overview": "Host Juan Pablo Gonzalez has fond memories of cooking traditional Venezuelan dishes during his childhood and he shares some of his family's secrets. For his first recipe, Juan Pablo makes a pan de jamon, a soft sweet bun that brings back memories of spending time with his family at Christmas. Juan Pablo combines the flavour of savoury ham and salty olives with sweet raisins to create a melt-in-your-mouth holiday favourite. Next, he cooks vuelve la vida, a refreshing seafood ceviche that mixes the tantalizing textures of squid, shrimp and mussels.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-31",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4342556,
                    "name": "Dinner, Venezuelan Style",
                    "overview": "Impress your dinner guests with Juan Pablo Gonzalez's four-course Venezuelan menu. First, he introduces us to tequenos, a deep-fried cheese pastry that will make you re-think the ordinary mozzarella stick. Next, Juan Pablo channels his inner musician, creating a melody of seafood and turning it into a delectable soup. For the main course, Juan Pablo gives a classic roast beef dish the Venezuelan treatment with their preferred cooking technique - grilling.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-07-13",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4342558,
                    "name": "Spanish Tapas",
                    "overview": "Chef Luis \"Tigretón\" Leon has explored his home country of Spain, perfecting his beloved cuisine in kitchens from Valencia to Madrid. To kick things off, he shares the secret to making irresistible tapas, a traditional Spanish dish perfect for sharing with friends on a warm evenings with a glass of wine. For his first small plate, Tigretón puts a twist on his personal favourite, the Patatas Bravas, crispy potatoes in a spicy garlicky tomato sauce.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-03",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4342559,
                    "name": "Ajillo (Garlic)",
                    "overview": "From raw to pickled, Spain LOVES garlic in all its gorgeous forms, Spanish-born Chef Tigretón pays homage to garlic with four tasty recipes. Garlic might be a simple ingredient, but Chef Tigreton shows us that when used properly, it's perfect for adding another dimension to a meal. First, Tigretón takes toasted garlic and transforms it into a warm and creamy soup, making it the ultimate comfort food. For his next recipe, he doubles up the garlic goodness with a charred, crispy garlic chicken accompanied by a rich aioli sauce that would please anyone's taste buds.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-05",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4342560,
                    "name": "Spain's Specialty: Pork",
                    "overview": "Spain is famous for pork and Chef Luis \"Tigretón\" Leon prepares four scrumptious dishes with this traditional ingredient. For his first dish, he goes the rustic route and uses a single skillet to fry up crispy pork belly slices with a beautiful crusted mashed potato and cabbage side. Next, Chef Tigretón turns to chorizo, a traditional pork sausage, and pork belly to make secreto de cerdo, a classic Spanish dish he serves up with a vibrant tomato and bread salad. He then amps things up with a Spanish ratatouille that packs a flavour punch.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-24",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4342561,
                    "name": "Spanish Coastal Recipes",
                    "overview": "Basque country, the region along the northeastern Atlantic coast of Spain, is known for its rustic scenery and delicious food. Chef Luis \"Tigretón\" Leon explores this region of Spanish cuisine. First, Tigretón introduces us to traditional savoury appetizers that can be whipped up faster than you can eat them. Using skewers and very little time, he stacks olives, picked peppers and anchovies for a salty appetizer. Next, he prepares a open-faced Basque breakfast sandwich, placing chopped chorizo on top of a warm baguette and fried egg.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-14",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 4342562,
                    "name": "Seafood with a Spanish Twist",
                    "overview": "Chef Luis \"Tigretón\" Leon has travelled and worked in kitchens all over Spain, perfecting his craft and exploring his beloved home cuisine. One of his favourite aspects? The seafood. First, Tigretón shows us how to make some irresistible crispy-fried calamari on a soft bun slathered in a garlic aioli. Simple, savoury and perfect when served with an ice-cold beer. Next, our host teaches us a trick that sets apart his seafood stew recipe from others: use ground, toasted almonds to thicken your sauce and make it a delicious romesco.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-07",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 4342572,
                    "name": "Traditional Mexican Beans with Breakfast, Lunch and Dinner",
                    "overview": "Mexican-born Chef Luis Valenzuela is ready to share the secrets of his home country's cuisine, one dish at a time. First, Luis whips up a classic side dish that is served with every Mexican meal: beans. He starts off by transforming pinto beans into refried goodness. But you can't just have beans for breakfast. To complete the dish, Luis heats up a soft corn tortilla before topping it with the delicious refried beans and a delicate quail egg. Next up, Luis shows us a spicy breakfast dish: huevos rancheros.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-28",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 4342575,
                    "name": "Baja Dishes",
                    "overview": "Imagine you're on a white sand beach in the beautiful coastal region of Baja, Mexico. What are you eating? Chef Luis Valenzuela has a pretty good idea and he's ready to share his favourite recipes. To start, he grills up a fresh snapper that's been marinated in guajilla chilli paste, giving it just the right amount of spice. He places the charred fish on a soft tortilla and sprinkles it with lime, red onion and cilantro, making this the perfect beach snack.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-17",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 4342581,
                    "name": "Mexican Street Food",
                    "overview": "Mexicans love their street food and Chef Luis Valenzuela is sharing the secrets to four irresistible street food recipes from his home country. To begin, Luis introduces us to a creamy, yet spicy corn salad, mixing the flavours of fresh herbs with chilies to make a mouth-watering dish. Top it with cotija cheese and aioli for an irresistible corn salad. Next up, Luis shares his take on everyone's favourite Mexican dish: tacos. Smoky, juicy, shredded chicken with the distinct flavours of chipotle pepper and tomatoes create the base of the tacos.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-07-05",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 4342585,
                    "name": "Chilies, Chilies, Chilies!",
                    "overview": "If there's one thing Mexican cuisine is known for, it's spicing things up with chiles. To kick things off, Chef Luis Valenzuela turns to jalapenos to make rajas con suero, a chili and rice casserole that mixes the heat of the chilies with perfectly melted cheese. Next up, Luis makes Chile Rellenos, the original jalapeno popper. Stuffed with gooey cheese and fried to perfection, these stuffed poblanos will quickly become your go-to snack. Then it's on to chili, but not your average chili. Luis shows us how to make a thick, chunky Mexican chili with hearty potatoes topped with crispy tortilla chips. You'll never want to make chili any other way. Finally, a tender rack of lamb, in a sweet honey and spicy chili sauce.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-07-26",
                    "episode_number": 15,
                    "episode_type": "finale",
                    "id": 4342587,
                    "name": "Classic Mexican Dishes with Avocado",
                    "overview": "Mexican-born chef Luis Valenzuela loves the diversity of his home country's cuisine, but his favourite dishes are the simple recipes that make you the star of the kitchen. For his first dish, he prepares a refreshing shrimp ceviche, a dish known to all Latin cuisines. Luis gives this delicate dish a Mexican twist with a splash of tequila, lime for freshness, and tops it all off with creamy avocado. Our host then prepares some vibrant avocado and tomato salsa for a crispy chorizo tostada. Luis shows us how to transform the tostada by crisping up a tortilla in a hot-oiled pan. Quick, simple and absolutely delicious. Next, it's time for a classic Mexican dish: carnitas. Luis cooks up a pork cutlet low and slow, just like they do in street stalls all over Mexico, flavouring the meat with a garlic and orange marinade. When the meat is ready, he crisps it up to balance out the accompanying creamy avocado salsa. The mouth-watering result is more than worth the wait.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 223826,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "An upbeat half-hour of culinary favourites from Mexico, Spain, and Venezuela. Three charming hosts, skillful techniques and wholesome ingredients are sure to spice up any dinner party or weeknight meal.",
            "id": 335707,
            "poster_path": "/kq20Bk4lPdGaleGj3x49qNMJWT.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    }
}