{"adult":false,"backdrop_path":"/bfuWV7WRf8mD56rbVugd29CZeQA.jpg","created_by":[{"id":129534,"credit_id":"5ad16380c3a3683ef9005122","name":"Art Clokey","gender":2,"profile_path":null}],"episode_run_time":[30],"first_air_date":"1988-01-02","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":22888,"in_production":false,"languages":[],"last_air_date":"1988-08-20","last_episode_to_air":{"id":616738,"name":"Dolly for Minga / Lost Arrow / Clay Trix","overview":"Dolly for Minga:\n\nLost Arrow:\n\nClay Trix:\n\nA minute of strangely morphing shapes and general weirdness.","vote_average":0,"vote_count":0,"air_date":"1988-08-20","episode_number":34,"episode_type":"standard","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null},"name":"Gumby Adventures","next_episode_to_air":null,"networks":[],"number_of_episodes":36,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Gumby Adventures","overview":"The continuous adventures of Gumby and his pals. This time, he runs a farm which includes more pals such as a wooly mammoth, Denali, and a bee, Groobee.","popularity":7.665,"poster_path":"/vqQfcas82r2kTHuag33n7zhxaVo.jpg","production_companies":[{"id":55745,"logo_path":"/pYNfr1iUnsQJoTJ3Jxu1VjuLHyI.png","name":"Lorimar Telepictures","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"1988-01-02","episode_count":36,"id":32847,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[],"status":"Ended","tagline":"","type":"Scripted","vote_average":5.5,"vote_count":2,"season_data":{"1":{"_id":"525870c7760ee34661226489","air_date":"1988-01-02","episodes":[{"air_date":"1988-01-02","episode_number":1,"episode_type":"standard","id":616707,"name":"The Music Ball / Shrink-a-Dink / Hatching Out","overview":"The Music Ball:\n\nA package parachutes into Gumby's ranch. The only writing on it are the words \"Top Secret\". \"Let's open it!\" It turns out to be a golden ball that randomly freaks out whenever Gumby and friends play music. They decide to use the strange object to get on Johnny Carson and MTV, after lunch, of course. Wouldn't you know it, the Blockheads steal it while they're eating, and they have a downright unnessecary chase scene to recover it. The short ends with Gumby's strange, phantasmagoric concert.\n\nShrink-a-Dink:\n\nPokey's unsure about a visit to Professor Kapp's lab, but eventually gives into his peers. They all go to the lab where the Professor unveils his shrinking machine. As everyone but Pokey patiently wait in the machine's area of influence, Pokey accidentally turns the machine on, shrinking everyone to the size of an ant. When enough time has been killed by unimportant events, Pokey unshrinks everyone and vows never to eat candy again.\n\nHatching Out:\n\nThe first half of this cartoon features Gumby being stalked and horribly devoured by a Tyrannosaurus, both in the Toy Store and on his ranch. A second later, everyone else arrives to find the dinosaur napping in the hay. Fortunately, Denali scares it off with a few ice cubes, but it left behind an egg. Prickle decides to dump it in a passing garbage truck. It hatches moments later, with Gumby inside. Turns out the whole thing was a dream brought on by too many nature documentaries about the mating habits of dinosaurs before bedtime.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-01-09","episode_number":2,"episode_type":"standard","id":616711,"name":"Mirror-Aculous Recovery / As the Worm Turns / Wild Girls","overview":"Mirror-Aculous Recovery:\n\nWhile Prickle and Goo search for a hairbrush that's so important that it's only mentioned once, Gumby and Pokey enter a mirror, hoping to redeem the free hot fudge sundaes that a nearby sign promises them. Unfortunately, it's a trap set by the Blockheads, who shatter the mirror, trapping Gumby and Pokey in a strange other-world. When Goo fails to reassemble the mirror by reversing a tape recording of a note that shatters glass, Goo and Prickle get a clue and have Professor Kapp reassemble it with the most powerful plot device in the world.\n\nAs the Worm Turns:\n\nThe Blockheads are using insecticides on their farm, much to the dismay of the local earthworms. Fortunately, Gumby is the self-appointed guardian of all earthworms, and he rigs up a net to crash the Blockheads' crop dusting plane. Rather than press charges, the Blockheads agree to stop spraying, but then they start selling their worms as live fish bait. Gumby unites the worms of the world, and they devour the ground beneath the Blockheads' ugly, ugly house, destroying it. The worms of the world are free of their oppressors, thanks to Gumby.\n\nWild Girls:\n\nGumby is the world's biggest teen idol! Literally two trucks full of screaming girls chase after him and his band after the concert! After a brief interlude in Paris, where we learn how to order orange juice in French and Prickle's bread roll talks to him, Gumby and friends are chased by the girls back to their farm/studio! Gumby and friends are mobbed, and the girls carry off torn scraps of Gumby's clothes as souvenirs!","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-01-16","episode_number":3,"episode_type":"standard","id":616708,"name":"Lost Treasure / The Beetle and the Caterpillar / A Smashing Hit","overview":"Lost Treasure:\n\nThis harrowing tale of mystery and adventure begins in an antique shop, where Gumby and friends find a chest labeled \"200 year old pirate chest\". The shop owner claims that it's an ancient family heirloom that his great-great-grandfather passed down for generations, yet he's willing to give it up for $5.75. Rather than wonder how authentic a $5.75 treasure chest can be, Gumby and friends buy it, take it home, and crack her open. Inside are some jumping beans, which they have to waste some time waking up. They follow the beans to a tree, dig, and unearth a chest with more jumping beans.\n\nThe Beetle and the Caterpillar:\n\nThe Blockheads sell their forest land to developers who are itching to make a freeway, and it just puts Gumby in a bad mood, what with how the freeway will ruin his farm's ecology. Meanwhile, Pokey is eating a carrot, inspiring a local beetle to instantly grow to fifty times its normal size for five seconds. Disregarding the dangers involved with giant insects, Gumby decides to use the bug's strange properties to scare off the driver of the Caterpillar tractor that's clearing the forest. When another driver comes by, Gumby uses his own size-altering powers to scare him away, leaving us to wonder why he needed the stupid bug in the first place.\n\nA Smashing Hit:\n\nPrickle's only played the clarinet for one day, but that's no reason why he can't perform with the band at the cherry festival. By a stroke of luck, he happens upon the pitch that shatters every glass object in the city, and he, along with Gumby and other friends, run away before he can be prosecuted. They all duck into the book called \"The Glass Menagerie and Dr. Jekyll\". They find a glass museum, run by a mad scientist old movie Dracula, who lets them visit for free. Unfortunately, that's only because he plans on turning them into glass sculptures. He traps everyone under giant wine glasses, except Prickle, who finds his clarinet and shatters the glass again, freeing them. The moral: clarinets have as much potential for good as they do for evil, and must not fall into the wrong hands.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-01-23","episode_number":4,"episode_type":"standard","id":616713,"name":"Gumbot / Guitar Magic / Gumbitty Doo Dah","overview":"Gumbot:\n\nGumby has been horribly abducted! A red helicopter snatches Gumby up and takes him to an evil robotics company, where the Blockheads brainwash him by making him look at flashing lights. Along with the other three or four brainwashed clay figures, he's forced to work for the evil robotics company, as evidenced by the way he jabs a screwdriver at a circuit board. Fortunately, Pokey saw the helicopter take Gumby, and even more fortunately, the Blockheads leave it parked on top of the building where they're keeping Gumby. The Blockheads are vaguely defeated, and Goo undoes Gumby's brainwashing by crying all over him. I guess the other clay figures are still working for the evil robotics company.\n\nGuitar Magic:\n\nGumby's reckless skateboard stunts have finally paid off. After smashing up a guitar store a book about 17th century Spanish guitars, he's forced to accept a magical guitar that makes you fly around. It'll be a nice act for his next concert, once he's had it repaired. One of the Blockheads impersonates the repairman, and of course, Goo doesn't recognize him, what with how he's wearing a fake mustache and all, so she gives him the guitar. When she realizes she's been duped, Gumby and friends chase the Blockheads into a field, where they get caught in a hay thresher/baler. We end with Gumby's concert, where Gumby flies away with the guitar and is ultimately stuck on some sort of spinning blade thingy.\n\nGumbitty Doo Dah:\n\nThere's no real \"story\" in this one. It feels like a stream of consciousness; events happen with no real connection between them. One of the Blockheads molds himself into Gumby as part of a plot to steal Prickle's ball. Unfortunately, there's an alien in the ball, and it frightens the Blockheads away. Gumby's so happy about the turn of events that he rides on a toy top until it flings him off, into the clutches of a two-headed ogre. After frightening the ogre away, Gumby goes to play dress-up with Prickle. He dresses up as Eddie Murphy and a disturbing clown before going to spy on the Blockheads, who have a treasure map. The treasure chest they find contains Gumby, who gives them buttons to wear that have the peace sign printed on them. Gumby runs into Pokey and a paint set, and together they paint a large \"The End\" picture on the floor.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-01-30","episode_number":5,"episode_type":"standard","id":616709,"name":"A Miner Affair / All Cooped Up / Gumby's Circus","overview":"A Miner Affair:\n\nOn the way to a gig in Tombstone Gulch, Gumby and friends are stopped by an old silver miner, who forces them, with his sheer charisma and a long whip, to work in his silver mine. Goo causes a distraction, which must involve their band equipment for some reason, and Gumby and Pokey dump a load of silver ore on him. They escape easily, and make it to the gig. The silver miner has the intelligence to follow them into town, where he's recognized and arrested almost immediately.\n\nAll Cooped Up:\n\nWhile Gumby and friends are away, the Blockheads steal Chilly, the only chicken on Gumby's farm. They take her to the Eggspedition Building at Chickenco. What follows is a far too real description of corporate farming: chickens are kept in cramped cages for their entire lives, forced to lay eggs until they grow too old and then. . . . Well, it's still a children's show, so they don't go on to say. Chilly fakes an illness by not laying eggs, and when she's removed from her cage, she escapes the building, but gets stopped by the fence. We have to wrap it up quick, though, so Gumby and friends very conveniently come along and save her. Gumby shuts Chickenco down, and the world is safe once again.\n\nGumby's Circus:\n\nGumby decides to take advantage of the freaky qualities of his friends and family and puts on his own circus. My, but there's a lot to see. Denali shoots ice cubes into a bucket, Minga does a cartwheel, a walrus does a trapeze act, and there's a special request return performance by the growing and shrinking beetle from \"The Beetle and the Caterpillar\". The Blockheads try to sneak in to see the wonderful spectacle, but when they can't break in, they cut the ropes that hold Gumby's tent up. Nothing important happens, and the Blockheads are caged up, presumably to become part of Gumby's traveling show.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-02-06","episode_number":6,"episode_type":"standard","id":616710,"name":"The Elephant and the Dragon / Denali's House / Ostrich Feathers","overview":"The Elephant and the Dragon:\n\nPoor King Ott. His elephant and his dragon just don't get along. The elephant insists that the dragon doesn't exist largely despite the fact that he walks past him every flipping day, and the dragon tries to prove his existence by roasting the nearby town. Every day. Ott sends for Gumby, who has saved his sorry butt so many times in the past. Gumby threatens to take over the elephant's job if he can't get along with the dragon. That shuts him up. Goo does a live report on the labor dispute for the evening news.\n\nDenali's House:\n\nGumby realizes that he can't keep his wooly mammoth in the barn after he accidentally smashes holes in the floor. He hires speedy carpenters to build a house for Denali. The carpenters build a palatial residence for Denali. Unfortunately, Gumby had something simpler in mind.\n\nOstrich Feathers:\n\nThe Blockheads run Ostrich Ranch, a place where ostriches are raised for their feathers, much to the dismay of said ostriches. An ostrich with a horribly overdone Australian accent named Nifty manages to escape from the Blockheads' trademark lax security. Naturally, he finds refuge at Gumby's ranch. And we find out he was named Nifty because he's a nifty dancer. And he dances for us.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-02-13","episode_number":7,"episode_type":"standard","id":616712,"name":"Birthday Party in the Middle Ages / The Big City / Of Note","overview":"Birthday Party in the Middle Ages:\n\nGumby and his friends are invited to King Ott's birthday party in the middle ages book.The Big City:\n\nAfter Denali broke Gumby's guitar, Gumby must find a new one.Of Note:\n\nThe Blockheads sabotage Gumby's recording sample.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-02-20","episode_number":8,"episode_type":"standard","id":616714,"name":"Humbug / Fun Day / Denali Blues","overview":"Humbug:\n\nThe Blockheads join forces with Scrooge to ruin Christmas.Fun Day:\n\nGumby was given a day off from school to have fun.Denali Blues:\n\nDenali is feeling sad about being too big.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-02-27","episode_number":9,"episode_type":"standard","id":616706,"name":"The Fliver 500 / Minga Sitting / A Real Seal","overview":"The Fliver 500:\n\nGumby and Pokey enter a cross-country automobile race.Minga Sitting:\n\nGumby is babysitting his little sister Minga.A Real Seal:\n\nThe Blockheads trap Prickle in the farm book.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-03-05","episode_number":10,"episode_type":"standard","id":616705,"name":"Melon Felons / Merry-Go-Pumpkin / Time Kapp-Sule","overview":"Melon Felons:\n\nBefore Gumby leaves for his next gig, he tells Denali to squirt some super-growth formula on his watermelons. His chore done, Denali goes to sleep, giving the Blockheads free access to Gumby's melons. They make off with half of the crop before Gumby's livestock notices. The Blockheads sell the watermelons in town, but the formula makes them grow huge, have eyes, and run around smashing things. Denali redeems himself by popping the fruits like balloons with chunks of ice, ending their reign of terror. The newspaper tells the story of the melon thieves and the heroic mastodon, discretely forgetting to mention that it was Gumby's stupid fault that they got all mutated to begin with. I bet he greased a few palms.\n\nMerry-Go-Pumpkin:\n\nIt's little sister Minga's birthday, and that means a full day at Pumpkin Land Amusement Park, the pumpkinest place on Earth. There's a plethora of pumpkin-based foods, such as Pokey's much-desired Pumpkin Puff; pumpkin-themed rides like the Pumpkin Train and the Pumpkin Ferris Wheel; and, of course, attendants with evil Jack O'Lantern heads. Hooray! The action revolves around the Blockheads, who've jumped the fence and broken into the park. After a merry chase, the Blockheads are flattened by a giant pumpkin, and Pokey eats so many Pumpkin Puffs that he turns into a pumpkin himself.\n\nTime Kapp-Sule:\n\nProfessor Kapp has invented a really real time machine, and, together with Gumby, Pokey, and Denali, he goes for a merry trip to Egypt, 2001 B.C., where he and Gumby are instantly enslaved. They telephone Prickle, who's still in the present, and have him bring them back, but he has some sort of problem with figuring out a simple keypad, so he keeps sending them to the wrong year. The traveling clay figures visit roughly a half-dozen popular historical events, completely screwing up the time line, before Prickle figures it out and brings them back to 1988.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-03-12","episode_number":11,"episode_type":"standard","id":616704,"name":"The Search / Educational TV / Band Contest","overview":"The Search:\n\nGumby has to discover what the Golden Rule is for a school project. Following any random lead that comes along, he decides to begin his search by entering a book about the Golden Fleece.  Jason comes along, and Prickle helps him steal the Golden Fleece by distracting the dragon with some idle conversation. He does learn one interesting thing along the way: the location of an oracle that they can consult. After speaking with the oracle, Gumby comes away convinced that the Golden Rule has something to do with the Declaration of Independence. Mr. Teacher applauds Gumby's thorough researching skills, and Gumby turns pink for no reason.\n\nEducational TV:\n\nIt's the c sibling dispute. Gumby has his pals over and he wants to watch the World Series, but Minga's hogging the TV. When Mom breaks it up and gives Gumby the remote, Minga decides to jump into the TV and stand in the way of the picture. In a reversal of \"Minga Sitting\", Gumby decides to have his revenge by flipping channels, putting Minga on a pirate ship. Gumby and friends bask in sadistic glee as Minga is forced to scrub the deck and wash the dishes. Things quickly get out of hand when the pirate captain intends to sell Minga into slavery, which is obviously worse than being treated like a slave, like she is now. Gumby goes in and saves his little sister, and everyone swears never to watch baseball again.\n\nBand Contest:\n\nGumby and The Gumbys enter a band contest. You know what that means: extended musical sequences. Gumby's band goes up against the Blockheads' band, The Block Rockers. The Block Rockers sabotage The Gumbys' instruments and win the contest. Gumby later tells us that the Blockheads were disqualified for cheating and that the Gumbys won. Well, at least there wasn't a pointless chase sequence in this one.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-03-19","episode_number":12,"episode_type":"standard","id":616715,"name":"The Big Squirt / Little Lost Girl / Command Performance","overview":"The Big Squirt:\n\nProfessor Kapp wants Gumby to test yet another of his experiments. In this case, it's a fluid that makes plants come to life. Prickle takes it back to Gumby's ranch, but not before pretending he's Super Dude and squirting several toy monsters. Hilarity ensues as the monsters come to life and try to kill him, but he makes it to Gumby's book in one piece. Unfortunately, it gets mixed up with some cleaning fluid, and Goo and Pokey use it to wash the car and tractor. More hilarity ensues as they come to life and it turns out that the tractor doesn't like the car very much. Their rampage about the ranch isn't stopped until the fluid is washed off. And, uh, I guess the toy monsters go on to crush the lives of hundreds of innocents.\n\nLittle Lost Girl:\n\nOur story opens as Minga falls hundreds of feet into a deep, deep hole. (She's fine.) Meanwhile, mother begins to worry about her lost daughter and sends Gumby out to find her. Unfortunately, she didn't tell anyone where she was going. Gumby and Prickle jump to some very fortunate conclusions and go looking for her in a book about caverns. (Good thing she had a poster of a cavern in her room instead of one of her favorite band.) Absolutely nothing interesting happens as Gumby spends the last three minutes of the cartoon bringing Minga up out of the hole. Gumbo then decides that Gumby will work for the fire department, whether he likes it or not.\n\nCommand Performance:\n\nGumby and friends have been ordered to perform for King Ott on pain of death. Professor Kapp is also invited. On the way to Ott's castle, everyone is stopped by the Black Knight, who plans to hold them ransom, as knights in black armor tend to do. For some reason, he agrees to release them if Gumby can beat him in a duel, just like any thick-headed villain would if he had his enemies right where he wanted them. Fortunately, Professor Kapp remembered to bring the deus ex machina, his Shrink-A-Dink. They shrink the knight small enough so as to be defenseless and continue to Ott's castle. The knight is forced to swear fealty to Ott if he wants to unshrink him.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-03-26","episode_number":13,"episode_type":"standard","id":616716,"name":"Witch Way / Children for Sale / Sleepytime Robbers","overview":"Witch Way:\n\nThis adventure begins, like so many before it, with Minga going down a slide and vanishing into thin air. Prickle and Gumby decide to look for her in the sci-fi thriller Star Witch. After defeating hordes of ghouls and a pumpkin door with his simple fire extinguisher, Gumby makes his way to the auditorium where a generic witch is delighting hundreds of children with her silly shtick. It turns out that everything we know about witches is wrong and that they're merry jokesters, not evil brides of Satan.  Everyone has a good laugh at Gumby's expense, and Minga promises to tell Gumby before getting lost in another reality.\n\nChildren for Sale\n\nOne of the problems with reading a book about the Children's Crusade in Gumbyland is that some of the imprisoned children will inevitably escape from the book and ask you to save them from the slave dealers who tricked them into thinking they'd be taken to the Holy Land. Gumby finds himself in this situation and, being the guy he is, simply can't refuse. So, with a little help from a bolt cutter and his ice-spitting mammoth, he enters the book and drives off the ships' crew, who jump overboard at the first sign of danger. Next week: Gumby Vs. The Third Reich.\n\nSleepytime Robbers:\n\nFor the first time ever, the Blockheads have a brilliant plan! They've stolen some sleeping potion from King Ott's sorcerer and taken it to a sleepy old-West book. They use it to systematically neutralize the transportation system (since it consists mostly of horses), secure themselves a getaway train, and, once everything is in place, to put the local bankers to sleep and make off with the bags marked with the dollar signs.  Once they know what's going on, it takes all of five seconds for Goo to wrap herself around them and for Gumby to recover the loot.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-04-02","episode_number":14,"episode_type":"standard","id":616718,"name":"Strange Circus Animals / A Gumby Day / A Cottage for Granny","overview":"Strange Circus Animals:\n\nGumby really wants to put on a circus, so the minute he comes across a good excuse (it'll be a benefit to help locate missing children), he and his friends are off to various books to capture some circus animals. The action focuses on Gumby and Pokey, who find a little newly-orphaned mastodon named Denali. Reeling the poor distraught dope in with stories of joy and happiness at the circus, they have a brief encounter with a wolf before returning to the farm with him. Goo and Prickle have captured a small dinosaur and a walrus. Gumby laughs hysterically, and there's no circus. Maybe this sets the stage for Gumby's Circus.\n\nA Gumby Day:\n\nYes, it's a day in the life of Gumby. Gumby's day starts with some abuse from the most annoying cuckoo clock in the world. Next, it's a hot shower, followed by getting melted and flushed down the drain. Emerging from the kitchen sink, it's time for a hearty breakfast of oatmeal and carob drink. Yummy! Then, after fighting off the early morning traffic (literally; he's attacked by toy cars), it's off to the farm to train Denali for the circus and pick some vegetables for dinner. Laugh with him as Pokey holds up a bucket for Denali to spit ice cubes into and Denali repeatedly banks them off Pokey's face. Then, it's home for dinner with the family.\n\nA Cottage for Granny:\n\nGumby's grandmother stops by the farm to pick up Gumby, who's supposed to help her go house hunting. He's out, so she decides to go alone, largely despite the fact that her glasses got smashed during her visit and she can't see a thing. It's a perilous journey to her prospective new home, as her near-blindness puts her in several near-fatal situations, and it's really funny! She buys a new house from the Blockheads (just when are people going to learn not to deal with those two?), and Gumby arrives moments later to find out she bought a false front with a view to a landfill. They get Granny's money back from the Blockheads, and Granny promises to be a good little helpless senior citizen and never do anything by herself ever again.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-04-09","episode_number":15,"episode_type":"standard","id":616717,"name":"The Wind Bag / Lotta Hot Air / Wild Horse","overview":"The Wind Bag:\n\nThe miserly super villain Ebenezer Scrooge is back to wreak havoc on Gumbyland! He's stolen a magical bag of wind from King Ott's wizard, and he's using it to blow all the toys in Toyland away to another plane of existence, I guess. Then, he will rid the world of toys, and have his revenge.  Cad Waliter tells Gumby about the theft, and it's up to Gumby to stand around and wait for the wind to stop so he can apprehend the blithering old idiot. The cartoon ends with Scrooge playing with a train.\n\nLotta Hot Air:\n\nGumby got himself a hot air balloon! For the first three hours of the cartoon, Gumby laboriously unrolls it, fills it, checks everything, and then we're all ready to go! Gumby, Pokey, and Prickle go for a joy ride which quickly turns ugly when they run out of propane and land in the middle of nowhere. Before they have time to resort to cannibalism, a sasquatch runs at them, obviously with evil intentions. Prickle suddenly remembers that he's a dragon or a dinosaur or something or other and uses his fiery breath to warm up the balloon and carry them to safety.\n\nWild Horse:\n\nIt's a bedtime story for Minga! Once upon a time, Gumby and his family lived in Arizona, only Gumby's name was Tom and Minga's name was Sally and everything you ever knew or loved was no more. Everyone on the same page? Good. So, Tom's family made a living breeding and training quarter horses. One day, they \"found\" a wild quarter horse and Tom tried riding it without employing any particular taming methods. Everyone in the family is shocked that the wild horse isn't instantly comfortable carting people around and decide to throw him away. Of course, Sally knows far more than anyone else in her family about how to train horses, and one day she prompts the horse to talk to her and give her a ride.  It sprouts wings and flies her around.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-04-16","episode_number":16,"episode_type":"standard","id":616719,"name":"The Plant / Naughty Boy / Young Granny","overview":"The Plant:\n\nIt's Gumba's birthday! Gumby buys his mom a plant and swings by Professor Kapp's place to give it a ride in his centrifuge to make it grow better. He decides to ride too, just for fun. Unfortunately, the bumbling professor gives him 10 G's instead of 3, and he's horribly flattened. Gumby shrugs off the episode and gives the plant to his mother, who plants it in the front yard. The next day, foliage covers Gumby's entire house, trapping the family inside. Gumby's folks instantly assume it's their son's fault and force him and Professor Kapp to cut it all off.\n\nNaughty Boy:\n\nThomas Pitz, one of Gumby's classmates, has been truant for several days in a row. One day, the teacher is attacked by an Astrobot. Suddenly, it all makes sense; Thomas Pitz has taken over the Astrobot collective and he's using them to try and destroy school!  Gumby, Prickle, Goo, and Professor Kapp capture an Astrobot ship and use it to return to the Astrobot home planet. Gumby makes quick work of Tom's Astrobot guards with his fire extinguisher and drags the little Darth Vader wannabe back home without a shred of dignity to get a firm spanking for his rampant megalomaniacing.\n\nYoung Granny:\n\nGranny gets cheated out of yet another life savings by the dastardly Blockheads, who trick her into thinking they've made her younger by spray painting her hair and removing the lenses from her glasses so she can't see her wrinkles. There's some more \"hilarious\" blind Granny driving, and Granny visits her loving family, only to find out she's been cheated. However, she's in luck; it seems Professor Kapp has discovered the fountain of youth (or, more precisely, the flashing light thingy of youth) and he offers to make her 37 years old again. Minga, the meddling little girl that she is, reprograms the machine to make her 7 years old. Kapp refuses to notice the new computer display and next thing we know, Granny's a little girl. To complicate matters, the Blockheads steal the machine so they can use it at their youthful boutique. Gumby realizes something is amiss when people walk into the boutique and come out 7 years old (seems they didn't know how to reprogram it), and a stop is put to them. Granny decides that being old and withered and frail is the life for her and returns to her normal age.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-04-23","episode_number":17,"episode_type":"standard","id":616720,"name":"Balloonacy / Picnic / Gumbastic","overview":"Balloonacy:\n\nIt's Denali's birthday, and Gumby and Pokey get some balloons for the party. Besides your standard helium balloons, they decide to pick up some magic, self-inflating animal balloons. When Denali sees the amazing balloons, he yawns and falls over. Oh, then the Blockheads show up and start popping balloons, prompting Prickle to declare that it's up to them to put a stop to those hooligans. Alas, there isn't enough time to show their capture, so we cut immediately to the Blockheads, who have been bundled together in a net tied to a giant helium balloon, and Gumby and friends let them drift away into the sky to their inevitable death.\n\nPicnic:\n\nGumby, friends, and family all go on a picnic one lovely day. When ants start crawling all over the chocolate cake, Gumby decides to shrink himself down and reason with them. Unfortunately, the queen doesn't like green, and refuses to talk to him. Luckily for Gumby, the anthill is attacked at that moment by the Block-ants. Gumby horribly crushes the invaders and threatens further violence toward them if they don't leave the non-block ants alone. The queen decides that she likes green after all, and Gumby gives her a piece of cake.\n\nGumbastic:\n\nHope you're hungry, 'cause I got a big plate of stream of consciousness for you. We begin with Gumby's battle with a vending machine that won't give him his soda. After it sprouts a face and spits soda on him, Gumby sticks his hand up the slot where the sodas come out, only to get sucked in. Fortunately, Minga comes along to let him out. Gumby walks down the block to the local old west town to rip off a high noon gunfight scene from some popular western movie. Three hours later, Gumby gets a hankering for some ice cream, so he tosses a nickel into a wishing well. He's rewarded with a microscope. Looking in, he sees some microbes visiting an ice cream stand. When one of the microbes appears next to him (as tall as he is) and offers him an ice cream cone, he drops another nickel in the well, this time producing a pad of paper, a pencil, and an eraser. He draws the microbe and erases it, causing the microbe to be annihilated in real life. Then he draws himself some ice cream. Then, Gumby finds a nice quiet spot to sit and read his dictionary, when suddenly, a red dot comes along and zips around by him. He accidentally smashes it into tiny multi-colored dots, then mashes them together into a green dot. The dot turns into another Gumby with red eyes, which turns out to be the Blockheads (with cylindrical heads instead of cubes), who laugh at Gumby a bit, turn themselves into red dots, and zip away. Gumby turns himself into a green dot and follows.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-04-30","episode_number":18,"episode_type":"standard","id":616722,"name":"Funtasia / Rip Van Prickle / Great Mastadon Robbery","overview":"Funtasia:\n\nIt's too soon for another one of these. Okay, so Pokey and Prickle are playing catch with a wooden block, which suddenly turns into a guy with a camera, who takes their picture, eats his camera, and turns into a variety of monsters. Ooo! Suddenly, Gumby drinks a milkshake, turns blue, and starts rolling around on a bridge in a different scene, occasionally jumping into the water. This wasn't what he'd bargained for when he decided to drink his milkshake, so this time he opens his head and pours it in. He's quite happy with this until a thirsty animator opens his head, sticks in a straw, and sucks out the shake. Finally, Gumby and Prickle arrive at an outdoor restaurant where they're waited on by a Blockhead, who does something terrible to Prickle's face every time he passes by. Unfortunately, when he sprays Prickle with water, Prickle becomes huge and crushes the Blockhead, eats a nearby cake, and carries Gumby away. Gumby reads a book about Origami and promptly folds together a thing, which flies away. Unhappy with his work, he takes a new sheet of paper and folds it into a horrible mechanical monster, which terrorizes him and Pokey until the Groobee arrives to capture it. So Gumby decides to ride his skateboard around, at least until the Blockheads smash him flat and steal his board. But Gumby has his revenge, molding himself into a giant boulder and chasing them around. With the Blockheads locked away in a Lego jail, Gumby rides happily away. Surprisingly, the cartoon still isn't over. Gumby and Prickle take a moment to color in a beach scene in a coloring book. Then they enter, presumably to take a nice, peaceful vacation after this strange head trip.\n\nRip Van Prickle:\n\nPrickle sleeps for many, many years, as evidenced by the long hair and beard he wakes up with. Gumby's farm and studio have fallen into disrepair. On his way to reunite himself with his lost friends, Prickle makes many startling discoveries: \n\nPokey is president of a delivery company, \"Pokey Express\" \n\nGranny is his secretary \n\nGoo is Secretary of State, and she's negotiated lasting peace in the Middle East \n\nProfessor Kapp, as head of NASA, has created a new space craft and a miracle fuel source \n\nAnd Gumby is, of course, president of the USA. One of his accomplishments, as revealed in a terribly exposition-oriented press conference, was to create some vague equal rights bill. \n\nAnd yet, like in an episode of The Twilight Zone, none of his friends recognize him, and he's hauled off, thought to be a nut case. Fortunately, it was all a dream, but his friends torment him a bit by pretending not to know him. \n\nGreat Mastadon Robbery:\n\nThe Blockheads lure Denali out of his home with a trail of peanuts, take him to the zoo, and sell him for a giant wad of money! Money! The plan goes off without a hitch. Well, except for the fact that the zoo has no way to safely contain elephants, seeing as how Denali easily busts his door open and escapes. He finds a phone and calls Gumby, who picks Denali up and still finds time to make sure that the Blockheads and their peanut truck get stuck in a lake. The money floats away and a lucky fisherman goes home with a giant wad of money! Gumby and friends sing a bar of \"Merrily We Roll Along\", since the cartoon wouldn't be complete without that finishing touch.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-05-07","episode_number":19,"episode_type":"standard","id":616721,"name":"Wild Train Ride / Arctic Antics / Runaway Camel","overview":"Wild Train Ride:\n\nMinga, Prickle, and Granny are going on a train ride today.  Unfortunately, the Blockheads think it'd be fun to lock the engineers in the men's room and send the train on a wild joy ride.  Since the trains in Gumbyland bring their tracks with them wherever they go, the train can go crashing through houses and down streets, bringing chaos and destruction everywhere it goes.  Naturally, Granny loves it.   Things take an ugly turn when the train enters a book about the Rocky Mountains and gets on a track leading straight to a giant fall, but fortunately, Gumby has learned of the runaway train and he helicopters the engineers into the train to stop it.\n\nArctic Antics:\n\nGoo and her news crew (Gumby, Pokey, and Prickle) take a helicopter ride to Alaska to do a ground-breaking story which will prove once and for all that Alaska exists.   Unfortunately, Prickle didn't bring any gas, and they crash land on an igloo, much to the dissatisfaction of the walrus and the puffin that lived in it.   Gumby and friends are forced to rebuild the igloo.  Fortunately, they're shown fixing the igloo live on the news.  Gumbo and Kapp see what's happening and decide to drive to Alaska to give them a hand.  They tell Gumby and friends that walruses and puffins don't even live in igloos.  The arctic animals admit that it was an abandoned igloo that they'd stolen and that they had no right to boss their guests around, and they all settle their differences over a huge bowl of Chocolate Clam-Dandy until a polar bear comes along to chase them away.\n\nRunaway Camel:\n\nA lost camel-rider named Muhammad wanders into Gumby's farm one day.  Camel and rider alike get a big helping of Gumby hospitality, and in return, Gumby gets a magic carpet and Minga gets a ride on the camel.  Unfortunately, the camel is spooked when Denali shows up, and it runs away with Minga.  Gumby, friends, and Muhammad pursue them on the magic carpet.  They all meet up at a desert oasis.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-05-14","episode_number":20,"episode_type":"standard","id":616723,"name":"The Abominable Doughman / The Astrobots / Blocks in the Head","overview":"The Abominable Doughman:\n\nMinga's making bread.  She leaves the dough in the oven to rise a bit and falls asleep watching a show about the abominable snowman. This leads, inevitably, to a horrible nightmare that the dough rose out of control and turned into a giant human-like monster.  It proceeds to grab her and run amok in the city.  Gumbo tries to rescue her by blasting the monster with the monitor on his fire truck, but runs out of water.  Then Denali shoots it with ice, causing it to melt into a puddle.  Minga wakes up and swears never to make bread ever again, unless Denali's around.\n\nThe Astrobots:\n\nThe USA's national heroes are disappearing from their books.  Sounds like a case for the Gumby detective agency!  During a stake out in Toyland, they spot the Blockheads capturing George Washington and selling him to the Astrobots, who seem to have taken up president-collecting.  The Blockheads are let off surprisingly easily, making a slick getaway while Gumby and friends focus on investigating the Astrobots' ship and rescuing their captives with their mighty fire extinguishers.\n\nBlocks in the Head:\n\nGumby stays up all night studying cubism, leading to a nightmare that everyone in his class has cubic heads and that cubic heads rise out of the checkerboard and that his friends on the farm have cubic heads.  The funny thing is, they really don't have cubic heads in Gumby's dream, but he thinks they do.  Confused yet?  So Gumby goes to see a shrink, who prescribes some medication.  It doesn't help.  Gumby wakes up and discovers that everything is still right with the world.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-05-21","episode_number":21,"episode_type":"standard","id":616725,"name":"Geese Grief / Fox Hunt / Goo's Pies","overview":"Geese Grief:\n\nGumbo tells Prickle that Minga is forbidden to go into the \"Sorcerer's Apprentice\" book.  Minga go on the slide and accidentally slid into the book.  Prickle went inside to get Minga, but the sorcerer turned them into geese.  They flew away.  Gumba thought Prickle and Minga are geese, but she quickly recognizes her daughter's voice.  Gumby comes outside to see the geese, and Prickle explained the whole situation.  Gumb took them to see the wizard to reverse the spell.  The wizard accidentally dropped his bottle of wind.  His room becomes a real mess.  Prickle and Minga become depressed, until Gumby found the antidote.  They turn back to normal once again. \n\nFox Hunt:\n\nThe fox comes to the farm to find the chicken to eat.  While Gumby and his friends were practicing their music, Chilly is being attacked by the fox.  Gumby devises a plan to hunt it down, and teach him a lesson.  After the capture, he and his friends pretend to try and roast the fox.  Chilly comes in a tells Gumby don't roast the fox.  The fox becomes friends with Gumby and enjoyed lunch together.\n\nGoo's Pies:\n\nPokey and Prickle are giving out ads to the people in different books.  Goo ordered robots to work on baking pies.  On their lunch break, the Bockheads mess with the controls and cause chaos in the kitchen.  Gumby checked on the pies.  Pokey, Prickle, and Goo get trapped in giant pies.  The robots start throwing pies at the customers.  The Blockheads were laughing at Gumby and his friends, until Chilly found out with they're up to.  Gumby and his friends punish the Blockheads by throwing pies in his faces.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-05-28","episode_number":22,"episode_type":"standard","id":616724,"name":"Moving Experience / Gumby's Close Encounters / Flying Carpet","overview":"Moving Experience:\n\nGumby's family is moving to a new house, seeing as how they have an afternoon and nothing better to do.  Unfortunately, they hire the Blockheads as their furniture movers and, as one would expect, G and J spend the entire cartoon destroying everything Gumby's family holds dear as the furniture makes its way into their van, even going so far as to crash their van into the front of the new house and dump everything out on the front lawn.  Art Clokey can't write his way out of this mess, so it turns out that it was just Gumby's mom's nightmare.\n\nGumby's Close Encounters:\n\nOne day, while driving through the country with his friends, Gumby finds himself to be the victim of a horrible abduction by aliens, who need his strong genes to rebuild their race.  Unfortunately, Gumby isn't in a very charitable mood, and demands that the aliens give him the ultimate fuel source in exchange for his tissue sample.   Since he's in no position to be making demands, the aliens agree and arrange to drop off an ultimate fuel source kit at Kapp's lab.  Gumby and friends drive to the rendezvous point, stopping to tell two gas station attendants (the Blockheads) about how they're going to have the ultimate fuel source and that gas will soon be obsolete.   So it's really their own fault that the Blockheads follow them to the lab and try to swipe the device when Kapp is distracted.  Fortunately, the aliens have the technology to avoid pointless chase scenes by mentally taking the device out of their arms and flying it back to the lab.  Kapp hooks it up to Granny's car and steals it.\n\nFlying Carpet:\n\nThe Blockheads, via an evil Cyclopic robot car salesman, convince Granny to spend yet another life savings on a car which lives up to its 10 mile warranty.   Gumby and friends return with her to the salesman and demand her money back.   The robot assures them that a refund is on its way, and in the meantime, invites them to test-drive a flying carpet in hopes that a ride on the defective carpet will kill them, eliminating the need for a refund.  Unfortunately, only Gumby and Prickle fall for the scheme, and they manage to survive by landing in a swimming pool, so the Blockheads decide to strip and make a break for it.  They try to fly off on one of their own defective carpets, and what do you know, they're captured and Granny gets her live savings back again.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-06-04","episode_number":23,"episode_type":"standard","id":616726,"name":"Minga's Folly / High as a Kite / Proxy Gumby","overview":"Minga's Folly:\n\nPrickle stops over to take Minga shopping for a pet bird to make up for the fact that she can't have a pet horse.  She falls instantly in love with the most annoying parrot to ever be animated, which is, fortunately enough, $2000 out of their budget.   Luckily for her, ostriches are much cheaper than parrots, so Minga gets to go home with a bird she can ride.  Unfortunately, it gets spooked and runs off with her.  Gumby to the rescue!  They run a merry chase through beautiful Ohio before Gumby realizes that it would be a lot quicker and more effective to just let Goo fly over and spit clay at the ostrich and blind it.  They end up, miraculously, at Gumby's house and scare Gumba.\n\nHigh as a Kite:\n\nGumby and Prickle enter a kite stunt contest in hopes of winning a free trip to Omaha, Nebraska.  Their stunt: launching a hen (Chilly) from their kite.  Of course, the Blockheads have entered the contest too and, of course, their rocket stunt doesn't work and, of course, they try to sabotage Gumby's kite with a boomerang.  As Gumby's kite goes flying out of control, Goo zips up and flies it herself.  Gumby gets first prize and gives it to Goo so she can fulfill her lifelong dream of visiting Omaha, Nebraska.\n\nProxy Gumby:\n\nThis cautionary tale begins when Gumby's new computer arrives, equipped with the latest in electronic cloning.  Gumby makes a clone of himself to perform his menial daily routine so that he can sit at home eating donuts and watching game shows all day.   Unfortunately, his clone comes equipped with self-preservation routines that make it smash the Blockheads into jelly and destroy his farm.  Gumby's friends realize that something's wrong with \"Gumby\" and follow him home.  Without the restrictions of responsibility and polite society, Gumby has become a fat slob who shuts himself out from all human contact and spends all his time with his computer.  (I wonder who that reminds me of.)  Luckily, it's all a bad dream, and Gumby wakes up to find that his new computer really has arrived.  Learning nothing from his dream, he leaps happily out of bed, presumably to fulfill his horrible nightmare.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-06-11","episode_number":24,"episode_type":"standard","id":616727,"name":"Goo and the Queen (Part One) / Prickle's Baby Brudder / Goo and the Queen (Part Two)","overview":"Goo and the Queen (Part One):\n\nOn her way to the children's hospital one day, Goo is stopped by a creepy pterodactyl who claims that she's the only one who can save his queen.  So, she follows along, refusing to get suspicious when they enter a book entitled \"Queen Witch\" or when Queen Xena is oddly insistent that she drink a glass of grape juice before hearing what is ailing the queen.  Everyone pretends that it's a big surprise that Goo falls asleep and that the queen turns out to be a witch who steals Goo's magical flying powers to supplement her torched, worthless broom.  Goo is locked in the tower and learns the hard way that you should never try to help anyone ever.\n\nPrickle's Baby Brudder:\n\nPrickle's little brother comes over to visit, but the amusing thing is that he's the size of the barn.  Ha ha!  Anyway, it seems that he's been accused of burning down a small village and Saint George is after his head.  Gumby and Prickle decide that the best thing to do is to take him back to see Saint George, who immediately starts waving his little pointy thing around.  Rather than eat him in one bite, Prickle's brother decides to flee.  Unfortunately, Saint George manages to keep up, but just as he's about to strike a fatal blow, he's horribly struck by lightning.   Gumby quickly blames the burning village on the lightning.  And so, Saint George's armor is turned into a lightning rod, Prickle's brother becomes chief of the new fire department, and Saint George takes up fishing.\n\nGoo and the Queen (Part Two):\n\nLuckily, Goo has a radio hidden in her hair, which she uses to contact Gumby.   Gumby and friends come flying to her rescue.  With all the resistance of a potted fern from the guards, Gumby steals back Goo's flying powers while Prickle and Pokey break her out of the tower.  Absolutely nothing goes right for the witch, and our heroes go home.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-06-18","episode_number":25,"episode_type":"standard","id":616728,"name":"Little Denali Lost / Clay Play / Gone Clayzy","overview":"Little Denali Lost:\n\nIt's The Denali Blues meets High as a Kite when Denali gets himself shrunk and goes on a binge of carnival rides, train rides, and other things us tiny people take for granted.  His final wish: to ride Gumby's kite.  Unfortunately, Prickle loses control of the kite, and Denali flies off through the city, freaking out the chairman of some company and nearly falling prey to the tigers in the zoo.  We're out of time, so now we cut quickly to Denali getting bigger again.\n\nClay Play:\n\nGumby steps into a modern dance book and joins Prickle in some modern dance, which involves Gumby turning into a ball and Prickle turning into a weird robot and spraying Gumby with water.  They return to normal and leave the book (Prickle turns back into a robot briefly) and go about their business.  Gumby puts on some music and rocks out for a while until Prickle comes along and changes the station.   They fight over the radio for a bit, which ends with Gumby getting flung into the desert, where he melts and seeps into the ground, only to reform in an underground cave.  He meets a giant, scary monster and, just as he's about to meet his certain doom, the scene freezes.  The camera pulls back a bit to show that the Blockheads were animating the cartoon.  As they argue about just how gruesome Gumby's end should be, Gumby himself arrives and chases them off.  Then he pulls out some models of the Blockheads and, with a sinister look, turns back to continue the cartoon.\n\nGone Clayzy:\n\nGumby climbs to the top of a huge tower of toys, much to Prickle's amazement.   Unfortunately, he immediately falls off and lands on his head, flattening his head bump.  A little grunting and it pops back up, only to detach itself from Gumby and become a sentient being.  As Gumby passes out, Prickle attempts to recapture it.  Unfortunately, it has retained Gumby's morphing ability and chases Prickle around, turning into various implements of destruction.  Prickle leads it to the top of the tower and trick it into jumping off, back onto Gumby's head.   Everything is right again.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-06-25","episode_number":26,"episode_type":"standard","id":616731,"name":"The Knight Mare / Lost in Chinatown / Joker's Wild","overview":"The Knight Mare:\n\nWe begin the story with Don Quixote's infamous battle with the windmill, which has the unfortunate result of sending the Don out of his book and into Toyland where (surprise surprise) he decides that all of the toys are evil monsters which must be destroyed.  (And he's not even a religious zealot.)  The Blockheads notice the erratic knight and decide to send him to Gumby's farm, hoping he'll cause some delightful havoc.  He mistakes Denali's house for a castle and Denali for a horrible monster.  Fortunately, the man of La Mancha is easily overwhelmed by ice cubes, and Denali deposits him before Gumby to do with him what he will.  Gumby tells the insane man that his wizard (Professor Kapp) will give him magical powers to fight evil (use some sort of device to end his insanity).  And so, another classic story completely ruined by Gumby's well-meaningfulness.\n\nLost in Chinatown:\n\nMinga and Granny are shopping in Chinatown.  While Granny is occupied, Minga decides to don a replica of a royal robe and do a little time traveling through a tapestry.  She's instantly recognized as the Emperor's daughter and treated to food, baths, and slaves who stand on their head.  Meanwhile, Granny finally realizes that she's lost Minga and phones Gumby and Prickle to her rescue.  They decide to check the tapestry for Minga, and are instantly captured by the guards and thrown in a cage.  Minga starts thinking about going home when she hears that her brother and his friend are going to lose their heads, but she waits until the Emperor's real daughter returns before she makes any decisive action.  The three of them return to present day, and Granny decides not to buy the $1000 robe for Minga.\n\nJoker's Wild:\n\nOne day, the Joker found out that he couldn't make the King and Queen of Diamonds laugh anymore, now that they've heard all of his jokes.  (Did I mention this is in a deck of cards?)  So, he tries to make the King and Queen of Clubs laugh, but they've heard all of his jokes too, so he's banished from the deck.  He ends up at Gumby's place, where he tells his tale of woe.  To help the unhappy card, Gumby takes him to a Vaudeville show and teaches him the universal language of slapstick.  The Joker performs a lame lasso bit for King Ott, who laughs a whole lot!  This piques the King of Clubs' interest, so he wanders out of the deck to see the Joker hit himself in the face with a pie.  And the King of Clubs laughs a lot!  And King Ott and Cadwaliter laugh a lot! And Gumby and friends laugh a lot!  And the Joker looks really spooky with the pie cream on his face, and he laughs a lot, but in a horribly creepy way!  Five hours later, the cartoon ends.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-07-02","episode_number":27,"episode_type":"standard","id":616730,"name":"My-O-Maya / Gumball Gumby / Pokey  la Mode","overview":"My-O-Maya:\n\nGumby receives a call from a chatty aunt.  He doesn't want to talk to her, so he puts a fast-talking toy box in front of the phone and runs away.\n\nGumball Gumby:\n\nGumby finds a gumball machine.  However, he doesn't have any money, so he decides to just reach in and steal one.  Unfortunately, the vengeful machine sucks him in and traps him with the gum.  So, he turns himself into many little gumballs and waits to escape.  Pokey comes along, deposits a penny, and gets a green gumball, which he immediately eats.  It's followed by a dozen more green balls, which merge themselves into Gumby, only without the head bump.  Pokey spits his gumball out onto Gumby's head, and Gumby pulls out some gumballs he stole.\n\nPokey  la Mode:\n\nPokey is sleeping next to some baking cookies, prompting a dream that he visits a cookie factory.  After eating the chocolate chips off the door, he goes inside and rides a conveyor belt that promises to go to the \"tasting room\".   Unfortunately, the tasting room is home to a giant mouth, which nearly devours him.  Not learning from experience, he takes another conveyor to the ice cream room, where he's buried in strawberry ice cream.  He wakes up and eats some cookies and ice cream.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-07-09","episode_number":28,"episode_type":"standard","id":616729,"name":"The Forbidden Mine (Part One) / Robot Farm / The Forbidden Mine (Part Two)","overview":"The Forbidden Mine (Part One):\n\nGumby has a surprise for Minga, Prickle, Goo, and Pokey: a picnic at the very edge of the Grand Canyon.  Afterward, they decide to explore an old mine.  The mine's caretaker isn't pleased with the idea, but for no reason at all he warms up to them and lets them in.  They go 2000 feet down to take the grand tour of the hole in the ground.  Unfortunately, there's an earthquake and subsequent cave-in, trapping Minga behind feet of solid rock!\n\nRobot Farm:\n\nGumby and friends are sick of being a farm and band and decide to get some robots to take over the farm so they can concentrate more on the band.  While they're away, Tillie admires herself in Gumby's computer monitor, walking all over his keyboard in the process.  The robots, naturally, go haywire.  Fortunately, Denali calls Gumbo to come over and take care of them while Gumby and friends make their way back from a concert.\n\nThe Forbidden Mine (Part Two):\n\nGumby and Prickle move the rocks out of the way, only to find that the mine is flooding and the elevator doesn't work!  It's up to Goo to fly to the surface and get some help.  She finds Gumbo, who gets Denali and two thousand feet of rope, and hauls everyone safely to the surface.  Minga brings back a giant, solid-gold nugget as a souvenir.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-07-16","episode_number":29,"episode_type":"standard","id":616732,"name":"Space Oddity (Part One) / To Bee or Not to Bee / Space Oddity (Part Two)","overview":"Space Oddity (Part One):\n\nThe Blockheads are having some harmless fun with their giant crossbow one day when they notice Gumby, Pokey, and Minga walking into a planetarium on the page of some book.  Being the thoughtful lads they are, they decide to enhance the experience by cutting out the page, tying it to an arrow, and shooting it into an outer space book.   When Prickle and Goo show up to pick them up, they find the page missing and begin to investigate.  After interrogating a parrot puppet and a doll, they piece the whole story together and decide to get Professor Kapp's help.  Meanwhile, the star show at the planetarium is over, which it is very important that we know before the cartoon ends.\n\nTo Bee or Not to Bee:\n\nThe Groobee's cousins, the honey bees, need desperate help!  Gumby shrinks himself and follows them to the hive to find that all of the bees are getting sick.  They go investigate the orchard where the bees have been collecting pollen (and certainly not nectar, as one would readily assume), and wouldn't you know it, it's the Blockheads' orchard, and they've been spraying it with illegal pesticides.  The Groobee tries to box them in, but their mighty tractor is more than a match for his weak, weak wood.   So, they go visit Groobee's brother, Ironbee, who produces metal boxes to imprison the Blockheads.\n\nSpace Oddity (Part Two):\n\nXena the queen witch comes across the rogue page while flying through space (don't ask) and decides to bring it aboard.  Gumby, Pokey, and Minga escape from the page, only to be imprisoned by the witch.  Meanwhile, Prickle, Goo, and Professor Kapp seek help from the Witty Witch (from Witch Way), who spends a minute rubbing the limitations of science into everyone's faces before finding Xena.  They invade Xena's ship, turn her and her henchman into pumpkins, and rescue the lost clay figures.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-07-23","episode_number":30,"episode_type":"standard","id":616733,"name":"Skateboard Ralley / Goo's Music Video / Best in the Block","overview":"Skateboard Ralley:\n\nGumby and band are performing a concert at a skateboard rally, but first, Gumby needs to pick up his new skateboard and stop for a protein shake.  Because this cartoon is in desperate, desperate need of a conflict, the Blockheads run up and steal the board from his car.  There's a predictable chase which doesn't involve Gumby getting smashed by a book about George Washington but does involve the Blockheads going over a waterfall, followed by Gumby breaking the world's record for skating through some Hot Wheels track course, they play some music, and six minutes of my life is wasted.\n\nGoo's Music Video:\n\nGoo's having problems writing the script for the band's new music video, until she's inspired by a dream involving geysers and bears and caves.  Cut ahead to them watching their video.  It starts with everyone tuning their instruments, then playing for a bit before turning into slabs of clay and forming a rainbow that creates four geysers which spew tiny Gumbys, Pokeys, Prickles, and Goo's into the sky.  Several of the tiny characters turn themselves into a giant multi-colored monster head, which chases the real figures into a weird sort of hallucinatory world, which eventually becomes a cave.  Goo flies them away from danger, only to be pursued by a giant bat.  She spits clay at it, making it crash into a checkerboard and morph itself into Gumby's farm, where the cartoon ends.\n\nBest in the Block:\n\nGumby's aunt, Gumbetta, along with her husband and children, are visiting Gumby.   It seems that Gumby's uncle got a new job nearby, and they're house-hunting in Gumby's neighborhood.  Unfortunately, the Blockheads have a real estate monopoly, and they won't sell a house for less that half a million.  Gumby decides to get out his Groobee and start cranking out houses for cheap, much to the Blockheads' dismay.  To retaliate, they spray the sawdust that the Groobee feeds on with pesticide (illegal ones, no doubt) that make the Groobee drunk, evidenced by the strange buildings he makes.   Of course, they're caught, and the sawdust is replaced, and Gumby makes a killing selling houses for as much as $9000 with practically no initial investment.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-07-30","episode_number":31,"episode_type":"standard","id":616735,"name":"The Birthday Present / Just Train Crazy / Wickiups and Bulrushes","overview":"The Birthday Present:\n\nIt's Gumby's birthday, and he's getting a beautiful grand piano.  Prickle and Pokey tow it home on the trailer.  While they stop to pick out a matching candelabrum, the Blockheads detach the trailer.  Prickle and Pokey don't notice until they get back to the barn, and, of course, by the time they get back, the Blockheads have hidden the piano somewhere.  As J runs out as a decoy, G starts building a wall of blocks to hide it.  Prickle and Pokey find a freshly-painted sign reading \"This Way to Piano\", but they choose to follow the trail of paint instead, which leads to the piano, but no Blockheads.  When Gumby receives the piano and tries playing it, it sounds a little funny.  The Blockheads were hiding inside.\n\nJust Train Crazy:\n\nWhile Gumby's out for his dental appointment, Denali accidentally smashes his prized model train.  In true wacky sitcom tradition, Prickle and Pokey have to replace it before he gets back.  While perusing the trains in Toyland, they're given a hard sell by a sentient engine who offers them a free ride.  They shrink themselves down and hop in, rather pleased to find that the train can take them instantly to wherever they want to go.  However, the train never stops, so they have to pass it up.   Fortunately enough, a train just like the one they're looking for shows up when they get back to Toyland, so the cartoon can end now.\n\nWickiups and Bulrushes:\n\nIn honor of Native American Week, Gumby's band is putting on concerts for a different tribe every day, starting with the Chippewas.  When Goo and Denali show up at the reservation to hammer out all the details, Goo meets a little girl who wants to ride on Denali, but first she needs to gather some bulrushes, so Goo helps.  While they're out, they notice a distinctly unnamed rival tribe preparing to attack.  Goo flies them back to the village, where they prepare to repel their attackers.  Thanks largely to Goo and Denali, the anonymous evil tribe is beaten back, and the day is saved.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-08-06","episode_number":32,"episode_type":"standard","id":616734,"name":"Kangaroo Express / Kid Brother Kids / For the Graduate","overview":"Kangaroo Express:\n\nGumby and friends are off to a concert in Australia.  They travel light, thanks to Gumby's portable shrink-a-dink, which lets them carry all their equipment in their pockets.  Goo flies them into the globe, and they arrive in the middle of the desert with no way to get to Melbourne.  Fortunately, they find the Kangaroo Express, a kangaroo-based parcel delivery company.  They shrink themselves to fit in the pouch of a kangaroo named Matilda (eliciting a lame reference to \"Waltzing Matilda\" from Prickle) and they're soon on their way.  However, Australia has Blockheads too, which capture Matilda.  Gumby confuses and disorients them by shrinking their van, providing the distraction they need to get away.\n\nKid Brother Kids:\n\nGumby and the Gumbys are performing a concert in an old west ice cream parlor.   Unfortunately, things go horribly wrong when the Kid Brother Kids show up.   Supposedly, they're Billy the Kid's kid brothers, but they're really just Blockheads.  (Not *the* Blockheads; these two are 1 and 2 instead of J and G).   Well, the Kids get in everyone's faces and bother them enormously, setting a huge ice cream fight into motion.  Denali sucks up some ice cream and  spits it out at the Kids, which vaguely leads to their arrest.  Gumby gives another concert the next day.\n\nFor the Graduate:\n\nYes, Gumby is finally graduating from high school, and Minga and Prickle are off to select a graduation present.  Prickle looks at some watches, but Minga has something else in mind -- a WWII flying fortress.  She decides to take it for a test drive, which makes it spin around and around.  Prickle sees what's happening and grabs the end of the plane for some reason, only to get flung off into a cabin of Lincoln Logs.  As he whines about his injury, Minga investigates a steam roller, which she unwittingly uses to flatten the Blockheads for no reason, knock a tower of Better Blocks onto Prickle and, of course, to grind Prickle into the ground.  Prickle ends up in a body cast, and Gumby gets a watch and a steamroller for his graduation presents.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-08-13","episode_number":33,"episode_type":"standard","id":616736,"name":"Clayfully Yours / Gumby Music Video / Time Out","overview":"Clayfully Yours:\n\nThe story opens on a river, where Prickle and his sweetheart are picnicking and those surly Blockheads are baiting the crocodiles.  The Blockheads annoy the amorous dinosaurs for a bit until a croc pops up and kicks them around a little.  Prickle defeats the crocodile, much to the delight of his lady love.  Meanwhile, in another reality, Gumby is babysitting for two twin babies, one in each arm.  And they won't stop crying.  So, what does our hero do?  He juggles them one-handed. As he juggles the babies, he pulls various things out of his pocket with his free hand, including a hot dog, a bottle of pop, and a tiny Blockhead.  When his hard day of babysitting is over, he decides to watch some TV, but changes his mind when he sees what's on.  Unfortunately, TV will not tolerate being turned off, and he engages in a remote control duel with his set, turning each other into ever more bizarre things.   Finally, Gumbo comes in, extends his neck into outer space, and inspires a truce between the combatants.\n\nGumby Music Video:\n\nYes, it's a Gumby music video.  It starts innocently enough.  The band's playing, Minga's dancing, but all too soon, we're riding around in pumpkins and on trains, and Gumby's molding himself around and tap-dancing and impersonating Michael Jackson, and everyone's in Tom Servo's head.  There's a bit of barnstorming, Gumby parachutes into a rabbit hole and turns into a rabbit, then everyone becomes chess pieces, and there's some weird spirally effects, and the ride's over.\n\nTime Out:\n\nAn unbelievably creepy jester pops out of Father Time's cuckoo clock and engages us with a silly poem while he strikes the hour in order to bring us up to speed.   Basically, Father Time ate too much last night, so now he's having nightmares, and we all have to pay for it, since his tormented mind is making time go ker-flooey.   You've got cars turning into dinosaurs, babies becoming old men, human sacrifice, cats living with dogs, mass hysteria!  Worst of all, Gumby's alarm clock won't stop ringing.  After it tells him that it can't stop and he tries smothering it with a pillow, he decides to visit Professor Kapp.  Fortunately, Kapp has a giant grandfather clock that serves as a portal to Father Time's castle, so soon, they're making their way to Time's bedroom.  His nightmares have become more violent, and he's spewing glitter that turns Gumby old as he crosses the room.  Fortunately, the alarm clock wakes Time up, and everything goes back to normal, until Time sneezes, hurtling us all back about a thousand years.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-08-20","episode_number":34,"episode_type":"standard","id":616738,"name":"Dolly for Minga / Lost Arrow / Clay Trix","overview":"Dolly for Minga:\n\nLost Arrow:\n\nClay Trix:\n\nA minute of strangely morphing shapes and general weirdness.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":35,"episode_type":"standard","id":616737,"name":"The Funny Bathtub","overview":"It's the return of the animated people!  Gumby, Pokey, and Minga are sitting around watching their favorite live action show, Plucky the Plumber.  Plucky has to deliver a bathtub to a woman.  While playing with it, he's pleased to discover that the faucet controls make the bathtub move around.  Pleased with his discovery, he hops in the tub and drives it to his customer's house.  Unfortunately, after he gets it installed and his customer is trying to take a bath, it starts up again and busts right through the wall of her house, carrying her frightened, naked body out into the middle of the street.  Sure, Minga has a good laugh about it, but suddenly it's not so funny when she gets in the tub and it starts driving around town with her.  Gumbo leaps to her rescue in the ensuing five hour chase.","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":36,"episode_type":"finale","id":616739,"name":"Chicken Feed","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":22888,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":32847,"poster_path":null,"season_number":1,"vote_average":0}}}