{"adult":false,"backdrop_path":"/zG4HP2unAJwtYBSa9ibpZ8stD5E.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2009-12-02","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.trutv.com/shows/conspiracy_theory/","id":23747,"in_production":false,"languages":["en"],"last_air_date":"2012-12-19","last_episode_to_air":{"id":629351,"name":"Ozarks","overview":"Could the end of days truly be upon us? Members of the international elite – including the Illuminati – seem to think so, and have chosen the Ozark Mountain region of the United States to hide out from the apocalypse. The Conspiracy Theory team finds what appears to be construction on underground cities hidden in mountain caverns and tunnels, blocking off formerly public entrances with iron bars and heavy security. An apparent influx of banks in the rural region also seems suspect, but when they hear about round the clock construction on the biggest private house in America, reportedly built entirely of military grade materials and owned by a D.C. defense contractor, Jesse suspects something big may be happening here – just below the surface.","vote_average":0,"vote_count":0,"air_date":"2012-12-19","episode_number":7,"episode_type":"finale","production_code":"","runtime":60,"season_number":3,"show_id":23747,"still_path":null},"name":"Conspiracy Theory with Jesse Ventura","next_episode_to_air":null,"networks":[{"id":364,"logo_path":"/c48pVcWAEYhEFXrWFsYxx343mjx.png","name":"truTV","origin_country":"US"}],"number_of_episodes":22,"number_of_seasons":3,"origin_country":["US"],"original_language":"en","original_name":"Conspiracy Theory with Jesse Ventura","overview":"Conspiracy Theory with Jesse Ventura is an American television series hosted by Jesse Ventura and broadcast on truTV. It premiered on December 2, 2009. The second season premiered on October 15, 2010, with the third season premiering on November 7, 2012. In May 2013, Ventura stated that the show has been discontinued and a fourth season will not air.","popularity":9.374,"poster_path":"/p16Re3DJTW4tfzyZco8uYy5Li60.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2010-10-15","episode_count":1,"id":33790,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2009-12-02","episode_count":7,"id":33788,"name":"Season 1","overview":"","poster_path":"/rRu4L582YwtQ65DhMA8kWmXIUws.jpg","season_number":1,"vote_average":10},{"air_date":"2010-10-15","episode_count":8,"id":33789,"name":"Season 2","overview":"","poster_path":"/k27miPUZIjnpNmsCkSi41V8bA7N.jpg","season_number":2,"vote_average":0},{"air_date":"2012-11-07","episode_count":7,"id":33791,"name":"Season 3","overview":"","poster_path":"/rWC4tX6g2cxy699ajyKrxHXwAtB.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Scripted","vote_average":8.7,"vote_count":11,"season_data":{"1":{"_id":"5258743d760ee3466127705f","air_date":"2009-12-02","episodes":[{"air_date":"2009-12-02","episode_number":1,"episode_type":"standard","id":629330,"name":"H.A.A.R.P.","overview":"Is it a communications research project or a doomsday weapon that can change the weather, shoot satellites out of orbit - and trigger mind control across the globe? Jesse Ventura and his team head north to a remote region of Alaska to confront the military installation called HAARP.","production_code":"","runtime":60,"season_number":1,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-09","episode_number":2,"episode_type":"standard","id":629331,"name":"9/11","overview":"Jesse Ventura steps into America's most controversial conspiracy by challenging the 9/11 Commission Report and searching for evidence that the September 11th attacks may have been an inside job. At the urging of victims' families, he finds witnesses who claim the towers were brought down by explosives, the missing black box flight recorders were actually recovered and ground control knew the hijackers were in the cockpits before the jets took off","production_code":"","runtime":60,"season_number":1,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-16","episode_number":3,"episode_type":"standard","id":629332,"name":"Is Global Warming a Hoax","overview":"Whether global warming is real or not, it's believed some people are using the issue to make billions of dollars, start a one-world government and control our lives, from the cars we drive to the foods we eat. Jesse Ventura starts with Al Gore and goes far beyond as he uncovers the evidence that leads to one man thought to be behind the global warming conspiracy.","production_code":"","runtime":60,"season_number":1,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-23","episode_number":4,"episode_type":"standard","id":629333,"name":"Big Brother","overview":"Big Brother is watching and it's not who you think. Jesse Ventura's investigation of government surveillance on its citizens tears the lid off a nationwide program that is thought to turn local businessmen and office workers into spies, snooping on their neighbors and ratting on their friends in exchange for information and special privileges from the FBI- including, some charge, a \"license to kill.","production_code":"","runtime":60,"season_number":1,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-30","episode_number":5,"episode_type":"standard","id":629334,"name":"Secret Societies","overview":"They're thought to be a group of the world's elite who meet once a year at a luxury hotel and decide how they will run the world. It's believed they plan to thin out the population through disease-and vaccines. Jesse Ventura infiltrates the Bilderberg Group.","production_code":"","runtime":60,"season_number":1,"show_id":23747,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-01-06","episode_number":6,"episode_type":"standard","id":629335,"name":"Manchurian Candidate","overview":"Authors and experts warn that forces within the government have revived a program that uses mind control techniques to turn ordinary citizens into programmed assassins. This real-life Manchurian Candidate seems outlandish-until Jesse Ventura searches for the evidence and goes face-to-face with a man who claims he's one of the killers.","production_code":"","runtime":60,"season_number":1,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-13","episode_number":7,"episode_type":"finale","id":629336,"name":"Apocalypse 2012","overview":"It's believed that the world is heading for disaster in 2012 and the government is preparing to save and protect the elite - while leaving the rest of us to fend for ourselves. Jesse Ventura investigates claims of top secret underground bunkers being built in places ranging from the Nevada desert to the White House, including the largest, now under construction beneath a major metropolitan airport.","production_code":"","runtime":60,"season_number":1,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":33788,"poster_path":"/rRu4L582YwtQ65DhMA8kWmXIUws.jpg","season_number":1,"vote_average":10},"2":{"_id":"5258743d760ee3466127706a","air_date":"2010-10-15","episodes":[{"air_date":"2010-10-15","episode_number":1,"episode_type":"standard","id":629339,"name":"Plum Island","overview":"Ventura investigates the secretive Plum Island Animal Disease Center located off the coast of Long Island, New York, which has been suspected as being a bio-weapons research center responsible for the release of Lyme disease and other deadly viruses. He also learns that the facility is to be moved to Kansas, into the heart of cattle country, which could spell disaster if a dangerous contaminant was released into the nation's food supply.","production_code":"","runtime":60,"season_number":2,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-29","episode_number":2,"episode_type":"standard","id":629337,"name":"Area 51","overview":"Ventura treks into the Nevada desert to monitor the activity of Area 51, the most secretive military complex in the country and believed by many in the UFO community to be reverse engineering alien technology. He also looks into why the homes of two Area 51 watchdogs were recently raided by the Joint Terrorism Task Force.","production_code":"","runtime":60,"season_number":2,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-05","episode_number":3,"episode_type":"standard","id":629343,"name":"Wall Street","overview":"Ventura infiltrates a group of Wall Street  elitists to find out what caused the financial meltdown and to see who has the power to manipulate the stock market and the prices of oil, silver and gold.","production_code":"","runtime":60,"season_number":2,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-12","episode_number":4,"episode_type":"standard","id":629338,"name":"Police State","overview":"Ventura looks into the plans and procedures in place by the government for declaring martial law, and investigates law enforcement \"fusion centers\" that are being set up around the country; what some say are concentration camps for rounding up U.S. citizens.","production_code":"","runtime":60,"season_number":2,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-19","episode_number":5,"episode_type":"standard","id":629340,"name":"JFK Assassination","overview":"Ventura looks into recently declassified CIA documents that may connect the John F. Kennedy assassination to the Watergate scandal that brought down Richard Nixon. He interviews Lee Harvey Oswald's widow Marina to gain more insight into the \"Two-Oswalds\" theory that a CIA-double killed JFK.","production_code":"","runtime":60,"season_number":2,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-19","episode_number":6,"episode_type":"standard","id":629341,"name":"Great Lakes","overview":"Ventura looks into the prospects of \"Blue Gold\" and why corporations and the super-rich are buying up water rights around the world in what could be a plan in controlling the nations and their masses. He looks into evidence that these tactics are going on in North America in what could be a literal theft of the Great Lakes.","production_code":"","runtime":60,"season_number":2,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-10","episode_number":7,"episode_type":"standard","id":629342,"name":"Gulf Oil Spill","overview":"Ventura looks into rumors that the Deepwater Horizon oil spill was a staged event by companies like BP and Halliburton to reap in profits from the cleanup, as well a administer toxic agents into the Gulf coast waters as part of a larger depopulation program, inspired by the Hurricane Katrina disaster, to modify the world's ocean currents and weather, and to target the Louisiana coastline to gain complete control of its oil reserves.","production_code":"","runtime":60,"season_number":2,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-17","episode_number":8,"episode_type":"finale","id":629344,"name":"Pentagon","overview":"Ventura investigates the theory that a missile, and not a hijacked airliner, hit The Pentagon during the September 11 attacks. Questioned are issues such as the lack of surveillance video released by the FBI; debris and damage inconsistent with a jetliner crash; the extreme difficulty of crashing a jetliner at high speed into a specific ground target by an amateur pilot, and links to a possible cover-up of $2.3 trillion of unaccounted taxpayer money announced by then Secretary of Defense, Donald Rumsfeld, just a day before the attacks.","production_code":"","runtime":60,"season_number":2,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":33789,"poster_path":"/k27miPUZIjnpNmsCkSi41V8bA7N.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258743d760ee34661277080","air_date":"2012-11-07","episodes":[{"air_date":"2012-11-07","episode_number":1,"episode_type":"standard","id":629346,"name":"Reptilians","overview":"Lizard-like shape shifting humanoids: are they real? And could they be masquerading as trusted world leaders? The team gets to the heart of this frightening controversy that stretches from ancient civilizations, to the European monarchy, all the way to our current heads of state...and beyond. When Jesse finds himself face to face with an infamous personality who has spread the gospel of the Reptilian Conspiracy far and wide, things start to get ugly. Will they come to blows? Or will Jesse be blown away by the truth?","production_code":"","runtime":60,"season_number":3,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-14","episode_number":2,"episode_type":"standard","id":629347,"name":"Death Ray","overview":"A lethal weapon that can vaporize targets and whole cities from miles away seems like the stuff of sci-fi movies, but Jesse and his team find that this technology could be all too real as they investigate who might have these secret plans – and what they plan on doing with it. When threats and danger hit way too close to home, will the crew be able to make it out alive? This conspiracy runs deep, but Jesse’s just the guy to do some real digging, with explosive results.","production_code":"","runtime":60,"season_number":3,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-21","episode_number":3,"episode_type":"standard","id":629349,"name":"Time Travel","overview":"Journeying through time is the stuff of fantasy, but somehow has been beyond our grasp…or has it? Jesse tracks down a mysterious man who claims to have visited many iconic moments in American history – and influenced the course of history in doing so! Could our government be hiding the secret to time travel, and possibly even using it as a weapon? And what can we do should the technology fall into the wrong hands…or has it already?","production_code":"","runtime":60,"season_number":3,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-28","episode_number":4,"episode_type":"standard","id":629348,"name":"Manimal","overview":"Science has made major breakthroughs in drug research and transplant technology by experimenting on “chimeras” – human/animal embryo hybrids. But these seemingly noble goals may be covering up a much more nefarious purpose – to create half human, half ape super soldiers, paving the way for a real life Planet of the Apes showdown. Jesse and his team storm the Yerkes Primate Research Center, hidden in the backwoods of Georgia, to find out the truth about “humanzees” – who may already be walking the earth!","production_code":"","runtime":60,"season_number":3,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-05","episode_number":5,"episode_type":"standard","id":629352,"name":"Skinwalker","overview":"UFOs corralled in the Utah desert – could it be true? An eccentric millionaire may indeed have a secret or two tucked away on hundreds of acres of a privately owned – and heavily guarded – ranch, and it’s not for R&R. Amazingly, his reach extends far beyond the states, and into outer space, where he is building a space station of his very own to retreat should things on earth go awry. Yet when Jesse hears tales that people have died battling aliens on our soil, he knows this is no joke, but could be a deadly conspiracy that could be out of this world.","production_code":"","runtime":60,"season_number":3,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-12","episode_number":6,"episode_type":"standard","id":629350,"name":"Brain Invaders","overview":"Could the so-called crazies in the tin-foil hats be on to something? Targeted individuals, or TIs, claim that the government is harassing – even torturing – them by sending microwave signals into their brains and bodies to drive them to despair. It’s not an isolated case, but thousands of people across the country report experiencing the exact same symptoms, all of which began after speaking out against the powers that be. Jesse knows that they aren’t nuts – but could it too late to stop these “voice of God” weapons from turning the population into mindless zombies?","production_code":"","runtime":60,"season_number":3,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-19","episode_number":7,"episode_type":"finale","id":629351,"name":"Ozarks","overview":"Could the end of days truly be upon us? Members of the international elite – including the Illuminati – seem to think so, and have chosen the Ozark Mountain region of the United States to hide out from the apocalypse. The Conspiracy Theory team finds what appears to be construction on underground cities hidden in mountain caverns and tunnels, blocking off formerly public entrances with iron bars and heavy security. An apparent influx of banks in the rural region also seems suspect, but when they hear about round the clock construction on the biggest private house in America, reportedly built entirely of military grade materials and owned by a D.C. defense contractor, Jesse suspects something big may be happening here – just below the surface.","production_code":"","runtime":60,"season_number":3,"show_id":23747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":33791,"poster_path":"/rWC4tX6g2cxy699ajyKrxHXwAtB.jpg","season_number":3,"vote_average":0}}}