{"adult":false,"backdrop_path":"/hdJoqoGTxqlznPvhtGyp45TWYeT.jpg","created_by":[{"id":1212625,"credit_id":"5257381b760ee3668d005544","name":"Ken Spears","gender":2,"profile_path":null},{"id":1212626,"credit_id":"5257381b760ee3668d00554a","name":"Joe Ruby","gender":2,"profile_path":null}],"episode_run_time":[30,22],"first_air_date":"1976-09-11","genres":[{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"},{"id":10762,"name":"Kids"},{"id":10751,"name":"Family"},{"id":9648,"name":"Mystery"}],"homepage":"","id":2422,"in_production":false,"languages":["en"],"last_air_date":"1977-10-29","last_episode_to_air":{"id":182478,"name":"Shadowman [Part 2]","overview":"Mayor Gaunt swears his innocence so Blue Falcon and Dog Wonder inspect other members of the Crime Commission. At the District Attorney's home, The Shadowman straps The Daring Duo to a giant loaf of bread and sends them down a conveyor belt to their doom in a giant breadcutter. Dynomutt inflates the bread so it is too big to fit in the slicer and they escape to The Falcon's Lair, where Dynomutt restores both him and B.F. with his Dyno Paint Kit. Then they disguise themselves as The Panhandle Brothers unveiling a solid gold oil well used as a lure to trap The Shadowman, which is a success He is revealed by his own insidious Shadow-Box device to be Harold Twitch, the corrupt Crime Consultant himself. The Daring Duo return the stolen valuables, Mayor Gaunt is proven innocent, and Big City is once again safe","vote_average":10,"vote_count":1,"air_date":"1977-10-29","episode_number":8,"episode_type":"finale","production_code":"","runtime":null,"season_number":2,"show_id":2422,"still_path":null},"name":"Dynomutt, Dog Wonder","next_episode_to_air":null,"networks":[{"id":2,"logo_path":"/2uy2ZWcplrSObIyt4x0Y9rkG6qO.png","name":"ABC","origin_country":"US"}],"number_of_episodes":24,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Dynomutt, Dog Wonder","overview":"Dynomutt, Dog Wonder is an American animated television series produced for Saturday mornings by Hanna-Barbera Productions. The show centers around a Batman-esque super hero, the Blue Falcon, and his assistant, bumbling yet generally effective robot dog Dynomutt, who can produce a seemingly infinite number of mechanical devices from his body. As with many other animated super-heroes of the era, no origins for the characters are ever provided.\n\nDynomutt was originally broadcast as a half-hour segment of The Scooby-Doo/Dynomutt Hour and its later expanded forms Scooby's All-Star Laff-a-Lympics and Scooby's All-Stars; it would later be rerun and syndicated on its own from 1978 on. The cast of The Scooby-Doo Show appeared as a recurring characters on Dynomutt, assisting the Daring Duo in cracking their crimes. Originally distributed by Hanna-Barbera's then-parent company Taft Broadcasting, Warner Bros. Television currently holds the television distribution to the series.","popularity":6.869,"poster_path":"/yM3GrtRGQKt5AlmsvVoUv63Irwx.jpg","production_companies":[{"id":1353,"logo_path":"/yXhCcOFK5Fy3ZBQwhBYx8Zu9ZIw.png","name":"Hanna-Barbera Productions","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"1976-09-11","episode_count":16,"id":7609,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":10},{"air_date":"1977-09-10","episode_count":8,"id":7610,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":10}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":9.2,"vote_count":57,"season_data":{"1":{"_id":"5257381a760ee3668d00533e","air_date":"1976-09-11","episodes":[{"air_date":"1976-09-11","episode_number":1,"episode_type":"standard","id":182442,"name":"Everyone Hyde!","overview":"Mr. Hyde, alias Willie The Weasel, abetted by Hyde Dog, demands to be mayor of Big City, threatening its citizens with a sinister formula that turns them into evil Hyde-like creatures. Blue Falcon and Dog Wonder, assisted by the Scooby-Doo detectives, plan to trap the wily Mr. Hyde and agree to his request. Once this results, Mr. Hyde, via his terrible greed, is snared into a wild falcon fracus: Dynomutt captures Hyde Dog and the antidote that will save Big City, with Blue Falcon's Falconclaw scooping up the fleeing Willie The Weasel, b.k.a. Mr. Hyde. After being commended by the Mayor, Dynomutt, executing a heroic exit from City Hall, accidentally gets caught in one of Shaggy's Scooby-traps!","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[{"character":"Shaggy Rogers (voice)","credit_id":"5dffb2da65686e00159542a7","order":500,"adult":false,"gender":2,"id":16418,"known_for_department":"Acting","name":"Casey Kasem","original_name":"Casey Kasem","popularity":9.13,"profile_path":"/59kecPxxPIO8uwzaRZAOSDE1l80.jpg"},{"character":"Daphne Blake (voice)","credit_id":"5dffb2ee65686e0013961724","order":502,"adult":false,"gender":1,"id":96340,"known_for_department":"Acting","name":"Heather North","original_name":"Heather North","popularity":6.971,"profile_path":"/zSgNS0OoAMvRafHvHo5PXSWpRG3.jpg"},{"character":"Scooby-Doo (voice)","credit_id":"5dffb30565686e001396175b","order":503,"adult":false,"gender":2,"id":16422,"known_for_department":"Acting","name":"Don Messick","original_name":"Don Messick","popularity":7.047,"profile_path":"/iT3okvWCKy6RAdo6dbx09RP0I3p.jpg"},{"character":"Mr. Hyde (voice)","credit_id":"5dffb51bd236e600108f5763","order":504,"adult":false,"gender":2,"id":106102,"known_for_department":"Acting","name":"Henry Corden","original_name":"Henry Corden","popularity":3.942,"profile_path":"/wTt3jkTCEYyej9vGYQjgHERYzgo.jpg"}]},{"air_date":"1976-09-18","episode_number":2,"episode_type":"standard","id":182444,"name":"What Now, Lowbrow?","overview":"Dog Wonder and B.F., teamed with the Scooby-Doo crimestoppers, meet Lowbrow, a villain desiring to be king of crime employing the knowledge from the books of Big City University to further his dastardly schemes. This primitive thief unwittingly leads Blue Falcon, Dynomutt and Scooby Doo and company to his lair, where they discover his latest plan: robbery of Big City Mint! Blue Falcon and Dynomutt set a trap for Lowbrow and thwart his evil plans, using an \"\"Instant Delayed Action Falcon Balloon,\"\" which captures him and neatly deposits him into prison. Later, at a restaurant, Blue Falcon and Dynomutt treat Scooby and friends to a turkey dinner, for their help in apprehending Lowbrow. Dyno volunteers to carve the turkey, but, instead of a Dyno-carving Knife, his paws malfunctioningly turn into Dyno-Mallets, which pound the poor turkey mercilessly flat. (\"\"Anybody for turkey pancake?\"\")","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[{"character":"Shaggy Rogers (voice)","credit_id":"5dffb2da65686e00159542a7","order":500,"adult":false,"gender":2,"id":16418,"known_for_department":"Acting","name":"Casey Kasem","original_name":"Casey Kasem","popularity":9.13,"profile_path":"/59kecPxxPIO8uwzaRZAOSDE1l80.jpg"},{"character":"Daphne Blake (voice)","credit_id":"5dffb2ee65686e0013961724","order":502,"adult":false,"gender":1,"id":96340,"known_for_department":"Acting","name":"Heather North","original_name":"Heather North","popularity":6.971,"profile_path":"/zSgNS0OoAMvRafHvHo5PXSWpRG3.jpg"},{"character":"Scooby-Doo (voice)","credit_id":"5dffb30565686e001396175b","order":503,"adult":false,"gender":2,"id":16422,"known_for_department":"Acting","name":"Don Messick","original_name":"Don Messick","popularity":7.047,"profile_path":"/iT3okvWCKy6RAdo6dbx09RP0I3p.jpg"}]},{"air_date":"1976-09-25","episode_number":3,"episode_type":"standard","id":182445,"name":"The Great Brain...Train Robbery","overview":"Dynomutt and Blue Falcon meet The Gimmick, a sinister crook using an assortment of mechanical devices to perpetrate a bizarre crime: the theft of the fabulous treasure of Price Ringpur of India. Dog Wonder, in assisting his master, hampers matters with his usual unique mechanical malfunctions. The Gimmick appears to be the villainous victor, as he robs a bank and a jewelry store and then attempts to capture the treasure of Prince Ringpur. In the end, Dynomutt's mechanical genius finds the lair of the evil villain despite his comical screwups, and, with the aid of his Dyno-Jets, he chases down and catches a fleeing, hanggliding Gimmick. Later, after B.F. and D.W. are commended by Price Ringpur of India, cameo guest star Lt. Mumbly takes time from his busy schedule to bring Dog Wonder to Blue Falcon after the former suffers a nasty spill out a window...and then tickets him for littering the sidewalk!","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-10-02","episode_number":4,"episode_type":"standard","id":182446,"name":"The Day And Night Crawler","overview":"Blue Falcon and Dog Wonder encounter The Worm, an evil genius abetted by escaped convicts Bugsy Busby and helicopter thief Roto Chopper, seeking revenge against Big City. Swooping down on Big City Tech (scene of a freak accident years back when The Night Crawler, then Professor Ronald Hickman, was transmogrified from an intelligent scientist into a worm), The Blue Falcon and Dynomutt discover and try to stop the villains' attempt to pilfer a multimillion dollar computer. Despite a string of Dyno DumDums, The Daring Duo lure The Creepy Crawler and his even creepier cronies into a bizarre underground pursuit (where else would worms go?) and trick them into burrowing into Big City Prison.","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-10-09","episode_number":5,"episode_type":"standard","id":182447,"name":"The Harbor Robber","overview":"Blue Falcon and Dog Wonder run afoul of Fishface, an aquatic creep, who schemes to bleed dry the rich cargoes passing in and out of Big City Harbor. This fishy fiend then squeezes Big City dry of its lifesupporting oil and demands $15 million in order to ransom it. Blue Falcon manages to talk The Mayor into paying the ransom by way of a falcon scheme to nab Fishface; unfortunately, this scheme backfires when Dog Wonder and Blue Falcon are captured and are about to become shark bait. They nevertheless escape via an Dyno Power Pack, and Dynomutt, turning into a giant fishing pole (how symbolic!), manages to reel in Fishface and put him out of circulation","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-10-16","episode_number":6,"episode_type":"standard","id":182448,"name":"Sinister Symphony","overview":"Using a sinister symphony, Manyfaces, the malevolent, malicious master of a million monstrous disguises, lulls Big City asleep, allowing him to strip it clean. Donning earmuffs, Blue Falcon and Dynomutt plan a trap, but Manyfaces avoids it when he and his henchmen impersonate Chief Quimby, the Mayor, and B.F.. Dog Wonder, unfortunately, apprehends the real B.F., mistakenly believing he has Manyfaces in disguise. Through touching Dynomutt's one ticklish spot (he's the only one who knows where it is), Blue Falcon manages to finally convince Dynomutt he's the true B.F. and together they pursue the real Manyfaces and his creepy cronies, who at this time are driving down the street in a dumptruck piled high with stolen loot. Manyfaces again tries to confuse D.W. by his B.F. disguise, but this time Dog Wonder picks his true blue buddy and Manyfaces is arrested.","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-10-23","episode_number":7,"episode_type":"standard","id":182449,"name":"Don't Bug Superthug","overview":"The Daring Duo meet Superthug and Zorkon, two evil geniuses who have created a superdynamic steel skeleton. Superthug steals every bit of available steel from Big City, as he wants to mass-produce these skeletons for every crook in Big City to use for evil purposes. To counter this superfiend, B.F. straps Dynomutt's hands and legs to his and challenges Superthug with his Falcon-Dyno Superstrength Power Pack Combination...and to steal the steel TV tower on top of the TV station building. S.T. accepts the challenge, but Dynomutt's usual rash of mechanical mishaps literally trip up all of Blue Falcon's attempts to stop him. Superthug makes off with the TV tower, while Blue Falcon winds up being entangled in Dog Wonder's metallic limbs, defeated, humiliated, and publicly disgraced. Since the superheroes are unable to stop Superthug, secret agent Focus One has no alternative but to fire The Blue Falcon and Dog Wonder (\"\"Gosh! You'd think they could at least give a couple of ex-superheroes 30","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-10-30","episode_number":8,"episode_type":"standard","id":182450,"name":"Factory Recall","overview":"In trying to combat the villainous Mr. Cool (a Mr. Freeze incarnate), whose cold rays freeze everyone into solid ice, The Blue Falcon accidentally drops his Falcon commumicator from his Falconbelt in trying to save Dog Wonder, who has also been fozen by the cold ray blast. The commumicator is immediately snatched up by Mr. Cool. Once thawed out, Dynomutt seems to be in worse shape than ever before, forever irking Blue Falcon with his oafish chuckling. Using the Falcon communicator device, Cool tricks B.F. into believeing he is Focus One, telling him Dynomutt is being recalled to the factory for a reprogramming. Dog Wonder is then programmed by Cool into an evil D.W., who nearly succeeds in ending Blue Falcon's career...and his life! But, true to Dyno-malfunctioning tradition, he botches his foul plan. While scaling a building with Falcon Suctioncup Feet, D.W. captures B.F. and brings him to Mr. Cool, who orders him to crush Blue Falcon under a block of ice (\"\"Get ready to become a chip","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-11-06","episode_number":9,"episode_type":"standard","id":182451,"name":"The Queen Hornet","overview":"The Blue Falcon and Dynomutt attempt to get evidence that will put away that buzzing vixen, The Queen Hornet. They chase her after she hijacks an armored car full of money, but, due to a string of Dog Wonder Blunders, they are stuck in a tree. The Queen Hornet uses her quick-drying \"\"Honeysticker\"\" on The Daring Duo and brings them to the basement of The Hornet's Nest nightclub (an appropriate GHQ for such a mean Queen), where she hopes a swarm of her \"\"little brothers and sisters,\"\" her trained hornets, will build an unbreakable nest around Blue Falcon and Dog Wonder. They are saved by the Dyno Car Wash and jet by Falconcar overseas to catch and stop Queen Hornet and her lackeys in the act of stealing the famous moon diamonds from returning astronauts. They trace her to the landing capsule, where they discover the gooey \"\"honey-sticker\"\" has frozen the astronauts immobile. D.W. cuts a hole in the bottom of the capsule and dives out, activating his Dyno Flotation Collar which succeeds in bri","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-11-13","episode_number":10,"episode_type":"standard","id":182452,"name":"The Wizard Of Ooze","overview":"The Daring Duo encounter the sinister Swamp Rat and Mudmouth, who've been hijacking trucks in the Bogmyer Swamp for the purpose of stealing their pumps. They use them to pump half of their swamp into Big City, turning it into Bog City, a giant swamp so muddy the citizens desert the city, leaving it unprotected and easy fair game for The Swamp Rat and Mudmouth. Blue Falcon and Dog Wonder, teamed with the Scooby Doo crimebusters, manage to extricate themselves from becoming gator bait and rush to the aid of the oozy Big City to lure the swampy thieves into the open. There, B.F., to allay Swamp Rat's suspicions, disguises Shaggy Rogers and Scooby-Doo as Blue Falcon and Dynomutt, respectively, and have them going the other way with the real Daring Duo posing as expensive gold statues at The Big City Convention Hall. The wily thieves, thinking B.F. and D.W. are heading elsewhere, feel free to steal the gold statues. When they learn of Blue Falcon's ruse, they flee into the swamp, only to be","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[{"character":"Swamp Rat / Shaggy Rogers (voice)","credit_id":"5dffb48565686e001895999d","order":501,"adult":false,"gender":2,"id":16418,"known_for_department":"Acting","name":"Casey Kasem","original_name":"Casey Kasem","popularity":9.13,"profile_path":"/59kecPxxPIO8uwzaRZAOSDE1l80.jpg"},{"character":"Daphne Blake (voice)","credit_id":"5dffb2ee65686e0013961724","order":502,"adult":false,"gender":1,"id":96340,"known_for_department":"Acting","name":"Heather North","original_name":"Heather North","popularity":6.971,"profile_path":"/zSgNS0OoAMvRafHvHo5PXSWpRG3.jpg"},{"character":"Scooby-Doo (voice)","credit_id":"5dffb30565686e001396175b","order":503,"adult":false,"gender":2,"id":16422,"known_for_department":"Acting","name":"Don Messick","original_name":"Don Messick","popularity":7.047,"profile_path":"/iT3okvWCKy6RAdo6dbx09RP0I3p.jpg"}]},{"air_date":"1976-11-20","episode_number":11,"episode_type":"standard","id":182454,"name":"Tin Kong","overview":"The Daring Duo meet evil Eric Von Flick, a hack movie director who situates in the abandoned Epic Studios just outside of Big City, who attempts production of the greatest disaster movie of all time: The Total Destruction Of Big City, starring Tin Kong, a gigantic robot ape (no relation to Grape Ape, mind you!). In Desperation, Blue Falcon uses the Dyno Enlarging Powerpack, making Dog Wonder 50 times larger, resulting in him stopping Kong in destroying a passenger train. Suddenly B.F. is nabbed by Tin Kong!!! Dynomutt turns into a Dynobiplane, flies up and shakes Dynopepper into Tin King's nose causing him to sneeze and release Blue Falcon. The Daring Duo snatches the chance to gain entry inside T.K.'s control panel and reprograms him, commanding him to scoop up the villainous VonFlick and his minions in his enormous hands once and for all, ensuring his last picture will be his prison photograph. Later, at The Falcon's Lair, Dog Wonder, having reprogrammed Tin Kong as a butler, calls f","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-11-25","episode_number":12,"episode_type":"standard","id":182456,"name":"The Awful Ordeal With The Head Of Steel","overview":"Ironface, bearing a bitter grudge, seeks revenge on Big City and kidnaps the District Attorney, Warden of Rockatraz, and Detective Malloy. Tis fiend then lures The Daring Duo, Mayor Gaunt, Judge Grater, Chief Grisby, and the Chief Prosecutor to his yacht, aptly named Revenge, where they are all kidnapped and shanghaied to his island fortress. Remaining city officials disappear one by one, until Blue Falcon and Dog Wonder allow themselves to be captured as well, hoping to solve and foil this crime. When I.F. has all the officials and The Daring Duo in a hige prison cell, he relates the reason for his vengeance: he spent 10 years in Rockatraz Prison and now wants them all to spend the same number of years in his prison. Dynomutt chews some shrinking gum and shrinks down to size, picks the lock, and frees Blue Falcon and the officials. The Daring Duo then capture a fleeing Ironface in The Dyno-Yo-Yo, and unmasks him to be the sinister Serpent Lady. She is then recaptured, exchanging her i","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-11-27","episode_number":13,"episode_type":"standard","id":182457,"name":"The Blue Falcon Vs. The Red Vulture","overview":"The Red Vulture steals 2 of the world's most powerful superjet engines, with plans to use them for his nefarious Vulturejet and in turn dominate the airways. The Daring Duo trace the villain to The Big City Superjet Races, but are immediately snagged by The Vulturejet and trapped along with the crew aboard a cargo jet recently robbed by R.V., which is slated to crash into a mountain far ahead of them. With only 3 minutes to spare, Dog Wonder extends his neck and arms into the cockpit and steers the jet out of danger. Blue Falcon and Dog Wonder then trace The Red Vulture to his nest, but upon arrival, they are instantly set upon by R.V.'s deadly mechanical mini-vultures. D.W. captures them all in a burlap sack, and the two jet by Falconcar to stop The Red Vulture, who is at present stealing $10 million of gold boullion arriving in Big City Airport. R.V. spots them, and tries to suck The Daring Duo, Falconcar and all into his supersonic vacuum device. Fortunately, this proves to be Red V","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-12-04","episode_number":14,"episode_type":"standard","id":182459,"name":"The Injustice League Of America","overview":"Six of the most evil criminals ever to face The Daring Duo - Fishface, The Worm, The Queen Hornet, Lowbrow, Superthug, and The Gimmick - have broken Big City Prison. They reconvene at the abandoned Waldorf Euphoria Hotel where they form The Injustice League Of America. By ordering a series of robberies across Big City at the costume ball at The Vandergilt Mansion and the proposed Big City Bank, the ILA lures Blue Falcon and Dog Wonder to their secret lair at Fishface's HQ. There, they fall haplessly victim to an escape-proof supertrap rigged by The Gimmick. Without The Daring Duo to foil them, the sinister sextet split up into separate pairs and go their separate ways in converging upon the unprotected Big City. It takes a total of 6 Dynogadgets to ensure Blue Falcon and Dynomutt's escape, and they plan to capture the whole group by disguising themselves alternately as members of the Injustice League and thwart the criminals with a bevy of doublecrosses. First, B.F. and D.W. disguise t","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[{"character":"Hyde (voice)","credit_id":"5dffb5499824c80013e2741c","order":505,"adult":false,"gender":2,"id":106102,"known_for_department":"Acting","name":"Henry Corden","original_name":"Henry Corden","popularity":3.942,"profile_path":"/wTt3jkTCEYyej9vGYQjgHERYzgo.jpg"}]},{"air_date":"1976-12-11","episode_number":15,"episode_type":"standard","id":182460,"name":"The Lighter Than Air Raid","overview":"As Radley Crowne and Dynomutt enjoy a leisure game of golf, The Blimp, evil genius of the airways, directs The Blimplair silently high over their heads, pilfering Big City's supply of helium. Once alerted by FOCUS One, they immediately switch costumes and dash off in pursuit, but a malfunctioning Dyno- Helium Sniffer leads The Daring Duo to a baloon vendor at The Big City Circus, where the hapless Dog Wonder unwittingly becomes the main attraction on the trapeze. Waylaid once again by baloon dummies in a toy factory, Blue Falcon and Dog Wonder chase The Blimplair but are caught in a giant Blimptrap; furthermore, they are chained to a gas helium baloon, which will carry them to their doom in outer space. They escape, but too late: The Blimp has already used the helium to reach the communications satellite, shot his Blimpray into all the TV and radio sets and rendered everyone \"\"Blimpified\"\" (e.g. turned into helpless baloons!), and now he is looting Big City! In The Mayor's office, Dog Wo","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1976-12-18","episode_number":16,"episode_type":"finale","id":182462,"name":"The Prophet Profits","overview":"Dynomutt and Radley Crowne race out of the Big City Drive-In Theatre, leaving a sea of poporn, and switch to Blue Falcon and Dog Wonder in a futile attempt to save Big City Bridge from the collapse as predicted by The Prophet. The Daring Duo begin to look bad as they are unable to prevent a second disaster - the leaning over of the Big City City Hall - also predicted by The Prophet, despite Dynomutt's efforts to fix the damage. The Blue Falcon mistrusts The Prophet, and with good reason: he rigs each disaster for the sick purpose of charging the Mayor $500,000 for each prediction. To counter this situation, B.F. introduced Swami Poochi (D.W. in disguise) who charges half price for his prediction: the collapse of a rocket at Big City Rocket Base in 2 days. The Daring Duo secretly hover over The Prophet's lair and sectetly listens in as an enraged Prophet becomes dead set on making Swami Poochi look bad by plotting to set off the rocket in 1 day and destroying it in space. Blue Falcon an","production_code":"","runtime":null,"season_number":1,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":7609,"poster_path":null,"season_number":1,"vote_average":10},"2":{"_id":"5257381a760ee3668d005349","air_date":"1977-09-10","episodes":[{"air_date":"1977-09-10","episode_number":1,"episode_type":"standard","id":182463,"name":"Beastwoman [Part 1]","overview":"The evil Beastwoman uses her multifrequency Beastwhistle to call all the animals in the Big city Zoo to break out of their cages and drive the people out. Dog Wonder finds Beastwoman in a dog parlor where he gets a poodle chip. D.W. succumbs to the Beastwhistle and, following Beastwoman's commands, captures The Blue Falcon and puts him in a maneating plant. Beastwoman orders her subjects to spread her fast growing seeds across Big City, which she plans to convert into a giant jungle!","production_code":"","runtime":null,"season_number":2,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1977-09-17","episode_number":2,"episode_type":"standard","id":182465,"name":"Beastwoman [Part 2]","overview":"B.F. manages to release himself and reprogram Dog Wonder so he won't obey Beastwoman's Beastwhistle. B.W., meanwhile, employs some bird to seed the clouds and have them rain on the seeded Big City, turning it into a jungle. The Daring Duo learn she plans to do this to the rest of the U.S.A. via rocket power, so Blue Falcon detains Beastwoman whilst Dynomutt goes up with the rocket which crashes into the lake and D.W. becomes a moss-covered mechanical mutt. Blue Falcon severs Beastwoman's powers by snipping her veins, and Big City is restored to normal. Blue Falcon attempts to shear Dynomutt's veins, but the latter decides to shake them off by dancing the Hula.","production_code":"","runtime":null,"season_number":2,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1977-09-24","episode_number":3,"episode_type":"standard","id":182466,"name":"The Glob [Part 1]","overview":"Petty thug Norbert Prindle, alias The Glob, eludes Dynomutt and Blue Falcon at The Crowne Art Gallery and makes off with the multimillion dollar Baltese Falcon, a 2\"\" statue of solid diamonds. The Dyno-Computer Tracker traces The Glob and the heroes almost collide with the thief. The Glob escapes into a manhole where Dynomutt gets the Baltese Falcon back from him and hides it in a curio shop amongst 9 other phoney Baltese Falcons. The Daring Duo corners Norbert Prindle and his mob at their hideout, but Prindle eludes them again, washing the heroes down the channel by a flood of water. They return to the curio shop to retrieve the Baltese Falcon, only to find that it and the other phoney Baltese Falcons have been sold. Thus begins a mad dash between Blue Falcon and Dynomutt and Prindle trying to beat each other to the various buyers, vying for the prize. The Daring Duo are captured at the third buyer's address, The National Science Institute (the very site where Norbert Prindle became a","production_code":"","runtime":null,"season_number":2,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1977-10-01","episode_number":4,"episode_type":"standard","id":182468,"name":"The Glob [Part 2]","overview":"As Dynomutt escapes, Blue Falcon becomes Blue Blob. Dog Wonder races his blue buddy to The Falcon's Lair, where he sculpts him back to normal and spritzes him with The Falcon Instant Hardening Spray, and corner The Glob and his minions just as they nab the true Baltese Falcon. They capture Norbert Prindle in a huge goblet, and turn the crooks in and return the Falcon to the Crowne Art Gallery. Later, in the Falcon's Lair, D.W. tries to sculpt a \"\"Bluetese Falcon\"\", using B.F. for a model, but his creation shatters to pieces before he gets to profit big from it.","production_code":"","runtime":null,"season_number":2,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1977-10-08","episode_number":5,"episode_type":"standard","id":182472,"name":"Madame Ape Face [Part 1]","overview":"The Daring Duo are on the trail of Madame Ape Face who has swiped the face of Sophia Florenzi and plans tosteal all of the beautiful faces of the starlets of Big City. They catch up with The Madame at GaGa Galore's costume party but her face is stolen. Chasing Ape Face , Blue Falcon and Dog Wonder find themselves headed down a conveyor belt into a cold cream machine!","production_code":"","runtime":null,"season_number":2,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1977-10-15","episode_number":6,"episode_type":"standard","id":182474,"name":"Madame Ape Face [Part 2]","overview":"Saved by The Falcon Fan Snapper, The Daring Duo rush to the aid of the most probable victims. When Fifi Foray wins a beauty contest, Dog Wonder disguises himself as Fifi, and an ensuing scuffle with Madame Ape Face results in D.W.'s face stolen. (Dynoape, Ape Wonder?! It'll never be the same!) Using The Dyno-Radar Hand Detector, the heroes find The Madame's lair and Dog Wonder's face is restored. They catch Ape Face in the act of pilfering Sarah Showerfaucet's face at her apartment. Blue Falcon captures The Madame just as she tosses Sarah's face out the window, but Dog Wonder manages to catch it before it shatters on the concrete below.","production_code":"","runtime":null,"season_number":2,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1977-10-22","episode_number":7,"episode_type":"standard","id":182476,"name":"Shadowman [Part 1]","overview":"Lurking in Big City is The Shadowman, who mysteriously knows all of the plans of The Crime Commission. The Daring Duo are called in when the 700-karat Shmope Diamond is swiped. As they respoind, they spot a shadow sneaking off with plates for new $20 bills stolen from an armored car. The Shadowman later manages to kill two birds with one stone by making off with a secret gold shipment and framing Mayor Gaunt (who is captured in The Dyno Bad Guy Box) all in one shot.","production_code":"","runtime":null,"season_number":2,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1977-10-29","episode_number":8,"episode_type":"finale","id":182478,"name":"Shadowman [Part 2]","overview":"Mayor Gaunt swears his innocence so Blue Falcon and Dog Wonder inspect other members of the Crime Commission. At the District Attorney's home, The Shadowman straps The Daring Duo to a giant loaf of bread and sends them down a conveyor belt to their doom in a giant breadcutter. Dynomutt inflates the bread so it is too big to fit in the slicer and they escape to The Falcon's Lair, where Dynomutt restores both him and B.F. with his Dyno Paint Kit. Then they disguise themselves as The Panhandle Brothers unveiling a solid gold oil well used as a lure to trap The Shadowman, which is a success He is revealed by his own insidious Shadow-Box device to be Harold Twitch, the corrupt Crime Consultant himself. The Daring Duo return the stolen valuables, Mayor Gaunt is proven innocent, and Big City is once again safe","production_code":"","runtime":null,"season_number":2,"show_id":2422,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":7610,"poster_path":null,"season_number":2,"vote_average":10}}}