{"adult":false,"backdrop_path":"/bDTT3LazRDa9HxocoeHSXvNzaKc.jpg","created_by":[],"episode_run_time":[55],"first_air_date":"2008-05-28","genres":[{"id":18,"name":"Drama"}],"homepage":"http://www.kbs.co.kr/drama/sunwoman/","id":24242,"in_production":false,"languages":["ko"],"last_air_date":"2008-07-31","last_episode_to_air":{"id":638895,"name":"Episode 20 END","overview":"……..Sad At The End……..","vote_average":7,"vote_count":1,"air_date":"2008-07-31","episode_number":20,"episode_type":"finale","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null},"name":"Women of the Sun","next_episode_to_air":null,"networks":[{"id":342,"logo_path":"/nFmWwUAf2D3iAtizUcmkxufaM0q.png","name":"KBS2","origin_country":"KR"}],"number_of_episodes":20,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"태양의 여자","overview":"Shin Do Young is an announcer who instigates the jealously of all women around her because of her superior looks, great abilities, and great background. But Do Young has a deep, dark secret. She was actually abandoned at an orphanage when she was young but luckily she was adopted by a nice couple.","popularity":2.255,"poster_path":"/ebs07DZxWg6FUebNXKZUPho8pR6.jpg","production_companies":[{"id":10675,"logo_path":"/4g8trWzgZLMZTjzRzJbt56DUg4E.png","name":"Pan Entertainment","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2008-05-28","episode_count":20,"id":34401,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":7.3}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5.7,"vote_count":3,"season_data":{"1":{"_id":"5258771f760ee346612b43ea","air_date":"2008-05-28","episodes":[{"air_date":"2008-05-28","episode_number":1,"episode_type":"standard","id":638876,"name":"Episode 1","overview":"Shin Doyeong is Korea’s most popular announcer and the most respected person among female university students. Wining the Grand Prize at the Asian TV Festival, her popularity goes up day by day. Yun Saweol sells clothes at her friend’s clothing store to make ends meet. She goes to a wedding to get even to her high-school classmate who made her get kicked out of school by telling everyone that Saweol was a thief. On the day, promising M expert Kim Junse proposes to Doyeong, Doyeong receives a phone call from a strange woman saying that she is her biological mother and that she wants to see Doyeong before she dies. Doyeong goes to Hong Kong pretending that she goes on a business trip and meets her dying mother there. To Doyeong’s surprise, Doyeong’s mother says she saw everything that Doyeong had done to her sister Jiyeong when she was 12 years old. Dongwu picks up Doyeong, who is drunk and passes out on the street, and brings her to his place. Doyeong insists she will repay his kindness and then Dongwu asks her to find his first love Saweol who grew up with him at an orphanage.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-05-29","episode_number":2,"episode_type":"standard","id":638877,"name":"Episode 2","overview":"Saweol goes abroad for the first time by a drink company’s campaign. Taking pictures of famous boutiques in Hong Kong, she is misunderstood as a thief who has stolen the store’s displays. To prove she’s innocent, she transforms the tacky store so that it looks more upscale. To thank her, the owner of the store writes a letter of recommendation for her so that she can apply for a brand name personal shopper position at a department store. Saweol and her friend Yongja goes to a broadcasting station to be audiences at the Wonder Woman Show that Shin Doyeong hosts. Just 20 minutes before the live show begins, Saweol sneaks into a dressing room for actresses to just look around but she is accused of stealing a necklace. Saweol runs away after hitting Doyeong.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-04","episode_number":3,"episode_type":"standard","id":638878,"name":"Episode 3","overview":"Doyeong soon realizes that she made a mistake of accusing innocent Saweol as a thief after the missing necklace turns up. After watching Doyeong’s swollen face on the screen, Saweol goes to clear her name and apologize to Doyeong in person. Doyeong, who feels sorry to Saweol, is impressed by Saweol’s brave and confident act. Saweol is interviewed for a personal shopper position at a department store and there she comes to see Kim Junse, her first love when she used to live in an orphanage.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-05","episode_number":4,"episode_type":"standard","id":638879,"name":"Episode 4","overview":"Saweol gets a job at a department store as a personal shopper. One day, Saweol encounters Shin Doyeong and her mother, Professor Choe Jeonghui who visit the store. Impressed by Saweol’s spunky personality, Doyeong suggests a TV program searching for parents for Saweol. Meanwhile, Choe Jeonghui meets Kim Junse and tells him that Doyeong is her adopted daughhter and asks him to postpone the wedding until she finds her real daughter Jiyeong.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-11","episode_number":5,"episode_type":"standard","id":638880,"name":"Episode 5","overview":"oyeong supposes Saweol may be her sister Jiyeong, who is a real daughter of Professor Choe Jeonghui and whom Doyeong abandoned at the Seoul Station when she was young. She encourages Wonder Woman Show Staff to cancel the show on searching for Saweol’s parents, and even rushes to the department store where Saweol is working to prevent Jeonghui from encountering Saweol. Doyeong hears from the Wonder Woman Show Team that Saweol’s parents live in the countryside, Gunsan. Now, she is somewhat relieved from the fear that Saweol may be Jiyeong. Meanwhile, Saweol is happy to meet her first love Junse working for the M&A Team at the department store.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-12","episode_number":6,"episode_type":"standard","id":638883,"name":"Episode 6","overview":"Wondering if Saweol is Jiyeong, Doyeong feels relieved when a woman came from the countryside, Gunsan insisting that she is a real mother of Saweol. Meanwhile, Professor Choe Jeonghui plans to ask the police to reopen Jiyeong’s case. Worried Doyeong lets Saweol get a DNA test to see if Saweol is a real daughter of her mother, Professor Choe. Working as a personal shopper, Saweol comes to meet a super rich but cranky client, Chairman Jang of Taemong group. At last, the DNA test results of Jiyeong are out.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-18","episode_number":7,"episode_type":"standard","id":638881,"name":"Episode 7","overview":"Doyeong obtains the result of DNA test proving that Saweol is a biological daughter of Prof. Choe Jeonghui. However, she turns away from Saweol and decides not to reveal who Saweol really is. Dongwu hears from Saweol that there is a rumor Doyeong is adopted. Not taking comfort from her fiancé Junse, Doyeong has a good time with Dongwu at an amusement park. Saweol is grounded for 3 days for what she’s done to Chairman Jang. Saweol heads to the Michael’s House in Mokpo with Junse to take pictures for paralyzed Junse’s father. Meanwhile, Eunseop who used to live at Jaeseong Orphanage together with Doyeong contacts Doyeong as he needs money.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-19","episode_number":8,"episode_type":"standard","id":638882,"name":"Episode 8","overview":"By accident Dongwu happens to confirm the rumor that Doyeong was adopted and has been hated by her mother who only cares about her missing sister Jiyeong. As Dongwu cares for Doyeong, Doyeong opens her mind and tells Dongwu how hard she has been. Junse and Saweol go to Michael’s House and have a good time taking pictures and playing soccer with children. Feeling that Doyeong is avoiding himself, Eunseop pays a visit to the TV station to meet Doyeong. Doyeong gets a call from his father that they found Jiyeong.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-25","episode_number":9,"episode_type":"standard","id":638884,"name":"Episode 9","overview":"Doyeong goes home full of fear and despair when she gets a call from Suho, her father, that he found Jiyeong. However, she realizes that Jiyeong, who the parents found, is not the real. Hyunju hides reality and acts as if she is the real Jiyeong. Doyeong just overlooks it. She replaces Saweol’s hair with Hyunju’s and requests DNA test. Doyeong finds herself feeling comfortable when she is with Dongwu, instead of Junse. At Junse’s home, Doyeong sees the picture of Saweol and Junse together.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-26","episode_number":10,"episode_type":"standard","id":638885,"name":"Episode 10","overview":"Doyeong finds out that Junse is Saweol’s childhood sweetheart, and kisses Junse in front of Saweol to hurt her mind. Jeonghui tells Doyeong to have her wedding, since she found Jiyeong. In the mean time, Hyunju, conspires with Eunseop and tells Jeonghui that she needs money to get out of her one hundred million dollar debt. When Doyeong realizes that Hyunju and Eunseop are related, she shows Hyunju the forged document of the DNA test. Doyeong tells her that she could become the real Jiyeong if she sees Eunseop no more.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-02","episode_number":11,"episode_type":"standard","id":638887,"name":"Episode 11","overview":"Doyeong is delighted to be appointed as Korea’s PR ambassador, but Eunseop’s threat keeps her tensed. Dongwu comes to the party for Doyeong to see her before returning to Hong Kong and sees her happy with Junse. Junse goes to an exhibit with Saweol and gets mad about the way Mrs. Ma, Sing-Sing Haeun’s chairwoman, treats her. They get out from the gallery and go to see the Indie concert. Having a good time, Junse and Saweol start to feel good impressions on each other. Saweol happens to see the picture of the Seoul Station at Junse’s office, and recovers parts of her lost memory. Saweol visits Jeonghui’s house for delivery, walks around the inside, and finds herself feeling familiar in the house…","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-03","episode_number":12,"episode_type":"standard","id":638886,"name":"Episode 12","overview":"Getting her memory back, Saweol is sure that she is Jiyeong. Saweol draws on Doyeong for a help, expecting her warm support, but Doyeong denies the fact and prohibits Saweol from meeting Jeonghui. As the fear Doyeong had becomes reality, Doyeong speaks ill of Saweol to Jeonghui that Saweol stole a necklace at the TV station and was kicked out of high school for stealing. Doyeong lies as if all the bad rumors were true so that Jeonghui wouldn’t believe what Saweol’s saying. As Doyeong doesn’t reveal the truth to Jeonghui, Saweol decides to talk to Jeonghui by herself. However, Jeonghui thinks Saweol is lying and gets upset…","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-09","episode_number":13,"episode_type":"standard","id":638889,"name":"Episode 13","overview":"Jeonghui tumbles down the stairs, and Doyeong and Saweol take her to the hospital. While Jeonghui stays unconscious, Doyeong sets guards in front of the room so that Saweol can’t get in. Saweol begs Doyeong to believe that she is Jiyeong, but Doyeong harshly takes Saweol away from her mother. Jiyeong can’t understand Doyeong’s behavior and gets enraged. Saweol meets Eunseop to know more about the story of the missing girl, Shin Jiyeong.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-10","episode_number":14,"episode_type":"standard","id":638888,"name":"Episode 14","overview":"Saweol meets Kim Eunbi, the writer, and gives Eunbi a source for a play that she says she heard from her orphanage. Doyeong is nervous since she doesn’t know what Saweol’s going to do next. Junse tells Doyeong that he thinks Saweol might be Doyeong’s missing sister, and Doyeong gets shocked. Eunbi writes a play named ‘Two Sisters’ and Saweol meets Chairman Jang Taemoon to ask for the supports for the play.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-16","episode_number":15,"episode_type":"standard","id":638890,"name":"Episode 15","overview":"Doyeong goes to see the play ‘Two Sisters’, and notices that it is the story about Saweol and herself. Now Doyeong knows Saweol is waiting for the revenge. Doyeong tries to ruin the play by making Hyunjoo to buy the whole tickets as a group viewing and empties out the seats. Nonetheless, the play successfully gets on the road. The staffs of Wonder Women Show wants to cast the team of ‘Two Sisters’ on the show, since the play is popular and to help Eunbi, the writer. Doyeong is against to it, and tells they shouldn’t pick a guest just because they personally know the writer. Despite Doyeong’s objection, the team comes out on Wonder Women Show. In the live talk show, Saweol gives Doyeong the script of ‘Two Sisters’ and asks her to play the older sister’s part…","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":0,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-17","episode_number":16,"episode_type":"standard","id":638891,"name":"Episode 16","overview":"Doyeong reads the script during the live talk show and becomes extremely emotional. She slaps Saweol’s face after the show, but Sieun witnesses the scene and records it in Sanggu’s camera. It seems to become a big problem, but Saweol deals with the situation by saying they were only practicing the script. Slowly and harshly, Saweol makes Doyeong anxious. Jeonghui gradually gets parts of her memory and tells Doyeong about the scar on the waist. Doyeong now knows that Jeonghui showed her love only because she got confused Doyeong with Jiyeong, and drives into despair. Jeonghui sees Saweol on the TV Show and completely gets her memory back.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-23","episode_number":17,"episode_type":"standard","id":638892,"name":"Episode 17","overview":"eonghui becomes conscious that Yoon Saweol is her daughter, Jiyeong. Jeonghui pours a bucket of water to Doyeong, sleeping on her bed, and shouts at her to get out of the house. Sooho tries to stop her but Doyeong goes out of the room. Jeonghui calls Saweol and choked with tears. Saweol runs to home and embraces her parents.","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-24","episode_number":18,"episode_type":"standard","id":638893,"name":"Episode 18","overview":"oyeong and Saweol have a big argument in the room and Jeonghui hears it.\n\nBroadcasting station asks Doyeong to bring her baby pictures of her first birthday and the one hundredth day, to make the special documentary program about Shin Doyeong. Doyeong asks Junse about their wedding..","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-30","episode_number":19,"episode_type":"standard","id":638894,"name":"Episode 19","overview":"Eunseop lynchs Saweol and she is enraged by misunderstanding that Doyeong told him to harm Saweol. She also sees Doyeong talks to producer Gohun, lying about Saweol. Saweol decides to write e-mails to the press to reveal what Doyeong has done to Saweol. Doyeong meets Taemoon, hears about her birth parents, and got confused. She loses her head when she finds Saweol told everything to the media. Saweol sees that she has act hastily and tries to deal with the situation, but the articles start to come out…","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-31","episode_number":20,"episode_type":"finale","id":638895,"name":"Episode 20 END","overview":"……..Sad At The End……..","production_code":"","runtime":55,"season_number":1,"show_id":24242,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":34401,"poster_path":null,"season_number":1,"vote_average":7.3}}}