{
    "adult": false,
    "backdrop_path": "/vJk94JAtkmWDDw5YmCM1cqtVZkr.jpg",
    "created_by": [
        {
            "id": 942904,
            "credit_id": "525739c719c29531db01d22f",
            "name": "Mark Burnett",
            "original_name": "Mark Burnett",
            "gender": 2,
            "profile_path": null
        }
    ],
    "episode_run_time": [
        60
    ],
    "first_air_date": "2005-02-16",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "http://www.bbc.co.uk/apprentice",
    "id": 2472,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2024-04-18",
    "last_episode_to_air": {
        "id": 5257873,
        "name": "The Final & You’re Hired!",
        "overview": "Two finalists will be tasked with launching a new business and pitching it to Lord Sugar for the chance to win his £250,000 investment and become his next business partner.",
        "vote_average": 3,
        "vote_count": 1,
        "air_date": "2024-04-18",
        "episode_number": 12,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 58,
        "season_number": 18,
        "show_id": 2472,
        "still_path": "/5Tn3HxJJJ8ktYczypTBNP1vcUp6.jpg"
    },
    "name": "The Apprentice",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 4,
            "logo_path": "/uJjcCg3O4DMEjM0xtno9OWFciRP.png",
            "name": "BBC One",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 243,
    "number_of_seasons": 18,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "The Apprentice",
    "overview": "British version of the reality competitions series that sees young entrepreneurs compete in several business tasks, attempting to survive the weekly firings in order to become the business partner of one of the most successful businessmen.",
    "popularity": 18.562,
    "poster_path": "/hgHGsnZyeJTrNmFD37MDQgW2kAK.jpg",
    "production_companies": [
        {
            "id": 13157,
            "logo_path": "/jr4fJUF5avpcT3V0HwrIZ4t8uMn.png",
            "name": "Talkback",
            "origin_country": "GB"
        },
        {
            "id": 59551,
            "logo_path": null,
            "name": "Mark Burnett Productions",
            "origin_country": ""
        },
        {
            "id": 5645,
            "logo_path": "/bKcQzzCVVeqgby86hAqKm5iVuzi.png",
            "name": "Talkback Thames",
            "origin_country": "GB"
        },
        {
            "id": 47773,
            "logo_path": "/d1mGbi5yBtaFr5lz8FO4UWMnsXx.png",
            "name": "Boundless",
            "origin_country": "GB"
        },
        {
            "id": 77503,
            "logo_path": null,
            "name": "United Artists Media Group",
            "origin_country": "US"
        },
        {
            "id": 2230,
            "logo_path": "/igOjospzsKQIbpuFCGhoN5F9icS.png",
            "name": "MGM Television",
            "origin_country": "US"
        },
        {
            "id": 62029,
            "logo_path": null,
            "name": "Fremantle Productions",
            "origin_country": "GB"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2007-03-15",
            "episode_count": 16,
            "id": 7848,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2005-02-16",
            "episode_count": 14,
            "id": 7844,
            "name": "Season 1",
            "overview": "Series One of The Apprentice television programme was broadcast in the UK from 16 February to 11 May in 2005. The format of the UK version was very similar to that of the US original. The format was licensed by RTL Group and the programme produced for the BBC by RTL's Talkback Thames division. It was shown on BBC Two on Wednesday evenings over twelve weekly episodes. The winner was to become an apprentice to Sir Alan Sugar.\n\nThe winner was Tim Campbell, previously a transport manager at London Underground, who beat Saira Khan in the final. Sir Alan said that he chose Tim as the winner because of his likeness to his East End self.",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2006-02-22",
            "episode_count": 12,
            "id": 7845,
            "name": "Season 2",
            "overview": "Series Two of The Apprentice was a television series which was broadcast on BBC Two between 22 February and 10 May 2006. As in the previous series, Sir Alan Sugar continued as the boss, assigning the teams specifically designed tasks. Nick Hewer and Margaret Mountford also returned as Sugar's advisers and observed the teams in action. In addition, a companion discussion program called The Apprentice: You're Fired! was introduced and aired on BBC Three.\n\nThe series was won by Michelle Dewberry in the final episode broadcast on 10 May 2006.\n\nThis series premiered in Australia on 27 August 2008 at 9:30pm on Channel Seven, under the title Sir Alan Sugar: The Apprentice to distinguish it from the US version. Despite heavy promotion of the series during Seven's Olympic coverage, the series only rated 583,000 viewers nationally, which was third for its timeslot. The following week, the series was moved to 10:30pm, and ratings have continued to decrease. The series also airs in Australia on pay TV channel UKTV.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2007-03-28",
            "episode_count": 12,
            "id": 7842,
            "name": "Season 3",
            "overview": "Series Three of The Apprentice was a television series which aired in the UK on BBC One. The series began on 28 March 2007 and finished on 13 June 2007, with Simon Ambrose as the winner. Ambrose's prize was to work on a project to develop a hotel and golfing complex near Stansted Airport, whilst training as a chartered surveyor. Kristina Grimes, the runner-up, has received many job offers from separate companies and is now working as an investment sales director.\n\nSir Alan Sugar reprised his role as the boss with Nick Hewer and Margaret Mountford as his advisors. Moving from BBC Two, this series attracted 10,000 applicants and promised \"tougher tasks and better people\" than before, however Sir Alan believed that the show was morphing into \"Big Brother\". Sugar also criticised the US version for making the error of \"trying to change things just for the sake of it\", causing it to backfire.\n\nTwo 90-minute specials were aired during the series run. The first programme was titled The Apprentice: Beyond the Boardroom and featured information about the personal lives of each of the semi-finalists. The second, The Apprentice: Why I Fired Them, featured Sugar revealing why he chose to remove each candidate from the programme.",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2008-03-26",
            "episode_count": 13,
            "id": 7843,
            "name": "Season 4",
            "overview": "Series Four of The Apprentice was a British reality television series, which was won by Lee McQueen. The series began on BBC One on 26 March 2008, and ran for twelve weekly episodes. Auditions and interviews are reported to have taken place during the first two weeks of July 2007 in London, Glasgow, Manchester and Bristol. A record 20,000 applications were received.\n\nSir Alan Sugar reprised his role as the boss, and Nick Hewer and Margaret Mountford again served as his advisers. 'Frances', Sir Alan's boardroom 'receptionist', also returned. The show's spin-off, The Apprentice: You're Fired!, was again hosted by Adrian Chiles. Filming of the first episode of The Apprentice: You're Fired! took place on 25 March 2008. TV presenter Jennifer Maguire also participated in this series.",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2009-03-25",
            "episode_count": 12,
            "id": 7846,
            "name": "Season 5",
            "overview": "Series Five of The Apprentice was a British reality television series which was won by Yasmina Siadatan. The series began airing on BBC One on 25 March 2009 and ran for twelve weekly hour-long episodes, as in all previous years. Auditions and interviews took place during July 2008 in London, Glasgow, Manchester and Birmingham. There were fifteen participants; one more dropped out prior to the first boardroom briefing.\n\nSir Alan Sugar, Nick Hewer and Margaret Mountford made appearances, as in all previous series. Spin-off show The Apprentice: You're Fired! also returned, airing on BBC Two immediately after the main show.",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2010-10-06",
            "episode_count": 15,
            "id": 7847,
            "name": "Season 6",
            "overview": "Series Six of The Apprentice was a British reality television series. The series started on BBC One on 6 October 2010 and ran for twelve weekly hour-long episodes, as in all previous years. Following a web-based application, regional auditions and interviews took place during July 2009 in London, Glasgow, Manchester and Birmingham, about 75 candidates were called back for a second round in London and shooting took place in Autumn 2009. There are sixteen participants and the board consists of Alan Sugar, Nick Hewer and Karren Brady. The programme formerly featured Margaret Mountford, who stood down from the role in June 2009. However, she made a guest appearance in Week 11 as an Interviewer.\n\nThe series was won by Stella English, a 30-year-old investment banker from London. After winning, English worked at Sugar's company Viglen. Sugar subsequently gave her a new job at YouView in May 2011, after she complained of being \"just a glorified PA\" in her original position. English resigned from YouView in October 2011, leaving Sugar's employment altogether, claiming that she had had virtually no contact with Sugar in her role. Previous series had begun in March but the 2010 series was postponed until the autumn by the BBC to avoid any issues regarding the general election and Lord Sugar's ties to the then government.",
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2011-05-10",
            "episode_count": 15,
            "id": 7849,
            "name": "Season 7",
            "overview": "Series Seven of The Apprentice was a British reality television series. The series started on BBC One on 10 May 2011, and ran for 12 hour-long weekly episodes, as in all previous years. However, Episode 1 and 2 were aired the same week, and the final episode four days after the penultimate.\n\nThe winner was Tom Pellereau, with Helen Milligan as the runner-up.\n\nPellereau holds the record of least successful winner of The Apprentice, losing eight tasks out of eleven. He is the only winner to have never won as project manager He is also the only winner to have only been project manager once during the series, as well as the first winner to have won fewer tasks than the runner-up Runner-up Helen Milligan won ten out of eleven tasks.\n\nThere were sixteen participants and the board consists of Alan Sugar, Nick Hewer and Karren Brady. The Apprentice: You're Fired! also returned on BBC Two, featuring Dara Ó Briain, who reprises his role of the interviewer of the fired candidate.",
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        {
            "air_date": "2012-03-21",
            "episode_count": 14,
            "id": 7850,
            "name": "Season 8",
            "overview": "Series Eight of The Apprentice was a British reality television series. The series started on BBC One on 21 March 2012, and ran for 12 weeks, with each episode lasting an hour. The series was won on 3 June 2012 by Ricky Martin, with Tom Gearing as runner-up. Nick Holzherr came in third place, and Jade Nash in fourth place.",
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        },
        {
            "air_date": "2013-05-07",
            "episode_count": 14,
            "id": 7851,
            "name": "Season 9",
            "overview": "Series Nine of The Apprentice is a British reality television series. The series began on BBC One on 7 May 2013.\n\nOn 8 July 2013, an episode called The Final Five aired, which profiled the remaining five candidates. On 11 July 2013, an episode called Why I Fired Them aired where Lord Sugar explains how the candidates fared and why he fired each candidate.\n\nThe series was won by Leah Totton.",
            "poster_path": null,
            "season_number": 9,
            "vote_average": 0
        },
        {
            "air_date": "2014-10-14",
            "episode_count": 14,
            "id": 71374,
            "name": "Season 10",
            "overview": "",
            "poster_path": null,
            "season_number": 10,
            "vote_average": 0
        },
        {
            "air_date": "2015-10-14",
            "episode_count": 14,
            "id": 71371,
            "name": "Season 11",
            "overview": "",
            "poster_path": null,
            "season_number": 11,
            "vote_average": 0
        },
        {
            "air_date": "2016-10-06",
            "episode_count": 14,
            "id": 80789,
            "name": "Season 12",
            "overview": "",
            "poster_path": null,
            "season_number": 12,
            "vote_average": 0
        },
        {
            "air_date": "2017-10-04",
            "episode_count": 14,
            "id": 93614,
            "name": "Season 13",
            "overview": "",
            "poster_path": null,
            "season_number": 13,
            "vote_average": 0
        },
        {
            "air_date": "2018-10-03",
            "episode_count": 14,
            "id": 110158,
            "name": "Season 14",
            "overview": "",
            "poster_path": "/lqEMBrhiNauwoRGymQSiOacTk84.jpg",
            "season_number": 14,
            "vote_average": 0
        },
        {
            "air_date": "2019-10-02",
            "episode_count": 14,
            "id": 133029,
            "name": "Season 15",
            "overview": "Over the course of 12 tough tasks, the 16 candidates will be whittled down until just one victor remains. And plenty of sparks are set to fly in the boardroom along the way!\n\nEach week the budding entrepreneurs will be divided into two teams - led by designated Project Managers - that lock horns under the watchful eyes of Lord Sugar's advisor Baroness Karren Brady and new aide Claude Littner.\n\nAfter completing each task both teams return to the boardroom to discuss their inspirational or calamitous experiences and discover which side has triumphed.\n\nThe winners will be rewarded with a luscious treat while the losing team’s Project Manager must select two colleagues to accompany them back into the boardroom. Lord Sugar will then hear their arguments and fire at least one of them from the competition.\n\nThe eventual winner of The Apprentice Series 15 will be given the opportunity to be Lord Sugar's business partner and receive an investment to the value of £250,000 founded on the basis of their idea.",
            "poster_path": "/hgHGsnZyeJTrNmFD37MDQgW2kAK.jpg",
            "season_number": 15,
            "vote_average": 0
        },
        {
            "air_date": "2022-01-06",
            "episode_count": 14,
            "id": 238030,
            "name": "Season 16",
            "overview": "",
            "poster_path": null,
            "season_number": 16,
            "vote_average": 0
        },
        {
            "air_date": "2023-01-05",
            "episode_count": 12,
            "id": 322128,
            "name": "Season 17",
            "overview": "",
            "poster_path": null,
            "season_number": 17,
            "vote_average": 4.6
        },
        {
            "air_date": "2024-02-01",
            "episode_count": 12,
            "id": 372256,
            "name": "Season 18",
            "overview": "",
            "poster_path": null,
            "season_number": 18,
            "vote_average": 4.9
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Reality",
    "vote_average": 5.4,
    "vote_count": 26,
    "season_data": {
        "1": {
            "_id": "525739bd19c29531db01c817",
            "air_date": "2005-02-16",
            "episodes": [
                {
                    "air_date": "2005-02-16",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 187199,
                    "name": "Wilting Blooms",
                    "overview": "After the men had bought their flowers they left the market to get a cup of tea – without any of the roses they had paid for. Whoever had bought the roses had failed to arrange it and Tim, the project manager, had not noticed either. Luckily Matthew had realised and in a panic they all ran back into the market trying to find the stall they bought the roses from – the problem was that no-one could remember exactly where it was. Eventually they found it and the whole team were relieved.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-02-23",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 187200,
                    "name": "Child's play",
                    "overview": "In the second episode of The Apprentice the boys didn't tell the girls the phone call had come through and cheekily left them in bed. They had just 20 minutes to leave the house when they finally woke up. The two teams, boys v girls, had two days to research, design, make and present a new children's toy. The girls chose Lindsay as their team leader she was determined to choose a toy she had invented. Secret Signals were cards for children to make semaphore signals. She even imposed it on the rest after both the team and a group of children had voted it down. Raj was chosen as Impact project manager as he had some experince in this field. First Forte wasted a lot of time on another toy, a robot, that may well have won if Lindsay had not enforced her preference on the others. The boys developed an electronic game. Both teams presented their games to senior executives at a games company who recommended the boys' game should win.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-03-02",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 187202,
                    "name": "Shop till you drop",
                    "overview": "Two girls had been fired in the first two weeks. \"We're too good for them,\" boasted Raj. But Sir Alan Sugar had decided to reorganize the teams for the third week. \"Matthew, I'm gonna make you the team leader,\" he boomed. Matthew looked gobsmacked. Adele was also chosen as a Team leader by Sir Alan Matthew, Raj, Paul and James were joined by Saira and Rachel for team Impact.Adele, Miranda and Miriam were joined by Ben, Sebastian and Tim for team First Forte.Their task: to buy a range of products including a diamond, a bottle of champagne, jellied eels, a bowler hat, a Freeview box, a dental check-up - and get back to the boardroom by 5.30pm. Adele gave each team member a job description. Miranda was not pleased to be appointed Adele's PA and ordered to take notes of meetings. James knew exactly where to buy a bottle of Bollinger 96 Grande Ann�e. He took the team off to the expensive Lea and Sandeman wine merchants in the Fulham Road - and paid �49 for a bottle.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-03-09",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 187203,
                    "name": "The Harrods' sales",
                    "overview": "Sir Alan had arranged with Mohammed Al-Fayed for the teams to test their retailing skills in Harrods. Both teams were given £600 seed money to spend as they will. Marigay McKee from Harrods told the teams it was very important to smile. Matthew glowered. Tim was leader for First Forte James was Project Manager for Impact this week. Impact started off badly: Matthew tripped up, Paul miscalculated the percentage of Harrods own-brand goods and the sales area was empty. Impact and First Forte had to chose between 2 areas 1 or 2. First Forte tryed to get Impact seed money for return of first choice but First Forte was stupid enough and still got first choice Number 2. First Forte started to hire a Face painter, demonstraters and a panoist in order to attract consumers while Impact had nothing. Then Paul had the idea of dressing up as Rosie the Bear - and he enchanted the kids and the tills started ringing.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-03-16",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 187204,
                    "name": "Art with a capital F",
                    "overview": "Miriam was the last woman standing in First Forte. Four of the original seven women in the team had been fired and two had transferred to Impact. In week five Miriam's team included team leader Sebastian, Ben, Tim and new recruit James. In the undefeated Impact were team leader Rachel, Saira, Paul, Matthew and Raj. This week the teams visited seven modern artists and had to choose which one they would represent selling their work at a gallery one evening. Matthew admitted: \"\"I wouldn't recognize a Damian Hirst if one fell on me.\"\" James charmed Rob and Nick Carter when he visited them and their light-inspired work. Both Impact and First Forte wanted to represent their work in the gallery. So the Carters had to decide who they wanted to represent them - and they chose First Forte. Impact represented Lucy Bennett, their second choice. Paul went out on the streets to invite guest to the gallery. \"\"No entendemos nada. Hablamos espaÃ±ol,\"\" said one lady.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-03-24",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 187205,
                    "name": "Advertising executives",
                    "overview": "All the candiates were called and had to get on the Bus with they side advert saying the \"\"Apprentice\"\", they had to go upstairs where they recieved a phone call from Sir Alan Sugar who couldnt be there he described their next task. The teams had to develop a TV and press ads for the Amstrad JB 1000 - a 10 CD changer. Paul was Project Manager for Impact and Miriam was Project Manager for First Forte they are both Project Managers for the first time. Both teams had a quick meeting with Alan Sugar son had a meeting with them. Impact was down to only four contestants: Paul, Raj, Saira and Rachel. Raj didn't think much of Paul's management. \"\"He's all over the place,\"\" he told Saira. \"\"I ain't got a clue what's going on.\"\" Paul directed a TV ad featuring a mum and her spotty kid. The kid couldn't act which lead Paul to spend the majoirty of time delevoping the TV ad neglecting the Press campaign. Paul sent Saira and Rachel off to work on the press campaign.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-03-30",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 187206,
                    "name": "Apprentice Celebrities",
                    "overview": "Sir Alan had been involved in the refurbishment of the Hackney Empire and this week a group of celebrities and the remaining candidates helped raise some money in a celebrity auction. Sir Alan separated Paul and Saira asking them both to select members for the new teams. First Forte were led by James and included Saira, Sebastian and Raj. Impact were led by Ben and included Miriam, Paul and Tim. Each team visited five celebrities and tried to obtain something from each of them which would be auctioned. Ben wisely gave Miriam the task of chatting up Michael Winner who contributed a table for four at The Ivy. Impact were on fire and then managed to get Dermuid Gavin to part with his prized Suzuki bike. First Forte were struggling. Eamonn Holmes charmed the group sitting them on the GMTV studio couch but the most he would offer was a tour of the TV studios and breakfast in the canteen.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-04-06",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 187207,
                    "name": "Food Fight",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-04-13",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 187209,
                    "name": "Team News",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-04-20",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1066699,
                    "name": "On TV",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-04-27",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 187210,
                    "name": "Apprentice Interviews",
                    "overview": "The final 4 candidates, Sarah, Tim, Paul and James are interviewed by Sir Alan's top executives. The executives give their opinion on each of the candidiates and Sir Alan takes the advice of the executives and then sacks two candidates. After a final grilling boardroom, James is fired first then Paul is fired, this leaves Sara and Tim for the final.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-05-03",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 187211,
                    "name": "The Final",
                    "overview": "The final two candidiates are put through their final challenge - to create a themed event on a boat. Both candidiates are given £5000 and some advice from Sir Alan, before they start the task they choose to pick previous candidates to help them on their task. Tim chooses to run a fashion event on the boat while Sara chooses a wine tasting event.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2005-05-03",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 187212,
                    "name": "You're Hired",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-02-19",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 187214,
                    "name": "The Apprentice: Tim in the Firing Line",
                    "overview": "This special one-off programme follows series one winner, Tim, in his first year as the new apprentice for Sir Alan.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "Series One of The Apprentice television programme was broadcast in the UK from 16 February to 11 May in 2005. The format of the UK version was very similar to that of the US original. The format was licensed by RTL Group and the programme produced for the BBC by RTL's Talkback Thames division. It was shown on BBC Two on Wednesday evenings over twelve weekly episodes. The winner was to become an apprentice to Sir Alan Sugar.\n\nThe winner was Tim Campbell, previously a transport manager at London Underground, who beat Saira Khan in the final. Sir Alan said that he chose Tim as the winner because of his likeness to his East End self.",
            "id": 7844,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "525739bd19c29531db01c822",
            "air_date": "2006-02-22",
            "episodes": [
                {
                    "air_date": "2006-02-22",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 187215,
                    "name": "Fruit and Veg",
                    "overview": "Sir Alan Sugar begins a new search for an apprentice for 2006 amongst fourteen new candidates. For their first task, they must purchase produce within a budget of £500, before up-selling their stock for a profit around Hackney.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-03-01",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 187216,
                    "name": "Calendar Club",
                    "overview": "The teams take on the job of raising money for Great Ormond Street Hospital, each designing a themed calendar and pitching it to retailers as a test of their creative and pitching skills.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-03-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 187217,
                    "name": "Buying the Tyre",
                    "overview": "Sir Alan has a new shopping list of ten items to be found, testing each team's negotiating skills on sourcing and bargaining for the best deal with each purchase.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-03-15",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 187219,
                    "name": "A Hundred Chickens",
                    "overview": "Both teams find themselves cooking up a tasty treat for visitors to the Thames Festival, with each seeking to manage costs while ensuring their food attracts reasonable profits.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-03-22",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 187220,
                    "name": "The Amsair Card",
                    "overview": "Sir Alan has developed a new venture for business flights – the Amsair Card – and instructs each team to come up with a promotional campaign for it, including a video and billboard advert, pitching their concept to advertising experts.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-03-29",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 187221,
                    "name": "Second-Hand Cars",
                    "overview": "This week, the nine remaining candidates are given the task to sell second-hand cars. With only a 10-hour time limit, they need to convince as many customers as possible to part with their hard earned cash.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-04-05",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 187222,
                    "name": "Selling in Topshop",
                    "overview": "The eight survivors try to succeed in the world of fashion at Top Shop in Oxford Circus, London.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-04-12",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 187223,
                    "name": "Selling to the Trade",
                    "overview": "The seven remaining candidates find themselves looking for an innovative product that could do well, with each team pitching their choices to retailers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-04-19",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 187224,
                    "name": "Property Sales",
                    "overview": "As only six contestants remain, each team must let property. As usual the team that brings back the least amount of money, will lose, and one member, will get fired.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-04-26",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 187225,
                    "name": "Moet & Chandon",
                    "overview": "With only 6 people left, Sir Alan will set another challenging task. Brought aboard the Grand Princess as it travels between Istanbul and Naples, each team is tasked with providing a special event for passengers in which success comes from good sales and customer sanctification.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-05-03",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 187226,
                    "name": "Interviews",
                    "overview": "On Week 11, the remaining 4 candidates are going it alone as they go into interview process again with 3 of the best of the people to help Sir Alan to make his decision on which two people to get fired.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-05-10",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 187227,
                    "name": "The Final",
                    "overview": "The final, one contestant is hired by Sir Alan Sugar.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "Series Two of The Apprentice was a television series which was broadcast on BBC Two between 22 February and 10 May 2006. As in the previous series, Sir Alan Sugar continued as the boss, assigning the teams specifically designed tasks. Nick Hewer and Margaret Mountford also returned as Sugar's advisers and observed the teams in action. In addition, a companion discussion program called The Apprentice: You're Fired! was introduced and aired on BBC Three.\n\nThe series was won by Michelle Dewberry in the final episode broadcast on 10 May 2006.\n\nThis series premiered in Australia on 27 August 2008 at 9:30pm on Channel Seven, under the title Sir Alan Sugar: The Apprentice to distinguish it from the US version. Despite heavy promotion of the series during Seven's Olympic coverage, the series only rated 583,000 viewers nationally, which was third for its timeslot. The following week, the series was moved to 10:30pm, and ratings have continued to decrease. The series also airs in Australia on pay TV channel UKTV.",
            "id": 7845,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "525739bd19c29531db01c801",
            "air_date": "2007-03-28",
            "episodes": [
                {
                    "air_date": "2007-03-28",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3089728,
                    "name": "Coffee",
                    "overview": "The Apprentice returns with 16 brand new contestants, who will battle it out week-by-week for the chance to win a six-figure salary as Sir Alan Sugar's new apprentice.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-04-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 187170,
                    "name": "Doggy Designs",
                    "overview": "With one candidate fired last week, the remaining 15 are given the task to design products for dogs. These ideas must then be presented to three pet stores.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-04-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 187171,
                    "name": "Start-up Service",
                    "overview": "As usual, this week, the candidates need to make as much money as possible. However, in a test of entrepreneurial skills, the candidates are free to do whatever they want from a small starting fund given to them by Sir Alan.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-04-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 187172,
                    "name": "Sugar Rush",
                    "overview": "It's time to see if the teams have a sweet tooth, with this weeks task involving the manufacturing and selling of sweets at London Zoo. The teams must decide which target market to aim for - parents or children - as well as integrating within the zoo and it's main animal attractions.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-04-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 187173,
                    "name": "Fish, Lips and Horses",
                    "overview": "The candidates get a chance to earn thousands of pounds for Sir Alan by choosing and selling art photographs.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-05-02",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 187174,
                    "name": "The Sausage Saga",
                    "overview": "The remaining ten candidates get a special treat from Sir Alan, as they take a trip across the Channel. However, this will be no holiday, as the two teams are set the task to make as large a profit as possible by selling British food to the French.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-05-09",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 187175,
                    "name": "The 97 Pence Victory",
                    "overview": "It's time to see how well the candidates can negotiate, as they have to buy ten items for the lowest amount of money. It may seem to be a relatively simple task, but Sir Alan has asked for one particular item that the teams may have to look extremely hard for.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-05-16",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3089729,
                    "name": "Trainers",
                    "overview": "The candidates have to create their own brand of trainer.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-05-23",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 187178,
                    "name": "Brand-a-trainer",
                    "overview": "The candidates have to choose from a selection of innovative products which have never been seen before in the UK market. They are then required to sell as many of the three products they have chosen to retailers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-05-30",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 187179,
                    "name": "Selling on TV",
                    "overview": "It's time for the candidates to practice their sales technique once more, as they have to sell live on TV to the public. However, this task is not as simple as it may seem, as the teams are also required to choose which specific products they want to sell.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-06-06",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 187181,
                    "name": "Interviews",
                    "overview": "It's time for the five remaining candidates to face the interview process. Three candidates are set to face the chop, as Sir Alan looks to choose the best of the best from the final five.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-06-13",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 187182,
                    "name": "The Final",
                    "overview": "The final week and only two candidates remain in the compitition. With former colleagues coming back to help, or possibly hinder, the final task of the season is to plan and present ideas of what to do with a £120 million site that Sir Alan has recently bought. This time however, the final boardroom will reveal who has been hired.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "Series Three of The Apprentice was a television series which aired in the UK on BBC One. The series began on 28 March 2007 and finished on 13 June 2007, with Simon Ambrose as the winner. Ambrose's prize was to work on a project to develop a hotel and golfing complex near Stansted Airport, whilst training as a chartered surveyor. Kristina Grimes, the runner-up, has received many job offers from separate companies and is now working as an investment sales director.\n\nSir Alan Sugar reprised his role as the boss with Nick Hewer and Margaret Mountford as his advisors. Moving from BBC Two, this series attracted 10,000 applicants and promised \"tougher tasks and better people\" than before, however Sir Alan believed that the show was morphing into \"Big Brother\". Sugar also criticised the US version for making the error of \"trying to change things just for the sake of it\", causing it to backfire.\n\nTwo 90-minute specials were aired during the series run. The first programme was titled The Apprentice: Beyond the Boardroom and featured information about the personal lives of each of the semi-finalists. The second, The Apprentice: Why I Fired Them, featured Sugar revealing why he chose to remove each candidate from the programme.",
            "id": 7842,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "525739bd19c29531db01c80c",
            "air_date": "2008-03-26",
            "episodes": [
                {
                    "air_date": "2008-03-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 187183,
                    "name": "Fishy Business",
                    "overview": "To start of the new season, Sir Alan sets the task in which two teams, separating into the girls and the boys, have to sell fish out on the streets of London. There was much talk of the boys' team splitting into two factions: the first of these contained Alex, Simon, Lee and Ian while the second consisted of Raef, Michael and Nicholas. Coverage was shown of all members of the boys' team; however, some members of the girls' team (notably Shazia, Lucinda and Jenny) had almost no coverage in this week's episode.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-04-02",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 187185,
                    "name": "A Dirty Job",
                    "overview": "Sir Alan Sugar puts 16 applicants through the job interview from hell. After an exhausting first task, the applicants are challenged to set up an overnight laundry business. They persuade customers to part with their washing (including hundreds of sheets from a hotel chain) then clean into the early hours. The following morning, following Sir Alan's warning not to lose a single sock, they return the clothes. Sir Alan's aides Nick and Margaret watch, and a second applicant will be fired.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-04-09",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 187186,
                    "name": "Cooking with Gas",
                    "overview": "The teams must take over a pub and turn it into a themed restaurant - however, the pub kitchens in which the teams will be based, have never served food before.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-04-16",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 187187,
                    "name": "Photo Finish",
                    "overview": "Four weeks into his search for an apprentice, Sir Alan challenges the teams to set up their own photography business at a busy shopping centre on the outskirts of London. Charged with taking and selling photos, the teams must work together to rake in the money.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-04-23",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 187188,
                    "name": "Mid-Series Sales",
                    "overview": "It's down to the farm for our Apprentice wannabes, as the teams take on an ice cream making challenge. Alpha and Renaissance must make three new flavours, and then launch two of those products into the untapped London market. The team which secures the most orders, by value, will win.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-04-30",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 187189,
                    "name": "Yours Truly, Angry Mob",
                    "overview": "This week the two teams have to create a range of greetings cards for a new occasion. Three members of the loosing team end up in the board room with Sir Alan where one of them will be fired.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-05-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 187190,
                    "name": "Marrakesh",
                    "overview": "The candidates set off on a two-day business trip to Marrakesh, where they are challenged to find the best deals possible when buying 10 items in the city's markets. The budding entrepreneurs race against time and tempers flare as the deadline approaches.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-05-14",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 187191,
                    "name": "Wedding Hell",
                    "overview": "It's all about satin and sequins as Sir Alan Sugar sets both teams the challenge of selling wedding dresses at a wedding show at the Birmingham NEC. The candidates have just one day to visit specialist bridal businesses and select gowns that will be popular with brides-to-be at the show. Success in this task will depend on choosing the right products to sell - and with more than 300 exhibitors at the show, the competition is tougher than it's ever been before.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-05-21",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 187193,
                    "name": "Tissues",
                    "overview": "The candidates must design their own brand of tissues, and create both a TV commercial and printed advertisement in order to promote the product.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-05-27",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 187194,
                    "name": "Re-inventing the Wheel",
                    "overview": "The candidates must rent out expensive sports cars.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-06-04",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 187195,
                    "name": "Interviews",
                    "overview": "After facing ten tasks as teams, the five remaining candidates now compete as individuals in their next task – a series of tough, gruelling interviews with four of Sir Alan's most trusted associates.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-06-11",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 187198,
                    "name": "The Final",
                    "overview": "The remaining four candidates are split into two teams to develop and present a new type of fragrance. The teams are joined by former candidates, and with only the winning team able to get the chance to work with Sir Alan, they must overcome this final hurdle in a bid to become the next Apprentice.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-06-11",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 187197,
                    "name": "The Final",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "Series Four of The Apprentice was a British reality television series, which was won by Lee McQueen. The series began on BBC One on 26 March 2008, and ran for twelve weekly episodes. Auditions and interviews are reported to have taken place during the first two weeks of July 2007 in London, Glasgow, Manchester and Bristol. A record 20,000 applications were received.\n\nSir Alan Sugar reprised his role as the boss, and Nick Hewer and Margaret Mountford again served as his advisers. 'Frances', Sir Alan's boardroom 'receptionist', also returned. The show's spin-off, The Apprentice: You're Fired!, was again hosted by Adrian Chiles. Filming of the first episode of The Apprentice: You're Fired! took place on 25 March 2008. TV presenter Jennifer Maguire also participated in this series.",
            "id": 7843,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "525739bd19c29531db01c82d",
            "air_date": "2009-03-25",
            "episodes": [
                {
                    "air_date": "2009-03-25",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 187228,
                    "name": "Scrubbing Up",
                    "overview": "The sixteen new candidates meet Sir Alan for the first time and receive their challenge. They have to start cleaning companies and make as much money as possible. At the end of the show the first of the hoepfuls is fired.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-04-01",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 187230,
                    "name": "A Hungry Business",
                    "overview": "After a punishing first task, there is no let-up for the candidates, as Sir Alan challenges them to set up a catering service for busy professionals in the City of London. In tough economic times, the teams must agree a distinctive identity to stand out from the competition and win new customers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-04-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 187231,
                    "name": "Survival of the Fittest",
                    "overview": "This week the two teams have to create a new piece of portable gym equipment and create a poster advertising it. They then have to demonstrate the equipment. At the end of the show one of the candidates from the loosing show is fired by Sir Alan.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "",
                            "credit_id": "525739c019c29531db01cbf0",
                            "order": 500,
                            "adult": false,
                            "gender": 1,
                            "id": 146458,
                            "known_for_department": "Acting",
                            "name": "Katherine Jenkins",
                            "original_name": "Katherine Jenkins",
                            "popularity": 3.139,
                            "profile_path": "/omBxjQHAgxNtSCQ9rbYBrfgQ1Gb.jpg"
                        }
                    ]
                },
                {
                    "air_date": "2009-04-15",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 187232,
                    "name": "A Soap Opera",
                    "overview": "Week four of Sir Alan Sugars search for his apprentice. Sir Alan Sugar challenges the teams to set up their own cosmetics business.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-04-22",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 187233,
                    "name": "The Advertising Challenge",
                    "overview": "The candidates are given the task of a new breakfast cereal with a brand identity including a name for the cereal, design for the box and film a TV campaign that will appeal both to the parents and the children.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-04-29",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 187234,
                    "name": "Bric-a-Brac Race",
                    "overview": "The candidates are tasked with taking a collection of items given to them by Sir Alan Sugar and selling them for the most proffit.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-05-06",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 187235,
                    "name": "Heading North",
                    "overview": "Travelling north for their next challenge, each team must choose two innovative products, and then sell their choices to the right markets within two days.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-05-13",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 187236,
                    "name": "Cool Margate",
                    "overview": "Alan Sugar sends the candidates to Margate on the Kent coast, where they are challenged to produce an eye-catching series of posters and leaflets designed to attract tourists to the seaside resort.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-05-20",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 187237,
                    "name": "Baby Love",
                    "overview": "The teams interview suppliers of baby equipment, select two products, and sell them on to a potential 10,000 customers at the country's biggest baby show.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-05-27",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 187238,
                    "name": "Car Crash TV",
                    "overview": "The teams must select products which they believe will sell the best during an hour of live television. They must then sell these on-screen themselves.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-06-03",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 187239,
                    "name": "Interviews",
                    "overview": "There's no place to hide as the final five candidates face four of Sir Alan's trusted advisors in face-to-face interviews.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-06-07",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 187240,
                    "name": "The Final",
                    "overview": "After facing a multitude of business tasks and a tough interview, the two finalists now face one more challenge – helped by old friends, each finalist must market a brand new box of chocolates, pitching their concept to a panel of business and chocolate experts.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "Series Five of The Apprentice was a British reality television series which was won by Yasmina Siadatan. The series began airing on BBC One on 25 March 2009 and ran for twelve weekly hour-long episodes, as in all previous years. Auditions and interviews took place during July 2008 in London, Glasgow, Manchester and Birmingham. There were fifteen participants; one more dropped out prior to the first boardroom briefing.\n\nSir Alan Sugar, Nick Hewer and Margaret Mountford made appearances, as in all previous series. Spin-off show The Apprentice: You're Fired! also returned, airing on BBC Two immediately after the main show.",
            "id": 7846,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "525739bd19c29531db01c838",
            "air_date": "2010-10-06",
            "episodes": [
                {
                    "air_date": "2010-10-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 187251,
                    "name": "Bangers",
                    "overview": "Lord Sugar meets a fresh batch of candidates in his search for an apprentice, as another series of the business-based reality TV show begins. The first task for the candidates is to produce a range of sausages ready for sale the next morning. They are given a crash-course in crafting the perfect sausage, before hitting the streets at the crack of dawn in the hope of selling their stock, under the watchful eyes of Nick Hewer and Karren Brady. At the end of the day, one candidate will be fired.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-13",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 187247,
                    "name": "Beach Accessory",
                    "overview": "Following an early morning call summoning the candidates to Heathrow airport, hopes are high for a sunshine getaway. No such luck for the candidates, though, as Lord Sugar sets the task of designing and creating a brand new beach accessory. The task is centred on creating something completely original for the nation's sun worshipers, along with an eye-catching poster to promote their product. Candidates must then pitch their product to three big retailers in the hopes of securing orders and avoiding a place in the boardroom. A surprise result leads to a fierce boardroom battle, where one more candidate is faced with hearing Lord Sugar's immortal words \"You're fired\".",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-20",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 187248,
                    "name": "Bakery",
                    "overview": "The candidates seize the opportunity to impress Lord Sugar as they take over an industrial bakery. The teams are each given a market stall from which they try to tempt hungry customers with their baked goods, and they go head-to-head to pitch for the business of a high-class hotel, a restaurant and a coffee shop. Nick and Karren keep an eye on proceedings as the teams work to keep up with orders, and when the teams face Lord Sugar in the boardroom, one candidate is fired.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 187250,
                    "name": "Selling to Trade",
                    "overview": "The teams are at the Science Museum, where they have to select two innovative new products to sell to trade. One of the members of the team which loses the challenge is failed by Sir Alan at the end of the show.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 187249,
                    "name": "Fashion",
                    "overview": "It is week five, and the candidates boldly enter the world of fashion. Lord Sugar ups the ante when he challenges the teams to open pop-up shops at the Trafford Centre in Manchester - one of Europe's largest shopping centres. The teams must select ranges of clothing from some of London's most up-and-coming designers, and are tasked with charming the fashionistas to allow them to represent their brand at retail. Under the ever-watchful eyes of Nick and Karren, the teams swap their business suits for some cool clobber and use every trick in the book to market and promote their stores. In the boardroom, one candidate on the losing team faces a serious dressing-down from Lord Sugar, who is in an unforgiving mood.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 187245,
                    "name": "Advertising",
                    "overview": "The battle to become Lord Sugar's next apprentice intensifies as the remaining candidates reach the series' half-way mark. After a rude awakening from the boss, the candidates are set to work creating branding and advertising for a new multi-purpose household cleaner. The teams are tasked with producing a spotless TV and radio advertising campaign, and try to clean up when they pitch to ad agency heads and industry experts. As Nick and Karren look on, the campaigns cause raised eyebrows as some of the candidates lose focus. It gets messy in the boardroom, as Lord Sugar wipes the floor with the losing team. Another of this year's prospects discovers it's the end of the road as Lord Sugar sends them packing with the words 'You're Fired'.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-17",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 187246,
                    "name": "Dvd",
                    "overview": "The remaining candidates head to Pinewood film studios in Buckinghamshire, where they are challenged to create personal movie experiences that give consumers a chance to star in their own feature films. Both teams stretch their creative muscles and put together car races, rollercoaster rides and encounters with sharks, before visiting Westfield shopping centre in London to promote their creations to the public.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-24",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 187241,
                    "name": "Crisps",
                    "overview": "The teams must represent British crisp companies hoping to break into the German market.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-01",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 187242,
                    "name": "Discount Buying",
                    "overview": "Alan Sugar summons the seven remaining candidates in the heart of the City and challenges them to purchase a series of unusual items at bargain prices. The teams are split into boys and girls as Karren Brady and Nick Hewer oversee their efforts to find the best deals.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-08",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 187243,
                    "name": "London Tours",
                    "overview": "Alan Sugar challenges the remaining candidates to set up their London tour company and provide open-top bus excursions for tourists. The budding entrepreneurs also have to map out walking routes to show visitors a lesser known side of the capital, and bid for a potentially lucrative deal with a travel agency.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-09",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 187244,
                    "name": "The Final Five",
                    "overview": "As the series draws to a close and tension mounts, this programme profiles the remaining five candidates, revealing the true stories behind their super-confident egos.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-15",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 187253,
                    "name": "Interviews",
                    "overview": "Lord Sugar's search for an apprentice reaches its penultimate week, and the five remaining candidates face a different type of challenge: they each have to face a gruelling interview process on their own. There is nowhere to hide as they are grilled by four of Lord Sugar's trusted business colleagues, one of whom is a very familiar face. These advisors then feed their opinions back to Lord Sugar, and three candidates are fired in the boardroom as he decides who is worthy of a place in the final.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-19",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 187254,
                    "name": "The Final",
                    "overview": "The two remaining candidates are challenged to launch a new high-quality alcoholic beverage in front of an audience of industry experts - before Alan Sugar reveals who he has chosen to work alongside him in a job with a six-figure salary.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-19",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 187256,
                    "name": "You're Hired",
                    "overview": "The two remaining candidates are challenged to launch a new high-quality alcoholic beverage in front of an audience of industry experts - before Alan Sugar reveals who he has chosen to work alongside him in a job with a six-figure salary.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-16",
                    "episode_number": 15,
                    "episode_type": "finale",
                    "id": 187255,
                    "name": "Why I Fired Them",
                    "overview": "Lord Sugar looks back on the unsuccessful candidates in the 2010 series. From making sausages and selling clothes to creating a character for a brand new cleaning product, this year's budding businessmen and women have been tested to destruction. Reliving their worst decisions, Lord Sugar reveals how, each week, he decided who would hear his famous phrase: \"You're fired\".",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 6",
            "overview": "Series Six of The Apprentice was a British reality television series. The series started on BBC One on 6 October 2010 and ran for twelve weekly hour-long episodes, as in all previous years. Following a web-based application, regional auditions and interviews took place during July 2009 in London, Glasgow, Manchester and Birmingham, about 75 candidates were called back for a second round in London and shooting took place in Autumn 2009. There are sixteen participants and the board consists of Alan Sugar, Nick Hewer and Karren Brady. The programme formerly featured Margaret Mountford, who stood down from the role in June 2009. However, she made a guest appearance in Week 11 as an Interviewer.\n\nThe series was won by Stella English, a 30-year-old investment banker from London. After winning, English worked at Sugar's company Viglen. Sugar subsequently gave her a new job at YouView in May 2011, after she complained of being \"just a glorified PA\" in her original position. English resigned from YouView in October 2011, leaving Sugar's employment altogether, claiming that she had had virtually no contact with Sugar in her role. Previous series had begun in March but the 2010 series was postponed until the autumn by the BBC to avoid any issues regarding the general election and Lord Sugar's ties to the then government.",
            "id": 7847,
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "_id": "525739bd19c29531db01c84e",
            "air_date": "2011-05-10",
            "episodes": [
                {
                    "air_date": "2011-05-10",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 187278,
                    "name": "£250 Business Start Up",
                    "overview": "The stakes are raised higher than ever in this series of The Apprentice, as this time there is no six-figure salary job on offer. Instead, the sixteen candidates are vying for one life changing opportunity: £250,000 investment to start their own company, with Lord Sugar as their business partner. Lord Sugar wastes no time showing the candidates he means business, using the first task to challenge his potential partners' entrepreneurial skills. Each team are given £250 to invest in fresh fruit and vegetables, and Lord Sugar makes it clear that he expects a high return. Packed off to New Covent Garden Market, the teams race to buy the best produce at the cheapest price and set to work adding value to their haul by making juices, fruit salads and soups, and pasta to tempt London's hungry workforce. With the pressure on to exploit both the lucrative breakfast and lunch trade, it's not long before the tension rises and the blame game begins.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-11",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 187279,
                    "name": "Mobile Phone Application",
                    "overview": "An early morning delivery sends the candidates into the fast-paced world of technology. Lord Sugar challenges the teams to think big and go global as they must design, launch and promote a new mobile phone application. In the battle for downloads, the teams must create a mobile app and pitch it to three influential technology websites to become 'App of the Day', as well as attempt to convince a huge crowd of bloggers and software experts at a major gaming fair to support the application and increase downloads. With their apps downloadable for 24 hours, a dramatic result leads to a fierce boardroom battle, and one more candidate faces Lord Sugar's immortal words: 'You're fired'.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-18",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 187281,
                    "name": "Discount Buying for the Savoy",
                    "overview": "The candidates are called to meet Lord Sugar at London's famous Savoy Hotel to be briefed on their next task. Following a 220 million pound refurbishment, the hotel requires a number of last-minute items prior to its grand reopening. The business hopefuls have nine hours to source ten products, and their powers of negotiation are pushed to the limit as they attempt to track down everything on the hotel's unusual shopping list and purchase them at the lowest possible price. Nick and Karren watch on as the candidates get increasingly desperate in their attempts to find quality items at bargain prices. With the deadline looming, tension reaches fever pitch as last-minute deals are struck. Both teams are faced with a dash to the Savoy to have their purchases inspected by the scrupulous eye of the hotel's general manager. Missing or incorrect items are subject to penalty fines, and this leads to a dramatic result in the boardroom.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-25",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 187280,
                    "name": "Beauty Treatments",
                    "overview": "Lord Sugar gathers the candidates under the statue of Aphrodite at the British Museum, and reveals their next task: to set-up beauty treatment businesses in Birmingham. At the briefing, he re-balances the teams and personally appoints the project managers. The British beauty industry is worth 14 billion pounds annually, with the best margins in hands-on treatments, so Lord Sugar demands both teams offer these and sell cosmetic products off the back of them. After a choice of professional treatments have been offered to the teams, followed by a short wrangle over total body spray tan, the teams choose two treatments each and get down to some hands-on training. But one of the boys feels that touchy-feely beauty challenges his masculinity, and could worry his girlfriend. Under the watchful eye of Nick and Karren, the teams take their choices to Birmingham. One team goes for the city centre, while the other chooses an out-of-town mall.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-01",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 187282,
                    "name": "Create, Brand and Launch a Pet Food",
                    "overview": "In a pre-recorded briefing via a giant screen flanked by Karren and Nick, Lord Sugar has called the candidates to an advertising agency. Their task will be to create, brand and pitch a new pet food. But before they start Nick has a message from the boss - once again he picks the team leaders. One team chooses dogs, the other cats. Both teams split - one half to Lincolnshire to create the food, the other half staying at the agency to name and brand the product. Supported by Britain's biggest pet food manufacturer it looks like a breeze, but soon the teams are making some fateful decisions, sweeping aside advice from pet-loving focus groups and inventing product names so leftfield that even teammates can't understand them. Professional packaging for their products restores confidence momentarily, but the next job - to make commercials - plunges the teams into more confusion as they try to get creative.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-08",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 187284,
                    "name": "Rubbish",
                    "overview": "Alan Sugar calls the candidates to a rubbish dump, and challenges them to form junk-collection businesses. One half of each team has to haul the rubbish themselves while the others offer quotes on big clearances. Profits prove hard to come by with Cockney scrap dealers and quick-witted builders giving them a run for their money, and one project manager is reduced to tears by the grueling work.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-15",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 187283,
                    "name": "Freemium Magazine Launch",
                    "overview": "The teams are called to gleaming offices in Fleet Street, home to London's oldest newspaper district. Lord Sugar informs the candidates they'll be creating and publishing a free magazine. But first he shuffles the teams, appointing the project managers. Free magazines earn money by selling advertising, but advertisers only buy space in titles with a surefire market. As such, the teams must choose a hit subject, produce appropriate editorial content and convince advertisers they will reach a big audience. As Karren keeps notes, one team is led downmarket by their editor with a low-brow lads' magazine. The other team, accompanied by 67-year old Nick, goes for the oldies market, and on the way comes up with some patronising names (causing raised eyebrows from Nick!). But despite some research with sprightly over-sixties, it soon descends into stereotypes. Karren winces as the lads' mag embraces innuendo and photoshoots get racy.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-22",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 187285,
                    "name": "Paris",
                    "overview": "The venue for the candidates' latest briefing is St Pancras International. With the next Eurostar about to leave, there is just time for Lord Sugar to brief and re-balance the personnel, and then it's off to Paris for half of each team. The others must stay back and choose some new British designs to sell to the French. It is a classic export task, with Lord Sugar on the lookout for proven ability to do business abroad. While the candidates in Paris arrange sales appointments for tomorrow, the London-based groups are treated to quirky products by entrepeneurs wanting a slice of the French market. There's everything from toys to top-end bikes. It is immediately clear that some of Lord Sugar's budding business partners know very little about the French, and even less about what they will buy. To help, he sets them up with a major French retailer, but the teams must fix all the other pitches. Street-based research gets lost in translation.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-29",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 187287,
                    "name": "Biscuit",
                    "overview": "The candidates are enjoying their day off when Lord Sugar turns up at the door. Suddenly it's down to work after he tells them to make, brand and pitch a new type of upmarket biscuit. Project managers get picked (in one case reluctantly) and then it's time for the teams to split up, with half off to a biscuit development lab in Swansea. The teams have two days to get the baking done and packaging designed. In Wales there are sharp elbows in evidence in one team as two of the candidates vie to get their idea made, whilst the other team goes straight for an after-school treat. The ultra-competitive team's focus group munches its way through lots of crunchy offers without a favourite emerging. No-one likes ideas suggested by fellow team members and in the end the decision is a compromise. On the other team, the branding for kids ends up losing precision and no-one can understand its selling point. Hard work in the development lab produces professional looking biscuits.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-06",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 187286,
                    "name": "Flip It",
                    "overview": "Called to a north London wholesale warehouse, the teams are met by a nostalgic Lord Sugar, who tells the teams that it was from places like this that he started out buying low to sell high. He gives both teams a pallet carrying 250 pounds' worth of wholesale goods. They must find out what sells best, then re-invest in those products. It is a simple exercise in following the money and increasing sales. The pallets contain cheap nodding dogs, pricey pressure washers, duvet sets, cut-price sunglasses, brollies, watches and more. The prospects for the task look good, and there are quick volunteers for the team leader roles. They have the whole of London to sell to: street markets, houses door-to-door, offices and maps to help find more. The trick is to match the products to the potential market, but some get it badly wrong, taking tacky stuff to snobby areas, or high-priced goods to East End pound shops. For some selling comes naturally, but for others it's a humiliating struggle.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-07",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 187288,
                    "name": "The Final Five",
                    "overview": "As this year's series of The Apprentice draws to a close and the tension mounts, this programme profiles the remaining five candidates. Revealing the true stories behind their super-confident egos, we discover what really makes these budding business men and women tick. Family, friends and former bosses, along with Lord Sugar's trusted aides Nick Hewer and Karren Brady, discuss the strengths and weaknesses of the final five personalities as they vie for the prize of a quarter-million pound investment and a partnership with Lord Sugar.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-13",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 187289,
                    "name": "Fast Food Chain",
                    "overview": "At a shopping mall in the City of London, Lord Sugar points out to the teams the wide range of successful fast-food chains and tells them to invent their own outlet, develop a unique cuisine, open it to the public and pitch the concept to him and experts from the fast-food industry. The teams get two brand new sites in the centre of the West End to turn into protoype fast-food outlets. One team goes for Mexican meals, the other for British pie and mash. Both teams split - one half to cook, the other to make the branding match the concept. The Mexican restaurant gets called Caracas because it sounds like maracas, while the pies get named after historic Britains; except that, once the branding has been done, Nick casts doubt on the British credentials of Christopher Columbus.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-15",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 187290,
                    "name": "How To Get Hired",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-17",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 187291,
                    "name": "Interviews",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-17",
                    "episode_number": 15,
                    "episode_type": "finale",
                    "id": 187292,
                    "name": "The Final",
                    "overview": "After eleven tasks, it's finally time for Lord Sugar to choose his business partner. The four finalists each have to face a gruelling interview process on their own. There is nowhere to hide as each of them is grilled by four of Lord Sugar's trusted business colleagues and advisors. Each candidate will also have their business ideas tested to destruction, as their plans for their business with Lord Sugar are put under the microscope. It's the ultimate test of character, as every aspect of their personal and professional lives is scrutinised and judged by the influential interviewers. After they have made their assessments, Lord Sugar's four advisors feed back their opinions and explain their verdicts to him in the boardroom. As the candidates take their turn to plead their case, three will have their dreams shattered as Lord Sugar delivers his final ruling on who will become his business partner.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 7",
            "overview": "Series Seven of The Apprentice was a British reality television series. The series started on BBC One on 10 May 2011, and ran for 12 hour-long weekly episodes, as in all previous years. However, Episode 1 and 2 were aired the same week, and the final episode four days after the penultimate.\n\nThe winner was Tom Pellereau, with Helen Milligan as the runner-up.\n\nPellereau holds the record of least successful winner of The Apprentice, losing eight tasks out of eleven. He is the only winner to have never won as project manager He is also the only winner to have only been project manager once during the series, as well as the first winner to have won fewer tasks than the runner-up Runner-up Helen Milligan won ten out of eleven tasks.\n\nThere were sixteen participants and the board consists of Alan Sugar, Nick Hewer and Karren Brady. The Apprentice: You're Fired! also returned on BBC Two, featuring Dara Ó Briain, who reprises his role of the interviewer of the fired candidate.",
            "id": 7849,
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        "8": {
            "_id": "525739bd19c29531db01c859",
            "air_date": "2012-03-21",
            "episodes": [
                {
                    "air_date": "2012-03-21",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 187293,
                    "name": "Week 1 - Blank Canvas",
                    "overview": "Sixteen candidates begin their fight for one-life changing opportunity - a quarter of a million pounds to start up a business with Lord Sugar as their partner. In the first task, the boys compete against the girls. Each team must buy blank goods, add value by printing a design onto them and then sell them from stalls on the streets of London. It is a test of the candidates' creativity, marketing and salesmanship.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-28",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 187294,
                    "name": "Week 2 - Household Gadget",
                    "overview": "Lord Sugar calls the teams to the Victoria and Albert Museum. Their task is to invent a new household gadget, create a prototype and pitch for orders to some of the country's biggest retailers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-04",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 187296,
                    "name": "Week 3 - Condiments",
                    "overview": "Lord Sugar decides to mix up the teams for the third task, which is to come up with a new condiment; one team goes for a Mediterranean-style ketchup, and the other a chilli chutney. Half of each team head to a condiment factory in Essex to make their product while the others stay in London to design brands and set up sales appointments.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-11",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 187295,
                    "name": "Week 4 - Junk Shops",
                    "overview": "Lord Sugar asks the teams to set up second-hand shops in London's fashionable East End, home to a thriving market in retro and refurbished household goods. The teams must source second-hand stock from auctions, junk shops and car boot sales, and resell at a profit during a one-day-sale from their respective shops.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-18",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 187297,
                    "name": "Week 5 - Keep Fit",
                    "overview": "Lord Sugar turns the candidates' attentions towards the highly profitable keep fit industry. The teams have two days to devise and brand a new fitness class that reflects recent popular trends like Zumba or Body Pump, which attract gym members to classes in big numbers. They must then pitch their routines to leading health and fitness chains, who will pay for the rights to run them if they like what they see.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-25",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 187299,
                    "name": "Week 6 - Street Food",
                    "overview": "It is week six, and Lord Sugar sends the candidates to Scotland, where they must make gourmet grub and sell it on the streets of Edinburgh. The teams decide on Italian meatballs and Scottish stew, but before heading north there is a spot of market research at one of London's fancy street food fairs. It is clear from what is served up that there is more to this business than dishing up a burger and chips.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-02",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 187298,
                    "name": "Week 7 - Flip It in Essex",
                    "overview": "The teams are called to a warehouse in Essex; Lord Sugar tells the candidates that this is how he started out, buying wholesale goods and selling them on for a profit. Both teams are given 150 pounds to spend on products of their choice, with Essex as their selling ground. Products are purchased and hopes for big profits are pinned on a collection of mops, MP3 players, fake tan and false eyelashes.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-09",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 187300,
                    "name": "Week 8 - Street Art",
                    "overview": "The eighth task starts with an early morning trip to Waterloo Station, but the teams are not going anywhere; underneath the railway arches is a big screen with a message from Lord Sugar. He tells the teams to take a look around; they are surrounded by graffiti, and this is what they will be selling next. The teams have one day to meet and convince up-and-coming urban artists that they are the right team to represent them in a one-off gallery sale.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-16",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 187301,
                    "name": "Week 9 - English Bubbles",
                    "overview": "The longest champagne bar in Europe at St Pancras International is the venue chosen by Lord Sugar to launch the latest task. But he is not buying the teams bubbly; he is setting them the challenge of raising awareness of English sparkling wine, which rivals champagne in quality, but not in market dominance. It is a real issue for the industry - can the teams devise a brand and identity for the British product to compete with cava, prosecco and champagne? Their marketing campaigns will be judged on merit by discerning wine industry experts.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-23",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 187302,
                    "name": "Week 10 - Discount Dealing",
                    "overview": "The candidates are called to meet Lord Sugar on a rooftop overlooking the City of London, where countless financial deals are done on a daily basis. For one day only, the teams will be representing an online daily deals website that offers Londoners exclusive deals in hotel stays, beauty treatments, posh dinners and premium products. It is a test in the teams' negotiation skills; they must strike the right deal, get a good discount and deliver their offers to the website by 7pm that evening. Nick and Karren watch on as the teams get increasingly desperate in their attempts to secure quality deals at the right price. Businesses are bemused as candidates try to negotiate offers on everything from candles and teeth whitening to five-star meals and fish pedicures.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-29",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 187303,
                    "name": "The Final Five",
                    "overview": "The candidates give their assessment of their personal triumphs and failures and the lessons they have learned during the process. Not to mention the bitching, backstabbing and the blame games they have had to overcome to get this far. The programme investigates the five contenders' family backgrounds and reveals more of their characters as friends and family talk about the childhood, upbringing and personality traits that have shaped the final five into who they are today. Nick Hewer and Karren Brady share their thoughts on the candidates' performance thus far and assess the strengths and weaknesses of each individual, explaining what qualities they believe Lord Sugar sees in the final five.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-30",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 187304,
                    "name": "Week 11 - Affordable Luxury",
                    "overview": "Lord Sugar calls the teams to Burlington Arcade, a luxury shopping centre in London's West End. He spells out that in the current economic climate Britain still has a taste for the finer things in life, but they should come with an affordable price tag. He reveals that the candidates' latest task is to consider affordable luxury retail markets and come up with a new product range.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-06-02",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 187305,
                    "name": "Why I Fired Them",
                    "overview": "They knew they had to impress Britain's toughest boss. If they failed, they'd get the chop. 16 hopefuls went into battle for Lord Sugar's £250,000 investment. Now, he explains how some candidates lost the plot completely and others survived by the skin of their teeth.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-06-03",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 187307,
                    "name": "Week 12 - The Final - Interviews",
                    "overview": "The final episode of this series sees Lord Sugar name his business partner. The final four candidates are called to the Institute of Directors in the City, where Lord Sugar asks them to pitch their business concepts to him right there on the spot. Then it is down to business with Margaret Mountford, Mike Soutar, Matthew Riley and tough-talking Claude Littner.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 8",
            "overview": "Series Eight of The Apprentice was a British reality television series. The series started on BBC One on 21 March 2012, and ran for 12 weeks, with each episode lasting an hour. The series was won on 3 June 2012 by Ricky Martin, with Tom Gearing as runner-up. Nick Holzherr came in third place, and Jade Nash in fourth place.",
            "id": 7850,
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        },
        "9": {
            "_id": "525739bd19c29531db01c864",
            "air_date": "2013-05-07",
            "episodes": [
                {
                    "air_date": "2013-05-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 187308,
                    "name": "Week 1: Container",
                    "overview": "Week 1: Container is the first episode of the reality television series The Apprentice (UK) - Season 9.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-05-08",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 187309,
                    "name": "Week 2: Beer",
                    "overview": "Week 2: Beer is the second episode of the reality television series The Apprentice (UK) - Season 9.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-05-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 187319,
                    "name": "Flat-Pack",
                    "overview": "The candidates must come up with a unique piece of flat-pack furniture, before producing prototypes and pitching their products to retailers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-05-22",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 187310,
                    "name": "Farm Shop",
                    "overview": "The fight for Lord Sugar's £250,000 investment continues with farmyard fun, as this task sees the candidates open their own farm shops. The hopefuls swap their high heels and city brogues for wellies as they set off to source stock from farms across the South East. One team decides to specialize in pricey buffalo produce, while the others try to churn a profit from premium milk. The teams divide to search the Home Counties for farm fresh produce, but some are left high and dry when they are sent shopping on a shoestring; and there is trouble for others as they find out - with minutes to spare - that stock levels are dangerously low. On sales day, the candidates set up shop in trendy east London; one team finds their takeaway's soups and spuds tricky to shift, while the other team finds there is an appetite for milkshakes. One candidate takes a gamble by using the task to prove their business idea for Lord Sugar works. In the boardroom, even the winning team gets a telling off.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-05-28",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 187312,
                    "name": "Dubai",
                    "overview": "The candidates face an early start, as a pre-dawn call informs them that they are off on a business trip to Dubai. Bags are quickly packed, and then the teams are straight off to Gatwick and the UAE. In the almost-finished foyer of a new multi-million pound hotel, the candidates discover their task: find and secure items needed for the hotel at the lowest possible prices. One team tries to use local knowledge to their advantage by scouring the souks for bargains, while others want to track down items fast and they head for a mega mall. But in the heat of Dubai, it's not long before the candidates start to sweat; mistakes with measurements leave one team with a big problem, while waiting time costs others dearly. Negotiation skills are pushed to the limit, and identifying the items proves tricky as some of the candidates get lost in translation.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-06-05",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 187320,
                    "name": "Away Day",
                    "overview": "Called to Guildhall in the City of London, the candidates are given their latest task: putting on a corporate away day for two major clients. With a budget of 5,000 pounds, they must put on a team building event for a day, but the fun and games start early when one team spends so much time thinking through themes that they are late to meet their client. The teams set off in search of food and activities, but by mid-afternoon panic sets in for some as they realise they don't have enough to fill the day, and they wrestle with whether to make a last minute booking that could prove risky. The next day, the teams must put on their events; one decides on an army theme, but they come under fire when the rain sets in.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-06-12",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 187315,
                    "name": "Caravans",
                    "overview": "The candidates are called to the Tower of London, where Lord Sugar tells them that their latest task is to sell products at the Motorhome and Caravan Show, and they are left with no doubt that he expects them all to impress. Half head off to test drive camping accessories and win over suppliers, but when both teams choose the same products, there is disappointment in store for some. Both project managers head straight to the show to select a high ticket item worth thousands, but matching products to punters proves a tricky task and piles on the pressure for both teams. On sales day, the teams divide, with half pushing must-have accessories, from electric bikes to rooftop boats, while the rest try to pull off showstopping sales of top end trailers. With high end products topping out at £17,000, every minute counts in the last minute push for a winning sale.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-06-19",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 187314,
                    "name": "Online Dating",
                    "overview": "There is love is in the air this week as the candidates are called to London's busiest registry office in Marylebone Town Hall.They learn that this week's task is to come up with a new online dating concept backed up by an original advertising campaign. One of the candidates from the losing team is fired by Lord Sugar at the end of the show.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-06-26",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 187317,
                    "name": "Ready Meals",
                    "overview": "The candidates are called to the restaurant at the top of the Gherkin in London, where they learn that their latest task is to create and brand their own ready meal. At the end of the show one of the candidates from the losing team is fired by Lord Sugar.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-03",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 187311,
                    "name": "Stall to Shop",
                    "overview": "The candidates receive an early morning call, telling them to gather in the sitting room of their London townhouse. Still in their pyjamas, the teams are briefed on this week's task: to grow a business from scratch in 48 hours. Starting with £150, they must source stock for a market stall, then buy more of their best sellers, before opening shops the next day. Before sending them off, Lord Sugar mixes the teams up and decides that, for this task, the boys should compete against the girls. After deciding what to sell, they head straight out to source stock. One team settles on fashion, while the rest plump for homeware - but while some get off to a flying start, others lag behind. Stock sorted, the teams get selling from their stalls. Will their chosen stock fly off the shelves? The next day the teams sell from shops built from converted shipping containers in London's trendy Shoreditch.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-08",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 966499,
                    "name": "The Final Five",
                    "overview": "As this series of The Apprentice draws to a close and the tension mounts, this programme profiles the remaining five candidates.\n\nRevealing the true stories behind the super confident egos, we discover what really makes these budding business men and women tick.\n\nParents, friends and employees, along with Lord Sugar's trusted aides Nick Hewer and Karren Brady, discuss the strengths and weaknesses of the final five personalities, and look back over their journey in the process. Plus we hear from their fans back home, and find out just who are the Final Five.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-10",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 966500,
                    "name": "Interviews",
                    "overview": "The candidates receive an early morning phone call from Lord Sugar, who tells them they have 24 hours to brush up on their business plans, before being interviewed by four of his trusted advisors.\n\nThe next day, business plans in hand, it's off to the Institute of Directors. Lord Sugar explains that his advisors will be scrutinizing their plans and credentials, before feeding back to him.\n\nThe nerves kick in straight away for the Final Five, as the anxious candidates are called in one by one to meet Lord Sugar's hand-picked hit-squad.\n\nArmed with CVs and business plans, the advisors waste no time in taking the candidates to task. Egos are attacked, book-cooking uncovered, and personalities pulverised. There are anxious moments for some, and extraordinary things uncovered as the candidates are pushed to the limit.\n\nIn an emotional boardroom, Lord Sugar receives some surprising news, and someone feels the full force of his fury, before a shock exit leaves everyone open-mouthed.\n\nIn the fight to make the final, dreams come crashing down. Only two can make the grade, as the rest all kiss the investment goodbye as they hear the words 'You're fired!'.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-11",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 966501,
                    "name": "Why I Fired Them",
                    "overview": "With Lord Sugar on the cusp of choosing his new business partner, this programme provides a chance to look back on the candidates who fell before the final hurdle, and the tasks that tested them to the limit.\n\nFrom making beer and selling caravans to thinking up an online dating concept, this year's budding business partners have been pushed to breaking point. Lord Sugar takes us through the best, and worst, decisions made by this year's candidates, and explains how each week he decided who would hear the fateful phrase 'You're fired!'.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-17",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 187313,
                    "name": "The Final and You're Hired",
                    "overview": "With just two candidates left battling it out for the £250,000 investment, the finalists receive a call telling them to travel to events venue One Marylebone. There they are met by Lord Sugar, who informs them that their final task is launch their businesses. They must come up with brands and launch campaigns before unveiling them at an event. There is a race to recruit old candidates as the finalists build their teams; the next day, it is straight down to business building brands. There's trouble in store for one candidate when their chosen name proves unpopular with the public, and others see red over what colours to use in their logo. As the finalists fight it out, there are surprises in store and anxiety abounds.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 9",
            "overview": "Series Nine of The Apprentice is a British reality television series. The series began on BBC One on 7 May 2013.\n\nOn 8 July 2013, an episode called The Final Five aired, which profiled the remaining five candidates. On 11 July 2013, an episode called Why I Fired Them aired where Lord Sugar explains how the candidates fared and why he fired each candidate.\n\nThe series was won by Leah Totton.",
            "id": 7851,
            "poster_path": null,
            "season_number": 9,
            "vote_average": 0
        },
        "10": {
            "_id": "561efc24c3a3680e200014fa",
            "air_date": "2014-10-14",
            "episodes": [
                {
                    "air_date": "2014-10-14",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1117968,
                    "name": "Ten Years of Selling",
                    "overview": "The battle to become Lord Sugar's next business partner begins with a selling task.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/gjri2aykJCRbjkvpf79s0JcKp6X.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-15",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1117969,
                    "name": "Wearable Technology",
                    "overview": "The candidates are asked to design a piece of wearable technology.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/1gjhrilKj4NQ2JeCVOH1NAhcnRT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-22",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1117970,
                    "name": "Home Fragrance",
                    "overview": "Each team must create their own range of home fragrance products.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/y2M0mNWayl2MuwrhBXdI24I5oaM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-29",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1117971,
                    "name": "Online Video Channel",
                    "overview": "The candidates are set a 21st-century task - creating video channels for YouTube.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/rgWbGkr5q0Nny35WggMXkFkPM4a.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-05",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1117972,
                    "name": "Coach Tours",
                    "overview": "The teams have two days to create their very own coach tours.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/bpAqj5pUUZAvJLqR8Cw2JWEATYe.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1117973,
                    "name": "Board Game",
                    "overview": "Lord Sugar asks the candidates to design a brand new board game.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/w08d3yqUQHCcqzsFEx873XZcP5A.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-19",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1117974,
                    "name": "Advertising - New York",
                    "overview": "Lord Sugar asks the candidates to come up with an advertising campaign for a soft drink.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/8UBa4MW1VRQhKWQzlOMlVdsEDlk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-26",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1117975,
                    "name": "Country Show",
                    "overview": "The candidates attempt to crack the rural market at the Royal Bath and West show.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/x5QJAqPbP0Uj0viC4WGb9ngFFTQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-03",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1117976,
                    "name": "Ten Years of Discount Buying",
                    "overview": "Lord Sugar tells the candidates that he wants to test their negotiation skills.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/faCuPsR5ItATzJuNC0g8Onrh6yJ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-10",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1117977,
                    "name": "Premium Pudding",
                    "overview": "The candidates are asked to create a brand new range of premium puddings.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/aZfoQ4YlIHBfepQFFHKYwiImM8g.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-16",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1117978,
                    "name": "The Final Five",
                    "overview": "As the tenth series draws to a close, this programme profiles the remaining candidates.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/83lq4q4YbPi87wiPAEv3Lyf2uSL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-17",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1117979,
                    "name": "Interviews",
                    "overview": "The remaining candidates are interviewed by four of Lord Sugar's trusted advisers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/hC6a3WZIHFShSePaDSGSqDIp24M.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-18",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1117980,
                    "name": "Why I Fired Them",
                    "overview": "Lord Sugar takes a look back at the candidates who fell before the final hurdle.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/d0Up56EKouyQDrkDnpZ57bdrYWz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-21",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 1117981,
                    "name": "The Final and You're Hired",
                    "overview": "The two finalists must launch their businesses with the help of some former candidates.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 10,
                    "show_id": 2472,
                    "still_path": "/qe7dPRCvoyK81nKEkQYu0F5BK6O.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 10",
            "overview": "",
            "id": 71374,
            "poster_path": null,
            "season_number": 10,
            "vote_average": 0
        },
        "11": {
            "_id": "561ea25292514171da00070e",
            "air_date": "2015-10-14",
            "episodes": [
                {
                    "air_date": "2015-10-14",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1117893,
                    "name": "Fish Food",
                    "overview": "Ambitious entrepreneurs start their fight for a life-changing investment.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": "/xqT6ifhKBE6m3G9iGotw0jYpo6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-15",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1117966,
                    "name": "Advertising - Cactus Shampoo",
                    "overview": "The candidates must create a new shampoo brand and design an advertising campaign for it.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": "/pM575fnZk3zC27sbuflqrK93VXQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1117967,
                    "name": "Cross-Channel Discount Buying",
                    "overview": "The candidates must find nine items and negotiate the best possible price.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": "/5yz5hw8M4RlD5sA3a4J9hnROatI.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-28",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1131863,
                    "name": "Pet Show",
                    "overview": "The candidates try to tap into one of the UK's biggest markets - pet products.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-04",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2609703,
                    "name": "Children's Book",
                    "overview": "Each team is tasked with creating their own children's book, including a written and audio version, and selling their creations to retailers around London. Connexus create a story around a dragon character, but face issues from an indecisive leader, rushed production on the audio version, and poor salespeople, alongside concerns the literature of their creation is too complex for the task's specified age group. Versatile create a story around a bee character, managing efficient production of both versions, receiving good feedback on their creation and good sales from retailers, despite friction between some members of the team.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-11",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2609741,
                    "name": "Handy Man",
                    "overview": "Each team is tasked with running their own DIY business, securing work around London alongside one of two contracts arranged by Lord Sugar.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-18",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2609743,
                    "name": "Discount Store",
                    "overview": "Both teams are tasked with running their own discount shop within a shopping mall in Manchester",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-25",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2609742,
                    "name": "Party Planning",
                    "overview": "Both teams become party planners, creating a fun-filled children's party for their respective client, using their £2,000 budget to arrange food, events and gifts",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-02",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2609745,
                    "name": "Property Agents",
                    "overview": "Teams become property agents, as each handle the sale of new, under development mid and high-end properties around London, making commissions on successful sales",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-09",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2609748,
                    "name": "Health Snack",
                    "overview": "Healthy eating is the basis of the next task, as each team comes up with a brand new range of healthy snacks, pitching their creations to retailers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-09",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2609751,
                    "name": "The Final Five",
                    "overview": "As this year's series of The Apprentice draws closer to its finale, this special episode takes a look at profiling the true story behind the five remaining candidates. Discussing their backgrounds, experiences, personality, and strengths and weaknesses, are a selection of each candidate's friends, family and colleagues, as well as Lord Sugar's aides, Claude Littner and Karren Brady.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-16",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 2609752,
                    "name": "Interviews",
                    "overview": "After facing ten tasks as teams, the five remaining candidates now compete as individuals in their next task – a series of tough, gruelling interviews with four of Lord Sugar's most trusted associates",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-16",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 2609769,
                    "name": "Why I fired them",
                    "overview": "As the  final looms, Lord Sugar takes a look back to the tasks he set for this year's series of The Apprentice. From an unexpected resignation and making disastrous health snacks, to shampoo branding and selling pet accessories, he relives all of the mistakes, doomed decisions, and other notable events that occurred during the process, and provides his reasons behind each firing he made amongst the candidates for the process, which ultimately whittle them down to the two finalists for this series.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-20",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 1148425,
                    "name": "The Final and You're Hired",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 11,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 11",
            "overview": "",
            "id": 71371,
            "poster_path": null,
            "season_number": 11,
            "vote_average": 0
        },
        "12": {
            "_id": "57f54d1a925141680c00061a",
            "air_date": "2016-10-06",
            "episodes": [
                {
                    "air_date": "2016-10-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1229312,
                    "name": "Collectables",
                    "overview": "A new group of candidates set off on their first task - selling collectables at Wimbledon Car Boot Sale.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-13",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1230624,
                    "name": "Advertising - Jeans",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-20",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1233010,
                    "name": "Corporate Candy",
                    "overview": "Lords Sugar sets the candidates a task in which they must design and manufacture their own brand of sweets, before heading to Brighton to sell them.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1234559,
                    "name": "Liberty's",
                    "overview": "The teams have to introduce a new product line to promote and sell in the world-famous department store, Liberty of London. They must also run a personal shopping service for some of London's most discerning shoppers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1236598,
                    "name": "Cycling Crowdfunding",
                    "overview": "Lord Sugar wants the candidates to help secure investment for someone else. They must help two entrepreneurs launch their new cycling product and get the public to invest through crowdfunding.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1238238,
                    "name": "Discount Buying",
                    "overview": "Lord Sugar sends the candidates out to work the night shift. They have to stay awake, find nine items, negotiate the best possible price and be back at the Shard by 6am. The team that spends the least amount of money will win the task.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-17",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1238239,
                    "name": "Boat Show",
                    "overview": "Lord Sugar instructs the candidates to tap into one of the UK's biggest markets - the boating and leisure industry. The task is simple, pick the right products and sell them at Poole Harbour Boat Show.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-24",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1242777,
                    "name": "London Landmarks",
                    "overview": "The candidates are summoned to the National Portrait Gallery, where Lord Sugar instructs them to organise an exclusive late-night event at two of London's biggest tourist attractions - the London Aquarium and Madame Tussauds. In under 36 hours, each team must organise and host an event to remember, keeping an eye on profits but also pleasing the punters. From setting up refreshments and entertainment to making sure they sell enough tickets to fill their venue, both teams have a challenge on their hands.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-01",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1244526,
                    "name": "Virtual Reality Game",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-08",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1245871,
                    "name": "Gin",
                    "overview": "As the teams move into week 10, the remaining candidates are summoned to the Old Royal Naval College in Greenwich. Here Lord Sugar sets them the task of creating and producing the spirit of the moment - gin. With the final in sight, the candidates are all desperate to impress. However, one team gets a little carried away with the taste testing, getting tipsy before the day has even begun, while on the other team, their pitches hit rock bottom when a key retailer reveals they don't like the colour, taste or branding of the gin. One candidate is left with a bitter taste in their mouth when the rest of the team turns against them, and tempers reach boiling point. Who will be fired?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-13",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1247316,
                    "name": "The Final Five",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-14",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1247633,
                    "name": "Interviews",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-15",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1247884,
                    "name": "Why I Fired Them",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-18",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 1247945,
                    "name": "The Final",
                    "overview": "The two finalists receive a call summoning them to London's City Hall. Lord Sugar informs them that their final task is to launch their business by creating a brand and unveiling their campaign in front of a packed audience full of industry experts. A few old faces return as the two finalists choose key colleagues to try to help them secure the £250,000 investment, and it is straight to work as they set out to build a brand, make a TV advert and create a company fit for Lord Sugar. In the boardroom, business plans are evaluated and ad campaigns are assessed, but there can only one winner. It is heartbreak for one and ecstasy for the other, as Lord Sugar finally picks his next business partner.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 12,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 12",
            "overview": "",
            "id": 80789,
            "poster_path": null,
            "season_number": 12,
            "vote_average": 0
        },
        "13": {
            "_id": "59d56849c3a36831dd000da1",
            "air_date": "2017-10-04",
            "episodes": [
                {
                    "air_date": "2017-10-04",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1375629,
                    "name": "Burgers",
                    "overview": "Alan Sugar begins another search for a business partner, challenging a new group of candidates to design and manufacture their own burgers to sell to the public in London. Chaos in the kitchen throws one team into disarray, while the other team wastes valuable time deciding how to label their product. Back in the boardroom, tensions rise as the candidates face Lord Sugar for the first time.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/poSpqi6d7w7gKCFEqrrBH5SdtyQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-11",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1375630,
                    "name": "Hotel Redesign",
                    "overview": "The candidates are summoned to Stoke Park, a five-star hotel in Buckinghamshire, where they learn that this week's challenge will see them working as interior designers. The contestants are tasked with transforming a bedroom at the hotel, before pitching their ideas to the hotel manager and a leading interior designer. However, both teams encounter troublesome DIY issues, and their concepts are picked apart during the daunting pitches. Back in the boardroom, Lord Sugar sends another contestant from the losing team home.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/98pwYIpGVY1lSceZQoe3sJyrtvT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-18",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1381482,
                    "name": "Robots",
                    "overview": "This week, Lord Sugar summons the contestants to London's new Design Museum, where the teams find out that they are to create, programme and sell a prototype robot. The boys team create a product targeting the over 60s market, but their patronising approach does not impress the retailers. Meanwhile, the girls opt for the children's market, but an appalling pitch sees their team in melt down.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/z8XFaQm3NILnC85IV1KjHRR1HEO.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-25",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1384637,
                    "name": "Stadium Sales",
                    "overview": "As the competition continues, Lord Sugar instructs the candidates that this week's task is to set up and run a corporate box, and sell merchandise to the masses at the Women's FA Cup Final at Wembley Stadium in London. The team members chosen to organise the boxes meet their match when they come face to face with the clients and their negative comments. The following day at the big game, guests in one of the corporate boxes are unhappy as supplies run dry, while those selling merchandise outside struggle with last minute pricing strategies.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/qBSyhZXgBgSos9VIbymQ3xJw4BB.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-11-01",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1384638,
                    "name": "Lord Sugar's Birthday",
                    "overview": "As Lord Sugar celebrates his 70th birthday, the contestants are tasked to a shopping spree across London to purchase items that mark milestones in his life and career. The candidates have one day to find nine specific items at the best possible price, before meeting at the House of Lords. For one team, there is confusion over the mystery object, while poor planning leaves the other team lagging behind. In the boardroom, Lord Sugar gives out warnings, as well as hefty fines, before sending one contestant home.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/Aij29SXTK7s5G6B32ESXhYfLzAP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-11-08",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1387841,
                    "name": "Bruges Tour",
                    "overview": "Alan Sugar sends the candidates off to Bruges to create a high-quality tour of the beautiful Belgian city that passengers would be happy to pay good money for. The teams also try to flog souvenirs to guests to top up their profit margins, but as they sell the tickets, there's jostling between candidates for sales and overpromising on what the tour groups will get, which could lead to major disappointment. The next day on the tours, facts are forgotten, candidates get their groups lost and, with time tight, one of them keeps cracking the whip on what's supposed to be a relaxed tourist experience.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/fSLXOMFLMt0hqfXJ8UklYlyyZKD.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-11-15",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1393212,
                    "name": "Advertising - Cars",
                    "overview": "Candidates have to create advertising campaigns for a new car in Essex, splitting into two teams - one half producing a television advert and the other creating a digital billboard advert. For one of the groups, a confusing car name and a strange choice of advertisement location causes them difficulty, while the others are led off course by a lack of direction. The finished campaigns are pitched to industry experts, before Lord Sugar eliminates one candidate from the competition.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/nb6dRPYkgC3xuUYqLMl8T7KgaDt.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-11-22",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1396113,
                    "name": "Doggy Business",
                    "overview": "Alan Sugar tasks the candidates with running their own doggy service business. Based at an established pooch-pampering venue, the teams must try to tempt discerning dog owners to part with their cash for services aimed at their four-legged friends. One team sets up a luxury doggy spa service, while the other struggles to make their dog obedience class profitable due to a haphazard pricing strategy and, back in the boardroom, another candidate's journey reaches an end.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/2mkWrylNTJJkX2u3raW7EB9FmaK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-11-29",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1396114,
                    "name": "Food Boxes",
                    "overview": "Lord Sugar tasks the candidates with cooking up a concept for a new recipe kit. Half-baked branding and kitchen nightmares result in sour pitches. Then in the boardroom, one candidate is toast.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/gghkD3oBikz9BArck6sJ2nWhCJn.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-12-06",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1399545,
                    "name": "Fashion Show",
                    "overview": "This week, Lord Sugar tasks the remaining contestants to become fashion agents, and sell a range of garments from up and coming designers. The teams have to select a designer, then plan and organise a catwalk show, as well as put together a magazine cover to amplify their sales campaign. Bad negotiations leave one team exposed, while the other team's magazine pitch does not go down well.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": "/malH8NiGn4eOklgtGzmDNe1mZqs.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-12-08",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1402807,
                    "name": "The Final Five",
                    "overview": "Profiles of the remaining candidates, delving into their backgrounds, as well as looking back over their journeys in the process so far.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-12-13",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1402808,
                    "name": "Interviews",
                    "overview": "This time, the final five candidates are summoned to Lord Sugar's newly refurbished offices in the City of London. There they are joined by some of Lord Sugar's closest associates, ready to put the candidates through their paces in a series of tough interviews, with each candidate going head to head with a business heavyweight in an attempt to prove their worth. There are tears, tantrums and turmoil, as confidence crumbles, egos are eradicated and business plans are pulverised, before heading back to the boardroom to face Lord Sugar once more.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-12-14",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1402809,
                    "name": "Why I Fired Them",
                    "overview": "Ahead of the final, Lord Sugar looks back on the tasks from this year's series and assesses the candidates' performances. The business tycoon also looks back on the boardroom bust-ups and goes through the best decisions made by the contestants, as well as the worst - including five-star hotel rooms painted in shades of trifle, modern cars in medieval villages and getting lost while showing paying customers around Bruges.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-12-17",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 1402810,
                    "name": "The Final",
                    "overview": "The two finalists take on their last challenge to win a coveted investment from Alan Sugar, with hand-picked teams of contestants from the series returning to aid them in their endeavours. They face a three-day challenge to create brands and adverts to pitch to a room full of experts - but a poor commercial and an uninspiring brand name do neither candidate any favours. Last in the series.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 13,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 13",
            "overview": "",
            "id": 93614,
            "poster_path": null,
            "season_number": 13,
            "vote_average": 0
        },
        "14": {
            "_id": "5bb306ca0e0a263e0200526c",
            "air_date": "2018-10-03",
            "episodes": [
                {
                    "air_date": "2018-10-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1583559,
                    "name": "Malta",
                    "overview": "The business-based reality show returns, with 16 candidates hoping to scoop a £250,000 investment from Alan Sugar. The multimillionaire sends the fresh batch of hopefuls to Valletta - capital city of Malta - for their first task, with his trusted advisers Karren Brady and Claude Littner following their every move. Their task is to bag nine Maltese items for the lowest possible prices before reuniting back at the airport. One team quickly hits the road, but they are clearly on the wrong scent, while fiery personality clashes over negotiations soon rock the boat on the other team.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": "/lOf3JwSqA4QzzhOlw9CB4J5e7bt.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1583560,
                    "name": "Comics",
                    "overview": "The candidates are challenged to create a brand-new comic aimed at children, before pitching their ideas to leading industry figures to secure orders. The task balances creative flair with productive pitching and the team that forgets either could face a graphic showdown in the boardroom. On the story teams, while one PM takes an assertive lead, the other's sub team leader seems to lose the plot. When creating their Augmented Reality front covers, the girls run riot, while the boys team struggles to make a move.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": "/mb1UamDehpzDG0CYS5AgrLdOfS2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1590525,
                    "name": "Doughnuts",
                    "overview": "Lord Sugar summons the candidates to an 18th-century tidal mill in the heart of London's East End. For the third task, the candidates must manufacture and sell upmarket doughnuts to both a corporate client and the public.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": "/phBHyyXRqTCDveinV8Mb50TxFdm.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1595666,
                    "name": "Bodybuilding Expo",
                    "overview": "The candidates are challenged to sell high-end products and services at one of the world's largest bodybuilding expos based at the NEC in Birmingham. The contestants clash over which team will get to sell top notch weights, and on the services side, the low-costs massages mean the team are hard pressed all day.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-31",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1609367,
                    "name": "Shoe Design",
                    "overview": "The candidates congregate at London’s Adelphi Theatre, home to hit musical Kinky Boots. Hot on their heels is Lord Sugar with a challenge for them to put their best foot forward in the world of ladies’ shoe design. Candidates must create and market a brand new shoe, along with putting together an event to launch and sell their product to major industry players.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-07",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1613951,
                    "name": "Airline Advertising",
                    "overview": "The candidates are summoned to London City Airport, where Lord Sugar sets them the task of devising a marketing campaign for a brand new budget airline. They need to come up with a distinctive brand, make a 30-second TV advert and design a uniform that flies the flag for their new airline.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1620668,
                    "name": "Urban Gardening",
                    "overview": "Lord Sugar summons the candidates to Crossrail’s leafy roof garden, nestled above the new Elizabeth Line station in Canary Wharf, where he sets them a gardening task. The teams must set up their own urban gardening business, carrying out commercial and domestic jobs across London. On day one, both PM teams visit corporate clients to pitch a plan and secure a price for a large rooftop renovation.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-21",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1625423,
                    "name": "Glasgow Art",
                    "overview": "Lord Sugar instructs the candidates to head north to Scotland, meeting at Kelvingrove Art Gallery and Museum in Glasgow, where they are tasked with becoming art dealers, selecting a contemporary artist’s work to sell at their very own gallery event. To top up takings, teams must also make merchandise adorned with their chosen artist’s work. The team that generates the most money from art commission and merchandise sales are the winners.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-28",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1630107,
                    "name": "TV Selling",
                    "overview": "Lord Sugar summons the remaining candidates to TV Centre in west London, the iconic former headquarters of the BBC. On arrival, the teams are tasked with their most pressurised challenge yet. In just ten hours they will be selling live to the nation on one of Britain’s leading TV shopping channels. Teams must tune in to the best products to sell, as well as direct a promo to boost sales of one of their items. The team that generates the most sales will win.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-05",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1636096,
                    "name": "Christmas Chocolate",
                    "overview": "Lord Sugar pays the six remaining candidates a flying visit, challenging them to cash in on the lucrative Christmas market.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-11",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1639537,
                    "name": "The Final Five",
                    "overview": "An in-depth look at the final five candadiates, featuring interviews from family, friends and loved ones, as well as Lord Sugar’s trusted aides Baroness Brady and Claude Littner.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-12",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1639954,
                    "name": "Interviews",
                    "overview": "The final five candidates face the scrutiny of Lord Sugar’s most trusted advisors, who are primed to put each of their business plans under the microscope.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-13",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1640690,
                    "name": "Why I Fired Them",
                    "overview": "Lord Sugar looks back at the candidates who fell before the final hurdle and the tasks that took them to the brink, with the help of some previously unseen boardroom moments.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-16",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 1643781,
                    "name": "The Final",
                    "overview": "Lord Sugar summons the finalists to the heart of London’s financial district to set them their final challenge in their attempt to win his £250,000 investment. For their last chance to convince Lord Sugar they are worthy of his cash, each finalist must launch their business. Invited back to aid the two finalists are some of this year’s fired candidates.\n\nIn an intensive three-day challenge, the finalists must create a new brand for their company, produce a digital screen for the London Underground and direct and edit a television advert before pitching to Lord Sugar and a room full of industry experts at London’s City Hall.\n\nBack in the boardroom, after 12 tough weeks, Lord Sugar declares who wins.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 14,
                    "show_id": 2472,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 14",
            "overview": "",
            "id": 110158,
            "poster_path": "/lqEMBrhiNauwoRGymQSiOacTk84.jpg",
            "season_number": 14,
            "vote_average": 0
        },
        "15": {
            "_id": "5d89b4c5c58acd00192ddbdc",
            "air_date": "2019-10-02",
            "episodes": [
                {
                    "air_date": "2019-10-02",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1937653,
                    "name": "South Africa",
                    "overview": "Lord Sugar kicks off the new series with a task like no other. Sixteen candidates are sent to South Africa to set up wine and safari tours.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/cC7YtfJTQr7XzubxL5ErAu55KjV.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdceb97f0feb8daf97928e",
                            "order": 501,
                            "adult": false,
                            "gender": 0,
                            "id": 4887155,
                            "known_for_department": "Acting",
                            "name": "Souleyman Bah",
                            "original_name": "Souleyman Bah",
                            "popularity": 0.001,
                            "profile_path": null
                        },
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdcf06fefafaeeed3edb33",
                            "order": 502,
                            "adult": false,
                            "gender": 0,
                            "id": 4887136,
                            "known_for_department": "Acting",
                            "name": "Ryan-Mark Parsons",
                            "original_name": "Ryan-Mark Parsons",
                            "popularity": 0.001,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2019-10-09",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1942215,
                    "name": "Ice Lollies",
                    "overview": "The teams are challenged to create, manufacture and sell their own ranges of ice lollies.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/aXb7jYz7ZoAMstwhOYgUwqryHLh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdceb97f0feb8daf97928e",
                            "order": 501,
                            "adult": false,
                            "gender": 0,
                            "id": 4887155,
                            "known_for_department": "Acting",
                            "name": "Souleyman Bah",
                            "original_name": "Souleyman Bah",
                            "popularity": 0.001,
                            "profile_path": null
                        },
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdcf06fefafaeeed3edb33",
                            "order": 502,
                            "adult": false,
                            "gender": 0,
                            "id": 4887136,
                            "known_for_department": "Acting",
                            "name": "Ryan-Mark Parsons",
                            "original_name": "Ryan-Mark Parsons",
                            "popularity": 0.001,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2019-10-16",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1944765,
                    "name": "Toys",
                    "overview": "The teams are sent back to school as Lord Sugar reveals that for this week’s task they will be creating a toy for 6-8-year-olds.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/erMgFMmtWUWqsEqmezOwN5kBx9g.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdceb97f0feb8daf97928e",
                            "order": 501,
                            "adult": false,
                            "gender": 0,
                            "id": 4887155,
                            "known_for_department": "Acting",
                            "name": "Souleyman Bah",
                            "original_name": "Souleyman Bah",
                            "popularity": 0.001,
                            "profile_path": null
                        },
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdcf06fefafaeeed3edb33",
                            "order": 502,
                            "adult": false,
                            "gender": 0,
                            "id": 4887136,
                            "known_for_department": "Acting",
                            "name": "Ryan-Mark Parsons",
                            "original_name": "Ryan-Mark Parsons",
                            "popularity": 0.001,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2019-10-23",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1944766,
                    "name": "Electric Bikes",
                    "overview": "Lord Sugar summons the candidates to the London Transport Museum, where they learn that this week’s task is to create and sell their own range of electric bikes.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/28w8XvTfBQgYAy2qqoNrjsAbygA.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdcf06fefafaeeed3edb33",
                            "order": 502,
                            "adult": false,
                            "gender": 0,
                            "id": 4887136,
                            "known_for_department": "Acting",
                            "name": "Ryan-Mark Parsons",
                            "original_name": "Ryan-Mark Parsons",
                            "popularity": 0.001,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2019-10-30",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1944767,
                    "name": "Oxford and Cambridge Discount Buying",
                    "overview": "Lord Sugar sends the candidates to the historic university cities of Oxford and Cambridge, where they will attempt to procure nine items that are associated with both places.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/kEaadKHEwQDXNcCJiSKbimnOYJ4.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdcf06fefafaeeed3edb33",
                            "order": 502,
                            "adult": false,
                            "gender": 0,
                            "id": 4887136,
                            "known_for_department": "Acting",
                            "name": "Ryan-Mark Parsons",
                            "original_name": "Ryan-Mark Parsons",
                            "popularity": 0.001,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2019-11-06",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1944768,
                    "name": "Theme Park",
                    "overview": "Lord Sugar challenges the candidates to create and market a new rollercoaster.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/wvNmNZidJsKTGl7uyZeZ69hbVPF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdcf06fefafaeeed3edb33",
                            "order": 502,
                            "adult": false,
                            "gender": 0,
                            "id": 4887136,
                            "known_for_department": "Acting",
                            "name": "Ryan-Mark Parsons",
                            "original_name": "Ryan-Mark Parsons",
                            "popularity": 0.001,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2019-11-13",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1944769,
                    "name": "Finland Advertising",
                    "overview": "The candidates must create an advertising campaign to persuade UK tourists to visit Finland. Finland is known as a winter destination, but this campaign must entice us to visit during the summer.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/nT8r9FgORVAI8Sv5pP12XuyxA6c.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdcf06fefafaeeed3edb33",
                            "order": 502,
                            "adult": false,
                            "gender": 0,
                            "id": 4887136,
                            "known_for_department": "Acting",
                            "name": "Ryan-Mark Parsons",
                            "original_name": "Ryan-Mark Parsons",
                            "popularity": 0.001,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2019-11-20",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1944770,
                    "name": "Steam Train",
                    "overview": "The teams host a corporate away day onboard the iconic Belmond British Pullman train.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/4a8jblt5Es6WRNpERcjP6LB6s8U.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self - Contestant",
                            "credit_id": "66bdcf06fefafaeeed3edb33",
                            "order": 502,
                            "adult": false,
                            "gender": 0,
                            "id": 4887136,
                            "known_for_department": "Acting",
                            "name": "Ryan-Mark Parsons",
                            "original_name": "Ryan-Mark Parsons",
                            "popularity": 0.001,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2019-11-27",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1944771,
                    "name": "Music Managers",
                    "overview": "Lord Sugar challenges the candidates to act as talent managers. They must audition unsigned musicians, choose which one to represent, then head to a studio to create a remix of one of their tracks.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/a1c2cCrwJ1ccK0IIpp8pORLq44l.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-04",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1944772,
                    "name": "Perfume",
                    "overview": "Lord Sugar asks the candidates to don their lab coats and goggles as he challenges them to create and sell their own perfume.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/nxStW6UKQ8KaDfnipCUlBB4bR6U.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-10",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1944773,
                    "name": "The Final Five",
                    "overview": "The five remaining candidates are put under the microscope, revealing the real people behind the business wear.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/pwUGjstRh8KcUXe1dnR90qajGnj.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-11",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1944774,
                    "name": "Interviews",
                    "overview": "The final five candidates go head to head with Lord Sugar's advisors as they present their business plans and face the bigwigs' scrutiny.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/cUfc6JoOXeZFVVNfcXMyhDQbJsW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-18",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1944775,
                    "name": "Why I Fired Them",
                    "overview": "With the final just days away and Lord Sugar on the cusp of choosing his new business partner, we look back on the candidates who fell before the final hurdle.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/21gtaSvJaTRBJw434ZLVyjx69k3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-18",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 1944776,
                    "name": "The Final",
                    "overview": "To convince Lord Sugar they’re worthy of his cash, the last two candidates must now launch their businesses, with a little help from some of those who were fired.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 15,
                    "show_id": 2472,
                    "still_path": "/sNjszl3WgcRb9UcnhP101deA8qk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 15",
            "overview": "Over the course of 12 tough tasks, the 16 candidates will be whittled down until just one victor remains. And plenty of sparks are set to fly in the boardroom along the way!\n\nEach week the budding entrepreneurs will be divided into two teams - led by designated Project Managers - that lock horns under the watchful eyes of Lord Sugar's advisor Baroness Karren Brady and new aide Claude Littner.\n\nAfter completing each task both teams return to the boardroom to discuss their inspirational or calamitous experiences and discover which side has triumphed.\n\nThe winners will be rewarded with a luscious treat while the losing team’s Project Manager must select two colleagues to accompany them back into the boardroom. Lord Sugar will then hear their arguments and fire at least one of them from the competition.\n\nThe eventual winner of The Apprentice Series 15 will be given the opportunity to be Lord Sugar's business partner and receive an investment to the value of £250,000 founded on the basis of their idea.",
            "id": 133029,
            "poster_path": "/hgHGsnZyeJTrNmFD37MDQgW2kAK.jpg",
            "season_number": 15,
            "vote_average": 0
        },
        "16": {
            "_id": "61d189ddd19a3300679ae094",
            "air_date": "2022-01-06",
            "episodes": [
                {
                    "air_date": "2022-01-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3423789,
                    "name": "Cruise Ship",
                    "overview": "This year's 16 candidates set sail from Portsmouth, their first task being to come up with marketing campaigns for a new cruise liner.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/j1p0bFQy0UMqbN8gCB8K8DmSwvH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-13",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3429869,
                    "name": "Toothbrush",
                    "overview": "The teams must design an electric toothbrush aimed at children aged between six and eight, as well as an accompanying app that encourages them to brush their teeth.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/64hDo5HyEMvmPOFpYYv8PReioOw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-20",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3444067,
                    "name": "Non-Alcoholic Drinks",
                    "overview": "The candidates' next task is creating and branding a new non-alcoholic drink and hosting a launch event where they will be pitching and selling to leading retailers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/tG0LeDucg1s3T6SgoYu1GcxQm6z.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3457089,
                    "name": "Fishing",
                    "overview": "The candidates enter the choppy waters of the fish business, sourcing a catch of the day and creating a fish dish to sell to the public.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/oFgp3nOeuQhPgQh6fAtsblGmvPX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3470635,
                    "name": "Gaming",
                    "overview": "The teams' next task is to create their own computer game and pitch their concept to a panel of hugely successful games investors.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/2njX87pEEgVuvSOpSA3lkKJBWfe.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3482581,
                    "name": "Wales",
                    "overview": "In a tourist hot-spot in north Wales, the candidates run their own highland railway, quarry tour and zip line.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/fEhu4slk7SpOaWINfftKrm5Tus1.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-17",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3494851,
                    "name": "Pods",
                    "overview": "The candidates gear up to design, brand and pitch their own electric driverless vehicle.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/ftg3a07nntlLrzk7q7cacdsYt4O.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-24",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3508276,
                    "name": "Silverstone",
                    "overview": "The remaining candidates lay on a racing-themed corporate away day at Silverstone, including a tour, a racing experience and food and drink.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/bp5VPjFiP81zVICs6ygD3qUHzWE.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-03",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3522333,
                    "name": "TV Selling",
                    "overview": "The teams are set one of their most intense challenges yet: to sell live to the nation on one of the country’s leading TV shopping channels.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/6VSxRGOOuqRG8qpNaBQJ9ca6Xz2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-10",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 3533338,
                    "name": "Baby Food",
                    "overview": "Lord Sugar summons the remaining candidates to KidZania in west London, where he reveals that their next task is to create and brand a new baby food.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/5RmUBH6hZp7BLyBl69g0rkv07lZ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-15",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 3580033,
                    "name": "The Final Four",
                    "overview": "With just two more tasks remaining, the remaining aspiring entrepreneurs go under the microscope, revealing the real people behind the businesswear.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/63QQYzqCKbJLNsrY9qID9QFUo97.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-17",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 3580034,
                    "name": "Interviews",
                    "overview": "The remaining candidates face the scrutiny of Lord Sugar’s most trusted advisors, who are primed to pick apart their business plans. Only two can proceed to the final.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/8i6UTmQ5TaXApJdkKhgAuf0ZAkP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-21",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 3594431,
                    "name": "Why I Fired Them",
                    "overview": "Lord Sugar looks back on the candidates who fell before the final hurdle and the tasks that took them to the brink.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/sVA12DPFBhgvpFkg1PZ5jnkglYh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-24",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 3601571,
                    "name": "The Final",
                    "overview": "The two finalists each have three days to launch a new company. They must create branding for their business, produce a digital billboard and a television advert, then pitch it to Lord Sugar.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 16,
                    "show_id": 2472,
                    "still_path": "/aHTIscdRveNZWMvTjyPqjHDK0gK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 16",
            "overview": "",
            "id": 238030,
            "poster_path": null,
            "season_number": 16,
            "vote_average": 0
        },
        "17": {
            "_id": "63afe2f5be4b3600b63bc11e",
            "air_date": "2023-01-05",
            "episodes": [
                {
                    "air_date": "2023-01-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4130287,
                    "name": "Antigua Tourism",
                    "overview": "Lord Sugar’s search for a new business partner is back, and this year’s 18 candidates kick things off on the magnificent Caribbean island of Antigua. Under the watchful eye of Baroness Karren Brady and Claude Littner, the teams must sell and run bespoke tours. After bickering on the beach and some woeful negotiations, back in the boardroom, one candidate is sent packing.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/lWSinMlEZNgFR5mIE8rl9CGmyCf.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-01-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4141550,
                    "name": "Bao Buns",
                    "overview": "For week two, the candidates are summoned to Hutong at The Shard in Central London. Lord Sugar reveals that they will be manufacturing savoury bao buns to punt to the public and a bespoke sweet bun to sell to a corporate client, with the team who secures the biggest overall profit winning.\n\nOne team bites off more than they can chew with a Jurassic-themed bun, leading to explosions in the kitchen, while the other team are left in short supply after a maths meltdown. In the boardroom, one member of the losing team is sent packing.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/u28jHWVbMcEs6qo8iFzCrjoSyC.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-01-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4141551,
                    "name": "Cartoons",
                    "overview": "Week three and the candidates are summoned to London’s Regent Street Cinema for an exclusive screening. Lord Sugar reveals they must create a new preschool cartoon aimed at two-to-four-year-olds to pitch to industry experts. One team showcases incomplete characters, whilst the other presents a sketchy storyline.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/uMI8MPyRqLmnwmt4JEEKwE6onDD.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-01-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4141555,
                    "name": "Brighton Discount Buying",
                    "overview": "The candidates are sent to buzzing Brighton and Hove, one of the fastest growing cities in the UK. Here, amongst the bustling streets, the candidates must secure and negotiate nine items synonymous with the area. The team that secures the most items at the lowest prices, wins. Then, back in the boardroom, it’s rock bottom for another candidate.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/pqmeeFVmsitx9fLSGexpedLgOPI.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4154018,
                    "name": "Electric Motorbike Advertising",
                    "overview": "The candidates are tasked with branding an electric motorbike and creating an advertising campaign before pitching to a panel of experts.\n\nPassionate about motorbikes, one project manager has his vision ignored, while the other team's advertising campaign backfires when they focus on story rather than subject.\n\nIn the boardroom, sparks fly as one candidate is fired.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/l0kDVyRA81E7dX9ggyiiopHKhcb.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-09",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4194678,
                    "name": "Dubai Corporate Hospitality",
                    "overview": "It's week six, and the candidates jet off to the cosmopolitan city of Dubai. Here they must put on a corporate away day for two international clients based in the city.\n\nWhile one team shows off the glitz and glam of the city, the other goes for a more traditional approach in the desert. But it's the team with the most profit at the end that will win.\n\nBack on home soil, it’s the end of the road for another candidate.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/uU9OmwB34oPwSUqEj6pl3Cro7bL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-16",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4207268,
                    "name": "Children's Lunchbox and App",
                    "overview": "It's week seven, and the candidates must design a new lunchbox aimed at six-to-eight-year-olds, along with an app to encourage healthy eating.\n\nFor one team, a clear vision helps them take a bite out of the market. On the other, poor decisions and a lack of vision leads to dreary designs.\n\nIn the boardroom, there’s no such thing as a free lunch as one candidate is fired.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/78gr7LH2JunFEl3ijHdz9ycNIED.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-23",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4224144,
                    "name": "Immersive Event",
                    "overview": "It's week eight, and the candidates' task is to host immersive events in Shropshire. They must sell tickets, book entertainment and organise food and drink. The team that produces the biggest overall profit wins.\n\nOne team deals with confused convicts, whilst the other team narrowly avoids a dining disaster. In the boardroom, it’s lights out for one candidate as they’re told ‘You’re fired’.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/9lxggrxx8IqIKa9LFZoxy6OieDM.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-03-02",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4240008,
                    "name": "Male Beauty",
                    "overview": "For week nine, the candidates must design a new men’s skincare product, then pitch it to industry buyers. For one team, wrangling over a recipe leads to a disastrous skin-staining goo, meanwhile a lack of creativity on the other team results in an unoriginal concept. In the boardroom, Lord Sugar decides to wash his hands of not just one candidate, but two, in a shock double firing!",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/jy6ANLhABPdjBKKG3fD6k85jhEI.jpg",
                    "vote_average": 6,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-03-09",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 4256239,
                    "name": "Dog Food",
                    "overview": "For week ten, the candidates are tasked with creating and branding a new dog food before pitching to major retailers.\n\nIn the kitchen, one team wrangles with their recipe, making a dog’s dinner of their signature dish, whilst on the other team a premium product fails to deliver. On the branding teams, candidates bicker to be top dog. With plenty to chew over, Lord Sugar sends one candidate for walkies.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/uIEEblosglPsGv5jdrg9uV8LSNk.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-03-16",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 4271470,
                    "name": "Interviews",
                    "overview": "In the penultimate episode, some familiar faces return as the final five entrepreneurs and their business ideas are interrogated by Lord Sugar’s trusted advisors. A deep dive into their business plans reveals fictitious figures, crazy concepts and absurd ambitions.\n\nFor one candidate, it’s the end of the road as Lord Sugar tells them 'You’re fired'.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/jz768gM34xjHDayQJGzSCUFfQiy.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-03-23",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 4289549,
                    "name": "The Final",
                    "overview": "The two finalists go head-to-head one last time to become Lord Sugar’s new business partner and win his £250,000 investment.\n\nWith the help of some familiar faces, they must launch their business, create a new brand for their company, produce a digital billboard, direct and edit a TV advert and design a metaverse, then pitch it all to Lord Sugar and industry experts at a black-tie event.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 17,
                    "show_id": 2472,
                    "still_path": "/pmJBwHvHBRubly9RP4HBvvWrRzR.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 17",
            "overview": "",
            "id": 322128,
            "poster_path": null,
            "season_number": 17,
            "vote_average": 4.6
        },
        "18": {
            "_id": "65908f5e6aa8e06153eae5ec",
            "air_date": "2024-02-01",
            "episodes": [
                {
                    "air_date": "2024-02-01",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 5037289,
                    "name": "Highlands Corporate Away Day",
                    "overview": "Week One. Lord Sugar’s candidates host a corporate away day in the Scottish Highlands. Back in the boardroom, one candidate is sent packing.",
                    "production_code": "",
                    "runtime": 62,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/zuAbpnIL3YYnaJiSsnXq6my9xRe.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-02-08",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 5098119,
                    "name": "Cheesecakes",
                    "overview": "It's week two and the candidates manufacture miniature cheesecakes to sell to the public and corporate clients. But crumbling cakes and maths meltdowns lead to a firing in the boardroom.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/hTvxes22wAXmn6sE08JCIGr8uP8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-02-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 5113143,
                    "name": "Virtual Escape Rooms",
                    "overview": "It's week three, and the teams create a new virtual escape room to pitch to industry experts. Boring branding and confusing concepts lead to one candidate being fired.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/d7W1eDI2QzQvDu4IYHz3LLqqQ3r.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-02-22",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 5132053,
                    "name": "Discount Buying",
                    "overview": "It's week four, and the candidates are sent to Jersey to secure nine items synonymous with the area. After a race to the finish, it’s au revoir for another candidate in the boardroom.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/5MGgcb4431z2BOqTuMih33X7bGd.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-02-29",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 5146644,
                    "name": "Formula E",
                    "overview": "Lord Sugar's candidates launch a new Formula E team before pitching for sponsorship, but questionable designs jeopardise multi-million-pound negotiations.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/47DC1UildhVtTegyFt1LF7C38GK.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-07",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 5161246,
                    "name": "Cereal",
                    "overview": "The candidates must design and create a brand new breakfast cereal to sell to industry buyers. Bland recipes and boring boxes result in another candidate being fired.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/ySQEIgCHiIO9D6vVJfWjMMLaliT.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 5181999,
                    "name": "Budapest Tourism",
                    "overview": "Lord Sugar’s candidates touch down in the Hungarian capital of Budapest to sell and run bespoke tours. Back in Blighty, one candidate is sent packing.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/mkcNUUrpc0xrGa1Ldmv5Mhr1WQ6.jpg",
                    "vote_average": 6,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-21",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 5196732,
                    "name": "XBUS Advertising",
                    "overview": "Lord Sugar’s candidates brand and create an advertising campaign for a new electric vehicle. Boring branding and confusing adverts mean one candidate hits the brakes.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/wRzr1xhqxYxMQV69Mhd3LDE4qnG.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-28",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 5210769,
                    "name": "TV Selling",
                    "overview": "The teams are tasked with choosing a selection of products to sell live to the nation on one of the UK's leading TV shopping channels.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/7eRMLEoStB585CBuECpyzATTU59.jpg",
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-04-04",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 5224691,
                    "name": "Vegan Alternative to Cheese",
                    "overview": "Lord Sugar's candidates are tasked with creating a new vegan alternative to cheese to pitch to major retailers. But unusual recipes and bland brands result in another candidate being fired.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/2JVGz2Qx8XBOMxqthXYnJyKYaXX.jpg",
                    "vote_average": 6,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-04-11",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 5241049,
                    "name": "Interviews",
                    "overview": "Some familiar faces are back to interrogate the business plans of the final five, and with £250,000 in touching distance, there’s tears, tension and tough love.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/b7DwUDzyaDJzkSg2QCWn5TjHWrz.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-04-18",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 5257873,
                    "name": "The Final & You’re Hired!",
                    "overview": "Two finalists will be tasked with launching a new business and pitching it to Lord Sugar for the chance to win his £250,000 investment and become his next business partner.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 18,
                    "show_id": 2472,
                    "still_path": "/5Tn3HxJJJ8ktYczypTBNP1vcUp6.jpg",
                    "vote_average": 3,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 18",
            "overview": "",
            "id": 372256,
            "poster_path": null,
            "season_number": 18,
            "vote_average": 4.9
        }
    }
}