{"adult":false,"backdrop_path":"/6Hev6szZZyC0EaGTlM6uBulCxt4.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2005-01-17","genres":[{"id":10764,"name":"Reality"}],"homepage":"https://www.mylifetime.com/shows/supernanny","id":26353,"in_production":false,"languages":["en"],"last_air_date":"2020-09-22","last_episode_to_air":{"id":2388515,"name":"Sutherland Family","overview":"","vote_average":0,"vote_count":0,"air_date":"2020-09-22","episode_number":18,"episode_type":"finale","production_code":"818","runtime":60,"season_number":8,"show_id":26353,"still_path":"/jmVRvrmR5PV2vCE3izcubEgeciR.jpg"},"name":"Supernanny","next_episode_to_air":null,"networks":[{"id":2,"logo_path":"/2uy2ZWcplrSObIyt4x0Y9rkG6qO.png","name":"ABC","origin_country":"US"},{"id":34,"logo_path":"/kEeaVLcJ6L6jq3v5YlPcjQs9igm.png","name":"Lifetime","origin_country":"US"}],"number_of_episodes":133,"number_of_seasons":8,"origin_country":["US"],"original_language":"en","original_name":"Supernanny","overview":"Jo Frost, a modern day, tough-love \"Mary Poppins\" is placed with families in need of guidance or care. She spends an extended period of time with a family, observing their issues and then, using a series of her own tried-and-true methods, offer solutions. Problems can range from discipline to sloppiness or anything in between.","popularity":16.786,"poster_path":"/ioSnygEfQ3nH26D6qEgDDOiXawm.jpg","production_companies":[{"id":26459,"logo_path":"/3nUSW1uviVobNECls9WCNc1Urb9.png","name":"Shed Media","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2005-05-11","episode_count":2,"id":109063,"name":"Specials","overview":"","poster_path":"/nCqRD629tMJRVFjC2xBN4kpohJI.jpg","season_number":0,"vote_average":0},{"air_date":"2005-01-17","episode_count":11,"id":36836,"name":"Season 1","overview":"","poster_path":"/kxmggfMJSAY2wAdhDl8Vi25ln6r.jpg","season_number":1,"vote_average":0},{"air_date":"2005-09-23","episode_count":19,"id":36837,"name":"Season 2","overview":"","poster_path":"/1JOs8jc2T7y3ZSSbAVNyKHLj8qT.jpg","season_number":2,"vote_average":0},{"air_date":"2006-12-04","episode_count":15,"id":36838,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2008-01-02","episode_count":21,"id":36839,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2008-10-03","episode_count":21,"id":36840,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0},{"air_date":"2009-10-23","episode_count":13,"id":36841,"name":"Season 6","overview":"","poster_path":null,"season_number":6,"vote_average":0},{"air_date":"2010-11-05","episode_count":15,"id":36842,"name":"Season 7","overview":"","poster_path":null,"season_number":7,"vote_average":0},{"air_date":"2020-01-01","episode_count":18,"id":139726,"name":"Season 8","overview":"The families featured this season are from cities and towns around the country, including Phenix City, AL; Spokane, WA; Makaha, HI; Corona, CA; Mesa, AZ; Cortlandt Manor, NY; Gilbert, AZ; and more. Each of the families are dealing with diverse issues that span the spectrum of parenting challenges – from dealing with postpartum depression, ADHD, kids obsessed with electronic devices, blended families struggling with children acting out, military and first responder spouses facing separations – to parents buried in their phones and more. Jo will visit one new family each week and use her trusted and proven methods and elevated teachings to help them change their dynamics while focusing on positive reinforcement and connectivity.","poster_path":"/ioSnygEfQ3nH26D6qEgDDOiXawm.jpg","season_number":8,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Reality","vote_average":6.9,"vote_count":28,"season_data":{"1":{"_id":"52587fdb760ee346613800ff","air_date":"2005-01-17","episodes":[{"air_date":"2005-01-17","episode_number":1,"episode_type":"standard","id":669559,"name":"Jeans Family","overview":"David and Barbara Jeans waited 16 years into their marriage to have kids, and their three girls don't show any mercy on the middle-aged pair. Andra, who is 4 1/2 years old, dominates the family with her selfish demands, tantrums, and violent outbursts. The combination of Andra and the three-year-old twin girls makes for a turbulent and chaotic existence. David's job as a salesman takes him out of town for five days out of every month and Barbara is left to fend for herself alone with the three terrors. She is at her wit's end and is starting to doubt her ability as a mother, and is feeling emotionally and physically drained. The Jeans family needs an answer to their problems fast.","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-24","episode_number":2,"episode_type":"standard","id":669560,"name":"Bullard Family","overview":"Bryce and Jen Bullard are a Colorado couple who are struggling to manage a busy plumbing business and raise two unruly children. The Bullard household is chaotic, with work phones ringing off the hook and kids screaming late into the night. The Bullard boys, two-year-old Rylan and six-year-old Brycie, have full rein of the house. Jen and Bryce have very different views of parenting; Jen is more lenient, while Dad is quick to punish. In order for Bryce and Jen to gain control of their household, they must learn get on the same page with their discipline and follow the Supernanny method.","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-31","episode_number":3,"episode_type":"standard","id":669561,"name":"Orm Family","overview":"Parents Shawn and Tammy Orm have lost control of their three sons. Eight-year-old Chandler talks back to his parents, six-year-old Caden has a nasty habit of beating up his younger brother, and three-year-old Declan is quickly learning to emulate his older brothers' bad behavior. Stay-at-home mom Tammy is a softie and refuses to discipline her boys. Video technician Shawn takes a tougher approach, often yelling at his sons, but that doesn't curb their naughtiness either.","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-07","episode_number":4,"episode_type":"standard","id":669562,"name":"Wischmeyer Family","overview":"John and Melora Wischmeyer are a hard-working couple with three children. John works long hours as a civil engineer, and Melora took a marketing job where she could work at home to enjoy time with her children. However, the time spent is anything but enjoyable. Their four-year-old twin daughters, Alaia and Ashlyn, do everything in their power to control their parents. During the day, Alaia hits, screams and is downright defiant. Any discipline Melora tries to dish out, Alaia simply ignores. When nighttime arrives, it's Ashlyn's turn to act up. She adamantly resists bedtime and repeatedly runs out of her room, throwing things and having wild tantrums. Complicating the issue is nine-year-old son Jared, a quiet, smart boy who often is punished for his sisters' misbehavior and is becoming increasingly frustrated by this situation.","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-14","episode_number":5,"episode_type":"standard","id":669563,"name":"Weston Family","overview":"Insurance salesman Fred Weston and his wife, Andrea, a homemaker and schoolteacher, are a loving, hardworking family with a big problem - a ferocious four-year-old named Andrew. Little Andrew rules the Weston house, and it's a reign of terror. He topples lawn furniture, calls his mother \"Poo-poo\" and bullies his eleven-month-old brother, Sean, in countless ways. Well-intentioned Fred and Andrea find themselves at their limit. They acknowledge that their tactics have been futile, but how to break the cycle and regain control?","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-21","episode_number":6,"episode_type":"standard","id":669564,"name":"Bailey Family","overview":"Bill and Stacie Bailey have demanding jobs and an even more demanding family. Bill is a police officer, and Stacie teaches at the local elementary school. But when they return from long days on the job, the real work begins - raising Billy and Jadyn, ages two and six. \"Billy can be very sweet - then there's the devil,\" says Stacie referring to her son's epic tantrums. Daughter Jadyn, according to Stacie, is \"already hitting the moodiness of puberty,\" plus the youngster has a major sleeping problem. She sleeps everywhere but her own bed, preferring her parents' room or even the hallway floor! Will Bill be able to police his children's behavior? How can educator Stacie teach her children respect and discipline?","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-07","episode_number":7,"episode_type":"standard","id":669565,"name":"Gorbea Family","overview":"Robert and Evelina Gorbea have lost control of their family, and the power is in the hands of their two-year-old son, Adam. The toddler constantly latches onto his mother and explodes into ear-busting tantrums when he's denied her attention. He also refuses to go to sleep in his crib, often keeping Evelina up until the wee hours of the night. This monopoly of mom's time leaves Adam's siblings, daughter Meya (8) and son Demetrius (9), feeling neglected. Is Robert not helpful enough or is Evelina afraid to let her last baby grow up?","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-21","episode_number":8,"episode_type":"standard","id":669566,"name":"Ririe Family","overview":"Scott and Jennifer Ririe have their hands full with their four children -- daughter Selia (9) and sons Hallden (7), Blake (3), and Broden(1). Scott and Jennifer have two completely different outlooks on how their children should be parented. By far their most troublesome child is the reckless and defiant Blake. Every time Jennifer looks away, he makes a beeline for the front to play with a neighbor friend. In public, he refuses to stay with her and runs off constantly; and when she chases after him, she leaves her other children unattended. While Jennifer is fearful for Blake's safety, Scott doesn't have a problem with this situation, often laughing it off. The parents also disagree about their children's eating habits.","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-04","episode_number":9,"episode_type":"standard","id":669558,"name":"Collins Family (U.K. Family)","overview":"Jason and Karen Collins live in Northamptonshire, U.K. with their four unruly children who run the house by mob rule. Ten-year-old Ben, Lauren (nine), Joshua (six) and Joseph (four) keep their stay-at-home mom on her toes all day. Dad Jason is the manager of a British bakery and often doesn't return home from work until 8:00 p.m. or later. Ben and Joseph, the oldest and youngest, are not only aggressive and destructive, but decide to be the first children ever to prove that Supernanny's techniques won't work.","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-04-18","episode_number":10,"episode_type":"standard","id":669567,"name":"Burnett Family","overview":"The Burnetts are in over their heads. With five kids, including Zachary (8) and two sets of twins -- Joseph and John (3) and Michael and Molly (16 months) -- this is a family consumed by chaos. A self-employed, stay-at-home dad, Michael, is struggling to find a balance between work and family. Mom Joanne is a schoolteacher who comes home every afternoon to four needy toddlers who want all of her attention and a household full of chores that Dad has deemed \"woman's work.\"","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-05-02","episode_number":11,"episode_type":"finale","id":669568,"name":"Christiansen Family","overview":"Homemaker Colleen Christiansen and her husband Chris, who works in insurance sales, have boys gone wild. Seven-year-old Corey and three-year-old Chase challenge their parents regularly with behavior that includes kicking, pinching, biting, backtalk and general disrespect. The boys can be destructive to the home, and the whole family has a tendency to shout. In addition, young Chase still uses a baby bottle.","production_code":"","runtime":60,"season_number":1,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":36836,"poster_path":"/kxmggfMJSAY2wAdhDl8Vi25ln6r.jpg","season_number":1,"vote_average":0},"2":{"_id":"52587fdb760ee3466138010a","air_date":"2005-09-23","episodes":[{"air_date":"2005-09-23","episode_number":1,"episode_type":"standard","id":669574,"name":"Minyon Family","overview":"Frank and Danielle Minyon are a young, beautiful couple. Frank works full-time as a medical software engineer and Danielle is a homemaker. They have two children, Frank, 7, and unruly Skyler, 3, who rules the roost with massive tantrums that ensure she always gets her way. Danielle had to quit her job to take care of Skyler when daycare refused to take her back. Danielle's grandma, Gigi, also lives with them, but she's taken to hiding in her room to avoid her great-granddaughter's screaming. Mom struggles to get the children up in the morning, by 8:00 a.m., Danielle's drained but has to spend the rest of her day chasing Skyler. By the time Dad gets home, an exhausted Danielle needs help, but Dad refuses to discipline his \"little princess\" when she acts out, and is harsh with his sensitive son.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-23","episode_number":2,"episode_type":"standard","id":960741,"name":"Webb Family","overview":"Arthur and Cathy Webb are a dual-career couple who are juggling the demands of work, children and, most of all, sleep. They have three children - Josef, 6, Paige, 5 -- who has Down Syndrome -- and Madison, 2-1/2. With Dad away all week for his job as a management consultant, Mom is left to handle the three children alone. She has no structure to the evenings, rarely eats with the kids, and finds each night draining. Mom feels so guilty about leaving daughter Madison with a babysitter during the day that she allows the toddler to cling to her constantly. She cooks and cleans with one hand, holding Madison the entire time. Because of Paige's Down Syndrome, Josef refuses to play with her and calls her names. Bedtime is a joke. Often, Mom falls asleep before the kids, around midnight, and the kids all sleep in Mom's bed. Dad spends the entire weekend either sleeping or running nonstop errands, considering the latter his \"family time.\" Mom is at her wits' end and wants Supernanny's help.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-30","episode_number":3,"episode_type":"standard","id":669575,"name":"McMillion Family","overview":"Cheryl McMillion is struggling to raise her three children on her own, while her husband, Jonathan, a National Guardsman, is serving his tour of duty in Afghanistan. However, while Dad is overseas, there's a battle to keep the peace on the homefront, as the boys -- Ryan, nine, Hunter, seven, and Garrett, three -- act out by fighting and yelling. Mom's had it with the aggression in her family, and turns to Supernanny for help.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-07","episode_number":4,"episode_type":"standard","id":669576,"name":"Larmer Family","overview":"Jo Frost visits Judy and Ed Larmer to address the destructive, out-of-control behavior of their four children -- John (4), twins Jessica (2 1/2) and Justin (2 1/2), and Joey (11 months). However, it isn't long before Jo realizes that it's the parents' constant fighting and bickering with each other that is the source of the family unrest.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-14","episode_number":5,"episode_type":"standard","id":669577,"name":"Cooke Family (U.K. Family)","overview":"American viewers are treated to Jo Frost's trials with a British family, Paul and Denise Cooke and their daughters, Meghann (9), Gabriella (6) and Erin (4). The girls are bright and creative, but arguments with their parents regularly turn into shouting matches. Meghann in particular bosses her family around, terrorizes her sisters and can erupt at the drop of a hat. Her relationship with Denise is very stressful, and the family rarely ventures out in public together for fear of an embarrassing scene.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-21","episode_number":6,"episode_type":"standard","id":669578,"name":"Amaral Family","overview":"Michael and Lorraine Amaral own a restaurant and work seven days a week, leaving them no time for their three \"rough and tumble\" boys: Ryan, 9, Logan, 4, and Kade, 2. Mom's at her breaking point, trying to juggle work and family while the kids run amok in the restaurant like it's their own personal playground. It's driving everyone crazy, especially the employees -- who are also expected to babysit! Can Supernanny put this family back on track and help them find some balance between work and home?","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-04","episode_number":7,"episode_type":"standard","id":669579,"name":"Facente Family","overview":"Deirdre and Trae Facente don't know how to integrate their autistic son, Tristin, into their daily life with their twins, Kayla and Marlana (4). Tristin is completely non-verbal, caught up in his own world of spinning, jumping, swinging and, often, taking off his clothes. The parents are at a loss as to how to help Tristin come out of his zone and join the family. Supernanny teams with world-renowned autism expert Dr. Lynn Koegel to teach all the Facentes inclusion and communication techniques to help engage Tristin.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-11","episode_number":8,"episode_type":"standard","id":669580,"name":"Keilen Family","overview":"Tami and Shaun Keilen are living the American dream. This former Navy SEAL and his beautiful wife have a successful family business and four gorgeous children. However, this dream becomes a nightmare when the parents return home from work, as four-year-old twin terrors Maile and Malia run roughshod over Shaun and Tami. Well-behaved big sister Haeley (six) and docile baby brother Leighton (one) are lost in the shuffle, as the twins habitually take three entire hours to get dressed, screaming all the while. Tami devotes much of her home time to compulsively housekeeping, and Shaun, who can face any military challenge, can't hold his ground to the demanding twins.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-18","episode_number":9,"episode_type":"standard","id":669581,"name":"Bradbury-Lambert Family","overview":"Jo Frost returns to Britain to help kickboxing couple Stuart Lambert and Laura Bradbury with their three children: Matthew, 5, Tegan-Olivia, 2, and baby Diesel, 5 months. Matthew's aggressive outbursts leave Laura battered and bruised; he even gives her a bloody lip when he punches her in the mouth! As the stepfather, Stuart is desperate to discipline the karate kid, but Laura won't allow it; instead, the family is split down the middle with Stuart taking responsibility for his daughter and Mom fighting to control Matthew.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-25","episode_number":10,"episode_type":"standard","id":669582,"name":"Tsironis Family","overview":"When Elizabeth and Bob Tsironis' twin boys, Teddy and Nicholas, were born, they only weighed a pound each. They beat the odds to become healthy, strong, three-year-olds, but their parents are so grateful that their miracle twins survived, they completely spoil the rambunctious toddlers. Nicholas even has a broken leg from Teddy pushing him off the bed! Meantime, big sister Kate, four, is sometimes overshadowed by her brothers' pandemonium. She copes by compulsively lying about painful foot cramps to get attention -- everything stops in the household when she is \"stricken.\" She also manages to have the twins get blamed for her own misbehavior, but her parents have no idea they are being duped.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-03-06","episode_number":11,"episode_type":"standard","id":669573,"name":"Carsley Family","overview":"Cheryl Carsley is a harried single mom with five children, including two sets of twin boys. She's in school full-time, training to be a teacher, but at home her kids -- Chantal, 7, Nicolas and Caleb, 5, and Bobby and Elijah, 4 -- rule the roost. The house looks like it hasn't been cleaned in years, but worse than that is the way the kids treat their Mom and each other. A bitter divorce has left the children emotionally scarred; they hit their mother, scream at her, fight with each other and throw fits. The kids don't listen or treat Cheryl with respect, and every technique she has tried has failed. On top of this, how can a single working mom find one-on-one time with each child?","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-03-13","episode_number":12,"episode_type":"standard","id":669583,"name":"Schwartz Family","overview":"Cathy and Steve Schwartz both work full-time and Catherine's sister, Donna, who lives just a block away and raised Cathy after their mom's death, is the main caregiver for their four rambunctious Schwartz children. There's baby Emily, 1, Katelyn, 3, Amanda, 4, and Samantha, 6. From morning to night, no one wants to discipline the children, and any attempts made by the parents are thwarted by Donna, whose refrain is, \"They're just kids.\" Mornings are a study in chaos, as Mom plays short-order cook to the girls, racing to get to the older ones on the school bus and herself to work on time. Plus, though she's 3-1/2, Katelyn still isn't potty-trained. Dad says that keeping the girls in line is harder than his job as a city cop, and Cathy despairs that the girls consider Donna more their mom than herself.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-03-20","episode_number":13,"episode_type":"standard","id":669584,"name":"Silva Family","overview":"The Silvas are a \"Yours, Mine and Ours\" family spiraling out of control. Tom and Danielle each have two children from previous marriages, and they have three children together -- the age range is six months (Caden) to 17 years (Meghan). Tom works all week away from the family in the Army National Guard, and soon he'll be deployed to Iraq for a year and a half. In his absence, Danielle, who is very disorganized, allows the children to run amuck. The kids curse openly with no consequences, and there's a lot of negative talk from the parents, which has trickled down to the kids as well. Dad and Meghan's relationship needs repair before he leaves for the war, and Jo senses that Danielle is presenting a false \"June Cleaver\" persona.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-03-27","episode_number":14,"episode_type":"standard","id":669585,"name":"Young Family","overview":"Sherman and Joelle Young work opposite shifts at their jobs, with Dad watching the kids during the day while Mom works, and then handing them off to Mom before going to work at 4:30 p.m. They barely see each other six days a week. Well-behaved oldest child Dylan, 13, is often pressed into service as a babysitter or overshadowed by his siblings, Shermie, 5, and Shelby, 3, who are literally climbing the walls. Shermie is rambunctious, disrespectful, aggressive and hits his mother. During timeout, he'll run all the way out the door and up a tree, and Shelby is no better. She's apt to pull every book off the house's shelves when angered, eats dinner in front of the TV instead of with the family, and both tykes refuse to stay out of Dylan's room. Joelle copes by yelling a lot, which the kids ignore, and Dad has no idea how to engage with his children.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-04-03","episode_number":15,"episode_type":"standard","id":669586,"name":"Harmony Family","overview":"Erin and Jacob Harmony are at their wits' end raising three boys -- Jake (11), Ian (5) and Grant (3). Big brother Jake is not the big problem, but his two little brothers are. Ian is the master of back-talk. He torments Grant into frenzies, and the two have violent battles. Grant's temper gets so out of control that he bites furniture until he bleeds from the mouth. He has major separation anxiety, and has been known to follow Erin's car all the way to the highway when she tries to leave the house. On top of it all, Grant wakes up at 3:00 a.m. every morning and insists on sleeping with Mom. Dad gets so fed up with the crowded conditions that he moves himself onto the living room sofa! With discipline attempts going nowhere and no one getting any sleep, this family needs Supernanny now. Can Jo restore harmony to this household?","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-04-17","episode_number":16,"episode_type":"standard","id":669587,"name":"Wujcik Family","overview":"Tim Wujcik and his wife, Toni, seem to have it all -- he's a great provider, Toni's the hard-working stay-at-home mom, and they have three beautiful children. But they need what money can't buy -- mutual respect among all family members and a tranquil home life. Instead, the older boys -- Alec, 6 and Bryce, 4 -- are wantonly destructive with their many toys, and aggressively defy Mom's efforts at discipline. Baby Carly, 1, is learning all the wrong lessons from her older siblings, and Toni swings between being too timid with her kids and too harsh when she's had enough. Tim admits that he's the fourth child in the family -- undercutting Toni's efforts at discipline and instigating trouble with the kids. His preferred method of discipline is to \"reason\" with the children with lots of talking, but it isn't working. Dad needs to grow up fast and Jo Frost is on the scene to help.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-04-24","episode_number":17,"episode_type":"standard","id":669588,"name":"Jackson Family","overview":"Lisa and Terry Jackson have five-year-old triplets, Will, Ethan and Isabella. Lisa, a stay-at-home mom, is outnumbered and burned out by her boisterous, ill-behaved children, especially her strong-willed daughter. Isabella is so out of control, she even jimmies her brother�s locked door with a coat hanger! Dad, Terry, is checked out, with a job that takes him 250 miles away from home six days out of seven. Can Supernanny fix this fragmented family of five?","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-05-01","episode_number":18,"episode_type":"standard","id":669589,"name":"Newton Family","overview":"Vicki and Aaron Newton are separated, with joint custody of their two sons, Aaron (12) and Kobe (5). Though the boys are angels for Dad, young Kobe saves his worst behavior for Mom. He is violent and destructive -- hitting, kicking, slapping, punching and swearing. He even throws rocks at Jo's head. Aaron isn't physically aggressive, but he does talk back to his mother. For the first time, Jo Frost observes life in two homes to hone her recommendations for each parent. But can she get them to collaborate on their child-rearing techniques?","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-09-18","episode_number":19,"episode_type":"finale","id":669590,"name":"Uva Family","overview":"The Uva boys, Trevor (7) and Travis (4), disrespect authority figures, curse, insult and bully their classmates. They expect their parents to do everything for them -- in fact the seven-year-old insists his mom help him go to the potty. Mom Rosemary owns and operates a pre-school full time, and is too tired by day's end to give her boys the attention and love they desperately need. She craves more help from her husband, John, a stay-at-home dad who is admittedly clueless and detached from his sons. He brings them to Rosemary's pre-school every day because he doesn't know what else to do with them. The boys have gained a reputation for being the worst behaved kids there, and their parents have essentially given up. Jo enters the equation with a master plan for this family to wake up to the reality of their situation. Her ultimate goal is to boost John's pride in his role as stay-at-home dad, teach both parents to step up their discipline measures, and help the family bond and become happier.","production_code":"","runtime":60,"season_number":2,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":36837,"poster_path":"/1JOs8jc2T7y3ZSSbAVNyKHLj8qT.jpg","season_number":2,"vote_average":0},"3":{"_id":"52587fdb760ee34661380115","air_date":"2006-12-04","episodes":[{"air_date":"2006-12-04","episode_number":1,"episode_type":"standard","id":669591,"name":"Bowersock Family","overview":"Supernanny Jo Frost comes to the rescue of a family caught up in a pattern of hitting, aggression and unhappiness. Jo takes Jenniffer, the mom, on an emotional journey to break the cycle of violence that was inflicted on Jenniffer as a child.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-11","episode_number":2,"episode_type":"standard","id":669592,"name":"Weinstein Family","overview":"The Weinsteins need help. David, the dad, is a trucker, sometimes away from home as many as 10 days in a row, and stay-at-home mom Chia can't control the children -- McKenna (7), Christina (6), Julia (5) and Robert (2). When she tries to correct them, her temperamental brood responds by hitting and kicking her, cursing and other aggressive behavior. When he's home, David has zero tolerance for this, but his disciplinary style is more bullying than beneficial. He screams at them until they're in tears, but feels he's being put in the role of the \"bad guy\" because Chia has given up. The biggest issue is the nightly bedtime battle of the wills -- a two-and-a-half-hour nightmare of screaming, fighting and tears before anyone gives in to exhaustion.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-18","episode_number":3,"episode_type":"standard","id":669593,"name":"Fager Family","overview":"Stacie and Joe Fager are the proud parents of a blended family in Iowa, but with six children, they both feel overwhelmed and exhausted. There's Sarah (8) and Andrew (7), brother and sister from Joe's first marriage; Chelsea (6), Stacie's daughter from her first marriage; and Benjamin & Zachary (4-year old twins), plus Jacob (2), who are Stacie and Joe's children together. Joe is a truck driver and full-time student, and he's gone most of the week. Stacie, a stay-at-home mom, has a hard time controlling the children, so she hardly ever leaves home with the kids in tow, and family vacations are a rarity. The older kids, Sarah and Andrew, haven't seen or spoken to their birth mother in a year, and with Joe's busy schedule, they feel as if they don't have anyone to talk to about those feelings. The family desperately needs a break and something to lift their spirits.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-08","episode_number":4,"episode_type":"standard","id":669595,"name":"Swanson Family","overview":"With five rambunctious boys in a small house, Ken and Vania have reached the end of their rope -- and possibly the end of their marriage. Vania has filed divorce papers and Jo Frost is the family's last hope for reconciliation -- if this doesn't work, Vania will move forward with the divorce. Ken is a strict disciplinarian, while Vania prefers a more laid-back method of child rearing. Rather than compromising, they've gotten to the point where they simply avoid dealing with the kids at the same time -- if one parent is there, the other is out -- and the kids have learned to use them against each other as they act up, fighting with each other and for their parents' attention. Matters are further complicated by Ken's relationship with the older boys; the little ones, Brendon (4) and Christian (3), are his and Vania's together, while Myca (5), Dawson (8) and Alex (9) are from Vania's previous relationships. Ken's biggest issue is with Alex, the oldest son, with whom he often clashes. The difference in parenting styles and the problems between Alex and Ken have brought this marriage to the breaking point -- can Supernanny get this couple back on track?","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-15","episode_number":5,"episode_type":"standard","id":669594,"name":"Mihalik Family","overview":"Donna is a single mom who's been through multiple ordeals over the last four years. Her son, Cole (8), survived a two-year, all-consuming battle with leukemia. But soon afterwards, two years ago, Donna's husband Steve suddenly died. Left alone to bring up their four children -- Blake (11), Cole, Aiden (3) and Stephanie (1) -- Donna was so depleted, she lost control of the kids. She found it easier to give in than to discipline. Now the older boys swear and curse at their mom, fight constantly, and have no respect for her or each other. The oldest, Blake, is on the verge of becoming a juvenile delinquent, often running off to hang out with older kids in the neighborhood, and Donna has no say over when he'll come home. She fears that the youngest two are starting to follow their big brothers' example.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-22","episode_number":6,"episode_type":"standard","id":669596,"name":"Smith Family","overview":"Supernanny Jo Frost travels to Hawaii to help Will and Michelle Smith -- they are highly intelligent marine biologists, but when it comes to bringing up their two boys, they're clueless. Three-year-old Nate is still in diapers, and 18-month-old Ari screams at the top of his lungs to get his bottle. Bedtime is a nightmare, as Dad hypes the boys up with a frog-hunting outing right before they're supposed to be going to bed, leaving both parents exhausted and up for hours with the two energetic boys. Will and Michelle foster a house full of high energy and crazy fun, but all their singing and dancing (including the \"pee-pee dance\") can't tame the kids -- they freely admit the children are totally in charge. The parents have read the books, talked to experts and still can't figure out a way to control their toddlers. Without mastering even the basics of discipline, they worry that, if they can't cope with their children now, they'll never cope with their boisterous boys in the future.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-29","episode_number":7,"episode_type":"standard","id":669598,"name":"Haines Family","overview":"Little Sean, at just four years old, is the dictator of the Haines household, and every family member bows to his whims. He has more power than he knows what do with, and crying, whining, hitting, spitting, punching, kicking and biting seem to be his preferred methods of communication. Dad Shane is a tough police officer on the job, but he has no authority at home, and Mom Suzanne, an ER nurse, claims that giving in is easier than fighting. Big brother Seth (10) has grown resentful because Sean gets the majority of his parents' attention, so Seth antagonizes Sean to get some attention of his own. Mom and Dad's passivity when it comes to discipline has enabled the boys to spiral out of control, often out of sheer boredom and restlessness.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-02-05","episode_number":8,"episode_type":"standard","id":669597,"name":"Nitti Family","overview":"The four Nitti boys are at war with each other and their Mom. Darren (10), Matthew (8), Devin (6) and Jared (5) are so violent that they leave serious welts and scars -- the oldest son has hit, kicked, punched, spit and head-butted his mother, Lisa. Darren admits that he likes hitting because it \"takes out his anger.\" Lisa and her boyfriend, John, have been together for two years, but Lisa doesn't know how to manage her children without resorting to anger or threats to call John, who has a lion's roar that intimidates the boys. The violence between the children heats up in the car, and Lisa and John often can't get more than two blocks from home without having to pull over to manage the chaos. Dinnertime can go into an hour of overtime, as Matthew refuses to eat, and when the younger kids refuse to go to bed, there's no rest for these weary parents.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-02-12","episode_number":9,"episode_type":"standard","id":669599,"name":"Bruno Family","overview":"John and Denise Bruno have their hands full with their four girls. Dad's got issues with the two teenagers, Mariah (15) and Taylor (13), while Mom's fed up with the two youngest, Bella (6) and Sam (4). Mariah was born with fairly severe cerebral palsy and gets daily physical therapy from Mom, but she has no physical contact with Dad, as he no longer helps her out with her therapy. Mariah craves her dad's affection. John, a very traditional dad, doesn't approve of teen Taylor's punk-goth style and strong-will; they are constantly butting heads. The most difficult part of the day for Denise is when she's trying to do therapy with Mariah and the little ones interrupt and distract them. The girls' tantrums and demands have driven Denise to the end of her rope. Jo's faced with the challenge of saving Dad's relationships with the two oldest girls, especially Taylor, before they're too far gone, and getting Denise to demand respect from the little ones and keep them from interfering with her therapy time with Mariah.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-02-19","episode_number":10,"episode_type":"standard","id":669600,"name":"McAfee Family","overview":"Brian McAfee is a newly-divorced father of four children living a lonely, isolated life in Alaska. Brokenhearted and bewildered, Brian has shut himself off from the world and even his own children in many ways. He doesn't know any of his neighbors or his kids' teachers. He's uncomfortable doing girly things with his daughters, which has left a big gap in their relationship with him, especially for the oldest, Ellie (9). Brian's also baffled by his son's troubles with schoolwork, their house is a disaster, and all four kids have serious behavior problems because there's no discipline at home.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-02-26","episode_number":11,"episode_type":"standard","id":669601,"name":"Goins Family","overview":"Karolee and Jay Goins have a beautiful young family with a not-so-pretty problem. Mom, who is pregnant with her fourth child, is completely exhausted by her brood's out-of-control behavior: The oldest son, Khalin, 7, has attention deficit/hyperactivity disorder (ADHD), the middle child, Kolben, 5, is overly aggressive, and little Kadance, 2, is learning all of her big brothers' worst tricks. The kids' aggression and utter lack of respect, coupled with Dad acting like another child in this family, has Karolee frustrated and fed up.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-03-05","episode_number":12,"episode_type":"standard","id":669602,"name":"Williams Family","overview":"Jency Williams is a single mother who works two jobs and relies heavily on her elderly grandparents to help her out with her three children, Bradley, 12, Kelsee, 10 and Hagan, 5. Jency's grandparents, who include Hal, a former catcher for the Cardinals, not only drop the children off and pick them up from school and care for them after school, they're also counted on to discipline the kids. The youngest, Hagan, treats Jency like a punching bag, hitting, punching, kicking and throwing things at Mom. The siblings continually fight with each other and do not listen to Jency. She feels that nothing she does works, and sometimes can't wait to escape to her job. The grandparents worry about what Jency will do when they aren't able to help her any longer.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-03-12","episode_number":13,"episode_type":"standard","id":669603,"name":"Walker Family","overview":"Anthony and Alice Walker have their hands full. They have three children -- Anthony Jr., 12, Naleila, 6 and Alyssa, 17 months -- plus Marcus, a nephew who lives with them full-time, and a thriving daycare business based in their home. Mom's outsized personality and attitude has rubbed off on the kids, and they're doing whatever they feel like. Unsure of how to regain control, she resorts to chasing after the kids through the house, trying to catch them to mete out punishment. Meanwhile, Dad is just looking for a little peace and quiet and a good night's sleep. Naleila has her own room, but has spent the last six years sleeping in her parents' bed, and, since Mom is constantly either feeding or holding Alyssa, the baby sleeps there too -- a tight fit for all. Anthony Jr. talks back to Mom, hassles his little sister and has hit the age where he feels the need to battle his father for independence.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-05-28","episode_number":14,"episode_type":"standard","id":669604,"name":"Cantoni Family","overview":"Nina and Paul Cantoni are at odds on how to raise their children -- Nicholas, 6, Gabrielle, 3, and Giana, 10 months. Mom is overwhelmed, especially by the headstrong Gabby who is prone to biting and tends to dominate the family dynamic. Dad is wrapped around Gabby's finger, and thinks he's defusing the tantrums by giving into them, undermining Mom as she tries to hold a hard line. Big brother Nicholas could use more quality time with Dad, but strives to get attention by acting out and talking back. Bedtime is a farce -- the household falls into turmoil as Gabby stalls goodnights by requesting drink after drink, changing her mind about her beverage preference, with Dad hopping to it.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-06","episode_number":15,"episode_type":"finale","id":669605,"name":"Amouri Family","overview":"With four kids under four, this Supermom needs Supernanny. While she's a funny character for outsiders to laugh at, three-year-old daughter Hailey's antics aren't humorous for her mom, Tamara. From using the \"B\" word to hitting Mom and Dad, Hailey, as \"Daddy's Little Princess,\" thinks she's the one running the show. Adding to the chaos are twins, Jianni and Julian (age 2), with an escape plan cleverly executed every time Mom turns her back. These two get out of the house every chance they get, even getting past the child-proof latch. Rounding out the fearless foursome is baby Ashton (10 months), who gets kicked in the stomach and punched by jealous older brother Jianni. Capping it off, Dad Michael is out late every night with friends, avoiding his responsibility at home.","production_code":"","runtime":60,"season_number":3,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":36838,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"52587fdb760ee34661380120","air_date":"2008-01-02","episodes":[{"air_date":"2008-01-02","episode_number":1,"episode_type":"standard","id":669607,"name":"Drake Family","overview":"Donna and Billy Jo Drake have three adorable but extremely lively kids (Josie, four, and three-year-old twins Jared and Justin), and they often lean on Donna's mom, Mimi, who lives next door, for childcare. Mimi is a lifesaver, helping out with the children, whom she emotionally calls \"her heart.\" But the kids are such a handful that Supernanny worries they'll give Mimi a heart attack! When Mimi gives the twins a time out, she's literally pulled in different directions on the floor by their squirming and defiance, because she insists on holding on to them the whole time. Plus, the Drakes have a beautiful new RV, perfect for family vacations, but the parents are so over-protective with the kids that just a family walk induces parental panic.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-02","episode_number":2,"episode_type":"standard","id":669608,"name":"Chapman Family","overview":"Supernanny has gotten the call from the Chapman Family -- but not from Mom and Dad. Teenagers Brittany (16) and Moriah (14) reached out for help parenting their three little brothers, twins Ethan and Cole (4), and Quinn (3). The beleaguered teens are also expected to homeschool themselves each day. Where are Mom and Dad? After years of being a stay-at-home Mom, Sara's gone back to work, starting her own photography business. She now relies heavily on her oldest two kids for childcare duties, but it's not working for the teenagers or their young siblings. And Dad Glenn doesn't see the problem with Britney and Moriah helping out so much that he never has to change a diaper!","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-09","episode_number":3,"episode_type":"standard","id":669609,"name":"Schumacher Family","overview":"Meet the Schumachers, the ultimate 21st century American family -- hard-working parents who strive to give their beautiful children everything--everything, that is, except boundaries, responsibilities and goals. So, instead of gratitude, the kids have attitude, in abundance. The oldest, Jessica (14), belittles her parents for not giving her more expensive things and having a bigger home (their house is quite sizable, but she calls it \"a dump\"); Alexi (11) is constantly online with a social networking site, pretending to be older and chatting with strangers. Dylan (7) is bored, so he amuses himself by cursing, obscene gestures, hitting, spitting, kicking and punching. Parents Teri and Brian can't understand why their kids treat them like servants and complain so much.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-16","episode_number":4,"episode_type":"standard","id":669610,"name":"Du'an Family","overview":"Angela and Forrest An-Duan have their kids completely overscheduled with over 40 activities a week for the five young children: Christopher, 9; Isabella, 7; twins Lawrence and Benjamin, 6; and Charlotte, 4. The parents feel that they're helping their kids by exposing them to so many lessons -- Chinese, chess, art, piano, tutoring, violin, tennis, Scouts, math class, music appreciation, writer's workshops and more -- but instead everyone is exhausted and stressed out. Often Mom resorts to having the kids eat dinner in the car, and the children don't get to bed until 10:00 p.m., when they've finally finished their homework. The three boys rebel by hitting, punching, kicking, spitting, pulling hair, talking back and picking on their sisters; discipline is non-existent, and the oldest child, Christopher, is in a power struggle with Mom. The parents are so overwhelmed that they've delayed moving into the beautiful new home they finished building six months ago!","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-23","episode_number":5,"episode_type":"standard","id":669611,"name":"Terrill Family","overview":"This single dad needs a clue about parenting. Before he got custody of his two boys, Lane (11) and James (5), Scott Terrill had never even given them a bath. Now he's got to step up. But in an effort to avoid giving his boys the harsh childhood he had, Scott has gone to the other extreme: zero discipline has led to a house run by tantrums, fights, screaming and slammed doors. Dad serves nothing but junk food, and now his 11-year old already has a cholesterol problem. Jo worries that the child may have a heart attack before he turns 18!","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-30","episode_number":6,"episode_type":"standard","id":669612,"name":"Dostal Family","overview":"Brenda and Bill Dostal think that the problem is with their misbehaving son, but Jo quickly realizes he's just acting out due to Mom and Dad's problems. Five-year-old Zachary literally chases Mom around the house trying to claw her when she attempts the timeout technique. Her arms are bloody after his attacks! His little sister Erin, 3, is overshadowed by Zachary's outrageous behavior. Bill blames Brenda for not controlling Zachary, and Brenda doesn't trust Bill to curb his own temper when dealing with the children. As a result, communication between the parents has shut down, and Zachary is so naughty that play dates are fraught with trouble. Brenda fears her marriage may not last if they don't get help.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-13","episode_number":7,"episode_type":"standard","id":669613,"name":"Daniels Family","overview":"Jo has her most fiery face-off ever with a checked-out mom who has let things go for too long at home. Lisa and Steve Daniels have six beautiful children ranging in age from 2 to 13, but the pretty picture ends there. Chaos rules, not the parents. Spitting, cursing, hitting, nasty threats and general misbehavior are commonplace among the kids. Mom thinks her middle daughter, Alexus, acts like \"a wild animal\" and pegs her oldest daughter, Halley, 12, as the biggest culprit. But Halley is often reacting to Alexus' taunts, and seems to be held to a higher standard than the other kids, being the only child to have chores assigned her. Meanwhile older brother Josh, 13, just retreats into his room for computer games while his five sisters act out, and Mom ignores the bedlam. Dinnertime is a free-for-all of food fights, random noshing and family members scattered about, while the dining room stays empty. The kids are so out of control that the parents have given up on trying to manage them or teach them otherwise.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-20","episode_number":8,"episode_type":"standard","id":669614,"name":"Wilson-Knutson Family","overview":"Pop star Wendy Wilson and her husband, Dan Knutson, make history as the first celebrity parents to enlist Supernanny's help. Wendy, who rose to fame as part of the multi-platinum trio Wilson Phillips, is now a stay-at-home mom working on being the best mother possible after having four sons in five years. As the daughter of Beach Boys' Brian Wilson, she was raised in a household where the children had few boundaries, and is often a pushover with her rambunctious toddlers, Leo, 4 and Beau, 3. Husband Dan, a former rock singer, was raised just the opposite way, with clear-cut rules and a strict schedule. Having had twins Willem and Jesse just six weeks prior to filming, Wendy and Dan are exhausted, overextended, and realize that their current parenting style won't work.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-27","episode_number":9,"episode_type":"standard","id":669606,"name":"Tafoya Family","overview":"Holly and Jimmy Tafoya can’t quite figure out why cursing, spanking and washing their kids’ mouths out with soap aren’t working as discipline tactics. And when Supernanny steps in, Holly shows her the door!","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-05","episode_number":10,"episode_type":"standard","id":669615,"name":"Prescott Family","overview":"Kadi and Daniel Prescott have seven children, ranging in age from one year to eight. Kadi's own father left her family when she was just 13, after coming out of the closet. Kadi is still hurting from this experience of abandonment, and her husband, Daniel, is resistant to their young family having a closer relationship with her dad because of his sexuality. This emotional distance from her own father is a true heartache for Kadi, who also feels she's falling short as a mother: She loses her temper too frequently with the kids, especially with seven-year-old Daniel, who was recently diagnosed with Attention Deficit Hyperactivity Disorder. She relies on her oldest daughter, Marli, who's eight, to be the \"mini-Mom,\" as Jo says, giving the youngster more responsibility than the other kids combined. On top of all this, Kadi doesn't have any friends within 45 minutes of their home, and feels lonely and isolated. Enter Jo, who tries to bridge the gap between Kadi's father and the family, help Kadi build a support network, and show both parents how to manage Daniel better.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-12","episode_number":11,"episode_type":"standard","id":669616,"name":"Banjany Family","overview":"Lisa and Rich Banjany of Staten Island, New York have a home business, Confuzzled Cookies, which has taken off like a rocket. But they have no control over their three kids -- twin five-year-olds Cameron and Zoe, and Blake, three -- which threatens to affect the promising start-up while making daily home life miserable. Blake likes to play dress up with his sister, which concerns Dad greatly. The boys fight like barroom brawlers, and though Zoe is usually well-behaved, when she's not, she's a complete handful -- and she establishes an ignominious \"Supernanny\" record, taking three and a half hours to stay put for a five-minute timeout. Any attempt at drawing the line between work and home life is \"confuzzled\" indeed! Lisa admits the kids are running the household when they act out, bite their parents and snack out of the pantry and fridge all day long.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-19","episode_number":12,"episode_type":"standard","id":669617,"name":"McKeever Family","overview":"Jo faces the most aggressive and foul-mouthed duo ever in the McKeever boys, Hunter, 7, and River, 6. They greet her by hitting her and calling her names, shocking, but sadly typical, because they are both extremely violent and disrespectful. In fact, they persist in hitting and kicking Jo throughout her work with the family. Days and nights are filled with the terrible twosome destroying the home, using potty language, as well as smacking, kicking, and biting each other and their parents. Stay-at-home mom Lisa is so embarrassed by the boys that she doesn't want to go out in public with them, and her husband Corey works long hours, avoids interacting with his sons when he's home, and shockingly, claims Lisa has it \"easier\" than he does. Jo has a heated exchange with Corey, telling him to grow up and end his selfishness, and he angrily walks out of the room.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-02","episode_number":13,"episode_type":"standard","id":669619,"name":"Addis Family","overview":"Still reeling from the sudden loss of their live-in grandfather, the entire Addis family is in turmoil. Granddad was actually the man of this family. Dad is now struggling to fill his father-in-law's shoes and claim his role as patriarch. With four out-of-control and disrespectful children at home all day long, Mom is juggling the demands of three jobs at once -- mother, homemaker and home-school teacher to her four children.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-09","episode_number":14,"episode_type":"standard","id":669618,"name":"Citarella Family","overview":"The four Citarella kids, ages seven, six, three and one, run \"a three-ring circus around me,\" according to Mom Debbie. In spite of the chaos, she laughs all the time, even as her children flout her rules. Dad Joe admits that his kids' uncontrollable behavior has taken the fun out of parenting, and he retreats by wearing earplugs whenever he drives the kids around. He's a police officer in a small town, but three-year-old daughter Sarah has taken to shoplifting! Even baby Joshua at one year is a feisty \"brute\" who defies his parents' wishes. A simple trip to the drug store with the four children sets off all kinds of acting out, and an overwhelmed Debbie becomes panicky and breathless. Jo has some stern words for the laughing mom, who Jo thinks isn't serious about changing.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-23","episode_number":15,"episode_type":"standard","id":669620,"name":"Schrage Family","overview":"\"It's musical beds,\" the sheepish dad, Kyle, admits about his family of five, and the parents haven't slept in the same bed in eight years! Jo actually tucks mom into bed with two of the kids during observation time, and later says it's amazing the couple ever had three children, considering how little time they have alone. Stay-at-home Mom Christy drags through the day, too timid to enforce boundaries or discipline for fear her children won't like her, and too detached to engage her lively young girls, Ellie (10), Emma (6) and Cara (4), during playtime. The walls throughout the house are covered with the kids' graffiti. Live-in grandma \"Memaw\" has little privacy, as her grandchildren troop in and out of her rooms with no respect for her belongings. In addition, four-year-old Cara still uses a pacifier because Christy is prolonging her youngest's babyish tendencies.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-04-30","episode_number":16,"episode_type":"standard","id":669621,"name":"Clause Family","overview":"The Clause kids -- Brandon, 10 and Caila, 8 -- are \"tweenage terrors,\" disrespectful, manipulative and resentful, but the key to change rests with their parents. Mom is a pushover, and Dad is too laid back and laissez faire. Entering their pre-teen years, these kids are at a critical point when they need a solid relationship with their parents, which is lacking now. Behind the kids' backtalk, swearing, verbal threats and toddler-like tantrums are years of dysfunction, disorder and chaos. Dad especially fears never having a close relationship with his kids and losing them completely.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-05-07","episode_number":17,"episode_type":"standard","id":669622,"name":"Martinez Family","overview":"Dad, Sindo, is a civilian contractor in Iraq, leaving his wife, Michelle, home alone for five months at a time with three rambunctious children -- Sindo, 9, Ashley, 7, and Mikey, 6. Mom is easily overwhelmed and rides a daily rollercoaster of emotions, waiting for Dad's regular email to reassure her that he has survived another day. Her frequent crying, yelling and overreaction to the kids prompts the children to respond in kind with hostility and behavior that quickly spirals out of control. Ashley throws giant temper tantrums in public, so Mom is reluctant to take the children out. She feels enormous pressure to fill the role of both mother and father, and though Dad calls as often as he can, phone warnings hold little threat when he's half a world away.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-05-14","episode_number":18,"episode_type":"standard","id":669623,"name":"Browning Family","overview":"It's a full house for Reverend Browning and his industrious wife, Bernadette, as they try to maintain peace in their well-appointed suburban home where the six children range in age from toddler all the way up to college age. Mom is so busy running her real estate business from home that she doesn't have time for the kids. Mom and Dad want their home to be a sanctuary, but it's becoming a battleground.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-05-28","episode_number":19,"episode_type":"standard","id":669624,"name":"Doyle Family","overview":"The Doyle children all attend a daycare where Lizzie (three) has a record of complaints from other kids and parents that's got her on the brink of being kicked out of the pre-school. Five-year-old Sara is busy cutting her own hair with her mom's sewing kit, and young Andrew (18 months) is developing his own attitude based on his two sisters' bad behavior. Jo will have a chance to take her skills into the classroom to help Brandy and Dwight Doyle get their children to be more respectful out in public as well as at home.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-06-25","episode_number":20,"episode_type":"standard","id":669625,"name":"Moy Family","overview":"Since Dad, Harding, has taken a job that requires him to travel away from home Monday through Thursday every week, his oldest daughter, Hailey, 11, acts out, setting the tone for behavior for her siblings, who then misbehave too. Hailey openly discusses how much she hates her sister, eight-year-old Camryn. She pulls her sister's hair and belittles her, trashes her four-year-old brother Matthew's projects and defies discipline around the clock, driving her helpless mom, Michelle, to tears. Hailey even hits her mother when she doesn't like what she hears. When Dad's at home, he is no more effective in enforcing discipline.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-05","episode_number":21,"episode_type":"finale","id":669626,"name":"Krolikowski Family","overview":"Shannon and John both have high profile jobs at a large church, but their home is a far cry from a peaceful sanctuary. All four of their children fight with each other so viciously and so frequently that mom usually intervenes only if someone has drawn blood. That happens regularly because the kids bite, pinch, kick and pull hair for all they're worth. Mom's yelling isn't working, and Dad says he spanks to discipline, since he doesn't believe that timeouts or talking work. But in spite of the hardline tactics, neither parent has much authority.","production_code":"","runtime":60,"season_number":4,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":36839,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"52587fdb760ee3466138012b","air_date":"2008-10-03","episodes":[{"air_date":"2008-10-03","episode_number":1,"episode_type":"standard","id":669627,"name":"Quinn Family","overview":"“We’re at a total loss,’ says mom Gina Quinn, who’s having to control four out-of-control tweens and teens who swear like sailors, refuse to do their chores and are verbally aggressive with mom and with dad David, who just laughs at the kids’ antics…","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-10","episode_number":2,"episode_type":"standard","id":669628,"name":"Baulisch Family","overview":"Dorothy and Kip Baulisch of Papillion, Nebraska, are deaf parents raising four hearing children. They rely too heavily on their eldest daughter, Melissa (18), who understands sign language, as a surrogate \"hearing\" parent, and it's put a huge strain on her relationship with them. She's giving up her youth to be a full-time interpreter in her own house. The three youngest daughters are nightmares -- Jessica (8) and Jennifer (7) challenge their parents to the point where they simply give up trying to control them; the youngest daughter, Kristin (5), ignores her parents completely because she can't understand what they're saying, and constantly throws temper tantrums. On a typical evening in the Baulisch household, it takes Kip and Dorothy at least three hours to get the younger girls to bed, as they run amuck through the house, refusing to settle in.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-17","episode_number":3,"episode_type":"standard","id":669629,"name":"Park Family","overview":"The oldest Park child, Kyle, 6, has attention deficit hyperactivity disorder (ADHD), but his parents took him off medication when they didn't feel it was working. So he terrorizes his nanny, Alejandra, who cannot control him, as well as his younger siblings, Farley, 4, and Pierce, 2. All the children act out, refuse to follow instructions and take dangerous risks, such as playing in the swimming pool when it's forbidden, but the parents, Heather and Michael, are clueless about establishing control or maintaining boundaries. The kids not only smack each other with abandon, but hit their parents and Alejandra at will.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-24","episode_number":4,"episode_type":"standard","id":669630,"name":"Winter Family","overview":"Chiropractor David often acts like a big kid, laughing at the kids' antics even when they cross the line, and leaving Gina, a personal trainer, to referee on her own. She admits, \"We are at a total loss.\" 14-year-old Casey, who is a wrestler at school, is very physically and verbally aggressive at home with his siblings and parents. He punches, shoves and hits, and has a bullying style, whether dealing with his big sister, Cally, 16, or younger sibs Corey, 10 or Carli, 9. All of the children swear like sailors and refuse to do chores, stubbornly saying that they're not paid enough per chore! Gina admits that she doesn't enjoy being around her kids, and husband David erupts in nervous laughter whenever the children defy him. His physical horseplay with Casey results in Dad getting injured, but he laughs it off, to Jo's amazement.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-31","episode_number":5,"episode_type":"standard","id":669631,"name":"Newsome Family","overview":"In today's economy, you can have it all one minute and lose everything the next. This is what has happened to single mom Blythe Newsome. For 12 years she was married and lived with her six children in a huge suburban home. But, for financial reasons, the house went into foreclosure. Blythe tried to keep her marriage together, but eventually she took the kids and filed for divorce. Fast-forward to today-- Blythe hardly recognizes her life. She's moved with her children into a tiny house and has totally lost control of the kids. She's now the breadwinner for a family of seven.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-07","episode_number":6,"episode_type":"standard","id":669632,"name":"Manley Family","overview":"John and Sarah Manley have been separated for over six months. John has his own apartment but has tried not to disrupt his children's lives, so he has daily meals and spends every weekend in the family home, but overnights in his own apartment. The children, Max, 7, and Claire, 4, can't quite figure out what's going on, but they handle their worry and confusion by acting out with anger, backtalk, fighting and tantrums. A simple trip to the grocery store is so fraught with the kids' antics that Sarah cannot keep track of their whereabouts, and shoppers won't even go down the same aisle as the Manleys. Sarah finds it hard to hold her ground in the power struggle with her kids, partly because she's nearly as confused as they are about the state of her marriage.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-14","episode_number":7,"episode_type":"standard","id":669634,"name":"Howat Family (U.K. Family)","overview":"Jo travels all the way to the UK on a rescue mission to help a single mom who has lost control of her children... and her own temper. Tara Howat is at her wits' end, overwhelmed by the daunting task of raising three children by herself. When she is at the breaking point, Mom's mood can be explosive. Tara's youngest son, Rhys, is a handful -- kicking his mother and swearing like a sailor. Even middle-child Shannon joins in to gang up on mom.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-21","episode_number":8,"episode_type":"standard","id":669633,"name":"Lewis Family","overview":"Before he died, dad Dwight Lewis called on Supernanny to ask if she could help his wife Antoinette cope with parenting alone while she grieved his loss. Can Jo help widowed Antoinette Lewis find a routine – and peace of mind?","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-12","episode_number":9,"episode_type":"standard","id":669636,"name":"James Family","overview":"NBA guard Mike James faces off against a foe more formidable than his opponents on the court � Supernanny has a bone to pick with him. Mike plays for the New Orleans Hornets, but his family lives in Houston, Texas. His wife, Angela, just gave birth to their fourth little girl, and Mike has dubbed his wife Super Mom, but parenting isn't a slam dunk for this family. These parents are making one technical foul after another. Angela admits the kids are out of control; eldest daughters Jadon and Amaya totally ignore her, and push, shout and shove each other for Dad's attention. When Mike is home, they're so excited to see him that it becomes absolute chaos.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-09","episode_number":10,"episode_type":"standard","id":669637,"name":"Kerns Family","overview":"Wisconsin parents Shawn and Shannon thought it would be fun to have a baby. They were only 18 at the time, and were stunned to discover that Shannon was pregnant with twin boys. The early years with Bryce and Brandon were relatively easy with the help of both sets of grandparents, but now those days are a distant memory, with the addition of a daughter to the mix. The twins, now four years old, have outgrown toddler stage and know how to flip their parents the bird, hit, kick and curse like sailors when they are told \"no.\" Their baby sister, Brenna, 18 months, is often the victim of their violence, and she mimics her brothers' aggressiveness, hitting them as well as other children. Mom and Dad know they were passive for too long, but now they're begging for help and don't know where else to turn.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-23","episode_number":11,"episode_type":"standard","id":669638,"name":"Gormley-Brickley Family (U.K. Family)","overview":"Jo handles two sets of twins at once for the first time when she returns to the UK on a mission to save a family on the brink. The Gormley-Brickley household is in desperate need of help. Usually one set of twins spells trouble, but two sets, all under five years of age, is chaos. These children are treated like babies by parents who don't want them to grow up, but that's only half the problem. Mom is at the breaking point and seriously needs relief, but Dad is exhausted as well.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-06","episode_number":12,"episode_type":"standard","id":669639,"name":"Costello Family","overview":"Amy always dreamed of having 12 kids, but she had no idea how hectic it would be. With husband Dale on the road most of the week as a truck driver, and 10 kids ranging in age from 6 months to 15 years old to take care of at home, Mom is so overwhelmed that she's unloaded half of her parenting responsibilities onto her teenaged kids. The younger children couldn't care less who is disciplining them; whether it's eldest brother Logan, 15, or their own father, the six kids under 12 have no respect for authority, barely do chores and revel in the chaos. Meanwhile, Logan and his teenaged sister, Carley, 14, have little time with their own parents or friends because they're wrapped up corralling their younger siblings. In the midst of this, an unexpected family secret is revealed that affects everyone in the house.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-13","episode_number":13,"episode_type":"standard","id":669640,"name":"Davis Family","overview":"Phil Davis smacks his children and curses at them. He expects Debbra, a working mom, to handle all childcare responsibilities for their family, as well as cleaning the house, but she can never meet his standards and he offers no help. He ridicules stepdaughter Morgan, 15, for dressing provocatively when she dresses modestly. Chaotic mornings filled with yelling and lots of childcare duties have resulted in Morgan, an excellent student, being late for school almost every day this term. Jo tells Phil that his behavior is going to break his children's spirits.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-20","episode_number":14,"episode_type":"standard","id":669641,"name":"Sachs Family","overview":"Greg and Fanci Sachs work long hours to provide Ryan, 5, and Jonathon, 3, an Upper West side childhood, but their guilt over time away from the boys weakens their resolve in the face of Ryan's tantrums. The youngster will have a complete meltdown in public when he doesn't get his way and it's making a big impression on Jonathon. The apartment is stuffed to bursting with kid gear and toys, since Mom buys toys three times a week at the boys' request, and the family owns 7 strollers, 4 of which are strewn around the cluttered home. Ryan's got separation issues with Fanci -- whenever she leaves the house, he clings and cries, and she unwittingly plays into it by prolonging her departures with lots of discussion and reassurance. Bedtime is a nightmare, and usually ends with both parents lying down with the boys till they eventually fall asleep. Later the boys join their parents in bed anyway, leaving everyone exhausted the next day.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-27","episode_number":15,"episode_type":"standard","id":669642,"name":"Williams Family (U.K. Family)","overview":"Jo returns to the UK on a mission to save the Williams family from absolute mayhem. With four children under 10, life is hectic and stressful for mom Natalie and dad Martin. Natalie does the majority of the childcare while Marin sits on the computer and watches her struggle. The strain the kids put on their parents' relationship leaves mom and dad arguing constantly about how to raise them. Natalie is at the breaking point, and Supernanny is her last hope. But it's not only the children who need disciplining--Martin is in for a shock too!","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-13","episode_number":16,"episode_type":"standard","id":669644,"name":"Del Re Family","overview":"Adele Del Re of Staten Island, New York, grew up fantasizing about motherhood. She had visions of herself as a serene caretaker and contented, quiet children, but the reality couldn't be more different. The Del Re household is the wildest one of the block. Mom and Dad both yell at ear-splitting levels to control their misbehaving kids. The four-year-old twins throw daily tantrums and engage in biting, slapping, throwing or hitting everyone in the house. Mom has a new fantasy for her household and she hopes Supernanny can help. In this version, it's not perfect, but there's much less yelling and fighting, and occasionally a babysitter and a night out.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-20","episode_number":17,"episode_type":"standard","id":669643,"name":"Goldberg Family","overview":"It may be sunny in Tucson, Arizona, but there's stormy weather at the Goldberg house. Parents Adam and Shelby have their hands full with their three young children. Although the kids act tough, in other ways they refuse to grow up. Jacob, 6, still sucks his thumb and will not let go of his \"blankie,\" while little sister Jayden, 3, clings to her binkie and throws temper tantrums at the mere suggestion she give it up. Jacob has violent outbursts and, together with his twin, Joshua, plots attacks against their sister and mother. Neither parent knows how to control the kids or give them consequences for their actions, and Dad finds it hard to control his temper.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-27","episode_number":18,"episode_type":"standard","id":669645,"name":"Sacco Family","overview":"Elyse is a stay-at-home mom and Big Eric is a double shift-working dad who says his third job starts when he gets home. Little Eric, Ashley, Luke and Lily rule in a home with no rules. Add them all together, you get the Sacco Six. Two-hour tantrums at bedtime, fast-food dinners, and entire loads of laundry dumped in the shower for storage. On top of this, Jo discovers condoms in the 13-year-old son's bedroom and prompts Dad to confront him.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-10","episode_number":19,"episode_type":"standard","id":669646,"name":"Porter Family (U.K. Family)","overview":"Jo returns to the UK to rescue the Porter family, who are being held ransom by their nine-year-old daughter. Princess Maddison is a terror, ruling with a heavy hand and throwing tantrums like a toddler to get her way. To make matters worse, seven-year-old Harry is quickly following in his sister's unruly footsteps. With both parents treading on eggshells, can Supernanny restore order -- or is this one battle of the wills that can't be won?","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-04-17","episode_number":20,"episode_type":"standard","id":669647,"name":"DeMello Family","overview":"It's been called hell on earth, and parents Don and Diane admit they are living with \"little devils.\" With kids who delight in demolishing the house and are prone to fierce rages, Don and Diane don't know how to control the physical and mental torture the kids impose on their own siblings and parents. Don has to psyche himself up to enter his house, while Diane is running out of energy trying to keep up. Her time is so tight due to the kids' misbehaving that cooking dinner or even answering the phone seem to be impossible tasks.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-01","episode_number":21,"episode_type":"finale","id":669648,"name":"Krolikowski Family","overview":"Shannon and John both have high profile jobs at a large church, but their home is a far cry from a peaceful sanctuary. All four of their children fight with each other so viciously and so frequently that mom usually intervenes only if someone has drawn blood. That happens regularly because the kids bite, pinch, kick and pull hair for all they're worth. Mom's yelling isn't working, and Dad says he spanks to discipline, since he doesn't believe that timeouts or talking work. But in spite of the hardline tactics, neither parent has much authority.","production_code":"","runtime":60,"season_number":5,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":36840,"poster_path":null,"season_number":5,"vote_average":0},"6":{"_id":"52587fdb760ee34661380136","air_date":"2009-10-23","episodes":[{"air_date":"2009-10-23","episode_number":1,"episode_type":"standard","id":669655,"name":"Colier Family","overview":"The Coliers of Cleveland, Georgia, are a blended family on the brink. Dad Jason coddles his three young sons under the age of 5, but is hostile to his 13-year-old stepdaughter, Madison, whom he adopted last year. Jason showers his little boys with affection but his relationship with Madison is frosty and contentious -- she doesn't call him \"Dad\" and says he doesn't seem like one; he counters by saying she's a pathological liar and carries on \"like a moron.\" Jason also spoon feeds his three-year-old and holds the older boys back from gaining valuable life skills by doing everything for them.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-30","episode_number":2,"episode_type":"standard","id":1568661,"name":"Simmons Family","overview":"Debra and Tracy are pushover parents with two sets of twins, ages four and seven, who call all the shots and eat a diet packed with sugar and unhealthy food choices. Four-year-old Parker calls Mom a \"butthead\" with no consequences; Debra hides in the bathroom to eat a meal and get a moment's peace. Dad Tracy works from home, and when his rambunctious children need disciplining, he meekly implores them not to misbehave. They respond by locking him out of their bedroom!","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-06","episode_number":3,"episode_type":"standard","id":1568662,"name":"Phelps Family","overview":"Jo Frost travels to the deep South -- Hayden, Alabama -- and faces off with Amy Phelps, who defends her right to spank her three boisterous boys. Dad Jimmy is open to change, but Amy won't budge, and this issue is bringing their marriage to the breaking point.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-13","episode_number":4,"episode_type":"standard","id":1568663,"name":"Naskiewicz Family","overview":"A Florida family with four children ranging in age from two to twelve is ruled by the crown prince -- Zachary, an impulsive, tantrum-prone four-year-old. Jen, a beleaguered stay-at-home Mom, cowers to his every whim, and doesn't enforce any kind of discipline. Her approach is to gently enfold the children in hugs or eventually give in. Roy, a painting contractor, would rather work on the computer at the end of the long day than help Jen with the kids, but when he does try to impose rules and consequences, his short fuse and yelling intimidate the children and have driven his wife to threaten divorce.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-27","episode_number":5,"episode_type":"standard","id":669656,"name":"McGrath Family","overview":"Bill and Tammy McGrath of Hamlin, New York, have three beautiful young children, and their middle son, Aiden, 5, was recently diagnosed with Type 1 diabetes. Managing his illness is very anxiety-provoking for Tammy, because she saw her father die of diabetes at just 46 years of age. She sees Aiden's diagnosis as her worst fears realized, and mealtime has become a battlefield. Aiden makes power plays, refusing to eat, which not only threatens his own health and frightens Tammy, but causes problems for both parents in adjusting Aiden's insulin levels. The other kids, Liam, 4, and Paige, 9, feel their parents' distraction and are frustrated by it -- Paige hides out in her bedroom and Liam acts out aggressively.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-11","episode_number":6,"episode_type":"standard","id":669654,"name":"Beck Family","overview":"Nicole and Nate Beck are classic tag-team parents. Nate works full-time and Nicole stays at home, works part-time AND is a full-time student. Add to the mix three boys -- Hunter, 9; Pierson, 5; and Bronson, 3 -- who offer huge challenges. The youngest has just been expelled from pre-k, spits at Mom and calls Supernanny a curse word; the oldest has attention-deficit disorder, and homework time hangs like a black cloud over each day as the yelling just escalates; and the middle son is extremely stubborn and contradictory.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-18","episode_number":7,"episode_type":"standard","id":669651,"name":"Heredia Family","overview":"Christina and Joe Heredia both work full-time and have four children under five years of age: triplets who have just turned two -- Samantha, Taylor and Ryan -- and older brother Brandon who is four. Christina is a well-meaning perfectionist who always tried to please her dad. Now, as an adult, she frets that strangers will judge her mothering skills, but in fact she's her own harshest critic, brought to tears by what she feels is her inability to deal with the challenges of raising these little ones. The simplest tasks are three times harder with the triplets -- they cannot be trusted to obey Mom on a short walk through the neighborhood without straying; Brandon tries to get attention from his parents by acting out; and all of the children disrupt mealtime, barely eating.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-08","episode_number":8,"episode_type":"standard","id":669653,"name":"Benton Family","overview":"Christina and Joe have four children, Brandon (4) and triplets Samantha, Taylor and Ryan (2). The triplets were premature births, and need to eat properly for growth, yet barely touch the food on their plates. Brandon often feels left out with all the attention given to the triplets, and Christina is a perfectionist who is very self-critical of her parenting skills.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-15","episode_number":9,"episode_type":"standard","id":669657,"name":"Hallenbeck Family","overview":"Patricia and Greg are grandparents who should be enjoying their golden years. Instead, 25-year-old daughter Kristin Hallenbeck still lives at home, and has two terrors -- Jordon (6) and Jaydon (4), whom she expects her mother to raise while she surfs the net, watches TV and texts friends. Kristin doesn't get along with her own parents and the lack of respect has carried into the next generation. The boys completely act out and, like their mother, have no respect for Patricia and Greg. They walk all over their grandparents who are exhausted by their constant fighting, backtalk and misbehavior. Kristen openly criticizes and undermines her mother over things like what her kids eat and whether or not the children need to follow their grandparents' wishes.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-05","episode_number":10,"episode_type":"standard","id":960599,"name":"Mann Family","overview":"Mark and Melissa Mann have four young children -- Naomi (5), whom they call the \"mistress of mayhem,\" and triplets Norah, Nathanial and Madeleine (3). Since the triplets' birth, Naomi has come to rule the roost with her defiance, screaming and tantrums, and the chaos spreads to the younger ones. The parents' discipline technique involves telling the children to \"trust and obey\" while paddling them with a wooden spoon, followed by a hug. But this isn't working at all, as the kids constantly push the boundaries, and Dad says he's \"downright desperate.\" He feels incapable of caring for the kids solo on occasion -- a simple outing to the local beach is a disaster, with the children running off into harm's way, and Mom is stung by angry comments directed at her by Naomi. In addition, getting the kids to bed is a nightmare.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-05","episode_number":12,"episode_type":"standard","id":1568676,"name":"Johnson Family","overview":"Kate and Roy Johnson thought it would be great to create a family business that all of them could enjoy. They spent much of their life savings creating The Coffee Park, a unique coffee shop and play-place for families to come and enjoy coffee while letting their little ones have a great time. Unfortunately, the Johnson children -- Denver, 4, Logan, 3, and Jack, 18 months -- have made it nearly impossible for anyone there to have a good time. The kids run around like they own the place, hit the customers' children, and are constantly disrespectful to the staff. As a result, Mom is left with the kids to do paperwork and bookkeeping from home, which is antithetical to the whole reason they built their \"family\" business.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-12","episode_number":13,"episode_type":"standard","id":960598,"name":"McKinney Family","overview":"Ashley McKinney can't balance being a single mother of two, a student, and a full time employee at a local bank. Her biggest wish is to have quiet time in order to get her school work done and become an accountant. Yet her two children make it impossible for her to do homework or maintain any semblance of order in the home. The kids have no sense of structure and keep Mom up into the early hours of the morning. Kaiden swears at his sister and mother, breaks furniture and toys, and constantly steals food from the refrigerator. His older sister, Kayla, defies Mom too. Ashley feels as if the kids are running the household and wants to reclaim power before it's too late.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-12","episode_number":14,"episode_type":"finale","id":960241,"name":"100th Episode Special","overview":"She's crisscrossed America, including Alaska and Hawaii, in her six seasons as the voice of reason for parents worldwide. Now Supernanny Jo Frost revisits some of her most memorable families in celebration of her 100th episode to find out how they're doing today.","production_code":"","runtime":60,"season_number":6,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":36841,"poster_path":null,"season_number":6,"vote_average":0},"7":{"_id":"52587fdb760ee34661380141","air_date":"2010-11-05","episodes":[{"air_date":"2010-11-05","episode_number":1,"episode_type":"standard","id":669659,"name":"Atkinson Family","overview":"Jo tries to help a married couple in Illinois with five children, including an openly defiant teen and a 4-year-old with separation anxiety.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-12","episode_number":2,"episode_type":"standard","id":669658,"name":"Peterfreund Family","overview":"Parents Keith and Sonya are so overwhelmed with their three older boys, Jett, 5 Gage, 3 and Trey, 2, that they're missing baby Myles' cues about wet diapers, feedings, etc. Mom literally has to run through the house after the active older boys with Myles hanging off her arm, head bobbing dangerously. Keith is a flight attendant and travels frequently, and Mom doesn't have enough arms for all the work! Neither parent is consistent about discipline, and their go-to punishment is \"saucing\" the three older kids, putting a dab of hot sauce on their lips.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-19","episode_number":3,"episode_type":"standard","id":669660,"name":"Swift Family","overview":"Jenny and Tony Swift in Sacramento, California, have five lively and unruly children, ranging in age from 11 years old down to a baby of 9 months. Jenny, a stay-at-home-mom, enlists several other authority figures to raise her kids, including a young nanny. The four boys play around the unfenced, unalarmed swimming pool, riding bikes near the edge and not even wearing helmets. They openly defy Kadie, jumping from bedroom dresser to bed. In addition, Jenny's mom, Gloria, pops in regularly to help out with the kids and is the only person who has instituted any kind of discipline that the kids respond to.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-03","episode_number":4,"episode_type":"standard","id":669661,"name":"Young Family","overview":"Traveling to a secluded island off Seattle, Jo meets Rikki and Jenye Young, who forego discipline in a misguided attempt to compensate for uprooting their three young sons so often. After four moves just this year due to Rikki's sales work, Nicco, 6, Makai, 4, and Crew, 21 months, are out of control -- and Rikki and Jenye are at their wits' end. The boys run wild in and out of the house, and sometimes their safety seems in jeopardy. Rikki can't sleep because little Crew consistently wants in his parents' bed. And when Dad occasionally tries to inject some discipline into the boys' lives, the result is explosive tantrums. To make matters worse, Mom's first instinct is to comfort her children, not to stand firm with her husband. With a fifth move looming, Rikki and Jenye increasingly worry about the long-term effects of the family frenzy on their sons' lives.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-10","episode_number":5,"episode_type":"standard","id":669663,"name":"Van Acker Family","overview":"A little dictator named Dylan rules the roost in the Van Ackers' Oak View, California, home, and parents Jessica, 34, and Kevin, 35, need to be liberated from his relentless tantrums and disrepect. Now three years old, Dylan refuses to be potty-trained and, worse, he's become anemic from his unbending preference for sugary snacks over vegetables and other nutritious foods. Supernanny Jo Frost embarks on a family revolution to instill parental discipline for the benefit of all, including six-year-old Emma, who can't even have quiet homework time with Mom without the distractions of her little brother's constant crying and complaining.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-17","episode_number":6,"episode_type":"standard","id":669666,"name":"Fernandez Family","overview":"A trip to Kissimmee, Florida, is no vacation for Supernanny Jo Frost as she finds the Fernandez family falling apart. Former high school sweethearts Jerald and Marla married young and now, years later, their relationship is in trouble. That's largely due to their inability to control their defiant 12-year-old daughter, Desiree, and two overly aggressive sons, Elias, 5, and Eulisis, 3. Mom's completely exhausted from trying to do it all, while Dad's frustrated and often unwilling to step up to the plate. Meanwhile, Desiree's developing a bad attitude and her grades are plummeting. And Elias and Eulisis are learning the wrong lessons -- that kicking, screaming and crying pay off to get what they want.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-07","episode_number":7,"episode_type":"standard","id":669662,"name":"George Family","overview":"Stay-at-home mom Joey-Lynn and her husband, Glenn, have five spirited daughters and a granddaughter all living under the same roof, and the exhausted couple have abdicated discipline. Their oldest, Samantha, 20, had a child as a teenager -- their granddaughter Krissy, now age 2. Joey-Lynn and Glenn had Samantha when they were teenagers themselves, and feel as if they have failed as parents since Samantha had a promising future that has been changed by her young motherhood. Samantha and her next-oldest sister, Brooke, 17, despise each other and curse at each other in front of the younger siblings -- Savannah, 10, Hailey, 6, and Haidyn, 1+1/2 -- who in turn act out with boundary-pushing and aggressive behavior. Mom defers all discipline to Dad, who simply yells and doesn't follow through.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-14","episode_number":8,"episode_type":"standard","id":669664,"name":"Miller Family","overview":"Traveling to Phoenix, Arizona, Jo Frost must help this family on the brink: Meshell can't say \"No\" and overindulges her children to make up for the extras she never had; David tries to instill some structure and respect, but he's exhausted from long days at work and too often shows his temper; without clear boundaries and consequences, the kids are mostly out of control - whether it's the youngest, Avarie (3), refusing to give up her bottle, or siblings Ainsley (5), Landon (7), Meryn (10) and Kendall (12) back-talking, fighting or leaving their clothes in a heap. The oldest Kesley (13) is increasingly troubled by her parents' mixed signals. She's considered responsible enough to babysit her younger sisters and brother overnight, but isn't allowed to go to an afternoon movie with her friends.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-21","episode_number":9,"episode_type":"standard","id":669665,"name":"Colombo Family","overview":"Stay-at-home mom Danielle, 33, is overwhelmed by her misbehaving two boys, Carlo, 4, and J.J., 3, while still trying to do her best with one-year-old Julia. While husband Joe works long hours, Danielle has to deal with J.J., who hits, kicks, slaps and pinches, and with Carlo, who is a picky eater and has a scream that, as his mom says, \"takes your breath away.\" Ironically Danielle was a parenting educator before having children, but she doesn't enforce her own house rules and has lost sight of her personal dreams in the chaos at home.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-04","episode_number":10,"episode_type":"standard","id":669667,"name":"Potter Family","overview":"\"This is my life, and it sucks,\" admits father-of-four Chris Potter. Chris and his wife, Joy, have four children who they feel are very disrespectful. Joy says that Chris is too \"old school\" -- yelling, scaring the kids, and being too strict and temperamental. Noah, 10, has a strained relationship with his father, who berates him as a brat when he's angry, and the younger siblings also come under fire. Chris feels that Joy is undermining him by challenging his parenting style, which his own mother didn't do with his dad when he was growing up.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-18","episode_number":11,"episode_type":"standard","id":669668,"name":"Merrill Family","overview":"While Marine Major Chris Merrill is stationed overseas for a year in Afghanistan, Mom Beckie, 33, is fighting another battle on the home front with their four young children. Garrett , 4 and Elena, 4, are cousins they adopted from Guatemala; Eddie, 6 and Lydia, 4, were adopted just three months ago from Ghana. Beckie tries to balance her desire for attachment with all the children with the firmness required to discipline them. Eddie and Lydia, the newest family members, grapple with frustration over still learning the English language and a great fear of the dark, since in Ghana there were real-life fears of violence at nighttime in their community. All the children feel free to run outside at will and ignore Mom, bedtime is fraught with turmoil, and mealtimes can be a battle zone. Compounding these challenges is the fact that Mom, at times, feels overwhelmed, outnumbered and at her limit, and very much on her own while her husband is away.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-25","episode_number":12,"episode_type":"standard","id":669669,"name":"Demott Family","overview":"A tough New Jersey cop and his wife find they're in over their heads when dealing with four-year-old triplets and their older brother, Timmy, who's 11. The little ones pester their big brother, destroy things, and run out of the house unsupervised. Dad says, \"We have three animals!\" The parents think that time-outs don't work, so Mom's method of discipline is to lock the kids in their bedrooms while they scream, and Dad's method is to surrender. Mom is at home full time with the children while dad works, and when he comes home, he's on duty while she heads off to her own job. The relationship between Timmy and his father has deteriorated since the triplets arrived.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-04","episode_number":13,"episode_type":"standard","id":669670,"name":"Froebrich Family","overview":"The Froebrich parents get no respect. Erich and Beverly have 5 children ranging in age from 1 to 11 years old, and admit they need a Supernanny intervention. The Froebrich children smack, pinch, yell, fight and talk back, and homework is a battleground in which Mom brings her 11-year-old son to tears. Beverly's mom lives with the family since Beverly's dad died, and she considers her daughter a control freak; the stress for everyone has gotten worse since the death. Mom doesn't discipline the kids at all, but Dad will smack the children with a wooden spoon, pull their ears, and put hot sauce on their lips -- but neither parent's approach works.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-11","episode_number":14,"episode_type":"standard","id":669671,"name":"Federico Family","overview":"Sylvia and Michael Federico have three boys, ages 2, 3 and 5. Mom openly admits she wants to be the fun mom rather than a disciplinarian. Both parents bribe the kids with junk food to get them to behave or to otherwise appease them. Mom brings a loaded backpack with sugary snacks when she takes the boys out in public to use for bribes if they misbehave or complain. The kids sneak snacks all day long, and the parents baby the children, especially Dominic, the 5-year-old. They brush his teeth for him, pick out his clothes and let him use the stroller at will, instead of his 2-year-old brother.","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-18","episode_number":15,"episode_type":"finale","id":669672,"name":"Evans Family","overview":"Because her own mother passed away from cancer, Supernanny Jo Frost can certainly sympathize with the Evans family children who lost their mother due to the disease. The father of the three young boys is doing his best to parent them on his own and as their mother would have wanted, but the whole family finds its situation overwhelming. Can Jo help this family settle into its new shape?","production_code":"","runtime":60,"season_number":7,"show_id":26353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":36842,"poster_path":null,"season_number":7,"vote_average":0},"8":{"_id":"5e0e73479f37b00015550df8","air_date":"2020-01-01","episodes":[{"air_date":"2020-01-01","episode_number":1,"episode_type":"standard","id":2036582,"name":"Braido Family","overview":"Working parents, Jessica and CJ Braido, feel they’re being overrun by their four small children and are at a loss at how to come together on their parenting perspectives. The only thing they can agree on is using electronics as a babysitting device in order to give them some peace. Can Jo get these parents to come together to work as a united front, or will war break out in the Braido household?","production_code":"801","runtime":60,"season_number":8,"show_id":26353,"still_path":"/nEs4GYyQhlr2fvKFykq2JoLOEt5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-08","episode_number":2,"episode_type":"standard","id":2036583,"name":"Corry Family","overview":"The Corry’s are a military family struggling to discipline their four daughters. While Ben, the father, is away with the army for months at a time, Maria, the stay-at-home mom, is left dealing with their rambunctious children and navigating her post-partum depression. Will Nanny Jo be able to dive into the trenches and rescue this family?","production_code":"802","runtime":60,"season_number":8,"show_id":26353,"still_path":"/yxqJcy2RxWh6RzWsoi3m6NDokuB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-15","episode_number":3,"episode_type":"standard","id":2036584,"name":"Richardson Family","overview":"The Richardson’s have found themselves at a loss managing their six fiercely independent kids and can’t keep up with the mess that follows them. But more importantly, Brittany’s four oldest children from her first husband are struggling with the recent passing of their father which is causing friction between them and their stepfather Ralph. Can Nanny Jo help this family cope with the loss of a loved one and come together as a blended family?","production_code":"803","runtime":60,"season_number":8,"show_id":26353,"still_path":"/dXStsPvsK1YoH0uH94EQXDDdgRj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-22","episode_number":4,"episode_type":"standard","id":2036585,"name":"Ostler Family","overview":"The Ostler's are struggling to control their two rambunctious boys while also still grieving the loss of their first child. Dane's occupation as a Wildland Firefighter often leaves his anxiety ridden wife, Nicole, on her own with the boys. With the oldest, Jax, craving more independence, Nicole's helicopter parenting style is only driving him further away. Can Jo help this mother work through her high anxiety while also allowing her children to become more independent?","production_code":"804","runtime":60,"season_number":8,"show_id":26353,"still_path":"/aMTFdww6x0KEd73S0tBP5L44sg9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-29","episode_number":5,"episode_type":"standard","id":2036586,"name":"Garcia Family","overview":"Stay at home dad, Anthony Garcia is struggling to understand his new role as the primary caregiver, while mom, Bethanie, can’t find her work, life balance. Now the children are ruling the roost amidst all the confusion and the parents are at their wits end. Can Jo help these young parents establish boundaries and respect within the household?","production_code":"805","runtime":60,"season_number":8,"show_id":26353,"still_path":"/8s1jzF3FuhkvOpGiqCRuXmqP8yZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-07","episode_number":6,"episode_type":"standard","id":2054765,"name":"Andersen Family","overview":"After their children were diagnosed with life-threatening food allergies, Dan and Miranda Andersen are constantly on guard for their family’s safety, which has led to conflicting parenting styles. Also, too much unsupervised screen-time has made the bedtime routine a nightmare. Can Nanny Jo help this family over-come their fears and get a good night’s rest?","production_code":"806","runtime":60,"season_number":8,"show_id":26353,"still_path":"/frpIrbK1tm7UJVK3nbMlzi9pRcQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-14","episode_number":7,"episode_type":"standard","id":2054766,"name":"Davis Family","overview":"Mom, Kristi is overwhelmed and frustrated having to discipline her three girls while her husband, Diarmid, timidly passes the buck. Kristi has resorted to yelling and screaming in order to gain control, and now, her aggressive behavior is being mimicked by her daughter, Karina. Can Nanny Jo get these parents to work together on a united front, or will the house continue to be hostile and divided?","production_code":"807","runtime":60,"season_number":8,"show_id":26353,"still_path":"/gHDihxUIE9Eg4wN21GMF12XIs0E.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-21","episode_number":8,"episode_type":"standard","id":2054767,"name":"Tobeck-Lawrence Family","overview":"When Crystal Tobeck and Jeff Lawrence met, they doubled their family and got a second chance at love. But the honeymoon was soon over as rebellious children clashed with controlling parents, leaving everything in chaos. Can Supernanny help this family blend in more love and harmony?","production_code":"808","runtime":60,"season_number":8,"show_id":26353,"still_path":"/jvM1BzdLX0fdypvvNIago4PbI3a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-28","episode_number":9,"episode_type":"standard","id":2054768,"name":"Jones-Nickolich Family","overview":"Heather and Todd thought Hawaii was going to be the ideal location to raise their triplet boys, and they even flew in grandma to help. But trouble struck paradise as the triplets grew into wild screaming toddlers and the parents became polarized. Can Jo break through Todd and Heather's denial and get them on the same page? Or will the kids' unruly behavior spin out into total chaos?","production_code":"809","runtime":60,"season_number":8,"show_id":26353,"still_path":"/kUfnddZcJyLWHWAFlOt4xF8pWAf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-06","episode_number":10,"episode_type":"standard","id":2170277,"name":"Collins Family","overview":"After spending 15 years struggling to conceive, Jennifer and Tim adopted beautiful twin girls, Mekenna and Alyssa. However, being mature parents, the twin's boisterous behavior has started to create anxiety and animosity between Jennifer and Tim as they clash over how to best raise their children. Can Jo help alleviate the tension in the household before it's too late?","production_code":"810","runtime":60,"season_number":8,"show_id":26353,"still_path":"/coRMSG85EqNewWdyP3zFXPh15YM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-13","episode_number":11,"episode_type":"standard","id":2170278,"name":"Orr Family","overview":"Ian and Jamie Orr are at their wits end with their four rambunctious children. Their oldest son Julian is addicted to violent video games, causing him to have nightmares. Plus, all four children are the pickiest of eaters, demanding fried unhealthy meals. Full-time working mother Jamie is struggling to maintain the housework and cooking demands even though Ian works from home. Can Nanny Jo get Julian to put the controller down and bring order to this family?","production_code":"811","runtime":60,"season_number":8,"show_id":26353,"still_path":"/vgDPaF6U9Ca5y1q7fMrlygbvx5q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-09-01","episode_number":12,"episode_type":"standard","id":2170280,"name":"Brown Family","overview":"Michael and Angela Brown have certainly made a bed for themselves--a giant super bed! They have combined two beds so that their sons Michael Jo and Paul Mason can sleep with them, but this unusual situation has created unhealthy attachment issues. Jo Frost works closely with the full-time working dad and stay-at-home mom to address these issues and an issue of trust that threatens their relationship.","production_code":"812","runtime":60,"season_number":8,"show_id":26353,"still_path":"/yX7261lBTY0DQB3pK5LtlUZfLhR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-09-01","episode_number":13,"episode_type":"standard","id":2170281,"name":"Esquivel Family","overview":"Joe and Clarissa are on the brink of divorce. Joe's new career as a police officer causes Clarissa to deal with all four rambunctious kids all day long. There's no balance between their parental obligations, leaving Clarissa feeling isolated. Can Nanny Jo help this family balance their dynamic?","production_code":"813","runtime":60,"season_number":8,"show_id":26353,"still_path":"/mLIZsWXGxVz2KekI6UHDPMEqE78.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-09-08","episode_number":14,"episode_type":"standard","id":2388509,"name":"Bailey Family","overview":"","production_code":"814","runtime":60,"season_number":8,"show_id":26353,"still_path":"/fnkzupJ08rOvKhSut8L2iZAgl7L.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-09-08","episode_number":15,"episode_type":"standard","id":2388510,"name":"Bean Family","overview":"","production_code":"815","runtime":60,"season_number":8,"show_id":26353,"still_path":"/oO5kzzcXBBKYLgsCTNijJKvxUuX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-09-15","episode_number":16,"episode_type":"standard","id":2388511,"name":"Zampogna Family","overview":"","production_code":"816","runtime":60,"season_number":8,"show_id":26353,"still_path":"/ltDXbjpIKgR483Z8RdqNH4rC0gV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-09-15","episode_number":17,"episode_type":"standard","id":2388512,"name":"Robertson Family","overview":"","production_code":"817","runtime":60,"season_number":8,"show_id":26353,"still_path":"/jILEkuqbFypoDHgtkmzBo1ugRRG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-09-22","episode_number":18,"episode_type":"finale","id":2388515,"name":"Sutherland Family","overview":"","production_code":"818","runtime":60,"season_number":8,"show_id":26353,"still_path":"/jmVRvrmR5PV2vCE3izcubEgeciR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"The families featured this season are from cities and towns around the country, including Phenix City, AL; Spokane, WA; Makaha, HI; Corona, CA; Mesa, AZ; Cortlandt Manor, NY; Gilbert, AZ; and more. Each of the families are dealing with diverse issues that span the spectrum of parenting challenges – from dealing with postpartum depression, ADHD, kids obsessed with electronic devices, blended families struggling with children acting out, military and first responder spouses facing separations – to parents buried in their phones and more. Jo will visit one new family each week and use her trusted and proven methods and elevated teachings to help them change their dynamics while focusing on positive reinforcement and connectivity.","id":139726,"poster_path":"/ioSnygEfQ3nH26D6qEgDDOiXawm.jpg","season_number":8,"vote_average":0}}}