{"adult":false,"backdrop_path":"/x9o0bg9TKybWyZQzkQOYS4X0RIi.jpg","created_by":[{"id":1244492,"credit_id":"594486d5c3a3681676005315","name":"Ruby-Spears","gender":0,"profile_path":null}],"episode_run_time":[30],"first_air_date":"1986-04-07","genres":[{"id":16,"name":"Animation"},{"id":10762,"name":"Kids"}],"homepage":"","id":2650,"in_production":false,"languages":["en"],"last_air_date":"1986-12-12","last_episode_to_air":{"id":204061,"name":"Man or Machine (5)","overview":"Doc Terror and Hacker rebel against Gog, managing to inflict a decisive blow against him. Gog travels to New York City, now inhabiting the Triad, a vessel equipped with incredible firepower. Only all five Centurions can save humanity from the wrath of this terrifying machine.","vote_average":0,"vote_count":0,"air_date":"1986-12-12","episode_number":65,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg"},"name":"The Centurions","next_episode_to_air":null,"networks":[{"id":184,"logo_path":null,"name":"Syndication","origin_country":"US"}],"number_of_episodes":65,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"The Centurions","overview":"Centurions is a syndicated 30 minute American science fiction animated television series produced by Ruby-Spears and animated in Japan by Sunrise. Comic book legends Jack Kirby and Gil Kane contributed to the design and concepts of the show.\n\nThe series began in 1986 as a five-part miniseries and was followed with a 60 episode series. The series was story edited by Ted Pedersen and written by several authors, including prolific science fiction writers Michael Reaves, Marc Scott Zicree, Larry DiTillio and Gerry Conway. The series theme and soundtrack were composed by Udi Harpaz. There was also a line of tie-in toys by Kenner, and a comic book series by DC Comics.","popularity":8.133,"poster_path":"/88Krf0EuJL7FXbN5oIWJdQob4Vg.jpg","production_companies":[{"id":61119,"logo_path":null,"name":"Ruby-Spears Productions","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"1986-04-07","episode_count":65,"id":8567,"name":"Season 1","overview":"","poster_path":"/8OAQERo7JlQCLAOo3K9ulmw3ywZ.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"Power Extreme!","type":"Scripted","vote_average":7.3,"vote_count":33,"season_data":{"1":{"_id":"52573efa19c29531db06e43a","air_date":"1986-04-07","episodes":[{"air_date":"1986-04-07","episode_number":1,"episode_type":"standard","id":203889,"name":"The Sky Is On Fire","overview":"The Centurions visit Oceania Research Station to observe the testing of a new device, a powerful cryogenic ray. Unfortunately, the centre has already been infiltrated by Hacker and Amber. Despite the Centurions' best efforts, the ray is stolen by Doc Terror's forces. Terror ignites the radioactive belt surrounding the Earth causing the planet's temperature to rise at incredible rate. With the resulting firestorm threatening to engulf the entire planet, Only Doc Terror holds the key to preventing this solar apocalypse, but he will do so only when he is made unconditioned ruler of the Earth. The Centurions try desperate tactics to prevent terror's plans, Max even resorts to disguising himself as the world president in an attempt to find Terror's base, almost getting himself killed in the process. The heroes eventually find terror's headquarters but end up as prisoners of the villain, who destroys their wrist communicators, cutting them off from Crystal and Skyvault.  The heroes aren't be","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-04-08","episode_number":2,"episode_type":"standard","id":1332561,"name":"Battle Beneath the Sea","overview":"Doc Terror sends Mekko to attack Sea Lab, where the Centurions' weapon systems are created. Max and Ace fight against Terror's forces in South Africa while Jake is visiting Sea Lab and gets caught in the assault orchestrated by Mekko.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-04-09","episode_number":3,"episode_type":"standard","id":203894,"name":"An Alien Affair","overview":"A comet is sending out artificial signals, and the Centurions are sent to check it out. When it turns out to be hollow, they beam inside. Within, it seem barren... at least at first. But then, as the comet's true nature is discovered, a new danger emerges from the shadows, a feline creature with the ability to drain anything power-generated, including the Centurions' weapon systems... The trio attempt to evade the beast by beaming to Skyvault, but the alien hitches a ride, and begins a chain of events which could end in Skyvault falling earthwards! Unless the Centurions can think of a way to cage this animal, it will sink its teeth into the best meal he's ever had: Earth's energy resources!\n\nScience Lesson: Halley's Comet by Ace.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efb19c29531db06e474","order":501,"adult":false,"gender":2,"id":15831,"known_for_department":"Acting","name":"Frank Welker","original_name":"Frank Welker","popularity":26.911,"profile_path":"/xXODQ5AX6pG4my8ieeEIuiAREXs.jpg"}]},{"air_date":"1986-04-10","episode_number":4,"episode_type":"standard","id":203902,"name":"Found: One Lost World","overview":"In pursuit of Doc Terror, Ace and Jake manage to force the criminal genius to crash land in the vast African jungle. There, Terror and Hacker stumble across an underground remnant of prehistoric earth, and he sets out to create an army of dinosaur cyborgs. However, Jake and Ace find the cave and attempt to prevent the villain from destroying the present with the past! But first they must contend with the lizard-like race who inhabit this inner world, and who have fallen under Terror's control...\n\nScience Lesson: Dinosaurs by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-04-11","episode_number":5,"episode_type":"standard","id":203903,"name":"Sand Doom","overview":"A desert pipe-line convoy goes missing, and the Centurions are sent to track it down. Max is suspicious of General Amid, and checks out his office. He is soon attacked by Hacker, but escapes. Crystal, however fins out that the General is diverting all of the power from the geothermal pipe-line away, and she too goes missing in the desert, abducted by a giant cyborg worm. Crystal is taken prisoner by General Amid, and discovers that he is working with Doc Terror, transferring the energy from the geothermal plant to Dominion. The Centurions free Crystal, but have to find a way to defeat Terror's giant worm.\n\nScience Lesson: Desert life by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-22","episode_number":6,"episode_type":"standard","id":203904,"name":"Whalesong","overview":"The new England-France Channel Bridge is attacked by a group of whales under the influence of synthesised whale sounds produced by Doc Terror's new recruit Madame Arpeggio. After preventing the whales from doing any more damage to the bridge, Max consults the whale Whistler, who is equipped with an electronic voice box. He discovers that a giant white whale is responsible for influencing the other whales into attacking the bridge. The white whale is in fact Doc Terror's giant sea-faring android. Max is captured by Terror and learns that he intends to use a whale army to attack Venice, currently hosting a symposium of the Council of World Scientists.\n\nScience Lesson: Whales by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-23","episode_number":7,"episode_type":"standard","id":1363203,"name":"Tornado of Terror","overview":"Doc Terror steals the new weather master. His associate Professor Storm created a weather helmet that enabled him to create a living tornado. The helmet combined with the weather master could unleash countless disasters.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-24","episode_number":8,"episode_type":"standard","id":203909,"name":"Denver Is Down","overview":"In Colorado, mercenaries hired by Doc Terror stage a diversion to keep the Centurions busy by attempting to steal a shipment of plutonium. As they battle  each other, Terror implements his plan to sink the entire city of Denver into a huge underground cavern and turn all of the city's inhabitants into cyborgs. The Centurions journey underground to get to the captive city and encounter Terror's new cyborg-enhanced mercenaries, who have stolen their exoframes. Weaponless, the Centurions have to figure out a way of saving both themselves and the city of Denver from Doc Terror's forces.\n\nScience Lesson: Caves by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-25","episode_number":9,"episode_type":"standard","id":203911,"name":"Micro Menace","overview":"An asteroid containing a powerful ore known as Superium is being transported to Earth. The ship carrying it is attacked by Doc Terror. The Centurions save both the ship and the asteroid, but problems arise, when the Executioner, a master criminal who thinks he lives in the past, takes the place of Dr. Emerson on Earth. Emerson was to have given Crystal a special circuit to enable the safe beam-down of the asteroid to a secret location, but the Executioner instead substitutes it with a chip that takes control of Skyvault's computer. The asteroid is then guided to the Executioner's castle, ready for Doc Terror. With Jake trapped on board Skyvault, Ace and Max captured, the Centurions must find a way to stop both Skyvault's computer and the Executioner.\n\nScience Lesson: Asteroids by Ace.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efb19c29531db06e4e8","order":502,"adult":false,"gender":2,"id":35243,"known_for_department":"Acting","name":"Ed Gilbert","original_name":"Ed Gilbert","popularity":4.569,"profile_path":"/uuyoM4Bo3zzmsDoOPzr5JeJaMdE.jpg"}]},{"air_date":"1986-09-26","episode_number":10,"episode_type":"standard","id":203915,"name":"Attack Of The Plant-Borg","overview":"A shower of meteors heads towards the Earth. The Centurions are sent to try and stop them, however, one of them crashes into the desert. Doc Terror scans it and discovers an invulnerable plant growing on its surface. He gets Amber to place a seed from the plant onto Jake's dog, Shadow so that the Centurions' secret base is attacked by the plant. The plants quickly multiply and proceed to attack the rest of New York. The Centurions discover the existence of a master plant-borg that controls all the others, and try to destroy it.\n\nScience Lesson: Plants by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-29","episode_number":11,"episode_type":"standard","id":203917,"name":"Battle Beneath The Ice","overview":"A meteorite with alien life on its surface falls into the Arctic Ocean. Doc Terror wants it, and sends Mako to retrieve it. Sealab is also interested in the meteorite, and comes into conflict with Terror's forces. The Centurions are sent to diffuse the situation. However, problems later arise when the new Mark-1 A.I. Prototype onboard is infected by an alien virus carried by the meteorite. With every electronic system on board Sealab affected, the Centurions have to neutralise the virus before Doc Terror's approaching forces arrive.\n\nScience Lesson: Arctic Ocean by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-09-30","episode_number":12,"episode_type":"standard","id":203920,"name":"Operation Starfall","overview":"Ace is on the Moon, inspecting the security systems of a mass-driver ore transporter, that ships mined ore from the Moon to the Earth. It soon comes under attack by Terror's Strafers under the command of the cyborg Lunex. Ace is unsuccessful in defending the mining-camp, and both he and it are captured by Lunex. Doc Terror then announces that he will use the mass-driver to launch meteors at the Earth. Ace is rescued, and together, the Centurions beam-over to Lunar free it from Lunex. However, the meteor has already been launched toward the San Andreas fault line, and only Ace alone can stop it.\n\nScience Lesson: The Moon by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efb19c29531db06e474","order":501,"adult":false,"gender":2,"id":15831,"known_for_department":"Acting","name":"Frank Welker","original_name":"Frank Welker","popularity":26.911,"profile_path":"/xXODQ5AX6pG4my8ieeEIuiAREXs.jpg"}]},{"air_date":"1986-10-01","episode_number":13,"episode_type":"standard","id":203923,"name":"Let The Games Begin","overview":"Randy Chang, the young champion of the Holo-Games, is kidnapped by Doc Terror, who plans to use his strategic knowledge to defeat the Centurions. Terror disguises himself as the \"\"Gaming Master\"\" and tricks Randy into thinking that his attacks on the Centurions are merely parts of a game. The Centurions manage to get to Randy, but Terror turns him into Multi-Borg, a cyborg that can split into three parts. The Centurions have to stop Multi-Borg before Randy fully turns into a cyborg.\n\nScience Lesson: Niagara Falls by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efb19c29531db06e474","order":501,"adult":false,"gender":2,"id":15831,"known_for_department":"Acting","name":"Frank Welker","original_name":"Frank Welker","popularity":26.911,"profile_path":"/xXODQ5AX6pG4my8ieeEIuiAREXs.jpg"}]},{"air_date":"1986-10-02","episode_number":14,"episode_type":"standard","id":203926,"name":"Firebird","overview":"The Centurions visit Mexico at the behest of Max's old friend Rebecca. The location of the legendary Firebird, an ancient spaceship, was discovered at a Mayan temple, and she wants extra protection from a series of mysterious accidents that have been plaguing her expeditions. Kotan, one of her assistants, is working for Doc Terror, and requests extra help from Hacker. The Centurions manage to discover the location of the Firebird, but Hacker steals the ship and uses it against the Centurions. Together, they must pool their resources and clip Firebird's wings.\n\nScience Lesson: The Mayans by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-03","episode_number":15,"episode_type":"standard","id":203928,"name":"Cold Calculations","overview":"A truck containing some of the Earth's dwindling supply of silver is guarded by the Centurions on its way to Geneva. It soon comes under attack from a group of jet skiers. The Centurions stop and capture them, but Jake's Fireforce get-up has been monitored and duplicated by Amber and Hacker. Later, Amber disguises herself as Jake with Fireforce, and together with Hacker, steals the silver for Doc Terror's experiments. Jake is then captured by Hacker, and Amber tries to persuade him to join them. Jake escapes confinement, and with the other Centurions, attempts to retrieve the silver.\n\nScience Lesson: Snow by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-06","episode_number":16,"episode_type":"standard","id":203931,"name":"Return Of Captain Steele","overview":"Doc Terror is searching for the Doomstar, a powerful weapon from the late 20th Century, which was lost when the space shuttle carrying it crashed somewhere in the Pacific. He finds it on Moku Island, but when they land, the natives, and their King, Alebi, mistake Hacker for the legendary Captain Steele, the commander of the downed shuttle. The Centurions detect Terror on the island and investigate for themselves. Doc Terror manipulates the islanders into following Hacker's orders and the Centurions look finished. But with Hacker disliking Terror's plan to test the Doomstar on the Centurions and Moku Island, things don't go according to Terror's plan.\n\nScience Lesson: Waves by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-07","episode_number":17,"episode_type":"standard","id":203932,"name":"Three Strikes And You're Dead","overview":"Blaster McGraw, a baseball star with the Washington Lasers, and an old college friend of Ace's, is kidnapped just before the final game of the World Series. A gambling boss known as the Wheel is the primary suspect, and so Ace and Jake do some investigating in their time off. They find that Wheel does have Blaster hostage, and is working with Amber, Doc Terror's daughter. Ace manages to rescue Blaster from one of Terror's old bases and get him to the game on time, but Wheel decides to attack the Mega-Dome, and steal the game receipts. The Centurions have to stop him and ensure that the game can go ahead.\n\nScience Lesson: Robotics by Doc Terror.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-08","episode_number":18,"episode_type":"standard","id":203935,"name":"Double Agent","overview":"Ace is asked to pilot a new superjet, the XM-2000, for an air show in Paris. No sooner do the Centurions arrive than Doc Terror and Hacker stage an attack. The cyborgs are defeated, and the Centurions free the officer in charge of the XM 2000 and his assistant. Ace offers to walk the young lady home, and during the walk she reveals herself as Amber and kidnaps Ace. When Ace awakens, he finds himself strapped to a mind exchange machine stolen by Doc Terror. Hacker is on the other side, and Terror flips the switch, imprisoning Ace's mind in Hacker's body. With Hacker's consciousness now in Ace's body, Terror can hijack the XM 2000. Ace has to somehow get free, stop Terror and get his mind back into his own body...without getting killed by his fellow Centurions.\n\nScience Lesson: D.N.A. by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-09","episode_number":19,"episode_type":"standard","id":203937,"name":"Child's Play","overview":"Jake Rockwell is sent to give a lecture at Sally Ride HS in Los Angeles. One of the students there happens to be a boy named Jimmy, who has ESP and is picked on by the local jocks. After Jake's visit, Wild Weasel is accidentally left behind at the school, and Jimmy uses his powers to merge with the system. For him, Wild Weasel is a way to impress a girl. But Doc Terror sees them, kidnaps the girl and recruits Jimmy to do some of his dirty work. The Centurions save the kids and stop Doc Terror.\n\nScience Lesson: E.S.P. by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-10","episode_number":20,"episode_type":"standard","id":203939,"name":"Terror On Ice","overview":"The Centurions defend an Arctic base against Doc Terror's forces, but inadvertently uncover a frozen dinosaur which Jake discovers while out on his own after the battle. The dinosaur attacks the base, and the Centurions attempt to stop it. Terror observes the beast heading towards Dominion and  captures it, intending to use it against the Centurions. Feeling sorry for the creature, Amber accidentally releases it. It then soon breaks out of Dominion with her and heads towards San Francisco, where the Centurions have to stop it and rescue Amber.\n\nScience Lesson: Polar ice caps by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-13","episode_number":21,"episode_type":"standard","id":203941,"name":"That Old Black Magic","overview":"Hacker is spotted near Manhattan, and the Centurions are sent to investigate. He takes a woman, Cassandra Cross, hostage, but she manages to subdue him with her magical powers. After reviewing Hacker's memory, Doc Terror plans to have her power for himself. Meanwhile, Ace has become smitten with Cassandra, and while enjoying a flight with her, they are both kidnapped by Hacker. In Terror's base under Manhattan, Ace discovers that Cassandra comes from a family of witches. Terror wants Cassandra's powers to sink New York, but before he forces her to help him, she frees Ace as the other Centurions arrive.\n\nScience Lesson: Earthquakes by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-14","episode_number":22,"episode_type":"standard","id":203944,"name":"Max Ray...Traitor","overview":"The World Council sends the Centurions to protect an anti-matter power plant in Seattle from the international terrorist, Gremlin. But Gremlin has already infiltrated the plant and detonates a bomb, releasing the anti-matter. The Centurions stop the anti-matter from doing any permanent damage, but Max ends up being trapped under the wreckage of the power plant, with Jake and Ace unable to help. Although Max escapes, he leaves the Centurions, blaming Ace & Jake's inactivity during his ordeal. Max accepts an offer to join a temporal research facility which is later attacked by the Gremlin. Max joins up with the Gremlin, hiding him from the other Centurions. Max, together with Gremlin, then ambush the rest of the Centurions. But what is Max's real agenda?\n\nScience Lesson: Recycling by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-15","episode_number":23,"episode_type":"standard","id":203947,"name":"Crack The World","overview":"Sealab's field vessel Sealiner 2 is buried undersea when one of its engines explodes. Sealab's current commander, Dr. Regulas, refuses the head of Sealab security Mei Lee's request for the Centurions help and sends divers out to rescue the ship instead. Mei Lee contacts Jake and tells him that there have been three prior accidents in the last month and asks the Centurions to investigate unofficially. Meanwhile, Doc Terror has Hacker plant bombs on a fault line in Mariana Trench while Sealab is busy. Max uses his new Sea Bat weapon system to assist in the rescue efforts, but soon comes under attack by Hacker. They manage to rescue the pilots, but are chastised by Dr. Regulas. Suspecting sabotage, the Centurions must figure out who the real traitor is before Terror's vibro-bombs can crack the world.\n\nScience Lesson: Minerals from the sea by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-16","episode_number":24,"episode_type":"standard","id":203948,"name":"The Incredible Shrinking Centurions","overview":"After Max catches Doc Terror's aquatic cyborg Mako, he is stunned to be arrested by the authorities instead of his adversary due to the Intertech computer registering Max as a criminal. After being bailed out by Jake, Max returns to Centrum where Crystal tells the Centurions that the main Intertech crime computer has a major malfunction. Finding no trace of a computer virus, the technicians discover that there is a physical fault with the system. To discover the fault, the Centurions are shrunk down in size and placed into the computer. There they discover that Doc Terror has shrunk himself along with some of his troops and entered the computer, intending to damage the central processing unit. The Centurions have to stop him before any permanent damage can be caused.\n\nScience Lesson: Integrated circuits by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-17","episode_number":25,"episode_type":"standard","id":203949,"name":"Live At Five","overview":"The Centurions become the subject of a series of special news reports by Jenny Rivers, who is an old classmate of Ace's. But neither Jenny nor the Centurions know that it's a setup; her boss is in cahoots with Doc Terror to discredit the Centurions. The team gets caught up in disasters around New York, and Jenny catches it all on tape. The public begins to believe the Centurions are stealing taxpayer dollars. Ace brings Jenny to Centrum to show her the truth, but before she can report it she is kidnapped by Hacker. The Centurions have to save Jenny and redeem their reputation before the Council disbands them.\n\nScience Lesson: Fusion by Ace.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-20","episode_number":26,"episode_type":"standard","id":203956,"name":"The Mummy's Curse","overview":"In Egypt an archaeological dig at the Pyramid of the Lost Pharaoh, headed by Professor Egon Sloan, is attacked by super-powerful jackals. The professor contacts Skyvault and requests the help of the Centurions to guard the pyramid from tomb robbers. Later that night, Jake overhears the professor using an ancient incantation to awaken the Lost Pharaoh's mummified bodyguards and is knocked out by Hacker. Shadow escapes and alerts the other Centurions, who find out that the professor is working with Doc Terror and intends to use the ancient mummies to help him take over Cairo. As Ace and Max stand up against Terror and his super-powerful mummies, Jake alone is left to defeat them and save the city.\n\nScience Lesson: Pyramids by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efb19c29531db06e4e8","order":502,"adult":false,"gender":2,"id":35243,"known_for_department":"Acting","name":"Ed Gilbert","original_name":"Ed Gilbert","popularity":4.569,"profile_path":"/uuyoM4Bo3zzmsDoOPzr5JeJaMdE.jpg"}]},{"air_date":"1986-10-21","episode_number":27,"episode_type":"standard","id":203960,"name":"Counterclock Crisis","overview":"Max takes Ace and Jake to the Lake Eyrie reclamation plant, which he helped to design. Doc Terror decides to attack the plant to cause the Northeast farmlands to wither away. The Centurions successfully defend the plant from Terror and return to Skyvault. There, Jake is hit by an experimental sonic beam and experiences a vision of Doc Terror in charge of Skyvault on January 11th, the next day. Jake snaps back to the present and attempts to explain his vision to no avail, with the no one else believing him. Jake goes AWOL and researches a symbol he saw on Amber's uniform in the future, tracing it to Star-Crossed Industries. Discovering that the company is a front for Terror and that they have disguised a shuttle as a hospital ship, Jake must attempt to prevent the future he saw from occurring.\n\nScience Lesson: Relativity by Ace.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-22","episode_number":28,"episode_type":"standard","id":954157,"name":"Zombie Master","overview":"The World President's yacht comes under attack from Doc Terror's Strafers. With Jake on vacation, Ace and Max alone drive off Terror's forces. Meanwhile, Jake discovers that all is not well in a small town, with its inhabitants seemingly acting like zombies. With the President's train passing though the area soon, the Centurions examine the place further. They find that the townspeople are under the control of Zombie Master, who is working for Terror.  He intends to turn the World President into a zombie when his train passes through the town, controlling him. Of course, only the Centurions can stop him.\n\nScience Lesson: Steam power by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efd19c29531db06e746","order":504,"adult":false,"gender":2,"id":64951,"known_for_department":"Acting","name":"Neil Ross","original_name":"Neil Ross","popularity":4.447,"profile_path":"/pNgkQKw5k6z9kscDnOAwstcmNnt.jpg"}]},{"air_date":"1986-10-23","episode_number":29,"episode_type":"standard","id":203965,"name":"Malfunction","overview":"Doc Terror switches a cyborg for the head of security, Captain Newman, at a secret installation, in order to steal the X-150, a smart missile that never loses track of a target. While transporting the missile, the Centurions come under attack, and Ace is knocked unconscious by a fall. Hacker plants a remote control circuit within his exoframe, so that Ace's movements in battle can be controlled by Doc Terror. Terror attacks again, and manages to steal the missile while Ace's weapons keep firing at Jake. The Centurions later try to get the missile back, but Ace's weapon systems keep firing at his team-mates. The remote control circuit is found, and together the Centurions attempt to destroy the missile as Doc Terror launches it towards Skyvault.\n\nScience Lesson: Volcanoes by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-24","episode_number":30,"episode_type":"standard","id":203966,"name":"Broken Beams","overview":"As the Centurions defend a thermal energy plant from yet another assault by Doc Terror, the berillium crystal on board Skyvault that is a key part of the beaming chamber is fractured. Requiring a replacement, Ace and Jake are sent to a jewellers but find that they have all been bought by a company named Star-Crossed Industries. Knowing that the company is a front for Terror, they decide to go to the mine in Tibet that the crystals originally came from. Once there however, they come under attack from Terror's forces, who have been mining all of the available crystals. With Max attempting to synthesize a new crystal in Sealab, and Ace and Jake unable to access their weapon systems, the Centurions must figure out a way of repairing the beaming chamber before Terror's plans can succeed.\n\nScience Lesson: Crystals by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-27","episode_number":31,"episode_type":"standard","id":203968,"name":"The Chameleon's Sting","overview":"A mad geneticist, Dr. Yates, attempts to create a lizard army, but is thwarted by the Centurions. However, during their struggle he accidentally injects himself with lizard serum and becomes a human chameleon, able to change form at will. He vows revenge on the Centurions, currently vacationing in Monte Carlo. The Centurions are not easily beaten, but when the enemy could be one of them, can even they win?\n\nScience Lesson: Chameleons by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efb19c29531db06e474","order":501,"adult":false,"gender":2,"id":15831,"known_for_department":"Acting","name":"Frank Welker","original_name":"Frank Welker","popularity":26.911,"profile_path":"/xXODQ5AX6pG4my8ieeEIuiAREXs.jpg"}]},{"air_date":"1986-10-28","episode_number":32,"episode_type":"standard","id":1363205,"name":"Film at Eleven","overview":"Jenny Rivers returns with a scoop on Dr. Terror. She disguises herself as a man and joins one of Terror's training camps, with some help from a former mercenary named Kaska. She and the other recruits stage an attack on the Centurion's testing grounds.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-29","episode_number":33,"episode_type":"standard","id":203974,"name":"Hacker Must Be Destroyed","overview":"After Terror's borgs launch a raid to steal an energy enhancing device in Japan, Hacker is captured by the Centurions and put on trial for all his crimes. Hacker refuses to divulge any of Terror's secrets, and after Terror fails to rescue him from the authorities, Hacker is sentenced to life imprisonment on the Alcatraz asteroid prison. Hacker is then allowed to escape, to become bait to lure Doc Terror and his stolen energy enhancer into the open, ready to be dealt with by the Centurions.\n\nScience Lesson: The space shuttle by Ace.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-30","episode_number":34,"episode_type":"standard","id":203977,"name":"Showdown At Skystalk","overview":"Ace and Crystal are invited to the Pleasure-Star, an exclusive space station resort connected to the Earth via an orbital elevator, Skystalk, for a vacation. Meanwhile, the station's owner, Anson Harshaw, is investigated by Dr. Wu for allegedly conducting illegal mind-transfer and cloning experiments. Crystal witnesses Dr. Wu being chased by androids, and orders Max to come and investigate. They are captured by Harshaw, and learn that he is replacing all the visitors to the Pleasure-Star with android duplicates in order to control key positions in the World Government. Max uses an escape pod and contacts Jake, who arrives to bail Ace and Crystal out of trouble. Harshaw decides to blow up the space station, leaving the rest of the connecting Skystalk to fall onto the Earth. With Ace and Crystal trapped inside the Skystalk itself, the other Centurions have to figure a way to rescue them and save the Earth from Skystalk's descent.\n\nScience Lesson: Gravity by Ace.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-10-31","episode_number":35,"episode_type":"standard","id":203980,"name":"The Warrior","overview":"In the Amazon, Dr. Jose Rivera, the South American representative of the World Council of Scientists, is held for ransom by Colonel Guerrero. Jake is sent to deliver the ransom, but is captured by the Colonel. As the Colonel prepares to ship off Rivera to Doc Terror, Jake escapes, and with the assistance of Ace, attempts to stop Guerrero in his tracks.\n\nScience Lesson: Amazon rainforest by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efb19c29531db06e474","order":501,"adult":false,"gender":2,"id":15831,"known_for_department":"Acting","name":"Frank Welker","original_name":"Frank Welker","popularity":26.911,"profile_path":"/xXODQ5AX6pG4my8ieeEIuiAREXs.jpg"}]},{"air_date":"1986-11-03","episode_number":36,"episode_type":"standard","id":203983,"name":"Return Of Cassandra","overview":"While conducting a training exercise, the Centurions come under attack from Doc Terror's forces. Ace is rescued by his old acquaintance, Cassandra Cross, the witch. The Centurions decide to attempt to duplicate her powerful abilities by studying her on board Skyvault. But once connected to Skyvault's computers, she turns off the defense systems and introduces herself as Lilith Cross, Cassandra's twin sister. With no defense systems operative, Doc Terror beams on board Skyvault. Ace manages to escape using the magical white rose given to him by Cassandra, and beams to Earth. He finds Cassandra trapped by Lilith's magic, and frees her. Together, they go back to Skyvault, and attempt to free the other Centurions.\n\nScience Lesson: Herbal medicine by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-04","episode_number":37,"episode_type":"standard","id":203985,"name":"Night On Terror Mountain","overview":"Doc Terror attacks the Navigation Control Centre for the East European sector in Transylvania, wanting to cause air traffic chaos. The Centurions successfully defend the installation, and manage to down Terror's ship in a mountain range. Doc Terror and Hacker escape the from wreckage of their ship and seek refuge in an old castle. There, they find a sarcophagus of Count Dracula, and free him from suspended animation. Now free, Dracula is told of the Centurions, and attempts to defeat them himself by hypnotising Max and using him against Ace and Jake. The Centurions soon regroup and launch an attack on Dracula's castle.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-05","episode_number":38,"episode_type":"standard","id":203988,"name":"Merlin","overview":"Crystal and the Centurions meet Professor Hartman at a medieval festival. He claims to have discovered the location of Merlin's tomb on an ancient map. They soon come under attack by Doc Terror's forces, who want Hartman's map. Terror wants Merlin's powers, and journeys to his tomb at Stonehenge to reawaken him. The Centurions arrive and protect Merlin from Terror, but he steals King Arthur's crown from the tomb. With the Crown, he summons the sword Excalibur, but it is taken by Hartman's assistant, who is descended from Morgan Le Fay. With Merlin's help, the Centurions try to retrieve Excalibur and defeat Terror.\n\nScience Lesson: Stonehenge by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-06","episode_number":39,"episode_type":"standard","id":203989,"name":"The Monsters From Below","overview":"Dr. Nathan Romalus is hired to create a new type of lifeform that can take on the appearance of anyone. After hearing of Terror's plan to replace the World  Council of Scientists, he has second thoughts and informs Crystal of the experiment. The Centurions are sent to deal with the creatures, but Terror manages to escape with them and Romalus himself. Faced with enemies that can alter their appearance, the Centurions must figure out a way to stop Terror's plan before the Council can be replaced.\n\nScience Lesson: Skyscrapers by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-07","episode_number":40,"episode_type":"standard","id":203990,"name":"The Road Devils","overview":"Jake, whilst testing out a new land hopper in Australia developed by Skyvault scientists, gets caught up in a dispute between a heavily armed bike gang called the Road Devils, and a small convoy of gypsies. He defends the convoy and later is attacked by the bikers, who are looking for a stolen microchip intended for Doc Terror that one of the gypsies, Mitch took from a power plant and kept for himself. They kidnap Mitch's girlfriend, Cathy, and it's up to the Centurions to rescue her.\n\nScience Lesson: Marsupials by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efd19c29531db06e721","order":503,"adult":false,"gender":2,"id":19546,"known_for_department":"Acting","name":"Michael Bell","original_name":"Michael Bell","popularity":6.943,"profile_path":"/qZrtEHcKOFCbxtSedcdTU8f2uyW.jpg"}]},{"air_date":"1986-11-10","episode_number":41,"episode_type":"standard","id":203992,"name":"Zone Dancer","overview":"In Chicago, a traditional private eye by the name of Gabriel Knight is asked for help by Crystal Kane, to find out who framed her for Zone Dancing-illegal tapping into corporate computers by connecting people's minds into them. Having seen that Crystal was wearing a real droud (the skull plate allowing connection with computers), Knight seeks out Gibson, a former Zone Dancer who tells him about a dancer in the Zone named Neon who is reputed to have stolen data from Skyvault's computers. Meanwhile, Dr. Wu informs the Centurions that Megacorp, the company that designed Skyvault's beaming program, has had the program illegally duplicated by a Zone Dancer, who now has access to Skyvault's beaming files. Ace is sent to Chicago, along with John Thunder, who is specially recalled for the assignment. At Megacorp, Ace and John find Crystal stealing the data and wearing a droud. After escaping from her trap, they return to Skyvault and deduce that whoever stole the beaming program created a beam","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efd19c29531db06e721","order":503,"adult":false,"gender":2,"id":19546,"known_for_department":"Acting","name":"Michael Bell","original_name":"Michael Bell","popularity":6.943,"profile_path":"/qZrtEHcKOFCbxtSedcdTU8f2uyW.jpg"},{"character":"","credit_id":"52573efd19c29531db06e746","order":504,"adult":false,"gender":2,"id":64951,"known_for_department":"Acting","name":"Neil Ross","original_name":"Neil Ross","popularity":4.447,"profile_path":"/pNgkQKw5k6z9kscDnOAwstcmNnt.jpg"}]},{"air_date":"1986-11-11","episode_number":42,"episode_type":"standard","id":954158,"name":"Firecracker","overview":"The countries of Quisto and Montenegro are close to all out war due to a recent attack on Quisto, apparently by Montenegro forces. The Centurions become involved due to the prospect of war threatening to involve the whole world. Max, Ace and Jake go to Quisto, while John and Rex go to Montenegro, where President Cordano tells them that it was impossible for his country to attack Quisto due to their defenses being run by the Def-3000 computer. John recons a supposedly abandoned Montenegran base, but is attacked and captured, while Rex is also abducted. They find that they are now prisoners of Lady Fang, who is in charge of the Def-3000 and wishes to start a war between the two countries, from which she will make a profit as an arms supplier. John and Rex are left to escape from Lady Fang's clutches, and the other Centurions beam to Montenegro in order to prevent war from breaking out.\n\nScience Lesson: Spider wart plants by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efd19c29531db06e721","order":503,"adult":false,"gender":2,"id":19546,"known_for_department":"Acting","name":"Michael Bell","original_name":"Michael Bell","popularity":6.943,"profile_path":"/qZrtEHcKOFCbxtSedcdTU8f2uyW.jpg"}]},{"air_date":"1986-11-12","episode_number":43,"episode_type":"standard","id":954159,"name":"Traitors Three","overview":"The Mesa Verde space testing station comes under attack by Terror's borgs. The Centurions arrive and battle his forces, but a nearby dam is destroyed, and a clifftop school pleads for help. Leaving Terror's forces to capture a new experimental space shuttle, the Centurions save the school, only to find it empty. Later, at a hearing, Centurions are blamed for causing property damage and suspended from active duty by Mr. Lomax on behalf of the World Council of Scientists. An investigation committee from the council look around Skyvault while the Centurions investigate the school's site. One of the committee members places a bomb on Skyvault at Terror's request, while the Centurions investigate the three committee members themselves. The Centurions must figure out who the real traitor is before Skyvault is destroyed by the bomb.\n\nScience Lesson: Natural heating & cooling by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efb19c29531db06e4e8","order":502,"adult":false,"gender":2,"id":35243,"known_for_department":"Acting","name":"Ed Gilbert","original_name":"Ed Gilbert","popularity":4.569,"profile_path":"/uuyoM4Bo3zzmsDoOPzr5JeJaMdE.jpg"}]},{"air_date":"1986-11-13","episode_number":44,"episode_type":"standard","id":203999,"name":"You Only Love Twice","overview":"A man claiming to be the deceased General Harding accesses security files on Crystal Kane's former fiance, Colonel Chuck Bates who disappeared in a rocket explosion five years ago, and transmits the information to Doc Terror. Harding was a hologram, and Terror also creates a hologram of Bates to lure out Crystal, while the Centurions are kept busy with Terror's forces on a space shuttle, Sealab and in Siberia. Crystal detects the wreck of Bates' old ship in Laos, and leaves Skyvault to find him. There she is captured by Bates' hologram and taken to Doc Terror. As the hologram of Bates begins to have second thoughts about assisting Terror, the Centurions stand ready to make their move and rescue their commander.\n\nScience Lesson: Holograms by Ace.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-14","episode_number":45,"episode_type":"standard","id":204002,"name":"Sungrazer","overview":"As Doc Terror's borg Mutron attempts to steal an experimental virus, the canister is accidentally damaged when the Centurions apprehend him. The Z-80 virus then begins spreading over the Earth. The only one able to stop the virus is its creator, Professor Manfred Owell, who left with other scientists twenty years ago to live inside a sungrazer comet under the leadership of Dr. Daimon Zemo, intending to create a utopia. Crystal and the Centurions use the Starfire, a prototype ion drive ship to get to the comet in time. Inside the comet, the Centurions meet up with Owell and Zemo, who distrusts them. As the comet is now on a course straight for the Sun, Owell requests the help of the Centurions to save the comet against Zemo's objections. As the virus spreads over the Earth, the Centurions must deal with Zemo's sabotage and save the comet as well as their homeworld.\n\nScience Lesson: Genetic modification by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-17","episode_number":46,"episode_type":"standard","id":204005,"name":"Novice","overview":"Jake is testing out his new Swing-Shot weapon system with Ace, under observation by Klaus, the designer of the Centurions' weapon systems. Crystal detects activity from Doc Terror in the Andes mountains, and Klaus tells the team that they'll need Swing-Shot's abilities under his observation. Once there, the Centurions fight Terror's robot insects, but Swing-Shot freezes up in the middle of the battle. Blaming himself for the malfunction, Klaus later attempts to find out Terror's plan for himself, but ends up being captured. Terror informs him that he wants an Incan emerald to power his mega-laser that will be aimed at Skyvault. He also forces Klaus to improve his ground-borg designs to use against the Centurions. Fighting against their own technology, the Centurions must stop Terror and rescue their friend.\n\nScience Lesson: Hydro-electric power by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-18","episode_number":47,"episode_type":"standard","id":204014,"name":"Breakout","overview":"Dr. Harriman, a scientist who used to cut corners with building materials, and now an inmate at the Lunar Penitentiary is broken out by Doc Terror, who wants to use his knowledge of . Rex and John investigate Harriman's daughter Alexis, at her research lab. Terror then attacks the lab, and despite the Centurions' efforts, succeeds in stealing Alexis' new sonic ray. Suspecting Terror had an insider, Rex discovers that Alexis herself is helping him and her father in getting revenge on the World Council of Scientists. John discovers that Terror intends to use the sonic ray to destroy a new dam, but is captured by Hacker. John must figure out a way of escaping and warning the other Centurions before Terror can use the ray to destroy the dam.\n\nScience Lesson: Agricultural methods by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-19","episode_number":48,"episode_type":"standard","id":204017,"name":"Atlantis Adventure (1)","overview":"Mei Lee and her colleague Jason from Sealab, are exploring a recently-discovered underwater trench, the deepest ever found. Their sea-bubble comes under attack by a giant squid and loses contact with Sealab. Max is sent to rescue them, but he too is attacked and loses contact with Sealab. Ace and Jake are sent to NASA to use an experimental Venus Probe, as only the probe can withstand the pressure at that depth. Meanwhile Max awakens to find himself in the undersea city of Atlantis, ruled by Princess Diana. At NASA, Ace is reunited with his old Air Academy comrade Sean O'Connor, who still holds a grudge against him since they had an argument over a girl. Diana tells Max her civilization has survived for many centuries since the city sank, and that they want no contact with the surface world, so he, Mei Lee and Jason are to remain there forever. Seeking control over Atlantis himself, Diana's cousin Naro attempts to steal the Venus Probe, leaving Ace to defend the ship underwater, where","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-20","episode_number":49,"episode_type":"standard","id":204020,"name":"Atlantis Adventure (2)","overview":"Jake has Crystal beam Ace back up to Skyvault, freeing him from the squid's clutches. Naro tells Jake and Sean that he intends to use the probe to take over Atlantis, and O'Connor agrees to help him. Meanwhile, Max and the two from Sealab escape from their confinement and look for a transmitter, but are stopped by Diana troops. Ace returns to Sealab, which engages its new force field to descend to Atlantis' depth. Max and the others escape from Atlantis and take Diana with them, but they are soon attacked by Naro's forces. Sean uses the Venus Probe to return to Sealab, where it is soon boarded by Naro and his followers. Jake escapes and beams outside Sealab, where he attempts to get on board. Sean reveals to Ace that he's still really on their side, and together they attempt to regain control of the base. Now working with Diana, Max and the rest of the Centurions try to defeat Naro's forces.\n\nScience Lesson: Uranus by Ace.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-21","episode_number":50,"episode_type":"standard","id":204023,"name":"Ghost Warrior","overview":"A group of Native Americans comes under attack by a giant totem claiming to be a ghost warrior, who tells them to fight against those who have built upon  their land. The tribal leaders call in John Thunder, who brings along his fellow Centurions Ace and Jake. While John confers with his people, Ace and Jake are attacked by Hacker. Meanwhile, the giant ghost warrior appears to John and his tribe and brainwashes them into attacking a geological research lab. John tracks down the ghost warrior and finds out that it is really a giant Traumitizer controlled by Doc Terror. Terror traps John, and as his brainwashed victims keep Ace and Jake occupied, Terror attacks the real target: a nearby space port. John must free himself and his people, and assist his Centurion friends.\n\nScience Lesson: The Apaches by John.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-24","episode_number":51,"episode_type":"standard","id":204025,"name":"Let The Lightning Fall","overview":"Ace disarms some plane hijackers working for Doc Terror, who is angered by their surrender. Despairing of the failing of humans, Terror blames Amber for selecting the hijackers, and decides to exterminate all of mankind and replace them with robots. Rex Charger is specially recalled from a skiing trip to respond to a distress signal. He discovers that it is Amber, being chased by Hacker and some Strafers. She tells the Centurions that her father intends to destroy all of humanity this time, and that she wants them to stop his mad plan. With her help, the Centurions track him down to a Florida power plant, and discover that Terror intends to use a weather control satellite to create the biggest storm the world has ever seen. With the storm's strength increasing exponentially, it is left to the Centurions to figure out a way of neutralizing it.\n\nScience Lesson: Lightning by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-25","episode_number":52,"episode_type":"standard","id":204029,"name":"Cyborg Centurion","overview":"Ace is seriously injured in a battle with Doc Terror's Doom-Drone Strafers and is turned into a cyborg to save his life. Resenting what has happened to him, Ace enters an underground cyborg fighting ring, calling himself Foss. He impresses Viva Vargas, a millionairess, and agrees to journey with her to her Alaskan base, Xanadu. Doc Terror attacks Xanadu, as Vargas has previously refused to work for him. Ace then reveals that he has only been pretending to be a cyborg in order to infiltrate the underground. He and the other Centurions then defend Xanadu against Terror's army.\n\nScience Lesson: Lizards regenerating limbs by Jake.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-26","episode_number":53,"episode_type":"standard","id":204030,"name":"Day Of The Animals","overview":"In Dominion, Doc Terror attempts to turn his dog Brutus into a cyborg, but there is a malfunction that halts the mechanisation process while still giving the dog cyborg strength. With this knowledge, Terror creates the Encephalocaster, a device that can control other animals as well as giving them cyborg-enhanced strength. He uses the device on Skyvault and gains control of the space station with the help of Lucy. Once there, he uses the device to control all animals on Earth. As Jake attempts to deal with a Terror-controlled Shadow, Terror and Hacker prevent the other Centurions from beaming to Skyvault. With the Earth under siege by Terror's super-strong animals, the Centurions must figure out a way of getting to Skyvault and evicting Terror as well as shutting his Encephalocaster down.\n\nScience Lesson: Animals' super-human abilities by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-27","episode_number":54,"episode_type":"standard","id":204031,"name":"To Dare Dominion (1)","overview":"John Thunder informs the Centurions that his old sparring partner Claw is now working for Doc Terror as a cyborg. Meanwhile, Doc Terror succeeds in creating a dimensional neutron vortex in his base, Dominion. Energy from the vortex is detected by Skyvault, where Crystal determines that the laws of reality will soon collapse. With Terror having stealth and scrambler fields all over the Arctic to hide his base, the Centurions lure Hacker into stealing a vital component for the vortex, and John sneaks on board Terror's airship. John makes it to Dominion, where Claw soon senses his presence and alerts Terror, who then gets Hacker to attack the SETI space probe station in the Andes to keep the rest of the Centurions occupied. Claw captures John and attempts to settle old scores with him. The other Centurions are sent to locate Dominion, but are too late, as Terror's dimensional vortex breaks out of control.\n\nScience Lesson: Magnets by Ace.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-28","episode_number":55,"episode_type":"standard","id":204032,"name":"To Dare Dominion (2)","overview":"Terror follows the wandering vortex, attempting to bring it back under his control, while John manages to escape from Claw. The other Centurions, still looking for Dominion, come under attack by their own weapon systems, which are transformed into creatures by the vortex's alteration of reality. Crystal beams them to Skyvault, leaving John still on his own in Terror's Arctic base. John finds a transmitter and contacts Skyvault, but the co-ordinates are unstable as the position of Dominion is not stable anymore due to the vortex. Crystal is able to beam the other Centurions to Dominion, where they meet up with John, who tells them that he still has to deal with his old enemy Claw. As John fights Claw to the finish, the remaining Centurions must figure out a way of destroying Terror's vortex before all of reality is destabilized.\n\nScience Lesson: Continental drift by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-01","episode_number":56,"episode_type":"standard","id":204035,"name":"Hole in the Ocean (1)","overview":"A new surface-to-Atlantis rail shuttle is opened by Princess Diana, with the Centurions in attendance. During its inaugural journey, the train comes under attack by Doc Terror's forces and the Centurions engage them in battle. During the fight, Diana's cousin Naro and the evil physicist Phisto escape from Atlantis' prison. Phisto then creates an artificial micro black hole which soon attracts the attention of Doc Terror. After the battle with Terror's borgs, Ace is sent to look for Naro and Phisto whereabouts, but is ambushed by Naro's henchmen and knocked unconscious, now completely at their mercy...\n\nScience Lesson: Micro-technology by Crystal.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52573efe19c29531db06e84f","order":500,"adult":false,"gender":2,"id":81847,"known_for_department":"Acting","name":"Dan Gilvezan","original_name":"Dan Gilvezan","popularity":3.186,"profile_path":"/tgJVkPQm2ZqeOGocsN4ikeJbycG.jpg"}]},{"air_date":"1986-12-02","episode_number":57,"episode_type":"standard","id":1363206,"name":"Hole in the Ocean (2)","overview":"Rex attempts to locate the missing Ace but only finds his discarded wristcom and soon comes under attack by Terror's forces. Ace is brought in front of Naro, who plans to take over Atlantis once more. Dr. Terror meets with Naro and plots to take control over the black hole. However Phisto can't control the black hole and it's up to the Centurions to fight Terror's cyborgs, evacuate Atlantis and prevent the growth of the ever-expanding black hole.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-03","episode_number":58,"episode_type":"standard","id":1363207,"name":"The Better Half (1)","overview":"Dr. Terror and Hacker's robotic halves join together accidentally to become Uniborg. Dr. Terror and Hacker get banned from Dominion by Uniborg and fall in the hands of the Centurions that make them face trial. Uniborg plans world conquer.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-04","episode_number":59,"episode_type":"standard","id":1363208,"name":"The Better Half (2)","overview":"Max and Jake are hospitalized after bad injuries battling the forces of Uniborg. Ace is the last Centurion left. Dr. Terror joins forces with Ace in defeating Uniborg and regaining Dominion. Crystal and Ace finally share first kiss.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-05","episode_number":60,"episode_type":"standard","id":954160,"name":"Revenge","overview":"Doc Terror observes scientist Marina Abbot's ship heading out to sea and sends out sea-borgs to attack it. The Centurions are sent to defend the ship, while Marina summons help from a giant lobster. After the battle, Marina explains to Max that she has taken over her father's research, but wishes to keep it secret. The ship heads to the research base Neptune-1, and the Centurions observe the giant lobster and a giant turtle first hand. Marina tells them that the creatures are to be used by the World Council of Scientists and that each one can be controlled with an implant. She swears not to have her work destroyed by Doc Terror like her father's early research. Ace is later trapped by Marina, who tells him that she wants to lure Terror to the island and take revenge against him for her father. As Terror begins transforming the creatures into cyborgs, the Centurions arrive to defeat them.\n\nScience Lesson: Swan ships by Max.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/pVQeTIoGcYWhiJfqqvozhdrPkjn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-08","episode_number":61,"episode_type":"standard","id":204053,"name":"Man or Machine (1)","overview":"New Centurions are recruited by the team and trained in the Centurion Academy, whilst Sealab develops new weapon systems for the original three. Meanwhile, Doc Terror makes contact with an alien computer called \"Gog\".","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/pVQeTIoGcYWhiJfqqvozhdrPkjn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-09","episode_number":62,"episode_type":"standard","id":204056,"name":"Man or Machine (2)","overview":"Doc Terror reflects on his past as his partner Hacker while he stows away on board Skyvault and seizes control of the station. Terror boards and begins coordinating his campaign of destruction, ordering Magog to begin full distribution of a vast, unending armada. John Thunder attempts to find a way of saving Crystal and everyone trapped on the station.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-10","episode_number":63,"episode_type":"standard","id":204059,"name":"Man or Machine (3)","overview":"Thunder, now a prisoner of Gog and Terror, is rescued by Crystal when she is able to successfully escape and elude Hacker. The two however remain powerless to help the remaining Centurions on the planet fighting to take back New York from Terror's armies. Terror makes a stern demand to the members of the science council that rejected him years ago.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/pVQeTIoGcYWhiJfqqvozhdrPkjn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-11","episode_number":64,"episode_type":"standard","id":204060,"name":"Man or Machine (4)","overview":"As the Strafers approach the falling space station, Crystal and John risk turning the computer's power back on to destroy them. In order to free Skyvault's computer from Terror's control, Ace uses the Orbital Interceptor to travel up to Skyvault with Dr. Wu's anti-viralizer ray, avoiding the station's self-defenses after being beamed aboard. Meanwhile, at Gog's island cybernetic hive, Terror has taken the World Council of Scientists prisoner, and shows them Gog's new Triad weapon to fight against the Centurions.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-12","episode_number":65,"episode_type":"finale","id":204061,"name":"Man or Machine (5)","overview":"Doc Terror and Hacker rebel against Gog, managing to inflict a decisive blow against him. Gog travels to New York City, now inhabiting the Triad, a vessel equipped with incredible firepower. Only all five Centurions can save humanity from the wrath of this terrifying machine.","production_code":"","runtime":30,"season_number":1,"show_id":2650,"still_path":"/bHgM6i4FiJWkqJKscfJYbzvnPE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":8567,"poster_path":"/8OAQERo7JlQCLAOo3K9ulmw3ywZ.jpg","season_number":1,"vote_average":0}}}