{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"2006-10-01","genres":[],"homepage":"","id":26712,"in_production":false,"languages":["en"],"last_air_date":"2006-10-22","last_episode_to_air":{"id":674749,"name":"Fun Food","overview":"Nigella Lawson shares her fabulous, fun named recipes that appeal to kids of all ages. Whether you’re 8 or 80 you’ll love her mozzarella stuffed Blood and Guts Baked Potatoes served with crisp coated Ritzy Chicken Nuggets and Capery Salad. She’s rustling up fabulous cookies that are as good to eat as to decorate, a great refreshing Shirley Temple Cocktail and then there’s velvety green pea Slime Soup – a fantastic name for a fantastic recipe.","vote_average":0,"vote_count":0,"air_date":"2006-10-22","episode_number":4,"episode_type":"standard","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null},"name":"Nigella Feasts","next_episode_to_air":null,"networks":[{"id":143,"logo_path":"/aKkZnTIGTn92sUODLxqP8ZmgyIA.png","name":"Food Network","origin_country":"US"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Nigella Feasts","overview":"","popularity":20.664,"poster_path":"/lO0ycCHh9O0r3eEpuFVG6cyGGNK.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2006-10-01","episode_count":13,"id":37305,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"52588129760ee3466139f30f","air_date":"2006-10-01","episodes":[{"air_date":"2006-10-01","episode_number":1,"episode_type":"standard","id":674748,"name":"Crowd Pleasers","overview":"Nigella Lawson’s got company and she’s sharing her fool proof, stress free recipe for a party with fabulous food and lots of fun for the guests and the host. On the menu Shrimp Cocktail in Baby Gem Leaves a bountiful Spicy Beef Chilli with a golden crispy Cornbread Topping served with cool green Guacamole and all the sides. Followed by Chocolate Cherry Trifle that’ll knock their socks off and that’s so delicious you’ll have to stop yourself from diving in headfirst.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-08","episode_number":2,"episode_type":"standard","id":674751,"name":"Weekend Wonders","overview":"It’s the weekend with Nigella Lawson, time for friends, feasting, leisurely baking and cooking with the kids. She’s got lunch that everyone goes crazy for – a Chicken and Sausage Bake, served with crispy Rosemary Roast Potatoes and French style Petit Pois. Then there’s a fantastic simple upmarket cheese on toast – Welsh rarebit and a fun to make and decorate Chocolate Honey Bee Cake.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-15","episode_number":3,"episode_type":"standard","id":674750,"name":"Delicious Dinners","overview":"It’s dinner for two at Nigella Lawson’s with three fabulous meals that are super fast and full of flavour. First there’s speedy after work Saki Salmon followed by light as air Zabaglione. Then there’s the ultimate anytime Roast Chicken Salad and finally a meal that’s perfect for small numbers - Crunchy Pork Chops topped with a Spinach and Tomato salad. Forget ‘Hostess with the Mostess,’ this is food you can whip up in a flash and enjoy at leisure.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-22","episode_number":4,"episode_type":"standard","id":674749,"name":"Fun Food","overview":"Nigella Lawson shares her fabulous, fun named recipes that appeal to kids of all ages. Whether you’re 8 or 80 you’ll love her mozzarella stuffed Blood and Guts Baked Potatoes served with crisp coated Ritzy Chicken Nuggets and Capery Salad. She’s rustling up fabulous cookies that are as good to eat as to decorate, a great refreshing Shirley Temple Cocktail and then there’s velvety green pea Slime Soup – a fantastic name for a fantastic recipe.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":5,"episode_type":"standard","id":674757,"name":"Breakfast All Hours","overview":"Nigella Lawson cooks up breakfast all hours from her everyday Boiled egg favourite to dishes that’ll wow brunch guests like Raspberry and Oatmeal Swirls. She’s making a fabulous crunchy Chocolate Peanut Granola, yummy granola muffins and flipping Cheese Cakelets with Strawberry Sauce for a leisurely breakfast with the kids and then she’s whipping up a fantastic back from the party midnight feast of Bacon and Tomato Hash. Who said breakfast’s just for breakfast time?","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":6,"episode_type":"standard","id":674752,"name":"Chocolate Heaven","overview":"Nigella Lawson, the domestic goddess shares her all time favourite hall of fame chocolate recipes. From the unbelievably delicious and simple Old-fashioned Chocolate Cake with a thick chocolatey frosting, through a moreish Chocolate Cheesecake, Chocolate Caramel Crispy Cakes, chocolatey chewy Triple Chocolate Brownies to the perfect nightcap, rum laced Hot Chocolate.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":7,"episode_type":"standard","id":674755,"name":"Food To Go","overview":"This is Nigella Lawson to go. It's fabulous portable food - from an entire feast of Mushroom Pasta Bake and stunning Cranberry Glazed Ham through to outrageous glazed Quadruple Chocolate Cake.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":8,"episode_type":"standard","id":674756,"name":"Exotic Evening","overview":"Nigella Lawson‘s cooking up a delicious bite sized feast that’s perfect to share with a crowd. On the menu are Red Kidney Bean and roasted eggplant dips. There’s a cooling Green Fatoush salad with toasted pita shards Bulgur Wheat and Nut Salad and moreish tiny aromatic Lamb Meatballs. This is an exotic feast to linger over.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":9,"episode_type":"standard","id":674754,"name":"Solitary Sensations","overview":"Nigella Lawson cooks and eats even if she’s home alone. Everything from delicious snacks to full meals like Roasted Lamb Shank served with creamy Pea Puree. She adores her anytime and easy Spaghetti Carbonara eaten straight from the pan, Grilled Haloumi with Egg and Mint and little individual molten chocolate desserts – Chocohotopots. Even in the dead of night and back home from a party Nigella’s in the kitchen rustling up a Back from the Bar Snack. She loves her food.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":10,"episode_type":"standard","id":674753,"name":"Just Desserts","overview":"Nigella Lawson’s crazy for dessert and picks out some of her all time favourites in her dessert hall of fame. There has to be Peach Melba, succulent poached peaches with fresh berry sauce over a scoop of cool vanilla ice cream. Then Black and White Cream a dramatic combination of meringue and cassis soaked blackcurrants, Cupcakes with snow white Royal Icing and a charming bouquet of floral decorations and last but not least Fruit Fizz - the easiest dessert ever that’ll have everyone begging for more and for the recipe too.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":11,"episode_type":"standard","id":674758,"name":"Spiced Up","overview":"Nigella Lawson’s creating a fabulous spicy banquet with real wow factor. On the menu Indian influenced dishes – all of them really easy, flavoursome and delicious. There’s a creamy Mughlai Chicken Curry, served alongside a fluffy Rice Pilaff, green pea and cheese curry Muttar Paneer. There’s a cooling Yoghurt and Pomegranate Raita to spoon over the meal alongside all the sides and sweet chewy macaroons.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":12,"episode_type":"standard","id":674759,"name":"Feel Good Food","overview":"Nigella Lawson’s cooking food that looks good, tastes good and makes you feel good – heaven on a plate. There’s a Smoked Salmon, Avocado and Pumpkin Seed Salad with fantastic textures, a Vietnamese Prawn and Glass Noodle Salad that’s packed with flavour and makes you feel good just looking at it. Other great ideas include a Red Salad, a colourful Anti Oxidant Fruit Salad and a great twist on a classic recipe – a Syllabubbed Yoghurt.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":13,"episode_type":"finale","id":674760,"name":"Comfort Food","overview":"Nigella Lawson gives us a taste of her favourite comfort foods – simple delicious recipes where each mouthful is as reassuring as the last. There’s a soothing Beef Casserole served with Double Potato Mash shared with a friend, warm Sticky Toffee Sauce poured over cold vanilla ice cream, anytime winners - Chocolate Chip Muffins and stir fried rice and her mother’s very own favourite - a steaming bowl of sweet Bread and Milk.","production_code":"","runtime":30,"season_number":1,"show_id":26712,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":37305,"poster_path":null,"season_number":1,"vote_average":0}}}