{"adult":false,"backdrop_path":"/zRMZKPSz9ZboQkp5okd6vK7fmui.jpg","created_by":[{"id":938758,"credit_id":"5a4a8a910e0a262dce015da0","name":"Claudio Biern Boyd","gender":2,"profile_path":"/1T1jNK6JKD8LnO71RTnOEOGmtmB.jpg"}],"episode_run_time":[23],"first_air_date":"1985-10-26","genres":[{"id":16,"name":"Animation"},{"id":10762,"name":"Kids"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"https://brb.es/david-el-gnomo/","id":2849,"in_production":false,"languages":["es"],"last_air_date":"1986-04-19","last_episode_to_air":{"id":3345731,"name":"The Mountains of Beyond","overview":"David and his wife Lisa must go off into the mountains because their time on Earth is almost over. They know they will not live past 400 years old.","vote_average":0,"vote_count":0,"air_date":"1986-04-19","episode_number":26,"episode_type":"finale","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/u3dEpFkatzBvaXV5ItONNHTjeLD.jpg"},"name":"The World of David the Gnome","next_episode_to_air":null,"networks":[{"id":443,"logo_path":"/dN6GTZyNY32q2onfrvJ2iAeE4su.png","name":"La 1","origin_country":"ES"}],"number_of_episodes":26,"number_of_seasons":1,"origin_country":["ES"],"original_language":"es","original_name":"David el gnomo","overview":"A Spanish animated television series based on the children's book The Secret Book of Gnomes, by the Dutch author Wil Huygen and illustrator Rien Poortvliet.","popularity":10.66,"poster_path":"/lowqkmV525TOvlOCXjtMyUtyPda.jpg","production_companies":[{"id":55627,"logo_path":"/bzYzbvudH6eDsroZSVW8RVDYFEH.png","name":"BRB Internacional","origin_country":"ES"},{"id":43819,"logo_path":"/c2rXy0Ob6F2F6DKVI3GZXKwgU2C.png","name":"CINAR","origin_country":"CA"},{"id":14,"logo_path":"/m6AHu84oZQxvq7n1rsvMNJIAsMu.png","name":"Miramax","origin_country":"US"}],"production_countries":[{"iso_3166_1":"ES","name":"Spain"}],"seasons":[{"air_date":"1985-10-25","episode_count":26,"id":9206,"name":"Season 1","overview":"","poster_path":"/nkxnOf9nDtgEZDWwdVYevY3ySDT.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Spanish","iso_639_1":"es","name":"Español"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.1,"vote_count":40,"season_data":{"1":{"_id":"52574877760ee36aaa0fc925","air_date":"1985-10-25","episodes":[{"air_date":"1985-10-26","episode_number":1,"episode_type":"standard","id":218795,"name":"Good Medicine","overview":"In the first episode \"\"Good Medicine\"\" we are told some facts that Gnomes, such as their height, weight, strength and what they like to eat. David also tells us all about their enemies, the Trolls.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/lxROYOr0dhmSbYjdtY4L6qwMkXv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1985-11-02","episode_number":2,"episode_type":"standard","id":218802,"name":"Witch Way Out","overview":"Lisa is very worried about David and Swift, their red fox, when they don't arrive home from a trip in \"\"Witch Way Out\"\". In fact, they have been captured by some trolls called Hooley, Pat and Poopey. Lisa goes out to search for them and when she finds them, she has to set up a resuce mission. What can she do to save them?","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/5wliRfiU27LjL5WlCEPR0hSh89S.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1985-11-09","episode_number":3,"episode_type":"standard","id":218805,"name":"David to the Rescue","overview":"David is called to Italy to treat a gnome girl. She had eaten a strawberry that had been sprayed with pesticide. The only plant that can cure her is the Shining Begonia. David travels to the Alps and outsmarts a snake to find the flower. On the way back, he meets Pot, one of the trolls.Pot challenges him to a dancing contest, and David cleverly keeps Pot waiting until the sun comes up. The troll turns into stone in the sunlight. David goes back to the palace and revives the gnome girl.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/8L8fM3GJsZmiAue5thmZbUneLFH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1985-11-16","episode_number":4,"episode_type":"standard","id":218807,"name":"The Baby Troll","overview":"The episode starts with Lisa explaining about the clothes gnomes wear. She mentions that David is out helping two deer who have their antlers locked together. David has to saw through the antlers to break them apart. When he is heading home, he sees a baby troll on a rock in the middle of the river! David decides to save the baby, although trolls are their enemies. David calls a gnome friend, and they set up a rope pulley to save the baby. The baby had been put out in the river by a farmer, because the mother troll switched his baby for hers.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/yUI2oGR42OnaXNwVdPFoAdybT4u.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1985-11-23","episode_number":5,"episode_type":"standard","id":218809,"name":"Little Houses for Little People","overview":"David explains how gnomes build their houses. The entrance of the house is under a tree, with an underground tunnel leading to another tree. Many other gnomes and animals help build the houses. David and Lisa get a message from a rabbit about a deer with a broken leg. They both go to help the deer, who had fallen on a sharp rock, and part of it was embedded in her leg. David removes the piece of rock and puts a splint made of branches on her leg. Later that night, David also has to remove pine cones from the throat of another deer.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/bx2EZvWZnu6qCbHehKnV4ADMRhl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1985-11-30","episode_number":6,"episode_type":"standard","id":218793,"name":"The Wedding That Almost Wasn't","overview":"It is wintertime in the forest, and David and Lisa are going to a friend's wedding. David explains that trolls love to ruin weddings, so the gnomes had already set up some clever traps. David performs the wedding for the new couple, and all the guests go to their new house. The trolls also come to the house and start a fire outside so the gnomes would be suffocated by smoke. Once all of the gnomes were out, David found Pat the troll in one of the gnome traps. Pat tells the gnomes that the other trolls have gone to the mountains, so the gnomes follow him there. Next the gnomes and animals barrage the trolls with snow and put them to sleep.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/e4duns7jRVd11epaXOXs7a0dhYo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1985-12-07","episode_number":7,"episode_type":"standard","id":218800,"name":"To Grandfather's House We Go","overview":"David is expecting a visit from his granddaughter, Susan. In a deep part of the forest lives a real witch with her cat. Once the witch leaves for the day, her cat goes wandering in the woods. Lisa goes to pick up Susan, and they meet a friendly porcupine family. The witch's cat sees the gnome house, and he knows the gnomes have mice as pets. But when he tries to get into David and Lisa's house, he falls into the trap designed to catch small animals. Later that evening, David lets the cat out. The cat gets scared of Swift and runs back home. That night the witch comes home and listens to the cat's adventures. This inspires her to write a story, \"Little Red Riding Hood\".","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/tqf9kr0HUgffsyyMGi0N9MVC7Cu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1985-12-14","episode_number":8,"episode_type":"standard","id":218810,"name":"Ghost of Black Lake","overview":"This episode begins with David explaining how gnomes make glass. Then he is called to the palace, where the king tells him about a little wizard named Tiraland. The wizard stole all of the gold in the castle, and now the trolls have thrown it into the eerie Black Lake. David has to ask permission to go to Black Lake from the ghost of Black Lake Castle. The ghost is a shape shifter, and agrees to let David go for only three days. David locates the gold with the help of an otter. The trolls have tied a rope around the gold bag and are about to pull it up. The otter removed the rope and ties it to a big rock. The trolls chase David and Swift, thinking they have the gold. Finally the trolls get scared by the ghost and give up the chase.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/2S9fHjqBgw8dnlQK5dqMGNCNupx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1985-12-21","episode_number":9,"episode_type":"standard","id":218803,"name":"Kingdom Of The Elves","overview":"The episode starts out with David telling how gnomes make pottery and candles. When he goes outside, another gnome tells him that a little deer has a barbed wire around his neck and needs help. David calls for Swift, but Swift doesn't come. He finds the fox a few feet away, but he is sick from eating poisoned food, a trap set by the trolls. David gives Swift some medicine and makes him better. Next David goes and cuts the wire from the deer's neck. On the way back, David decides to go see Gustav, the king of the elves to help get revenge on the trolls. Gustav sends some of his little elf messengers to the lake and Swift lures the trolls there, by lying down and pretending to be dead. Once the trolls show up, the elves tease them, drag them through the water, and tie their tails together. David reminds the elves not to hurt the trolls, just tease them.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/iQIuIr2FcJlInusFZYfEYy3uYMz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1985-12-28","episode_number":10,"episode_type":"standard","id":218794,"name":"The Magic Knife","overview":"Lisa's sister, Julie, comes to visit, and she brings along a copy of a scalpel. Julie says the copy came from the Himalayas. David decides to journey there to find the original knife. When he is in the high mountains, he goes to see his human friend Pondent do Rey. Pondent is a wizard and with the help of his magic mirror, he tells David that the original knife is in the Temple of Meykong, an abandoned structure in India. David and Swift leave the Himalayas and go to the deep jungles of India. Once David enters the temple, he learns that not only was it built over an active volcano, it is guarded by Holler the troll and his army of spiders. Holler has the knife and verbally taunts David while the spiders chase after him. Eventually Holler throws the scalpel into a spider's web. David gets it, then sprays Holler and the spiders with sneezing powder. While Holler is sneezing uncontrollably, he hits a lever that makes the volcano erupt. David escapes while the Temple of Meykong falls in.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/ll3hkMeVKo62zUUDBoddaLuqv20.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-01-04","episode_number":11,"episode_type":"standard","id":218806,"name":"Young Dr. Gnome","overview":"David's nephew Jonathan is coming to visit. Jonathan is a city gnome and his parents want him to be a doctor, but he doesn't want to. On the way to David's house, Jonathan meets a mischievous gnome named Martin, who asks the boy what's wrong. When Jonathan tells him, Martin starts telling a rumor that David is sick and Jonathan is taking his place. The word spreads fast, and soon the other gnomes show up at David's house, asking Lisa if David is sick. She tells them no. The gnomes all share stories about how David helped them in the past, and Jonathan decides he wants to be a doctor after all. Soon David returns home from letting a rabbit out of a trap. The gnomes are all celebrating when they hear a gunshot. They rush outside and learn that a little deer has been shot. While David goes to help the deer, the other gnomes try to scare off the hunter and his dog. Jonathan throws a rock at the dog, and the other gnomes trip the hunter with a rope.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/1TED0QimGcDZRqAkIsXNyhFeZWq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-01-11","episode_number":12,"episode_type":"standard","id":218799,"name":"Happy Birthday to You","overview":"David tells about the childhood of gnomes, using his friend Harry and his family as an example. David tells about Harry's children, Billy and Belle, and the way children grow up. It is also Billy and Belle's birthday, and David takes Susan to the party. On the way, he helps a mother hen learn how to keep up with her chicks. Then they go to the party. While Susan plays party games with the other children, Harry takes David to the forest nearby and tells how he is sad because the men from the city are cutting down all the trees. When they go back to the party, they learn that the trolls have shown up. The trolls throw apples and sticks at the gnomes, and they all run into Harry's house. David and Susan go back out and try to think of a way to get even with the trolls. They see the trolls asleep in a tree, and then a bulldozer from the city comes by. Some men take a chainsaw and cut down the tree, sending the trolls crashing to the ground.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/kwtVUzN7hZRbO7Wxkym40dHQ7xo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-01-18","episode_number":13,"episode_type":"standard","id":218797,"name":"The Siberian Bear","overview":"David is in his garden picking vegetables when he receives a telepathic message. The message is coming from the king of Siberia. David tells Lisa that they will be gone for a long time, and he builds a sort of bench for them to sit on during the journey. Swift carries them to Siberia, holding the top part of the bench in his mouth. On the first night, they have to take shelter from a storm. In the morning, the storm is over, and the king's messenger comes to greet them. On the way to the palace, David tries his hand at skiing, and impresses the other gnomes. At the palace, the king tells David that there is a bear stuck in a high tree, who has been there for several days. David gets help from some other gnomes to save the bear. They tie a rope around the bear, and loop it around the branches of the tree. The gnomes shove on a weaker branch until it falls and the bear comes down too. The bear is fine and thanks the gnomes for helping him.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/9TCy0iRcKhtyPKPIcShZFLhk9Xs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-01-25","episode_number":14,"episode_type":"standard","id":3345719,"name":"Foxy Dilemma","overview":"Susan goes to a sawmill with David, who explains how gnomes cut down dead trees to make furniture and birdhouses. Susan gets bored and goes for a ride on Swift with a little boy named Tom. Swift gets his leg caught in a trap in the forest, and Tom tries to cross a river to get help. The current catches him and he is left hanging on a rock in the middle of the river. Susan gets help from David, and he sends an eagle to pick up Tom. The other gnomes free Swift from the trap.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/sH0LURdxJ53nhftaQLw6Vhm4AuD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-02-01","episode_number":15,"episode_type":"standard","id":3345720,"name":"Three Wishes","overview":"A poor woodsman saves Lisa after she is attacked by his cat. To express his generosity, David grants the woodsman three wishes, which do not go as planned. When David grants the woodsman's wish to become a rich man, the woodsman takes a bar of gold into the city and attempts to sell it to a store owner. The woodsman is accused of thievery and thrown in prison. David helps him to become free and the woodsman learns to use his wishes wisely.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/5DlZERjG0h2nKXqXrxRiFq6HCfR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-02-08","episode_number":16,"episode_type":"standard","id":3345721,"name":"Ivan the Terrible","overview":"David and Lisa travel to Siberia where David is called upon by the gnome king. The king wants David to stop a mean gnome called Ivan, who is stealing furs from the human hunters and giving the gnomes a bad name. David enlists help from a man and the king's owl to teach Ivan a lesson he will not forget.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/3IrOYxEXj59wemvuo2i3XpwVygJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-02-15","episode_number":17,"episode_type":"standard","id":3345722,"name":"Rabbits, Rabbits Everywhere","overview":"David and Lisa journey to Holland to help some farmer gnomes. It is raining heavily, and there are dozens of rabbits trapped on a small island in the floodwater. The gnomes build rafts, and with the help of Swift, they save the rabbits from drowning.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/w9rJhLwoBrdmlhUVwccQ9MoMov8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-02-22","episode_number":18,"episode_type":"standard","id":3345723,"name":"Any Milk Today","overview":"David remembers a time when his children Lily and Harold were kids. Lisa realized the milkwoman had not delivered milk that day, and she knew something was wrong. David and Harold and Lily decided to go to town and see the milkwoman. On the way, Harold carelessly ran ahead and was almost stepped on by racehorses, and David got caught in a rope trap. Later David treats the milkwoman for a sprained ankle and tells her that he and his family will help deliver the milk. When Harold goes on the milk route, he loses his hat and is picked up by a magpie. David finds him hiding in some tall grass and teaches Harold a lesson about being more careful.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/7Waxhe6t5dwtEtpI0KDbvqSswrC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-03-01","episode_number":19,"episode_type":"standard","id":3345724,"name":"The Shadowless Stone","overview":"David and Lisa are summoned to the palace of King Conrad. The king lives behind a waterfall and has a jester named Tim. King Conrad tells the gnomes he wants them to go to the island of Mentoa and find the valuable shadowless stone. The stone is a royal treasure and it is stolen by the trolls. David and Lisa jump down a deep hole, then sail across an eerie red sea. David and Lisa enter Mentoa, a mountain with 1000 steps leading to the top. At the top of the stairs is a chamber holding the stone. Once David picks it up, the trolls materialize out of thin air and chase him and Lisa down the steps. But the trolls can not exit the mountain, because only a person with a kind heart can open the entrance door!","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/uHYYUAkCH3hFwuYzYcklwXmCsyd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-03-08","episode_number":20,"episode_type":"standard","id":3345725,"name":"Friends in Trouble","overview":"David and Lisa learn that a hunter is in the forest trapping birds. The man even caught David's friend, the flycatcher. While Lisa tries to feed the flycatcher's family, David rides on a raven to the city. There he finds a pet store where the hunter is selling wild birds. David gets help from some guinea pigs and unlocks all the cages. Then they use a chair to break out the window. Just as the birds are flying out, the man comes back. The raven grabs David, while the hunter fires a rifle at them. They outsmart the man and David took care of the sick birds himself.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/bteKocjnEMDXk0PGSbe6eDA5rzO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-03-15","episode_number":21,"episode_type":"standard","id":3345726,"name":"Airlift","overview":"David meets up with his friend Cosmo, who says he is worried about the bats in the forest. Cosmo says the humans are poisoning the insects the bats eat, and many of them are starving. The bats are currently hibernating in trees, which are in danger of being cut down. David calls on all the gnomes in the forest to make baskets from bullrushes, and then the bats are put into the baskets. A flock of geese transports the bats to a gnome-operated animal hospital when they can finish hibernating.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/yVPsVvWxdiGPS0OChw0dUegmZWq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-03-22","episode_number":22,"episode_type":"standard","id":3345727,"name":"Big Bad Tom","overview":"David and Lisa go to a birthday party in a windmill for a David's nephew, Maxmilion, where the two cure the former's twin brother Paul's cold. The farm has three friendly cats and one big mean black cat named Tom. During the party a gnome girl named Tina goes outside and gets picked up by Tom. David and the other gnomes get help from the friendly cats, who run after Tom. The cats beat him up and he lets Tina go.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/1NwAJpjJUgWBbEKaFsQfcsmr0R8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-03-29","episode_number":23,"episode_type":"standard","id":3345728,"name":"Kangaroo Adventure","overview":"Susan is staying with David and Lisa and finds a gnome xray in an old trunk. It is an xray of the Australian Prince Rex, who just happens to be coming to visit David that day. David tells Susan about how he and Lisa went to Australia a long time ago. Rex was just a boy then, but he was a lot shorter than his twin brother. David found out Rex was allergic to his boomerang and told the prince to drink lots of fruit punch. At the end of David's story, an adult Prince Rex shows up. He is a lot taller than average gnomes, and David says it is because he kept drinking the fruit punch.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/of4t3KpLhN14WuXXUVjreZwbLvD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-04-05","episode_number":24,"episode_type":"standard","id":3345729,"name":"The Careless Cub","overview":"David and Lisa go for a walk in the forest and meet a wolf. The wolf tells David that his wife and one of his cubs ate meat that had been poisoned by a shepherd. The wife had died, but the cub was still holding on. David examines the wolf cub and determines that a certain plant can cure him. He and Lisa split up and go look for the medicine. Lisa is snatched by the trolls, but they let her go when she tells Holler that a wolf will die if she can't get the medicine to it. The wolves are friends of the trolls. David and Lisa find enough of the plant to cure the wolf cub.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/ri5ZxEo0K8JhyiB44Pb5p2UFgD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-04-12","episode_number":25,"episode_type":"standard","id":3345730,"name":"The Gift","overview":"David goes to see an old friend of his, a human doctor named Walter. David wants to give Walter a pocketwatch that has been in the gnome family for generations. David tells Walter a story about the time he let a human boy enter the world of the gnomes. The boy's name was Wimpy and David used magic to shrink him and his dog down to gnome size. David took Wimpy around the forest and let him meet his fox friend, Nimble. Nimble and his wife had just had cubs, and Wimpy named one cub Swift. Later Wimpy went to David and Lisa's house for dinner, and the boy was fascinated by the pocketwatch. We find out that Wimpy grew up to be Walter. David's son Harold did not want the watch, but told David to give it to the best doctor he knew. Walter had always wanted the watch and thought it was a heartfelt gift.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/w5eM7u9bPTORLOckLDOdm978DUB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-04-19","episode_number":26,"episode_type":"finale","id":3345731,"name":"The Mountains of Beyond","overview":"David and his wife Lisa must go off into the mountains because their time on Earth is almost over. They know they will not live past 400 years old.","production_code":"","runtime":23,"season_number":1,"show_id":2849,"still_path":"/u3dEpFkatzBvaXV5ItONNHTjeLD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":9206,"poster_path":"/nkxnOf9nDtgEZDWwdVYevY3ySDT.jpg","season_number":1,"vote_average":0}}}