{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2009-07-12","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":29592,"in_production":false,"languages":["en"],"last_air_date":"2009-07-13","last_episode_to_air":{"id":727570,"name":"Strange Evolution","overview":"","vote_average":0,"vote_count":0,"air_date":"2009-07-13","episode_number":10,"episode_type":"standard","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null},"name":"Wild Pacific","next_episode_to_air":null,"networks":[{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":11,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Wild Pacific","overview":"","popularity":0.636,"poster_path":"/3533CgbuZHpCC28UmF6hA62gVIW.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2009-05-10","episode_count":11,"id":40984,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"52589403760ee34661563987","air_date":"2009-05-10","episodes":[{"air_date":"2009-05-10","episode_number":1,"episode_type":"standard","id":727561,"name":"Ocean of Islands","overview":"The South Pacific islands - the most remote in the world - are home to some of the most curious, surprising and precarious examples of life found anywhere on Earth, from giant crabs that tear open coconuts, to flesh-eating caterpillars that impale their prey on dagger-like claws.\n\nHuman culture is different here, too. The men of Pentecost Island celebrate their annual harvest by leaping from 20-metre-high scaffolds, with only forest vines to break their fall. And on the tiny island of Anuta, possibly the most remote community of people on the planet, the locals survive entirely on what they can grow and catch.\n\nThe South Pacific's innumerable islands look like pieces of paradise, but the reality of life here is sometimes very different, with waves the size of buildings, brutal tropical storms and, in the far south, even blizzards. This is the real South Pacific.","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-17","episode_number":2,"episode_type":"standard","id":727562,"name":"Castaways","overview":"In the South Pacific there is no such thing as a deserted island. They may be the most isolated in the world but every one of the region's 20,000 islands has been colonised - from New Guinea, home to birds of paradise and the tribe whose brutal initiation ceremony turns young warriors into 'crocodile' men, to Fiji, French Polynesia and Hawaii.\n\nThis is the story of the ultimate castaways - from saltwater crocodiles and giant eels to crested iguanas and weird frogs - who succeeded against all odds to reach islands thousands of miles apart. These journeys were no mean feat. It has been estimated that an average of one species every 60,000 years makes it to Hawaii. Incredibly, many of these colonisers made it to these islands on the back of the most violent forces of nature, like cyclones and tsunamis.\n\nThe voyages of the South Pacific's first people, the Polynesians, were no less remarkable. These journeys were undoubtedly some of the greatest acts of navigation ever undertaken, and they changed the nature of the South Pacific forever.","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-24","episode_number":3,"episode_type":"standard","id":727563,"name":"Endless Blue","overview":"A large part of the remote, blue wilderness of the South Pacific is a marine desert. Many animals that live in the ocean, among them sharks, whales and turtles - must go to extraordinary lengths to survive. Tiger sharks travel hundreds of miles to feast on fledging albatross chicks and, every year, sperm whales journey from one side of the South Pacific to the other in their search for food and mates. Theirs is a journey that can end in tragedy.\n\nBut the South Pacific is not all desert. New Zealand's super-rich coast supports huge pods of acrobatic dolphins; its coral reefs are some of the most diverse on earth; and there are few places richer in wildlife than the quirky Galapagos Islands, home to tropical penguins and surfing sea lions.\n\nUsing the greatest shipwreck story of all time - an event that inspired Moby Dick - the huge challenges of survival in this seemingly endless blue ocean are revealed.","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-31","episode_number":4,"episode_type":"standard","id":727564,"name":"Ocean of Volcanoes","overview":"Witness the birth, growth and death of an island in the greatest ocean on Earth. Millions of years are condensed into an hour revealing unforgettable images of an erupting underwater volcano; rivers of lava exploding below the waves; roads and houses buried by molten rivers of rock. From these violent beginnings emerge coral reefs of unparalleled richness supporting large groups of grey reef sharks and giant manta rays.\n\nThe rising lands of the South Pacific have also given life to some very strange creatures, from the vampire bug that thrives in tropical snow, to the megapode, a bird that uses volcanic springs to incubate their eggs; and vast swarms of jellyfish trapped forever by a coral mountain.","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-05-31","episode_number":5,"episode_type":"standard","id":727565,"name":"Strange Islands","overview":"Witness the birth, growth and death of an island in the greatest ocean on Earth. Millions of years are condensed into an hour revealing unforgettable images of an erupting underwater volcano; rivers of lava exploding below the waves; roads and houses buried by molten rivers of rock. From these violent beginnings emerge coral reefs of unparalleled richness supporting large groups of grey reef sharks and giant manta rays. The rising lands of the South Pacific have also given life to some very strange creatures, from the vampire bug that thrives in tropical snow, to the megapode, a bird that uses volcanic springs to incubate their eggs; and vast swarms of jellyfish trapped forever by a coral mountain.","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-13","episode_number":6,"episode_type":"standard","id":727566,"name":"Making Wild Pacific","overview":"The South Pacific is still relatively healthy and teeming with fish, but it is a fragile paradise. International fishing fleets are taking a serious toll on the sharks, albatross and tuna, and there are other insidious threats to these bountiful seas. This episode looks at what is being done to preserve the ocean and its wildlife.","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-12","episode_number":7,"episode_type":"standard","id":727567,"name":"A Fiery Birth","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-12","episode_number":8,"episode_type":"standard","id":727568,"name":"Eat or Be Eaten","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-13","episode_number":9,"episode_type":"standard","id":727569,"name":"Making Wild Pacific","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-13","episode_number":10,"episode_type":"standard","id":727570,"name":"Strange Evolution","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-12","episode_number":11,"episode_type":"finale","id":727571,"name":"Survivors","overview":"","production_code":"","runtime":60,"season_number":1,"show_id":29592,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":40984,"poster_path":null,"season_number":1,"vote_average":0}}}