{
    "adult": false,
    "backdrop_path": "/mk8xFFQKjYRNNzgNg3QsmBSCuea.jpg",
    "created_by": [],
    "episode_run_time": [
        43
    ],
    "first_air_date": "2009-10-30",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        },
        {
            "id": 10764,
            "name": "Reality"
        },
        {
            "id": 18,
            "name": "Drama"
        }
    ],
    "homepage": "http://www.animalplanet.com/tv-shows/pitbulls-and-parolees/",
    "id": 31537,
    "in_production": false,
    "languages": [
        "en"
    ],
    "last_air_date": "2022-11-26",
    "last_episode_to_air": {
        "id": 4070697,
        "name": "The Story of Villalobos",
        "overview": "More than two decades of second chances for the dogs and humans who need them most - it's been an epic journey for Villalobos and Tia's family; Tia looks back on the rescue's incredible history and shares a glimpse of its next chapter.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2022-11-26",
        "episode_number": 7,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 41,
        "season_number": 18,
        "show_id": 31537,
        "still_path": "/2Sfo4XGZ4AH5MrqrMULzQbZeHu6.jpg"
    },
    "name": "Pit Bulls and Parolees",
    "next_episode_to_air": null,
    "networks": [],
    "number_of_episodes": 203,
    "number_of_seasons": 18,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "Pit Bulls and Parolees",
    "overview": "Follow Tia Torres, founder of Villalobos Rescue Center, and her family as they rehabilitate both felons and ill-reputed pit bulls who come together to rescue one another from their dim pasts, and bring new meaning to life.",
    "popularity": 123.518,
    "poster_path": "/lrgRiVK3GH0jxQLmUXrWIjFA9Jc.jpg",
    "production_companies": [
        {
            "id": 24026,
            "logo_path": "/gOevBiBuzH8Oy4E3FnjBoIm30G9.png",
            "name": "44 Blue Productions",
            "origin_country": "US"
        },
        {
            "id": 125728,
            "logo_path": "/1PcePrj9PaFUmOrKXxIZiDVdWkz.png",
            "name": "Rive Gauche Television",
            "origin_country": "US"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "US",
            "name": "United States of America"
        }
    ],
    "seasons": [
        {
            "air_date": "2010-10-30",
            "episode_count": 17,
            "id": 43059,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2009-10-30",
            "episode_count": 6,
            "id": 43057,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2010-10-30",
            "episode_count": 12,
            "id": 43058,
            "name": "Season 2",
            "overview": "The second season takes a deeper look into Villalobos Rescue and the manner in which Tia runs the center and the Underdawgz program, while raising twin sons Kanani and Keli'I and daughters Tania and Mariah, who look to take a more active role in the center. In addition, season two dives into pasts of key the members of the \"Underdawgz\" - like Jake and Armando - and their current struggles as they fight for the pit bulls and themselves to convert their notorious reputations.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2011-11-12",
            "episode_count": 12,
            "id": 43060,
            "name": "Season 3",
            "overview": "In the third season, pit bulls and owners in need compel Tia and her dedicated team to head across the nation. Despite her own struggles to keep Villalobos up and running, Tia and Tania take an emotional trip to Alabama to help another canine rescue deal with the aftermath of a devastating tornado. Jake and Armando, now off parole, are given the opportunity of a lifetime when they head across the country solo to rescue two feral pit bulls that lost a battle with a porcupine. Adopters of all kinds, from a group of fun-loving bachelors to a mother and daughter duo with hearts of gold, open their homes to pit bulls in need. Emotions run high this season as Tia saves a gentle giant from spending his final days in an animal shelter. And in one of the most shocking adoptions Tia has ever witnessed, a habitually aggressive dog is instantly transformed the moment she reunites with her former owner. Finally, old and new members of Torres' team come together to witness one of Villalobos' best success stories, Armando, wed the love of his life.",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2012-10-06",
            "episode_count": 15,
            "id": 43061,
            "name": "Season 4",
            "overview": "Tia Torres has spent the last 20 years of her life in California building Villalobos, the largest pit bull rescue in the United States. But insurmountable issues with the local community and government drove her to make the life-altering decision to leave her home state. New Orleans has one of the highest populations of pit bulls in the country with many of them living on the streets. Louisiana also has the highest number of parolees of almost any state. It's seemingly the perfect place for Villalobos' new home, but change doesn't come easy.",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2013-11-02",
            "episode_count": 16,
            "id": 136461,
            "name": "Season 5",
            "overview": "The first year in New Orleans hasn't been easy. The fifth season finds Torres in a completely re-established Villalobos in the heart of the New Orleans' ninth ward. The city offers even more stories of rescue and rehabilitation including a mission involving a protective mama dog and her litter of seven puppies and Tia's dangerous retrieval of two stray pit bulls hiding beneath a precarious two-ton pile of lumber. This season, Tia and her staff are confronted with more cases of dog abuse and dog fighting than ever before. With bigger and more dangerous rescues, Tia, along with her family and parolees, will stop at nothing until peace is restored in \"The Big Easy.\"",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2014-10-04",
            "episode_count": 20,
            "id": 64464,
            "name": "Season 6",
            "overview": "Villalobos has quickly become a community stronghold in New Orleans, with people leaving dogs at her doorstep on a regular basis. Despite having a full house in the Lower Ninth Ward and numerous overflow facilities, Tia has opened the doors to include more breeds than ever, and the financial strains have her at a breaking point, leading Tia to open a local bar as a way to raise more money for the rescue. In season six, Tia rescues fighting dogs from constant abuse and works hand in hand with local law enforcement to remove chained pit bulls during a police raid. As the work continues to pile up, Tia must find trustworthy help and her irreplaceable parolee, Earl, who is about to get off parole, may have found one solution to her problem. Tia's daughters and adopted twin sons continue to be committed to Villalobos. And a hard-working employee makes the transition from inmate on work release to parolee, while Tania's \"honeymoon\" with her new husband, Perry, has been spent helping her mom keep her head above water.",
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2015-09-19",
            "episode_count": 21,
            "id": 70776,
            "name": "Season 7",
            "overview": "In the seventh season, Tia's children - Tania, Mariah, Kanani and Keli'i aka Moe - along with their significant others take on more proactive day-to-day roles at Villalobos. Because satellite locations are spread among blistering Louisiana swamps and the resilient neighborhoods of the Ninth Ward, all hands are on deck to accommodate the constant intake of dogs. In the swamps, the plight of abused and unwanted dogs isn't limited to just pit bulls. Villalobos now has rescued hounds, spaniel mixes, terriers and more. Villalobos favorite Earl contemplates a risky surgery to correct a debilitating prison injury, and parolee Sui embarks on his first rescue. Jackson Galaxy from My Cat From Hell helps Tia rehome 38 feral cats near a massive sinkhole.",
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        {
            "air_date": "2016-11-12",
            "episode_count": 10,
            "id": 81712,
            "name": "Season 8",
            "overview": "Tia suffers a devastating injury that requires her children to step up to keep Villalobos running, and her family's strength is tested in a way it's never been before. For the first time, Tia's kids are forced to manage the parolees, rescues and adoptions on their own. Throughout the season, the rescues featured are more crucial than ever.",
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        },
        {
            "air_date": "2017-08-05",
            "episode_count": 10,
            "id": 91427,
            "name": "Season 9",
            "overview": "After a long recovery from a devastating leg injury, Tia gets back into in full swing and relies on her children, their significant others and the parolees to help keep the ever-expanding rescue center running. Tia fights a never-ending battle that's grown to include dogs of every type and size, in desperate need of help. Many are unwanted pets dumped on the road, found wandering in the swamps, or thrown over the Villalobos gates. It's the reality of running the nation's largest pit bull sanctuary, where each new day brings happiness or heartbreak - and sometimes both.",
            "poster_path": null,
            "season_number": 9,
            "vote_average": 0
        },
        {
            "air_date": "2018-01-06",
            "episode_count": 11,
            "id": 97644,
            "name": "Season 10",
            "overview": "",
            "poster_path": null,
            "season_number": 10,
            "vote_average": 0
        },
        {
            "air_date": "2018-09-29",
            "episode_count": 11,
            "id": 136465,
            "name": "Season 11",
            "overview": "",
            "poster_path": null,
            "season_number": 11,
            "vote_average": 0
        },
        {
            "air_date": "2019-01-19",
            "episode_count": 11,
            "id": 136466,
            "name": "Season 12",
            "overview": "",
            "poster_path": null,
            "season_number": 12,
            "vote_average": 0
        },
        {
            "air_date": "2019-10-05",
            "episode_count": 9,
            "id": 136467,
            "name": "Season 13",
            "overview": "This season, former adopters return to Villalobos in hopes of finding another dog to add to their family, Lizzy, Tania, and Mariah create a \"retirement center\" at one of the warehouses to give the senior dogs a special place to call home, and for the first time, the rescue team celebrates their favorite holiday, Halloween, with a special event to benefit the hundreds of dogs in their care. The rescues this season continue to make a lasting impact on the team, from an abandoned dog with a severe skin condition to strays that lead the Villalobos employees on a wild goose chase. And this season, the Villalobos team sees families from Idaho to Florida to Wisconsin, who've opened their hearts and homes for a new family member. Later in the season, Tia partners with Amanda Giese from Amanda to the Rescue.",
            "poster_path": null,
            "season_number": 13,
            "vote_average": 0
        },
        {
            "air_date": "2020-01-04",
            "episode_count": 11,
            "id": 157414,
            "name": "Season 14",
            "overview": "",
            "poster_path": null,
            "season_number": 14,
            "vote_average": 0
        },
        {
            "air_date": "2020-07-25",
            "episode_count": 9,
            "id": 167463,
            "name": "Season 15",
            "overview": "",
            "poster_path": null,
            "season_number": 15,
            "vote_average": 0
        },
        {
            "air_date": "2021-01-02",
            "episode_count": 6,
            "id": 174926,
            "name": "Season 16",
            "overview": "",
            "poster_path": null,
            "season_number": 16,
            "vote_average": 0
        },
        {
            "air_date": "2021-04-24",
            "episode_count": 6,
            "id": 188504,
            "name": "Season 17",
            "overview": "",
            "poster_path": null,
            "season_number": 17,
            "vote_average": 0
        },
        {
            "air_date": "2022-10-22",
            "episode_count": 7,
            "id": 313700,
            "name": "Season 18",
            "overview": "",
            "poster_path": null,
            "season_number": 18,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Ended",
    "tagline": "",
    "type": "Reality",
    "vote_average": 8.1,
    "vote_count": 25,
    "season_data": {
        "1": {
            "_id": "52589eb7760ee3466162d10a",
            "air_date": "2009-10-30",
            "episodes": [
                {
                    "air_date": "2009-10-30",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 756376,
                    "name": "Second Chance Ranch",
                    "overview": "Tia Torres and a team of parolees work together to rescue and rehabilitate pit bulls at the Villalobos Rescue Center, the largest pit bull rescue facility in the country.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 31537,
                    "still_path": "/uH6lO2jLroy9HgbZILdIqj3ppGz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-11-06",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 756380,
                    "name": "Redemption",
                    "overview": "Tia Torres and her team of parolees work with a cast of Renaissance fair pirates who are looking to adopt a pit bull. Meanwhile, Tia's husband goes to court to face a bail hearing.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 31537,
                    "still_path": "/pWKae8rYEx5bCHqjlWGsKjIJRaF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-11-13",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 756379,
                    "name": "Whiteout",
                    "overview": "While Tia is traveling with her daughter to rescue a pit in Sacramento and a stray outside Wasco state prison, the parolees deal with a sudden snowstorm back at the ranch.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 31537,
                    "still_path": "/aVXPcMjjzUkJ159sdyra6LSLKZJ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-11-20",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 756375,
                    "name": "Crisis",
                    "overview": "Tia deals with an endless series of crises as her older daughter Tania refuses to pull her weight and a parolee goes missing.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 31537,
                    "still_path": "/jCcmNGW6E6M5fxeZbAYtLl35knm.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-11-27",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 756377,
                    "name": "On the Run",
                    "overview": "Tia and her team are tasked with tracking down a pit bull that has been living wild in a local park. It's a dangerous assignment and one that proves far harder than Tia ever expected.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 31537,
                    "still_path": "/vGEQOm15i5zm38wScJAbHDkQF2q.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-12-04",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 756378,
                    "name": "Sin City",
                    "overview": "Running a rescue shelter is a financial strain, and it's getting harder for Tia to make ends meet. Despite being loathe to leaving the shelter for even a single night, Tia cannot turn down the offer of a benefit for Villalobos at a casino in Las Vegas.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 31537,
                    "still_path": "/5fYx7qNtKLgP54LeZ7cNtBjMQZQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 43057,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "52589eb7760ee3466162d115",
            "air_date": "2010-10-30",
            "episodes": [
                {
                    "air_date": "2010-10-30",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 756389,
                    "name": "Return to the Ranch",
                    "overview": "A rescue call about two puppies loose in a trucking yard sends Tia and new parolee Joe on a seek and find mission. And a surprise call to Tania brings former parolee Jake back to the ranch, forcing Tia to decide whether or not to take him back.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/wjxk1KVSXZC2EqKlxPQ5TDMCS7I.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-06",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 756381,
                    "name": "A Battle of Wills",
                    "overview": "After a teenager is attacked by a group of pit bulls, Tia finds herself thrust into a rescue mission to save an innocent pit bull caught up in the media storm.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/f6E4vLMWckoyrMRbeJVAjkzTh56.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-13",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 756382,
                    "name": "A Final Verdict",
                    "overview": "With more dogs arriving every week, and husband AJ heading to trial, an exhausted Tia struggles to maintain control at Villalobos.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/9UeiwJrw3y4eacRvsEJbsajbbls.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-20",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 756385,
                    "name": "A Fighting Chance",
                    "overview": "Tia is touched by a heartfelt adoption application from a former prisoner turned mixed martial arts fighter. The plea sends Tania and Mariah on an adoption road trip to Montana, testing them in a way they never expected.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/esXJpk5uG9lmDQYePLRE2hf8HS7.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-27",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 756383,
                    "name": "Devastation",
                    "overview": "A potential adoption for a dog rescued during Hurricane Katrina sends Tia and her son, Kanani, on a road trip to Louisiana. Once there, they rescue an abandoned dog during a fierce thunderstorm.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/9zrvy6RFqotuqkBwINOdndF0eka.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-04",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 756386,
                    "name": "Beware of Dog",
                    "overview": "A plea for help compels Tia to deal with an out-of-control pit bull, leaving the owner grappling with a heart wrenching life or death decision. And, with no kennel space left at Villalobos, parolee Cameron persuades Tia to join him on a wild rescue.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/sVWR8QcOrIBzKxHWbZuqhz5mMx3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-11",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 756384,
                    "name": "Breaking Point",
                    "overview": "Tia and Jake are determined to find one of Villalobos' most unique-looking pit bulls a new home but when a promising adopter backs out, they are forced to step up their efforts. Parolee Billy is causing tension at Villalobos and Tia must intervene.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/7TTz1PrY3SVr3GL3wQWW9Y1WRJq.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-18",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 756387,
                    "name": "Mission of Mercy",
                    "overview": "Tia sends her daughters on a mission of mercy to New Orleans where a friend has rescued a pit bull that was tied to a metal post for several days. While there, the girls are outraged by the frustrations faced by both human and canine residents.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/wgu58vwwccjyUF492BMssOkShdr.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-01-08",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 756390,
                    "name": "Saving Tia Torres",
                    "overview": "Tania and Mariah work on a fundraiser after Villalobos is invaded by bees.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/v8glsGHkBKAT9sDPjyX7unxvbEk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-01-15",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 756391,
                    "name": "Trial by Fire",
                    "overview": "A wildfire burns dangerously close to Villlalobos.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/vNuAShqN9TTPPrYtFzjp2AvidNh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-01-22",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1994261,
                    "name": "Life in the Spotlight",
                    "overview": "Tia follows-up on the most memorable moments of the past year, and looks ahead to life beyond the second season and the challenges that await her as she prepares to move.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/iXb9ne3k3mRC06yeXekoswMg68e.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-01-22",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 756392,
                    "name": "The Next Chapter",
                    "overview": "Tia is faced with the daunting task of moving her family, the parolees, the kennels and the nearly 200 pit bulls that call Villalobos home. But with no water, no electricity and construction yet to begin, moving may be Tia's greatest challenge yet.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 31537,
                    "still_path": "/usK09VMJFK6sj5PIoa8GaYhY522.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "The second season takes a deeper look into Villalobos Rescue and the manner in which Tia runs the center and the Underdawgz program, while raising twin sons Kanani and Keli'I and daughters Tania and Mariah, who look to take a more active role in the center. In addition, season two dives into pasts of key the members of the \"Underdawgz\" - like Jake and Armando - and their current struggles as they fight for the pit bulls and themselves to convert their notorious reputations.",
            "id": 43058,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "52589eb7760ee3466162d12b",
            "air_date": "2011-11-12",
            "episodes": [
                {
                    "air_date": "2011-11-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 756396,
                    "name": "Judgement Day",
                    "overview": "Tia's dream of relocating becomes a nightmare as fate turns against her. And, a call from the former owner of one of Villalobos most aggressive dogs leads to the ranch's most emotional reunion yet.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/n8k4XZkdPY7DjXqGx7D4jy45AgQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-19",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 756397,
                    "name": "Prison Break",
                    "overview": "Tia sends Jake and Armando on a rescue mission to Texas, after hearing about two pit bulls who were wounded in a run-in with a porcupine. Then, when a second story about a dog in death row comies in, the guys need to kick it into high gear.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/8yefinXuc4U4d84Olol9hol6WV2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-26",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 756398,
                    "name": "New Blood",
                    "overview": "Tia decides to hire new parolees, but one parolee may blow his chance at redemption before the first day is done. And then, one of Villalobos most beloved dogs, Creature, is on the receiving end of shocking news which may end his chances of being adopted.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/ybH3aofcgvh7kUwhhNIhYKLtYV5.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-12-03",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 756399,
                    "name": "Trapped",
                    "overview": "It's a time of celebration as Armando's wedding day approaches, but even on this happy occasion the dogs come first. When a rescue mission becomes more than she bargained for, Tia is the one racing to the altar, not wanting to miss Armando's big day.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/jR61pjYqCkL2vifzELcqt6pCUl.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-12-10",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 756400,
                    "name": "Southern Uprising",
                    "overview": "Tia and the twins hit the road after she receives back to back calls for help from the South. After helping an army veteran with a new litter of puppies, the team find themselves on a wild chase after an injured dog through the streets of Jackson, MS.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/8GsnKodCHvrYxxxjuzhcasnPnT6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-12-17",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 756401,
                    "name": "Heart Broken",
                    "overview": "Tia's daughter faces a difficult decision when her beloved dog's health takes a turn for the worse. Then, Tia sends her team to rescue a mother pit bull and her puppies from horrific conditions in an abandoned home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/3rjNAg2yeZaF751ihS4934KQ6q9.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-01-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 756402,
                    "name": "Burn Out",
                    "overview": "A parolee goes off track, forcing Tia to make a hard choice; a short-term home is needed for a dog whose owners' home was ravaged by a fire.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/46Q9tpkDOmIN4FGQtI5SqhYGxSr.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-01-14",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 756403,
                    "name": "Pushing the Limits",
                    "overview": "Three roommates contact Tia about adopting a pit bull who can fit in with their extreme, fast-paced lifestyles. And, the parolees are sent running for cover when they uncover three beehives.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/kdhtOVpieyHTQvHHch2Qpl6xJzG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-01-21",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 756404,
                    "name": "Cut Loose",
                    "overview": "Tia, Mariah, the twins and the parolees launch a massive rescue effort to track down a pit bull and her puppies that have been dumped in the Mojave Desert.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/1s6mrYveyo7JX1WOxgALy90kDpN.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-01-28",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 756405,
                    "name": "Path of Destruction",
                    "overview": "After a tornado rips through the heart of Alabama, Tia and Tania head south to help a devastated dog rescue pick up the pieces. Meanwhile, back at Villalobos, Mariah oversees her first solo puppy adoption when a young couple visits the ranch.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/lLfNmsgahKA0Bqp1Lt8Kxgq8HMQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-04",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 756406,
                    "name": "Don't Blow It",
                    "overview": "Tia gives each of the parolees an opportunity to pursue their dreams, but for Bryan the path is more rocky and could end in disaster. Then, a pit bull rescued from the streets of Jackson, MS steals a potential adopter's heart.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/6ub6nbkXhDyUFINONMfZr8houNt.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-11",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 756407,
                    "name": "End of the Road",
                    "overview": "While in Georgia, Tia comes face-to-face with one of the most shocking rescues of her career. And a surprise animal control inspection leaves the future of Villalobos hanging in the balance.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 31537,
                    "still_path": "/7YbvIzCfMubfrzsX5QN1LmZ7EyA.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "In the third season, pit bulls and owners in need compel Tia and her dedicated team to head across the nation. Despite her own struggles to keep Villalobos up and running, Tia and Tania take an emotional trip to Alabama to help another canine rescue deal with the aftermath of a devastating tornado. Jake and Armando, now off parole, are given the opportunity of a lifetime when they head across the country solo to rescue two feral pit bulls that lost a battle with a porcupine. Adopters of all kinds, from a group of fun-loving bachelors to a mother and daughter duo with hearts of gold, open their homes to pit bulls in need. Emotions run high this season as Tia saves a gentle giant from spending his final days in an animal shelter. And in one of the most shocking adoptions Tia has ever witnessed, a habitually aggressive dog is instantly transformed the moment she reunites with her former owner. Finally, old and new members of Torres' team come together to witness one of Villalobos' best success stories, Armando, wed the love of his life.",
            "id": 43060,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "52589eb7760ee3466162d136",
            "air_date": "2012-10-06",
            "episodes": [
                {
                    "air_date": "2012-10-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 756408,
                    "name": "New Orleans, Here We Come",
                    "overview": "It's a whole new world for Tia, her family, the parolees, and most importantly, her pitbulls, when they packs up their lives ahd moves across country to New Orleans. But the move is only the first of many challenges Tia faces.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/ftPphTPijH4ab669MDTqcbSRDNr.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-10-13",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 756409,
                    "name": "Face Off",
                    "overview": "Tia meets a family of eight looking to adopt a new dog after losing theirs to cancer. Then, a rescue-call takes Tia and her daughter Tania into New Orlean's infamous ninth ward to face off with a snarling, sick dog.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/cMzmvasJOjzfN7ZN28cf7kd6WZq.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-10-20",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 756410,
                    "name": "A Gift from Heaven",
                    "overview": "A volunteer at Villalobos adopts a dog with an uncommon history; a man who rescued two dogs needs help caring for them from Tia and her daughter Mariah.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/aGWvD9yd40TJIAyfW1wvUgdisMd.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-10-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 756414,
                    "name": "Ghost Dog",
                    "overview": "A pit bull is saved from drowning in a canal by a young girl after it evaded Tia for weeks; Tia must hire another parolee when twenty new puppies arrive at Villalobos.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/bwxnpyYPmL3J2kIj4jFqx1MO6wt.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-11-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 756411,
                    "name": "Saving Prada",
                    "overview": "Tia goes to Nashville with Tania and a new parolee to rescue a dog that's about to be put down. Meanwhile, back in New Orleans, Mariah tries to keep Villalobos safe during a storm; and a puppy rescued from the 9th Ward may find a new home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/6WCTt1qNzavnO92tvozkoZ5InY6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-11-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 756412,
                    "name": "Swamped",
                    "overview": "Tia and the twins board a boat to rescue a dog abandoned in a swamp outside New Orleans. Meanwhile, a young parolee is stressed out by work and parenthood.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/y9B3ihIH4sn1rKLEDV4OvM1rPsv.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-11-24",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 756413,
                    "name": "Trapped Below",
                    "overview": "A mother and her puppies are in distress and require a dangerous rescue mission; Tia is shocked by one of her most loyal parolee's future plans.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/y11Qrmn2L3YweCgvAQQP1ft3u7u.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-12-01",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 756415,
                    "name": "Boiling Point",
                    "overview": "Tia addresses her lazy parolees, which leads to a fiery confrontation with Randy; a strange-looking dog is rescued from the searing heat.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/6A1kE34fKxXpNB121CjVZqDRUCO.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-12",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 756416,
                    "name": "Band of Brothers",
                    "overview": "Tia and the twins try to make the best of a bad situation after they learn of Chong's cancer diagnosis.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/gPLVMdi1H6NM6qW2wNvLjQDKHxH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-12",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 981238,
                    "name": "Buried Alive",
                    "overview": "Memphis Grizzlies basketball star Zach Randolph contacts Tia about a dog that was rescued from a drainpipe; Mariah and Earl ready a puppy for adoption.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/faXsQzTNqon0AgJOhn6amjCnZ3b.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-19",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 756418,
                    "name": "Freedom Fighters",
                    "overview": "Tia and her rescue team land in a dangerous situation when an anonymous tip leads them toward a dog-fighting ring; one lucky pit bull awaits permission to enter a new home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/8nvAzDvBGX4guptBpH3c9s6HpT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-26",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 756417,
                    "name": "A Family Affair",
                    "overview": "New arrivals at Villalobos overcrowd the kennels after a friend of Mariah's passes away, a family hope to adopt four dogs, but it requires a trip back to California.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/tK6Zd5vaQ9GgDHdqovEPXO1lG6z.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-02",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 756421,
                    "name": "Making Miracles",
                    "overview": "A dangerously ill dog is rescued by Tania and Tia from the streets of New Orleans. Villalobos favorite, Chong, takes a turn for the worse as his cancerous tumor grows. And Tia offers to help with a long distance adoption in New York City.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/gu2iXQUWyS0hrDlUUYVZxArHrUh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-09",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 756420,
                    "name": "Storm on the Horizon",
                    "overview": "Tia readies for the worst as hurricane season approaches; a clue may help Mariah and the twins locate a dog's owner; Rico's grandparents adopt a shy dog.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/yeX26tkpHxugHw7huhRBEOCA4Gl.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-16",
                    "episode_number": 15,
                    "episode_type": "finale",
                    "id": 756419,
                    "name": "Storm Surge",
                    "overview": "Hurricane Isaac batters New Orleans, flooding Villalobos' evacuation location and isolating Tia from the rest of the world.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 31537,
                    "still_path": "/sS46NeGV3bQReFF2SEJ4XwlSOIM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "Tia Torres has spent the last 20 years of her life in California building Villalobos, the largest pit bull rescue in the United States. But insurmountable issues with the local community and government drove her to make the life-altering decision to leave her home state. New Orleans has one of the highest populations of pit bulls in the country with many of them living on the streets. Louisiana also has the highest number of parolees of almost any state. It's seemingly the perfect place for Villalobos' new home, but change doesn't come easy.",
            "id": 43061,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "5ddb410b6f53e10011ef2b3e",
            "air_date": "2013-11-02",
            "episodes": [
                {
                    "air_date": "2013-11-02",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1994279,
                    "name": "Out of the Dark",
                    "overview": "Tia recruits the twins and newly-hired work release prisoner to rescue a pit bull from the bottom of a 40-foot hole. Then, Mariah helps Tia with a heart-wrenching adoption to a young couple reeling from the tragic loss of their dog.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/742hxJeFZA9ekZd3mIU7SUzEBc1.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-11-09",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1994280,
                    "name": "Shell Shocked",
                    "overview": "Tania oversees the rescue of 10 dogs left to die in deplorable conditions. Tia helps a family find the perfect companion for their special needs teenager. The adoption takes a turn for the bizarre when Tia learns about the family's large, exotic pet.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/xNosFMTR9VTJ9ie98ZuWegLbWVT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-11-16",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1994281,
                    "name": "Pitch Black",
                    "overview": "A midnight rescue finds Tia, Tania and new employee Perry scrambling after an injured dog. With the kennels pushed to the limit, a familiar face arrives returns to help out. Then a chance at a forever home is threatened by an unexpected danger.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/thZKj36u6N13aqIDut0yRoOcwYX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-11-23",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1994282,
                    "name": "Puppy-Palooza",
                    "overview": "A rescue mission brings Tia and daughter Mariah face-to-face with a protective mama dog and her litter of seven puppies. With Villalobos now overrun with puppies, it's up to new parolee William to step up and keep control of the rowdy pups.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/7m4dJZkIFIYcqc1ii4QrySsOWxY.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-11-30",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1994283,
                    "name": "Giving Back",
                    "overview": "Two stray pit bulls hiding beneath a two-ton stack of lumber lure Tia into a dramatic and potentially deadly rescue. Then a colorful Bayou couple visit Villalobos in the hope of adopting a dog to fill the void left by their recently deceased pup.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/qeeW0JzGvQcSO1ZDrd4k9NBPIsk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-12-07",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1994284,
                    "name": "Flood Watch",
                    "overview": "Tia receives a call about a puppy stuck in a pipe at the edge of the river and enlists the help of the twins and the parolees to rescue the dog. Then, it's up to Tania and Perry to help build up a shy puppy's confidence when an adopter comes calling.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/lWWP8zDEhlvlp1ST0oxtxuJsbwQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-12-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1994285,
                    "name": "A New Future",
                    "overview": "Tia brings in reinforcements to rescue a dog from a dangerous part of New Orleans. Tania is left stunned when she becomes the center of attention at her boyfriend's birthday party.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/7qHZxlFMZMOoIJpBcTeBueVT2XX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-12-28",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1994286,
                    "name": "Rescuing the Holidays",
                    "overview": "Join Tia, her kids, the parolees, old friends and beloved volunteers for a special holiday gathering. Catch up with fan-favorite pit bulls who have been adopted over the years. Re-live the most surprising rescues and the most poignant adoptions.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/xpkdTngrZMU1NHEZ4ZWLzuOsRP3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-04",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1994287,
                    "name": "Can't Give Up",
                    "overview": "When a dog finally gets a chance at being adopted, the team has to drive all the way to Michigan for the home check. Their journey is disrupted when a plea for help sends Tia chasing after a dog that has been living on the streets for two years.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/rwBA0wOywKhSdxjAihWGj0Pw7YM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-11",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1994288,
                    "name": "Collision Course",
                    "overview": "A dangerous rescue mission is launched to secure two dogs spotted running wild on the train tracks next to the rescue center. And, a husband and wife come looking to adopt a dog to help them heal after a crippling accident.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/wMuSlCidX1k3PjHZfu3xShfknL8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-18",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1994289,
                    "name": "Not Meant to Be",
                    "overview": "An adopter from Texas fails to connect with the dog he drove hundreds of miles to adopt, but Tia might have the perfect match. Tania deals with a shocking drop-off. And a work-release inmate is in the hot seat when two prison guards visit Villalobos.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/l2llKge8ycyrVoiZLf4M9qtGlid.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-25",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1994290,
                    "name": "Battle Scars",
                    "overview": "A frightening rescue sends the Villalobos team racing into the city in search of a dog reportedly hit by a car. And with kennels at peak capacity, hopes are pinned on adopting out a dog to a police officer and his sister.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/aO4I2KmukGFFx5fpe9QH0EipJw3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-01",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1994291,
                    "name": "Rescue Resurrection",
                    "overview": "Tia gets a call about a dog loose at a construction site, and is shocked by what she discovers. A family with an unusual lifestyle comes looking to adopt a new puppy. And, when a favorite dog's cancer returns, Tia gets an emotional punch to the gut.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/xYt17U6MstcYICzSLMPSjCv2R8x.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-08",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 1994292,
                    "name": "Almost Perfect",
                    "overview": "Tia and two parolees scramble to rescue a dog left for dead in a dangerous part of town. A college girl from South Carolina comes looking to adopt a special needs dog. And, the parolees scramble when a dog is dumped on the rescue center's doorstep.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/yDwCDZxZ6Y1raN6YSgP2kQgR2Hs.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-15",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 1994294,
                    "name": "From the Shadows",
                    "overview": "Tia and parolee William go the extra to ensure a shy, special needs dog is adopted by a couple from Florida. Then, Mariah enlists a parolee's help to rescue a dangerously skinny dog. And, Tania and Perry struggle to plan their unconventional wedding.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/baiGJ8YMaA8AJjG3Xe8MQbwvC6p.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-22",
                    "episode_number": 16,
                    "episode_type": "finale",
                    "id": 1994295,
                    "name": "Perfect Match",
                    "overview": "Tia heads to a dangerous part of New Orleans to rescue a mama dog left to die. And, a tropical storm threatens to disrupt Tania and Perry's wedding.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 31537,
                    "still_path": "/bmgfRTU8Y9KON27RiiQ9Iyr2cTK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "The first year in New Orleans hasn't been easy. The fifth season finds Torres in a completely re-established Villalobos in the heart of the New Orleans' ninth ward. The city offers even more stories of rescue and rehabilitation including a mission involving a protective mama dog and her litter of seven puppies and Tia's dangerous retrieval of two stray pit bulls hiding beneath a precarious two-ton pile of lumber. This season, Tia and her staff are confronted with more cases of dog abuse and dog fighting than ever before. With bigger and more dangerous rescues, Tia, along with her family and parolees, will stop at nothing until peace is restored in \"The Big Easy.\"",
            "id": 136461,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "54b194a892514174720027d2",
            "air_date": "2014-10-04",
            "episodes": [
                {
                    "air_date": "2014-10-04",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1034627,
                    "name": "Last Chance",
                    "overview": "Forty-seven abused and malnourished dogs are in need of good homes after a busted up dogfighting ring makes national headlines; however, one of the dogfighting ring leaders is still at large and sending death threats to the temporary shelter.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-11",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1034628,
                    "name": "A Diamond in the Rough",
                    "overview": "Tia chases down the mysterious origins of a dog during a dangerous midnight raid; long term Villalobos resident's chances of a forever home are threatened by cat; parolees puts his reputation on the line by recommending a friend.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-18",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1034629,
                    "name": "Risky Business",
                    "overview": "Parolee is headed down the wrong path, only days after being released from prison; former volunteer comes back to adopt a dog, but her Boxer has other plans.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-25",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1034630,
                    "name": "Standing Strong",
                    "overview": "Tia and Louise search franticly for a loose pit bull; Sui, a new parolee, handles his first adoption; Tania receives heart-wrenching news about Bluie.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-01",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1034631,
                    "name": "Helter Shelter",
                    "overview": "An old visting friend of Tia's is quickly is thrown into the fire helping with a rescue; former adopter wants to take on another dog; Mondo cares for an injured, drop-off while Tia and Louise race to save a loose dog on the interstate.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-08",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1034632,
                    "name": "Dumped",
                    "overview": "Mariah gets personal about getting more dogs in the neighborhood spayed and neutered when puppies are dropped off at the front gate with a note; heartbroken family hopes to fill a new void in their lives.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-15",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1034633,
                    "name": "Healing Hearts",
                    "overview": "Dog is left tied up in the blistering summer heat; Matt comes home to save a pit bull from being put down; Tania and Perry decide to adopt a new dog.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-22",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1034634,
                    "name": "Broken Home",
                    "overview": "Tia and Matt are called upon to rescue some dogs from the home of their recently deceased owner; a potential adopter is looking for a dog who is able to thrive at a bed and breakfast.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-29",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1034635,
                    "name": "Giving Thanks",
                    "overview": "Tia comes to the rescue of a handicapped puppy found in a sugar cane field; Earl is released from his parole, which leads to a new milestone in his life.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-20",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1034636,
                    "name": "Holiday Special",
                    "overview": "Tania spearheads an effort to find forever homes for Villalobos pups while Earl rallies the parolees festive spirits and enlists their help to decorate the Tahyo Tavern and prepare a very special Christmas feast for the Villalobos family.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-03",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1034637,
                    "name": "Above and Beyond",
                    "overview": "Tia scrambles after receiving a phone call about a severely emaciated pit bull. And, a campaign to build a shelter in a NY prison depends on Earl to convince authorities about the benefits of prison dog programs.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-10",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1034638,
                    "name": "Good Gone Bad",
                    "overview": "Maria goes to California to rescue an old friend; a puppy's behavior jeopardizes her chance at a forever home; Tia gets a call for an abandoned pit bull.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-17",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1037740,
                    "name": "A Clash of Wills",
                    "overview": "When Tia hears about a pit bull tied up and abandoned in a vacant lot, she and Perry race to save him. Tia has a surprise in store for a returning adopter in search of a new family member. And a request from Earls son becomes a lesson in hard work.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-24",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 1038371,
                    "name": "Saving Each Other",
                    "overview": "A veteran makes a heart-breaking plea for help being reunited with his dogs. A shelter overwhelmed by dogs rescued from shocking conditions seeks Tia's assistance. And a former volunteer returns to VRC in search of a new family member.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-07",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 1994300,
                    "name": "Taming the Beast",
                    "overview": "Following a painful break-up, a single dad visits Villalobos in the hope of finding a new pit bull companion for himself and his son. Then, Mariah and Toney rescue a puppy that may never walk if he doesnt get the surgery he desperately needs.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-21",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 1041730,
                    "name": "From Darkness to Dawn",
                    "overview": "Tia takes a new rescue to the vet and receives heart-wrenching news; community rallies to raise funds for Earl's surgery; Mariah must conquer her greatest fear when an adopter with an unique challenge arrives.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-28",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 1994304,
                    "name": "Long Road Home",
                    "overview": "After spending over 10 years in VRC's kennels, a Hurricane Katrina survivor has a shot at a forever home. And, Louise and Matt search for a loose pit bull on the streets and end up finding more than they bargained for.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-03-07",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 1044318,
                    "name": "Blind Hope",
                    "overview": "When a blind pit bull is attacked by other dogs, the team steps in and takes responsibility for his recovery. And, a couple from Pittsburgh mourning the loss of their pit bull, visits Villalobos and falls in love with one of Tia's favorite dogs.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-03-14",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 1046658,
                    "name": "Hero's Journey",
                    "overview": "After her beloved dog passes away, an adopter comes to VRC hoping to fill the void in her heart. Louise and Matt rescue a dog that was hit by a car. And Tia's appearance on The Daily Show with Jon Stewart is threatened when her dog gets sick.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-03-21",
                    "episode_number": 20,
                    "episode_type": "finale",
                    "id": 1044108,
                    "name": "Why We Go On",
                    "overview": "After risking life and limb to rescue a scared pit bull, Tia finds herself battling with a local shelter over the dogs fate. And, after a long recovery, a dog that was rescued from the brink of death finally has a shot at a forever home in Boston.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 6",
            "overview": "Villalobos has quickly become a community stronghold in New Orleans, with people leaving dogs at her doorstep on a regular basis. Despite having a full house in the Lower Ninth Ward and numerous overflow facilities, Tia has opened the doors to include more breeds than ever, and the financial strains have her at a breaking point, leading Tia to open a local bar as a way to raise more money for the rescue. In season six, Tia rescues fighting dogs from constant abuse and works hand in hand with local law enforcement to remove chained pit bulls during a police raid. As the work continues to pile up, Tia must find trustworthy help and her irreplaceable parolee, Earl, who is about to get off parole, may have found one solution to her problem. Tia's daughters and adopted twin sons continue to be committed to Villalobos. And a hard-working employee makes the transition from inmate on work release to parolee, while Tania's \"honeymoon\" with her new husband, Perry, has been spent helping her mom keep her head above water.",
            "id": 64464,
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "_id": "55fdb29592514152ae001559",
            "air_date": "2015-09-19",
            "episodes": [
                {
                    "air_date": "2015-09-19",
                    "episode_number": 0,
                    "episode_type": "standard",
                    "id": 1108464,
                    "name": "Unforgettable",
                    "overview": "",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-19",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1108465,
                    "name": "New Frontiers",
                    "overview": "A new season brings new challenges as Villalobos Rescue Center expands beyond New Orleans and into the surrounding swamps, opening a satellite shelter in nearby Assumption Parish.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1110293,
                    "name": "Jail Break",
                    "overview": "Stray dog from the swamp comes to Villalobos; an overwhelmed owner hands over two sickly puppies to Tia; and a Villalobos favorite may have found a home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-03",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1110294,
                    "name": "Scarred",
                    "overview": "A parolee takes the lead in a rescue in an attempt to assume more responsibility; a woman looks for a dog that will be comfortable around her chickens; Tia saves a pit bull with scars that indicate a painful history.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-10",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1112839,
                    "name": "New Heights",
                    "overview": "Matt hurries to save puppies that are under railroad ties; a California couple search for a new best friend; bad news arrives about one of Villalobos' favorite dogs.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-17",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1112840,
                    "name": "Knife's Edge",
                    "overview": "A family from New Hampshire visits Villalobos in hopes of finding a new companion; an alert about an aggressive dog results in a heartbreaking discovery; Earl visits a spine specialist to address his chronic pain.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-24",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1116007,
                    "name": "Shock to the System",
                    "overview": "A mission to rescue a stray turns into a terrifying ordeal for Matt, forcing Tania to take the lead. Meanwhile, a new recruit experiences the heartbreak associated with a life in dog rescue; and one of the center's favorites has a shot at a forever home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1116008,
                    "name": "First Time for Everything",
                    "overview": "A dog is tied up in an abandoned house, presenting a unique challenge for Tia to rescue it. Meanwhile, Tania works hard to find a home for one of Villalobos' residents, but the adoption could fall through due to a health scare.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-14",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1165830,
                    "name": "Blindsided",
                    "overview": "After a dog is shot, Tia races to save his life. Then, Matt and Lizzy scramble to rescue a scared and sick puppy running loose on the busy roads near the warehouse. And after red-flags are raised during a home check, Tia faces an agonizing decision.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-21",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1165831,
                    "name": "The One",
                    "overview": "Tia and her staff scramble to coax a scared dog, hiding under a vehicle, to safety. Tania's in-laws are seeking a new addition to their home. And, Tia's sone Moe and his fiance Lizzy prepare for their wedding day.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-28",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1165832,
                    "name": "A New Best Friend",
                    "overview": "A pit bull is abandoned by its owners in an empty house; a mother and daughter come from Oklahoma looking for a new best friend; Tia's dog Jethro becomes ill.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-05",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1165833,
                    "name": "Low Rider",
                    "overview": "A dog has a tumor that could affect its chances of getting a forever home; an aggressive dog becomes a danger to the staff; Villalobos hopes to bring a stray and its owner together again.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-19",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1165834,
                    "name": "The Gift",
                    "overview": "With the holidays quickly approaching, Tia surprises her family, the parolees and every dog at the rescue with an extraordinary gift. But turning this giant gift into something Villalobos can actually use will require herculean effort.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-02",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1165836,
                    "name": "A Long Time Coming",
                    "overview": "In one of the worst cases of neglect Tia has ever seen, the team tries to nurse a severely malnourished dog back to health. And, ten years after Hurricane Katrina, one of the survivors finally has a chance at a forever home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-09",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 1152281,
                    "name": "Eye of the Storm",
                    "overview": "When a tornado tears through New Orleans, Tania takes charge - but is furious when the parolees fail to show up to help. And a fellow pit bull trainer seeks Tia's help adopting a dog she can put to work.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-16",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 1165838,
                    "name": "Behind Bars",
                    "overview": "Tia enlists Matt's help adopting a patrol dog out to his former home, Dixon prison. Then, Tia gets a call about two dogs left behind when their owners abandoned the property. And, Tania has trouble letting go when Brandi is up for adoption.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-23",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 1160656,
                    "name": "A Street Dog Named Desire",
                    "overview": "When a reputed dognapper dumps a dog at Villalobos, Mariah scrambles to find the owner. A new parolee needs Tia's help when he realizes he is in over his head. And, after having her last adoption fall through, Smack has a second chance at a loving home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-30",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 1161920,
                    "name": "The Incomparable Dr. K",
                    "overview": "An outbreak of disease in the swamps threatens the dogs. Tania goes out on her own to save a stray pit from the streets and is faced with a difficult rescue. And after years of waiting for a forever home, Jackson finally gets his shot.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-13",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 1165840,
                    "name": "New Day, New Blood",
                    "overview": "Tia is short-staffed, but finding a parolee who is prepared for the demands of the job is proving difficult. Then, when Tia hears about a pack of pit bulls running in the street, the team races to the rescue and find an overwhelmed owner.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-20",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 1165841,
                    "name": "Second Savior",
                    "overview": "When a sinkhole threatens to swallow a nearby neighborhood, Tia teams up with cat expert Jackson Galaxy to rescue dozens of cats. And, after finding a neglected mama dog near the warehouse, Tia and her team span out to try and find her puppies.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-27",
                    "episode_number": 20,
                    "episode_type": "finale",
                    "id": 1171588,
                    "name": "Never Meant Harm",
                    "overview": "After seeing their dog rescued on an episode of the series, a family contacts Tia in the hope of being reunited. Tia is forced to confront Earl about his sudden change in behavior. And, Matt makes a life-altering decision.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 7",
            "overview": "In the seventh season, Tia's children - Tania, Mariah, Kanani and Keli'i aka Moe - along with their significant others take on more proactive day-to-day roles at Villalobos. Because satellite locations are spread among blistering Louisiana swamps and the resilient neighborhoods of the Ninth Ward, all hands are on deck to accommodate the constant intake of dogs. In the swamps, the plight of abused and unwanted dogs isn't limited to just pit bulls. Villalobos now has rescued hounds, spaniel mixes, terriers and more. Villalobos favorite Earl contemplates a risky surgery to correct a debilitating prison injury, and parolee Sui embarks on his first rescue. Jackson Galaxy from My Cat From Hell helps Tia rehome 38 feral cats near a massive sinkhole.",
            "id": 70776,
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        "8": {
            "_id": "581f1687c3a3685d4a003a0e",
            "air_date": "2016-11-12",
            "episodes": [
                {
                    "air_date": "2016-11-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1237231,
                    "name": "Down, Not Out",
                    "overview": "After Tia suffers a devastating injury, her kids have to step up to keep Villalobos running. Everyone's help is needed to catch an elusive dog in the middle of the night. And, a family of 8 needs a new companion to complete their active home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-19",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1241044,
                    "name": "Redeemed",
                    "overview": "Earl returns from rehab, hoping to rebuild his life working with the dogs. A couple comes looking for a dog who can handle the crowded streets of NYC. And, Lizzy rescues a dog after a confrontation with the owner who abandoned it.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-26",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1243029,
                    "name": "Kindness of Strangers",
                    "overview": "After flooding devastates Louisiana, Tia and her team race to help the victims, including former adopters whose home has been destroyed, and a woman separated from her dogs when water overwhelmed her house.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-03",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1243030,
                    "name": "Down Below",
                    "overview": "A woman travels all the way from San Diego to give one of Villalobos senior dogs a chance at a home. Lizzy and Marcel search for a mama dogs lost puppies out in the country. A new parolee makes a helpful discovery on his first day.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-10",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1246624,
                    "name": "Rock City Rescue",
                    "overview": "Tia goes to Detroit to assist a rescue operation that's in danger of closing. Back in New Orleans, the team is on the lookout for a stray pit bull; and a grieving adopter begins her search for another companion.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-17",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1248318,
                    "name": "The Gift",
                    "overview": "When Tia receives an adoption email unlike any she's seen before, she makes a cross-country trip to find a dog a special home in time for Christmas. And, the kid's significant others band together to give the family a present they'll never forget.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1253957,
                    "name": "Pushing Forward",
                    "overview": "Tia attempts to rescue a stray, but her leg injury hinders her. New parolee Mike struggles to balance working and being a parent. And, a family comes to Villalobos hoping to adopt a dog for their daughter, but finding a good match proves a challenge.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-14",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1256726,
                    "name": "Hounded",
                    "overview": "When a dog that was adopted out mysteriously appears in a shelter in Mississippi, Tania and Earl head to the rescue. Parolee Joe is left shaken after separating two stray dogs fighting outside the shelter. And an adoption doesn't go as planned.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-21",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1346679,
                    "name": "Going the Distance",
                    "overview": "After his adopter passes away, Tania heads to California to pick up a former VRC dog. A couple from Arkansas struggle to make a decision about which dog to adopt. And, after being rescued, a badly injured puppy is discovered to be a missing pet.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-28",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1346681,
                    "name": "Longing for Home",
                    "overview": "Newlyweds from New Jersey come looking for a new family member. Tia rescues an injured stray that the community has been trying to help. And, with his family back home in Virginia, longtime parolee Sui faces a tough decision.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 8",
            "overview": "Tia suffers a devastating injury that requires her children to step up to keep Villalobos running, and her family's strength is tested in a way it's never been before. For the first time, Tia's kids are forced to manage the parolees, rescues and adoptions on their own. Throughout the season, the rescues featured are more crucial than ever.",
            "id": 81712,
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        },
        "9": {
            "_id": "59917cbac3a36806d500da52",
            "air_date": "2017-08-05",
            "episodes": [
                {
                    "air_date": "2017-08-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1349648,
                    "name": "City of Second Chances",
                    "overview": "A mother and son travel from Boston with hopes of adopting a dog, but Tia struggles to find a good fit for the family. Lizzy rescues a maggot-covered dog that was found lying on the road and races to the vet, hoping to save her.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-05",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1349649,
                    "name": "Young Blood",
                    "overview": "A new inmate from starts working at VRC, hoping to fill the big shoes that Country Matt left behind. Lizzy and Joe struggle to catch a stray in a nearby neighborhood. A family comes to Villalobos to adopt a dog, hoping to fill a void in their hearts.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-12",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1349650,
                    "name": "A Girl Named Gun",
                    "overview": "A couple from New Jersey falls in love with a new best friend but the adoption gets put on the line when Dr. Kristen discovers a heart murmur; Tia heads out to the swamps to rescue a dog in need of medical attention and the diagnosis shocks her.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-19",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1349651,
                    "name": "A Home at Last",
                    "overview": "Villalobos' oldest resident, Summer, a pit with severe arthritis, has a chance at a forever home. Earl works to improve a dog's social skills, hoping to make him more adoptable. And Kanani's girlfriend, M2, takes on her first rescue.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-08-26",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1360152,
                    "name": "Midnight Savior",
                    "overview": "A call in the middle of the night sends Tia racing to deal with a family emergency. A homeless man reaches out for assistance when his dog has trouble breathing. A healthy dog tied up outside VRC leads to a shocking story and a difficult decision.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-02",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1360153,
                    "name": "Tip of the Iceberg",
                    "overview": "After Tia and Sugar rescue a stray, they are shocked by what they find and race him to the vet. New worker Darius pursues his dream of working in the veterinary field. And an empty nester heads to Villalobos looking for a new companion.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-09",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1364502,
                    "name": "A Different Mission",
                    "overview": "Earl takes the lead in restoring an abandoned Rottweiler back to health. A service dog organization from North Carolina reaches out to Villalobos in search of a new dog for their program. M2 goes on her second rescue, taking in an owner surrender.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-16",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1367803,
                    "name": "Rising Tide",
                    "overview": "Concerned about flooding in Assumption Parish, Tia seeks a solution for how she and the dogs would be able to evacuate quickly; Joe feels a special bond with an injured dog he rescues off the street and takes him under his wing.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-23",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1370894,
                    "name": "Our Growing Pack",
                    "overview": "A California man hopes to find a new dog to stay by his side as be battles cancer. After Lizzy rescues a sick dog, she rushes to the vet, hoping it's not too late. Tania and Perry prepare to embark on a new chapter in life: parenthood.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-23",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1994320,
                    "name": "Pit Bulls & Parolees Presents: Hounded",
                    "overview": "With Villalobos' country location overrun with hounds, Tia turns to a trusted parolee and his new wife to help get one of the lovable but troublesome dogs a new home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 9",
            "overview": "After a long recovery from a devastating leg injury, Tia gets back into in full swing and relies on her children, their significant others and the parolees to help keep the ever-expanding rescue center running. Tia fights a never-ending battle that's grown to include dogs of every type and size, in desperate need of help. Many are unwanted pets dumped on the road, found wandering in the swamps, or thrown over the Villalobos gates. It's the reality of running the nation's largest pit bull sanctuary, where each new day brings happiness or heartbreak - and sometimes both.",
            "id": 91427,
            "poster_path": null,
            "season_number": 9,
            "vote_average": 0
        },
        "10": {
            "_id": "5a5358d4c3a368754a02fb40",
            "air_date": "2018-01-06",
            "episodes": [
                {
                    "air_date": "2018-01-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1416968,
                    "name": "A New Year for Villalobos",
                    "overview": "A homeless man asks Villalobos to take his puppies, so Mariah and Marcel decide to help people living on the streets with their dogs. Meanwhile, Tia and Mariah surprise the family with a gift celebrating their bond; and a gift changes the lives of the dogs.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-06",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1416969,
                    "name": "Shelter from the Storm",
                    "overview": "Tia hires three new parolees, but things quickly take a turn for the worse. A rural shelter threatened with closure needs Tia's help. And a family recovering from the loss of their home and dog in a flood comes to VRC looking for a new best friend.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-06",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1416970,
                    "name": "The Dogs Who Made Us",
                    "overview": "This special episode takes a look at the dogs that will always hold a place in the family's hearts.  From the first pit bull that Tia rescued to the dog that walked Tania down the aisle, family members share why each dog is so important to them.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-13",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1419301,
                    "name": "Soul Survivor",
                    "overview": "A former adopter comes back to Villalobos to find a companion to support her through her battle with cancer. The VRC crew join efforts to rescue an injured stray near the warehouse. And Tia puts a new parolee through his paces.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-20",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1421972,
                    "name": "New Arrivals",
                    "overview": "Tania races to rescue a mama dog clinging to life after being in labor for two days. A young woman comes to Villalobos looking for a roommate to share her new home with. And, Tia's son Moe and his wife Lizzy embark on their biggest adventure yet.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-27",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1425161,
                    "name": "Treading Water",
                    "overview": "Tania and Mariah make it their mission to help two puppies diagnosed with swimmer's syndrome take their first steps. Marcel rescues a stray dog trapped beneath a house. And a couple from New York are looking for a companion.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-03",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1428630,
                    "name": "Cutest Moments Ever",
                    "overview": "Tia, Tania and Mariah look back at the most adorable moments from the series, as determined by the fans. From surprising rescues and teary reunions to heartwarming adoptions and parolee antics, they reveal the cutest moments of Pit Bulls & Parolees.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-17",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1434776,
                    "name": "Most Valuable Puppy",
                    "overview": "Villalobos is invited to attend their first Puppy Bowl, but which lucky pup will represent the rescue? New parolee Spencer joins Tania on his first rescue mission. And, a couple from Florida visits VRC in search a dog to heal their broken hearts.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-24",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1439599,
                    "name": "Left for Dead",
                    "overview": "Tia races to rescue an emaciated puppy chained to an abandoned home. A couple visits VRC in hope of finding a younger sibling for their dog. And a Good Samaritan needs help rescuing a stray mama dog still bleeding three weeks after giving birth.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-03",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1994363,
                    "name": "A Brother's Lifeline",
                    "overview": "A couple is torn between two dogs and can't decide which one to bring home. A terrified neighborhood stray in dire need of medical attention results in a difficult rescue for the VRC crew. And Country Matt returns, seeking a job for his brother.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-03",
                    "episode_number": 11,
                    "episode_type": "finale",
                    "id": 1994362,
                    "name": "Mama Drama",
                    "overview": "Moe and Lizzy rescue a sick, scared stray, but a diagnosis proves tricky. A friend of the rescue visits in hope of adopting a dog that has previously been overlooked. And new mom Tania struggles to find a balance between life and work at Villalobos.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 10",
            "overview": "",
            "id": 97644,
            "poster_path": null,
            "season_number": 10,
            "vote_average": 0
        },
        "11": {
            "_id": "5ddb67e5a80673001410c8e0",
            "air_date": "2018-09-29",
            "episodes": [
                {
                    "air_date": "2018-09-29",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1994322,
                    "name": "Village of Wolves",
                    "overview": "Villalobos is tested like never before when Tia and her crew are called upon to rescue a pack of wolf-dog hybrids abandoned by a backyard breeder; with law enforcement threatening to kill the dogs, the pressure is higher than ever.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-06",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1994323,
                    "name": "A Brother's Return",
                    "overview": "Country Matt returns to help his brother, a new parolee, overcome his fear of dogs; Earl and Tia's daughter-in-law race to save a stray running loose in scorching temperatures; a couple of empty nesters visit VRC in search of a new friend.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-13",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1994324,
                    "name": "Never Let Go",
                    "overview": "The police need Villalobos' help when a woman in the French Quarter is rushed to the hospital, leaving her dogs behind; a recent divorcee from Alabama visits the rescue to help fill the void in his home; Rhino faces a health crisis.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-20",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1994326,
                    "name": "Under Earl's Wing",
                    "overview": "A family from Chicago comes to VRC hoping to find their first dog; in Assumption Parish, Tia takes in a dog that has been attacked and is near death; Earl mentors a young employee, trying to keep him out of trouble.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-27",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1994327,
                    "name": "A Clean Slate",
                    "overview": "Former adopters want to expand their family and adopt Caleb, a puppy that Tania rescued at birth, but Tia is unsure he will fit in with their other dog; when a local gets arrested, his dog is left behind and VRC is called in to help.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-03",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1994328,
                    "name": "A Puppy's Journey Home",
                    "overview": "Villalobos is stretched thin when rescue calls come in one after another; Lizzy tries to rescue a stray pit bull that the NOPD called aggressive in the city; and M2 tries to track down an aggressive dog on the run in the country.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-10",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1994330,
                    "name": "Finding a Hero",
                    "overview": "A disabled veteran and his wife visit Villalobos to find a pair of dogs to help with his depression; Marcel and Mariah race to help a puppy in need; a rescued dog has trouble settling in, so Tia reaches out to other shelters for help.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-17",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1994331,
                    "name": "Divine Rescue",
                    "overview": "When former adopters return to VRC to find their dog a companion, Tia and Lizzy switch up their usual adoption procedure to get the best results; Marcel rescues a dog abandoned at a local church and is concerned that some masses could be cancer.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-24",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1994333,
                    "name": "Finally Free",
                    "overview": "Tia is confronted with the biggest rescue in Villalobos history after receiving a call about a pack of abandoned dogs; local couple visits in hope of adopting a dog to complete their family.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-01",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1994334,
                    "name": "From the Ashes",
                    "overview": "When a woman calls Tia to surrender puppies she can't care for anymore, Tia is shocked by what she finds; months after their house was destroyed in a fire, M2 and Kanani prepare to move into their new home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-08",
                    "episode_number": 11,
                    "episode_type": "finale",
                    "id": 1994336,
                    "name": "My Underdog Life",
                    "overview": "Lizzy and Marcel team up to catch a stray pit bull; a family-to-be visits Villalobos to adopt a dog that will complete the unit; Tia reveals the publication of her first book.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 11",
            "overview": "",
            "id": 136465,
            "poster_path": null,
            "season_number": 11,
            "vote_average": 0
        },
        "12": {
            "_id": "5ddb6a0b6f53e10011ef2d39",
            "air_date": "2019-01-19",
            "episodes": [
                {
                    "air_date": "2019-01-19",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1994342,
                    "name": "Pressure Cooker",
                    "overview": "Villalobos faces one of their most challenging rescues when a house fire reveals a massive dog-hoarding situation. Two teachers fall in love with a deaf puppy they hope to give a forever home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-01-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1994343,
                    "name": "Golden Girl",
                    "overview": "Mariah faces a challenging rescue when the dog in danger is deaf. Former adopters come back to Villalobos set on adopting a special needs dog. And the rescue struggles to track down a dog's owner because of outdated microchip information.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-02",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1994344,
                    "name": "A Family Connection",
                    "overview": "A VRC senior dog finally gets a chance to have a forever home when a couple from Idaho comes to New Orleans to find a new family member.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-09",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1994345,
                    "name": "Southern Dogs in the City",
                    "overview": "Villalobos participates in Dog Bowl, creating a chance for a handful of dogs to steal the spotlight. M2 helps a neglected dog left in horrible conditions. And a couple takes the first step towards becoming parents - adopting a Villalobos dog.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-16",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1994346,
                    "name": "A Box of Puppies",
                    "overview": "A potential adopter wants to give a forever home to a senior dog that has only known kennel life. M2 and Kanani are shocked when they find a box of puppies in a field. And, Matt and Earl head to the kitchen to cook up some fresh food for a sick dog.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-23",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1994347,
                    "name": "Fire Dog",
                    "overview": "A potential best friend needs to pass a unique test before he can be adopted out. Parolee Jammall returns after a mysterious absence. A year after losing their house in a fire, M2 and Kanani do something special for the dog who saved their lives.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-02",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1994348,
                    "name": "Like a Boss",
                    "overview": "Tia and Country Matt team up to rescue a reportedly aggressive dog. When a local student wants to adopt a dog that can join her on runs, Earl joins in the training regimen. And, parolee Jammall oversees the care of a dog with serious health issues.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-09",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1994349,
                    "name": "Last of the Mobsters",
                    "overview": "Tia and her kids race to rescue a stray dog near a dangerous, busy highway. An adoption requires some temperament testing in an 18-wheel truck when a trucker wants to adopt a dog to join him on the road. And, a return adopter seeks out a senior dog.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-16",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1994350,
                    "name": "The Pitz Carlton",
                    "overview": "Lizzy and Elise struggle to rescue a dehydrated dog in the blazing heat. An anxious, abandoned dog is moved to a new warehouse for dogs with special needs. And, Tia and the twins help a friend of the rescue find the perfect match.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-23",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1994351,
                    "name": "Love at First Sight",
                    "overview": "Tia's son Kanani, and his fiance M2, prepare for their wedding. Parolee Jammall finds an abandoned dog and asks Mariah for help rescuing it. And, a mother and son visit Villalobos hoping to find a new friend for their family dog.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-30",
                    "episode_number": 11,
                    "episode_type": "finale",
                    "id": 1994352,
                    "name": "The Dogs That Stole Our Hearts",
                    "overview": "Tia, her kids and the extended Villalobos family reveal the behind the scenes stories of the dogs that have stolen their hearts over the years.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 12",
            "overview": "",
            "id": 136466,
            "poster_path": null,
            "season_number": 12,
            "vote_average": 0
        },
        "13": {
            "_id": "5ddb6ba56f53e10013ef2d9f",
            "air_date": "2019-10-05",
            "episodes": [
                {
                    "air_date": "2019-10-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1994353,
                    "name": "Raised in Rescue",
                    "overview": "Return adopters visit Villalobos to find a dog that will feel at home on their boat. Tania and Mariah head out to rescue a stray that is hiding beneath a shipping container. And, parolee Jammall starts to slip up, risking his future at the rescue.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-10-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1994354,
                    "name": "Here in Their Golden Years",
                    "overview": "Wanting to give the senior dogs a special place, Lizzy, Tania, and Mariah create a \"retirement center\" at one of the warehouses. And, Lizzy rescues a dog that has one of the worst skin conditions she has ever seen.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-10-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1994355,
                    "name": "Home Is Where the Dog Is",
                    "overview": "One of Earl's favorite dogs finally has a chance at a forever home. Tia heads to a small shelter in rural Louisiana to help with a hound that they took in. And, Tania, Mariah, and Lizzy take on a project that showcases dogs in their forever homes.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-10-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1994356,
                    "name": "Happy Howl-O-Ween",
                    "overview": "Villalobos celebrates Halloween by throwing a costume party for dogs to help raise money for the rescue. An old friend from the TV crew comes to adopt a family member. And, Lizzy struggles to rescue a stray dog in the middle of the night.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1994357,
                    "name": "Treasure Not Trash",
                    "overview": "Tania is shocked by what she finds once she gets a stray dog back to the rescue. An empty nester brings her family to Villalobos to help her find a companion. And, the family are determined to solve their messy pigeon problem.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-09",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1994358,
                    "name": "Match Made Perfect",
                    "overview": "Lizzy and Elise struggle to rescue a stray on the train tracks near the Villalobos warehouse. Mariah enlists help to get to the bottom of her dog Tater's nagging pain. A senior dog with a long medical history finally has her shot at a forever home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-16",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1994359,
                    "name": "Sisters in Rescue",
                    "overview": "When a 3-legged dog has trouble finding a forever home, Amanda Giese from Panda Paws Rescue comes to New Orleans to help. Parolee Troy shares some life changing news with the VRC crew. And, Villalobos helps an employee's dad find a new companion.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-23",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1994360,
                    "name": "Never Too Late",
                    "overview": "Lizzy tries to track down the owner of a dog tied up outside the rescue. An older couple comes looking for their first dog, but their choice requires special temperament testing. And, when a dog develops allergies, Mariah looks for a natural cure.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-30",
                    "episode_number": 9,
                    "episode_type": "finale",
                    "id": 1994361,
                    "name": "The Sweetest Thing",
                    "overview": "The family of Mutt, an employee who recently passed away, meets the dog that he chose for them. A stray near a middle school leads Tia and M2 on a wild good chase. And, Lizzy and Moe tackle the challenging task of renovating the dog agility course.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 13",
            "overview": "This season, former adopters return to Villalobos in hopes of finding another dog to add to their family, Lizzy, Tania, and Mariah create a \"retirement center\" at one of the warehouses to give the senior dogs a special place to call home, and for the first time, the rescue team celebrates their favorite holiday, Halloween, with a special event to benefit the hundreds of dogs in their care. The rescues this season continue to make a lasting impact on the team, from an abandoned dog with a severe skin condition to strays that lead the Villalobos employees on a wild goose chase. And this season, the Villalobos team sees families from Idaho to Florida to Wisconsin, who've opened their hearts and homes for a new family member. Later in the season, Tia partners with Amanda Giese from Amanda to the Rescue.",
            "id": 136467,
            "poster_path": null,
            "season_number": 13,
            "vote_average": 0
        },
        "14": {
            "_id": "5f1ee31e07a808003685cf73",
            "air_date": "2020-01-04",
            "episodes": [
                {
                    "air_date": "2020-01-04",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2367848,
                    "name": "Storm on the Horizon",
                    "overview": "As VRC braces for Hurricane Barry, Tia and her crew ensure the animals' safety and Mariah and Earl tend to a stray Labradoodle that has been shot. Later, a cancer survivor hopes to rescue an unwanted dog she loves called East.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/9EJY4sPVJB5089ePwfdq61WXypR.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2375196,
                    "name": "Twist of Fate",
                    "overview": "Tia and M2 take to the water to prepare a pit bull for her forever home. A new parolee comes to Villalobos from Boston, hoping stay on track so that he can make his teenage son proud. A stray dog is near death when Lizzy and Heidi find him.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/hGDHx79KOr9MjaRBmv1AOfNPhA2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2375197,
                    "name": "Pack of Puppies",
                    "overview": "A Harley-loving adopter comes to Villalobos from Michigan. Mariah and Lizzy struggle to catch a stray pit in New Orleans East. When a litter of black pit-mix puppies are dropped off at the Sanctuary, Tia and M2 turn to social media to adopt them out.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/9AV7nzW9xPfPk078HZ38Rpnrtr9.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2390529,
                    "name": "Saved from the Fight",
                    "overview": "Tia is called in to help rescue five injured dogs from a dog fighting situation. Parolee Spencer gets out of jail and returns to Villalobos. Tia asks Spencer to help out with an adoption to keep him on the straight and narrow.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/eUSshXngAFXK4jXW8lAMReChVjX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2399615,
                    "name": "Escaping Death",
                    "overview": "When an aggressive dog is in danger of being put down, Tia heads to South Carolina to save him. A couple from Florida comes to VRC hoping to find a dog that will enjoy retired life with them. Parolee Toney Converse takes on more responsibility.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/UsJwsfn6wNiX6eyiq0CM6Aezu8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-01",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2407542,
                    "name": "The Villalobos Bowl",
                    "overview": "Before heading to New York City's Dog Bowl, Mariah and M2 prepare their most eligible rescues for the big day. Toney and Earl discover an emaciated stray dog roaming a nearby neighborhood, and a lone trucker comes to VRC to find a forever friend.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/iP213KzO0vJJGXEHdJiBhJasmbZ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-08",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2416046,
                    "name": "Unexpected Development",
                    "overview": "As Moe and Lizzy reveal they are expecting a second child, parolee Spencer announces he's expecting his first. Alongside a busy road, an injured dog is found. And things don't go as planned when Lizzy's favorite canine goes up for adoption.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/1S01dYA5QNPeB8dbPs0QKC5wqEu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-15",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2425215,
                    "name": "A Dream Realized",
                    "overview": "Two strays lead Lizzy and Villalobos employees on a wild goose chase. A grandmother comes to Villalobos looking for another canine companion, but her dog Daisy has other plans. And, Tania pursues her dream to write a children's book.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/bn0wnI8dEDB153oEEGQEmyYbs39.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-22",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2433794,
                    "name": "Dogs in Prison",
                    "overview": "A Pennsylvania prison offers to take 20 dogs from Villalobos. An emaciated pit bull fights for its life. A potential adopter travels from Michigan to meet a dog that stole her heart, but then is shocked when she comes face to face.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/6aSwCa6wlwebX9XTIYuxtDlCjdB.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-29",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 4521645,
                    "name": "You Are Free",
                    "overview": "Tania struggles to rescue a puppy that is hiding underneath a shed. A potential adopter comes to Villalobos hoping to find a companion for her dog, and she's only interested in seeing hounds. A beloved employee learns that he's finally off parole.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/aXSO3DwMxvyNsvwqjRB9ZpQ7g6Z.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-07",
                    "episode_number": 11,
                    "episode_type": "finale",
                    "id": 4521646,
                    "name": "Not Giving Up",
                    "overview": "The crew helps pregnant Lizzy find an injured, older dog roaming the Ninth Ward, and a long-time employee gets some exciting news about his future. Later, Mariah helps a pooch battling tumor surgeries and is in need of a forever home.",
                    "production_code": "",
                    "runtime": 85,
                    "season_number": 14,
                    "show_id": 31537,
                    "still_path": "/lGQcz6svtW0oA5z4VpdP7K2IMIe.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 14",
            "overview": "",
            "id": 157414,
            "poster_path": null,
            "season_number": 14,
            "vote_average": 0
        },
        "15": {
            "_id": "5fa0183c7e34830038a4a142",
            "air_date": "2020-07-25",
            "episodes": [
                {
                    "air_date": "2020-07-25",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2488662,
                    "name": "Unexpected Call",
                    "overview": "When two lovable pups are dropped off at Villalobos' dog boutique, the VRC crew is determined to get them back to good health. Then, a young woman comes in searching for a canine perfect to experience the Big Easy lifestyle with her.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 15,
                    "show_id": 31537,
                    "still_path": "/wqQMIzDB9qtia1jsFmtlIoKHnFW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-01",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2488663,
                    "name": "The Toughest Choice",
                    "overview": "Tia and Earl face a decision about an elderly hound needing medical attention at an Alabama shelter; an abandoned, aggressive dog is found roaming a trash-filled backyard.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 15,
                    "show_id": 31537,
                    "still_path": "/vZugrwqEt8qmI7wciTFacEsGCWQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2488664,
                    "name": "Rescued From War",
                    "overview": "Tia takes in a pit bull that was rescued from terrible conditions in Kuwait; an adopter travels from Michigan in hopes of finding a new best friend; when a stray dog ends up at Villalobos, Earl is determined to track down its owner.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 15,
                    "show_id": 31537,
                    "still_path": "/708EuXQ7YIxs4JD08QOvoAENCid.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-15",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2488665,
                    "name": "Danger Ahead",
                    "overview": "When Kenani is in a serious motorcycle accident, Tia and the Villalobos crew must band together to ensure him a speedy recovery; a retired Marine visits the center to find a forever fur-friend; Lizzy and Earl rescue a hound found in a parking lot.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 15,
                    "show_id": 31537,
                    "still_path": "/i4ZokwBTPZkaiwUMlbEN3JfrrTv.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-22",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2488666,
                    "name": "Last Chance Rescue",
                    "overview": "Tia races to a rural shelter in Louisiana to rescue four dogs from euthanasia. Meanwhile, Mariah and Toney give a scared, shy dog a shot at a forever home, and a unique canine gets a chance at a dog program in a Pennsylvania prison.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 15,
                    "show_id": 31537,
                    "still_path": "/54igmKdjDZ8M5eeBvOtkwJRelIJ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-29",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2488667,
                    "name": "One Man's Treasure",
                    "overview": "Toney and Earl rescue an aggressive dog that is found tied up in front of an abandoned home; Mariah helps a deserted canine that is struggling with neurological issues.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 15,
                    "show_id": 31537,
                    "still_path": "/3IFtVp6dAr34rMzNhDn8ibAQklb.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-05",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2488668,
                    "name": "Everything for Emma",
                    "overview": "Mariah looks for a homeless woman needing to give up her beloved pit bull. Meanwhile, Lizzy prepares her favourite rescue for a home after dealing with his medical issues.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 15,
                    "show_id": 31537,
                    "still_path": "/affIThEwmh5Kuuqub5Z18t9wRhV.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-12",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4521638,
                    "name": "One Man's Treasure",
                    "overview": "Toney and Earl rescue an aggressive dog found tied up in front of an abandoned home. Tia and Lizzy escort a pit bull to its potential forever home in New Jersey, while Mariah helps a deserted canine struggling with neurological issues.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 15,
                    "show_id": 31537,
                    "still_path": "/zPUkZ1qpjieaqWAxybftBc5IN2Y.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-19",
                    "episode_number": 9,
                    "episode_type": "finale",
                    "id": 4521639,
                    "name": "Rescue Dogs Reunited",
                    "overview": "Tia and M2 welcome back a couple who want to reunite their adoptee with her former best friend. Mariah and Toney discover a hound in desperate shape, while Mariah does everything in her power to nurse VRC's first Louisiana rescue back to health.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 15,
                    "show_id": 31537,
                    "still_path": "/jlIvbUAHpPwIqlMp6uedyXpmCMT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 15",
            "overview": "",
            "id": 167463,
            "poster_path": null,
            "season_number": 15,
            "vote_average": 0
        },
        "16": {
            "_id": "5ff2537746e75f003ed3d7f5",
            "air_date": "2021-01-02",
            "episodes": [
                {
                    "air_date": "2021-01-02",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2614351,
                    "name": "200th Episode",
                    "overview": "The Villalobos crew celebrates 200 episodes and recount precious memories. From Mariah's beauty pageant days, to memorable rescues. like Walter and Buffy. They reminisce on what it was like to film and the highs and lows of living the rescue life.",
                    "production_code": "",
                    "runtime": 82,
                    "season_number": 16,
                    "show_id": 31537,
                    "still_path": "/4SVSIA5KWluNKqOObuTSemFYY5A.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-09",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2615465,
                    "name": "Invisible Enemy",
                    "overview": "Tragedy strikes after Tia and M2 agree to take two emaciated hounds from a rural shelter. Mariah and Lizzy give two special dogs a happily ever after while working through the chaos of the global pandemic, and M2 reveals an exciting new life chapter.",
                    "production_code": "",
                    "runtime": 82,
                    "season_number": 16,
                    "show_id": 31537,
                    "still_path": "/36fA2kClN7ov1aBTUmhuztSbDYm.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-16",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2638427,
                    "name": "No Wolf Left Behind",
                    "overview": "In Texas, Tia is determined to rescue over 50 abandoned hybrid hounds.",
                    "production_code": "",
                    "runtime": 82,
                    "season_number": 16,
                    "show_id": 31537,
                    "still_path": "/fKbBItmdRarspY8rHTqGjCZx6ns.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-23",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2638428,
                    "name": "Earl's Path",
                    "overview": "Tia has a watchful eye on Earl nearly a year after his run-in with the law.",
                    "production_code": "",
                    "runtime": 83,
                    "season_number": 16,
                    "show_id": 31537,
                    "still_path": "/oL4t4Glqls5833toMuYBGyjbdUQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-01-30",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2694286,
                    "name": "Diamond in the Rough",
                    "overview": "During the global pandemic, Tia and Mariah make trying decisions.",
                    "production_code": "",
                    "runtime": 82,
                    "season_number": 16,
                    "show_id": 31537,
                    "still_path": "/hLKLUMEd6q9JdrMpRMkvUfqLkaC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-02-06",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2694287,
                    "name": "Befriending a Beast",
                    "overview": "After rescuing 30 hybrid wolf-dogs, Tia, Tania, and the twins return to Texas. In the French Quarter, the pandemic has forced Tia to shut down her restaurant, and Toney and Earl band together to deliver meals to the elderly using Tahyo Tavern's resources.",
                    "production_code": "",
                    "runtime": 83,
                    "season_number": 16,
                    "show_id": 31537,
                    "still_path": "/c4Z341LsvKd6ji3BvXurporR2Y7.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 16",
            "overview": "",
            "id": 174926,
            "poster_path": null,
            "season_number": 16,
            "vote_average": 0
        },
        "17": {
            "_id": "606389a21f98d1003dcb261c",
            "air_date": "2021-04-24",
            "episodes": [
                {
                    "air_date": "2021-04-24",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2840051,
                    "name": "Evading Capture",
                    "overview": "On the streets of New Orleans, the VRC crew is on a mission to catch a runaway dog. A Californian family wants a new furry family member, a paralyzed pup named Polly takes a trip to the vet, and Mariah pitches a fundraising idea to the parolees.",
                    "production_code": "",
                    "runtime": 83,
                    "season_number": 17,
                    "show_id": 31537,
                    "still_path": "/hYudXrSsSpJCXp3uiuKlf9cAJaP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-01",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2905426,
                    "name": "Life in a Cage",
                    "overview": "VRC is at its limit when the amount of rescues and drop-offs rise. Lizzy and Toney travel to a remote part of the city to save a trio of orphaned dogs in a dire state, veteran tenant Lil Rocky faces a cancer scare, and a litter of puppies are welcomed.",
                    "production_code": "",
                    "runtime": 83,
                    "season_number": 17,
                    "show_id": 31537,
                    "still_path": "/1MXuPqOZcSW5bP9effqloTdaRgX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2905429,
                    "name": "Mother of Chaos",
                    "overview": "Now a mother of two, Lizzy leans on Tia to help find a work-life balance; a California couple hopes to adopt a dog that will be comfortable in the pool; Mariah's mission to save an injured dog leads her to something completely unexpected.",
                    "production_code": "",
                    "runtime": 83,
                    "season_number": 17,
                    "show_id": 31537,
                    "still_path": "/p96jR2WhDGoNkxRWgWcnDMXlaRa.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-15",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2905428,
                    "name": "Sound of Silence",
                    "overview": "At a Mississippi shelter, Tia gives a hybrid wolf-dog a second chance. At the vet, Lizzy is forced to make a tough call for a new VRC resident and later helps a pair of hearing impaired canines. Then, a California man visits to find a fur-friend.",
                    "production_code": "",
                    "runtime": 82,
                    "season_number": 17,
                    "show_id": 31537,
                    "still_path": "/aOTI3XREqQN74JBjFjB4A2uvmsk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-22",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2916351,
                    "name": "Change on the Horizon",
                    "overview": "Tia's plans to handle the flooding at the Clairborne Warehouse change when a hurricane heads towards the City of New Orleans. M2 and Kenani rush to prepare for baby number two, and Tia and Tania's Texas rescue mission takes a sudden turn.",
                    "production_code": "",
                    "runtime": 82,
                    "season_number": 17,
                    "show_id": 31537,
                    "still_path": "/ogWpNKSW7y6biA2sEPOk3kzpQec.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 2905430,
                    "name": "A Safe Harbor",
                    "overview": "Facing new challenges, the VRC crew gets creative: Tia leads a virtual meet-and-greet with a lovable hound, Mariah helps the parolees channel their talents for a fundraiser, and a lucky pit bull learns a new skill for life with an outdoorsy couple.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 31537,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 17",
            "overview": "",
            "id": 188504,
            "poster_path": null,
            "season_number": 17,
            "vote_average": 0
        },
        "18": {
            "_id": "63543ad9d8e225007d993358",
            "air_date": "2022-10-22",
            "episodes": [
                {
                    "air_date": "2022-10-22",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4020298,
                    "name": "A New Chapter",
                    "overview": "As a hurricane bears down on VRC, Tia and the crew race to get dogs to safety; Mariah takes the reins for her first solo wolfdog rescue; Lizzy and Earl help a music-loving Kentucky couple find the perfect dog to join their karaoke nights.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 18,
                    "show_id": 31537,
                    "still_path": "/2htovpopqPquAjCFcaHVVXVCC6z.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-29",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4020299,
                    "name": "Incredible Catch",
                    "overview": "M2 leaps into action to save a dog roaming the cane fields before it runs afoul of harvest machinery; Tia and Earl help match veteran adopter Kim with a senior dog; Toney and Emily make every day count for hospice dog Chester.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 18,
                    "show_id": 31537,
                    "still_path": "/fJTMGg5CvdBBlERAnqSLFX55X93.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-05",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4020300,
                    "name": "Dirt Road Refugees",
                    "overview": "Tia and Lizzy answer a distress call from a Mississippi shelter and take on eight dogs in desperate condition; M2 holds down the fort at VRC while juggling life as a mom of two; Mariah finds the perfect home for her special-needs foster dog Rant.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 18,
                    "show_id": 31537,
                    "still_path": "/89hgsRAVXoemzJMQyQnIOWYRfdP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-12",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4020301,
                    "name": "Bad Reputation",
                    "overview": "Tia Torres and a crew of paroled felons care for abused and abandoned pit bulls and other dogs.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 18,
                    "show_id": 31537,
                    "still_path": "/l9U6yqRU2R4YN5TPGIrKbNxYxR8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-19",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4020302,
                    "name": "Watching from Above",
                    "overview": "Tia Torres and a crew of paroled felons care for abused and abandoned pit bulls and other dogs.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 18,
                    "show_id": 31537,
                    "still_path": "/t36SYasxOLsXwpsgVQgFY69prBC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-26",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4041527,
                    "name": "The Road Ahead",
                    "overview": "As the new VRC location nears completion, Tia and the team prep to welcome the public for a volunteer day; an Ohio couple feels a powerful connection with deaf dog Ben; Mariah draws on her passion for motorcycles to honor her beloved pit bull Tater.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 18,
                    "show_id": 31537,
                    "still_path": "/7N9eEAV2CeT1Bv4Sd4B4kRzesRJ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-26",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 4070697,
                    "name": "The Story of Villalobos",
                    "overview": "More than two decades of second chances for the dogs and humans who need them most - it's been an epic journey for Villalobos and Tia's family; Tia looks back on the rescue's incredible history and shares a glimpse of its next chapter.",
                    "production_code": "",
                    "runtime": 41,
                    "season_number": 18,
                    "show_id": 31537,
                    "still_path": "/2Sfo4XGZ4AH5MrqrMULzQbZeHu6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 18",
            "overview": "",
            "id": 313700,
            "poster_path": null,
            "season_number": 18,
            "vote_average": 0
        }
    }
}