{"adult":false,"backdrop_path":"/jFwodJvT1EIujHxeG2Chtl1VOLb.jpg","created_by":[],"episode_run_time":[120],"first_air_date":"2009-09-27","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.pbs.org/nationalparks/","id":31708,"in_production":false,"languages":["en"],"last_air_date":"2009-10-02","last_episode_to_air":{"id":758655,"name":"The Morning of Creation (1946-1980)","overview":"Following World War II, the parks are overwhelmed as visitation reaches 62 million people a year. A new billion-dollar campaign – Mission 66 – is created to build facilities and infrastructure that can accommodate the flood of visitors. A biologist named Adolph Murie introduces the revolutionary notion that predatory animals, which are still hunted, deserve the same protection as other wildlife. In Florida, Lancelot Jones, the grandson of a slave, refuses to sell to developers his family's property on a string of unspoiled islands in Biscayne Bay and instead sells it to the federal government to be protected as a national monument. In the late 1970s, President Jimmy Carter creates an uproar in Alaska when he sets aside 56 million acres of land for preservation – the largest expansion of protected land in history. In 1995, wolves are re-established in Yellowstone, making the world's first national park a little more like what it once was.","vote_average":0,"vote_count":0,"air_date":"2009-10-02","episode_number":6,"episode_type":"finale","production_code":"","runtime":120,"season_number":1,"show_id":31708,"still_path":"/uBdV5hmeMuyT68cdxZoIEqfJwkn.jpg"},"name":"The National Parks: America's Best Idea","next_episode_to_air":null,"networks":[{"id":14,"logo_path":"/hp2Fs7AIdsMlEjiDUC1V8Ows2jM.png","name":"PBS","origin_country":"US"}],"number_of_episodes":6,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"The National Parks: America's Best Idea","overview":"Filmed over the course of more than six years at some of nature's most spectacular locales – from Acadia to Yosemite, Yellowstone to the Grand Canyon, the Everglades of Florida to the Gates of the Arctic in Alaska - “The National Parks: America's Best Idea” is nonetheless a story of people: people from every conceivable background – rich and poor; famous and unknown; soldiers and scientists; natives and newcomers; idealists, artists and entrepreneurs; people who were willing to devote themselves to saving some precious portion of the land they loved, and in doing so reminded their fellow citizens of the full meaning of democracy.","popularity":4.53,"poster_path":"/6RIXsAA5O91qnUha9VqUN9uBfng.jpg","production_companies":[{"id":10722,"logo_path":"/mPJs7G32jMVmgUlcuobZelsjkhv.png","name":"Florentine Films","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":null,"episode_count":16,"id":43202,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2009-09-27","episode_count":6,"id":43201,"name":"Miniseries","overview":"","poster_path":"/wibFnSWAtnqAcMcGQa5dkKEfype.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Miniseries","vote_average":8.5,"vote_count":15,"season_data":{"1":{"_id":"52589fbf760ee3466163cbdb","air_date":"2009-09-27","episodes":[{"air_date":"2009-09-27","episode_number":1,"episode_type":"standard","id":758654,"name":"The Scripture of Nature (1851-1890)","overview":"In 1851, word spreads across the country of a beautiful area of California's Yosemite Valley, attracting visitors who wish to exploit the land's scenery for commercial gain and those who wish to keep it pristine. Among the latter is a Scottish-born wanderer named John Muir, for whom protecting the land becomes a spiritual calling. In 1864, Congress passes an act that protects Yosemite from commercial development for \"public use, resort and recreation\" - the first time in world history that any government has put forth this idea - and hands control of the land to California. Meanwhile, a \"wonderland\" in the northwest corner of the Wyoming territory attracts visitors to its bizarre landscape of geysers, mud pots and sulfur pits. In 1872, Congress passes an act to protect this land as well. Since it is located in a territory, rather than a state, it becomes America's first national park: Yellowstone.","production_code":"","runtime":120,"season_number":1,"show_id":31708,"still_path":"/nX4sHKc0AQs1CX0dKlE2IxwnK3j.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-28","episode_number":2,"episode_type":"standard","id":758650,"name":"The Last Refuge (1890-1915)","overview":"By the end of the 19th century, widespread industrialization has left many Americans worried about whether the country - once a vast wilderness - will have any pristine land left. At the same time, poachers in the parks are rampant, and visitors think nothing of littering or carving their names near iconic sites like Old Faithful. Congress has yet to establish clear judicial authority or appropriations for the protection of the parks. This sparks a conservation movement by organizations such as the Sierra Club, led by John Muir; the Audubon Society, led by George Bird Grinnell; and the Boone and Crockett Club, led by Theodore Roosevelt. The movement fails, however, to stop San Francisco from building the Hetch Hetchy dam at Yosemite, flooding Muir's \"mountain temple\" and leaving him broken-hearted before he dies.","production_code":"","runtime":120,"season_number":1,"show_id":31708,"still_path":"/9Z28BnKWGy8IJGhVRuspmE5q8nb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-29","episode_number":3,"episode_type":"standard","id":758651,"name":"The Empire of Grandeur (1915-1919)","overview":"In the early 20th century, America has a dozen national parks, but they are a haphazard patchwork of special places under the supervision of different federal agencies. The conservation movement, after failing to stop the Hetch Hetchy dam, pushes the government to establish one unified agency to oversee all the parks, leading to the establishment of the National Park Service in 1916. Its first director, Stephen Mather, a wealthy businessman and passionate park advocate who fought vigorously to establish the NPS, launches an energetic campaign to expand the national park system and bring more visitors to the parks. Among his efforts is to protect the Grand Canyon from encroaching commercial interests and establish it as a national park, rather than a national monument.","production_code":"","runtime":120,"season_number":1,"show_id":31708,"still_path":"/eXRAa7kvSB6X9VQi8lAMJcJjlPy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-30","episode_number":4,"episode_type":"standard","id":758652,"name":"Going Home (1920-1933)","overview":"While visiting the parks was once predominantly the domain of Americans wealthy enough to afford the high-priced train tours, the advent of the automobile allows more people than ever before to visit the parks. Mather embraces this opportunity and works to build more roads in the parks. Some park enthusiasts, such as Margaret and Edward Gehrke of Nebraska, begin \"collecting\" parks, making a point to visit as many as they can. In North Carolina, Horace Kephart, a reclusive writer, and George Masa, a Japanese immigrant, launch a campaign to protect the last strands of virgin forest in the Smoky Mountains by establishing it as a park. In Wyoming, John D. Rockefeller Jr. begins quietly buying up land in the Teton Mountain Range and valley in a secret plan to donate it to the government as a park.","production_code":"","runtime":120,"season_number":1,"show_id":31708,"still_path":"/2xY0aEmNHQn5MEdLEVEvzREb566.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-01","episode_number":5,"episode_type":"standard","id":758653,"name":"Great Nature (1933-1945)","overview":"To battle unemployment in the Great Depression, Franklin D. Roosevelt creates the Civilian Conservation Corps, which spawns a \"golden age\" for the parks through major renovation projects. In a groundbreaking study, a young NPS biologist named George Melendez Wright discovers widespread abuses of animal habitats and pushes the service to reform its wildlife policies. Congress narrowly passes a bill to protect the Everglades in Florida as a national park – the first time a park has been created solely to preserve an ecosystem, as opposed to scenic beauty. As America becomes entrenched in World War II, Roosevelt is pressured to open the parks to mining, grazing and lumbering. The president also is subjected to a storm of criticism for expanding the Grand Teton National Park in Wyoming by accepting a gift of land secretly purchased by John D. Rockefeller Jr.","production_code":"","runtime":120,"season_number":1,"show_id":31708,"still_path":"/6Gh2RqR3kd0T704tzgiwpVbemz4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-02","episode_number":6,"episode_type":"finale","id":758655,"name":"The Morning of Creation (1946-1980)","overview":"Following World War II, the parks are overwhelmed as visitation reaches 62 million people a year. A new billion-dollar campaign – Mission 66 – is created to build facilities and infrastructure that can accommodate the flood of visitors. A biologist named Adolph Murie introduces the revolutionary notion that predatory animals, which are still hunted, deserve the same protection as other wildlife. In Florida, Lancelot Jones, the grandson of a slave, refuses to sell to developers his family's property on a string of unspoiled islands in Biscayne Bay and instead sells it to the federal government to be protected as a national monument. In the late 1970s, President Jimmy Carter creates an uproar in Alaska when he sets aside 56 million acres of land for preservation – the largest expansion of protected land in history. In 1995, wolves are re-established in Yellowstone, making the world's first national park a little more like what it once was.","production_code":"","runtime":120,"season_number":1,"show_id":31708,"still_path":"/uBdV5hmeMuyT68cdxZoIEqfJwkn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Miniseries","overview":"","id":43201,"poster_path":"/wibFnSWAtnqAcMcGQa5dkKEfype.jpg","season_number":1,"vote_average":0}}}