{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"2002-05-01","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.g4tv.com/icons","id":3208,"in_production":false,"languages":["en"],"last_air_date":"2007-06-03","last_episode_to_air":{"id":240562,"name":"Eli Roth","overview":"","vote_average":0,"vote_count":0,"air_date":"2007-06-03","episode_number":18,"episode_type":"finale","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null},"name":"Icons","next_episode_to_air":null,"networks":[{"id":164,"logo_path":"/apAZlt5T2uvebXaEN4f5Zw4C1pK.png","name":"G4","origin_country":"US"}],"number_of_episodes":88,"number_of_seasons":5,"origin_country":["US"],"original_language":"en","original_name":"Icons","overview":"Icons was a documentary TV show on G4 that originally focused on significant people, companies, products, history, and milestones in world of video games. It was relaunched in 2006 and focused entirely on pop culture. It was cancelled soon afterwards.\n\nOn May 10, 2006, it was announced that Icons was relaunching on June 3 with an episode focusing on J.J. Abrams. The show will feature a broader scope on things and people \"men 18–34 care about, admire and emulate.\" Future episodes would focus on Marc Ecko, The Onion, and Family Guy. This change in format had been suspected, due to the recent episodes about George A. Romero, Frank Miller and the history of the King Kong franchise.\n\nThe classic video game themed episodes continued to air on the network sporadically until 2008, under the new name of Game Makers.","popularity":10.377,"poster_path":"/tfk5d5uhUtGNBJkzmC1zjeaPTlU.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2002-05-01","episode_count":18,"id":10056,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2003-01-19","episode_count":22,"id":10055,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2004-02-12","episode_count":20,"id":10054,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2005-02-03","episode_count":10,"id":10053,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2006-06-03","episode_count":18,"id":10057,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8,"vote_count":1,"season_data":{"1":{"_id":"52574e0919c29531db0cd92c","air_date":"2002-05-01","episodes":[{"air_date":"2002-05-01","episode_number":1,"episode_type":"standard","id":240487,"name":"Oddworld Inhabitants","overview":"It's an Oddworld after all. Lorne Lanning and Sherry McKenna, co-founders of Oddworld Inhabitants, have created a video game franchise unlike any other. Fans worldwide have embraced Abe and Munch, the spunky characters who battle the forces of evil with little more than their wits. Lorne, Sherry and other insiders reveal long-held secrets behind some of the games' biggest mysteries and recall the fierce backlash that hit when Abe moved from PlayStation to Xbox.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":"/aazDyZPGzRs20bLhgnnplbmZCPs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-01","episode_number":2,"episode_type":"standard","id":240489,"name":"Nolan Bushnell","overview":"For decades Nolan Bushnell, the originator of Pong and ATARI, has pushed the boundaries with inventions that were sometimes a bit ahead of their time. After amassing a personal fortune by selling ATARI to Warner Communications, Bushnell focused his attention on his rapidly growing Chuck E. Cheese pizza parlor chain and backed a series of innovative inventions, including in-car navigation systems, online shopping and robots. The sometimes-controversial father of the video game industry finally returned to the business with his current company, uWink","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":"/j8Bwki8BU8nSX7YF3shdm3Olsv9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-06","episode_number":3,"episode_type":"standard","id":240490,"name":"Pac-Man","overview":"In 1979, a young Japanese game designer named Toru Iwatani had the desire to create a non-violent arcade game that would appeal to everyone. Originally called \"Puck-Man\" in Japan, the name was changed to \"Pac-Man\" by the time the game hit the United States in October 1980. The moment Pac-Man landed on U.S. shores Americans were hit with \"Pac-Man Fever.\" As the fever grew, so did revenues for arcade owners and Pac-Man merchandise retailers. But by the mid 1980s, the arcade industry saw a sharp drop in profits as the home console era began. Atari's home version of Pac-Man for the Atari VCS was one of the best-selling games in Atari's history. Since then, Pac-Man has been released on almost every console imaginable.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":"/xnHfiLV4krp6OcbmT2lsbAQu1K0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-19","episode_number":4,"episode_type":"standard","id":240488,"name":"Lara Croft","overview":"Dubbed \"Indiana Jane\" before her 1996 release in the United States, Lara Croft kicked the door open for open for an army of other video game heroines who are tough - and beautiful. The Tomb Raider series, which continues with the upcoming The Angel of Darkness, has legions of male and female fans. On this episode of \"Icons\" you'll learn the secrets behind the dazzling facade through interviews with Eidos insiders Adrian Smith (\"We always thought that the consumers wouldn't believe for one moment we were going to kill Lara off.\"), Paul Baldwin (\"The original game concept was in fact turned down.\"), and Rob Dyer (\"We were more concerned it was going to turn off guys.\").","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-06-09","episode_number":5,"episode_type":"standard","id":240494,"name":"Activision","overview":"Founded by four former Atari vets in 1980, Activision dominated the video game industry with smash-hit titles like Pitfall!, River Raid and Kaboom! Rocked by an industry downturn and business missteps, the company floundered until it was purchased by a group headed by Robert Kotick (\"Everybody was asking me whether I was mad, you know. Why was I going off and doing this?\"). But Kotick proved his doubters wrong and turned the failing game company into one of the world's most successful video game publishers.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":"/cd2nvYWiZIPnKEixQATRk86O0k.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-06-16","episode_number":6,"episode_type":"standard","id":240491,"name":"Miyamoto","overview":"Mr. Miyamoto has created characters such as Donkey Kong, Zelda and, of course, Mario. But with each success, the pressure on Mr. Miyamoto has increased to continually be innovative. He has met the challenge each time and become an integral part of Nintendo's worldwide success. Despite his status as an icon in the gaming world, Mr. Miyamoto remains a team player and leads a surprisngly humble life","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":"/b0k5jOgjGAbBswy4JVJjJA8t2lj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-07-07","episode_number":7,"episode_type":"standard","id":240497,"name":"Everquest","overview":"Fans worldwide have embraced EverQuest since its debut in March of 1999. The enchanting land of Norrath--populated by humans, gnomes, elves and other incredible creatures--is also home to as many as 40,000 players at a given time. On this episode of \"Icons,\" we'll learn the stories behind the conceptualization of EverQuest, how its creators convinced Sony Online Entertainment that Ultima Online was not the ultimate in massive multiplayer online gaming, and what the future holds for this fantasy world.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-07-28","episode_number":8,"episode_type":"standard","id":240500,"name":"Bioware","overview":"In just seven short years, the video game company Bioware, formed by Ray Muzyka and Greg Zeschuk, has become one of the most respected and fastest-growing companies in the video game business. Best known for their submersive role-playing games, Bioware strives to push the envelope combining the best of technology and epic story-telling.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-08-18","episode_number":9,"episode_type":"standard","id":240492,"name":"Will Wright","overview":"Before they became a part of the biggest-selling PC video game franchise in the world, Will Wright's Sims games were met with skepticism by the very companies who would later launch them. Learn how Wright's endless curiosity led to one of the most curious series of games, how the term \"God Game\" was coined, and where the seemingly endless series of Sims games and expansion packs are leading. Industry insiders, fellow game creators and family members help Will Wright tell his compelling story.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-01","episode_number":10,"episode_type":"standard","id":240496,"name":"Women in Gaming","overview":"Women are finding careers behind the scenes as producers, designers and even CEOs of gaming companies. But their rise to the top hasn't always been easy. These eight women--Sherry McKenna, Elaine Hodgson, Caroline Esmurdoc, Patricia Pizer, Amy Farris, Beth Llewelyn, Felice Standifer and Kathy Vrabeck--share their stories, from being asked to serve coffee to sharing a restroom. And more than ever, women are going online. The popularity of massively multiplayer online games like EverQuest are attracting more women gamers. As the gaming industry grows, so do opportunities for women.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-22","episode_number":11,"episode_type":"standard","id":240493,"name":"Insomniac Games","overview":"Find out how two Princeton graduates, Ted Price and Alex Hastings, created a budding gaming dynasty with Insomniac Games. Get the history on how Insomniac got off the ground, despite a less than stellar start with their PlayStation first-person shooter, Disruptor. You'll also find out why Spyro is purple, and we've got a special sneak look at their latest hit in the making, Rachet & Clank.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-06","episode_number":12,"episode_type":"standard","id":240498,"name":"Sid Meier","overview":"Sid Meier launched his first game company, Microprose, in 1982 on a dare from friend Bill Stealy. Over the next decade, Meier and Stealy created flight simulator games and developed a solid reputation for making games that had simple but addictive gameplay. By 1996, Micrprose had grown into a multi-million dollar company, but Meier, always the creative force, grew disenchanted with the business. He left Microprose to start his own small development company, Firaxis Games, which has allowed Meier to create fun and intelligent computer games, enjoyed by millions.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-27","episode_number":13,"episode_type":"standard","id":240499,"name":"Scary Games","overview":"When did video games start scaring you? Do you remember the first scary game you ever played? We take a look back at the scariest of the scary, from their humble start--and fumble--to their ultimate success in the gaming world. Included are looks at The 7th Guest, Alone in the Dark, Resident Evil, and much, much more","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-10","episode_number":14,"episode_type":"standard","id":240495,"name":"Richard Garriott","overview":"The land of Britannia; a realm of magic, mystery, intrigue, and adventure. Who created this world? How did it begin? Find out the true story behind Richard Garriott, the man responsible for jumpstarting the PC role-playing game genre, and the creator of the Ultima series.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-24","episode_number":15,"episode_type":"standard","id":240502,"name":"Bruce Shelley","overview":"Very few people can say that they've honed their gamemaking skills alongside a gaming god. But that's exactly what Bruce Shelley did. After getting a start in the industry by helping Sid Meier create games such as Railroad Tycoon and Civilization, he went on to create the critically acclaimed Age of Empires series. We follow his career from his board game making start to Ensemble's latest game, Age of Mythology.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-03","episode_number":16,"episode_type":"standard","id":240504,"name":"John Madden NFL Football","overview":"Presenting the history of the Madden football franchise, from its humble beginnings on the Apple II to the realistic powerhouse that it is today, you'll get all the details on how this series came to be. Featuring interviews with the developers and behind-the-scenes footage from the past.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-12-18","episode_number":17,"episode_type":"standard","id":240501,"name":"Splinter Cell","overview":"Introducing the first in a series of Icons specials that feature the latest and greatest games, developers, and companies of today. For our premiere episode we'll take an in-depth look at the creation of the critically-acclaimed stealth action game, Tom Clancy's Splinter Cell. Catch a glimpse of how the development team went from the drawing board to the final gold.","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-12-23","episode_number":18,"episode_type":"finale","id":240503,"name":"Lord of the Rings","overview":"When Universal Interactive decided to make a game based on \"The Lord of the Rings\" trilogy, they realized that it would take a special effort to bring the game to life. This is the story behind the painstaking effort the led to the creation of \"The Lord of the Rings: Fellowship of the Ring\".","production_code":"","runtime":30,"season_number":1,"show_id":3208,"still_path":"/t9AdcQFdvFStjXdMDetsnvb0ZFr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":10056,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"52574e0919c29531db0cd91e","air_date":"2003-01-19","episodes":[{"air_date":"2003-01-19","episode_number":1,"episode_type":"standard","id":240464,"name":"Atari","overview":"We kick off our new season with the real story behind the world's first truly great videogame company: Atari. Find out just how wild they got, what happened to bring it all down, and what the future holds for them.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-02","episode_number":2,"episode_type":"standard","id":240463,"name":"Music Music","overview":"We sit down with Tommy Tallarico, George Sanger (AKA \"The Fat Man\"), Clint Bajakian, Masaya Matsuura, Scott Gershin and other music makers to get their stories and learn about the history of music in gaming.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-16","episode_number":3,"episode_type":"standard","id":240466,"name":"Unreal","overview":"We get the lowdown from Cliffy B and show you the true story behind the creation and rise of the Unreal series. From the first Unreal to Unreal 2, see how one beautiful first-person shooter spawned a legendary franchise.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-02","episode_number":4,"episode_type":"standard","id":240465,"name":"Yu Suzuki","overview":"A founding father of gaming, Yu Suzuki's every step revolutionized the way we play games. Watch as we follow the ups and downs of the Michelangelo of game design, from the success of Virtua Fighter to the struggle to bring Shenmue to life.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-23","episode_number":5,"episode_type":"standard","id":240467,"name":"Intellivision","overview":"We take an in-depth look at the Intellivision. Get the true story behind how they began, the world's first console war, and who won. With interviews from people who were there, we show you what happened to Intellivision and where it is today.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-27","episode_number":6,"episode_type":"standard","id":240471,"name":"The Legend Of Zelda","overview":"Icons brings you the story behind a boy named Link, a princess named Zelda, and one of the most loved gaming series of all time. Join Shigeru Miyamoto, and Eiji Aonuma for a look back at the creation of The Legend of Zelda franchise.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-10","episode_number":7,"episode_type":"standard","id":240476,"name":"Xbox","overview":"How does a console go from an idea to your living room? Join us as we follow the path the Xbox team took. Learn how a failed game led a young designer to become the voice that would push Microsoft into the video game arena, then hear from the team that started the system and find out what they think about it now. This is the story of how a great idea can change the way we play.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":"/eR1tg6pMGeYJuVGF6s3hVVExX2A.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-28","episode_number":8,"episode_type":"standard","id":240469,"name":"Arcade","overview":"Icons brings you an in-depth look inside a place we all grew up with. Get the story behind the arcade's glorious past, its downfall, and where it's headed in the future. With interviews from some of the pioneers of the video game industry, join us as we take a look back at the history of the arcade.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":"/3nG7IMS05T54z9y57fFdgPXWkUB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-22","episode_number":9,"episode_type":"standard","id":240470,"name":"The History Of E3","overview":"It's where we see the games for the first time. It's a celebration of gaming and a testing ground for game companies. We take a look behind the spectacle and bring you the history of E3.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-05","episode_number":10,"episode_type":"standard","id":240468,"name":"LucasArts","overview":"From Ball Blazer to Grim Fandango, we give you a tour of the one and only, LucasArts. Find out how they got their start with games like Rescue on Fractalus, and get the story behind some of their key games like X-Wing and Dark Forces.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-12","episode_number":11,"episode_type":"standard","id":240475,"name":"Red Storm","overview":"What happens when Tom Clancy meets up with a former British submarine Commander? Videogame history. Gear up, it's time to learn about how a small game developer in Raleigh North Carolina changed the face of first-person shooters with games like Rainbow Six and Ghost Recon.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-19","episode_number":12,"episode_type":"standard","id":240473,"name":"Warren Spector","overview":"In an industry ripe with derivative sequels Warren Spector's games have consistently given players new ways to play. From his days at Origin working on the Ultima and Wing Commander series, through his time helming the Ion Storm Austin team, Warren has struggled to see his games made the way he and his amazing teams envisioned them.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-10","episode_number":13,"episode_type":"standard","id":240474,"name":"PC Gaming","overview":"Its beginnings were humble, but soon the personal computer would become one of the greatest gaming platforms of all time. Join us as we follow the rise of PC gaming from the early days of text adventures in Ziploc bags to the latest in 3D accelerated first-person shooters.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-24","episode_number":14,"episode_type":"standard","id":240483,"name":"The Crash","overview":"In the early 80's video games were still a young medium, but they were responsible for billions of dollars in sales every year. Predictions were made that video games would surpass films in revenue. But in the blink of an eye, it all went terribly wrong: game companies disappeared left and right, arcades fell into decline, and the end of video games was declared. In this episode of Icons, we'll hear from the people involved to find out what went wrong--and why.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-07","episode_number":15,"episode_type":"standard","id":240485,"name":"Games In The Military","overview":"From Battlezone to Operation Flashpoint, we take a look at gaming in the Military. Find out what happens when a civilian game becomes a military training tool and get a look at how some training tools become games.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-09-25","episode_number":16,"episode_type":"standard","id":240482,"name":"Naughty Dog","overview":"In 1986 two sixteen year old friends start a company together to make money to buy games. Now, almost twenty years later, people are saving to buy their games. We'll follow the steps that took Naughty Dog from just another upstart company to one of the most respected development companies in the world.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":"/wPvqXz4a3XyzBrwgrREFgqmmvy4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-21","episode_number":17,"episode_type":"standard","id":240480,"name":"Mario Franchise","overview":"We'll follow the Italian pipe-cleaner as he climbs the ladder of success from a bit part to a global celebrity. With over twenty years of gaming experience and six of the top ten best-selling games of all time, this little plumber is a true Icon in every sense of the word.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-16","episode_number":18,"episode_type":"standard","id":240484,"name":"Onimusha","overview":"While Resident Evil was a hit series, Capcom pushed the evelope with Keiji Inafune's Onimusha series. The first game was the first million-unit seller for the PlayStation 2 and set records in both sales and production costs. Get the history behind this spectacular franchise.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-20","episode_number":19,"episode_type":"standard","id":240478,"name":"Mega Man","overview":"It's the story of the little robot that could. Mega Man creator, Keiji Inafune, looks back at the victories and hurdles his team faced with each new game.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-12-11","episode_number":20,"episode_type":"standard","id":240481,"name":"Yuji Naka","overview":"Yuji Naka began his career at Sega as a teenager. Girl's Garden, F-16 Fighting Falcon and Phantasy Star earned him critical praise and fan appreciation. But it was the introduction of Sonic the Hedgehog in 1991 for the Genesis that solidified his place as one of the most creative forces in the game industry. Sonic competed head-to-head with Nintendo's Mario for nearly a decade until the failure of Sega's last hardware system, the Dreamcast in 2001. Now, Mr. Naka brings his memorable characters to all platforms. In 2002, he was awarded with the prestigious Lifetime Achievement Award by his peers at the 2nd Annual Game Developers Conference.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":"/h0l5N1quA98Hthh05I0es3z5b1X.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-01","episode_number":21,"episode_type":"standard","id":240479,"name":"Final Fantasy","overview":"From the first Final Fantasy to X-2 and beyond, get the story behind one of the most successful and longest running franchises in gaming history. With interviews from the likes of Hironobu Sakaguchi, Tetsuya Nomura, and Nobuo Uematsu, find out about Final Fantasy's rise from its humble beginnings to its stratospheric heights.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-01-29","episode_number":22,"episode_type":"finale","id":240486,"name":"Dungeons and Dragons","overview":"Dungeons and Dragons is a fantasy world that invites players to create their own characters and adventures. By the 1980's, this new world translated seamlessly into video games with the release of games like Ultima and Bard's Tale which borrow heavily from the D&D world. However, the series is not without its criticism; parents and conservative groups denounced the games as \"dangerous\" to young people, though the intense public scrutiny only helps D&D find a new audience. Today, developers such as Bioware use the complex D&D rule set in their most popular games like Baldur's Gate.","production_code":"","runtime":30,"season_number":2,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":10055,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"52574e0919c29531db0cd910","air_date":"2004-02-12","episodes":[{"air_date":"2004-02-12","episode_number":1,"episode_type":"standard","id":240441,"name":"Music Games","overview":"Suddenly, everyone thinks they can bust a move.  In today's episode we look at the movement of Music Games. Parappa The Rapper started the fad of making a game based on music, and not the other way around.  This lead to people eventually dancing not in the streets but in the arcades with Dance Dance Revolution.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e0d19c29531db0cdbbf","order":501,"adult":false,"gender":2,"id":216090,"known_for_department":"Acting","name":"Tommy Tallarico","original_name":"Tommy Tallarico","popularity":0.716,"profile_path":"/glE1DCBvv6FJ75f0CziuMnN2aen.jpg"}]},{"air_date":"2004-03-11","episode_number":2,"episode_type":"standard","id":240442,"name":"Sega Dreamcast","overview":"We explore the rocky history of Sega's last venture into the console market. Hear from Sega insiders Bernard Stolar and Kathy Schoback about the Dreamcast's last days of life and how Sega made the leap from console maker to one of the top software publishers of today.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":"/qK2p7YCZ7ePr9GqtIqRgmWd9vVM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-25","episode_number":3,"episode_type":"standard","id":240445,"name":"ESRB","overview":"In 1992, games like Mortal Kombat and Night Trap pushed the envelope when it came to advancing graphic and technical capabilities... and catching the attention of the federal government. Washington officials cited these two games as the most offending examples of violence and questionable material available to youngsters at the time via electronic games. As a result, Senators Joe Lieberman and Herb Kohl called on game industry officals to come up with a ratings system for all games. The industry responded with the creation of the Entertainment Software Ratings Board. Since its inception in 1994, the ESRB has been widely praised by Washington - and Senator Lieberman - as the most comprehensive ratings system amongst all entertainment mediums.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-08","episode_number":4,"episode_type":"standard","id":240449,"name":"Peter Molyneux","overview":"Peter Molyneux's first game, Populous, helped create an entire new genre, god games - and it has been copied several times since. With games like Theme Park, Magic Carpet, Dungeon Keeper, BC and the highly anticipated Fable and The Movies, Molyneux continues to push the envelope and create truly immersive experiences for gamers.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-22","episode_number":5,"episode_type":"standard","id":240448,"name":"Tetris","overview":"Was it the challenge?  Was it because it was easy?  Was it the colorful blocks?  Or was it that distinctive music? What ever it was, Alexey Pajitnov's creation has a firm place in the history of gaming, as well as in the history of legal issues.  Today's episode takes on the complicated history of Tetris.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-05-06","episode_number":6,"episode_type":"standard","id":240444,"name":"Electronic Arts","overview":"Hear how Electronic Arts grew from a small PC publisher to one of the largest game publishers in history. EA has innovated and driven the industry forward since 1982. We sit down with company founder Trip Hawkins, current Executive Vice President Bing Gordon and others to find out how they got to the top.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":"/qMjrkoAkeEKRVTC4TYG5TpJkPqN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-06-10","episode_number":7,"episode_type":"standard","id":240446,"name":"Game Boy","overview":"For 15 years, it has been the dominate console in the videogame hand-held market.  Icons follows the creation of the Nintendo Game Boy; from it's formulation from Gunpei Yoko to it's current place as the best-selling hand-held system.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":"/3rf7vSdzj8K380HzU7A5Tqsc6mc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-06-24","episode_number":8,"episode_type":"standard","id":240443,"name":"Donkey Kong","overview":"It started with a flop. But a young visionary turned failure into success, and created a legendary character. He fought back legal battles and obscurity to become a pillar of gaming history. This is the tale of the one and only Donkey Kong.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":"/32ng7voQq1UbqEYSn4QxWGdsTvf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-08","episode_number":9,"episode_type":"standard","id":240447,"name":"Nobuo Uematsu","overview":"Learn how Nobuo Uematsu went from playing keyboard in a band to joining Square in 1985. Join us as Nobuo himself tells us about his musical influences in creating the soundtrack for the beloved Final Fantasy series and find out how he has propelled himself into mainstream music today.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e0d19c29531db0cdbbf","order":501,"adult":false,"gender":2,"id":216090,"known_for_department":"Acting","name":"Tommy Tallarico","original_name":"Tommy Tallarico","popularity":0.716,"profile_path":"/glE1DCBvv6FJ75f0CziuMnN2aen.jpg"}]},{"air_date":"2004-07-22","episode_number":10,"episode_type":"standard","id":240458,"name":"DOOM","overview":"No longer content with safe simple games like Mario, Zelda and Atari games from yesteryear, gamers have evolved to the next level - it includes more action and fighting demons. Icons takes a look back at the history of the Doom franchise and how it helped evolve the First Person Shooter.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-05","episode_number":11,"episode_type":"standard","id":240453,"name":"Dead or Alive","overview":"Mortal Kombat may have reinvented the fighting game, but it did so by promoting bloody violence.  The Dead or Alive series, while still slightly violent, concentrated on better game-play, detailed backstories and had more woman characters to try and add the female gamer demographic.  Tomonobu Itagaki gives Icons the history of his DOA games and a hint to what he has planned for the future.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-19","episode_number":12,"episode_type":"standard","id":240450,"name":"SNK","overview":"From it's first game in 1978 Ozma Wars to the soon to be released SVC Chaos: SNK vs. Capcom, SNK has battled against Capcom, lived through a takeover, finally gave in to bankruptcy and returned to publishing titles.  Now that SNK has returned, they are giving it's fans sequels of their favorite older games as well as a few other suprises.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-02","episode_number":13,"episode_type":"standard","id":240455,"name":"Mortal Kombat","overview":"No other game can claim that it created such controversy that it lead to the creation of a ratings board. Icons looks at the beginnings and future of the Mortal Kombat series and takes a look at how one game changed the gaming industry forever by adding just a little blood to the genre.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-30","episode_number":14,"episode_type":"standard","id":240460,"name":"Prince of Persia","overview":"Prince of Persia has a long history in the gaming industry, mostly due to it's creator putting it aside on occasion to also work with his other interest in creating films.  It revolutionized the adventure game genre by incorporating real world physics and a time limit to games. We look at Persia's beginning on the Apple II and it's eventual return to the gaming industry for Prince of Persia: The Sands of Time. Today, Icons looks at the life of Jordan Mechner, the mind behind the Prince of Persia series.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-14","episode_number":15,"episode_type":"standard","id":240461,"name":"Mark Cuban","overview":"Mark Cuban wasn't given his money, he earned it.  \"Icons\" looks at his humble beginning, to his creating then selling of Broadcast.com which ultimately lead to his purchasing of the Dallas Mavericks NBA team.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-28","episode_number":16,"episode_type":"standard","id":240456,"name":"Metal Gear Solid","overview":"Metal Gear Solid creator Hideo Kojima and character designer Yoji Shinkawa take Icons on an exculsive look at the history of the series that defined the stealth genre.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-16","episode_number":17,"episode_type":"standard","id":240459,"name":"Half-Life","overview":"In celebration of today's release of Half-Life 2, Icons looks at the history of the title.  Half-Life changed gaming in that the main character wasn't a soldier or the stereotypical hero, it was a common scientist that just happened to be at the wrong place at the wrong time.  This episode looks back at the original game and follows the development of the sequel. And you'll see why Half-Life 2 is \"the most important game you'll ever play.\"","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-12-09","episode_number":18,"episode_type":"standard","id":240457,"name":"Bungie","overview":"Bungie Studios' name is less familiar than the titles it produces.  When a game sells 2.5 million copies on it's release date, you would think more people would know the company name.  This episode looks at the history of Bungie Studios and it's most successful game series to be released, Halo.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-06","episode_number":19,"episode_type":"standard","id":240452,"name":"Apple II","overview":"Steve Jobs and Steve Wozniak were men with a vision.  Icons retraces their steps to find the stories behind the creation of a company and the marketing of a small computer that would take a bite out of the competition.","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-20","episode_number":20,"episode_type":"finale","id":240462,"name":"Fighting Games","overview":"It's the genre that created the ESRB.  Simple games like Karate Champ and Yie Ar Kung-Fu suddenly gave way to the more detailed and more violent Street Fighter and Mortal Kombat. And despite the controversy, the games continue to sell.  Join Icons as we look back at the history of the \"Fighting Game.\"","production_code":"","runtime":30,"season_number":3,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":10054,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"52574e0919c29531db0cd902","air_date":"2005-02-03","episodes":[{"air_date":"2005-02-03","episode_number":1,"episode_type":"standard","id":240421,"name":"Gran Turismo","overview":"There's no question that racing is one of the oldest and well-loved genres in the game industry, but there is one series out there that truly stands apart from the crowd in the minds of auto enthusiasts and casual gamers alike, and it is Gran Turismo. Named after the European endurance races of legend such as 24 heures du Mans and Targa Florio, Gran Turismo has dominated the racing game genre since the debut of its first game in 1998. However, the inspiration behind this game had its start long before Polyphony Digital's famous racing simulator ever hit the Sony Playstation.\n\nRacing games have been around since the very beginning of the arcade era, when casual gamers flocked to arcades to experience the thrill of playing Pole Position using a real wheel. Later on, arcades and home consoles began to carry more sophisticated racing titles such as Ridge Racer and Need for Speed, but Polys Entertainment designer Kazunori Yamauchi had dreams of creating a different kind of racing game. Yamauchi envisioned creating a game where players would drive licensed cars and win money to modify these cars as if they were the real thing; combined with realistic graphics and challenging gameplay, the game sounded like a sure bet, but his supervisors thought otherwise. Instead, Yamauchi's first game was Motor Toon Grand Prix, a game using Tex Avery-style characters that drive racing cars. However, Yamauchi used his experience designing this game to appeal to his supervisors to allow him to make Gran Turismo. \n\nYamauchi was finally granted permission to begin work on his dream game in the early 1990s and began to seek licensed cars to use in the game.  He felt that having real cars increased the appeal of the game tenfold over using generic cars, but using real cars meant that they had to handle just like the real thing. Thus, the team at what was called from then on Polyphony Digital began research for the game, taking thousands of photographs of each of the hundreds of vehicles that would be in the game and test driving them as well. When Gran Turismo was released in December 1997, it included 150 real-life cars that gamers could drive by winning races within the game. By 1999, the game had sold 6 million copies and the team prepared for a sequel.\n\nGran Turismo 2 came out in 1999, roughly 2 years after the debut of the first game. However,  upon its release it became apparent that the team had hurried through the game--though it was still beautiful, it contained many playability flaws that irked hardcore fans. But regardless of the criticism, GT2 sold 1 million copies in only six weeks. Though a sequel was initially promised for the launch of the Playstation 2, Polyphony Digital decided to learn from their mistakes and take the time to make sure that everything was going right with the next installment of the series. Plus, they had to adjust to the next-generation hardware and the capabilities it contained as well.\n\nGran Turismo 3 became the biggest-selling PS2 game of its time when it was released in April 2001, with fans marveling at its intensely realistic graphics and superb gameplay. Soon, automakers as well began to realize the value of having their cars appear in the game, and special concept versions of the game were produced for certain lines of automobiles.\n\nWork began immediately on Gran Turismo 4, but the number of expectations put on the developers added to delays on the project, which ultimately cost the game online play. However, Yamauchi worries not--he prefers that people think of his game as an encyclopedia of cars. Indeed, with over six hundred models included in the game, one has the opportunity to unlock and drive more automobiles in the game than most people will drive in their entire lives.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-31","episode_number":3,"episode_type":"standard","id":240422,"name":"Frank Miller","overview":"Fans of Frank Miller's Sin City have been for years bedazzled by the comics' bold, hard-boiled look and the gritty tales told within, but many folks are just now coming to see the mastery of Miller's work through the film version of the comic. Miller spent years working on Sin City independently, but creating comic books wasn't always so easy.\n\nGrowing up in Vermont, Frank Miller started drawing comics at home at the age of six, using typing paper stapled together to make comic books following a fascination with Batman. Though he'd eventually become a comic book legend, when he traveled to New York to try to break into the comic industry, there were many hurdles he'd face before getting his first real job with a pencil. While working menial and sometimes dangerous jobs, Miller polished his skills under the tutelage of Neil Adams; after being told repeatedly that his work was terrible, Adams found him a job drawing Twilight Zone comics, and his career took off.\n\nAfter a slow start, Miller found himself drawing Spectacular Spider-Man, which eventually landed him a job drawing Daredevil for Marvel. In 1979, Miller became the principal artist for the series, eventually taking over writing duties as well and transforming the series. With the creation of Daredevil's love and enemy Elektra, Miller reinvented the series as his own.\n\nIn 1983, Frank Miller left Marvel and created Ronin for DC Comics, which was regarded as strange at the time due to its sci-fi, anime-esque influence. Following Ronin, Miller agreed to work on a project that he'd been both anxious and hesitant about for a long time--Batman. However, instead of continuing along the path of the obvious, Miller opted to tell a different tale of Batman, one that set Batman past middle age instead of his eternal age of 29. The Dark Knight Returns was a solid hit and established Miller not merely as a comic book artist, but as an icon.\n\nFollowing the success of Dark Knight Returns, Miller decided it was time for a change of pace and moved out to California. While there, he found work writing the sequels to Robocop, but found himself dissatisfied with the Hollywood process. After firmly extracting himself from the film industry, Miller decided it was time to work on a project he truly loved--Sin City.\n\nAfter the publication of Sin City by Dark Horse Comics, Miller received many offers from filmmakers to do a film version of his masterpiece, but he always declined, fearing the disappointment of an adaptation that didn't live up to his expectations. It was not until Robert Rodriguez (El Mariachi, Once Upon a Time in Mexico) approached the artist with an offer to create an amazingly faithful version of Sin City that Miller even considered allowing the project. However, once Miller laid his eyes on Rodriguez' demo that reproduced the graphic novel frame-by-frame, he was sold. Despite his reluctance to allow the film to be made at all, Frank Miller learned to trust the film industry again by working with the best.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e0a19c29531db0cd974","order":505,"adult":false,"gender":2,"id":7624,"known_for_department":"Writing","name":"Stan Lee","original_name":"Stan Lee","popularity":18.697,"profile_path":"/kKeyWoFtTqOPsbmwylNHmuB3En9.jpg"},{"character":"","credit_id":"52574e0a19c29531db0cd992","order":514,"adult":false,"gender":2,"id":1121,"known_for_department":"Acting","name":"Benicio del Toro","original_name":"Benicio del Toro","popularity":17.419,"profile_path":"/s1EVFX10YJZTcvkAAq4AcPniS3t.jpg"},{"character":"","credit_id":"52574e0a19c29531db0cd9b0","order":523,"adult":false,"gender":2,"id":2296,"known_for_department":"Acting","name":"Clive Owen","original_name":"Clive Owen","popularity":32.288,"profile_path":"/ed0LT4wH1rUCviCFexd4XPZVHE1.jpg"},{"character":"","credit_id":"52574e0a19c29531db0cd9ce","order":526,"adult":false,"gender":1,"id":56731,"known_for_department":"Acting","name":"Jessica Alba","original_name":"Jessica Alba","popularity":31.552,"profile_path":"/ld1G4iXeMxLgL2m28VihjpAECnk.jpg"},{"character":"","credit_id":"52574e0a19c29531db0cd9ec","order":530,"adult":false,"gender":2,"id":2293,"known_for_department":"Writing","name":"Frank Miller","original_name":"Frank Miller","popularity":5.501,"profile_path":"/2eqqLG9Sv4i1ZlM14wY2LTTEbld.jpg"},{"character":"","credit_id":"52574e0a19c29531db0cda0a","order":534,"adult":false,"gender":1,"id":328,"known_for_department":"Acting","name":"Brittany Murphy","original_name":"Brittany Murphy","popularity":29.11,"profile_path":"/uLOrqcSk2h5o3ekNfcuGFDzN13W.jpg"}]},{"air_date":"2005-04-28","episode_number":4,"episode_type":"standard","id":240420,"name":"Tim Schafer","overview":"Though he's been an influential force in games for over a decade, Tim Schafer hasn't been heard from much in recent years because he's been hard at work forming his own company and working hard on Psychonauts for the past three years. However, Schafer didn't start out at the top but rather worked his way up at LucasArts on projects such as Secret of Monkey Island, Day of the Tentacle, Full Throttle and Grim Fandango. In 2000, Schafer left LucasArts and founded Double Fine Productions in San Francisco along with many members of the Grim Fandango team as well as many new faces.\n\nIn a first for Icons, watch the staff at Double Fine Productions as they frantically rush to put the finishing touches on Psychonauts during the last week of production and get a firsthand glimpse of what working in a top-notch game studio is really like.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-05-12","episode_number":5,"episode_type":"standard","id":240423,"name":"Star Wars Games","overview":"Following the debut of the first Star Wars film in the late 1970's, Star Wars games have become an almost natural extension of the series' plot and experience, feeding the frenzy of fans thirsting for more. Starting with the first arcade game in 1983, fans went nuts for anything based on the series, spawning the first rush of Star Wars games to the home console market. However, it was not until 1991 that LucasFilm Games (now LucasArts) produced their own game based off their most famous series for the Nintendo Entertainment System. They would go on to produce a number of hits including X-Wing, TIE Fighter and Dark Forces II: Jedi Knight, though working with their proprietary content did not guarantee them a good game, as proven by such flops as Masters of Teras Kasi and Star Wars: Rebellion. However, the release of the new Star Wars Trilogy beginning in 1999 would prove to inject new life into the series of games including Jedi Academy, Knights of the Old Republic and the series' first MMO, Star Wars Galaxies.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-06-09","episode_number":6,"episode_type":"standard","id":240424,"name":"Ralph Baer","overview":"Contrary to what you might have been led to believe by fanboys, the father of video gaming is not Shigeru Miyamoto, Will Wright, or even Nolan Bushnell. And it certainly isn't Bill Gates.\n\nWhat you may not know is that the technology that enabled the creation of video games was patented by engineer Ralph Baer in 1968, four years before Pong was ever introduced to gamers worldwide. However, Baer had developed the concept much, much earlier.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-08","episode_number":7,"episode_type":"standard","id":240425,"name":"PlayStation","overview":"Icons digs deep to get the real history of the Sony PlayStation, starting with its beginnings as a parts-maker for Nintendo consoles and the development of a CD-based game for Nintendo. After Sony was double-crossed by Nintendo when they decided to drop Sony for Philips, Ken Kutaragi fought to develop the technology as a 3D game console despite Sony's reputation as a consumer electronics company. However, the company was able to gather the support of Japan's top game developers and publishers and push the PlayStation to the top of the sales charts and changed the way the world saw video games.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-31","episode_number":8,"episode_type":"standard","id":240426,"name":"George A. Romero","overview":"George A. Romero was a pivotal figure in the development horror films with his first feature, \"Night of the Living Dead\" in 1968. We talk with this independent filmmaker about his career and take a look at some of his most memorable work.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e0b19c29531db0cda6c","order":509,"adult":false,"gender":2,"id":14999,"known_for_department":"Writing","name":"George A. Romero","original_name":"George A. Romero","popularity":2.807,"profile_path":"/w2zVF92x149qK79ZxwUowcSp2c6.jpg"},{"character":"","credit_id":"52574e0b19c29531db0cda8a","order":515,"adult":false,"gender":2,"id":11108,"known_for_department":"Acting","name":"Simon Pegg","original_name":"Simon Pegg","popularity":20.953,"profile_path":"/nOWKXxgADG98RjKyfQ7oSDfns6J.jpg"},{"character":"","credit_id":"57ebaddec3a36836f1004350","order":539,"adult":false,"gender":2,"id":1179326,"known_for_department":"Acting","name":"Chris Gore","original_name":"Chris Gore","popularity":1.114,"profile_path":null}]},{"air_date":"2005-12-01","episode_number":9,"episode_type":"standard","id":240437,"name":"NES","overview":"What goes into creating a next generation console? We'll go behind the scenes and talk with the production team of this exciting new project. Microsoft staffers and first-party developers add their insights on the challenges and expectations regarding Xbox 360--one of the most highly-anticipated launches in games.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-12-04","episode_number":10,"episode_type":"standard","id":240438,"name":"Xbox 360","overview":"Icons delves deep into the history of the NES, the console that changed the world.\n\nFrom its beginning in Japan over 150 years ago, through the boom years of the 1980s and 1990s to its present place as one of the most recognizable names in gaming, Nintendo has always been about innovation and visionary gameplay, but nothing they've created was more visionary than the Nintendo Entertainment System.\n\nWhile gamers know the NES as pure fun, the story behind the game is pure drama, from the incredibly risky launch of the NES in America to Nintendo's sometimes contentious relationship with game developers. Videogame luminaries featured include Don James, the Executive Vice President of Operations for Nintendo of America and legendary game designer (and creator of Mario) Shigeru Miyamoto.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-12-12","episode_number":11,"episode_type":"finale","id":240440,"name":"King Kong","overview":"We look back at the cinematic fascination with this monster ape and talk with director Peter Jackson, the artistic genius behind the latest remake of this classic film.","production_code":"","runtime":30,"season_number":4,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e0c19c29531db0cdafc","order":508,"adult":false,"gender":2,"id":108,"known_for_department":"Directing","name":"Peter Jackson","original_name":"Peter Jackson","popularity":27.914,"profile_path":"/bNc908d59Ba8VDNr4eCcm4G1cR.jpg"},{"character":"","credit_id":"52574e0c19c29531db0cdb1a","order":516,"adult":false,"gender":2,"id":1333,"known_for_department":"Acting","name":"Andy Serkis","original_name":"Andy Serkis","popularity":35.9,"profile_path":"/eNGqhebQ4cDssjVeNFrKtUvweV5.jpg"},{"character":"","credit_id":"52574e0c19c29531db0cdb38","order":524,"adult":false,"gender":2,"id":3490,"known_for_department":"Acting","name":"Adrien Brody","original_name":"Adrien Brody","popularity":32.539,"profile_path":"/1dBItgLFBNGEXnI48VvnnN2vFaX.jpg"},{"character":"","credit_id":"52574e0c19c29531db0cdb56","order":528,"adult":false,"gender":2,"id":70851,"known_for_department":"Acting","name":"Jack Black","original_name":"Jack Black","popularity":46.522,"profile_path":"/rtCx0fiYxJVhzXXdwZE2XRTfIKE.jpg"},{"character":"","credit_id":"52574e0d19c29531db0cdb74","order":532,"adult":false,"gender":1,"id":3489,"known_for_department":"Acting","name":"Naomi Watts","original_name":"Naomi Watts","popularity":30.908,"profile_path":"/k6l8BWX1yqfGt95enzEkHoPvON4.jpg"}]}],"name":"Season 4","overview":"","id":10053,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"52574e0a19c29531db0cd93a","air_date":"2006-06-03","episodes":[{"air_date":"2006-06-03","episode_number":1,"episode_type":"standard","id":240505,"name":"J.J. Abrams","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e1219c29531db0ce08d","order":502,"adult":false,"gender":2,"id":15344,"known_for_department":"Directing","name":"J.J. Abrams","original_name":"J.J. Abrams","popularity":9.902,"profile_path":"/k4IWd2RV5kY1kAL2VgKQwFvnCLP.jpg"},{"character":"","credit_id":"52574e1219c29531db0ce0ab","order":511,"adult":false,"gender":2,"id":1233,"known_for_department":"Acting","name":"Philip Seymour Hoffman","original_name":"Philip Seymour Hoffman","popularity":23.351,"profile_path":"/50rqDkmvXwjwVhFH7q6ph2Rkw7S.jpg"},{"character":"","credit_id":"52574e1219c29531db0ce0c9","order":518,"adult":false,"gender":2,"id":17305,"known_for_department":"Acting","name":"Greg Grunberg","original_name":"Greg Grunberg","popularity":8.446,"profile_path":"/ir2QunLf6aTaowpEygbIcjiZLDB.jpg"},{"character":"","credit_id":"52574e1219c29531db0ce0e7","order":525,"adult":false,"gender":2,"id":10182,"known_for_department":"Acting","name":"Ving Rhames","original_name":"Ving Rhames","popularity":30.528,"profile_path":"/ohAOsD8E4tu35PI2buzZORpn9Ef.jpg"},{"character":"","credit_id":"52574e1219c29531db0ce105","order":529,"adult":false,"gender":1,"id":9278,"known_for_department":"Acting","name":"Jennifer Garner","original_name":"Jennifer Garner","popularity":23.038,"profile_path":"/ftymEXqdTnXfaI6dGd9qrJoFOSE.jpg"}]},{"air_date":"2006-06-10","episode_number":2,"episode_type":"standard","id":240515,"name":"Suicide Girls","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-06-17","episode_number":3,"episode_type":"standard","id":240516,"name":"Marc Ecko","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-06-24","episode_number":4,"episode_type":"standard","id":240517,"name":"Michelle Rodriguez","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e0a19c29531db0cd974","order":505,"adult":false,"gender":2,"id":7624,"known_for_department":"Writing","name":"Stan Lee","original_name":"Stan Lee","popularity":18.697,"profile_path":"/kKeyWoFtTqOPsbmwylNHmuB3En9.jpg"},{"character":"","credit_id":"52574e1319c29531db0ce15c","order":512,"adult":false,"gender":1,"id":7517,"known_for_department":"Acting","name":"Kate Bosworth","original_name":"Kate Bosworth","popularity":48.63,"profile_path":"/egbJ47dPYvcWrr4NLmVBhDuirhl.jpg"},{"character":"","credit_id":"52574e1319c29531db0ce17a","order":520,"adult":false,"gender":1,"id":17647,"known_for_department":"Acting","name":"Michelle Rodriguez","original_name":"Michelle Rodriguez","popularity":24.98,"profile_path":"/xSvkVrLz6xas1mCeOR9i4QtmhnQ.jpg"}]},{"air_date":"2006-07-01","episode_number":5,"episode_type":"standard","id":240518,"name":"Suicide Girls: Uncut","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-07-15","episode_number":6,"episode_type":"standard","id":240519,"name":"Kevin Smith","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e0a19c29531db0cd974","order":505,"adult":false,"gender":2,"id":7624,"known_for_department":"Writing","name":"Stan Lee","original_name":"Stan Lee","popularity":18.697,"profile_path":"/kKeyWoFtTqOPsbmwylNHmuB3En9.jpg"},{"character":"","credit_id":"52574e1319c29531db0ce1c0","order":510,"adult":false,"gender":2,"id":59839,"known_for_department":"Production","name":"Harvey Weinstein","original_name":"Harvey Weinstein","popularity":5.263,"profile_path":"/yUeo7hPc6fdHB2vy2zkGqg3bJyv.jpg"},{"character":"","credit_id":"52574e1319c29531db0ce1de","order":519,"adult":false,"gender":1,"id":23658,"known_for_department":"Acting","name":"Jennifer Schwalbach Smith","original_name":"Jennifer Schwalbach Smith","popularity":6.281,"profile_path":"/obaf42TXZQqAdidfQ8wnu1lJuNs.jpg"},{"character":"","credit_id":"52574e1319c29531db0ce1fc","order":527,"adult":false,"gender":2,"id":23630,"known_for_department":"Acting","name":"Jeff Anderson","original_name":"Jeff Anderson","popularity":6.346,"profile_path":"/edwQlYwAWWHQC9um89c5CQpFYof.jpg"},{"character":"","credit_id":"52574e1319c29531db0ce21a","order":531,"adult":false,"gender":2,"id":19302,"known_for_department":"Acting","name":"Jason Mewes","original_name":"Jason Mewes","popularity":7.025,"profile_path":"/pZAmLSlIUhRUGrztm5i2AuNQV2o.jpg"},{"character":"","credit_id":"52574e1319c29531db0ce238","order":533,"adult":false,"gender":2,"id":19303,"known_for_department":"Directing","name":"Kevin Smith","original_name":"Kevin Smith","popularity":18.27,"profile_path":"/uxDQ0NTZMnOuAaPa0tQzMFV9dx4.jpg"},{"character":"","credit_id":"52574e1319c29531db0ce256","order":535,"adult":false,"gender":2,"id":11662,"known_for_department":"Acting","name":"Jason Lee","original_name":"Jason Lee","popularity":24.013,"profile_path":"/3VLXHK2OVUzYkEVZliiaxT9lX0J.jpg"},{"character":"","credit_id":"52574e1319c29531db0ce274","order":536,"adult":false,"gender":1,"id":5916,"known_for_department":"Acting","name":"Rosario Dawson","original_name":"Rosario Dawson","popularity":62.539,"profile_path":"/1mm7JGHIUX3GRRGXEV9QCzsI0ao.jpg"},{"character":"","credit_id":"52574e1519c29531db0ce2b3","order":537,"adult":false,"gender":2,"id":23629,"known_for_department":"Acting","name":"Brian O'Halloran","original_name":"Brian O'Halloran","popularity":5.789,"profile_path":"/c8bhTxVxhN4DMrJeCnu5usutbY5.jpg"},{"character":"","credit_id":"56c0ca0792514108d300036b","order":538,"adult":false,"gender":2,"id":572591,"known_for_department":"Acting","name":"Bryan Johnson","original_name":"Bryan Johnson","popularity":1.761,"profile_path":"/7j2EZoDnLzIzDLowTz1pa2M5kA6.jpg"}]},{"air_date":"2006-07-22","episode_number":7,"episode_type":"standard","id":240539,"name":"Jamie Kennedy","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e1519c29531db0ce2e2","order":503,"adult":false,"gender":2,"id":6213,"known_for_department":"Acting","name":"Jamie Kennedy","original_name":"Jamie Kennedy","popularity":17.274,"profile_path":"/shm7XMZF9bfliTDahcjqplhMkMD.jpg"}]},{"air_date":"2006-08-12","episode_number":8,"episode_type":"standard","id":240543,"name":"Shepard Fairey","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e1519c29531db0ce311","order":506,"adult":false,"gender":2,"id":9290,"known_for_department":"Acting","name":"Henry Rollins","original_name":"Henry Rollins","popularity":11.849,"profile_path":"/2E0cZdoJsdt1Lv4waG3s6fsfJeU.jpg"}]},{"air_date":"2006-08-19","episode_number":9,"episode_type":"standard","id":240546,"name":"Seth Green","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e1519c29531db0ce340","order":504,"adult":false,"gender":2,"id":26457,"known_for_department":"Acting","name":"Matthew Lillard","original_name":"Matthew Lillard","popularity":38.836,"profile_path":"/auUbijDzR9xpSgQtLsYDvNatloj.jpg"},{"character":"","credit_id":"52574e1519c29531db0ce35e","order":513,"adult":false,"gender":2,"id":13922,"known_for_department":"Acting","name":"Seth Green","original_name":"Seth Green","popularity":27.366,"profile_path":"/l4No5Eu6j0U80hCIkaSn17AOWrj.jpg"},{"character":"","credit_id":"52574e1519c29531db0ce37c","order":521,"adult":false,"gender":1,"id":38581,"known_for_department":"Acting","name":"Rachael Leigh Cook","original_name":"Rachael Leigh Cook","popularity":18.509,"profile_path":"/t74jUJZSgKrXgtvZmK1QVhWYZD6.jpg"}]},{"air_date":"2006-08-26","episode_number":10,"episode_type":"standard","id":240553,"name":"Lollapalooza","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e1519c29531db0ce311","order":506,"adult":false,"gender":2,"id":9290,"known_for_department":"Acting","name":"Henry Rollins","original_name":"Henry Rollins","popularity":11.849,"profile_path":"/2E0cZdoJsdt1Lv4waG3s6fsfJeU.jpg"},{"character":"","credit_id":"52574e1519c29531db0ce3b1","order":517,"adult":false,"gender":2,"id":102979,"known_for_department":"Acting","name":"Perry Farrell","original_name":"Perry Farrell","popularity":1.203,"profile_path":"/r5lKZr814Ow7m2HSBoxSbMKYjSP.jpg"},{"character":"","credit_id":"52574e1519c29531db0ce3cf","order":522,"adult":false,"gender":2,"id":21411,"known_for_department":"Acting","name":"Ice-T","original_name":"Ice-T","popularity":11.346,"profile_path":"/iqyAw0iTgESyykWIUtMP0CoP88J.jpg"}]},{"air_date":"2006-09-02","episode_number":11,"episode_type":"standard","id":240555,"name":"The Onion","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-09-24","episode_number":12,"episode_type":"standard","id":240556,"name":"British Music","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-03","episode_number":13,"episode_type":"standard","id":240557,"name":"Sacha Baron Cohen","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e1619c29531db0ce420","order":507,"adult":false,"gender":2,"id":6730,"known_for_department":"Acting","name":"Sacha Baron Cohen","original_name":"Sacha Baron Cohen","popularity":12.469,"profile_path":"/8J2LxfW3owPTc9OzbBoUbADFOBb.jpg"}]},{"air_date":"2006-12-10","episode_number":14,"episode_type":"standard","id":240558,"name":"Tom \"Tsquared\" Taylor","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-17","episode_number":15,"episode_type":"standard","id":240559,"name":"Chuck \"The Ice Man\" Liddell","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-24","episode_number":16,"episode_type":"standard","id":240560,"name":"Tony \"Mad Dog\" Alva","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-03-04","episode_number":17,"episode_type":"standard","id":240561,"name":"Frank Miller","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e0a19c29531db0cd974","order":505,"adult":false,"gender":2,"id":7624,"known_for_department":"Writing","name":"Stan Lee","original_name":"Stan Lee","popularity":18.697,"profile_path":"/kKeyWoFtTqOPsbmwylNHmuB3En9.jpg"},{"character":"","credit_id":"52574e0a19c29531db0cd9ce","order":526,"adult":false,"gender":1,"id":56731,"known_for_department":"Acting","name":"Jessica Alba","original_name":"Jessica Alba","popularity":31.552,"profile_path":"/ld1G4iXeMxLgL2m28VihjpAECnk.jpg"},{"character":"","credit_id":"52574e0a19c29531db0cd9ec","order":530,"adult":false,"gender":2,"id":2293,"known_for_department":"Writing","name":"Frank Miller","original_name":"Frank Miller","popularity":5.501,"profile_path":"/2eqqLG9Sv4i1ZlM14wY2LTTEbld.jpg"}]},{"air_date":"2007-06-03","episode_number":18,"episode_type":"finale","id":240562,"name":"Eli Roth","overview":"","production_code":"","runtime":30,"season_number":5,"show_id":3208,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52574e1619c29531db0ce4a5","order":500,"adult":false,"gender":2,"id":16847,"known_for_department":"Directing","name":"Eli Roth","original_name":"Eli Roth","popularity":21.098,"profile_path":"/qQTkpxzh1FlBGL1HD5hzdUMxv49.jpg"}]}],"name":"Season 5","overview":"","id":10057,"poster_path":null,"season_number":5,"vote_average":0}}}