{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"2011-06-16","genres":[{"id":16,"name":"Animation"}],"homepage":"https://www.kickstartent.com/voltron-force","id":32296,"in_production":false,"languages":["en"],"last_air_date":"2012-04-25","last_episode_to_air":{"id":765015,"name":"Black","overview":"","vote_average":0,"vote_count":0,"air_date":"2012-04-25","episode_number":26,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null},"name":"Voltron Force","next_episode_to_air":null,"networks":[{"id":224,"logo_path":"/xlUUkgMevNvnKXcZ5z7F6R2CaGw.png","name":"Nicktoons","origin_country":"US"}],"number_of_episodes":26,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Voltron Force","overview":"The adventures of a new class of recruits as they get a once-in-a-lifetime chance to train alongside their heroes—original team members Keith, Lance, Hunk, Pidge and Allura—and learn to fly incredible robot lions. Bonds will be formed and friendships will be tested as the Voltron Force gels together as a team in an epic battle of good versus evil.","popularity":5.666,"poster_path":"/pOQ5bfYIEm9Po0KYksPBhVt5tHe.jpg","production_companies":[{"id":74319,"logo_path":null,"name":"World Events Productions","origin_country":"US"},{"id":37382,"logo_path":"/8GoaFY2GaoRhDYUUqulZx8CCrhV.png","name":"Classic Media","origin_country":"US"},{"id":2526,"logo_path":"/kzIW6QWhacDwzGoXEIWhac8rb70.png","name":"Kickstart","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2011-06-16","episode_count":26,"id":43661,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":null,"episode_count":0,"id":43662,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.875,"vote_count":8,"season_data":{"1":{"_id":"5258a2fd760ee3466166e0a1","air_date":"2011-06-16","episodes":[{"air_date":"2011-06-16","episode_number":1,"episode_type":"standard","id":764990,"name":"New School Defenders","overview":"After Voltron's victory over Lotor and his army, the Robot Lions lost control during a celebratory event and nearly destroyed a city. Because of this, Galaxy Alliance commander Sky Marshall Wade ordered the Lions to be dismissed from their duty as defenders of the universe and disbanded the Voltron Force. Since that day only the Galaxy Alliance has been in charge of protecting the universe while Lance, Pidge, and Hunk are acting officers in the army, Princess Allura is ruling her home planet Arus, and Keith is a fugitive from the Alliance. Daniel is a mischievous and curious student in the Galaxy Alliance air school. Daniel and fellow student Vince are recruited into the Voltron Force as junior cadets and later become members of a resistance against Sky Marshall Wade, during which Keith infiltrates Wade's secret base and searches for the Black Lion. Now, as part of the resistance's plan, Daniel and Vince sneak into Wade's room and switch out his prized pin with a fake one and head back to \"The Den\", the resistance headquarters. The reason is that the 4 insignias on the pin are actually the keys to reactivate the Lions. Meanwhile, Keith discovers his Black Lion and breaks it and himself out of the base, contacting Pidge and trying to escape Wade's security.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-16","episode_number":2,"episode_type":"standard","id":764991,"name":"Defenders of Arus","overview":"Daniel and Vince meet a fellow Cadet named Larmina, who is revealed to be Princess Allura's niece and the trio are given their \"Voltcoms\", special gauntlets that access special abilities within them and will allow them in the future to pilot the Lions. As Pidge and Hunk go to rescue Keith from drifting into space (due to the fact that Wade's experiments on Black Lion have left it barely with any power), a Robeast is sent to Arus by Kala and Maahox to battle the Voltron Force. Lance and Allura realize that they must fight it without the other 3 Lions. When the fight gets too much for Lance and Allura, Daniel and the others get to the Green (Vince and Larmina) and Yellow (Daniel) Lions to help fight off the Robeast alongside Lance and Allura, but even that proves to be not enough to turn the tide. Pidge and Hunk save Keith and send him into Arus' atmosphere to crash land on the planet, accidentally decapitating the Robeast and destroying it. As Lotor watches in anger, Maahox explains how the same Robeast was from his time and the beasts are not enough to defeat the Voltron of today.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-16","episode_number":3,"episode_type":"standard","id":764992,"name":"Defenders of the Universe","overview":"After the events of Part 2, Wade goes insane and kidnaps the Alliance and replaces its soldiers with robots, while additionally holding Coran hostage. Meanwhile Lotor and Maahox plot to send a new Robeast to Arus to destroy Voltron as it is powered by a combination of Kala, the strategist that Maahox terminated at the end of Part 2 and Haggarium, the substance that Kala's energy apparently stabilized and resurrected Lotor. As the Lions fight the Kala Robeast (with Daniel piloting Red Lion along with Lance due to an injury he sustained in Part 2) and Keith and Larmina fend off Wade's robots on the ground, Wade (on another planet with Coran as his hostage) sends a massive Robot Lion to battle both Voltron and Kala. At one point the Kala Robeast literally absorbs the power of Wade's Lion (thusly severing the connection between Wade and the Lion) and forms a Mega Spider. Vince informs the team that he has completed the repairs of the Black Lion which sends Daniel back to the Castle using his \"Speed Claws\" Voltcom ability to retrieve it. Keith and Larmina board the Black Lion and upon Keith's command unite to form Voltron. During the skrimish, they learn that their attacks aren't working and all but the Black Lion are too weak to form the Blazing Sword due to being surrounded by Haggarium-laced webs. But, after a boost from Vince's Voltcom, Voltron goes to full power, forms the Blazing Sword and defeats Kala. Maahox, a scientist who seeks to revive Lotor, succeeds in bringing him back to life and explains how long he has been gone and the changes that have been made to his army.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-23","episode_number":4,"episode_type":"standard","id":764993,"name":"Coran, Coran","overview":"The Voltron Force receives a distress call from Coran, but when they try to rescue him, they fall into a trap set by Sky Marshal Wade. Meanwhile, the cadets soon learn it's a Coran imposter that's actually a robot strapped with a bomb and must face it in a fight.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-30","episode_number":5,"episode_type":"standard","id":764994,"name":"Joyride of Doom","overview":"Daniel convinces the group to borrow the Lions so he and the cadets can sneak off to go to Planet Doom, Lotor's home planet, but they soon find themselves abducted by Maahox. Meanwhile, Lotor invades the Castle of Lions and takes Allura hostage, and Voltron debuts a new ability during the rescue.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-07","episode_number":6,"episode_type":"standard","id":764995,"name":"The Hunkyard","overview":"Hunk takes the cadets on a bonding mission to his secret junkyard called The Hunkyard to learn teamwork and to build \"crush cars\" so they can have their own vehicles. However, cadet bonding day comes to a halt when an army of Waderoids powered by Haggarium attack them and form together to make a massive scrap monster out of junk.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-14","episode_number":7,"episode_type":"standard","id":764996,"name":"Lion Riders Return","overview":"The Voltron Force travels to the peaceful planet Ariel to defend a race of lion-riding warriors from Sky Marshal Wade who is extracting a powerful metal ore called corite from their mines with Haggarium tipped drills. While playing their video game, the cadets are interrupted by a mysterious ally named Daigo asking for help from an impending danger with the Krelshi, Ariel's ancient lion protectors, and travel with the rest of the team on the mission.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-21","episode_number":8,"episode_type":"standard","id":764997,"name":"Flash Forms a Go!","overview":"The Force begins noticing several large holes being formed at different locations on the planet. The team learns that whatever is creating the holes is apparently a Robeast trying to find the hidden lairs of the Lions. Lance takes the Red Lion and Daniel to investigate and nearly destroys the Lion when they encounter the assailant. When the team finally encounters the attacker, the team attempts to form Voltron but before they can complete the formation it hits them and splits them up. They try several more times and fail each time until Keith calls a retreat. Vince explains that it takes 36 seconds for the formation to complete and that the team needs to find a way to accelerate the transformation. Daniel and Vince take Red Lion out to test the theory when they encounter the creature which appears to be a giant eye. Lance is infuriated that Daniel and Vince again took a Lion for a joyride but the others chide Lance for lecturing the duo instead of thanking them. When the beast attacks again the team heads out and finally forms Voltron by having Daniel's Voltcom activate Flash Form, which skips the familiar commands and forms Voltron immediately. Voltron attacks the eye and forms the Blazing Sword to finish off the creature, but a shard of it returns to Maahox to seemingly reveal to him the Lion's location.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-28","episode_number":9,"episode_type":"standard","id":764998,"name":"Dark Blue","overview":"Vince's efforts to prove himself to the team end up with him trapped aboard a Haggarium-filled shipping vessel that's sinking in a bottomless ocean planet. But he and Voltron debuts a new ability while underwater.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-04","episode_number":10,"episode_type":"standard","id":764999,"name":"Wanted and Unwanted","overview":"Keith allows himself to get captured by robots in order to get aboard Wade's invisible prison vessel called the Void so he can break out political prisoners of the Den Resistance. However, Daniel gets caught with him and meets Keith's friend Manset who helps him survive on the inside while Wade throws Keith into the \"Black Hole\" where he encounters Chief Kalon of the Lion Riders. Daniel then has to fight Kloak, an invisible warrior who guards the Void generator so he and Keith can escape the ship and get their friends to safety.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-11","episode_number":11,"episode_type":"standard","id":765001,"name":"Predator Robeast","overview":"Voltron Force face a tough challenge when they take on a powerful newly formed enemy when Lotor's five predators unite to become one villain. Meanwhile, the cadets test out a new castle defense system for when the team goes away on a mission, but Lotor's ships enter the atomsphere with his five robeasts: a minotaur, giant fish, snake, panther, and dragon.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-18","episode_number":12,"episode_type":"standard","id":765000,"name":"Hungry for Voltron","overview":"When Princess Allura and her blue lion are caught in Sky Marshal Wade’s blockade of the Planet Ebb, they are forced to fight in his combat arena.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-25","episode_number":13,"episode_type":"standard","id":765003,"name":"Clash of the Lions","overview":"The Voltron Force travels to Earth to finish the fight with Wade once and for all, but are hijacked by Wade’s Voltron-controlling device.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-03","episode_number":14,"episode_type":"standard","id":765002,"name":"Inside the Music","overview":"After Wade’s defeat, cadet Larmina is tasked with organizing a universe victory concert unaware that Lotor’s spies have infiltrated the celebration.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-10","episode_number":15,"episode_type":"standard","id":765004,"name":"Rouge Trip","overview":"When the cadets travel to Earth for a pizza run,they encounter a dangerous Voltron-obsessed with sinister intentions.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-17","episode_number":16,"episode_type":"standard","id":765005,"name":"Brains","overview":"After Pidge's brother misses his yearly communication call, The Voltron Force go to his home planet where they find it overrun with Ninja Scientist Zombies.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-27","episode_number":17,"episode_type":"standard","id":765007,"name":"Ghost in the Lion","overview":"After the Blue Lion is stolen, the remaining lions track it to a planet which is a barely inhabitable frozen world. When they locate the stolen lion, the Voltron Force come face to face with a old friend who seems to have switched sides.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-29","episode_number":18,"episode_type":"standard","id":765006,"name":"Gary","overview":"Maahox's pet attacks the Voltron Nexus.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-07","episode_number":19,"episode_type":"standard","id":765008,"name":"Five Forged","overview":"The Voltron Force returns to Planet Ariel and must survive the challenges inside a series of mines which hold clues to the origin of Voltron.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-14","episode_number":20,"episode_type":"standard","id":765009,"name":"Dradin, Baby, Dradin","overview":"The Voltron Force heads to the planet Dradin where ex-members of Lotor's army are poised to take over.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-21","episode_number":21,"episode_type":"standard","id":765010,"name":"I, Voltron","overview":"Daniel becomes the ultimate defender when his consciousness is transferred into Voltron.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-28","episode_number":22,"episode_type":"standard","id":765011,"name":"Crossed Signals","overview":"The Voltron Force receives a distress call that may have led them back in time!","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-04","episode_number":23,"episode_type":"standard","id":765012,"name":"Roots of Evil","overview":"After engineering a seed that can grow Dark Energy, Maahox seeds Arus in hopes to harvest the energy and as a side effect destroy the Volrton's Base Planet in the process.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-11","episode_number":24,"episode_type":"standard","id":765013,"name":"The Army of One","overview":"King Lotor is replicated into an army of clones who attempt to take over Planet Arus and destroy Voltron.","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-18","episode_number":25,"episode_type":"standard","id":765014,"name":"Deceive and Conquer","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-25","episode_number":26,"episode_type":"finale","id":765015,"name":"Black","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":32296,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":43661,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5258a2fd760ee3466166e0ac","air_date":null,"episodes":[],"name":"Season 2","overview":"","id":43662,"poster_path":null,"season_number":2,"vote_average":0}}}