{
    "adult": false,
    "backdrop_path": "/gw0C7a3pMzBLR1B8tqWcbLw0SCU.jpg",
    "created_by": [],
    "episode_run_time": [
        60
    ],
    "first_air_date": "2010-02-09",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        },
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "https://www.channel4.com/programmes/one-born-every-minute",
    "id": 32873,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2017-06-20",
    "last_episode_to_air": {
        "id": 1331093,
        "name": "Episode 10",
        "overview": "When Jody, who's 29, and Chris, who's 32, arrive at Liverpool Women's Hospital, she'll be giving birth for the first time. It's a day that they thought would never come: after a struggle with infertility, they'd given up hope of having a child themselves and adopted a son. But one last try at IVF had surprising results. Meanwhile, Mormons Cameron, who's 23, and Hannah, who's 21, met through the church and married young. Their faith has taught them the importance of family, and they can't wait to become parents. They just need to get through labour first. And Lesley, who's 41, was desperate to become a mum but couldn't find a man who wanted to be a dad. Not letting that stand in her way, she turned to a sperm donor, and is now eagerly expecting her first child, who she plans to raise alone.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2017-06-20",
        "episode_number": 10,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 60,
        "season_number": 10,
        "show_id": 32873,
        "still_path": null
    },
    "name": "One Born Every Minute",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 26,
            "logo_path": "/hbifXPpM55B1fL5wPo7t72vzN78.png",
            "name": "Channel 4",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 68,
    "number_of_seasons": 7,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "One Born Every Minute",
    "overview": "British observational documentary series which shows activities taking place in the labour ward.",
    "popularity": 5.404,
    "poster_path": "/iOWjqWfAg8GjOLAP0DBWVCja2Hb.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": null,
            "episode_count": 2,
            "id": 44113,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2010-02-09",
            "episode_count": 13,
            "id": 44111,
            "name": "Season 1",
            "overview": "This groundbreaking docuseries observes the dramatic, emotional and often funny moments that go hand in hand with bringing a new life into the world.",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2011-01-10",
            "episode_count": 13,
            "id": 44112,
            "name": "Season 2",
            "overview": "Cameras continue to roll in U.K. maternity wards, capturing the joys and struggles of giving birth, including oversized babies and family squabbles.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2012-01-04",
            "episode_count": 15,
            "id": 44114,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2013-01-02",
            "episode_count": 3,
            "id": 44115,
            "name": "Season 4",
            "overview": "",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2014-02-24",
            "episode_count": 10,
            "id": 60341,
            "name": "Season 5",
            "overview": "",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2014-06-11",
            "episode_count": 4,
            "id": 62101,
            "name": "Season 6",
            "overview": "",
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2017-04-03",
            "episode_count": 10,
            "id": 87067,
            "name": "Season 10",
            "overview": "",
            "poster_path": null,
            "season_number": 10,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Reality",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "5258a611760ee3466169f177",
            "air_date": "2010-02-09",
            "episodes": [
                {
                    "air_date": "2010-02-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771162,
                    "name": "Tracy & Lisa",
                    "overview": "Tracy is 37 years old and is in labour with her fourth child. Accompanied by her husband Steve - who is in a jovial mood - and her middle son Liam, who’s 18, Tracy is calm and upbeat about her labour until the heart rate of her baby slows and the midwife needs to deliver her baby quickly. Suddenly the humour of the situation is gone, Tracy is exhausted and a much more serious Steve becomes the labour coach as the midwife races to get the baby out.  As the staff cope with an increasingly busy shift, 22-year-old Lisa is also in labour, with her first child. Despite the calm words of the midwife, Lisa’s nervousness quickly turns to fear when she learns the baby must be delivered by caesarean section. As she is taken into theatre to give birth, Lisa and her partner are told that once their baby is born it will be taken immediately to an incubator. The first few days of its life are going to be critical.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-02-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771163,
                    "name": "Episode 2",
                    "overview": "Sam is in labour with her first child and is finding the pain too much to bear. Her boyfriend Ed, mum and the midwife team are doing everything they can to make her more comfortable, but she becomes increasingly upset. Ed is feeling the pressure too: he knows he has some real responsibilities to face once the baby is born and is worried about their finances.\n\nWhen the doctor decides that Sam needs a Caesarean, Ed’s nerves get the better of him and, although he wants to be with Sam in theatre, he decides her mum will be of more help.\n\nAnother mum-to-be, Joy, is bored as she waits to go into labour. A diabetic, she has been induced but has been in hospital for four days and it’s a slow process. She’s hungry, tired and sick of waiting, and her frustration is heightened when her lunch doesn’t arrive on time.\n\nThe idea of a piece of chocolate cheers her up although her husband Fabio would prefer she had a banana. Conversation turns to their garden, which distracts Joy for a bit, but she is soon feeling frustrated again and starts to wonder whether motherhood really is for her. ‘I love my independence’, she says.\n\nMeanwhile, Sister Kay Duggan - one of the midwives - is pondering her career after learning that she delivered Ed many years earlier. ‘There are many moments of pure joy in midwifery and many moments of absolute stress… I find work is the most important part of my life’.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-02-23",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771160,
                    "name": "Sarah & Lisa",
                    "overview": "Lisa’s baby Jack has been born with his bowel outside his body. The first few days of his life are critical as he faces serious medical procedures. Lisa is forced to cope with waiting weeks before she can take him home, and confesses to feeling jealous of the nurses who are feeding him before she can even hold him.\n\nMeanwhile, Sarah is expecting her second child. Midwife Dominique does everything she can to make sure she can have the natural birth she always wanted. Sarah’s first labour was very difficult and she had to have a caesarean. But as she finally goes into labour and the hours start to drag by, Sarah and dad Darren begin to worry that it will be the same as last time, and Darren feels impotent, thinking that no-one’s listening to him and there’s no point in him being there.\n\nAnd 25-year-old Andreia comes in to the hospital for a water birth, with the cameras catching her baby’s breathtaking entrance to the world",
                    "production_code": "",
                    "runtime": 48,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-02",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771164,
                    "name": "Episode 4",
                    "overview": "Kelly comes in to have her fifth baby, while Joy is waiting to have her first. Babies have always come easily for Kelly: her last one was delivered three minutes after her waters broke. Joy, on the other hand, has had to undergo five years of IVF, and after days of waiting in hospital, there’s still no sign of Baby.\n\nJoy and her husband Fabio have been together for 20 years since they met at language college, where they were both studying English. Fabio says: “We have achieved a lot in these last 20 years together, but once you have material things they don’t really mean much to you any more. Without family it loses its meaning.”\n\nBut, although Joy’s having contractions, she is dilating very slowly, and it doesn’t look like her waters are ready to break naturally. And although Joy wants to have a natural birth, it looks like she’ll eventually have to decide whether to have a caesarean. At least the long wait gives them a chance to try and agree on names for their long-awaited baby…\n\nMeanwhile, Kelly has brought her husband Jon, her mum Liz and her sister Lisa into the birthing room with her. Kelly and Lisa’s brother died recently, and Lisa says: “Because the pregnancy was a wonderful distraction it became a focus for the whole family, and probably helped us to work through our emotions.” Midwife Lorraine, who’s new to the hospital, where she’s yet to deliver a baby, is looking after Kelly, who certainly knows what she wants: gas and air, and plenty of it…",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-09",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771171,
                    "name": "Leoni & Abbie",
                    "overview": "In this episode, two young mums-to-be come in to the hospital at the end of unexpected pregnancies. And for their mothers it’s time to let go of their daughters.\n\nAbbie and Ross are both 17 and have been together for three years. Abbie says: “We were careful, but things happen, and things happen for a reason.” Her mum Donna, an ambulance technician, has delivered 15 babies, but that can’t prepare her for the emotional wrench of her baby having a baby. As Donna says: “She’s not my little girl any more. She’s going to be somebody’s mummy.”\n\nTwenty-three-year-old self-confessed free spirit Leoni had only been with her baby’s father for a short time when she fell pregnant. She only wanted to be a mother if she could be there for her child. With the support of her family, she decided to go through with the pregnancy. But Leoni is eight days overdue and her pregnancy isn’t progressing. And the hospital staff are worried about the baby’s heartbeat before Leoni’s even in labour.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-16",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771172,
                    "name": "Episode 6",
                    "overview": "In this episode, two mothers are about to give birth to their first babies while two fathers are trying to work out their role in the birthing process. For Shelagh’s baby son it is a dramatic start with an ambulance journey to the hospital and a quick turn around caesarean when his heart rate dips during labour. The birth is very poignant for Richard as Shelagh is having another man’s baby, having fallen pregnant during a break in their relationship. It’s not what he had planned for their relationship but he is determined to be the best dad he can be after a career in the army meant he was not always around for his own children.\n\nPenny is also excited about her new arrival but when labour starts her husband Ben finds it difficult to see her in so much pain. They have deliberately avoided finding out the sex of the baby and a special moment ensues when the baby arrives. Meanwhile, the midwives on the night shift are reminiscing over the extraordinary and wonderful births they have been part of over the years.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-23",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771161,
                    "name": "Neonatal – Emma & Dorit, Charlie & Dan",
                    "overview": "Observe the remarkable and often uplifting situations that occur every day in the neonatal unit with stories of babies who need extra care.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-30",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 771170,
                    "name": "Steff, Kerry & Becky",
                    "overview": "Teenage Steff goes under general anaesthetic for an emergency caesarean, and lesbian couple Becky and Annie endure an exhausting, long labour.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-24",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 771165,
                    "name": "One Born at Christmas - 1",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-25",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 771166,
                    "name": "One Born at Christmas - 2",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-25",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 771167,
                    "name": "One Born at Christmas - 3",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-25",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 771168,
                    "name": "One Born at Christmas - 4",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-12-25",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 771169,
                    "name": "One Born at Christmas - 5",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "This groundbreaking docuseries observes the dramatic, emotional and often funny moments that go hand in hand with bringing a new life into the world.",
            "id": 44111,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5258a611760ee3466169f182",
            "air_date": "2011-01-10",
            "episodes": [
                {
                    "air_date": "2011-01-10",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771174,
                    "name": "Episode 1",
                    "overview": "In this opening episode, two sets of expectant parents are waiting to meet their babies, including teenage sweethearts Ralph and Janet, who fell in love on their last day at school together, and Paul and his wife Stephanie, who warns “I’m a real wimp when it comes to pain!”",
                    "production_code": "",
                    "runtime": 46,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-01-17",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771175,
                    "name": "Episode 2",
                    "overview": "For Lydia (22) and Phil (22) a surprise pregnancy caused the couple to think long and hard about what they should do next. After finally telling her mother, whom she feared would frown on a baby born outside of marriage, Lydia is now looking forward to being a mum and has a natural water birth planned. Boyfriend Phil was at first reluctant to be a dad – he lived a party lifestyle and initially felt sad about saying goodbye to it. When the baby is due to arrive, Lydia’s squeamish elder sister Anna joins her and Phil in the birthing room. Soon, one of the women begins to feel nauseous, and it’s not the one you would expect.",
                    "production_code": "",
                    "runtime": 46,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-01-24",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771173,
                    "name": "Episode 3",
                    "overview": "Julia (31) and her partner Dean (29) are expecting their first child. After meeting online they exchanged phone numbers and became Facebook friends. Dean says he thought Julia was “lush”, adding, “it was the attraction that got me, her legs.” Julia says for her the draw was Dean’s personality although he maintains that it was his Swindonian accent that “knocked her bandy.”",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-01-31",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771177,
                    "name": "Episode 4",
                    "overview": "Delivery room chaos reigns as a father-to-be cannot be located, while another faces a change in birth plans and two women work on remaining calm.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-02-07",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771176,
                    "name": "Episode 5",
                    "overview": "A woman with a heart defect faces complications during the final stage of her pregnancy. A pain-phobic maternity patient awaits her third child.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-02-14",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771178,
                    "name": "Episode 6",
                    "overview": "Three unconventional couples arrive to deliver their babies.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-02-21",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771179,
                    "name": "Episode 7",
                    "overview": "While a teenage mother deals with the pain of a natural birth, a 37-year-old woman finds ways of managing the discomfort of labor.",
                    "production_code": "",
                    "runtime": 46,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-02-28",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 771180,
                    "name": "Episode 8",
                    "overview": "This episode features the uplifting stories of two courageous mums, both overcoming their worst fears.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-07",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 771181,
                    "name": "Episode 9",
                    "overview": "Everyone in the maternity ward is flustered when a wave of expectant mothers triggers a bed shortage, and a complicated delivery adds to the stress.",
                    "production_code": "",
                    "runtime": 46,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-14",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 771182,
                    "name": "Episode 10",
                    "overview": "Natural birth gets complicated for a petite woman anticipating a big baby, while an expectant mother's excess weight may pose a risk to her labor.",
                    "production_code": "",
                    "runtime": 46,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-21",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 771183,
                    "name": "Episode 11",
                    "overview": "Family matters are the focus for a couple awaiting their fifth child, a financially strapped father-to-be and an expectant mother in mourning.",
                    "production_code": "",
                    "runtime": 46,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-28",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 771184,
                    "name": "Episode 12",
                    "overview": "The series finale features extraordinary images of premature babies being delivered by Caesarean section.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-04",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 771185,
                    "name": "Series 2, Episode 13",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "Cameras continue to roll in U.K. maternity wards, capturing the joys and struggles of giving birth, including oversized babies and family squabbles.",
            "id": 44112,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5258a611760ee3466169f198",
            "air_date": "2012-01-04",
            "episodes": [
                {
                    "air_date": "2012-01-04",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771188,
                    "name": "Episode 1",
                    "overview": "New series. Fly-on-the-wall documentary observing the lives of staff and patients on a busy maternity ward in Leeds. This first edition features a soldier who may miss the imminent birth of his daughter, as he only has 48 hours before returning to the Army. Another man is determined to put his wayward days behind him and be present when his son is born, but after his partner experiences complications during labour, she must decide whether her boyfriend or mother accompanies her into the operating theatre.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-01-11",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771189,
                    "name": "Episode 2",
                    "overview": "Two women are approaching the pain of childbirth in very different ways. One mum, who experienced a traumatic first labour, is terrified of what the second will bring, while another refused to attend any antenatal classes, feeling that - for her - ignorance will be bliss.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-01-18",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771191,
                    "name": "Episode 3",
                    "overview": "This episode meets mums who break the rules, defy convention and arrive at motherhood in very individual ways, including One Born Every Minute's first Indian couple, who dated in secret when they were young and continue to break from tradition by having the dad present at the birth.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-01-25",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771190,
                    "name": "Episode 4",
                    "overview": "This episode features two mothers at opposite ends of the spectrum when it comes to conception and labour. After endless rounds of IVF, wheelchair user Tricia is looking forward to a much-longed-for baby.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-01",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771192,
                    "name": "Episode 5",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-08",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771193,
                    "name": "Episode 6",
                    "overview": "Every pregnancy and birth is unpredictable and an easy early labour is not necessarily an indication of what happens towards the end. In this episode there's a serious emergency on the maternity ward when a baby's shoulders become wedged after the head has been delivered.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-15",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771194,
                    "name": "Episode 7",
                    "overview": "This episode features unexpected twins, and the tables are turned when one of the midwives arrives for labour. Neither mum wants intervention or an epidural; they both want to do it naturally. But Mother Nature can influence even the best-laid birth plans.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-22",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 771195,
                    "name": "Episode 8",
                    "overview": "Hopes and fears about delivering babies provide the theme to this episode.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-29",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 771196,
                    "name": "Episode 9",
                    "overview": "Lithuanian mother-to-be Olga goes into labour, but refuses to allow her husband Victor into the delivery room, selecting her mother Galina to accompany her instead. However, without an interpreter on hand, the pair have difficulty communicating with the midwives. Vicki Thompson also prepares to give birth, and discusses how she and her partner Ben have used tattoos to mark life-changing events since they met.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-07",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 771197,
                    "name": "Episode 10",
                    "overview": "Three couples in different circumstances prepare to give birth. Ghost-hunter Vicki is supported by her partner Janet as she prepares to give birth to their first child, conceived using the mother's eggs and donor sperm. Ines and Paul are separated in age by 30 years but find their shared religious beliefs tie them together, while 20-year-old Sheree and 19-year-old Danny try to adapt to the changes their baby will bring",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-14",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 771198,
                    "name": "Episode 11",
                    "overview": "The importance of strong family values is the theme running through this episode. But the two families and the values they share are so very different.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-21",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 771199,
                    "name": "Episode 12",
                    "overview": "Two couples who experienced unexpected difficulties during pregnancy arrive at the hospital. Seventeen-year-old Billie has pre-eclampsia, caused by high blood pressure, which is one of the most serious conditions that can develop during pregnancy.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-28",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 771200,
                    "name": "Episode 13",
                    "overview": "Myleene Klass opens a new birthing pool and causes a stir on the maternity ward. Delivery suite manager Gail Wright has to rehearse her speech and gets all in a dither about how to coordinate the grand opening.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-04",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 771201,
                    "name": "Episode 14",
                    "overview": "A long-serving midwife's lifetime career comes to an emotional end. Linda Abbott has been a midwife for 38 years. Aged 60, she's retiring from her post.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-05",
                    "episode_number": 15,
                    "episode_type": "finale",
                    "id": 771202,
                    "name": "What Happened Next",
                    "overview": "More than 100 babies have been born on the award-winning One Born Every Minute.\n\nNow the series visits three One Born couples as their babies approach their first birthday to see how they're responding to an even bigger challenge: parenthood.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 44114,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "5258a611760ee3466169f1a3",
            "air_date": "2013-01-02",
            "episodes": [
                {
                    "air_date": "2013-01-02",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771203,
                    "name": "Episode 1",
                    "overview": "One Born Every Minute returns for a brand new series, with cameras now recording life on two busy labour wards in Leeds: Leeds General Infirmary (LGI) and St James’s Hospital. Over the past year the LGI’s maternity ward has often had to close to new admissions, with expectant mums sent to St James’s across the city. Stacey is expecting her second child but it’s her first with her husband Lee. Stacey is desperate to give birth but every time she thinks she’s in labour, it turns out to be a false alarm and the hospital send her home. The to-ing and fro-ing gets frustrating for Lee who admits he had a troubled past until he met Stacey, who ‘saved him’. When Ramona last gave birth it was by an emergency C-section. This time, she wants to give birth naturally with her husband Marvin by her side, but when she goes into labour, Marvin is half-way down the M1. Meanwhile, the hospital is promoting ‘active birth’ and trainee yoga instructor Sara wholeheartedly embraces the idea. Sara endured a long induction during her last birth and this time round she’s determined to make the birth 100% natural, with her easy-going partner Billy by her side.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-09",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771204,
                    "name": "Episode 2",
                    "overview": "The stories of two strong women offering their daughters plenty of support during labour after unplanned pregnancies. Twenty-three-year-old Sam went off the rails as a teenager, running away from home and ending up sleeping rough, before meeting her partner Biaggio, and the couple are grateful to have Sam's mum by their side. Claire, 20, always knew she wanted her mother to be there in the delivery room, but deciding whether boyfriend Clint should be present wasn't as easy",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-16",
                    "episode_number": 3,
                    "episode_type": "finale",
                    "id": 771205,
                    "name": "Episode 3",
                    "overview": "Two strong-willed first-time mothers give birth at Leeds General Infirmary. Alexandra is 25 and left her native Latvia in search of adventure. She believes her child is the missing piece in her life, even though the father is not around anymore. Surbhi is from a warrior Hindu caste and knows what she wants, while her husband will do anything to please her, especially as he feels responsible for a motorcycle accident that left his wife paralysed in one arm.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "",
            "id": 44115,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "535d75cfc3a3683091004365",
            "air_date": "2014-02-24",
            "episodes": [
                {
                    "air_date": "2014-02-24",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 975482,
                    "name": "Episode 1",
                    "overview": "The first episode of the fifth series introduces the straight-talking midwifery team in Bristol as an expectant father risks missing his daughter's birth and one of the team helps her next-door neighbour through an emotional labour.\n\nMichelle and Michael's parents are from different countries: hers are Chinese, his British. 'I was actually asked if I was a Thai bride when we were on our honeymoon!' says Michelle.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-03",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 975483,
                    "name": "Episode 2",
                    "overview": "First time mum Lucy admits she's afraid of everything from roller coasters to sewing needles, so the thought of giving birth is completely terrifying. She says she's just little and wonders how on earth the baby is going come out.\n\nDoting boyfriend Sam has his proposal to Lucy all planned out and the rings are en route from eBay. But despite all the distractions, panic soon sets in.\n\nAmy and her naval engineer husband Paul arrive at Southmead Hospital for an induction. But after a quick examination, it becomes clear that Paul is far more squeamish than he expected...\n\nMeanwhile, Dianne is understandably concerned about giving birth as the last time she was in labour there were serious complications. This time Dianne and husband John have opted for an elective Caesarian, but nerves begin to get the better of them.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-10",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 975484,
                    "name": "Episode 3",
                    "overview": "There's tension as a teenage mum asks her dad and boyfriend to both be present at the birth; a vicar's wife seeks divine intervention; and a young couple hope for a simpler labour second time around.\n\nWhen 18-year-old Charlie fell pregnant, her dad, Dean, wasn't pleased. Stern words followed for her boyfriend Ricky, who's also 18, and who was made to promise he would stand by her.\n\nRicky is determined to prove he can be a good dad, but as the moment of baby's birth draws closer the atmosphere in the delivery room becomes tense...\n\nMeanwhile, vicar Adam's wife Sheona, who's 33, has reservations about becoming a mother for the second time, but with the help of Adam's support and humour, and the promise of a bottle of good Champagne afterwards, she hopes to find an inner strength.\n\nChloe and Adam, who are both 20, are followed to Southmead Hospital by their neighbour's cat but the distraction of this additional birthing partner does little to put their minds at ease.\n\nThey're both troubled by thoughts of the birth of their first daughter, who was rushed off to intensive care as soon as she was born, and as the night draws on exhaustion begins to get the better of Chloe.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-17",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 975485,
                    "name": "Episode 4",
                    "overview": "A mum-to-be who has cerebral palsy goes through a dramatic delivery, one couple have to put their footballing differences aside in the birth room, and a five-year fertility journey is almost over for one first-time",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-24",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 975486,
                    "name": "Episode 5",
                    "overview": "In this episode a farmer finds his baby's birth a far cry from lambing season, a former midwife must take a back seat in the birth room and a laid-back dad nearly misses his daughter's birth.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-31",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 975487,
                    "name": "Episode 6",
                    "overview": "A couple face the reality of their surprise pregnancy, parents who know that their pregnancy has serious medical complications prepare for labour, and a first-time mum races to the maternity ward before her baby",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 975488,
                    "name": "Episode 7",
                    "overview": "A young couple from Liverpool refuse to let a tough start hold them back, parents with four boys eagerly await the arrival of their dream girl, and a mum who didn't think she could conceive naturally prepares for her first",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-14",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 975489,
                    "name": "Episode 8",
                    "overview": "On her birthday, midwife and single mother-of-two Lara contemplates life and love while delivering twins.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-21",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 975490,
                    "name": "Episode 9",
                    "overview": "This episode meets a mum who donated her eggs but went on to have fertility problems herself, a couple whose exciting whirlwind romance resulted in an unexpected pregnancy, and the mum who's finally having her miracle baby after she was told she could never have any children.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-28",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 975491,
                    "name": "Episode 10",
                    "overview": "In this episode there's an extreme case of 'like mother, like daughter' with one mother about to become a gran aged 40; a career woman finally takes the plunge into motherhood; and an over-excited father tries his best to keep his partner entertained.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "",
            "id": 60341,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "53d95a19c3a3681ed90005e7",
            "air_date": "2014-06-11",
            "episodes": [
                {
                    "air_date": "2014-06-11",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1001509,
                    "name": "Episode 1",
                    "overview": "In the first episode of the sixth series, fourth generation twins make an appearance on the delivery suite at Southmead Hospital in Bristol, a larger-than-life double act struggle to see the funny side of their extended labour, and an expectant father holds his breath hoping for a boy.\n\nMel is an identical twin. Her father is also a twin, as was her grandmother, so it's incredibly rare that Mel herself would be pregnant with twins, but that's exactly what has happened.\n\nWhen Mel's waters break unexpectedly she has to choose whether her husband or her identical twin sister will be her birthing partner.\n\nLarger-than-life Su felt she'd hit the jackpot when she met younger man Dan, and they arrive at Southmead in high spirits.\n\nTheir baby is in breech so they've been booked for a caesarean, but those plans are thrown out the window when baby decides to move, meaning that the couple are able to have a natural delivery.\n\nFinally, the race is on for Katy and Rob to make it to the delivery suite before their second child arrives, and Rob is praying this one's a boy.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-06-18",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1001510,
                    "name": "Episode 2",
                    "overview": "A muscle-mad macho man struggles to keep his nerves in check, an expectant dad goes all out to make his wife feel comfortable in the birthing room and a same-sex couple are rushed into hospital 10 weeks early.\n\nMarion and Rachel are like any other couple in their early thirties trying to start a family, although as Rachel says, 'we can't just have an early night and make a baby,' so they shopped online for sperm.\n\nUsing Marion's eggs they based their decision on which donor had the most similar attributes to Rachel and they ended up with twins. But at their 30-week hospital scan the couple are told that one of the twins is not growing properly and they need to return to Southmeads the next day for a C-section.\n\nImage-conscious Sarah and her husband, personal trainer Rob, arrive at the delivery suite to begin the induction process. Sarah's told she's only allowed one birthing partner and chooses her husband over her mum: a move she begins to regret as Rob shows signs of impatience.\n\nThey pass the time by discussing baby names but have very different ideas. Sarah reaches a compromise: if the baby comes before midnight, Rob gets to choose but any time after it's her decision.\n\nMeanwhile, attentive husband Ollie and his wife Kate arrive at hospital and Ollie's armed with blankets, rugs and all the essentials to make sure Kate is as comfortable as possible. Kate wants to have a hypnobirth and Ollie is on hand to ensure everything runs to plan.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-06-25",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1001511,
                    "name": "Episode 3",
                    "overview": "Southmead Hospital rolls out the red carpet for a celebrity 'baby': Baby Spice is coming in to support the maternity unit's charity and her arrival is causing quite a stir. Midwife Sacha in particular is giddy with excitement about meeting her idol, and brings in some treasured Spice Girl ",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-07-02",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 1001609,
                    "name": "Episode 4",
                    "overview": "he hospital corridors at Southmead turn blue as one young mum lets out all of her pent-up frustrations, on-off romancers finally take the plunge after 10 years of indecision, and pregnancy cravings",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 32873,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 6",
            "overview": "",
            "id": 62101,
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "success": false,
            "status_code": 34,
            "status_message": "The resource you requested could not be found."
        }
    }
}