{
    "adult": false,
    "backdrop_path": "/xLtbz3kJdcJuqzf65P1zxrAvwda.jpg",
    "created_by": [],
    "episode_run_time": [
        48
    ],
    "first_air_date": "2007-05-17",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "https://www.channel4.com/programmes/embarrassing-bodies",
    "id": 32872,
    "in_production": false,
    "languages": [
        "en"
    ],
    "last_air_date": "2022-07-07",
    "last_episode_to_air": {
        "id": 4353724,
        "name": "Skin Cancer, Leg Pain, Skin Condition",
        "overview": "The doctors help patients with skin cancer, leg pain and a severe skin condition.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2022-07-07",
        "episode_number": 8,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 46,
        "season_number": 9,
        "show_id": 32872,
        "still_path": null
    },
    "name": "Embarrassing Bodies",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 26,
            "logo_path": "/hbifXPpM55B1fL5wPo7t72vzN78.png",
            "name": "Channel 4",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 101,
    "number_of_seasons": 8,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Embarrassing Bodies",
    "overview": "Embarrassing Bodies is a British television programme broadcast by Channel 4 and made by Maverick Television since 2007. In 2011, an hour long live show was introduced, \"Embarrassing Bodies: Live from the Clinic\", which makes use of Skype technology. Various spin-offs have been produced in relation to the programme to target different patients, such as Embarrassing Fat Bodies and Embarrassing Teenage Bodies. The show has a strong multiplatform presence on web and mobile.",
    "popularity": 9.346,
    "poster_path": "/52wg4S48CCjT0gEArFBPksDvJya.jpg",
    "production_companies": [
        {
            "id": 2524,
            "logo_path": "/gPPOfl9UHQZV6BZgvnY4MemrzdX.png",
            "name": "Maverick Television",
            "origin_country": "GB"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2009-11-22",
            "episode_count": 2,
            "id": 44106,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2008-04-08",
            "episode_count": 8,
            "id": 44103,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2009-04-15",
            "episode_count": 11,
            "id": 44105,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2010-02-03",
            "episode_count": 16,
            "id": 44104,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2011-01-17",
            "episode_count": 24,
            "id": 44107,
            "name": "Season 4",
            "overview": "",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2012-03-05",
            "episode_count": 16,
            "id": 44108,
            "name": "Season 5",
            "overview": "",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2013-02-18",
            "episode_count": 8,
            "id": 44109,
            "name": "Season 6",
            "overview": "",
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2013-11-05",
            "episode_count": 10,
            "id": 44110,
            "name": "Series 7",
            "overview": "The Embarrassing Bodies docs return for a three-part series of special episodes.",
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        {
            "air_date": "2022-05-19",
            "episode_count": 8,
            "id": 336399,
            "name": "Series 9",
            "overview": "Three new GPs - Dr Jane, Dr Tosin and Dr Anand - throw open the clinic doors to welcome patients who reveal their medical problems.",
            "poster_path": null,
            "season_number": 9,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Canceled",
    "tagline": "",
    "type": "Reality",
    "vote_average": 7.4,
    "vote_count": 8,
    "season_data": {
        "1": {
            "_id": "5258a609760ee3466169e9a6",
            "air_date": "2008-04-08",
            "episodes": [
                {
                    "air_date": "2008-04-08",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771067,
                    "name": "We're Coming to Get You!",
                    "overview": "The Embarrassing Illnesses doctors have decided to up sticks and take their clinic on the road! In the first of four special programmes, the three straight-talking doctors – Christian Jessen, Dawn Harper and Pixie McKenna – begin their tour of Britain in the city of Leeds, with a PR offensive that Victoria Beckham would be proud of. And to ensure that no fungal feet, problem penises or bothersome boils slip through the net, the EI team have chosen a location bang in the heart of Leeds, on Briggate – one of the city’s busiest shopping streets. With the high street transformed into a slalom of stalls, information boards and games, there will be nowhere for the people of Leeds to hide. The doctors are back…and the time for excuses is over! Kicking off proceedings is Kali, who has embarrassment written all over her face. She’s suffering from a common inflammatory condition of the skin called Rosacea, which causes redness that looks like a flush or blush.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-04-29",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771065,
                    "name": "Breasts",
                    "overview": "In this second of four specials, the Embarrassing Illnesses doctors will be concerning themselves with breasts and all matters mammary. In an effort to encourage women to bring their breasts out into the open, they’ll be taking their medical expertise to the capital and setting up drop-in clinics in the East End and West End of London – in the imposing surroundings of Shoreditch town hall, and conveniently, in a bra shop in the heart of Covent Garden. First through the clinic’s doors is a huge pair of double ‘J’ breasts, swiftly followed by 40-year-old Alyson. After 20-years of back pain and misery from carrying around a whopping 5 kilos on her chest, she is desperate to see if Dr Harper can reduce her burden by referring her for breast reduction surgery. Former breast cancer sufferer, Cheryl, whose breast removal and problematic reconstructive surgery left her with only one breast, also visits the clinic to see Dr Jessen.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-04-30",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771069,
                    "name": "Vaginas",
                    "overview": "The penultimate programme in our week of specials sees the EI team rolling into Norwich to set up a clinic in the heart of one of the country’s busiest shopping centres. This time the Docs are getting stuck into the Vagina, and there’s no room for coyness ladies!\n\nThe first patients in the EI clinic are a group of teenagers who want to find out more about the embarrassing consequences of thrush. 75% of women get thrush at some point in their lives, and it affects everybody – from babies to grannies and a few fellas on the way through. \n\nThen there’s 42-year-old Debbie, who’s come to see the Doctors after giving birth to a bouncing baby boy. Baby Samuel’s doing fine, but Debbie’s having to deal with the embarrassing consequences of a painful childbirth that delivered much more than just a bundle of joy…\n\nThe Docs are next putting periods under their medical microscopes, looking at the causes of period pain as well as the painful condition Endometriosis, where cells from the womb find their way into different parts of the body, with unpleasant consequences.\n\nWe’re then reacquainted with 45-year-old Alyson from Monday’s programme, who’s all in a flap when it comes to exposing herself to her new partner. Fortunately, a consultation with Dr Pixie leads to a welcome resolution to her elongated labia.\n\nThe menopause is something that every woman must eventually go through. However, the period just before that, the perimenopause, is less understood, but can be taste of things to come. With hot flushes, night sweats and weight gain among the symptoms, Dr Dawn discusses some of the treatment options, including Hormone Replacement Therapy. \n\nThere’s also a case of vaginal dryness for Dr Dawn to examine as well, with a novel treatment involving a vaginal oestrogen pessary. Thanks to the treatment, Susan and her husband can resume normal service in the bedroom.\n\nBack in their London clinic, the Docs have a case of Polycystic Ovary Syndrome, which affects over a third of British women, including high profile sufferers like Emma Thompson and Victoria Beckham. Jenni’s in the clinic to be rid of the hair that’s constantly appearing on her back and chest, and a course of laser treatment sees her much improved. They also have a woman whose overactive bladder is making her life a misery, but there’s a novel solution more commonly associated with the world of cosmetic surgery…\n\nDr Dawn makes a house call on a women whose been suffering from a prolapsed rectum for years, and fortunately there’s a solution to her plight – but it’s certainly not for the faint hearted…\n\nFinally, Dr Jessen is running a smear campaign in Norwich! He’s targeting the 20% of British women that don’t attend a regular cervical smear test. And he’s not taking no for an answer…as three volunteers discover when he persuades them to have theirs done there and then!\n\nAnd don’t forget – you can watch our self-check guide to how to check your vulva by clicking here, or you can get the guide on your mobile phone by texting VULVA to 84444…",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2008-05-01",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771066,
                    "name": "Men",
                    "overview": "Having waged war on the Vagina yesterday, the EI Docs turn their attention to the GP surgery’s most elusive creature – the ‘MAN’. From baldness to man boobs, and troublesome testicles to problem penises, the Docs are hitting the streets of Gloucester, searching for men who are in desperate need of a health MOT…\n\nIn the climax to our week of specials, the Embarrassing Bodies clinic sets up camp at Gloucester Rugby Club. And it’s not long before they’ve got their first eye-watering case: a man whose manhood has been mangled by a piercing. Fortunately, Dr Harper is on hand to give some advice on how to keep it clean, before she heads out to a local pub to quiz the locals on how much they know about their health – with predictably poor results…\n\nBack at the club, the next patient who appears is suffering from the classic symptoms of an enlarged prostate. With 1 in 4 men over the age of 60 suffering in this way, Dr Jessen heads out to talk to pathologist Dr Jarmulowicz about how it affects men, and why so few know about it.\n\nThis is all brought into sharp focus by 53-year-old Barry, who was struck down by Prostate Cancer 3 years ago. With his symptoms worsening, Barry comes along to the clinic to see Dr Jessen about the options open to him, including surgical removal, which carries with it the risks of incontinence and impotence.\n\nMost men would like to laugh off their illnesses, but the Docs have discovered that going bald can be no laughing matter. They’ve brought four balding blokes together to test out the latest hair loss products, including light technology; natural trichology, minoxydil lotion and even a full 6-hour hair transplant operation!\n\nDr Jessen also gets to grips with a case of gynecomastia (man-boobs to most of us), when we catch up with 33-year-old Abdul from Tuesday’s programme, who’s looking to put 17 years of discomfort behind him. After a two hour operation (and the removal of three pints of fat!) Abdul’s very happy to show off his manly new chest.\n\nWith surgery nearly over, Christopher drops in with a problem penis. The Docs decide that a chemically induced erection is the only way to find out if the problem will require a circumcision…\n\nAs last orders are called at the Embarrassing Bodies bar, there’s a final patient to be seen. John’s acne had given his confidence a massive knock – but with the aid of dermatologist Dr Chopra, John was able to avoid plastic surgery and get on the road to recovery.\n\nAnd don’t forget – you can watch our self-check guide to how to check your testicles by clicking here, or you can get the guide on your mobile phone by texting BALLS to 84444…",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-06-14",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771072,
                    "name": "Episode 5",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-06-21",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771068,
                    "name": "Embarrassing Illnesses Season 1 Episode 6",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-06-28",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771070,
                    "name": "Embarrassing Bodies Season 1 Episode 7",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-07-05",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 771071,
                    "name": "Embarrassing Bodies Season 1 Episode 8",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 44103,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5258a609760ee3466169e9ff",
            "air_date": "2009-04-15",
            "episodes": [
                {
                    "air_date": "2009-04-15",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771089,
                    "name": "Pelvic Floor",
                    "overview": "Dr Christian Jessen and Dr Pixie McKenna – the nation’s favourite doctors for those toes curling embarrassing conditions are back – and now they’re joined by A&E Doctor, Dr Priya Manickavasagar and leading cosmetic Dentist, Dr James Russell – between them they’ve got every orifice covered. \n\nThis week’s episode starts with a visit to the clinic for 21-year-old Rebecca. She’s always had noticeably asymmetric breasts (in common with many women in the UK) but pregnancy has accentuated this problem and left her with a severe imbalance. Dr Pixie sends Rebecca to a specialist to see if anything can be done to rectify the problem. The specialist performs a surgical procedure to give Rebecca more balanced and symmetrical breasts.\n\nNext through the clinic doors is Mark, who’s firing on all cylinders – but unfortunately he’s firing blanks. As a long-term diabetic, Dr Christian suspects this might be connected with his erectile problems, but first sends him for a check-up on his prostate. Tests reveal that damage to nerves is causing a condition called retrograde ejaculation, where the semen is entering his bladder instead of leaving through the end of the penis.\n\nIn our truck stop Dr Christian sees a case of neuroma, an overgrowth of nerve tissue that is benign, but can be removed surgically if necessary, whilst Dr Pixie sees a patient who is suffering from keloid scars, which are sadly too far developed to be treated effectively. There’s also a case of a birthmark on the tongue, and an instance of melasma that has lead to an overgrowth of pigment on the patients face. Pixie recommends make-up to start with, before considering lazer treatment in the future.\n\nDr Christian next sees a young lady suffering from one of the most common conditions that Doctors see – warts. Luckily Christian is able to freeze the warts off in the surgery, and with some home treatments she should be able to keep them under control herself.\n\nOur Dentist Dr James has a visit from a patient with an artistic streak, but her teeth are anything but picture perfect. Heavily decayed, her teeth need to be crowned and reshapen if she’s to recover her sparkle. After removing the decay and creating custom veneers, Dr James gives his patient a reason to smile again.\n\nNext up is Brigitte who’s comes to see Dr Pixie with a big problem. She thinks that she has an excessively large vagina that has remained even though she has lost a substantial amount of weight. Dr Pixie examines Brigitte and diagnoses her with a vaginal prolapse and excess skin around the vagina. After a visit to a specialist, Brigitte is told that there is no quick surgical fix for her problems and further examinations must be done.\n\nThe doctors hit the streets of Birmingham to talk to locals about the perils of weak pelvic floor muscles and recommend exercises and remedies to regain control over these important muscle areas. The doctors persuade a group of 3 women to road test 3 different techniques for strengthening their Pelvic Floors – with some surprising results. The products tested included a Pelvic Toner, a Pelvic Floor Exerciser and Pelvic Cones.\n\nDr Priya meets her first patient, Peter, who’s suffering from urinary incontinence after the removal of his prostate due to cancer. He’s been wearing pads and taking medication to control the symptoms, but nothing seems to be effective. Dr Priya sends him to a specialist where the consultant inserts a pump to give Peter control of his bladder with the push of a button.\n\nThis week’s body check sees our guinea pig group checking their feet for early signs of an embarrassing illness, whilst Dr Pixie and Dr Priya talk to them about what they can do about athlete’s foot, corns and flat feet.\n\nAnd finally, the doctors put their own bodies on the line to take the fear out of simple tests. This week, Dr Pixie undergoes the latest test for HIV that reveals results instantly.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-04-22",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771091,
                    "name": "Kids",
                    "overview": "This week’s episode starts with 8-year-old Charlotte from Suffolk who’s been suffering from sore verrucas on her feet for over 2 years. Dr Christian sends Charlotte for tests to check her immune system and try and find out why the virus is winning. \n\nThe tests reveal that her immune system is unable to fight the virus and so the usual treatment for verrucas will not do the job. Whilst a formaldehyde treatment produces some encouraging results, further immunology test reveal that she’s missing certain lymphocytes and the possible treatment course includes a bone marrow transplant and chemotherapy. \n\n+++UPDATE+++\n\nCharlotte’s operation to remove the verrucas from her foot appears to have been successful and her foot is healing really well. She’s back on her bike and back to being a normal child, pending a potential bone marrow transplant.\n\nThe EB bus heads to Southend, where Dr Priya has a patient with case of cold feet, medically known as Chilblains. Dr Pixie’s patient can’t stop scratching her itchy sores while Dr Christian has a customer with a permanent runny nose due to nasal polyps.\n\nNext up is a visit to the dentist for 27-year-old Lyn from Aberdeen. Lyn arrived to see Dr James because she has an addiction to fizzy drinks that has left her with missing, rotting and discoloured teeth. After extracting the rotten teeth, Dr James recommends implants, but only if Lyn will give up smoking, as it drastically reduces the success rate of the procedure. After a long day in the dental hot seat, Lyn has a new set of pearly whites.\n\nVisiting the clinic next is David, 24, from Shropshire who’s had an embarrassing swelling for more than half his life. None of the treatments and tests have been able to ease his enlarged sore lips. Dr Pixie suggests that the swelling is a possible sign of an allergic reaction. Tests reveal that David is allergic to cinnamon and a long list of preservatives; so he sets off in search of a new diet. \n\nThe doctors head to a very windy Southend-on-Sea to meet with a group of kids and their parents at Fairways primary school. Dr Pixie talks to the kids about head lice and shows them up close just how nasty they can be, whilst Dr James teaches the kids a lesson about tooth decay.\n\nRead Dr James’ guide to How to Look After Your Teeth >\n\nMaria, 13, believed she had a case of head lice, but it turned out to be much more serious. Maria actually has scalp psoriasis that causes her scalp to scale and nothing she’s tried has helped. Dr Pixie sends Maria to a hair specialist to get the scaling and inflammation under control with the help of creams and steamers. After three visits to the hair specialist Maria comes back to the clinic and shows Dr Pixie her much improved scalp.\n\nEver since 43-year-old Sandra from Derby gave birth she’s developed a rather messy problem. Sandra experiences problems with her bottom – it bleeds and causes problems for her hygiene. Dr Pixie diagnoses Sandra with skin tags and sends her to a specialist to try a surgical procedure to clear up her problem. Tests show Sandra’s problem goes deeper than just the skin tags – she’s suffering from a case of rectacil, where her bowel is misshapen. Sandra will have to complete more tests, but pelvic floor exercises have been recommended to help her cause.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-04-29",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771090,
                    "name": "Rural",
                    "overview": "First through the door this week is 18-year-old Cherie who’s suffering from back pain caused by extremely large breasts. The best option to ease the discomfort caused by her gigantic 30JJ bust is breast reduction and Dr Pixie refers Cherie to a specialist surgeon to get the procedure done. \n\nVisiting the dental clinic is Richard, 27, who has painful, aching teeth. Dr James’ examination reveals that Richard’s teeth are worn down as a result of Bruxism, an involuntary grinding of the teeth. Richard is sent to a specialist to clear the decay in his gums and teeth before Dr James can restore his smile with veneers and crowns.\n\nRead Dr James’ guide to How to Look After Your Teeth >\n\nNext in is Vicky, 28, who’s been dealing with boils in her groin area. Dr Christian believes the boils are caused by a condition in the sweat glands called Hidradenitis Suppurativa. As Vicky’s case is fairly mild, Dr Christian recommends treatment with antibiotics, the contraceptive pill, or acne treatments as opposed to more invasive surgery.\n\nThe EB Bus heads out on the road, and first in is Amanda who feels that she has very large labia – but Dr Pixie’s examination reveals she’s perfectly normal. Meanwhile, Sharon shows her severe skin condition to Dr Christian who sends her to a dermatologist for a more accurate diagnosis. The specialist seeing Sharon prescribes topical creams to treat her scaly skin that’s been badly sun damaged.\n\nJulie visits the clinic because her ear is flaking skin and secreting gunky liquid. Dr Priya believes July has chronic otitis externa, an infection and inflammation of the ear, and sends in some sample swabs to be analyzed. An Ear Nose and Throat specialist injects an ointment into Julie’s ears and clears up her infection.\n\nNext in the clinic to see Dr Christian is Sarah who’s been suffering from lumps around her eyes for years. The condition is known as xanthelasma and it causes fatty growths around the eyes. Dr Christian recommends that she try make-up to start with as other methods carry the risk of scarring around the eyes.\n\nAllison, 23, is suffering from a funnel chest, a common hereditary condition where the chest is sunken. Because funnel chest can affect cardio and respiratory functions, Allison is sent to see a specialist for a check-up. After positive results from her test, the specialist attempts to re-contour Allison’s chest with a cosmetic filler.\n\nThe EB doctors head out to rural Staffordshire to meet with the locals and discuss their health. Dr Christian speaks with some young farmers about the perils of STIs whilst Dr Pixie gets people talking about their bowels.\n\nAnd finally, this week’s body check sees our guinea pig group checking their poo for signs of ill health. Dr Christian talks to them about the reasons behind the differing colours and what different shapes and consistencies can indicate.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-05-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771092,
                    "name": "Feet",
                    "overview": "This week’s episode starts with a visit to the clinic for Natalie, a 31-year-old woman who has had to endure taunts from children about the boils and cysts that she has suffered since childhood. Dr Pixie suspects she is suffering from painful cystic acne, and sends her to a specialist for treatment with antibiotics and lazer resurfacing. On returning to the clinic, Natalie has been prescribed the contraceptive pill and some small skin grafts that drastically improve the appearance of her condition.\n\nThe EB bus heads to Merseyside, where Dr Christian sees a case of a pierced problem nipple, whilst Dr Pixie sees a case of dermatitis that has it’s sufferer scratching himself in a very sensitive area. Meanwhile Christian puts a hydrocele sufferers mind at ease.\n\nDr James meets Thomas, whose mouthful of manky molars has left him with a smile that would worry a 70-year-old, but he’s only 20! Dr James recommends implants, but Thomas’s smoking substantially reduces the success rate, so dentures are going to have to be tried first.\n\nRead Dr James’ guide to How to Look After Your Teeth >\n\nThe docs hit the streets of Liverpool to talk about feet, helped out by local podiatric surgeon Emma Supple, with some cases of calloused corns and nail psoriasis on display. The docs also hit the streets of Merseyside to see if they can persuade the ladies of Liverpool to give high heals the heave ho…\n\nNext in the clinic is Anna, who has come in with a swollen arm and leg that Dr Christian diagnoses as Lymphodema. After visiting a specialist clinic, Anna starts a course of treatment involving manually massaging the excess fluid out of the swollen limbs.\n\nDr Pixie sees a young woman called Emma who is suffering from a hernia and excess skin after two pregnancies. Dr Pixie sends her off to a surgeon for repair to her umbilical hernia, and removal of the excess skin.\n\nNext up, Dr Priya sees an unusual case of an abscess just above a man’s bottom, called a Pilonidal Sinus. The amount of hair in the area seems to be to blame, with hair filling up a pit in the skin and causing an infection to develop. The first treatment used is a lazer to remove the problem causing hair, followed by a surgical procedure to remove the infected follicles, which is full of matted hair.\n\nAnd finally, this week’s body check sees our guinea pig group checking their urine for signs of ill health. Dr Christian talks to them about the reasons behind the differing colours and what the warning signs are to look out for. You can take the urine test yourself here >>",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-05-13",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771093,
                    "name": "Holiday",
                    "overview": "This week the doctors have set up shop at the airport. First patient Joanne, an air-hostess, feels that her psoriasis is alienating her passengers. Dr Pixie sees Donna, who has a patchy rash on her back that is diagnosed as shingles and Dr Christian deals with Arthur who has a disfigured fingernail due to an accident at work. The doctors also check random samples from passengers to test for bacteria and bugs that have travelled with them.\n\nBack at the clinic, 44-year-old Stuart thinks that his holiday is responsible for the constant burning at the end of his penis. Dr Pixie believes an inflammation of the prostate, caused by a possible bladder infection, may well be the reason for Stuart’s troubles. He’s sent for a visit to a specialist and a treatment involving a prostate massage…\n\nAfter the birth of her child a year ago, Kerry has begun to feel pain and bleeding with her bowel movements – and visits to the loo are few and far between. Dr Christian notes that Kerry has developed a skin tag due to a tear and sends her to a specialist. Further testing doesn’t reveal anything sinister in her bowels and the problem is pinpointed as a tense pelvic muscle.\n\nNext up is Lindsay who has had a scar on her chest since she was 7 years old. Lindsay has developed a keloid scar, possibly from a pimple or bug bite, and Dr Pixie recommends steroid injections followed with laser treatment to help flatten out the surface of the scar.\n\nIn to meet Dr James is Jessica, who has suffered from bad breath for years. Jessica has been blaming her halitosis on her tongue, but Dr James reveals it has more to do with gum disease. Jessica’s inflamed gums have created pockets that help to house bacteria and plaque, a visit to the dental hygienist helps to clear up the blockage and reduce her bad breath.\n\nBack at the airport, Brendan has a spotty abdomen caused by “folliculitis”/conditions/folliculitis/ whilst a returning passenger has been bitten by bed bugs on his holiday. Dr Pixie also sees Helene who has some moles on her back that are hurting…\n\nThis week’s body check sees our guinea pig group checking their moles for signs of changes and abnormalities. Doctors Christian and Priya explain what to look out for to avoid dangerous deadly moles.\n\nCaroline, 25, has hidden her hair loss problem for over 10 years. She’s been losing hair in patches that take up to a year to grow back. Caroline has a condition called Alopecia, and Dr Christian gives her the unfortunate news that there is no known cure for her problem. Possible treatments to control the hair loss are steroids or topical creams that stimulate hair growth.\n\nAnd finally this week, Dr Pixie and Dr Christian put their bodies on the line to show how easy it is to do body checks. This time around, they are checking their urine for any signs of abnormalities and ill health.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-05-20",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771094,
                    "name": "Erectile Dysfunction",
                    "overview": "This week’s episode starts with a visit to the clinic for former RAF airman Richard, whose case of gynaecomastia has left him with no body confidence and feeling repulsed when he looks in the mirror. After 26 years of suffering, Dr Pixie decided to send Richard for surgery to get rid of them once and for all.\n\nNext into the Doctors’ mobile clinic is 16-year-old Wendy, who after recently giving birth has been left with severe stretch marks on her tummy. Vitamin E creams and Bio Oil are recommended by Dr Pixie as a way of reducing the marks that will also fade over time. A case of excessive sweating has left one woman feeling extremely embarrassed, but Dr Christian reassures her that there are multiple treatments available for this common condition.\n\nEB Dentist Dr James Russell has a case in his surgery involving bulimia sufferer Harriet. Self-induced vomiting has left her with acid erosion on her teeth, shortening and eating away at the enamel. Porcelain veneers can be used to extend and protect her remaining teeth, but Harriet decided to wait before proceeding with the full treatment.\n\n18-year-old student Clare has come to the clinic with some problem bowels that mean that she can go a week without passing a stool, but this is swiftly followed by excessive diarrhoea and stomach cramps. Dr Pixie excludes the possibility of haemorrhoids, but decides to send a stool sample of to be analysed. Having eliminated all other possibilities, Dr Pixie makes a diagnosis of IBS.\n\nNext through the clinic doors is Alan, who has been battling with erectile dysfunction for nearly 10 years. Dr Christian recommends that Alan starts by losing some of his excess weight, before he is sent off to a specialist to check out the problem. The specialist recommends a number of possible non-surgical treatments, including a penis pump.\n\nDr Pixie sees a patient with an enlarged stomach whose GP has already eliminated a number of potential conditions. Despite losing weight Stuart still has a large belly, and so is sent for an ultrasound scan. The results of the scan are inconclusive, suggesting that dietary and lifestyle changes are the best course of action.\n\nDr Priya sees a patient who’s complaining of pain in her vulval area, which appears to be caused by the condition vulvodynia. Over 15% of women suffer from it, but over 50% of these sufferers don’t seek help.\n\nFinally through the clinic door is veterinary nurse Terry, who’s suffering from a condition called “Paprika Staining”: on his legs and ankles that leaves him with rust coloured marks. Dr Christian reassures him that there is nothing to be worried about, but there is also unfortunately no cure…\n\nAlso this week, Christian and Pixie hit the streets of Newcastle to discuss Erectile Dysfunction, whilst Christian puts himself, and his sperm, under the microscope, whilst also investigating the growing problem of fake pharmaceuticals, particularly targeted at ED sufferers. We also have our body check group conducting a thorough examination of their mouths.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-05-27",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771095,
                    "name": "Back to the Clinic",
                    "overview": "First up is Maria, who came to the clinic with a potentially life threatening weight problem. Although very young, Maria’s health was deteriorating so rapidly that a gastric band operation was carried out. Having reduced her stomach to the size of a walnut, Maria returned to the clinic to reveal that she had dropped over 4 stone in just 10 weeks. 8 months later, and Maria had dropped a further 4 stone, and been able to start work in a local hair salon.\n\n53-year-old Christopher came to the clinic with a painful problem with his penis. Following a years treatment by a dermatologist, Christopher returned to the clinic with some good news for Dr Christian. Having been diagnosed with an atopic dermatitis, Christopher has responded well to treatment and now has ‘a normal penis’.\n\nWe next catch up with Emma, who had suffered for over a decade with facial hair growth. Following 6 rounds of lazer treatment on the problem hairs, Emma is finally feeling like a women again, with her confidence massively boosted.\n\nIn our first series we met Margaret, who was suffering from a prolapsed vagina. Extensive surgery was required to rebuild her vaginal wall, and following the operations success, Margaret returned to the clinic to share how things were progressing. With her life back on track, Margaret is now able to exercise and do all the things her prolapse had denied her.\n\nNext up, Dr Dawn meets up with a patient that she first saw in the clinic in Magaluf. Marissa suffered with acne on her face and forehead, and despite 9-months of antibiotic treatment, she is still suffering from the dreaded spots. Dr Dawn suggest a course of photopneumatic therapy, where a lazer and a vacuum are used to loosen and extract dirt and excess oil from the skin. Following three courses of treatment, Marissa was feeling a lot happier.\n\nMany people think that sunbathing is a cure for acne, but too much sun can be extremely dangerous, and in our Teenage Bodies series we investigated a growing problem of ‘tanorexia’ which had led 16-year-old Sammy Jo to spend far too much time on the sunbeds. On a revisit to the clinic, Sammy Jo has revealed her addiction has now switched to the bottle – but fortunately it’s a bottle of spray tan.\n\n26 year-old David came to the clinic with a massive amount of excess skin that was leftover from his overweight teenage years. David underwent surgery to remove his man boobs, and the results have left him with not only a flat chest, but a new lease of life. After the success of this operation, David is considering the next stage of removal of his excess stomach skin as well…\n\nAnd finally there was Charlotte, who at only 19 was suffering from an extreme case of excessive sweating. With other treatments not working, Charlotte was sent for a painful series of botox injections. 6-months on, the initial treatment has worn off, leaving Charlotte with a return trip to the clinic. Fortunately, the treatment works again, leaving Charlotte sweat free to pursue her dream of becoming cabin crew…",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-06-03",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 771096,
                    "name": "Oral",
                    "overview": "First up, is 26-year-old David whose rotting, bleeding, puss-filled armpit has left him unable to lift up his arm without tearing the skin. The problem is diagnosed as Hidradenitis Suppurativa, a condition in which the sweat glands are blocked up, infected and develop into boils. Dr Christian sends a swab sample for analysis to reveal the bacteria infecting David, in order to prescribe the appropriate antibiotics. In the meantime, David is told to take steroids to help contain the symptoms and has been referred to a surgeon to see what can be done about the damaged skin.\n\nThe EB Bus heads out to Cambridge, and first to see Dr Pixie is Lucy who has a problem growing hair, whilst Dr Christian sees a 3-year-old that has problems staying on her feet. Meanwhile, Dr Priya meets a footballer whose passing is not being helped by a curling toe.\n\nNext up there is David who consults with Dr Christian about pains in his penis and lower back. Believing that the pain is stemming from his nerves, Dr Christian recommends acupuncture treatment.\n\nDr James meets 35-year-old rocker Neil whose teeth are hanging on by a thread as a result of advanced gum disease. Dr James saves many of Neil’s teeth by restoring them with porcelain crowns, but the teeth that couldn’t be saved have to be replaced with dentures. \n\nThe doctors hit the streets of Cambridge to conduct a breath test and teach the locals about better oral hygiene. Wendy has been suffering from bad breath and heads to see a specialist that finds the root of the problem – gum disease. \n\nIf you want to find an NHS Dentist in your area then use the NHS Service Finder\n\nVisiting the clinic next is Stacy, who has a problem with piles. Dr Priya examines Stacy and discovers that she’s also suffering from skin tags. As other treatments have thus far failed, Dr Priya suggests a visit to the surgeon to have both the skin tags and the piles removed. There is also a visit from Allison, a newlywed from Lancashire who is experiencing pain during sex. Dr Pixie’s examination doesn’t reveal anything sinister with Allison’s body and so she recommends psycho-sexual counselling to try and get to the root of Allison’s problem.\n\nNext up we see 24-year-old Holly who has come to see Dr Pixie about her sweaty palms. As botox injections are ineffective for palmar hyperhidrosis, a procedure utilizing electric currents is suggested. Holly’s iontophorisis treatments show significant improvements and the good news is that she can get a machine at home to continue with these treatments on a permanent basis.\n\nAnd finally, after conducting a sweat test after his own workout, Dr Christian meets up with the Cambridge University boat race team to calculate their sweat rates and help work out how much water they need to keep themselves healthy and hydrated. You can conduct your own sweat test at home by checking out our Sweat Body Check",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-06-10",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 771097,
                    "name": "Rally",
                    "overview": "The doctors are back in the clinic to check-up on some of the most interesting cases that they’ve encountered over the past 2 years.\n\nDr Dawn asks Scotsman John back to the clinic to update her on progress with his treatment for the disfiguring condition Acne Keloidalis. It had left John with painful nodules on the back of his head and some severe scarring, forcing him to not go out in public without a baseball cap. Thanks to some extensive treatment from Consultant Dermatologist Dr Sunil Chopra, John’s condition has improved beyond all recognition, leaving him with a full head of hair and brimming with confidence.\n\nConfidence, or lack of it, was what drove 16-year old Nathan to visit the EB clinic with some severe pubescent acne. With home treatments not proving effective, Dr Dawn referred Nathan for hydra-dermabrasion, a procedure that removes impurities and lessens the scarring caused by acne. Following treatment Nathan’s acne: has improved dramatically, ensuring that he can hopefully avoid the painful physical and emotional scarring that it can cause, something that another of Dawn’s patient, Haileigh, knows about only too well.\n\nHaileigh has suffered with severe acne for 28 years and it has left her with deep, pitted scars all over her face. After over a year of intensive skin treatment, including lazer resurfacing and dermal injections, Haileigh is showing considerable signs of improvement.\n\nA patient whose life has been totally changed by her treatment by the Embarrassing Bodies Doctors was Dionne, who arrived in the clinic with a mystery skin condition that numerous specialists had failed to diagnose. Dr Harper suspected that it was a condition called Ichthyosis, where her skin was becoming dry, scaly and cracked. Having treated her condition with a prepared solution of Cetraben, Culmurid & Eucerin, combined with wrapping in cling film, Dionne is problem free and only occasionally has to repeat the treatment to prevent future flare-ups.\n\nDr Christian also catches up with Anna, who came to the clinic with extremely deflated breasts following her pregnancy. With her confidence low Dr Christian sent her for a consultation with a cosmetic surgeon to discuss a breast augmentation operation. Having decided to go ahead with the surgery, Anna returns to the clinic to report that her confidence has skyrocketed since the operation, making the extensive surgical risks worthwhile on this occasion. \n\nAnother patient who’s back in the clinic is Pamela, who came to see Dr Christian with stress incontinence, a very common problem that affects millions of women in the UK. Pamela’s case was extremely severe, so Dr Christian recommended a botox treatment that would treat, though not cure, her overactive bladder. Having successfully undergone the treatment, Pamela returns to let Christian know how she’s been getting on, and though the results were not permanent, she has seen a massive improvement.\n\n34-year old Sophia came to the clinic with a skin condition that Dr Pixie diagnosed as hyper-pigmentation caused by excessive hair growth. Having undergone lazer treatment and glycolic peeling, Sophia returns to the clinic to show a marked improvement in the colour and severity of her condition.\n\nFinally, Dr Christian sees a patient who decided to undergo a testicle implant operation to balance out his balls after losing one of them to testicular cancer, and also caught up with 13-year old Anthony, who was suffering with gynaecomastia, brought on by puberty and some excess weight. Dr Christian is delighted to see that Anthony has shed over 2 stone in weight, and is well on the way to getting his problem off his chest.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-06-17",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 771099,
                    "name": "Back to the Clinic 2",
                    "overview": "The doctors are back in the clinic to check-up on some of the most interesting cases that they’ve encountered over the past 2 years.\n\nDr Dawn asks Scotsman John back to the clinic to update her on progress with his treatment for the disfiguring condition Acne Keloidalis. It had left John with painful nodules on the back of his head and some severe scarring, forcing him to not go out in public without a baseball cap. Thanks to some extensive treatment from Consultant Dermatologist Dr Sunil Chopra, John’s condition has improved beyond all recognition, leaving him with a full head of hair and brimming with confidence.\n\nConfidence, or lack of it, was what drove 16-year old Nathan to visit the EB clinic with some severe pubescent acne. With home treatments not proving effective, Dr Dawn referred Nathan for hydra-dermabrasion, a procedure that removes impurities and lessens the scarring caused by acne. Following treatment Nathan’s acne: has improved dramatically, ensuring that he can hopefully avoid the painful physical and emotional scarring that it can cause, something that another of Dawn’s patient, Haileigh, knows about only too well.\n\nHaileigh has suffered with severe acne for 28 years and it has left her with deep, pitted scars all over her face. After over a year of intensive skin treatment, including lazer resurfacing and dermal injections, Haileigh is showing considerable signs of improvement.\n\nA patient whose life has been totally changed by her treatment by the Embarrassing Bodies Doctors was Dionne, who arrived in the clinic with a mystery skin condition that numerous specialists had failed to diagnose. Dr Harper suspected that it was a condition called Ichthyosis, where her skin was becoming dry, scaly and cracked. Having treated her condition with a prepared solution of Cetraben, Culmurid & Eucerin, combined with wrapping in cling film, Dionne is problem free and only occasionally has to repeat the treatment to prevent future flare-ups.\n\nDr Christian also catches up with Anna, who came to the clinic with extremely deflated breasts following her pregnancy. With her confidence low Dr Christian sent her for a consultation with a cosmetic surgeon to discuss a breast augmentation operation. Having decided to go ahead with the surgery, Anna returns to the clinic to report that her confidence has skyrocketed since the operation, making the extensive surgical risks worthwhile on this occasion. \n\nAnother patient who’s back in the clinic is Pamela, who came to see Dr Christian with stress incontinence, a very common problem that affects millions of women in the UK. Pamela’s case was extremely severe, so Dr Christian recommended a botox treatment that would treat, though not cure, her overactive bladder. Having successfully undergone the treatment, Pamela returns to let Christian know how she’s been getting on, and though the results were not permanent, she has seen a massive improvement.\n\n34-year old Sophia came to the clinic with a skin condition that Dr Pixie diagnosed as hyper-pigmentation caused by excessive hair growth. Having undergone lazer treatment and glycolic peeling, Sophia returns to the clinic to show a marked improvement in the colour and severity of her condition.\n\nFinally, Dr Christian sees a patient who decided to undergo a testicle implant operation to balance out his balls after losing one of them to testicular cancer, and also caught up with 13-year old Anthony, who was suffering with gynaecomastia, brought on by puberty and some excess weight. Dr Christian is delighted to see that Anthony has shed over 2 stone in weight, and is well on the way to getting his problem off his chest.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2009-07-01",
                    "episode_number": 11,
                    "episode_type": "finale",
                    "id": 771098,
                    "name": "Back to the Clinic 3",
                    "overview": "The doctors are back in the clinic to check-up on some of the most interesting cases that they’ve encountered over the past 2 years.\n\nFirst up is a visit from fifty year old Jackie, who was suffering from one of the commonest problems seen by GPs – urinary incontinence. A staggering one in five women over the age of 40 will suffer from the condition. Fortunately there was a simple solution to Jackie’s problem, as tension free vaginal tape was added to support the bladder and replace the muscle that she has lost as she got older.\n\nThe doctors also caught up with 72-year-old Bryan, who had been suffering for over 10 years with a painful problem with his penis, a direct result of a circumcision that hadn’t gone to plan. Bryan is packed off by Dr Christian to have a second circumcision carried out, and returns to the clinic two years later to check that Bryan is still firing on all cylinders following the opp.\n\nDr Dawn next sees a patient whose life was literally torn apart by the birth of her baby boy. Debbie’s vagina was so badly torn during the birth, that the muscles around her bladder and rectum were causing her to leak urine and faeces. After a massive reconstruction operation, Debbie returns to see Dr Dawn, who is delighted to see that she is feeling just like a young mum again.\n\nOur next patient is Rachel, who has suffered from plaque psoriasis for over 11 years. Rachel’s skin cells were reproducing every 2-6 days, which compared alarmingly to a normal person’s rate of every 3-4 weeks. Christian sent Rachel for ultraviolet light therapy, which even after a few treatments was starting to show positive signs. Returning 18-months on, Rachel’s skin is vastly improved and her life has completely changed.\n\nAnother patient who returns to the clinic was Martin, who has undertaken a course of cognitive behavioral therapy to help him to get over his fear of taking a pee in public. Fortunately Martin’s therapy has been a success, and he’s making fantastic progress.\n\nNext there are visits from Dr Christian and Dr Dawn to the men of Moseley Rugby Club and a group of women who have shame in baring all. They’re shown how to self-check their balls and their boobs, and you can too by going to our How to Check Yourself guides >>\n\nBoobs were a problem for Alison, who after 20 years of suffering awful back pain from her double J boobs, came to visit Dr Dawn to see if she could get something off her chest. After surgery that removed a kilo and a half of breast tissue, Allison returned to the surgery with a new lease of life.\n\nDr Dawn caught up with Adel, who came to the clinic with a condition called polycystic ovary syndrome. This has resulted in Adel developing excess hair on her face and body, so Dr Dawn sent her off for a course of lazer treatment. Eight months later, Adel is back in the clinic and showing a fantastic improvement. Though the hairs will continue to grow back, she now knows that she can keep the condition under control…\n\nAnd our final patient also came into the clinic with a breast related problem, this time caused by an earlier breast reduction that had left her with artificially high nipples now that nature was taking it’s course. Flattening of the nipples was also a cause for concern for Dr Dawn, so Jacqui was sent for a mammogram to check their was nothing sinister afoot. Fortunately there wasn’t, and she was able to return to the clinic to show how a hydrolonic acid lift had been plump up the breasts and bring the nipples down back to where they belonged.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 44105,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5258a609760ee3466169e9c6",
            "air_date": "2010-02-03",
            "episodes": [
                {
                    "air_date": "2010-02-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771073,
                    "name": "Cardiff",
                    "overview": "In this first episode the team takes to the streets of Cardiff, with the help of dentist extraordinaire James Russell, rounding up ailments left, right and centre but first Dr Christian has a visit at the clinic from ambulance technician Keith. \n\nKeith’s got a rather sensitive penis complaint that he’s keen to sort out. Dr Christian soon diagnoses Peyronie’s disease. Realising the severity of this particular case Dr Christian sees surgery as the only option, and refers Keith on to a neurological surgeon who he hopes can straighten things out. Keith meets consultant urological surgeon Mr. Paul Anderson to discuss options. With advice from his surgeon Keith opts for a Nesbitt’s procedure which removes tissue from the unaffected side of the penis so that things balance out when sewn back up, even if slightly shorter. After a two-hour procedure Keith’s penis is corrected, with Dr Christian recommending that he waits a few months before seeking further treatment for his excess foreskin.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-02-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771074,
                    "name": "London",
                    "overview": "The doctors hit the streets of London to investigate how stress affects so many people's health and their sex lives. They also treat night terrors and problems with recurring mouth ulcers.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-02-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771076,
                    "name": "Brighton",
                    "overview": "The doctors visit Brighton, where they get to the bottom of a bleeding anus and some pus filled tonsils. There's also advice for stag and hen parties on personal hygiene and safer drinking. And Dr Christian meets a patient who wants to have a realistic nipple after losing hers to breast cancer surgery.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-02-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771075,
                    "name": "Hull",
                    "overview": "The doctors head to Hull to set up a breast check clinic. Dr Christian recommends a radical new cure for piles. And Dr Pixie meets a woman who has suffered from sweaty feet for over 20 years.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-05",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771077,
                    "name": "Nottingham",
                    "overview": "It was the busiest day so far for the Embarrassing Bodies mobile clinic as it parked up in the centre of Nottingham. First in to see Dr Dawn was Summer who was being plagued by a thick build up of ear wax. After examination, Dr Dawn notes the excessive build up and advises that cotton buds may be making the situation worse by aggravating her ear canal. She advises a course of ear drops with possible ear syringing if needed.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771078,
                    "name": "Belfast",
                    "overview": "Kirstie, 21, dropped in to see Dr Dawn concerned about her inverted nipples which she’d been suffering with since puberty. Kirstie’s inverted nipples meant that she had been unable to breastfeed her baby and the thought of going through the same pain again was putting her off having more children. Dr Dawn sent her to see breast specialist Dr Yannis Alexandrides who advised a surgical procedure which would give Kirstie a 90% chance of being able to breast feed. Surgery was successful so Kirstie returned to the clinic to show Dr Dawn the vast improvement.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-19",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771079,
                    "name": "Back to the Clinic",
                    "overview": "Bridgid first came to see Dr Pixie in October 2008 with a large vagina caused by excess skin following dramatic weight loss. On examination Dr Pixie also diagnoses the signs of vaginal prolapse. These symptoms were having a severely negative effect on Bridgid’s life – even causing her husband to sleep in a different room. After consultation with specialist Dr Slack, Bridgid’s previous notion that a hysterectomy would fix her problem was proven to only solve part of her discomfort. After further discussion the decision to prescribe a series of injections relieved the symptoms dramatically, however they can only be taken temporarily. Bridget is still consulting her doctor in regards to the best long term treatment options available to her but was feeling far less discomfort and was much happier.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-26",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 771080,
                    "name": "Glasgow",
                    "overview": "The first case for this episode was Ed, who dropped into the clinic to see Dr Christian about an embarrassing problem that was preventing him from having intercourse. Losing 18 stone and undergoing a tummy tuck had left Ed with a vast surplus of excess skin and fat in his groin, almost completely burying his penis and thus limiting his ability to function sexually. Dr Christian sent Ed to a surgeon for further discussions, and he advised a procedure that would lift the excess skin up, effectively freeing the shaft of Ed’s penis which was buried under the folds of excess skin. Having undergone the surgery Ed returned to show the marked improvement in his condition.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-02",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 771081,
                    "name": "Middlesbrough",
                    "overview": "23 year old Claire came to the clinic to discuss her embarrassing problem with Dr Christian. She has a sore labia that has previously swelled up to four times its normal size, and Clare was desperate for some professional advice. On examination, Dr Christian found the right labia minora was much longer than the other so referred Clare to a specialist. Cosmetic surgeon Dr Angelica Kavouni suggested surgery to remove the excess skin and reduce the labia in size. A few weeks later, with Clare rapidly recovering after the successful surgery, she returned to show Dr Christian the results.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-15",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 771082,
                    "name": "Back to the Clinic 2",
                    "overview": "The episode begins with David, who has come to the clinic to see Dr Christian about a troubling skin infection in his armpit. Dr Christian diagnoses the condition as Hidradenitis Suppurativa, caused by blocked sweat glands. Having already tried antibiotics without success, Dr Christian prescribes a temporary treatment of strong steroids, although these do improve the condition they are not a long term solution and David is sent to see a plastic surgeon. At St John’s Hospital in Livingston, David is given a skin graft which completely removes the infected skin and replaces with layers of healthy skin taken from David’s thigh. We revisit a relieved David four months after his surgery to see the condition completely cured.\n\nNext through the clinic doors was a now 9 year-old Nancy, a year earlier Nancy came to see Dr Christian about a large number of warts on her hands. After freezing the warts and prescribing a cream, Dr Christian finds Nancy’s hands are now completely wart free.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-18",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 771083,
                    "name": "Back to the Clinic",
                    "overview": "The UK has the 2nd highest number of teen mums in the developed world. In 2007, 43,000 teens got pregnant, that’s 118 a day! The Embarrassing Bodies team put down the text books and let teen mums tell their stories – which includes excessive farting, piles and contraception",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-25",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 771084,
                    "name": "Back to the Clinic",
                    "overview": "The Embarrassing Bodies team have been trucking around the nation, in Cambridge they met 18 year old Lucy who was suffering from alopecia, or hair loss. Dr Pixie sent Lucy to see hair loss specialist David Lewis. Her scalp and hair was examined using a camera that magnifies the strands 400 times, this allowed David too diagnose Lucy with a hereditary condition that leaves the hair without any cuticle coating, causing breakages and stopping the hair from growing. As there is no cure Lucy was given a complete hair replacement procedure, whereby a new permanent head of hair is glued onto her scalp. To celebrate Lucy really let her hair down!",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-30",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 771085,
                    "name": "Back to the Clinic",
                    "overview": "First up is Janice, who had breast cancer in 1996 and underwent a mastectomy, leaving her with only one breast. Although her left breast was reconstructed, there is a slight asymmetry and she no longer has a nipple. Dr Christian sent her to Consultant Surgeon Dr Jian Farhardi to have her breast implants re-inserted, and a new nipple from Janice’s own breast tissue. Janice returns to the clinic for a check-up, and Dr Christian is delighted to see how effective the surgery has been.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-09-24",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 771086,
                    "name": "Back to the Clinic - Tubular breasts",
                    "overview": "Jane was upset with her asymmetric and droopy breasts and Dr Dawn diagnoses a condition called tuberous breasts, where the breasts appear to be far apart and unusually shaped. Dr Dawn sends Jane to specialist Mr. Patrick Mallucci who decides that surgery would be a viable, effective solution to Jane’s condition. The operation is complex and involves several stages, including the reshaping of the breasts and the insertion of silicon implants. After 4 and half hours Jane’s operation is declared a success and she returns to Dr Dawn to discuss the results. Visibly thrilled with the outcome Jane’s breasts are healing fast and display a marked improvement in symmetry and shape.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-01",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 771088,
                    "name": "Back to the Clinic - Underactive thyroid",
                    "overview": "Another group of patients return to the Embarrassing Bodies clinic, starting with 38-year-old Lois who has suffered from persistent thrush like symptoms for over 9-years. Dr Christian suspects that something else might be causing the infection. After a consultation with a specialist, the skin condition psoriasis is diagnosed – but an under active thyroid is found to be the ultimate cause, and treatment quickly leaves Lois on the road to recovery.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-08",
                    "episode_number": 16,
                    "episode_type": "finale",
                    "id": 771087,
                    "name": "Back to the Clinic - Peyronie's disease",
                    "overview": "Keith arrives in the clinic with a rather sensitive penis complaint that he’s keen to sort out. Dr Christian soon diagnoses Peyronie’s disease. Realising the severity of this particular case Dr Christian sees surgery as the only option, and refers Keith on to a urological surgeon who he hopes can straighten things out. Keith meets consultant urological surgeon Mr. Paul Anderson to discuss options. With advice from his surgeon Keith opts for a Nesbitt’s procedure which removes tissue from the unaffected side of the penis so that things balance out when sewn back up, even if slightly shorter. After a two-hour procedure Keith’s penis is corrected, with Dr Christian recommending that he waits a few months before seeking further treatment for his excess foreskin.\n\nAfter a follow up consultation Keith is sent for a circumcision to deal with the extra skin following the reduction in penis size.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 44104,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "5258a609760ee3466169ea18",
            "air_date": "2011-01-17",
            "episodes": [
                {
                    "air_date": "2011-01-17",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771102,
                    "name": "Spain",
                    "overview": "This week the Embarrassing Bodies team are scouring the beaches, both home and away, to find some embarrassing beach bodies. First into Costa del Sol’s Clinic is Russell whose huge hernia stops him from enjoying the summer sun. A hernia happens when an internal organ pushes through muscle weakness.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-02-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771103,
                    "name": "Weston-super-Mare",
                    "overview": "Kicking things off this week is Oisin, who is visiting the Embarrassing Bodies Clinic with a skin condition that causes tumours to appear all over his body. This condition is known as type 1 Neurofibromatosis, a rare genetic disorder that affects the nervous system.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-02-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771104,
                    "name": "Scarborough",
                    "overview": "This week the Embarrassing Bodies team are taking their services north, to the seaside town of Scarborough. The first patient through the door is 26 year old Russell, who has put up with an oozing and painful ulcer on his shin ever since a biopsy left an open wound two years ago. Enter Dr Dawn, who takes a swab from his leg and predicts that hospital treatment will be needed. Professor Val Edwards-Jones identifies the staphylococcal aureas organism in her analysis of the sample. While this explains the smelly discharge from Russell’s leg, he is referred to an immunologist to try and establish the cause of the problem. Russell sees an immunologist and a dermatologist, who determine that pyoderma gangrenosum syndrome is responsible for his leg ulceration. Immune cells have been attacking Russell’s skin and the condition has been complicated by his poor immune system being unable to deal with the added bacterial infection. Russell is told that there are probably only around 30 people in the world who have had this problem. He goes into hospital for two weeks, followed by six months of injecting antibiotics at home.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-02-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771105,
                    "name": "Wakestock",
                    "overview": "First into the clinic is 50 year old Mark, who after 30 years of putting up with phimosis (a tightening of the foreskin around the penis) has finally decided to seek help. This condition affects around 10% of uncircumcised men and Dr Pixie advises Mark to visit a urologist to decide which treatment would be best, which can include the use of steroid creams, stretching methods and circumcision. Mark opts for circumcision and joins the 12,200 men who have this procedure for medical reasons every year. It is a simple operation where the doctor removes the foreskin, keeping the glans permanently exposed and now Mark is able to have sex without experiencing any pain at all.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-02-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771106,
                    "name": "Pregnancy",
                    "overview": "There's a fertility theme in the clinic this time as Dr Pixie investigates why one woman who's hoping to conceive has intense pain during sex, and why another woman seems to have a baby bump, although she isn't pregnant.\n\nOut on the road, Dr Christian makes a rare home visit to meet a newborn with a club foot, while the mobile clinic reaches Llandudno in North Wales where the doctors advise on a breast feeding nipple dilemma.\n\nAnd Dr Dawn arranges a photo-shoot for three gorgeous, heavily pregnant women to explore the medical myths and reality of having a baby.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-04",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771107,
                    "name": "Thorpe Park",
                    "overview": "Dr Pixie meets a woman with a pair of testicle-like cysts on her head. Dr Christian deals with a young woman suffering from incontinence.\n\nDr Dawn helps a man who just can't hold on to his leaking bowels.\n\nThe mobile clinic seeks out Britain's biggest thrill seekers at Thorpe Park.\n\nDr Christian goes to war on falling male fertility rates, testing a group of paintballers.\n\nAnd the show meets a man whose cerebral palsy hasn't stopped him from carving out a career making people laugh.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-11",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771108,
                    "name": "Great Yarmouth",
                    "overview": "Dr Christian meets a girl with asymmetric breasts and looks after a man whose penis has curved right around, while Dr Pixie takes on a shocking case of painful scalp pustules. \n\nThe mobile truck reaches Great Yarmouth where the doctors discover why curry helps a man with a painful bottom. Then Dr Dawn and Dr Pixie both put their own bodies on the line as they undergo different types of mammograms to test for breast cancer. \n\nAnd, in the series' ongoing celebration of extraordinary people, the programme features a man with narcolepsy to discover what life is like when you can't help nodding off.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-25",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 771109,
                    "name": "Periods",
                    "overview": "Dr Pixie sees a man who's struggled with an itchy bottom for 20 years while Dr Christian deals with an enormous pair of breasts\n\nDr Dawn talks periods with three young women who volunteer to measure their own menstrual flow to assess what's constitutes a normal amount.\n\nThe doctors meet a man who can't stand the sight of his own reflection.\n\nThe mobile clinic arrives in the Welsh seaside town of Llandudno ready to sort out some bothersome boils and investigate the nose and ear picking habits of local residents.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-01",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 771110,
                    "name": "Spain",
                    "overview": "The clinic meets a man with a large lump in a private place, a woman with an embarrassing vaginal discharge, and a case of a hairy female bottom.\n\nThe nation's favourite doctors return to the Costa del Sol to tackle more embarrassing beach body problems, and waiting to see them in the mobile clinic is David, who is worried about a large lump on his testicle. \n\nAnd all three doctors are on the beach to remind holidaymakers of the dangers of fun in the sun.\n\nBack in the UK, the show meets a man who has to breathe through a hole in his neck.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-08",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 771111,
                    "name": "Back To The Clinic",
                    "overview": "When Maria first came visited the clinic in 2009 she was very embarrassed about the excess hair she had developed on her face and back. However, this was not just a physical problem for Maria, as this embarrassing hair growth has caused her problems at school and had severely knocked her confidence. After Dr Pixie referred Maria to a specialist, she found out that she had polycystic ovary syndrome, a condition that needs to be controlled with medication for life. Thankful that the cause had finally been identified, Maria was still anxious to have her hair removed as quickly as possible whilst waiting for her treatment to take effect. She was treated with a series of laser treatments to remove the hair and to stop it from growing back, and over a year later the results are amazing. She is now a lot more confident and now feels she can talk to people without feeling embarrassed.\n\n5% of men are more likely to check symptoms that are worrying them on the internet, than they are going to their GP. Thankfully, Ed put aside his embarrassment to see Dr Christian at the clinic with his penis problem. After losing 19 and a half stone in weight, Ed had been suffering from a buried penis which made having sex and going to the loo very problematic. After seeing a surgeon, Ed had the excess skin removed from around his penis and 6 months later, he is visiting Dr Christian to give him an update on his condition. Ed is very happy with the results, and his confidence has 100% improved. But Ed is still having problems with his penis after his operation which he would like sorted out. Ed is having problems when he has an erection due to the tight skin around his penis. Dr Christian identifies the cause of this as the scarring Ed has from his previous tummy tuck which has caused the skin to tighten. Dr Christian advises more surgery to address this problem, but stresses that although this is a routine procedure there are always risks involved with any operation, so any decision has to be thought through carefully. \n\nTo help women get their breast troubles off their chest, Dr Dawn and Dr Pixie set up a special breast awareness mobile clinic. Leah visited the clinic about the discharge and pain in her breast and although Dr Pixie said this blockage was not cancerous, Leah was absolutely right to get it checked out. Breast cancer comes in many forms with the symptoms varying from woman to woman. The main symptoms of breast cancer are lumps, orange peel skin and inverted nipples but any changes in your breast should be looked at. 1 in 8 women are likely to develop breast cancer, and these figures are on the rise so it is important to self check regularly and go to your doctor early if you have any concerns\n\nProstate cancer is the most common form of cancer in men in the UK. When Richard came to see Dr Christian he had just been diagnosed. After having a case of prostatitis, Richard’s doctors found out that he had prostate cancer despite displaying no symptoms of the disease. A few weeks after seeing Dr Christian, Richard had key-hole surgery to remove his prostate and after the analysis on his prostate, he was told that his cancer has not grown outside the prostate. 15 months later, he visits Dr Christian again to tell him that he has been suffering from erectile dysfunction and incontinence after his surgery. But with this operation, it can take up to two years to fully recover, so with time and patience Richard should see an improvement in these symptoms.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-15",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 771112,
                    "name": "Back To The Clinic (2)",
                    "overview": "When Dean first came in to see Dr Dawn he’d been struggling with a bowel problem for over a decade. He’s been spending a total of 3 hours every day on the loo, answering the call of nature ten or twelve times every single day. Worryingly, he’d also been passing blood every time. After a quick examination, Dawn sent Dean to get a gastroscopy – the inserting of a camera into his stomach in order to investigate the problem. With nothing untoward reported Dean had a similar procedure, this time with the camera inserted anally, followed by an ultrasound. It’s this final test that revealed the root of the problem. A fistula on his anal canal had been disrupting the operation of his sphincter muscle. Rather than going under the knife Dean was referred for a course of biofeedback treatment, designed to retrain his bowels through a series of exercises and dietary improvements, coupled with a course of anti-diarrhoea tablets.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-09-12",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 771113,
                    "name": "Doncaster",
                    "overview": "Pixie learns from 58-year-old Brenda that her vanishing vagina has reached sticking point. Christian talks to Slavek, whose droopy face is really starting to get him down. He also attempts to help 69-year-old Brian with his embarrassingly large purple nose protuberance. Dawn talks to Carly who is worried that she could hurt herself or her boyfriend with her sleep walking.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-09-19",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 771114,
                    "name": "Leicester",
                    "overview": "Christian meets 65-year-old post-operative transsexual Jenny-Anne, who explains that even though she has under gone gender reassignment surgery on her genitalia to become a woman, she still feels trapped in the wrong body. Pixie meets 18-year-old Amy whose life-saving surgery for ovarian cancer has left her with an odd shaped bulge. Dawn meets 5-year-old Elliot, who has a strange shaped tongue.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-09-26",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 771116,
                    "name": "Bristol",
                    "overview": "Pixie talks to Michelle, who is traumatised by having to make trips to the toilet. Christian gives Amir a shocking diagnosis after he comes into the clinic with lactating nipples. Joseph shows up at the clinic with two lumps on the shaft of his penis that will have to be surgically removed.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-03",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 771115,
                    "name": "Derby",
                    "overview": "The doctors talk to 26 year-old Jerusha, who suffers from chronic pain in her vagina, 24 year-old Duane, who learnsthat the copious tags on his penis are caused from excessive friction on the area and 36 year-old Adele who has suffered with dizziness for two years. The Embarrassing Bodies truck is in Derby this week where the doctors offer more advise.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-10",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 771117,
                    "name": "Liverpool",
                    "overview": "25-year-old Eniola comes to the clinic unhappy with the way her breasts have grown after she suffered severe burns over her entire body as a baby. Pixie talks to 18-year-old Matilda and learns about her story of being born with a cleft lip and palate. Hayley is suffering with blue varicose veins that are running up her legs and into her vulva.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 771118,
                    "name": "Back to the Clinic (3)",
                    "overview": "Dr Christian asks Steve back to the clinic who was suffering from acute testicular pain. Having had a cyst removed one year ago, the pain has now returned. Following an ultrasound scan, Steve has returned normal results, and he is sent for cognitive behavioural therapy and some anaesthetic injection into the testicle.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 771121,
                    "name": "Back to the Clinic (4)",
                    "overview": "Among the cases revisited this time are a man with severe anal abscesses, a teenager struggling with a diabetes diagnosis and a lad with an overeating condition. John first came to the Embarrassing Bodies clinic with a severe case of anal abscesses. After 15 operations on his anus, John undergoes his final procedure and returns to the clinic to let Dr Pixie know if he's now seen the end to his problem.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 20,
                    "episode_type": "standard",
                    "id": 771120,
                    "name": "Back to the Clinic (5)",
                    "overview": "The Doctors catch up with a case of night terrors, a man with leaking bowels, and a woman with persistent thrush. Josh first came to the clinic suffering from night terrors. With his relationship on the rocks he underwent treatment at a sleep clinic, hoping it could put an end to his troubles. Josh lets Dr Dawn know how he's been getting on.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 21,
                    "episode_type": "standard",
                    "id": 771119,
                    "name": "Back to the Clinic (6)",
                    "overview": "The Doctors revisit Keith, who first came to the clinic with a bent penis caused by Peyronie's disease. Has his problem finally been straightened out? Dr Dawn catches up with Faye, who originally came to the clinic with excessive sweating. Dr Christian revisits Emily, a young girl who was suffering for years with a bowel problem. And Caroline, who first came to the clinic with alopecia, calls back in with news of a surprising solution to her problem.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 22,
                    "episode_type": "standard",
                    "id": 771122,
                    "name": "Back to the Clinic (7)",
                    "overview": "The doctors revisit Maria, a young woman with a hairy face and body, and Ed, who previously needed help to uncover his buried penis. Christian, Dawn and Pixie have seen more than 400 patients in the Embarrassing Bodies clinic as part of their mission to get the nation to seek help for all those embarrassing conditions we prefer to keep under wraps. In this episode they catch up with some of their most memorable patients. Also, Dr Dawn reminds viewers of the life-saving importance of women stripping off regularly to check their breast for lumps - even going so far as to demonstrate a mammogram herself.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 23,
                    "episode_type": "standard",
                    "id": 771124,
                    "name": "Back to the Clinic (8)",
                    "overview": "The doctors catch up with a woman who had excessive facial hair, and another with an inverted nipple. And Dr Christian gives an update on how young men should check for testicular cancer.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 24,
                    "episode_type": "standard",
                    "id": 771123,
                    "name": "Back to the Clinic (9)",
                    "overview": "Christian, Pixie and Dawn catch up with some of the most memorable cases from the award-winning series. From troubles down below to bulging bellies, the doctors give an update on the ongoing treatment of patients who return for their final check-up.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 25,
                    "episode_type": "finale",
                    "id": 771125,
                    "name": "Back to the Clinic (10)",
                    "overview": "Stewart and Christine first stepped into the clinic with a combined weight of 52 stone; now they've had life-changing stomach surgery they return to see if they've lost weight. Dr Dawn meets Glen, who originally came into the clinic because his incredible 20 stone weight loss had left him with a large amount of excess skin. Glen used to feel that he was a prisoner in his own body, so will a procedure to remove the unwanted skin finally leave him feeling more positive? After three caesarean sections, 33-year-old Lynsey was left with a scar acting like a tight belt between an overhang of tummy and a bulge of fat in her pubic area, which made the most private of moments an embarrassing ordeal. Dr Christian advised her to see a hypnotherapist to lose more weight before having surgery, but has Lynsey regained her confidence? Meanwhile, Dr Pixie measures men's waists, and Dr Christian tests the relationship between erectile dysfunction and obesity with a sleep experiment.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 4,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "",
            "id": 44107,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "5258a60a760ee3466169ea32",
            "air_date": "2012-03-05",
            "episodes": [
                {
                    "air_date": "2012-03-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771126,
                    "name": "Thailand",
                    "overview": "Tropical disease specialist Dr James Logan joins the team. Dawn and James travel to Thailand to look for embarrassing souvenirs Brits could be bringing home with them after a trip overseas. James infests himself with parasitic hookworm. In the United Kingdom, Pixie talks to Carol who has an addiction to coffee enemas. Christian attempts to help a woman who was one of the first to have breast enhancement surgery.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771127,
                    "name": "Thailand (2)",
                    "overview": "James continues his experiment of living with hookworm inside his intestine. Christian attempts to help a woman who had some botched cosmetic surgery in Thailand. Pixie talks to a patient whose huge breasts are ruining her life. Caroline's diabetes is damaging her sex life.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771128,
                    "name": "Ibiza",
                    "overview": "Christian is on the party island of Ibiza attempting to tackle the issues of too much sun, sea and sex. Back home, Dawn meets a man whose buried penis is causing problems going to the toilet. Pixie meets a young girl with an extreme case bad breath caused by swollen tonsils. James the dentist is back to treat different dental disasters.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771129,
                    "name": "Skegness",
                    "overview": "This week Christian attempts to help a patient with a vasectomy. Dawn talks to a woman whose bowel condition has left her with really bad stomach scars. The seaside tour stops at Skegness, where the team attempt to help a man with a wriggly bottom and another man with a worrying lump on his testicles. Christian asks a team of BMX bikers to produce some sperm samples.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771130,
                    "name": "Stockton",
                    "overview": "52 year old Patrick visits Dr Pixie about problems with anal leakage. Dr Pixie refers him to a consultant surgeon to find out what the cause is. The consultant discovers that Patrick has a limited diet which is very low in fibre, causing severe constipation. He is then referred to a dietician for advice on improving his situation by changing what he eats. Specifically the dietician recommends Patrick eats more fibre and drinks more fluids. On his return to the clinic he tells Dr Pixie there has been a big difference and he is able to do more than he used to.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-09",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771131,
                    "name": "Tamworth",
                    "overview": "The team are in Tamworth this week , where Pixie attempts to help a man whose bottom wound hasn't healed in six years. Christian talks to a woman with a mysterious whistle. Pixie pays a visit to a pop festival in Staffordshire, where microbiologist Professor Val conducts a forensic examination of the toilets. Dawn offers her top tips on nipples.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-16",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771132,
                    "name": "Brighton",
                    "overview": "Ian sees Dr Pixie about some side effects he has suffered after slimming down. He weighed 27 stone and his rapid decline in weight has left him with a lot of excess skin on his chest and abdomen. The saggy situation is affecting his sex life because he has a large flap of skin and fat covering his penis. Dr Pixie refers him to a plastic surgeon because the skin has stretched too far to heal itself and will need to be removed. The surgeon removes skin and fat from his chest and abdominal area in a major operation lasting over three hours. During the operation about a stone in weight is removed from Ian’s body. Once healed he’s thrilled with the results and says he can now go running and swimming, activities that were previously physically impossible.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-23",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 771133,
                    "name": "Wickerman Festival",
                    "overview": "Caro visits Dr Christian at the clinic. For eight years Caro’s eyelid has been closed over. It started bleeding from the corner and has become progressively worse: lumpier, redder and it bleeds regularly. Dr Christian diagnoses it as arteriovenous malformation (AVM). This condition is essentially an overgrowth of blood vessels and can occur anywhere in the body. It’s very rare in the eyelid. Treatment is highly risky so close to the eye, so Dr Christian sends Caro to Mr Omar Durrani at the Birmingham Eye Hospital for more tests. Mr Durrani presents one option as being major surgery that would solve the problem but runs a 30% risk of damage to Caro’s eyesight. Caro goes for an angiogram from Dr Saleh Lamin. The procedure shows that her AVM can be treated without major risk to her eyesight, so Caro can now make a decision about what course of action to take, without the stakes being quite so high.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-30",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 771134,
                    "name": "Lumps And Bumps",
                    "overview": "Nine months after they first met, the team catch up with the woman who had two large cysts on her head. Dr Dawn is in the Costa del Sol to see a man with a massive hernia. Dr Pixie revisits a woman who picked food out of the pits of her tonsils.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-07",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 771135,
                    "name": "Best Of Breasts",
                    "overview": "The team revisits memorable cases, including a man leaking milk. There's also transgender Jenny-Anne on her wedding day. And Dr Dawn and Dr Pixie show how to self check for breast cancer and which lumps to worry about and what to get checked out.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-11",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 771136,
                    "name": "Under the Skin",
                    "overview": "The doctors catch up with some of the show's most sensitive and scabby cases, all of them concerning the skin, from oozing, smelly underarms to a bottom wound that wouldn't heal. Dr Pixie catches up with a man who, having lost ten stone, went under the knife to deal with the problem of excess skin. Dr Dawn hits the beaches of Thailand to discover how a tropical skin complaint can turn into a holiday horror story. She also helps beach lovers keep watch on their moles. And Dr James Logan recruits Dr Dawn and Dr Christian to find out just what happens when 50 mosquitoes start munching on the skin.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-24",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 771137,
                    "name": "Under the Knife",
                    "overview": "The doctors catch up with some of the people who have come to the clinic looking for post-op help. For many ailments, surgery is the only answer. But sometimes surgery goes wrong. Dr Christian catches up with one of the first generation of women to have a boob job back in the 70s. Having followed the dramatic reconstruction of her breasts he returns to see the final 'cherry on the cake', with the making of her new nipples. Dr Pixie catches up with a man reeling from the results of surgery on his bottom. Dr Dawn meets woman who was left with terrible tummy scars. And Dr Christian advises some bold BMX bikers how best to keep your semen in tip-top health.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-02",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 771138,
                    "name": "About Face",
                    "overview": "The doctors catch up with some of the most memorable problems involving the face. Dr Christian continues the story of a woman who opts for radical surgery hoping to see the end of her facial malformation. Dr Pixie catches up with mother of two who's on the mend after an extreme bout of teenage acne left her in despair. And Dr Dawn meets a woman whose face takes a bashing every time she goes to bed. Resident dentist Dr James is at the Stockton weekender flogging the benefits of flossing; and is on hand to help a woman who's badly stained smile has crumbled her confidence. And Dr Pixie has her nasal polyps checked out, a procedure not to be sniffed at.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-09",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 771141,
                    "name": "Live from the Clinic",
                    "overview": "n May and June of this year, nearly a hundred patients consulted Dr Christian Jessen and Dr Dawn Harper for medical advice over the internet. What Happened Next? catches up with a number of patients who took part who have already benefited from the advice or treatment they received. Among the many men and women featured, there's the student rugby player who memorably ripped an intimate piercing, and needed reconstructive surgery on his penis, and the woman who wanted help reducing the size of her particularly large breasts.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-21",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 771139,
                    "name": "Changing Sex",
                    "overview": "Dr Christian revisits two women who have gone to extreme measures to dramatically change their bodies. Their very different personal stories provide an insight into what it means to change sex. The programme follows the women's journeys and the lengths they've gone to in order to achieve their goal - from stories of love and bullying to butchery abroad and eye-watering surgery. Over a year later the programme catches up with them to see how life has changed since being in the clinic.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 16,
                    "episode_type": "finale",
                    "id": 771140,
                    "name": "Stand up to Cancer",
                    "overview": "The doctors Stand Up to Cancer, taking an emotional medical journey with cancer patients. Dr Christian meets Josh, who tragically lost half his face following the diagnosis of a rare cancer, orbital melanoma. He also meets Danny, father of two young boys, who's been diagnosed with bladder cancer at just 39.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 5,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "",
            "id": 44108,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "5258a60a760ee3466169ea40",
            "air_date": "2013-02-18",
            "episodes": [
                {
                    "air_date": "2013-02-18",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771144,
                    "name": "Magaluf",
                    "overview": "The doctors visit the holiday hot spot of Magaluf, where sex goes, booze flows and the sunburn shows. Dr Pixie sees a lad looking for treatment for a bulging ball and Dr Christian meets a girl who needs a helping hand following an awkward climax. Dr Dawn educates the hedonistic holidaymakers about the horrors of a hangover. Back in the UK, Dr Christian meets an extremely brave man who reveals the extraordinary extent of living with half his face missing. Dr Dawn meets a man with a patch on his penis that needs straightening out and Dr Pixie helps a lady whose groin and bottom abscesses are causing constant pain. And Dr James the dentist sees a 32-year-old woman whose thumb sucking habit is affecting both her teeth and her boyfriend's genitals.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 6,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-25",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771143,
                    "name": "Magaluf II",
                    "overview": "Doctors Christian, Dawn and Pixie help with the 132% rise in hospital cases in Magaluf that have resulted from 24-7 partying, petting and drinking. Dr Christian extols the importance of safe sex, and Dr Pixie braves the midday sun to tame the tourists who are burning to be beautiful. In the UK clinic, Dr Pixie helps a man who lost his penis in a childhood car accident, and follows the dramatic reconstruction surgery to make him a new phallus from his own body parts. And this week's unsung heroes of medicine are involved in eye donation.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 6,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-04",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771142,
                    "name": "Caerphilly",
                    "overview": "This week the portable clinic pitches up in Caerphilly, Wales, and Dr Dawn helps a lady who's hiding a secret pain inside her national dress and a man who's been walking through his problems for 20 years. The clinic is open for business meeting brave people sharing their problems, and nothing's left uncovered. Dr Pixie's hit a bump tackling some testicle trouble, Dr Christian meets a woman whose baby bottom burns are still bothering her as an adult, and a lady for whom weight loss has left her nipples near her nether regions; and Dr Dawn has a mystery case of festering feet the likes of which the show has never seen. Dr Christian takes the 'Brain Sex' Challenge to discover if our genital sex really does match up to the way we think. And in the 'Living With' series, the programme features a truly amazing 14-year-old girl with a rare condition called Progeria, which means she's living in the body of a pensioner.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 6,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-11",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771145,
                    "name": "Bristol",
                    "overview": "The doctors bring their portable clinic to Bristol, where the bothersome conditions include rashes, mouth ulcers, excessive sweating, a painful post-pregnancy problem, and excessive body hair. Dr Christian helps a man with a worrying pain down below, while Dr Pixie gets to the bottom of why her patient 'blocks the bog'. Dr Pixie meets a lady whose rosy nose embarrasses her so much she rarely leaves the house. Scientist Dr James Logan returns to investigate the healing power of leeches, allowing his own blood to be sucked in the name of research, while Dr Christian comes up trumps in his quest to educate festival goers on all things flatulent.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 6,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-18",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771146,
                    "name": "Luton",
                    "overview": "The doctors bring their portable pods to the Love Luton festival, where some mysterious cases crop up. There's a young woman with monster bruises that appeared from nowhere and another with unexplained skin patches. Back at the clinic, Dr Dawn treats a lady with a fishy smell, Dr Christian meets a man whose skin-cancer scar has left him looking like a thug, and Dr Pixie helps a chap with a blockage in his waterworks. Dr Christian asks what a transistor radio, a light bulb, a tropical spider, a 12-inch salami and a complete tool set all have in common, as he warns of the dangers of inserting foreign objects into intimate places. Dr Dawn hits 'shag week' at Newcastle Uni. Dentistry with Doctor James, who's tackling more tarnished teeth. And the cameras go behind the scenes of Birmingham's Queen Elizabeth hospital.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 6,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-25",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771147,
                    "name": "Weymouth",
                    "overview": "The portable clinic visits Weymouth, where Dr Dawn meets a man with blood-blisters on his testicles, advises on pubic abscesses and warns of the dangers of dodgy tattoos. Dr Christian meets a man whose prostate cancer treatment has left him with rectal incontinence and a women who is in need of jaw replacement surgery. Dr Pixie sees a 31-year-old with a saggy body and Dr Dawn examines some supersize varicose veins.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 6,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-01",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771148,
                    "name": "Liverpool",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 6,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-08",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 771149,
                    "name": "Sundown",
                    "overview": "The doctors continue to tackle the nation's embarrassing body problems as the portable clinic sets up camp at the Sundown festival in Norfolk. Dr Pixie meets a lad badly bitten by the festival bug, a man with piles and a lady with chronic discharge down below. DJ Pixie plays the body's hits from fanny farts to tinnitus to tell us all how to solve those troublesome sounds, and Professor Val lifts the lid on toilet hygiene, flushing out some frightening facts on what's lurking in festival loos. In the clinic, Dr Dawn comes face-to-face with a girl whose rare genetic disorder has left her with tumours all over her face; Dr Pixie helps a lady with lopsided breasts; and Dr Christian tackles testicle pain when he meets a man who can barely get out of bed. And the Living With series meets the inspirational former England rugby player, Matt Hampson, who, following a rough scrum, suffered a spinal injury that's left him paralysed from the neck down.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 6,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 6",
            "overview": "",
            "id": 44109,
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "_id": "5258a60a760ee3466169ea4b",
            "air_date": "2013-11-05",
            "episodes": [
                {
                    "air_date": "2013-11-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 771150,
                    "name": "The Man with Half a Face",
                    "overview": "Dr Christian tells the incredible story of Eric, who lost half his face to cancer.",
                    "production_code": "",
                    "runtime": 48,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-04-07",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 771151,
                    "name": "Penis Special",
                    "overview": "The doctors unveil their top tips for keeping your penis tip top.",
                    "production_code": "",
                    "runtime": 48,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-04-14",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 771152,
                    "name": "The 36-Stone Woman",
                    "overview": "Can Britain's most extreme weight-loss treatment save 36-stone Patience's life?",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 771153,
                    "name": "Embarrassing Bodies Season 7 Episode 4",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 771154,
                    "name": "Embarrassing Bodies Season 7 Episode 5",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 771155,
                    "name": "Embarrassing Bodies Season 7 Episode 6",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 771156,
                    "name": "Embarrassing Bodies Season 7 Episode 7",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 771157,
                    "name": "Embarrassing Bodies Season 7 Episode 8",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 771158,
                    "name": "Embarrassing Bodies Season 7 Episode 9",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 771159,
                    "name": "Embarrassing Bodies Season 7 Episode 10",
                    "overview": "",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 7,
                    "show_id": 32872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Series 7",
            "overview": "The Embarrassing Bodies docs return for a three-part series of special episodes.",
            "id": 44110,
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        "8": {
            "success": false,
            "status_code": 34,
            "status_message": "The resource you requested could not be found."
        }
    }
}