{"adult":false,"backdrop_path":"/pSCOyP2VKzEmwXmDCjWU0pL0WD7.jpg","created_by":[{"id":943818,"credit_id":"547f6ff4c3a3683da20002ad","name":"Geoffrey Sharp","gender":2,"profile_path":null}],"episode_run_time":[44],"first_air_date":"2010-06-09","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.sciencechannel.com/tv-shows/through-the-wormhole/","id":32900,"in_production":false,"languages":["en"],"last_air_date":"2017-05-16","last_episode_to_air":{"id":1317965,"name":"Is Gun Crime a Virus?","overview":"Every 17 minutes, someone is killed with a gun. It's a wave of violence that political debate can't seem to stop. Is this an epidemic that scientists can help cure? Could gun crime be a virus?","vote_average":8,"vote_count":1,"air_date":"2017-05-16","episode_number":4,"episode_type":"finale","production_code":"","runtime":44,"season_number":8,"show_id":32900,"still_path":"/qapz0RrVDNRGDCOatv7yKV9hgXD.jpg"},"name":"Through the Wormhole","next_episode_to_air":null,"networks":[{"id":226,"logo_path":"/orcpefChr3hPSipPcoYa9gSq7ev.png","name":"Science","origin_country":"US"}],"number_of_episodes":62,"number_of_seasons":8,"origin_country":["US"],"original_language":"en","original_name":"Through the Wormhole","overview":"Hosted by Morgan Freeman, Through the Wormhole explores the deepest mysteries of existence - the questions that have puzzled mankind for eternity. What are we made of? What was there before the beginning? Are we really alone? Is there a creator? These questions have been pondered by the most exquisite minds of the human race. Now, science has evolved to the point where hard facts and evidence may be able to provide us with answers instead of philosophical theories. Through the Wormhole brings together the brightest minds and best ideas from the very edges of science - Astrophysics, Astrobiology, Quantum Mechanics, String Theory, and more - to reveal the extraordinary truth of our Universe.","popularity":18.103,"poster_path":"/6ByR0G9erfhjmrmQCGWGkCwgHfi.jpg","production_companies":[{"id":39950,"logo_path":null,"name":"The Incubator Theater","origin_country":""},{"id":906,"logo_path":"/3nTeqjFy3El5hHQvvyLn6HFz5M4.png","name":"Revelations Entertainment","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"2010-06-21","episode_count":1,"id":44147,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2010-06-09","episode_count":8,"id":44144,"name":"Season 1","overview":"","poster_path":"/sYaDBa2PMb08jvOpnGAU1mb4iFw.jpg","season_number":1,"vote_average":6.7},{"air_date":"2011-06-08","episode_count":10,"id":44146,"name":"Season 2","overview":"","poster_path":"/aegZjjA8UKiKfYahHVpcCGY3bvA.jpg","season_number":2,"vote_average":6.8},{"air_date":"2012-03-06","episode_count":10,"id":44145,"name":"Season 3","overview":"","poster_path":"/A8TfiUs47TVArx0mvxtpQZ8jiwp.jpg","season_number":3,"vote_average":5.5},{"air_date":"2013-03-20","episode_count":10,"id":44148,"name":"Season 4","overview":"","poster_path":"/jfWRAkCYu9aJhbXedtZf2g8iDWJ.jpg","season_number":4,"vote_average":0},{"air_date":"2014-03-05","episode_count":10,"id":61254,"name":"Season 5","overview":"","poster_path":"/5V9gZ4fbacfGHeeKMxZklNWdUoe.jpg","season_number":5,"vote_average":0},{"air_date":"2015-04-29","episode_count":6,"id":66337,"name":"Season 6","overview":"","poster_path":"/jKn5s7CBtosOqILZwnVwG2Sr29I.jpg","season_number":6,"vote_average":0},{"air_date":"2016-08-30","episode_count":4,"id":79703,"name":"Season 7","overview":"","poster_path":null,"season_number":7,"vote_average":0},{"air_date":"2017-04-25","episode_count":4,"id":87805,"name":"Season 8","overview":"","poster_path":null,"season_number":8,"vote_average":6.5}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.698,"vote_count":121,"season_data":{"1":{"_id":"5258a641760ee346616a1bf8","air_date":"2010-06-09","episodes":[{"air_date":"2010-06-09","episode_number":1,"episode_type":"standard","id":771502,"name":"Is There a Creator?","overview":"It's perhaps the biggest, most controversial mystery in the cosmos. Did our Universe just come into being by random chance, or was it created by a God who nurtures and sustains all life? The latest science is showing that the four forces governing our universe are phenomenally finely tuned. So finely that it had led many to the conclusion that someone, or something, must have calibrated them; a belief further backed up by evidence that everything in our universe may emanate from one extraordinarily elegant and beautiful design known as the E8 Lie Group. While skeptics hold that these findings are neither conclusive nor evidence of a divine creator, some cutting edge physicists are already positing who this God is: an alien gamester who's created our world as the ultimate SIM game for his own amusement. It's an answer as compelling as it is disconcerting.","production_code":"","runtime":44,"season_number":1,"show_id":32900,"still_path":"/h1GKIpaGXYQQfJKjOz384FYU3hi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-16","episode_number":2,"episode_type":"standard","id":771503,"name":"The Riddle of Black Holes","overview":"They are the most powerful objects in the universe. Nothing, not even light, can escape the gravitational pull of a black hole. Astronomers now believe there are billions of them out in the cosmos, swallowing up planets, even entire stars in violent feeding frenzies. New theoretical research into the twisted reality of black holes suggests that three-dimensional space could be an illusion. That reality actually takes place on a two-dimensional hologram at the edge of the universe.","production_code":"","runtime":44,"season_number":1,"show_id":32900,"still_path":"/u1xa5h744evrDREmTjL3kw7QLTg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"634ebac1389da10081ce5e45","order":500,"adult":false,"gender":2,"id":1403103,"known_for_department":"Acting","name":"Reinhard Genzel","original_name":"Reinhard Genzel","popularity":0.6,"profile_path":"/zSwmqD9aJSDyopq3JEOKWYp4TF8.jpg"}]},{"air_date":"2010-06-23","episode_number":3,"episode_type":"standard","id":771504,"name":"Is Time Travel Possible?","overview":"Einstein's Theory of Relativity says that time travel is perfectly possible — if you're going forward. Finding a way to travel backwards requires breaking the speed of light, which so far seems impossible. But now, strange-but-true phenomena such as quantum nonlocality, where particles instantly teleport across vast distances, may give us a way to make the dream of traveling back and forth through time a reality. Step into a time machine and rewrite history, bring loved ones back to life, control our destinies. But if we succeed, what are the consequences of such freedom? Will we get trapped in a plethora of paradoxes and multiple universes that will destroy the fabric of the universe?","production_code":"","runtime":44,"season_number":1,"show_id":32900,"still_path":"/gYIzQOLzGoMtqgYmeNXscTy0TmR.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-06-30","episode_number":4,"episode_type":"standard","id":771501,"name":"What Happened Before the Beginning?","overview":"Every cosmologist and astronomer agrees: our Universe is 13.7 billion years old. Using cutting-edge technology, scientists are now able to take a snapshot of the Universe a mere heartbeat after its birth. Armed with hypersensitive satellites, astronomers look back in time to the very moment of creation, when all the matter in the Universe exploded into existence. It is here that we uncover an unsolved mystery as old as time itself — if the Universe was born, where did it come from? Meet the leading scientists who have now discovered what they believe to be the origin of our Universe, and a window into the time before time.","production_code":"","runtime":44,"season_number":1,"show_id":32900,"still_path":"/35eGjnoq3KJ5Azs0GGhmCFMjtHg.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-05","episode_number":5,"episode_type":"standard","id":771505,"name":"How Did We Get Here?","overview":"Everywhere we look, life exists in both the most hospitable of environments and in the most extreme. Yet we have only ever found life on our planet. How did the stuff of stars come together to create life as we know it? What do we really mean by 'life'? And will unlocking this mystery help us find life elsewhere?","production_code":"","runtime":44,"season_number":1,"show_id":32900,"still_path":"/mz9TZFiDS7Pa35hYcWtu5nqUw7J.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-14","episode_number":6,"episode_type":"standard","id":771506,"name":"Are We Alone?","overview":"Aliens almost certainly do exist. So why haven't we yet met E.T.? It turns out we're only just developing instruments powerful enough to scan for them, and science sophisticated enough to know where to look. As a result, race is on to find the first intelligent aliens. But what would they look like, and how would they interact with us if we met? The answers may come to us sooner than we imagine, for one leading astronomer believes she may already have heard a hint of their first efforts to communicate.","production_code":"","runtime":44,"season_number":1,"show_id":32900,"still_path":"/mgNrbRqRlYQEQp1EeK3WlfNXI6s.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-21","episode_number":7,"episode_type":"standard","id":771507,"name":"What Are We Really Made Of?","overview":"Our understanding of the universe and the nature of reality itself has drastically changed over the last 100 years, and it's on the verge of another seismic shift. In a 17-mile-long tunnel buried 570 feet beneath the Franco-Swiss border, the world's largest and most powerful atom smasher, the Large Hadron Collider, is powering up. Its goal is nothing less than recreating the first instants of creation, when the universe was unimaginably hot and long-extinct forms of matter sizzled and cooled into stars, planets, and ultimately, us. These incredibly small and exotic particles hold the keys to the greatest mysteries of the universe. What we find could validate our long-held theories about how the world works and what we are made of. Or, all of our notions about the essence of what is real will fall apart.","production_code":"","runtime":44,"season_number":1,"show_id":32900,"still_path":"/dwl63tbhskV9IlzU7uDLDZdcNTc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-28","episode_number":8,"episode_type":"finale","id":771508,"name":"Beyond the Darkness","overview":"What is the universe made of? If you answered stars, planets, gas and dust, you'd be dead wrong. Thirty years ago, scientists first realized that some unknown dark substance was affecting the way galaxies moved. Today, they think there must be five times as much dark matter as regular matter out there. But they have no idea what it is — only that it's not made of atoms, or any other matter we are familiar with. And Dark Matter is not the only strange substance in the Universe — a newly discovered force, called Dark Energy, seems to be pushing the very fabric of the cosmos apart.","production_code":"","runtime":44,"season_number":1,"show_id":32900,"still_path":"/8BMisxJdxq2aEUbMCIhEEONmaUb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":44144,"poster_path":"/sYaDBa2PMb08jvOpnGAU1mb4iFw.jpg","season_number":1,"vote_average":6.7},"2":{"_id":"5258a641760ee346616a1c0e","air_date":"2011-06-08","episodes":[{"air_date":"2011-06-08","episode_number":1,"episode_type":"standard","id":771524,"name":"Is There Life After Death?","overview":"In the premiere episode of the second season, Morgan Freeman dives deep into this provocative question that has mystified humans since the beginning of time. Modern physics and neuroscience are venturing into this once hallowed ground, and radically changing our ideas of life after death. Freeman serves as host to this polarized debate, where scientists and spiritualist attempt to define 'what is consciousness,' while cutting edge quantum mechanics could provide the answer to what happens when we die.","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/4KqufS6ZI9m30Kumtl7I0VRfJhf.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-06-15","episode_number":2,"episode_type":"standard","id":771525,"name":"Is There an Edge to the Universe?","overview":"It is commonly theorized that the universe began with the Big Bang 13.7 billion years ago. But since we can only see as far as light has traveled in that time, we can't actually make out the edge of the universe. Could it be that the universe is infinite? Is there any way to find out what the shape of the universe really is? Can we find the edge, discover what might lie beyond it, and perhaps even discover a universe next to ours?","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/9cbGG7io9eeBpanWKoB1EsfLzPo.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-06-22","episode_number":3,"episode_type":"standard","id":771522,"name":"Does Time Really Exist?","overview":"It is a question that has vexed philosophers and scientists for centuries; 'What is Time?' Exactly how is our past, present, and future connected by that arrow of cause and effect that we call Time? Is time simply another dimension, just like the dimensions of space we know? Can you run time backwards just as easily as it runs forward, just as left-to-right can swap for right-to-left? If other universes exist, then what is time like in them: could their Time be different from ours? And we'll probe the biggest question about time: Is our future determined? Do we exercise free will? Or, is time merely a dream?","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/pmVsXwfhiJBoXRtcjDm3VvMY9QO.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-06-29","episode_number":4,"episode_type":"standard","id":771519,"name":"Are There More Than 3 Dimensions?","overview":"We move and live in three dimensions: length, width, and height. However, Einstein revealed what was once unimaginable: time is actually a dimension and linked with space itself. To reconcile the massive cosmic and miniscule quantum worlds, physicists are realizing four dimensions may not be enough. They're unraveling up to eleven dimensions. How could this be true? Where could these dimensions be?","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/rBMXOwrdzJjpx4B93VmsrNNsj09.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-07-06","episode_number":5,"episode_type":"standard","id":771521,"name":"Is There a Sixth Sense?","overview":"Can we perceive objects and events beyond the world detected by our five senses? The true limits of our human brain remain a scientific mystery. New studies in neuroscience are showing that our minds can really detect events and objects that our conscious selves know nothing about. Can we predict events in the future? Is there such a thing as a global consciousness? Could physical laws on the cusp of being discovered be at the root of all this?","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/1BwBMNR6f1IGaF0WDHB04Px25Ck.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-07-13","episode_number":6,"episode_type":"standard","id":771527,"name":"How Does the Universe Work?","overview":"Since the ancient Greeks first speculated that everything they observed in reality was the result of the interaction of tiny particles they called atoms, great thinkers have tried to find a single mathematical formula that governs and explains the workings of the entire universe. So far, though, even minds as brilliant as physicists Albert Einstein and Stephen Hawking have been unable to come up with that single grand equation of everything, also known as the theory of everything, or the final theory. Nevertheless, they continue to try, because without that final piece of the puzzle that is reality, the sum total of what we know falls a bit short of making sense.","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/on4ZjhXF63PjT3R1dMiIxQD6urj.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-07-20","episode_number":7,"episode_type":"standard","id":771526,"name":"Can We Travel Faster than Light?","overview":"It's called the speed limit of the universe. Einstein blew all of our minds when he worked out the Theory of Relativity, and showed that space and time were malleable substances. He also theorized that we as humans can never travel faster than the speed of light, which leaves the stars and other galaxies almost impossibly out of our reach. But the dreams of Star Wars and Star Trek are not dead. In fact, there could be ways to travel faster than the speed of light - and some of them are already being tested in labs around the world.","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/q3R10fCreC8GDn8a5dG4CGE4Nyx.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-07-27","episode_number":8,"episode_type":"standard","id":771523,"name":"Can We Live Forever?","overview":"Medical advances have doubled human life expectancy in past centuries. But can humans ever beat death altogether? Can we control and fix the errors that build up in our DNA over the years? Can we find a way to replace the chemistry of life with something more durable? This episode wonders into the mystifying definition of 'eternity' as it relates to human lifespan.","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/ikuisjjCSr3rDHXnWkGe0WiWRHG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-03","episode_number":9,"episode_type":"standard","id":771520,"name":"What Do Aliens Look Like?","overview":"Science fiction writers have always had their little green men. But these humanoid aliens were based soundly on Earth-based life, not any extra terrestrial evidence. Today, we've discovered hundreds of planets around other stars. As we learn what some of these alternative Earths might look like, science and imagination have allowed us to use real science to imagine the biology of their inhabitants. Will they have two eyes? Two legs? What color will their skin be? Which species on Earth can give us clues about likely biology of aliens? And what can we learn from how life on Earth developed to help us understand what ET really looks like?","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/yWL4jZUXpCqdanTzcjEcDa4UGua.jpg","vote_average":4,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-09-04","episode_number":10,"episode_type":"finale","id":771528,"name":"Are There Parallel Universes?","overview":"Most scientists believe that you are not really you, but rather, you all. On the edge of space, buried in a black hole, or right on top of you, there could be an exact copy of yourself living a parallel reality. In those parallel worlds, you may be living your wildest dreams, or your worst nightmares. Finding them is no longer restricted to the realm of science fiction. Recent game-changing theories now suggest that if these worlds exist, intelligent life in these alternative worlds could be trying to send us messages. As scientists further unravel this astounding possibility, a new possibility emerges: the fate of our entire universe may depend on these hidden cosmic twins.","production_code":"","runtime":44,"season_number":2,"show_id":32900,"still_path":"/12b4d6l84Impm3IV5A5v047i9mv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":44146,"poster_path":"/aegZjjA8UKiKfYahHVpcCGY3bvA.jpg","season_number":2,"vote_average":6.8},"3":{"_id":"5258a641760ee346616a1c03","air_date":"2012-03-06","episodes":[{"air_date":"2012-03-06","episode_number":1,"episode_type":"standard","id":771509,"name":"Will We Survive First Contact?","overview":"Mankind longs for proof that we are not alone in the universe, but the moment of first contact will certainly mean the end of the world as we know it. Whether that is a bad thing for humanity or the start of a great future is uncertain.","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/6wID9inOQwZSfZUp5oeYECzZl7l.jpg","vote_average":4,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-06-06","episode_number":2,"episode_type":"standard","id":771510,"name":"Is There a Superior Race?","overview":"How different are the races? Is there even such a thing as race? Could technology create a superior race? The answer may tell us where humanity is headed, what our descendants will look like and how they will think.","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/yzBTd9QKF2opWblN5iM7vInSTdG.jpg","vote_average":4,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-06-13","episode_number":3,"episode_type":"standard","id":771511,"name":"Is the Universe Alive?","overview":"As scientists peer across the galaxy, a new revelation emerges: The universe is shockingly organic. Are the secrets to the life and death of the universe hidden not in physics, but biology? Could it be that the universe is alive?","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/qQL3OPlKS5MtL7vB6JPzFgxLqi0.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-06-20","episode_number":4,"episode_type":"standard","id":771512,"name":"What Makes Us Who We Are?","overview":"What is it that makes you you? Scientists are searching the brain for the core of who we are - some would call it the soul, others, our personal identity. How do we become who we are?","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/lIHS1lAecuB7lXegFYLCHjBeJap.jpg","vote_average":8,"vote_count":1,"crew":[{"job":"Executive Producer","department":"Production","credit_id":"63938ce1d7fbda0095ed5483","adult":false,"gender":2,"id":2375997,"known_for_department":"Production","name":"James Younger","original_name":"James Younger","popularity":0.6,"profile_path":null},{"job":"Executive Producer","department":"Production","credit_id":"63938cf5283ed900d99c635f","adult":false,"gender":2,"id":192,"known_for_department":"Acting","name":"Morgan Freeman","original_name":"Morgan Freeman","popularity":56.698,"profile_path":"/jPsLqiYGSofU4s6BjrxnefMfabb.jpg"},{"job":"Executive Producer","department":"Production","credit_id":"63938d116e0d7200d34e2768","adult":false,"gender":0,"id":1655884,"known_for_department":"Production","name":"Tracy Mercer","original_name":"Tracy Mercer","popularity":0.6,"profile_path":null},{"job":"Executive Producer","department":"Production","credit_id":"63938d29f04d01008c423ee6","adult":false,"gender":1,"id":24205,"known_for_department":"Production","name":"Lori McCreary","original_name":"Lori McCreary","popularity":1.811,"profile_path":"/kTXKUdB5yz1Y1tRDQDSPumSlL6Z.jpg"},{"job":"Executive Producer","department":"Production","credit_id":"63938d53d7fbda0095ed54b7","adult":false,"gender":0,"id":3823452,"known_for_department":"Production","name":"Lisa Andreae","original_name":"Lisa Andreae","popularity":0.6,"profile_path":null},{"job":"Producer","department":"Production","credit_id":"63938d65283ed9008ce01061","adult":false,"gender":1,"id":1219392,"known_for_department":"Acting","name":"Megan Parlen","original_name":"Megan Parlen","popularity":1.728,"profile_path":"/iMYtjT09JXVUjVwMLU3bSRwh8WZ.jpg"},{"job":"Director","department":"Directing","credit_id":"63938d79f04d0100d1d18993","adult":false,"gender":2,"id":943818,"known_for_department":"Directing","name":"Geoffrey Sharp","original_name":"Geoffrey Sharp","popularity":1.348,"profile_path":null},{"job":"Editor","department":"Editing","credit_id":"63938d926e0d72008dc266e7","adult":false,"gender":0,"id":3823455,"known_for_department":"Editing","name":"Dave Isser","original_name":"Dave Isser","popularity":0.6,"profile_path":null},{"job":"Additional Editing","department":"Editing","credit_id":"63938dc7f04d0100bfae777b","adult":false,"gender":2,"id":1313516,"known_for_department":"Writing","name":"Dave LaMattina","original_name":"Dave LaMattina","popularity":0.84,"profile_path":"/57zwV9VaooEi7yvpIkoLT0scVBT.jpg"},{"job":"Executive In Charge Of Production","department":"Production","credit_id":"63938debe19de900d90c14bc","adult":false,"gender":0,"id":3823458,"known_for_department":"Production","name":"Erika Schroeder","original_name":"Erika Schroeder","popularity":0.6,"profile_path":null},{"job":"Post Producer","department":"Production","credit_id":"63938e076e0d7200a3f29e48","adult":false,"gender":1,"id":1254828,"known_for_department":"Production","name":"C. Cory M. McCrum-Abdo","original_name":"C. Cory M. McCrum-Abdo","popularity":0.746,"profile_path":null},{"job":"Music Editor","department":"Sound","credit_id":"63938e4ad7fbda0088bbfa4f","adult":false,"gender":0,"id":1891325,"known_for_department":"Sound","name":"David Paul Dorn","original_name":"David Paul Dorn","popularity":0.6,"profile_path":null},{"job":"Associate Producer","department":"Production","credit_id":"63938e5cf04d010084311f98","adult":false,"gender":0,"id":3823462,"known_for_department":"Production","name":"Jeff Stepp","original_name":"Jeff Stepp","popularity":0.6,"profile_path":null},{"job":"Production Manager","department":"Production","credit_id":"63938e716e0d720084c1bdaa","adult":false,"gender":0,"id":2153135,"known_for_department":"Crew","name":"David Kraemer","original_name":"David Kraemer","popularity":0.6,"profile_path":null},{"job":"Clearances Coordinator","department":"Crew","credit_id":"63938e8ff04d0100a2705206","adult":false,"gender":0,"id":3823463,"known_for_department":"Crew","name":"Katie Del Core","original_name":"Katie Del Core","popularity":0.6,"profile_path":null},{"job":"Director of Photography","department":"Camera","credit_id":"63938eb3e19de900840d682c","adult":false,"gender":0,"id":1056991,"known_for_department":"Camera","name":"Wes Dorman","original_name":"Wes Dorman","popularity":0.6,"profile_path":null},{"job":"Director of Photography","department":"Camera","credit_id":"63938ec2cee2f600a0b914d9","adult":false,"gender":0,"id":2825958,"known_for_department":"Crew","name":"Jan Polak","original_name":"Jan Polak","popularity":0.6,"profile_path":null},{"job":"Director of Photography","department":"Camera","credit_id":"63938ecef04d010084311fd7","adult":false,"gender":0,"id":3658283,"known_for_department":"Camera","name":"Graham Veevers","original_name":"Graham Veevers","popularity":0.6,"profile_path":null},{"job":"Director of Photography","department":"Camera","credit_id":"63938eddd7fbda0088bbfa91","adult":false,"gender":2,"id":2238082,"known_for_department":"Camera","name":"Steve Robson","original_name":"Steve Robson","popularity":0.6,"profile_path":null},{"job":"Director of Photography","department":"Camera","credit_id":"63938eef6e0d72008dc2677d","adult":false,"gender":2,"id":1895573,"known_for_department":"Camera","name":"Robin Probyn","original_name":"Robin Probyn","popularity":0.6,"profile_path":null},{"job":"Director of Photography","department":"Camera","credit_id":"63938efdba4802007e89b17b","adult":false,"gender":0,"id":1484621,"known_for_department":"Camera","name":"Andrei Khabad","original_name":"Andrei Khabad","popularity":0.6,"profile_path":null},{"job":"Director of Photography","department":"Camera","credit_id":"63938f0acee2f600c82a54f2","adult":false,"gender":0,"id":1731147,"known_for_department":"Directing","name":"Mark Trottenberg","original_name":"Mark Trottenberg","popularity":0.6,"profile_path":null},{"job":"Post Production Supervisor","department":"Crew","credit_id":"63938f2a6e0d7200d34e2837","adult":false,"gender":0,"id":3385784,"known_for_department":"Production","name":"Will Hoppins","original_name":"Will Hoppins","popularity":0.98,"profile_path":null},{"job":"Assistant Editor","department":"Editing","credit_id":"63938f57f04d01008c423fa2","adult":false,"gender":0,"id":3823467,"known_for_department":"Editing","name":"John Dentlinger","original_name":"John Dentlinger","popularity":0.6,"profile_path":null},{"job":"Assistant Editor","department":"Editing","credit_id":"63938f73d7fbda0088bbfacd","adult":false,"gender":0,"id":3823470,"known_for_department":"Editing","name":"Freddie Harris","original_name":"Freddie Harris","popularity":0.6,"profile_path":null},{"job":"Visual Effects Supervisor","department":"Visual Effects","credit_id":"63938fb2cee2f60093116395","adult":false,"gender":0,"id":3328894,"known_for_department":"Editing","name":"Adam Simpson","original_name":"Adam Simpson","popularity":0.608,"profile_path":null},{"job":"Visual Effects Producer","department":"Visual Effects","credit_id":"63938fc6283ed9007fcc1e30","adult":false,"gender":0,"id":1398872,"known_for_department":"Visual Effects","name":"Dan Schmit","original_name":"Dan Schmit","popularity":1.4,"profile_path":null},{"job":"Visual Effects Coordinator","department":"Visual Effects","credit_id":"63939008f04d01008c423fcf","adult":false,"gender":1,"id":2542773,"known_for_department":"Directing","name":"Sarah McAnally","original_name":"Sarah McAnally","popularity":0.6,"profile_path":null},{"job":"Mixing Engineer","department":"Crew","credit_id":"63939041e19de900d90c1579","adult":false,"gender":0,"id":3823479,"known_for_department":"Crew","name":"Rick Ash","original_name":"Rick Ash","popularity":0.6,"profile_path":null},{"job":"Supervising Sound Editor","department":"Sound","credit_id":"63939056e19de9007c5119fb","adult":false,"gender":2,"id":1373429,"known_for_department":"Sound","name":"Eric Raber","original_name":"Eric Raber","popularity":1.094,"profile_path":null},{"job":"Colorist","department":"Editing","credit_id":"63939078ba480200888d8ea9","adult":false,"gender":0,"id":3823482,"known_for_department":"Editing","name":"Troy Davis","original_name":"Troy Davis","popularity":0.6,"profile_path":null},{"job":"Production Accountant","department":"Production","credit_id":"63939090ba480200888d8eb7","adult":false,"gender":0,"id":3823484,"known_for_department":"Production","name":"Barbara Tillman","original_name":"Barbara Tillman","popularity":0.6,"profile_path":null},{"job":"Archival Footage Coordinator","department":"Editing","credit_id":"639390a7d7fbda00a5046bd2","adult":false,"gender":0,"id":2696764,"known_for_department":"Editing","name":"Andy Zare","original_name":"Andy Zare","popularity":0.6,"profile_path":null},{"job":"Production Assistant","department":"Production","credit_id":"639390db6e0d7200c1988e0a","adult":false,"gender":0,"id":3823487,"known_for_department":"Production","name":"John Chatfield","original_name":"John Chatfield","popularity":0.6,"profile_path":null},{"job":"Thanks","department":"Crew","credit_id":"63939114283ed900d99c64d9","adult":false,"gender":0,"id":3823488,"known_for_department":"Crew","name":"Jörg Conradt","original_name":"Jörg Conradt","popularity":0.6,"profile_path":null},{"job":"Thanks","department":"Crew","credit_id":"6393912fba480200888d8ee7","adult":false,"gender":0,"id":3823490,"known_for_department":"Crew","name":"Lois Boucher","original_name":"Lois Boucher","popularity":0.6,"profile_path":null}],"guest_stars":[{"character":"Self","credit_id":"63938430ba4802007e89adc5","order":501,"adult":false,"gender":0,"id":2476912,"known_for_department":"Acting","name":"神谷 之康","original_name":"神谷 之康","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63938b7ad7fbda007be7cd51","order":502,"adult":false,"gender":2,"id":2338237,"known_for_department":"Acting","name":"Alain Brunet","original_name":"Alain Brunet","popularity":0.6,"profile_path":"/ksv2Km0fx4uyoLNNW4fiYByZuRP.jpg"},{"character":"Self","credit_id":"63938b8ecee2f6008522bcbd","order":503,"adult":false,"gender":0,"id":3823437,"known_for_department":"Acting","name":"Steve Furber","original_name":"Steve Furber","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63938ba4ba480200a1b6549a","order":504,"adult":false,"gender":0,"id":1728853,"known_for_department":"Acting","name":"Alison Gopnik","original_name":"Alison Gopnik","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63938bbb283ed900d99c62d3","order":505,"adult":false,"gender":0,"id":3823438,"known_for_department":"Acting","name":"Donna Rose Addis","original_name":"Donna Rose Addis","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63938bd1ba480200888d8cf3","order":506,"adult":false,"gender":0,"id":2231902,"known_for_department":"Acting","name":"Tali Sharot","original_name":"Tali Sharot","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63938c14283ed9008ce00fd8","order":507,"adult":false,"gender":0,"id":3823442,"known_for_department":"Acting","name":"Micah Edelson","original_name":"Micah Edelson","popularity":0.6,"profile_path":null},{"character":"Self","credit_id":"63938c1fcee2f600c82a53dd","order":508,"adult":false,"gender":0,"id":1961220,"known_for_department":"Acting","name":"Andre Fenton","original_name":"Andre Fenton","popularity":0.683,"profile_path":null}]},{"air_date":"2012-06-27","episode_number":5,"episode_type":"standard","id":771513,"name":"What Is Nothing?","overview":"Is empty space really empty? Scientists regard understanding the true nature of empty space may explain where the universe came from, whether it is fated to expand into oblivion or whether it will undergo another dramatic transformation that could destroy everything we know.","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/x9IRueMdBB9Idktv8pLcWdH8lJE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-11","episode_number":6,"episode_type":"standard","id":771514,"name":"Can We Resurrect the Dead?","overview":"With cloning and genetic engineering, we can bring back extinct animals. But could we also bring back dead humans? Is it possible to keep our brains alive after our bodies have died? Could we rise from the dead in some strange new form? Can we - should we - resurrect the dead?","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/jqelbtu0POtKMgG8LMrpGlaSlyu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-18","episode_number":7,"episode_type":"standard","id":771516,"name":"Can We Eliminate Evil?","overview":"What drives some to torture and kill without remorse? Why do seemingly normal people commit acts of cruelty and violence. Researchers are exploring our inner demons, looking for ways to isolate and neutralize the source of evil in the brain. Is it really possible to change human nature?","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/rFgHFOkqU8GOOZvojjMOW7Y77ve.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-25","episode_number":8,"episode_type":"standard","id":771515,"name":"Mysteries of the Subconscious","overview":"Does your subconscious know more than you ever will, and is your conscious mind holding you back? Do thoughts control actions, or vice versa? Research shows that opening the  subconscious may make people healthier and more creative. There are also dangers lurking in the dark recesses of the mind.","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/5XnpV8RwQiG3jZzunOUoZXr3SJS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-01","episode_number":9,"episode_type":"standard","id":771517,"name":"Will Eternity End?","overview":"Many religious traditions have predicted that our world will come to an apocalyptic end. Scientists agree that Earth can't last forever, but disagree on whether the universe and time itself can ever disappear. Some may hope for eternity, but the possibility of never-ending time has mind-bending implications for the present.","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/5jYiDUKXpzfybCkT0IuhPOzwPn7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-08","episode_number":10,"episode_type":"finale","id":771518,"name":"Did We Invent God?","overview":"Our belief in a God above explains all we can't understand. Where do religious beliefs come from? Some experts believe God may exist only in our brain, that we are wired to worship the supernatural and that faith in a higher power gives us an evolutionary advantage. Is it possible that God is really just a neurological accident? And does that make Him any less real? Did God invent humanity, or did humanity invent God?","production_code":"","runtime":44,"season_number":3,"show_id":32900,"still_path":"/cFVKm98HCQTRWm6XXHv5y4YQHLA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":44145,"poster_path":"/A8TfiUs47TVArx0mvxtpQZ8jiwp.jpg","season_number":3,"vote_average":5.5},"4":{"_id":"5258a641760ee346616a1c24","air_date":"2013-03-20","episodes":[{"air_date":"2013-03-20","episode_number":1,"episode_type":"standard","id":771530,"name":"Is There a God Particle?","overview":"Scientists explore the effects of the Higgs Boson discovery, which validates the Standard Model in particle physics and solidifies the understanding of subatomic particles; highlights include an in-depth discussion of the Higgs field and mass.","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/xGeGI3tJRZP72qmdPKhDTRnW55S.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-05","episode_number":2,"episode_type":"standard","id":1391480,"name":"When Does Life Begin?","overview":"It is a debate that has raged for centuries’. Groundbreaking evidence reveals that inside all of us are traces of cells from our relatives, blurring the lines between one life and another. Technology is now giving birth to new life forms made of surprising components – from droplets of oil in a Petri dish, to conscious robots and to a new global internet-connected life form comprised of all humanity.","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/wDrZgPgtlqJv4X9Z0QOPaunAtn4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-12","episode_number":3,"episode_type":"standard","id":771537,"name":"Can We Survive the Death of the Sun?","overview":"We are all at the mercy of the Sun. Its glowing disc sustains nearly all life on Earth. But the Sun also holds a dark secret: someday, our aging, expanding star will bathe the Earth in a fiery holocaust. Everything we know will turn to hot, bubbling, plasma.","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/uYYt5CTiYgIccT0rBy59PLTPHRg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-19","episode_number":4,"episode_type":"standard","id":771536,"name":"How Do Aliens Think?","overview":"If the stuff of life is spread throughout the cosmos, then the universe could be teeming with aliens.","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/yErVY7lksGXFmS81ZSxdPhW1iKp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-03","episode_number":5,"episode_type":"standard","id":771534,"name":"Will Sex Become Extinct?","overview":"Every single person who has ever lived was created from the genes of one man and one woman. But human sexual reproduction, unchanged for millions of years, is about to undergo radical change.","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/v8LB5XdoioEUbWT1sbGXGkQjjF0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-26","episode_number":6,"episode_type":"standard","id":771535,"name":"Can Our Minds Be Hacked?","overview":"Our minds store our entire lives, our memories and our deepest desires. Tell no one, and our thoughts remain our own. But our brains are biological computers. Computer hackers can tamper with our email.","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/cTudAX1coEEdnMm5kPhRjhAp378.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-10","episode_number":7,"episode_type":"standard","id":771533,"name":"Are Robots the Future of Human Evolution?","overview":"We are in the midst of a revolution so insidious we can't even see it. From our telephones to our vacuum cleaners to our cars, we have robots that live and work beside us. And now we're designing them to think for themselves, giving them the power to learn to move on their own.","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/39lLXEK45fslVDRE927li9th2PC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-17","episode_number":8,"episode_type":"standard","id":980817,"name":"Is Reality Real?","overview":"We are in the midst of a revolution so insidious we can't even see it. From our telephones to our vacuum cleaners to our cars, we have robots that live and work beside us. And now we're designing them to think for themselves, giving them the power to learn to move on their own.","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/8bV9G9VJid1gxPoRAITi4mFM58F.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-24","episode_number":9,"episode_type":"standard","id":771531,"name":"Do We Have Free Will?","overview":"What if everything that has or will happen in the universe has already been determined and we are unable to change our inevitable destinies? Until the discovery of quantum uncertainty, physicists were convinced free will does not exist. Now neuroscientists and geneticists have stepped into the fray, arguing that free will is an illusion thanks to the genes we are born with, the automatic processes working in our brains, and the conforming pressures of society.","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/40jeDp1NBgRIEQn2wthhdRpOmDD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-31","episode_number":10,"episode_type":"finale","id":980818,"name":"Did God Create Evolution?","overview":"What or who created all of the billions of species that have lived on Earth? Is all life the product of evolution as Charles Darwin proposed or was it the guiding hand of a higher power?","production_code":"","runtime":44,"season_number":4,"show_id":32900,"still_path":"/wEGmqCNbO2fotE9WdM8wNJZiZM8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":44148,"poster_path":"/jfWRAkCYu9aJhbXedtZf2g8iDWJ.jpg","season_number":4,"vote_average":0},"5":{"_id":"53a6d0f70e0a26143f003dd6","air_date":"2014-03-05","episodes":[{"air_date":"2014-03-05","episode_number":1,"episode_type":"standard","id":990165,"name":"Is God an Alien Concept?","overview":"Is God worshipped in other worlds across the cosmos? How might alien deities differ from our own? Have advanced aliens discovered everything there is to know about the universe, or are they too looking for answers? The answer may lie buried on Earth.","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/9KVqII3oyVEW6RrblKLQHPm16xO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-12","episode_number":2,"episode_type":"standard","id":990167,"name":"Is Luck Real?","overview":"Do you make your own luck or does luck make you? We find luck, good and bad, in casinos, basketball courts, genetics labs and the subatomic world. It’s a journey that will radically revise your understanding of the laws of nature and the human brain.","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/1lymzBvPBBBc4MGed7G3K3ylsO0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-04","episode_number":3,"episode_type":"standard","id":990179,"name":"Is Poverty Genetic?","overview":"Are the wealthy just born in the right place at the right time? Are the poor victims of a system designed to keep them down? Or do physics and biology determine who is rich and who is poor? Throughout history, distribution of wealth is governed by hidden forces: DNA, environmental stress, patterns of human migration and even the laws of thermodynamics! Nature seems to demand winners and losers in life. But does this mean greed is king, and the rich can take what they want? Or is cooperation – between microorganisms, monkeys, and humans – more essential to survival of a species?","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/uz2hUCsZzKGeZlVVM7wtD1cp6rU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-11","episode_number":4,"episode_type":"standard","id":990180,"name":"How to Collapse a Superpower","overview":"With a little imagination, could a few terrorists sabotage a mighty nation? Perhaps even tear down modern civilization? The stability of the US, Europe, China, or any global power depends on high-speed digital communication. Our increasing dependence on digital devices and global interactivity may be placing us in grave danger. Scientists around the world are dealing with new threats such as body hacking, Trojan horse viruses, and brain-damaging Internet addiction. But what if the ultimate threat isn’t an attack on technology, but the technology? Could the final superpower be the disembodied mind of the Internet itself?","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/gahWHCchsg76kayeRvmMNrBNh1T.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-18","episode_number":5,"episode_type":"standard","id":990181,"name":"Does the Ocean Think?","overview":"There could be an undiscovered species on Earth unlike anything we’ve ever known. Not in the ocean, but the ocean itself! Its body spans thousands of miles; its heart beats with a one-thousand-year pulse. It could even have an immune system capable of annihilating all other life on earth. Just as our bodies function through the interaction of water with individual cells, including bacteria and other microorganisms, the ocean’s residents might collectively form a super-organism. A recent discovery suggests the ocean is a living being capable of thought. If so, what is the ocean thinking about us?","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/s3KQV49ki6mP0d1YM7UJidwiyaj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-25","episode_number":6,"episode_type":"standard","id":990182,"name":"Is a Zombie Apocalypse Possible?","overview":"It is a nightmare that has stalked us for centuries: hordes of human beings transformed into mindless, cannibalistic monsters. Could this civilization-ending nightmare become reality? Scientists have discovered pathogens that turn insects into the walking dead. New strains of viruses are attacking humans every day. Mathematicians have calculated the likelihood of surviving a zombie virus outbreak: they’re not hopeful. Now neuroscientists are discovering how easy it is for us to lose conscious control of our bodies. Are we at risk of becoming puppets? If we were in the middle of a zombie apocalypse, would we even know it?","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/uxj2wITA3FypoBxBpVYb0rXCpzj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-02","episode_number":7,"episode_type":"standard","id":990183,"name":"Is Gravity an Illusion?","overview":"We feel it every moment of our lives but for physicists, gravity is the longest running unsolved mystery of the universe. Why do all objects that have mass pull on one another? Cutting-edge theories are proposing unexpected answers: Gravity could be another force in disguise, a thermodynamic mirage, or even, a shadow of a hidden holographic universe. If so, the force that holds us to the surface of the earth, and holds the earth in orbit around the sun, may be a trick of the mind. We feel it, but it may not be real. Is Gravity an Illusion?","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/w3glVYxKEMiYC79TwRH6wdtan9v.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-09","episode_number":8,"episode_type":"standard","id":990186,"name":"Will We Become God?","overview":"Humanity’s potential seems limitless. But could we become as powerful as God? Scientific breakthroughs grant our species seemingly divine abilities. Biologists tinkering with DNA are figuring out ways to grow new life forms, while neuroscientists try to create artificial consciousness. Statisticians around the world are using big data to predict the future and computer scientists have discovered a “God algorithm” that could solve any global problem in an instant. But to truly become God, we not only have to be all knowing, but all being. Quantum physicists are figuring out how to teleport matter at the speed of light!","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/hkZTBiQGeSMSDVu0AXs8EJQhlWb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-16","episode_number":9,"episode_type":"standard","id":990185,"name":"Is There a Shadow Universe?","overview":"When we look up into the sky it appears we live in a universe that is filled with light. But scientists are now certain there is far more matter in the dark portions of our universe that we can’t see or touch. There’s something hiding in the shadows. Cosmologists agree that “dark matter” has helped shape our Universe, but now they need to figure out what dark matter is. What’s going on in this hidden world? Could it have formed its own dark stars, planets, and even life forms? Could this Shadow Universe threaten our world of light?","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/7L9J5NFG9stl9y09zI6CGHenJpQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-23","episode_number":10,"episode_type":"finale","id":990184,"name":"When Did Time Begin?","overview":"We float along the river of time. But does that river have a source? Where did time come from? Some believe time and space are one thing, and the Big Bang started the cosmic clock. Others believe the universe existed for almost half a million \"years\" before light could move and time began. Still others say time is older than our universe. But what if time itself is an illusion? Incredible new experiments may hold the answer. One groundbreaking experiment gives us the power to punch holes in time…and another may create a machine that operates outside time’s boundaries!","production_code":"","runtime":44,"season_number":5,"show_id":32900,"still_path":"/myHuOqHKxsgb1toFZUB05wFGVuH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":61254,"poster_path":"/5V9gZ4fbacfGHeeKMxZklNWdUoe.jpg","season_number":5,"vote_average":0},"6":{"_id":"554150c19251414af00024f0","air_date":"2015-04-29","episodes":[{"air_date":"2015-04-29","episode_number":1,"episode_type":"standard","id":1057628,"name":"Are We All Bigots?","overview":"If you had less than one second to make a life-or-death decision to shoot a man who might be armed with a lethal weapon, what would you do? Would the ethnicity of the man affect your decision?","production_code":"","runtime":44,"season_number":6,"show_id":32900,"still_path":"/as0eFNUjjjp0fB8RHdkEhEaGSGY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-06","episode_number":2,"episode_type":"standard","id":1057630,"name":"Can Time Go Backwards?","overview":"Could science ever make the clock move backwards? Experiments in quantum physics are showing that the future influences the present: what happens later limits the choices we think we have now.","production_code":"","runtime":44,"season_number":6,"show_id":32900,"still_path":"/8kvUhlQ3Go6h83ht14P5dXybgR8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-13","episode_number":3,"episode_type":"standard","id":1057631,"name":"Are We Here for a Reason?","overview":"Evolution say that all life exists only to reproduce; a new theory proposes that instead of passing on genes, humans have another purpose.","production_code":"","runtime":44,"season_number":6,"show_id":32900,"still_path":"/avyGqanOqATHZvJkzw9Isrjyixu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-20","episode_number":4,"episode_type":"standard","id":1057632,"name":"Do We Live in the Matrix?","overview":"Our universe seems real. But what if it's a video game? Scientists in a variety of fields are taking seriously the possibility that we live in a virtual reality.","production_code":"","runtime":44,"season_number":6,"show_id":32900,"still_path":"/wILELYLqQ5s0fAd9uBktLFLX9MN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-27","episode_number":5,"episode_type":"standard","id":1057633,"name":"Are There Aliens Inside Us?","overview":"Odds are excellent that extra-terrestrial life exists. So why haven't we found aliens out in the galaxy? Are we looking in the wrong places?","production_code":"","runtime":44,"season_number":6,"show_id":32900,"still_path":"/aBZCH3GMN4UEOjVFf7GZRxVpOud.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-03","episode_number":6,"episode_type":"finale","id":1057634,"name":"Why Do We Lie?","overview":"We all agree lying is shameful. Yet we still deliberately deceive each other constantly. Are our brains wired for lying from a young age? The brains of pathological liars may provide insights. Will technology make it easier for us to be dishonest, or could it someday instantly reveal someone is lying? Perhaps we are deceitful because our limited senses prevent us from seeing the real truth. Scientists say our own memories deceive us, and have managed to implant false memories. Other scientists look for ultimate truth in the subatomic world - only to end up turning reality on its head.","production_code":"","runtime":44,"season_number":6,"show_id":32900,"still_path":"/zHgQIfOMHWwwXWIDGjlaUHVe8a2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":66337,"poster_path":"/jKn5s7CBtosOqILZwnVwG2Sr29I.jpg","season_number":6,"vote_average":0},"7":{"_id":"57c58f2fc3a36815c7003304","air_date":"2016-08-30","episodes":[{"air_date":"2016-08-30","episode_number":1,"episode_type":"standard","id":1218663,"name":"What Makes a Terrorist?","overview":"A dissection of the causes of terrorism.","production_code":"","runtime":44,"season_number":7,"show_id":32900,"still_path":"/gWydKgOLafkQXuoA5vss0OxtyI0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-06","episode_number":2,"episode_type":"standard","id":1222078,"name":"Is Privacy Dead?","overview":"We live under a billion unblinking eyes - a global surveillance system that solves crime and uncovers terrorist plots. But are we ready for a world without secrets - where not even our homes are off-limits and corporations know our every desire?","production_code":"","runtime":44,"season_number":7,"show_id":32900,"still_path":"/lFvhSP2csbZZmHXKEb6PwPNb7zb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-13","episode_number":3,"episode_type":"standard","id":1222669,"name":"Are There More Than Two Sexes?","overview":"Science reveals the line between male and female is blurred, and the battle of the sexes happens deep within our cells.","production_code":"","runtime":44,"season_number":7,"show_id":32900,"still_path":"/knkJ6ffKenc2vwdCNi6naF93yiz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-20","episode_number":4,"episode_type":"finale","id":1224519,"name":"Can We All Become Geniuses?","overview":"Genius lies somewhere in the human mind, bringing mathematical insight, sparking artistic inspiration and enabling some to see what most cannot. Might we augment our biology with technology to unlock the genius inside us all?","production_code":"","runtime":44,"season_number":7,"show_id":32900,"still_path":"/yw9F4F6yxOC4mgaVn4ClohIYEEL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":79703,"poster_path":null,"season_number":7,"vote_average":0},"8":{"_id":"5900245292514161a600634e","air_date":"2017-04-25","episodes":[{"air_date":"2017-04-25","episode_number":1,"episode_type":"standard","id":1308214,"name":"Is the Force With Us?","overview":"New research is beginning to reveal a hidden force in the universe - one that penetrates space with trillions of invisible connections, instantly linking every place in our world and joining our future with our past. Is the Force with us?","production_code":"","runtime":44,"season_number":8,"show_id":32900,"still_path":"/3zAWzPmJLUD7SZ8ipMlqS9qzgHK.jpg","vote_average":4,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2017-05-02","episode_number":2,"episode_type":"standard","id":1308215,"name":"Can We Cheat Death?","overview":"Scientists are peering inside the mechanisms of aging, tampering with the cellular makeup of our DNA, and imagining a world where death is cured like a disease. Are we entering a new age of immortality? Or is dying necessary for our race's survival?","production_code":"","runtime":44,"season_number":8,"show_id":32900,"still_path":"/kdL3yzHEidlEEIEWmudY3AQmtW2.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2017-05-09","episode_number":3,"episode_type":"standard","id":1315141,"name":"Can We Hack the Planet?","overview":"Unless we can turn the planet's problems into solutions, humanity may be coming to an end. Scientists are unlocking the secrets of nature to tame the elements, harness energy, and even control life. Can we hack the planet to save humanity?","production_code":"","runtime":44,"season_number":8,"show_id":32900,"still_path":"/gg2CURaovfhTOQG3yBx8idG9Xrg.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2017-05-16","episode_number":4,"episode_type":"finale","id":1317965,"name":"Is Gun Crime a Virus?","overview":"Every 17 minutes, someone is killed with a gun. It's a wave of violence that political debate can't seem to stop. Is this an epidemic that scientists can help cure? Could gun crime be a virus?","production_code":"","runtime":44,"season_number":8,"show_id":32900,"still_path":"/qapz0RrVDNRGDCOatv7yKV9hgXD.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"","id":87805,"poster_path":null,"season_number":8,"vote_average":6.5}}}