{"adult":false,"backdrop_path":"/gyifRY8qNUdlZIgmeaWECFvAstC.jpg","created_by":[],"episode_run_time":[45],"first_air_date":"2010-06-11","genres":[{"id":10764,"name":"Reality"},{"id":10759,"name":"Action & Adventure"}],"homepage":"https://go.discovery.com/tv-shows/dual-survival","id":32997,"in_production":false,"languages":["en"],"last_air_date":"2016-10-12","last_episode_to_air":{"id":1245666,"name":"Attack of the Elephants","overview":"Stranded and lost in the drought-ravaged Okavango Delta in Botswana, EJ and Jeff must face down aggressive bull elephants and territorial three-thousand pound hippopotamuses in their quest for survival and a way back to civilization.","vote_average":0,"vote_count":0,"air_date":"2016-10-12","episode_number":7,"episode_type":"finale","production_code":"","runtime":45,"season_number":9,"show_id":32997,"still_path":"/phkOCHPyuLBZCvFUNtEYjIMAsct.jpg"},"name":"Dual Survival","next_episode_to_air":null,"networks":[{"id":64,"logo_path":"/tmttRFo2OiXQD0EHMxxlw8EzUuZ.png","name":"Discovery","origin_country":"US"}],"number_of_episodes":84,"number_of_seasons":9,"origin_country":["US"],"original_language":"en","original_name":"Dual Survival","overview":"Two people with drastically different backgrounds and survival strategies take on some of the planet's most unforgiving terrain to demonstrate how the right skills and creative thinking can keep you alive in the most dangerous situations.","popularity":13.954,"poster_path":"/8lEagL8MAv2TupalZtDEMr33Yo.jpg","production_companies":[{"id":2292,"logo_path":null,"name":"Original Media","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"2013-01-01","episode_count":5,"id":44243,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2010-06-11","episode_count":10,"id":44241,"name":"Season 1","overview":"Two survival experts, military-trained Dave Canterbury and naturalist Cody Lundin, they take on some of the planet's most unforgiving terrain to demonstrate how the right skills and some creative thinking can keep you alive.","poster_path":"/v0nr2asAoF7Dqic7rLCmM7UeZ7.jpg","season_number":1,"vote_average":0},{"air_date":"2011-04-22","episode_count":12,"id":44242,"name":"Season 2","overview":"Cody Lundin and Dave Canterbury once again join forces to endure survival scenarios that push them to their limits. They must draw upon their personal arsenal of skills to devise extraordinary, MacGyver-like ways to survive. From swamps to avalanches and sweltering heat to sub-zero temperatures, this season Cody and Dave will show what it takes to survive in: the Florida Everglades, made up of 4,000 miles of cypress swamp; the scorching deserts of Baja, Mexico; Tierra Del Fuego, Argentina - less than 500 miles from Antarctica; the wet cloud forests of Panama, 7,000 feet in the air; and Wyoming's Rocky Mountains in the dead of winter.","poster_path":"/8AYcY0M7hMxF3XQrhbn8UhklevR.jpg","season_number":2,"vote_average":0},{"air_date":"2013-01-01","episode_count":11,"id":44244,"name":"Season 3","overview":"Returning this season is Cody Lundin, a 20 plus-year survival veteran who honed his skills living in the deserts and mountains with little modern tools, equipment or assistance. New this season is Joseph Teti, a combat-tested special operations veteran and graduate of more than 30 formal schools related to special operations. His training in the art of staying alive has helped him survive countless classified missions in Afghanistan and Iraq. Together they could be the most formidable survival team on the planet - if only they could agree on strategy.","poster_path":"/tGkWCj23LwDW5iqhWdXCWt1smgo.jpg","season_number":3,"vote_average":0},{"air_date":"2014-04-23","episode_count":10,"id":82683,"name":"Season 4","overview":"Joseph Teti and Cody Lundin join forces again to take on some of the planet's most unforgiving terrain in order to stay alive. This season the challenges are bigger, the environments are more extreme and the differences between the two men couldn't be greater. Lundin and Teti will tough it out in the endless mangroves of Sri Lanka, the blazing Arabian desert in Oman, the snow-capped Norwegian mountains and more. The stakes are higher than ever before and as a twist of events unravels throughout the season, one member of Dual Survival will leave the show for good.","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2015-01-21","episode_count":13,"id":64689,"name":"Season 5","overview":"This season Joe Teti has to join force with a survival expert with a drastically different background, Matt Graham, to survive in some of the world's toughest environments. Teti and Graham will show what it takes to survive in environments that range from a deserted island in the Caribbean to the swamps of Georgia, and in Central America, among other destinations.","poster_path":null,"season_number":5,"vote_average":0},{"air_date":"2015-09-30","episode_count":4,"id":75055,"name":"Season 6","overview":"","poster_path":null,"season_number":6,"vote_average":0},{"air_date":"2016-01-13","episode_count":10,"id":82682,"name":"Season 7","overview":"Each week, new co-hosts Grady Powell and Bill McConnell will be dropped into survival situations that anyone, anywhere in the world, could one day encounter. Grady is a former U.S. Army Green Beret with a \"no quit\" mindset, who passed selection at only 21 years old, and is among some of the youngest soldiers to have made it into the elite brotherhood of Special Forces Operators. Meanwhile, his new partner Bill McConnell, a primitive wilderness survivalist, takes a much different approach. Bill considers himself to be on a lifelong journey to connect with nature and often 'talks' to plants and animals in the wild.","poster_path":null,"season_number":7,"vote_average":0},{"air_date":"2016-06-15","episode_count":7,"id":78468,"name":"Season 8","overview":"Returning to the series from last season is former U.S. Army Green Beret Weapons Sergeant Grady Powell, who tends to adopt a strong-willed and impetuous approach in order to overcome any obstacle. Grady is joined this season by new partner Josh James, an experienced outdoorsman from New Zealand's South Island. Josh and Grady must draw on their unique skills and experiences to battle with some of the toughest wilderness environments on the planet, where everything that can go wrong does, and opposing mindsets present frequent - and often amusing - conflicts.","poster_path":null,"season_number":8,"vote_average":0},{"air_date":"2016-08-24","episode_count":7,"id":79727,"name":"Season 9","overview":"Army combat veteran, EJ Snyder, and wilderness survivalist Jeff Zausch are no strangers to harsh environments - as fan favorites on Naked an Afraid, the two have bared it all to survive in unforgiving conditions. This season, EJ and Jeff experience tests like they've never encountered before. With two varying approaches to survival, the tough journey often becomes rockier as their disagreements come to a head. Can they overcome their differences and utilize their combined arsenal of skills to survive?","poster_path":null,"season_number":9,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Reality","vote_average":7.4,"vote_count":22,"season_data":{"1":{"_id":"5258a728760ee346616ad801","air_date":"2010-06-11","episodes":[{"air_date":"2010-06-11","episode_number":1,"episode_type":"standard","id":773142,"name":"Shipwrecked","overview":"In this survival scenario, hosts Cody and Dave find themselves on a deserted island off the coast of Nova Scotia — in the dead of winter with plummeting temperatures. Despite the freezing temperatures — and his partner's objections — Cody doesn't give in on his indigenous survival strategy, where he lives his life barefoot. Here, he's only wearing shorts and wool socks. The only items they have are those they're able to salvage from the life raft they used to reach the island: an emergency Mylar blanket, a plastic tarp, two knives and a single rescue flare. They must use these items and their arsenal of skills to find shelter, build a fire and find food and water, all in sub-zero conditions.","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/siiBqHSqFe5VczMNEpl4aAXYw1w.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-18","episode_number":2,"episode_type":"standard","id":773136,"name":"Failed Ascent","overview":"Next, our survival experts take on a mountaineer's worst nightmare. They are left stranded on top of a mountain in New Zealand with limited supplies that would be carried by a climber: rope, crampons, an ice axe and other climbing gear. Working together, they battle 8,000-foot glacial peaks, deadly crevasses and deep rocky canyons as they trek down the mountain on a course set by Canterbury, an experienced climber. To find food, Lundin uses his knowledge of local cultures to tap the dietary wisdom of New Zealand's indigenous Maori.","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/40hIHStFHM6X3XZpEReFg4XySsB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-25","episode_number":3,"episode_type":"standard","id":773138,"name":"Out of Air","overview":"Each year, an average of 20 people drown while cave diving. For this survival scenario, survival experts Cody and Dave are lost divers who are fortunate to find air, but they are deep inside a maze of caves in Belize. Equipped with only their dive gear — mask, fins, wetsuit, buoyancy compensator and flashlights — they must find their way out and to safety. The survival rules that work above ground, like following a river downstream, don't apply in the labyrinth of underground caves. Instead, they must make their way upstream in a trek that puts Cody's barefoot philosophy to the ultimate test. Once they emerge, the situation goes from bad to worse — they find themselves surrounded by dense jungle, a web of vines and thorn ravaged terrain... and snakes.","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/xK6z9Turc7F1TGLvYZ8s824pgPv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-02","episode_number":4,"episode_type":"standard","id":773141,"name":"Desert Breakdown","overview":"Cody and Dave head into Peru's infamous \"Valley of the Volcanoes\" to take on the ultimate lost-in-the-desert survival scenario — a broken down car miles from civilization, in the middle of an almost barren lava-scorched landscape. Here, Dave and Cody take on two roles to show how to survive this desolate location: Dave stays with the vehicle and signals for rescue while Cody heads out in search of water. But first, Dave and Cody strip the car for everything it's worth, salvaging the battery, headlights, electrical wiring, tires and seat cushions. They fight volcanic rock, heat exhaustion, altitude sickness,dehydration, rodents and a debilitating illness that literally brings Cody to his knees.","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/yiyS9H8WK2qg34JFRZQuI8mD7cU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-09","episode_number":5,"episode_type":"standard","id":773140,"name":"Panic in the Jungle","overview":"Dave and Cody take on a lost hiker scenario in the sweltering jungles of Laos","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/zIVuBz0gJpajGPIhmmU3nHweRFS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-16","episode_number":6,"episode_type":"standard","id":773139,"name":"Swamped","overview":"Survival experts Cody and Dave head to the heart of the Louisiana bayou to take on a potentially deadly scenario: lost in a 1,000 square mile labyrinth of water channels and bogs, home to 1.5 million alligators and six species of poisonous snakes.","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/1ewHZUgGFqHC7ulj9zQmkcPpJbs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-23","episode_number":7,"episode_type":"standard","id":773143,"name":"Split Up","overview":"Dave and Cody must trek through tough Arizona terrain to find each other before making their way back to civilization.","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/3xz8LQYoe7B0L1u2U54sGQOFoZo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-30","episode_number":8,"episode_type":"standard","id":773144,"name":"Soaked","overview":"For two boat-wrecked hunters, surviving in the Pacific Northwest rainforest takes keen navigation skills and the know-how to avoid hypothermia and signal for rescue. Dave and Cody take on this nightmare scenario and show what it takes to survive.","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/lY43o1NxUHHvKs6N9SVhJ2e9yix.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-13","episode_number":9,"episode_type":"standard","id":773145,"name":"After the Storm","overview":"Cody and Dave find survival resources in the trash in a hurricane's aftermath.","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/coiaf7Y27rsyruAkCVGJHZLTWf7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-20","episode_number":10,"episode_type":"finale","id":773137,"name":"Bogged Down","overview":"Code and Dave wade through piranha-infested water in Brazil's Pantanal.","production_code":"","runtime":45,"season_number":1,"show_id":32997,"still_path":"/n3F0hcvvfjMIqZItVlSSUq8OYPU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Two survival experts, military-trained Dave Canterbury and naturalist Cody Lundin, they take on some of the planet's most unforgiving terrain to demonstrate how the right skills and some creative thinking can keep you alive.","id":44241,"poster_path":"/v0nr2asAoF7Dqic7rLCmM7UeZ7.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258a728760ee346616ad81b","air_date":"2011-04-22","episodes":[{"air_date":"2011-04-22","episode_number":1,"episode_type":"standard","id":773146,"name":"Slash and Burn","overview":"How lost hunters can survive in the harsh conditions of Tierra Del Fuego, how to survive and extreme injury.","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-29","episode_number":2,"episode_type":"standard","id":773147,"name":"Buried Alive","overview":"David and Cody show how to survive the harsh Rocky Mountains.","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/xpqS5JF99i9vaBKVqKbU551wG8k.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-06","episode_number":3,"episode_type":"standard","id":773148,"name":"Stuck in the Muck","overview":"Dave and Cody head into the Everglades to take on the role of airboaters stuck in a sawgrass prairie marsh under the blazing Florida sun. They must seek shelter in a nearby swamp where water moccasin, python and alligators lay in wait.","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/ddt8Xg7grD4cQtdf1mew2qR3pLW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-13","episode_number":4,"episode_type":"standard","id":773149,"name":"Bitten","overview":"Cody and Dave are dropped in the Highland jungle of Thailand that has few tools for survival but lots of things that like to bite","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/pGhSblxSFbwAmclZUP3Y8pl82IB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-20","episode_number":5,"episode_type":"standard","id":773150,"name":"Frozen Plains","overview":"Cody and Dave take on the scenario of two ranchers, stranded on the Northern Great Plains in Montana during the dead of winter. Their only survival supplies are the charred remains of a burned-down shack: an axe head, a bison hide, a glass jar, a metal tin and a steel striker","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/8mPQDmMwcgg4OIZhy0cTdOjEfcN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-24","episode_number":6,"episode_type":"standard","id":773151,"name":"Out of Africa","overview":"Cody and Dave take on a survival scenario in South Africa's backcountry where dehydration kills in hours and hungry super-predators kill even faster. Armed with nothing but a machete, they show how to escape the bush without getting eaten alive","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/ygwmmz5pasyH8H11PIAHbbDvlih.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-27","episode_number":7,"episode_type":"standard","id":773152,"name":"Out of the Clouds","overview":"Dave and Cody take on the role of biologists lost in the wet cloud forests of Panama 7,000 feet above sea level with only a poncho, specimen jar and a broken lighter to aid in their quest for civilization.","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/pEFjAsSRFm03ZFcQdUqmL10hO22.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-03","episode_number":8,"episode_type":"standard","id":773153,"name":"Adrift","overview":"Our intrepid duo take on the survival scenario of two castaways adrift at sea and show how to survive being stranded on a deserted jungle island in the South Pacific. This time, even Dave goes barefoot.","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/jmcWoeu15jwyBRRNjZpdNLlINjn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-10","episode_number":9,"episode_type":"standard","id":773154,"name":"Eating Dust","overview":"From the barren salt flats to the vast desert woodland, Dave and Cody battle the elements in the sun scorched desert of Baja, Mexico. With few supplies, they each demonstrate how to make use of an unlikely resource - urine","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/lBsiokMpRQWrP4hGoZGGGzQ7ZUK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-17","episode_number":10,"episode_type":"standard","id":773155,"name":"Hippo Island","overview":"In Botswana's Okavango Delta, Cody and Dave -- equipped only with a dying GPS and waterlogged binoculars -- seek to escape the dangerously territorial and deadly hippos that rule the marshland.","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/6IYjtVoDsHLUMmhQJtlgzdrVNtW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-24","episode_number":11,"episode_type":"standard","id":773156,"name":"Up the River","overview":"In Kentucky, Dave and Cody take on a scenario of two kayakers who are dumped into the cold river just a few hours before sundown. To make things worse, they become separated from each other by two miles of rushing river. Then, Dave traps an irate skunk.","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/7i7lA8oJ7qmpD2xQ6gbwlFENAXv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-01","episode_number":12,"episode_type":"finale","id":773157,"name":"Road to Nowhere","overview":"The hosts portray two lost travelers who run out of gas on an abandoned logging road in Northern Maine. To survive, they loot a broken-down truck for supplies and find a can of dog food.","production_code":"","runtime":45,"season_number":2,"show_id":32997,"still_path":"/6xJeFg5MI0D5ge3e6YR9sBKaEkf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"Cody Lundin and Dave Canterbury once again join forces to endure survival scenarios that push them to their limits. They must draw upon their personal arsenal of skills to devise extraordinary, MacGyver-like ways to survive. From swamps to avalanches and sweltering heat to sub-zero temperatures, this season Cody and Dave will show what it takes to survive in: the Florida Everglades, made up of 4,000 miles of cypress swamp; the scorching deserts of Baja, Mexico; Tierra Del Fuego, Argentina - less than 500 miles from Antarctica; the wet cloud forests of Panama, 7,000 feet in the air; and Wyoming's Rocky Mountains in the dead of winter.","id":44242,"poster_path":"/8AYcY0M7hMxF3XQrhbn8UhklevR.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258a728760ee346616ad83a","air_date":"2013-01-01","episodes":[{"air_date":"2013-01-01","episode_number":1,"episode_type":"standard","id":773162,"name":"Mars on Earth","overview":"Chile's Atacama desert is the driest place on Earth, and it's landscape is so barren and unique that NASA uses it as a testing ground for it's Martian rovers. It is here that Cody Lundin and Joe Teti are put to the ultimate desert survival test. In this scenario, they take on the plight of a downed paraglider pilot who has crash landed on a mountain peak over 14,000 feet above sea level. Facing acute altitude sickness, and with limited water and resources, they must strip the paraglider for all it's worth and head out in search of civilization and re-hydration.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/hvBhi4XPwCW6kdmSzWF7Ylv0auk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-08","episode_number":2,"episode_type":"standard","id":773163,"name":"On the Menu","overview":"Stranded in the South African bush and in close proximity to the planet's deadliest predators including lions and leopards, Joe and Cody fight to get out alive while hiding from poachers who may be hunting them.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/i8OpMO6zqGHGV2YAPLcbYnDHHn2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-15","episode_number":3,"episode_type":"standard","id":773164,"name":"Into the Frying Pan","overview":"Deep in New Mexico's Chihuahuan Desert, Joe struggles to get out of an abandoned mineshaft. A deadly western diamondback rattlesnake becomes dinner, and a maggot-infested cow carcass puts the team's opposing survival tactics to the test.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/hf0mkpfO9kTZtisg4bLtUhFpoSQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-22","episode_number":4,"episode_type":"standard","id":773165,"name":"Trouble in Paradise","overview":"Isolated in the jungle of an uninhabited Hawaiian island, Joe and Cody lock heads over priorities. Cody battles the dangers of dehydration searching for water and fire-making tools, while Joe gears up for mortal combat with aggressive feral boars.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/AubBjUws1lBqJsGSzukQkj1338x.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-29","episode_number":5,"episode_type":"standard","id":773166,"name":"The Green Hell","overview":"Stranded in the South African bush and in close proximity to the planet's deadliest predators including lions and leopards, Joe and Cody fight to get out alive while hiding from poachers who may be hunting them.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/utcwV6tDYMSQKan46BIm27oLXU4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-05","episode_number":6,"episode_type":"standard","id":773167,"name":"Twin Peaks","overview":"Tempers get hot when survival tactics collide as Joe and Cody struggle to escape the Nicaraguan jungle. The men are stranded at the top of a steep, muddy volcano, and Cody takes on the role of a hiker suffering an immobilizing knee injury.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/n7qFCLSSevI1sA7GsM0aPJJKXaq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-12","episode_number":7,"episode_type":"standard","id":773169,"name":"Meltdown","overview":"Stranded in the middle of Zambia's hot, wild plains, Joe and Cody must avoid territorial hippos and herds of elephants to find water and shelter. An argument over whether to sleep inside a bat-infested hollow tree threatens to break the team apart.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/8TUpUWAlioUapYA6hFFATA5fzu8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-19","episode_number":8,"episode_type":"standard","id":773168,"name":"Belly of the Beast","overview":"Isolated beneath the mountains of Romania, lost in a labyrinth of underground caves, Cody and Joe fight to escape the pitch black darkness with dying headlamps. Their teamwork is further strained by their opposing survival philosophies.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/cDUnJBXJXzlRWFgkM78VsTmiyQG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-26","episode_number":9,"episode_type":"standard","id":773170,"name":"Castaways","overview":"Marooned on a deserted island somewhere in Fiji, Joe and Cody face unpredictable and punishing tropical storms and brave shark-infested waters. With limited resources and up against enormous odds, they'll show how to get back to civilization alive.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/jAG2NvGd49fabBkaWf6bMvVoTKh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-05","episode_number":10,"episode_type":"standard","id":773171,"name":"Rocky Mountain High","overview":"Stranded at over 9,000 feet above sea level in the snow-covered Rocky Mountains of Colorado, Cody and Joe battle temperatures of negative 20 degrees Fahrenheit while battling to fight off hypothermia, and stay alive long enough to get rescued.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/iYTlLCEl7Ht827zHnH7N8nPTKv3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-12","episode_number":11,"episode_type":"finale","id":773172,"name":"Misty Mountain Drop","overview":"On the season finale, Cody and Joe take on the mountains of Northern California. The damp and treacherous woodland environment proves to be the ultimate test for Cody and Joe, with drastic temperature changes and a lack of dry materials for fire-building.","production_code":"","runtime":45,"season_number":3,"show_id":32997,"still_path":"/viQxJTBol0u4G6OgAZ7HV6rvGjH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"Returning this season is Cody Lundin, a 20 plus-year survival veteran who honed his skills living in the deserts and mountains with little modern tools, equipment or assistance. New this season is Joseph Teti, a combat-tested special operations veteran and graduate of more than 30 formal schools related to special operations. His training in the art of staying alive has helped him survive countless classified missions in Afghanistan and Iraq. Together they could be the most formidable survival team on the planet - if only they could agree on strategy.","id":44244,"poster_path":"/tGkWCj23LwDW5iqhWdXCWt1smgo.jpg","season_number":3,"vote_average":0},"4":{"_id":"5849632d92514119b6012c90","air_date":"2014-04-23","episodes":[{"air_date":"2014-04-23","episode_number":1,"episode_type":"standard","id":1246201,"name":"No End in Sight (1)","overview":"Teti and Lundin are in a mangrove swamp in Sri Lanka.","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-30","episode_number":2,"episode_type":"standard","id":1246202,"name":"No End in Sight (2)","overview":"Teti and Lundin are in the jungle of Sri Lanka.","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-07","episode_number":3,"episode_type":"standard","id":1246203,"name":"Deadly Dunes","overview":"Teti and Lundin are in the desert and mountains of Oman.","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-14","episode_number":4,"episode_type":"standard","id":1246204,"name":"Glacial Downfall","overview":"Teti and Lundin are in Norway. This is their final episode together.","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-21","episode_number":5,"episode_type":"standard","id":1246205,"name":"Journey's End to a New Beginning","overview":"The episode features footage from previous episodes, behind the scenes materials, and crew interviews.","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-28","episode_number":6,"episode_type":"standard","id":1246206,"name":"No Man Is an Island","overview":"Teti and Matt Graham in their first episode together in Panama","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-04","episode_number":7,"episode_type":"standard","id":1246207,"name":"Mayan Mayhem","overview":"Teti and Graham are in Mayan underground tunnels.","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-11","episode_number":8,"episode_type":"standard","id":1246208,"name":"On the Edge","overview":"Teti and Graham are 15,000 feet above sea level on a mountain ridgeline.","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-18","episode_number":9,"episode_type":"standard","id":1246209,"name":"End of the Road","overview":"Teti and Graham are stranded deep in the jungle of Vietnam.","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-25","episode_number":10,"episode_type":"finale","id":1246210,"name":"One Shot, One Kill","overview":"Teti and Graham are lost in New Zealand’s Fiordland","production_code":"","runtime":45,"season_number":4,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"Joseph Teti and Cody Lundin join forces again to take on some of the planet's most unforgiving terrain in order to stay alive. This season the challenges are bigger, the environments are more extreme and the differences between the two men couldn't be greater. Lundin and Teti will tough it out in the endless mangroves of Sri Lanka, the blazing Arabian desert in Oman, the snow-capped Norwegian mountains and more. The stakes are higher than ever before and as a twist of events unravels throughout the season, one member of Dual Survival will leave the show for good.","id":82683,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"54c09098c3a3687c4000ad95","air_date":"2015-01-21","episodes":[{"air_date":"2015-01-21","episode_number":1,"episode_type":"standard","id":1038155,"name":"Into the Canyons","overview":"Joe and Matt attempt to survive in the harsh terrain of southern Utah without knives or modern supplies.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-28","episode_number":2,"episode_type":"standard","id":1038242,"name":"Grin and Bear It","overview":"Joe and Matt travel through the Allegheny Mountains of Pennsylvania, contending with freezing rain, steep ravines and bears.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-04","episode_number":3,"episode_type":"standard","id":1041726,"name":"Downed and Out (1)","overview":"Matt and Joe start at the site of a plane crash on an uninhabited tropical island, and face long-term survival.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-11","episode_number":4,"episode_type":"standard","id":1041727,"name":"Downed and Out (2)","overview":"While marooned on a barren island, Matt and Joe risk a swim in shark-infested waters and fight for life-sustaining basics.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-18","episode_number":5,"episode_type":"standard","id":1041725,"name":"Swamplandia","overview":"While stranded in a black water swamp in southern Georgia, Joe and Matt find themselves in alligator territory.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-25","episode_number":6,"episode_type":"standard","id":1042123,"name":"Out of the Ashes (1)","overview":"While on a tropical volcano, Matt and Joe must navigate toward the coast through rainforest, steep-walled gorges and waterfalls.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-04","episode_number":7,"episode_type":"standard","id":1043573,"name":"Out of the Ashes (2)","overview":"Joe and Matt cross a volcanic island covered with jungle and water-filled canyons, where setbacks fuel a rift.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-11","episode_number":8,"episode_type":"standard","id":1044315,"name":"Waterlogged","overview":"Off the beaten path and waterlogged in the rainforest of Costa Rica, Matt and Joe battle torrential rains, deadly insects, and raging rapids. After missing a shot at rescue, they combine survival ingenuity with indigenous skills to get out alive.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-17","episode_number":9,"episode_type":"standard","id":1049924,"name":"Coastal Catastrophe","overview":"Matt and Joe are marooned on a rocky coast in the Pacific Northwest. They must decide whether to hunker down or travel deeper into one of the darkest, wettest forest in the United States.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-31","episode_number":10,"episode_type":"standard","id":1048148,"name":"Winter Vortex (1)","overview":"In the snowiest part of Wyoming, Matt and Joe demonstrate how to repurpose a broken down snowmobile, make shelter from snow, and survive sub-freezing temperatures in whiteout conditions that cause them to miss a chance at rescue","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-07","episode_number":11,"episode_type":"standard","id":1053659,"name":"Winter Vortex (2)","overview":"Conclusion. The guys find a use for a broken snowmobile and make a shelter in the snow as they try not to freeze before they are rescued in Wyoming.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-14","episode_number":12,"episode_type":"standard","id":1053660,"name":"Himalayan Hardship","overview":"Joe endures the rocky terrain, dense forest and animal threats in the Himalayas, while Matt searches for spiritual enlightenment.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-22","episode_number":13,"episode_type":"finale","id":1051134,"name":"Namibian Nightmare","overview":"Stranded in the vast scrubland of Namibia, Joe and Matt are in a race to get out alive from one of the driest countries on earth. They run into trouble with a troop of baboons, proving that Mother Nature isn’t the only force in the wilderness.","production_code":"","runtime":45,"season_number":5,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"This season Joe Teti has to join force with a survival expert with a drastically different background, Matt Graham, to survive in some of the world's toughest environments. Teti and Graham will show what it takes to survive in environments that range from a deserted island in the Caribbean to the swamps of Georgia, and in Central America, among other destinations.","id":64689,"poster_path":null,"season_number":5,"vote_average":0},"6":{"_id":"56d6b0859251411884005146","air_date":"2015-09-30","episodes":[{"air_date":"2015-09-30","episode_number":1,"episode_type":"standard","id":1246171,"name":"Nautical Nightmare","overview":"Somewhere in the Atlantic Ocean, Matt and Joe are caught in open water, where a nightmare scenario of a sunken ship is made worse by prowling sharks, razor sharp coral, unpredictable weather and false hope for rescue.","production_code":"","runtime":45,"season_number":6,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-06","episode_number":2,"episode_type":"standard","id":1246172,"name":"Fractured Journey","overview":"Matt and Joe take on one of the most common and deadly scenarios in the wilderness: an injury that requires medical intervention. Caught in a thick jungle, this worst-case becomes a test of will in the struggle to get out alive.","production_code":"","runtime":45,"season_number":6,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-14","episode_number":3,"episode_type":"standard","id":1246173,"name":"Escape and Evade","overview":"Joe and Matt take on an escape and evasion scenario on the border between Texas and Mexico. Here they confront the dangers of the wilderness without their knives, including being restrained with zip-ties, traveling solo and evading pursuit.","production_code":"","runtime":45,"season_number":6,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-21","episode_number":4,"episode_type":"finale","id":1246174,"name":"Braving Bolivia","overview":"Joe & Matt face a journey of epic proportions in the Bolivian Andes. From the world’s largest salt flat 12,000 ft above sea level, through a desert with toxic water and into mountain peaks, they’re in a constant battle against dehydration & altitude.","production_code":"","runtime":45,"season_number":6,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":75055,"poster_path":null,"season_number":6,"vote_average":0},"7":{"_id":"5849566bc3a368141f012669","air_date":"2016-01-13","episodes":[{"air_date":"2016-01-13","episode_number":1,"episode_type":"standard","id":1246190,"name":"Fire and Ice","overview":"In the Chilean Andes, Grady and Bill start their survival mission high up on a snowy dormant volcano. They must get off the volcano, find shelter in caves, and trek down into the rainforest. Along the way, they search for food, and attempt to build a fire.","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-20","episode_number":2,"episode_type":"standard","id":1246191,"name":"Long Way Home","overview":"Continuing in the Chilean Andes, Grady and Bill must survive a cold night in the rainforest. On their journey out they hunt feral pigs, build a shelter, and attempt to build a fire again.","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-27","episode_number":3,"episode_type":"standard","id":1246192,"name":"Take Me to the River","overview":"In the Amazon rainforest, Bill and Grady must navigate through dense jungle, and build a shelter from the rains. They navigate to a river, attempt to catch fish, and build a raft to try to reach civilization.","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-03","episode_number":4,"episode_type":"standard","id":1246193,"name":"Eat or Be Eaten","overview":"While stranded in the Zambezi River Basin, Grady and Bill attempt survival during Africa's dry season, on their trek to the Zambezi River. Along the way, they search for water, build a primitive fire, encounter a myriad of African wildlife and predators, and hunt for guinea fowl.","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-10","episode_number":5,"episode_type":"standard","id":1246194,"name":"Scorched Earth","overview":"In the Namib Desert of southern Africa, Grady and Bill are left with a broken down car. They use the car to help them with survival tasks, catch and eat scorpions, create signals for rescue, and search for water and food in a nearby canyon.","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-17","episode_number":6,"episode_type":"standard","id":1246195,"name":"On Thin Ice","overview":"In the cold and snow of the Sawtooth Mountains of Idaho, Bill and Grady begin their survival on a mountain ridge and make their way to a forested area where they discover a dilapidated cabin. After spending the night there, they navigate to a river, deal with hypothermic conditions after Grady partially breaks through the ice, and attempt to trap beaver.","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-24","episode_number":7,"episode_type":"standard","id":1246196,"name":"High and Dry","overview":"Bill and Grady visit Oregon where they find themselves lost in a desert-type environment.","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-02","episode_number":8,"episode_type":"standard","id":1246197,"name":"Cuban Crisis","overview":"In the remote swamps of Cuba, Grady and Bill must navigate to dry land while avoiding Cuban crocodiles. They desperately search for water, catch a turtle, and start a fire using a binocular lens. They then attempt to salvage a boat to help them find civilization.","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-09","episode_number":9,"episode_type":"standard","id":1246198,"name":"Saturation Point","overview":"Bill and Grady try to survive in the remote part of Maine, USA, dealing with extreme cold weather, chilly nights and lack of fire.","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-16","episode_number":10,"episode_type":"finale","id":1246199,"name":"Live to Tell","overview":"A behind the scenes look at Bill And Grady's journeys throughout the season. Also a sneak peak at Season 8","production_code":"","runtime":45,"season_number":7,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"Each week, new co-hosts Grady Powell and Bill McConnell will be dropped into survival situations that anyone, anywhere in the world, could one day encounter. Grady is a former U.S. Army Green Beret with a \"no quit\" mindset, who passed selection at only 21 years old, and is among some of the youngest soldiers to have made it into the elite brotherhood of Special Forces Operators. Meanwhile, his new partner Bill McConnell, a primitive wilderness survivalist, takes a much different approach. Bill considers himself to be on a lifelong journey to connect with nature and often 'talks' to plants and animals in the wild.","id":82682,"poster_path":null,"season_number":7,"vote_average":0},"8":{"_id":"5786a9d39251415e4000025d","air_date":"2016-06-15","episodes":[{"air_date":"2016-06-15","episode_number":1,"episode_type":"standard","id":1205674,"name":"Croatian Castaway","overview":"Trapped in the jagged canyons of Croatia's Velebit Mountain, new partners Grady and Josh must work together to navigate the frigid, fast-moving rapids, and descend treacherous waterfalls in order to find salvation in this remote landscape.","production_code":"","runtime":45,"season_number":8,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-22","episode_number":2,"episode_type":"standard","id":1205675,"name":"Mosquito Coast","overview":"Grady and Josh slash their way through the Nicaraguan jungle battling snakes, mosquitoes and dehydration. They struggle to start a fire using a soil testing kit, go on a nighttime hunt for caiman and build a raft to cross croc-infested waters.","production_code":"","runtime":45,"season_number":8,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-05","episode_number":3,"episode_type":"standard","id":1205676,"name":"Bulgarian Blizzard","overview":"Grady and Josh face a whiteout blizzard, freezing temperatures and a run-in with a deadly predator on the slopes of Bulgaria's Rila Mountains.","production_code":"","runtime":45,"season_number":8,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-12","episode_number":4,"episode_type":"standard","id":1205677,"name":"Burning Island","overview":"Shipwrecked on an island in the South China Sea, castaways Grady and Josh demonstrate their resourcefulness by repurposing garbage on the beach to desalinate water, construct shelter, hunt for food, and ultimately signal for rescue.","production_code":"","runtime":45,"season_number":8,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-19","episode_number":5,"episode_type":"standard","id":1208344,"name":"Out Of Air","overview":"Stranded in the high altitudes of the Peruvian Andes, Grady and Josh battle crippling altitude sickness and the hallucinations that come with it. They must find fresh water fast in order to navigate this rough landscape in pursuit of civilization.","production_code":"","runtime":45,"season_number":8,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-26","episode_number":6,"episode_type":"standard","id":1208345,"name":"Snow Daze","overview":"Air Force veteran Bo McGlone teams up with former Green Beret Grady Powell on Wyoming's frigid Big Horn Mountains in the dead of a brutal winter. Navigating the exhausting, snowy terrain will push them to their limits.","production_code":"","runtime":45,"season_number":8,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-08-02","episode_number":7,"episode_type":"finale","id":1473233,"name":"Colombian Chaos","overview":"Military Veterans Grady Powell and Bo McGlone are dropped into separate locations of a Colombian jungle to play out a military operation gone awry. With only a map and machete, they must survive in the dense jungle while trying to find rescue.","production_code":"","runtime":45,"season_number":8,"show_id":32997,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"Returning to the series from last season is former U.S. Army Green Beret Weapons Sergeant Grady Powell, who tends to adopt a strong-willed and impetuous approach in order to overcome any obstacle. Grady is joined this season by new partner Josh James, an experienced outdoorsman from New Zealand's South Island. Josh and Grady must draw on their unique skills and experiences to battle with some of the toughest wilderness environments on the planet, where everything that can go wrong does, and opposing mindsets present frequent - and often amusing - conflicts.","id":78468,"poster_path":null,"season_number":8,"vote_average":0},"9":{"_id":"57c75fb9c3a3681bf200052f","air_date":"2016-08-24","episodes":[{"air_date":"2016-08-24","episode_number":1,"episode_type":"standard","id":1247242,"name":"Battle of Brazil","overview":"Stranded in the scorching hot savannas of Southern Brazil, Naked and Afraid fan favorites EJ Snyder and Jeff Zausch must find a way to survive this bone-dry environment without water or food and navigate back to civilization.","production_code":"","runtime":45,"season_number":9,"show_id":32997,"still_path":"/t9hN684RmO12LIp5DPJUjDMt15y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-08-31","episode_number":2,"episode_type":"standard","id":1218898,"name":"Forest From Hell","overview":"Lost in a mile-high Araucaria forest of South America, Army Combat Veteran EJ Snyder and Wilderness Survivalist Jeff Zausch must brave venomous pit vipers, fight a wild boar and survive the treacherous terrain in their search for rescue.","production_code":"","runtime":45,"season_number":9,"show_id":32997,"still_path":"/agQkDum8sHWQzslpUpLpUlkoaaC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-14","episode_number":3,"episode_type":"standard","id":1218897,"name":"Dying of Thirst","overview":"EJ &amp; Jeff brave the blazing high desert heat of eastern Utah.  Their quest for water &amp; rescue forces them to descend a sheer canyon wall, climb the face of a steep mesa and endure a hellish journey through one of the deadliest deserts in the country.","production_code":"","runtime":45,"season_number":9,"show_id":32997,"still_path":"/WivwaG39XWFglNaPYGZaD9qGoO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-21","episode_number":4,"episode_type":"standard","id":1245662,"name":"Gator Bait","overview":"Waist-deep in the backwater swamps of Louisiana's Atchafalaya river basin, EJ and Jeff find themselves surrounded by alligators and poisonous snakes. With no clear way to safety, they must find a direction out of the bayou and onto safe dry land.","production_code":"","runtime":45,"season_number":9,"show_id":32997,"still_path":"/xnbhLGmT1pRe4f6fbaXUrhH671h.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-28","episode_number":5,"episode_type":"standard","id":1245664,"name":"Blackout","overview":"In the former Soviet Republic of Georgia, located between Russia and Turkey, EJ and Jeff find themselves in a nightmarish scenario as they’re surrounded by 800-pound bears and trapped in a pitch-black cavern.","production_code":"","runtime":45,"season_number":9,"show_id":32997,"still_path":"/aoFumj87GKwCFeFfesUDloink0U.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-05","episode_number":6,"episode_type":"standard","id":1245665,"name":"Tracking Lions","overview":"Lost in the middle of South Africa’s Wild Coast, EJ and Jeff find themselves surrounded by African lions. Without food, water or protection they must navigate through some of the most hostile terrain on the planet to find their way back to salvation.","production_code":"","runtime":45,"season_number":9,"show_id":32997,"still_path":"/9586T0JEM43Z0APp38Kbiru4ygO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-12","episode_number":7,"episode_type":"finale","id":1245666,"name":"Attack of the Elephants","overview":"Stranded and lost in the drought-ravaged Okavango Delta in Botswana, EJ and Jeff must face down aggressive bull elephants and territorial three-thousand pound hippopotamuses in their quest for survival and a way back to civilization.","production_code":"","runtime":45,"season_number":9,"show_id":32997,"still_path":"/phkOCHPyuLBZCvFUNtEYjIMAsct.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"Army combat veteran, EJ Snyder, and wilderness survivalist Jeff Zausch are no strangers to harsh environments - as fan favorites on Naked an Afraid, the two have bared it all to survive in unforgiving conditions. This season, EJ and Jeff experience tests like they've never encountered before. With two varying approaches to survival, the tough journey often becomes rockier as their disagreements come to a head. Can they overcome their differences and utilize their combined arsenal of skills to survive?","id":79727,"poster_path":null,"season_number":9,"vote_average":0}}}