{"adult":false,"backdrop_path":"/nrdnBYObLGDZHH6dsOOViPyvrGN.jpg","created_by":[{"id":1242848,"credit_id":"58966e9cc3a3680898010f27","name":"David Gullason","profile_path":null}],"episode_run_time":[60],"first_air_date":"2009-11-18","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.icepilots.com/index.php","id":33057,"in_production":false,"languages":["en"],"last_air_date":"2014-12-17","last_episode_to_air":{"id":1264922,"name":"D-Day","overview":"The Buffalo boys gather in Red Deer for Mikey’s D-Day tribute jump. Joe and Sam scout out the designated military drop zone over Abraham Lake in the Rockies only to discover the canyon is too narrow for the DC-3. So Joe cancels the whole thing—it’s too dangerous. Mikey uses Joe’s own philosophy against him: at Buffalo, there’s always a backup plan. Joe flies out to scout a new location for the drop on the lake but hits bad weather. As Joe is about to scrap the trip, twenty paratroopers from the Canadian and American armies arrive for the big jump and are ready to go. They board WZS and Joe takes off to a site he hasn’t scouted, in weather that just keeps getting worse. As they near the drop point, he finally calls it—no jump tonight. They turn back, with all the troops still on board. Mikey’s only hope is a narrow window first thing the next morning—but only if Joe gives the final okay.","vote_average":0,"vote_count":0,"air_date":"2014-12-17","episode_number":8,"episode_type":"finale","production_code":"","runtime":60,"season_number":6,"show_id":33057,"still_path":null},"name":"Ice Pilots NWT","next_episode_to_air":null,"networks":[{"id":65,"logo_path":"/9fGgdJz17aBX7dOyfHJtsozB7bf.png","name":"History","origin_country":"US"}],"number_of_episodes":73,"number_of_seasons":6,"origin_country":["CA"],"original_language":"en","original_name":"Ice Pilots NWT","overview":"Ice Pilots NWT is a reality television series broadcast on History Canada that portrays Buffalo Airways, an airline based in Yellowknife, Northwest Territories, Canada. Buffalo mainly flies WWII-era propeller planes year-round in the Canadian North. It premiered on November 18, 2009. The show was renewed for a second season with filming completed on August 2nd, 2010. The season premiere was aired on History Television January 12th, 2011. Season 3 was greenlit on August 18th, 2010 and began airing on October 12, 2011. In the UK, season 2 was shown on Quest commencing May 2011. The episodes in season 4 have been shown on the Discovery Channel in the UK. Season 1 of Ice Pilots began airing on the National Geographic Channel in the US on April 22, 2011. Both Season 1 and 2 have aired in Australia on National Geographic Channel and National Geographic Channel HD and currently air on the digital channel 7 Mate.","popularity":12.18,"poster_path":"/7KTyFVKeDKB1fOBsTn5SYl2A64.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":null,"episode_count":9,"id":44312,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2009-11-18","episode_count":13,"id":44313,"name":"Season 1","overview":"It’s the last frontier. And these are the last of the true Arctic aviators. Young pilots with a taste for adventure have come here to earn their wings, flying vintage steel built for war. But it’s a different war now: a war against bitter cold and constant breakdowns, a war to get the job done, a war to stay alive flying in the toughest conditions on the planet. The job: to haul people and vital fuel and supplies to far flung outposts in the Canadian North. Piloting sturdy old warbirds built for punishment, they’re learning with every hard knock, pulling together even as they compete to rise up the ranks. It’s an impossible job with antique equipment in a merciless place.","poster_path":"/AqGGP01VLNhNnToxtmWrFKvUN37.jpg","season_number":1,"vote_average":0},{"air_date":"2011-01-12","episode_count":13,"id":44315,"name":"Season 2","overview":"Ice Pilots NWT is back. The hit docu-series following the adventures of renegade Buffalo Airways returns for a second season of nail-biting challenges and compelling stories, featuring the pilots and crew who put it all on the line flying vintage warplanes across the Arctic. Our favourite faces and some new rookies show up for another season of thrills, chills, laughter and their most personal stories yet.","poster_path":"/ywaOsEPL64a7PsXI0Pq0QlUX1L6.jpg","season_number":2,"vote_average":0},{"air_date":"2011-10-12","episode_count":13,"id":44314,"name":"Season 3","overview":"The immensely popular docu-series following the adventures of the maverick Arctic airline, Buffalo Airways, returns for a third season. Full of white-knuckle missions and in-your-face personal stories, Season Three will enthrall viewers with tales of Buffalo's extraordinary vintage warplanes servicing remote communities in the extreme conditions of Canada's North.","poster_path":"/rislXs1sYr0DChbeuj5FOMfs5zt.jpg","season_number":3,"vote_average":0},{"air_date":"2012-11-07","episode_count":13,"id":44311,"name":"Season 4","overview":"Ice Pilots NWT is back and better than ever. The hugely popular docu-series following the adventures of the maverick arctic airline Buffalo Airways returns for an action-packed fourth season. Visually stunning and emotionally gripping, Season Four takes viewers to places they - and Buffalo - have never gone before.","poster_path":"/mQIxoBbC9h8qKKfIv6uEbaTtoNk.jpg","season_number":4,"vote_average":0},{"air_date":"2013-10-23","episode_count":13,"id":84685,"name":"Season 5","overview":"This season opens with a meltdown when the C-46 suffers a major gear collapse on the runway, sending the entire Buffalo crew scrambling. As the coldest winter in decades grips Yellowknife, every pilot and mechanic in the company faces the huge challenge of keeping the aging fleet in the air. Buffalo's livelihood falls heavily on Joe's Lockheed Electra until a freak accident threatens to ground the plane. Hearing of an Electra up for sale, Joe heads on an urgent mission across the Atlantic. As the record-cold winter stretches on, a young hotshot pilot journeys all the way from Australia to earn a place in Buffalo's DC-3. And a longtime member of the Buffalo family leaves for good.","poster_path":"/zLI0PcfHp3IzPoTDP4NLpuZsGbB.jpg","season_number":5,"vote_average":0},{"air_date":"2014-10-29","episode_count":8,"id":84686,"name":"Season 6","overview":"Ice Pilots NWT is back. The hugely popular docu-series following the adventures of the renegade Arctic airline Buffalo Airways returns for a soaring sixth season. Visually stunning and emotionally gripping, Season Six takes viewers through the toughest ice storm Buffalo has ever faced.\n\nThis season opens with a meltdown when the C-46 suffers an engine fire on the runway, sending the entire Buffalo crew scrambling for a back-up plane. As the coldest winter in decades grips the Northwest Territories, every rampie and rookie pilot in the company faces huge challenges, including de-icing frozen up planes. Joe’s new Electra from England isn’t faring well either, as everything from its engines to instruments fail. Aspiring DC-3 pilot Prefkar Mony from India learns about northern living the cold, cruel way and later faces the wrath of Joe when he makes a serious mistake. Greenhorn rampies Jeff Tapper and Sam Storm are put to the test with their DC-3 checkflights, as they struggle with flight plan changes, food poisoning and plain old nerves. Down in California, it’s Buffalo’s top guns vs the rookies as they challenge each other in real fighter plane dogfights.\n\nPlus, there are new adventures for the McBryan clan. It’s a crazy year, as Joe goes from celebrating his 70th birthday with a flight in an old Sterman biplane to being forced to relinquish official control of the company. Mikey sets up a big D-Day tribute jump with Princess Patricia’s Canadian Light Infantry to celebrate the 70th anniversary of D-Day.","poster_path":"/e4ZEH3uhFvRJ3bDpz93dO9dz8te.jpg","season_number":6,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":7,"vote_count":4,"season_data":{"1":{"_id":"5258a77b760ee346616b4a4e","air_date":"2009-11-18","episodes":[{"air_date":"2009-11-18","episode_number":1,"episode_type":"standard","id":773989,"name":"Buffalo Air","overview":"Rookie co-pilot Scott faces his worst nightmare when a faltering Curtiss C-46 Commando engine and low fog force a scary landing. Ambitious young flyer Alex must prove himself when Buffalo's chief pilot gives him control of the 20-ton Douglas DC-4 for the very first time. And boss' son Mikey gets in hot water when \"Buffalo\" Joe needs the backup Douglas DC-3 – and it's nowhere near ready.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-25","episode_number":2,"episode_type":"standard","id":773987,"name":"Pre-Christmas Rush","overview":"Christmas is just around the corner, but Buffalo's crucial food and mail runs come to a halt. An engine seizure strands Scott, AJ and the C-46 plane, creating a chaotic chain reaction. Crusty mechanic Chuck must attempt a bare-handed engine swap in minus 30, and pressure from customers and co-workers pushes cargo manager Kelly to the breaking point.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-02","episode_number":3,"episode_type":"standard","id":773988,"name":"Birthday From Hell","overview":"A string of bad luck turns chief pilot Arnie's 66th birthday run into the flight from hell – and threatens to spoil his naughty birthday surprise. Ramp hand Jeremy is desperate to move up the ranks, but a female newbie could throw a wrench in his plans. And after the crew works all night to turn the DC-4 into a flying gas tanker, new co-pilot Alex flies a tricky fuel haul.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-09","episode_number":4,"episode_type":"standard","id":773995,"name":"A Big Deal","overview":"When a power failure leaves Rankin Inlet exposed to the brutal northern elements, captain Justin races to deliver an emergency generator. Ramp hand Jeremy tries to move ahead of co-worker Audrey by training a new hire from India to replace him. And when the recession nips at Joe's heels, he tries to broker a $7-million deal that could save Buffalo's hide.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-16","episode_number":5,"episode_type":"standard","id":773991,"name":"40/40/40","overview":"Mechanic Cory races against the clock to turn two short-haul waterbombers into trans-Atlantic aircraft for the epic journey to Turkey. It's up to engineer Adam to get the C-46 crew out of a jam on a remote airstrip in minus 40. And when captain Devan and co-pilot Scott encounter the menace of wind shear at notorious Bear Rock, it's a hair-raising experience that tests their friendship.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-23","episode_number":6,"episode_type":"standard","id":773997,"name":"On the Move","overview":"A charter flight falls through the cracks after the McBryans attend a wild family wedding, and an irate Joe pulls captain Justin from the Turkey test flights to do the job. Justin's task is to move an impatient Brit, his dog and all his worldly possessions to a remote northern outpost, but the weather isn't cooperating. Meanwhile, Devan ponders a job offer in Africa - leaving girlfriend Jynelle to ponder their future.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-30","episode_number":7,"episode_type":"standard","id":773992,"name":"Suspension","overview":"A furious Joe fights against a federal suspension that will prevent him from carrying passengers for the first time in 20 years. It's also a setback for Jeremy and the other rampies, which takes a turn for the worse with an unexpected injury. For the Turkey waterbomber team it's finally a go. Arnie, Justin and the crew set off on the first leg of their journey, a risky trip across Canada in the dead of winter, with no de-icing equipment.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-06","episode_number":8,"episode_type":"standard","id":773996,"name":"Cause for Celebration","overview":"AJ and Candace get married in the Ice Castle. A frustrated Chuck tries to get the Electra to pay her way. A flummoxed Mikey tries to bake a cake for Joe's birthday. And in Newfoundland, a fuel leak, a sobering survival course and a tragic crash rattle the Turkey crew.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-13","episode_number":9,"episode_type":"standard","id":773990,"name":"Transatlantic Crossing","overview":"The Turkey crew makes the critical jump over the North Atlantic. But en route to Portugal, one crew is forced to turn back. With no power on one engine and no way to maintain altitude, they must get back into Santa Maria, where the airport is on full emergency alert. And Mikey and Scott search for a new rampie, while Jeremy's hopes plummet even further.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-20","episode_number":10,"episode_type":"standard","id":773994,"name":"Thin Ice","overview":"Joe gets a lucrative late-season contract to fly mining equipment to an airstrip on a frozen lake, sending C-46 and DC-4 crews on a race against the spring melt. But conflict erupts between Devan and a senior pilot. And when the client reports an on-site incident, Joe goes on the warpath. Though Jeremy has missed a number of flight attendant classes, he's confident he can catch up to fellow rampies Audrey and Wilf. But too much confidence just may be a dangerous thing. And over the North Atlantic, Arnie, Justin and Cory press on to Turkey, even though they have only half of the spare parts in their plane. But there are some serious volcanoes and busy Mediterranean air traffic ahead.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-27","episode_number":11,"episode_type":"standard","id":773998,"name":"The Crash","overview":"Across the world in spectacular Izmir, after thousands of hours of painstaking preparation and life-risking flying, a terrible accident devastates the Turkey crew - and everyone at Buffalo Airways. In Yellowknife, the spring melt is well underway, and northerners are finding ways to celebrate, from checking out the melting waterfalls to racing jet boats onto the remaining river ice. It's also Wilf's first run as flight attendant on the DC-3 - for which he insists on wearing a shirt and tie to the consternation of the entire company. It's the final push Jeremy needs to move to HQ in Yellowknife. Kelly and Jynelle dig up a house-warming surprise that practically brings tears to the gruff rampie's eyes.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-03","episode_number":12,"episode_type":"standard","id":773993,"name":"Change of Seasons","overview":"Cargo manager (and unofficial Buffalo den mother) Kelly has problems enough when Jynelle's holiday leaves her shorthanded. But when her engineer husband Juan quits on the spot after a blowout with Joe, Kelly is left in a terrible position. Will Kelly stay - or will she go? Scott also gets bad news: he must stand down from flying so a rival co-pilot can be fast-tracked to captain. Scott pulls out all the stops to secure a new contract flying practically to the North Pole, which will get him back in the pilot's seat. But his rival is also interested in this new dream job - flying the C-46 to Eureka, a tiny research station at the top of the world. And after nine months of brutal work and tough luck, Jeremy sees light at the end of the tunnel. Buffalo needs a new DC-3 co-pilot, and contrary to expectation, he's getting a crack at it. But first, he's got to pass the test of flying with Joe.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-13","episode_number":13,"episode_type":"finale","id":773999,"name":"Up in the Air","overview":"After her husband's acrimonious departure from Buffalo, Kelly has a confrontation that decides whether she, too, will quit. Jeremy makes a mistake that could end his Buffalo career. An aviation gas shortage brings a sobering dose of reality to the McBryans. And after a visit from his mom, fate throws Scott an unexpected curve ball. When the dust settles, someone will be leaving Buffalo Airways.","production_code":"","runtime":60,"season_number":1,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"It’s the last frontier. And these are the last of the true Arctic aviators. Young pilots with a taste for adventure have come here to earn their wings, flying vintage steel built for war. But it’s a different war now: a war against bitter cold and constant breakdowns, a war to get the job done, a war to stay alive flying in the toughest conditions on the planet. The job: to haul people and vital fuel and supplies to far flung outposts in the Canadian North. Piloting sturdy old warbirds built for punishment, they’re learning with every hard knock, pulling together even as they compete to rise up the ranks. It’s an impossible job with antique equipment in a merciless place.","id":44313,"poster_path":"/AqGGP01VLNhNnToxtmWrFKvUN37.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258a77b760ee346616b4a64","air_date":"2011-01-12","episodes":[{"air_date":"2011-01-12","episode_number":1,"episode_type":"standard","id":774016,"name":"Frozen Four","overview":"Joe fights the feds while Justin and his crew are stranded in the High Arctic.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-19","episode_number":2,"episode_type":"standard","id":774025,"name":"Fire and Ice","overview":"When a deadly fire destroys a northern outpost a week before Christmas, Kelly puts aside her personal dilemmas to rally Buffalo to the rescue. Scott and AJ face an onboard alarm.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-26","episode_number":3,"episode_type":"standard","id":774020,"name":"Under Pressure","overview":"Roommate pilots Devan and Scott experience a mysterious rise in oil pressure that could destroy one of the C-46's engines. Rookies Andrew and Graeme face the test they've been training for – the chance to get \"checked out\" as DC-3 co-pilots.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-02","episode_number":4,"episode_type":"standard","id":774022,"name":"The Right Stuff","overview":"Mikey goes on a Venezuelan treasure hunt for a rare CL-215 waterbomber, and new pilots Andrew and Graeme face their toughest test yet - flying with irascible boss Joe McBryan.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-09","episode_number":5,"episode_type":"standard","id":774015,"name":"The River Lift","overview":"Buffalo launches an all-out campaign to airlift 100,000lbs of essential goods to cut-off northern communities, Justin helps a Mountie move and expectant parents Rod and Sasha show off their 3D ultrasound.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-16","episode_number":6,"episode_type":"standard","id":774017,"name":"Don't Muck with Chuck","overview":"Crusty mechanic Chuck scrambles to ready the Electra for a mission to the High Arctic, and former rampie Audrey returns to Buffalo and reignites the battle of the sexes.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-23","episode_number":7,"episode_type":"standard","id":774021,"name":"The Finish Line","overview":"A multi-stop mission to the Far North pits Devan, Scott and Adam in an ongoing battle for fuel and oil as they circuit their destinations. Audrey goes on a northern adventure escorting a team of dog mushers to the 2010 Arctic Winter Games.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-02","episode_number":8,"episode_type":"standard","id":774019,"name":"Ski Plane","overview":"Young pilots AJ and Andrew get the chance of a lifetime to fly the DC-3 mounted on snow skis, and tension mounts across the company as Buffalo’s Mackenzie Valley food mail delivery contract is up for renewal.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-09","episode_number":9,"episode_type":"standard","id":774014,"name":"Buffalo Scores","overview":"Buffalo flies the Stanley Cup on a tour of the North, and a licence suspension has Joe looking for a captain to replace him on the passenger run he’s flown for almost 30 years.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-16","episode_number":10,"episode_type":"standard","id":774018,"name":"Special Delivery","overview":"Chief pilot Arnie lands the DC-3 on a homemade sand strip at a remote lodge. Electra expert Chuck faces off with a stubborn power unit, and Rod's wife Sasha goes into labour.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-23","episode_number":11,"episode_type":"standard","id":774023,"name":"Yukon","overview":"When thunderstorms and a shaky engine threaten a charter to Whitehorse, Joe pulls out all the stops to get the passengers to their destination, while baby Emma Rae McBryan visits the hangar for the first time.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-30","episode_number":12,"episode_type":"standard","id":774024,"name":"British Invasion","overview":"A potential Electra plane purchase in Coventry, England has Joe showing Mikey the ropes of international business. New dad Rod misses his daughter while away on a job.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-06","episode_number":13,"episode_type":"finale","id":774013,"name":"Arnie Calls It","overview":"While training pilots for the upcoming fire season, chief pilot Arnie makes an unexpected announcement. Joe and the whole McBryan family head to the Super Bowl of aviation - AirVenture Air Show in Oshkosh, Wisconsin.","production_code":"","runtime":60,"season_number":2,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"Ice Pilots NWT is back. The hit docu-series following the adventures of renegade Buffalo Airways returns for a second season of nail-biting challenges and compelling stories, featuring the pilots and crew who put it all on the line flying vintage warplanes across the Arctic. Our favourite faces and some new rookies show up for another season of thrills, chills, laughter and their most personal stories yet.","id":44315,"poster_path":"/ywaOsEPL64a7PsXI0Pq0QlUX1L6.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258a77b760ee346616b4a59","air_date":"2011-10-12","episodes":[{"air_date":"2011-10-12","episode_number":1,"episode_type":"standard","id":774008,"name":"Under New Management","overview":"Joe hires outsider Duane Hicks to help Buffalo navigate the future and coach Mikey. Gord and Sean's DC-3 delivery mission to the High Arctic goes awry when blizzard conditions and a broken oil cooler force an emergency landing.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-19","episode_number":2,"episode_type":"standard","id":774012,"name":"Dambusters","overview":"Buffalo gets into the stunt flying business when veteran pilot Arnie flies the DC-4 for the re-enactment scene of a famous WWII bombing raid. A routine C-46 flight becomes dangerous when a hole in the plane's aging exhaust system sets off the fire alarm, and Devan has to decide whether or not to shut down an engine mid-flight.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-26","episode_number":3,"episode_type":"standard","id":774000,"name":"Chuck Walks","overview":"Critical of the many stops and starts in the Electra program, and frustrated with the constant drama at Buffalo, Chuck quits. Joe clashes with the maintenance department when a series of delays puts the sale of an old Canso waterbomber in jeopardy. Mikey goes on an ATV hunting trip and Rod babysits his daughter, Emma Rae, while his wife Sasha goes to a wine gala in town.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-02","episode_number":4,"episode_type":"standard","id":774003,"name":"Gear Up, Gear Down","overview":"Frustrated with her lack of flying and stuck in a rut as a courier driver, Audrey decides her time at Buffalo is over. Devan, Ian and Jimmy deal with a hydraulic fluid leak in the C-46 on the valley run, which forces Jimmy to crawl into the \"hell hole\" and crank down the landing gear by hand.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-16","episode_number":5,"episode_type":"standard","id":774001,"name":"Big Boost","overview":"When a ferry breakdown causes a gasoline shortage in Yellowknife, new manager Duane begs Chuck to return and prepare the Electra for a fuel haul. Cory leads a clandestine rescue mission to retrieve an abandoned C-46 and Mikey escapes to Ottawa for a birthday joyride in a fighter jet.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-23","episode_number":6,"episode_type":"standard","id":774010,"name":"Power Struggle","overview":"Duane lands a huge contract for the Electra and puts enormous pressure on mechanic Adam to prep the plane without the help of his mentor Chuck. Kelly plans her Mexican wedding, but Jynelle's sudden resignation leaves her in the lurch. The power goes out in Yellowknife, spurring Joe into crisis mode.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-30","episode_number":7,"episode_type":"standard","id":774009,"name":"Top of the World","overview":"The Electra flies to Alert, the northernmost settlement on Earth, forcing Adam and new senior manager Duane to work things out. Hay River rampie Tyler is on the fast track to a co-pilot seat, but first has to prove his flying ability to Buffalo's new chief pilot, Justin.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-07","episode_number":8,"episode_type":"standard","id":774011,"name":"Last Days","overview":"Sparks fly when Joe discovers Gord has taken a job with a rival airline after completing expensive training on one of the Buffalo planes. Larry, a rookie rampie, makes a near fatal error while training on the C-46. A desperate search is launched for elusive C-46 parts.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-14","episode_number":9,"episode_type":"standard","id":774004,"name":"Push Comes to Shove","overview":"Trying to make his mark at Buffalo, Duane lands two more Electra contracts. But his over-zealous efforts result in a clash with the crew and with Joe, and a down-to-the-wire midnight departure to meet a deadline. Rookie DC-3 co-pilot Tyler discovers that landing the big plane takes practice.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-21","episode_number":10,"episode_type":"standard","id":774006,"name":"The Doghouse","overview":"Duane's decision to leave the Electra crew unsupervised while he spends time at home jeopardizes the completion of a major contract, and could cost him his job. Young DC-3 co-pilot Graeme sees his chance to move up to a bigger plane disappear when he falls out of favour with Joe.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-04","episode_number":11,"episode_type":"standard","id":774002,"name":"Ice Strip","overview":"Mechanic Jimmy is sent to a northern mining camp to create an ice landing strip on a remote lake where AJ will have to land a DC-3 and the much bigger C-46. New co-pilot Tyler faces the ultimate test – flying the sked with Joe. And Mikey turns the Buffalo hangar into a playhouse for his niece’s first birthday.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-11","episode_number":12,"episode_type":"standard","id":774005,"name":"Expect the Unexpected","overview":"Engine troubles on the C-46 during the valley run force Devan to shut down an engine. High winds wreak havoc for Devan and his crew on another C-46 mission to help clean up an oil spill in the Northwest Territories. Scott trains on a CL-215 waterbomber and visits his mentor Arnie, then joins the waterbombing crews when Buffalo is called in to fight a massive fire in Alberta.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-18","episode_number":13,"episode_type":"finale","id":774007,"name":"Coming Home","overview":"Rookie waterbomber pilot Scott gets his first taste of action when Buffalo responds to an emergency callout to fight fires in Alberta. Mikey and Rod think they hit the jackpot when they buy a million dollar firefighting plane on eBay at a bargain price. Joe marks his 50 years of flying by returning to the place he grew up in his historic Norseman. And Arnie shows up in Yellowknife to cheer on daughter Caitlin in a cancer fundraiser.","production_code":"","runtime":60,"season_number":3,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"The immensely popular docu-series following the adventures of the maverick Arctic airline, Buffalo Airways, returns for a third season. Full of white-knuckle missions and in-your-face personal stories, Season Three will enthrall viewers with tales of Buffalo's extraordinary vintage warplanes servicing remote communities in the extreme conditions of Canada's North.","id":44314,"poster_path":"/rislXs1sYr0DChbeuj5FOMfs5zt.jpg","season_number":3,"vote_average":0},"4":{"_id":"5258a77b760ee346616b4a38","air_date":"2012-11-07","episodes":[{"air_date":"2012-11-07","episode_number":1,"episode_type":"standard","id":773975,"name":"Dark Skies","overview":"Joe performs stunt landings for a film crew; new employee Ryan tries to prove his worth in Hay River; a dental hygienist gets thrown into the hot seat.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-14","episode_number":2,"episode_type":"standard","id":967474,"name":"Shut Down","overview":"Canadian Prime Minister Stephen Harper visits Buffalo Airways; Joe clashes with inspectors; the Electra crew flies to Sachs Harbour for a meaty assignment.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-21","episode_number":3,"episode_type":"standard","id":773966,"name":"A Tale of Two Pilots","overview":"Weighed down by the responsibility of training a new rampie, and struggling to get out of Joe's doghouse, DC3 co-pilot Tyler gets a once in a lifetime opportunity to stunt fly in his Cessna 180 for a visiting film crew. Meanwhile another Buffalo co-pilot, Andrew, is up for a job with Cathay Pacific Airlines. The last time a pilot left, Joe took it personally.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-29","episode_number":4,"episode_type":"standard","id":773970,"name":"Ice Jam","overview":"After taking command of an intense airlift, and dealing with the ugliest Electra load he's ever seen, Scott takes a scary fall on the icy tarmac. City girl Christine moves to Yellowknife to give the unglamorous rampie life a shot, firebrand mechanic Chuck returns to the Buffalo hangar and immediately stirs the pot, while Joe helps out an old friend, \"Ice Road Trucker\" Alex Debogorski.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-06","episode_number":5,"episode_type":"standard","id":773971,"name":"A Very Buffalo Christmas","overview":"A week before Christmas, Buffalo agrees to lend a hand to an RCMP initiative to fly toys to isolated communities in the north. But a series of problems with the Electra leave the company in a jam. An excess of holiday freight overwhelms cargo manager Kelly, and despite a visit from her buddy Arnie Schreder, recovering from his cancer treatment, her stress peaks after a clash with Joe.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-12","episode_number":6,"episode_type":"standard","id":773976,"name":"Crash Landing","overview":"Just months from retiring, Electra captain Ray Weber leads his crew on a multi trip mission that requires landing on a rough ice strip on a remote lake. The ice strip landing goes fine, but when the plane takes off from the strip, the right landing gear gets stuck in the wheel well. Ray and his crew try to get the wheel down but to no avail, and are forced to perform an emergency landing that they'll never forget.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-19","episode_number":7,"episode_type":"standard","id":773974,"name":"For Sale By Owner","overview":"When South Korean buyers come to Buffalo to look at a water bomber, the pressure is on mechanic Cory to get the plane ready. But a landing gear emergency puts him and chief pilot Justin in serious danger. Rod and Mikey salivate over a fleet of P3 Orion water bombers up for auction at a California fire fighting conference.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-02","episode_number":8,"episode_type":"standard","id":773968,"name":"Over Seas","overview":"Buffalo has to get a CL-215 water bomber to buyers in Korea. So Justin and Cory fly the plane to Vancouver Harbour, where it will be hoisted onto a cargo ship sailing across the Pacific Ocean to its destination – a method of delivery no one has ever tried. Flight attendant David is fast-tracked to a seat next to Joe on the DC3 sked. But Joe's been on the warpath, and is known for being hard on rookie copilots.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-09","episode_number":9,"episode_type":"standard","id":773977,"name":"Water Wings","overview":"In South Korea, Cory and Justin meet the ship delivering Buffalo's water bomber plane to new buyers there. But the boys are frustrated by the buyers' poor planning. Tempers flare when they try to get the plane off the ship and delivered to its final destination. After taking part in a military paratrooper jump, Mikey brings in fashion model Kate Eaton to join his team for the Frostbite 45 snowshoe marathon.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-16","episode_number":10,"episode_type":"standard","id":773973,"name":"Meltdown","overview":"As spring arrives and Ray's retirement day approaches, Sean surprises everyone by leaving Buffalo for a job with the competition. So Buffalo brings in Electra pilot Brian Harrison to finish the contract. But as ice strip conditions deteriorate, each flight is riskier than the last. When Buffalo gets the news of former chief pilot Arnie Schreder's passing, Justin flies a DC3 to pick up Arnie's family in Kelowna and brings them back to Yellowknife for a special memorial remembering the aviation legend.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-23","episode_number":11,"episode_type":"standard","id":773969,"name":"North Atlantic Convoy","overview":"Greenland's Narsarsuaq airport – known as one the world's most dangerous approaches – looms on the horizon as Cory and Justin begin a trans-global journey to deliver two CL-215 water bombers to Turkey. Christine pushes to become a DC3 co-pilot, but Joe throws a wrench into her plan. Mikey travels to Denmark, for the new Polarland attraction at the Legoland theme park, featuring exhibits inspired by Buffalo Airways, including Lego versions of Joe and Mikey.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-30","episode_number":12,"episode_type":"standard","id":773972,"name":"Sunk","overview":"Joe and Mikey hire a helicopter for a salvage mission to retrieve the rare tailpiece from a Lockheed 10A that crashed in the Yellowknife woods forty years ago. It's a personal quest for Joe; he flew that plane at the beginning of his career. Justin and Cory battle severe icing that threatens to send them plummeting into the frigid North Atlantic on the longest ocean leg of their CL-215 water bomber journey to Turkey.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-06","episode_number":13,"episode_type":"finale","id":773967,"name":"Turkey or Bust","overview":"Justin and Cory are stranded in Croatia while trying to complete the delivery of two CL-215 water bombers to Turkey. Metal rock band Iron Maiden's lead singer Bruce Dickinson flies Buffalo's DC3 from Edmonton to Yellowknife – then tries his hand at the four engine DC4. Mikey goes on a fitness blitz to meet the weight requirement to fly in an CF-18 fighter jet during the Yellowknife Airshow.","production_code":"","runtime":60,"season_number":4,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"Ice Pilots NWT is back and better than ever. The hugely popular docu-series following the adventures of the maverick arctic airline Buffalo Airways returns for an action-packed fourth season. Visually stunning and emotionally gripping, Season Four takes viewers to places they - and Buffalo - have never gone before.","id":44311,"poster_path":"/mQIxoBbC9h8qKKfIv6uEbaTtoNk.jpg","season_number":4,"vote_average":0},"5":{"_id":"589716b3925141294a01397a","air_date":"2013-10-23","episodes":[{"air_date":"2013-10-23","episode_number":1,"episode_type":"standard","id":1264902,"name":"Cold Start","overview":"Mikey gets the opportunity of a lifetime when he's invited to host a classroom discussion with Commander Chris Hadfield, calling in from the International Space Station. But reality soon hits, when the first blast of a record-cold winter grounds the DC-4, causing a major backup and grief for new cargo manager Chris Staples. When Mikey dispatches the C-46 to save the mission, it suffers a landing gear collapse on the runway, forcing the entire staff to scramble – with no word on the state of the flight crew.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-30","episode_number":2,"episode_type":"standard","id":1264903,"name":"Shootout","overview":"Buffalo Airways is still reeling from the recent accident – especially mechanic Chuck. Mikey tries to lift spirits by setting up a hockey shootout against a squad of NHL players that the airline is transporting around the north. He drafts a team and Buffalo's best players – including Chuck – test their shots against Ottawa goalie Craig Anderson. Young DC-3 co-pilot David flies farther north than he's ever been, facing a mysterious landing gear problem on approach to a remote Arctic airstrip. When his captain gets flustered, the rookie has to keep his cool.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-06","episode_number":3,"episode_type":"standard","id":1264904,"name":"Snowplane","overview":"Joe preps for a race in an antique snowplane – a 1940s ancestor of the snowmobile, powered by an airplane engine and devoid of brakes. No one knows what will happen when he unleashes it on frozen Great Slave Lake. The water bomber crew, led by Justin and Cory, try to move their two fire-fighting planes from Turkey to a maintenance facility in Wales, but get tangled up in red tape, threatening to ruin their chance of meeting up with Iron Maiden front man Bruce Dickinson. Rampie and cocky aspiring pilot Chris Staples pushes his way onto a C-46 flight, where he makes a critical mistake. AJ makes a last-second overshoot.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-13","episode_number":4,"episode_type":"standard","id":1264905,"name":"Gear Lock","overview":"After a breakdown uses up the last of Joe's spare DC-3 engines, he enlists former Buffalo pilot Devan Brooks to ferry another plane all the way from Quebec. Flying 3,000 kilometres in a DC-3 that's been mothballed for 7 years, Devan faces a critical hydraulic leak at the worst possible moment. As a massive cold snap paralyzes the hangar, a major landing gear problem strikes the nightly passenger flight to Hay River. Captain Justin Simle has to make a snap decision with a full load of passengers on board – including his own newborn son.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-20","episode_number":5,"episode_type":"standard","id":1264906,"name":"Aussie Ace","overview":"Following almost a year of repairs after its crash landing, Buffalo Airways' Electra returns home to take on an urgent mission – returning to the very ice strip that set off the problems last year. It's the ultimate test for the plane and the crew. DC-4 co-pilot Tyler makes a major decision about his future, but now he has to face Joe. A pilot shows up out of the blue – all the way from Australia. Will Dyer has ten times the experience of a normal novice and quickly works to win a seat in a Buffalo cockpit. But the company throws him a curveball that puts his future in doubt.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-27","episode_number":6,"episode_type":"standard","id":1264907,"name":"Rock Stars and Rampies","overview":"Joe's stress over the state of his water bombers, currently being stored in Wales, sparks an angry blow up with Cory, pushing Cory and Rod to head to the UK for urgent repairs. A day of culture in London leaves the hosers cold until they hook up with their British host, Iron Maiden's Bruce Dickinson. But at Bruce's Welsh facility they run into snags that threaten the work. David flies with Devan in the C-46, hoping to show how much he's learned. But when David badly botches a takeoff, Devan threatens violence. Instead of flying, hotshot Aussie Will gets stuck working on the ramp in Hay River, pushing him to a harsh ultimatum.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-04","episode_number":7,"episode_type":"standard","id":1264908,"name":"Ice Camp","overview":"Mikey joins the Canadian Rangers for an extreme outdoor training experience farther north than he's ever been. While he's gone, a military Aurora takes refuge in Buffalo's hangar for important repairs – pushing Buffalo's own mechanics out into the bitter cold. What should be a simple fix turns into a multi-day ordeal and the Air Force has to go head-to-head with Chuck. Joe flies to California to bid on a fleet of firefighting planes that could revolutionize his company. But he discovers he has tougher competition than he ever expected.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-11","episode_number":8,"episode_type":"standard","id":1264909,"name":"Frozen Solid","overview":"It's Joe's 69th birthday and he's never flown a helicopter before. So Mikey plans a special gift of chopper flight lessons, complete with surprise pickup in front of the Buffalo hangar. Mikey jumps in for the ride as Joe struggles with the unfamiliar beast – and both McBryans will learn if they've finally found an aircraft that Joe can't master. Another cold snap has cut off heat and power in a small northern town. AJ and James battle a frozen engine before they can head up with a load of supplies. On the way home, an engine fire forces the crew into an emergency shutdown.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-18","episode_number":9,"episode_type":"standard","id":1264910,"name":"Power Crash","overview":"The Electra has become Buffalo's winter workhorse – the one plane they need to keep flying. During a High Arctic delivery mission, a 5,000-pound power unit tips off the forklift and crashes to the ground, smashing the fuselage – and sending Mikey into crisis management mode. With no backup Electras, Joe races to Atlantic Airways in Coventry, England on an urgent mission to scoop one up from other potential buyers while back at Buffalo, Mikey tries to prove he's really management material.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-08","episode_number":10,"episode_type":"standard","id":1264911,"name":"Breakdown","overview":"Co-pilot Graeme Ferguson gets the biggest opportunity of his short career when Buffalo needs to train a second Electra crew. But none of Buffalo's piston-pounders have prepared him for a plane this big and this fast. When Graeme fumbles a landing, he has to prove he's ready for his big chance after all. Meanwhile, Chris Staples gets to take the test he's been dreaming about – to qualify as a co-pilot in the C-46. But he'll have to take it with one of the toughest captains on the crew. When the C-46 breaks down in Deline, Adam Smith rushes to the rescue and Chris might finally get his chance to shine.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-15","episode_number":11,"episode_type":"standard","id":1264912,"name":"Target Practice","overview":"The Electra is still working around the clock and Buffalo is ready to pick up another, the second of its new British acquisitions. Joe and Mikey head across the Atlantic to fly home their new baby, ending an era of British aviation. Devan preps for fire season with some wild target practice in the DC-4 to see if his aim lives up to his cockiness. When James' son enters the local soapbox derby, James builds a Buffalo-style racer and finds out how his ugly green machine stacks up against the slick and pretty competition.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-22","episode_number":12,"episode_type":"standard","id":1264913,"name":"Air Show","overview":"Mikey and Joe visit the Hamilton air show where Mikey has planned a major surprise for Father's Day. Joe is going to ride along in a CT-114 Tutor Jet with the famous Snowbirds. While Joe prepares for the big event, Mikey decides to conquer his fear of heights. He travels down the highway to Toronto and tries out the CN Tower \"Edgewalk.\" But he's determined to go even higher. After all the bonding he and Joe have done in Hamilton, Mikey takes his first pilot lesson with Joe as the teacher. It turns out there are some heights Mikey still fears. As spring warms up Yellowknife, a longtime member of the Buffalo family announces a surprise departure.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-29","episode_number":13,"episode_type":"finale","id":1264914,"name":"Five Seasons","overview":"It's been a wild five years for ICE PILOTS NWT. To celebrate the milestone, we pull back the curtain for an inside glimpse into the production of the TV show, and allow the cast of Buffalo characters to reflect on how it's affected their lives, for better or for worse. And we meet the cameramen who navigate prickly personalities and brave minus-forty conditions to capture the footage that has made ICE PILOTS NWT a cult phenomenon.","production_code":"","runtime":60,"season_number":5,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"This season opens with a meltdown when the C-46 suffers a major gear collapse on the runway, sending the entire Buffalo crew scrambling. As the coldest winter in decades grips Yellowknife, every pilot and mechanic in the company faces the huge challenge of keeping the aging fleet in the air. Buffalo's livelihood falls heavily on Joe's Lockheed Electra until a freak accident threatens to ground the plane. Hearing of an Electra up for sale, Joe heads on an urgent mission across the Atlantic. As the record-cold winter stretches on, a young hotshot pilot journeys all the way from Australia to earn a place in Buffalo's DC-3. And a longtime member of the Buffalo family leaves for good.","id":84685,"poster_path":"/zLI0PcfHp3IzPoTDP4NLpuZsGbB.jpg","season_number":5,"vote_average":0},"6":{"_id":"58971cf69251412e1601844c","air_date":"2014-10-29","episodes":[{"air_date":"2014-10-29","episode_number":1,"episode_type":"standard","id":1264915,"name":"A Ball O'Snags","overview":"It’s Buffalo’s busiest winter yet, and they roll out the C-46, TXW, to fly all the freight up the Mackenzie Valley. But when one of TXW’s engines catches fire, Buffalo scrambles to find a backup plane in time for Christmas deliveries. They look to their newly purchased Electra, XFC, to fill the void, but Adam, Chuck, Brian and Mikey discover it has a cracked windshield and cannot be flown safely. Joe, Brian and Cory fly to meet Rod in Red Deer to grab a replacement windshield. When they arrive, Joe first reveals his other plans—he wants the second Electra ZFE dug out of the snowbank where it’s been sitting for months and get it up and running so that it can replace XFC on the Valley run. Rod’s upset that he wasn’t given more notice, and unloads on Mikey about Joe’s reactionary management style. Back in Yellowknife, Buffalo’s newest rampie, Prefkar Mony, is a determined young pilot from India who’s got his eyes on flying Joe’s prize planes. But first he has to adjust to life in the North—and purchasing proper winter gear is the first thing on his list","production_code":"","runtime":60,"season_number":6,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"589732029251412e0d018f8f","adult":false,"gender":0,"id":1750995,"known_for_department":"Writing","name":"Rebeka Herron","original_name":"Rebeka Herron","popularity":0.828,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"589731ee9251412e14017d7b","adult":false,"gender":0,"id":1750994,"known_for_department":"Directing","name":"Jereme Watt","original_name":"Jereme Watt","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-11-05","episode_number":2,"episode_type":"standard","id":1264916,"name":"Ice Storm","overview":"Chief Pilot AJ Decoste is flying up the Mackenzie Valley with Buffalo’s newest Electra, XFC, for the first time. Mechanic Cory Dodd is along for the ride to do some training as a Flight Engineer. They try to make their deliveries before a storm rolls in but when they land in Norman Wells, they are faced with gale force winds. When their takeoff is delayed by two incoming planes, AJ is forced to shut down and wait out the storm in Norman Wells. Later, on their approach to Tulita, they face even stronger winds gusting over 40 knots. Over in Hay River, things go from bad to worse when a warm weather system brings the threat of a rare ice storm. Two daily skeds arrive from Yellowknife and the rampies have to batten down the DC-3s in preparation for a long, rough night—the worst storm in fifty years. And the newest rampie, CJ Asaf, just can’t seem to fit in. Rampie Prefkar is tasked with training CJ on the Hay River delivery route, but Prefkar can’t handle CJ or his attitude.","production_code":"","runtime":60,"season_number":6,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-12","episode_number":3,"episode_type":"standard","id":1264917,"name":"Old Dogs","overview":"When Buffalo’s newest Electra, ZFE, lands in Yellowknife with only three functioning engines, mechanic Chuck Adams comes to the rescue to replace a brand-new $29,000 regulator on engine number three. It’s been slow for the airline and delivering a load of building supplies to the RCMP up in Ulukhaktok, NWT, might help keep Buffalo in the air. Spurred by a recent crash landing and two engine fires, an audit team from Transport Canada descends on Buffalo Airways. With their long and tumultuous history with Joe, they demand that Buffalo appoint a new “Accountable Executive” within 72 hours, or risk being shut down. But Joe isn’t about to hand over the keys to the kingdom—not even to Rod, his oldest son. Mikey worries that if they don’t meet the deadline, Buffalo Airways could become Buffalo Spare Parts. Transport Canada isn’t the only thing on Joe’s mind; it’s becoming apparent that Joe’s 16-year-old rescue dog, Sophie, is on her last legs. One morning Joe finds Sophie lying under a plane, unable to stand up. Joe realizes that her time has come—he calls the vet.","production_code":"","runtime":60,"season_number":6,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-19","episode_number":4,"episode_type":"standard","id":1264918,"name":"Checkflight","overview":"Buffalo Joe has been a captain on the daily sked for 34 years and his 70th birthday is next week. Joe might have to stop flying if he doesn’t pass his medical and that could spell the end of Buffalo. Before Joe leaves to undergo five days of medical tests at the Mayo Clinic in Phoenix, Arizona, he calls two rampies, Sam Storm and Jeff Tapper, into his office to greenlight their DC-3 checkflights. Both Jeff and Sam have slogged away for eight months waiting for this chance. But on flight day, Sam is sick to his stomach from eating bad eggs the night before. Sam is not about to let a bad egg beat him and he helps Jeff prep DC-3, LFR. Just before takeoff, nausea wins—Sam has no choice but to back out and there’s no telling when he’ll get another chance. Jeff, on the other hand, has to overcome the jitters that have haunted him ever since he was in a crash landing earlier in the year. Mikey, Rod and his family prepare to greet Joe with a birthday cake shaped like a DC-3. At the last minute, Mikey gets a call that Joe isn’t coming back today; instead he’s decided to celebrate his own way—going for a ride in a classic 1940 Boeing Stearman biplane.","production_code":"","runtime":60,"season_number":6,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-26","episode_number":5,"episode_type":"standard","id":1264919,"name":"Second Chances","overview":"Newly minted copilot Jeff Tapper is excited for his first revenue DC-3, but his inexperience shows when he botches the approach and bounces the landing three times, nearly running off the runway. Meanwhile, for new rampie Prefkar Mony to realize his dream of becoming a DC-3 pilot, he needs to first pass the written IATRA test. He’s been studying for months, but on his first attempt, he fails. With the help of pilot/mechanic Chris Staples, Prefkar retakes the test and passes, but his victory celebration is short-lived when he’s blamed for leaving an expensive shipment of medicine marked “Do Not Freeze” in a courier van during a minus 30 weekend. Later, Mikey and Katie decide to find Joe a new dog and choose Muffy, a three-year-old dog from the SPCA who is ready to leave her pups. They bring her back to the hangar for a test drive. Joe brings DC-3 CUE out of retirement to test fly the plane for Buffalo’s summer sked duty and he brings along Jeff—and Muffy—to see if they’re Buffalo material.","production_code":"","runtime":60,"season_number":6,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-03","episode_number":6,"episode_type":"standard","id":1264920,"name":"Big Plans, Bad Luck","overview":"Mikey talks to a 15-year-old aviation buff in England via Skype, who has discovered that Buffalo’s DC3–WZS–flew on D-Day. This inspires Mikey to do something special for the 70th anniversary. He invites Cory to do a tandem parachute jump and finds out that Cory’s grandfather was a paratrooper at the invasion of Normandy. Meanwhile, Mikey takes mercy on Prefkar, working the ramp in Hay River, and offers him a chance for some pilot training on the morning DC-3 freighter. But when the time comes, Prefkar learns that he’s been bumped for pilot David Alexandre. It gets worse for Prefkar when he’s given another chance and this time the fog rolls in. Prefkar might not stick it out at Buffalo. Mikey’s D-Day plans get even bigger when he contacts the Princess Patricia Canadian Light Infantry, who were part of the Allied airborne forces that dropped behind German lines in 1944. He pitches his plan—a reenactment jump from WZS, an actual D-Day plane. But there’s a hitch: the plane needs to pass inspection, and Mikey needs to lose weight to make the cut for tandem jumping. Mikey tries everything he can think of—from juicing, working out with Dan at the gym and even sweating it out in spin class. Cory and Mikey go over what they need to refit DC-3 WZS for a static line jump. Cory is sent on a scavenger hunt for parts in Red Deer and finds a brand-new bracket from the 1940s—but they still need to find the missing rear bracket, and nobody even knows what it looks like.","production_code":"","runtime":60,"season_number":6,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-10","episode_number":7,"episode_type":"standard","id":1264921,"name":"Dogfight","overview":"Mikey shows a veteran Buffalo’s DC-3, WZS, Buffalo’s very own vintage plane from the Second World War. It is being fitted with a special ‘static’ line, which paratroopers will clip onto for a D-Day reenactment jump. But army inspectors tell Mikey a modern military needs a modern line with a winch system in case they need to retrieve a “hung-up jumper”. Cory and Mikey scramble to build the retrieval line before the inspector comes back to test it. But with their bumbling and fumbling, it doesn’t look like they will make the cut. Meanwhile, Chris Staples and some of Buffalo’s pilots head down to Fullerton, California, to Air Combat USA, where pilots get to experience aerial dogfights in real fighter planes. The pilots do yo-yos, spins and pull Gs to out-maneuver their opponent. First up in the dogfights are newly checked-out co-pilot Sam Storm versus longtime co-pilot David Alexandre. Sam wins the fight due to David’s inability to hold down his breakfast. Next up is cocky co-pilot Chris Staples versus his C-46 captain Devan Brooks. But Devan’s many years in DC-3s and C-46s have left him unprepared for the video game pace of dogfighting and he quickly loses 3-0. Finally, the two top guns return to the sky. Sam scores first, but Chris is not about to get beaten.","production_code":"","runtime":60,"season_number":6,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-17","episode_number":8,"episode_type":"finale","id":1264922,"name":"D-Day","overview":"The Buffalo boys gather in Red Deer for Mikey’s D-Day tribute jump. Joe and Sam scout out the designated military drop zone over Abraham Lake in the Rockies only to discover the canyon is too narrow for the DC-3. So Joe cancels the whole thing—it’s too dangerous. Mikey uses Joe’s own philosophy against him: at Buffalo, there’s always a backup plan. Joe flies out to scout a new location for the drop on the lake but hits bad weather. As Joe is about to scrap the trip, twenty paratroopers from the Canadian and American armies arrive for the big jump and are ready to go. They board WZS and Joe takes off to a site he hasn’t scouted, in weather that just keeps getting worse. As they near the drop point, he finally calls it—no jump tonight. They turn back, with all the troops still on board. Mikey’s only hope is a narrow window first thing the next morning—but only if Joe gives the final okay.","production_code":"","runtime":60,"season_number":6,"show_id":33057,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"Ice Pilots NWT is back. The hugely popular docu-series following the adventures of the renegade Arctic airline Buffalo Airways returns for a soaring sixth season. Visually stunning and emotionally gripping, Season Six takes viewers through the toughest ice storm Buffalo has ever faced.\n\nThis season opens with a meltdown when the C-46 suffers an engine fire on the runway, sending the entire Buffalo crew scrambling for a back-up plane. As the coldest winter in decades grips the Northwest Territories, every rampie and rookie pilot in the company faces huge challenges, including de-icing frozen up planes. Joe’s new Electra from England isn’t faring well either, as everything from its engines to instruments fail. Aspiring DC-3 pilot Prefkar Mony from India learns about northern living the cold, cruel way and later faces the wrath of Joe when he makes a serious mistake. Greenhorn rampies Jeff Tapper and Sam Storm are put to the test with their DC-3 checkflights, as they struggle with flight plan changes, food poisoning and plain old nerves. Down in California, it’s Buffalo’s top guns vs the rookies as they challenge each other in real fighter plane dogfights.\n\nPlus, there are new adventures for the McBryan clan. It’s a crazy year, as Joe goes from celebrating his 70th birthday with a flight in an old Sterman biplane to being forced to relinquish official control of the company. Mikey sets up a big D-Day tribute jump with Princess Patricia’s Canadian Light Infantry to celebrate the 70th anniversary of D-Day.","id":84686,"poster_path":"/e4ZEH3uhFvRJ3bDpz93dO9dz8te.jpg","season_number":6,"vote_average":0}}}