{"adult":false,"backdrop_path":"/nvOL71GLuYuV91I3AdSeE8x9POy.jpg","created_by":[],"episode_run_time":[42],"first_air_date":"2010-06-24","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.abc.go.com/shows/boston-med","id":33108,"in_production":false,"languages":["en"],"last_air_date":"2010-08-12","last_episode_to_air":{"id":774391,"name":"Season 1, Episode 8","overview":"Joseph Helfgot and James Maki have lived in different worlds. Helfgot has been a successful Hollywood marketing executive and the son of Auschwitz survivors. Maki is a mixed Blackfoot Indian and Japanese orphan adopted by an academic Japanese- American family. Maki's father was assigned the prestigious duty of helping draft the postwar Japanese Constitution. The son, deeply in conflict with his strict, successful family, dropped out of college to fight in Vietnam. He returned a heroin addict, drifter and criminal, soon abandoning his wife and baby daughter.\n\nFate brings Helfgot and Maki together in the operating rooms of one of America's top hospitals. In the second face transplant ever performed in the U.S., one man takes part of another man's identity. The surgery is headed by Bo Pomahac, a brilliant plastic surgeon who, two decades ago, fled communist Czechoslovakia to arrive on these shores practically penniless. Pomahac could not have imagined that he would one day make medical history.","vote_average":0,"vote_count":0,"air_date":"2010-08-12","episode_number":8,"episode_type":"finale","production_code":"","runtime":42,"season_number":1,"show_id":33108,"still_path":null},"name":"Boston Med","next_episode_to_air":null,"networks":[{"id":2,"logo_path":"/2uy2ZWcplrSObIyt4x0Y9rkG6qO.png","name":"ABC","origin_country":"US"}],"number_of_episodes":8,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Boston Med","overview":"From operating rooms to end-of-life meetings, the documentary series explores the culture of doctors and nurses and the conversations that happen outside the patient's earshot.","popularity":0.89,"poster_path":"/uyWzD5PEocA3KQWC6kP3IuETlGa.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2010-06-24","episode_count":8,"id":44358,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"The drama of real life unfolding inside the nation's best hospitals.","type":"Miniseries","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"5258a7a8760ee346616b7e11","air_date":"2010-06-24","episodes":[{"air_date":"2010-06-24","episode_number":1,"episode_type":"standard","id":774390,"name":"Pilot","overview":"A surgeon tries to perform a double-lung transplant on little sleep.","production_code":"","runtime":42,"season_number":1,"show_id":33108,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-01","episode_number":2,"episode_type":"standard","id":774386,"name":"Season 1, Episode 2","overview":"Renee Peerless has spent nearly nine months of her pregnancy alone while her husband serves with the military in Iraq. His absence is made more difficult by the knowledge that their baby in utero has a serious heart defect and will need surgery within days of being born. A story of courage and hope, viewers will recognize the universal themes of motherhood, duty and determination that summon the best from us in difficult situations.\n\nJohn \"JD\" Daniels is a chief cardiothoracic resident. His own father's life-saving heart surgery set him on a course to become a doctor. His commitment to his chosen profession is total but the strains that long hours place on his young family are evident.\n\nAmanda Grabowski was ER \"nurse of the year.\" Her innocent good looks conceal a tart-tongued, no-nonsense pro who deploys a lacerating wit when needed to keep colleagues and patients in line.","production_code":"","runtime":42,"season_number":1,"show_id":33108,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-08","episode_number":3,"episode_type":"standard","id":774392,"name":"Season 1, Episode 3","overview":"Rick Reish is a first year surgical intern, who despite his boyish looks, tries to protect an unruffled demeanor. He takes a compassionate approach to patients and hopes they will respond politely. However, things don't always go smoothly for the rookie doctor. In one instance, he has a comical encounter with a mother and daughter asking him to prescribe a strong narcotic. When Reish refuses to grant their request, the women become abusive and he is forced to retreat.\n\nWill Curry is a second generation African-American surgeon. He has trained at top institutions and is an attending at one of the nation's best hospitals. Yet, acquiring these credentials did not stop a patient from mistaking him as a janitor. In this episode, Curry performs a nearly inconceivable brain surgery on a young father with a tumor that will kill him if it is not resected.\n\nAmanda Grabowski returns in this episode with a case that leaves her unsettled. We also learn more about her personal life and hopes for the future.","production_code":"","runtime":42,"season_number":1,"show_id":33108,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-15","episode_number":4,"episode_type":"standard","id":774388,"name":"Season 1, Episode 4","overview":"Jeff Ustin is a fiery sparkplug of a doctor with the unwavering commitment to his patients. A brilliant trauma surgeon, he sometimes uses his temperament to get a point across. When a geriatric patient is overmedicated or a cardiologist is unavailable to view a scan, he explodes in Technicolor.\n\nSara Dumas us a teenager beloved by friends and family. High-spirited and curios about the world, she is hampered by a congenitally diseased heart that will kill her within weeks if a donor can't be found. For any mother, this would be a nightmare. However, Sara's mother also has to content with the realization that the family will go through everything twice. Sara's brother, Ian, has the exact same ailment as his sister.\n\nAndrew \"Bardouche\" ElBardissi is a fellow intern and best friends with Rick Reish. Together, they spend their precious downtime trying to generate a social life and conspiring about how to date nurses. At work, these two supremely confident rookies are hazed by the senior doctors training them. ElBardissi shows great technical promise as a surgeon and cares deeply about patients.","production_code":"","runtime":42,"season_number":1,"show_id":33108,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-22","episode_number":5,"episode_type":"standard","id":774389,"name":"Season 1, Episode 5","overview":"Kelly Wright is a study in contradictions. She is a gay Texan and a second year resident in Ob-Gyn. Working in women's health, she says. People assume she is liberal. In fact, she is a devout Christian who won't perform abortions unlike most of her fellow residents. A case in which a woman died in childbirth, and the break-up of an important relationship have colored her first years of residency and led to career doubts.\n\nMike O'Donnell is from a working-class Boston neighborhood, loves the Red Sox and is a doting father and devoted husband. Like Amanda, he has also been voted \"nurse of the year.\" Viewers will watch him save a little girl's life and win the lasting gratitude of a shaken family.\n\nKim Parks is a cardiologist assigned to work with heart transplant patients. One of them is Marvin Pollet, a middle-aged detective from Louisiana with a rare disorder affecting his heart that will kill him if a donor heart can't be found. He may be too sick to be eligible to be listed for transplant, and Parks who becomes emotionally involved with Marvin and his family has to lobby colleagues to get him on the list. It is a powerful story about the bond that can form between a patient and a caregiver.","production_code":"","runtime":42,"season_number":1,"show_id":33108,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-29","episode_number":6,"episode_type":"standard","id":774387,"name":"Season 1, Episode 6","overview":"The Michael Cyr Case is the powerful story of a young couple who bond with a heart surgeon committed to fixing a certainly fatal heart defect in their newborn. Things go awry when the baby's surgery doesn't turn out as planned. Now the family must make a choice about whether they will let the surgeon operate on their baby for a second time.\n\nRachel Clark is Kelly Wright's best friend at work. Like Kelly, Rachel is also a second year Ob-Gyn. Her mission is to be a world-class gynecological cancer surgeon. Rachel's job leaves her little time for her relationship with Jeff, a venture capitalist, who hopes to marry her. Trying to balance her work and personal life is stressful for this ambitious doctor who could double as a southern beauty queen.","production_code":"","runtime":42,"season_number":1,"show_id":33108,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-05","episode_number":7,"episode_type":"standard","id":774385,"name":"Season 1, Episode 7","overview":"Tom Alden is a 50-something former fisherman who lived life as \"the indestructible American male\" in his surgeon's words. That is, until he was diagnosed with colon cancer. Coming to terms with his own mortality is tricky psychological terrain for this confident and supremely self-reliant man. His surgeon, David Berger, is as good as they come but knows Tom's chances of survival will be affected by how far the cancer has spread.\n\nAmy Rezak is one of only a handful of female trauma surgeons at major hospitals. Gunshot wounds, car crashes, patients who are sometimes hopelessly maimed or injured, are typical in Amy's line of work. An adrenaline junkie with a dark sense of humor, Amy has what the military refers to as \"command presence\" in her OR. Her personal life is another matter. Like many other residents, she would rather go home to a relationship, if she could make one work, than an empty apartment.\n\nCaitlyn MacPhee is a 4-year-old little girl who is choppered to Children's Hospital Boston in the middle of the night with bleeding in the brain. Her family alternates between moments of frustration and gratitude toward hospital staff as they try to cope with a situation that most parents hope to never experience.","production_code":"","runtime":42,"season_number":1,"show_id":33108,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-12","episode_number":8,"episode_type":"finale","id":774391,"name":"Season 1, Episode 8","overview":"Joseph Helfgot and James Maki have lived in different worlds. Helfgot has been a successful Hollywood marketing executive and the son of Auschwitz survivors. Maki is a mixed Blackfoot Indian and Japanese orphan adopted by an academic Japanese- American family. Maki's father was assigned the prestigious duty of helping draft the postwar Japanese Constitution. The son, deeply in conflict with his strict, successful family, dropped out of college to fight in Vietnam. He returned a heroin addict, drifter and criminal, soon abandoning his wife and baby daughter.\n\nFate brings Helfgot and Maki together in the operating rooms of one of America's top hospitals. In the second face transplant ever performed in the U.S., one man takes part of another man's identity. The surgery is headed by Bo Pomahac, a brilliant plastic surgeon who, two decades ago, fled communist Czechoslovakia to arrive on these shores practically penniless. Pomahac could not have imagined that he would one day make medical history.","production_code":"","runtime":42,"season_number":1,"show_id":33108,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":44358,"poster_path":null,"season_number":1,"vote_average":0}}}