{
    "adult": false,
    "backdrop_path": "/6ya66UlOZeiq9IsHqevMV3fRA74.jpg",
    "created_by": [
        {
            "id": 65304,
            "credit_id": "5258a801760ee346616ba44e",
            "name": "Franc Roddam",
            "original_name": "Franc Roddam",
            "gender": 2,
            "profile_path": null
        }
    ],
    "episode_run_time": [],
    "first_air_date": "2010-09-12",
    "genres": [],
    "homepage": "",
    "id": 33160,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2020-11-09",
    "last_episode_to_air": {
        "id": 2501549,
        "name": "Grand Finale",
        "overview": "Today's Grand Finale will see one exceptional cook crowned Australia's Junior MasterChef 2020, taking home a huge $25,000 in prize money.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2020-11-09",
        "episode_number": 13,
        "episode_type": "finale",
        "production_code": "",
        "runtime": null,
        "season_number": 3,
        "show_id": 33160,
        "still_path": null
    },
    "name": "Junior MasterChef Australia",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 38,
            "logo_path": "/gHAm9zYjSX8IAJWuy2s4Du6onuo.png",
            "name": "Network Ten",
            "origin_country": "AU"
        }
    ],
    "number_of_episodes": 51,
    "number_of_seasons": 3,
    "origin_country": [
        "AU"
    ],
    "original_language": "en",
    "original_name": "Junior MasterChef Australia",
    "overview": "Junior MasterChef Australia is an Australian competitive cooking game show. It is a spin-off of MasterChef Australia, itself an adaptation of the British show MasterChef, and features contestants aged 8 to 12. The first season of the show began production in July 2010 and included 50 contestants. Over 5,000 children from around the nation auditioned for the series.\n\nGary Mehigan and George Calombaris returned alongside Anna Gare, while Matt Moran replaced Matt Preston as a judge. Callum Hann has also been involved in the series.\n\nIn contrast to prior series, Junior MasterChef Australia is produced by Shine Australia. The promo was seen during the final episode of MasterChef Australia. The series premiered on Sunday, 12 September 2010.",
    "popularity": 4.395,
    "poster_path": "/qYbbJvWmMR6nhyFw9cQwYsoKrGF.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "AU",
            "name": "Australia"
        }
    ],
    "seasons": [
        {
            "air_date": null,
            "episode_count": 1,
            "id": 44384,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2010-09-12",
            "episode_count": 17,
            "id": 44385,
            "name": "Season 1",
            "overview": "The first series of Junior MasterChef Australia, the second spin off of the Australian reality television series MasterChef Australia began on 12 September 2010 and aired on Network Ten. Matt Preston, George Calombaris and Gary Mehigan returned alongside new judge, Anna Gare.\n\nThe series finale was won by Isabella Bliss, a 12-year-old girl from Queensland.",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2011-09-25",
            "episode_count": 21,
            "id": 44386,
            "name": "Season 2",
            "overview": "The second series of Junior MasterChef Australia premiered on Sunday, 25 September 2011. Auditions closed on 6 May 2011; children who will be aged between eight and twelve years old during the period from 13 June to 28 October 2011 were eligible. The judging panel consists of Gary Mehigan. George Calombaris, Matt Moran and Anna Gare. Matt Preston, who has been involved in every incarnation of the MasterChef Australia series up to this point, will be taking a step back from the series, stating he wants to concentrate on his duties as a food critic. He will be replaced by Matt Moran.\n\nSome parents of prospective participants have been critical of the far-reaching contract required by the program's production company.\n\nPrime Minister Julia Gillard filmed a guest appearance. The show also features a trip to Disneyland California.\n\nThe series was won by Greta Yaxley from Claremont, Western Australia.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2020-10-11",
            "episode_count": 13,
            "id": 167581,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 6.5,
    "vote_count": 4,
    "season_data": {
        "1": {
            "_id": "5258a7fe760ee346616ba166",
            "air_date": "2010-09-12",
            "episodes": [
                {
                    "air_date": "2010-09-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 774640,
                    "name": "Top 20 Part 1",
                    "overview": "The show started with 50 very excited children. After high-fiving the Judges, the Junior MasterChefs were divided into five groups of 10. Each group would do a 45-minute cooking challenge where the four best dishes would get through. The first group had an International theme where Tayla, Nick and sisters – Isabella and Sofia got through. The second group had to make a dessert with the Judges deciding Lucy, Clarrie, Sam and Ashley would make it through.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-09-19",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 774641,
                    "name": "Top 20 Part 2",
                    "overview": "The final spots for the Top 20 were up for grabs with 3 final heats. A seafood challenge saw a surprise appearance and solo judgement by Matt Preston, who put through Alex, Ainsleigh, Sophie J and Sophie M. The next heat pitted the youngest kids against each other.  Making it through were Siena, Anthony, Nicholas and Te Ani. The final heat had George decked out in his best butcher gear for a meat challenge, with the final 4 spots of the Top 20 filled by Jack, Pierre, Emily and Cassidy.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-09-26",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 774642,
                    "name": "Top 12",
                    "overview": "It’s a big day with the Top 20 cooking for a place in the Top 12. The first round is an Invention Test which involves chicken and vegies. The next round is a Pressure Test with MasterChef Finalist Callum providing the dish they must cook. In the end it’s Sam, Isabella, Sophia, Nick, Alex, Jack, Siena, Lucy, Cassidy, Emily, Anthony and Pierre who are chosen for the Junior MasterChef Top 12.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-17",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 774643,
                    "name": "The Top 12 Cook",
                    "overview": "The Top 12 enter the official Junior MasterChef kitchen for the first time, and learn about the points system. They start with a Mystery Box Challenge. Within the box are ingredients like chocolate, prawns, lemon and eggs. Except for sandwiches, anything can be made. The second test is an Invention Test with a “Pie and a Side” theme. All the young cooks amaze the judges who find awarding the points very hard to do.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-18",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 774644,
                    "name": "Offsite Challenge",
                    "overview": "The Junior MasterChefs faced their first Team Challenge – running a high school tuck-shop. Both teams had to create a menu with a hot dish, a cold dish and a dessert. Ultimately it was the blue team who pipped the red team at the post with their menu of sushi, honey soy chicken and noodles and custard tarts. The red team returned to the kitchen full of positivity and excitement to do a very posh dessert Pressure Test.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-22",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 774645,
                    "name": "Cook-Along Masterclass",
                    "overview": "It was a special Masterclass for 10 of the Top 50 who came to the Junior MasterChef kitchen to learn some new tricks and cook a few dishes too. Apart from Gary, Season One MasterChef finalist Poh and Executive Chef from Red Lantern, Mark Jensen came in for a visit. It was a delicious day with Chicken Schnitzels, Vietnamese Pho soups and creamy Panna Cottas, and by the smiles on the faces – it was a memorable one too.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-24",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 774646,
                    "name": "Choose a Box",
                    "overview": "The Top 12 find out four of them will be going home this week, so the points on offer in the next challenges are really important! The first challenge is using duck as the main ingredient, and there’s lots of variety in the meals presented. The second challenge is a Pressure Test, with Donna Hay revealing a decadent cake the youngsters must create. With all this talent, the judges are going to have to make some difficult choices.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-25",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 774647,
                    "name": "Taste Test",
                    "overview": "The day starts with all 12 Junior MasterChefs doing a taste test of a huge 8.5m long pizza made by John Lanzafama. The contestants have 5 minutes to name the pizza’s 20 ingredients. Once the tallying of results is complete, the Top 4 on the scoreboard watch on as the others do a ‘Hot and Cold’ cook-off. Only four contestants will stay, while the other four will go home. It’s decision crunch time for the judges.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-29",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 774649,
                    "name": "Masterclass",
                    "overview": "Gary, George and Anna are joined in the kitchen by 12 students from Bangalow Public School.  George takes the visitors to the veggie patch to pick some herbs for the meal he’ll be cooking. The first six students  with George as he does a Fillet of Beef. Anna whips up an Open Lasagne, and the other six students cook along with Gary as he makes a yummy White Chocolate and Cherry Clafoutis.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-10-31",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 774648,
                    "name": "Basic Skills & Tag Team Challenge",
                    "overview": "The scoreboard is reset to zero as the Top 8 take on a three-part basic skills test and a team challenge. The basic skills test consists of whisking cream, podding an exact 300 grams of peas and finally – making the perfect scrambled eggs. The second test divides the eight into two teams of four as they do a tag team style cooking challenge. With guest chefs Matt Moran and Justin North coaching, it’s anyone’s game.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-01",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 774650,
                    "name": "Pressure Test & Offsite Challenge",
                    "overview": "Four contestants take on a Kellogg’s Pressure Test involving producing a copy of a sweet treat made of frangipane cream, honey-crunch cornflakes, cherries and melted chocolate. The contestants find it’s a big challenge despite looking easy in appearance. The day’s second challenge is cooking for the Sydney Swans football club. Working in pairs proves interesting, but this challenge involves winning over 40 hungry footballers. So who will come up trumps?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-05",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 774652,
                    "name": "Masterclass",
                    "overview": "Six Bondi Public School students who are part of the Stephanie Alexander Kitchen Garden Program got to be a part of the Masterclass with George, Anna and Stephanie Alexander herself. The first dish is Spicy Skewered Meatballs with Rosemary Flatbread and Beetroot Salad which everybody gets to make. Anna then makes a Vietnamese Duck Curry With Lychees and Cucumber Salad, and the last dish is a dessert made by George called a Three Flavours Of Granita.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-07",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 774651,
                    "name": "Mystery Box & Invention",
                    "overview": "Two challenges will see the two Junior MasterChefs who cook the best dishes walk straight into the Top 4. The first challenge is a Mystery Box with an unusual twist, but that doesn’t stop Sofia from gaining the first place in the Top 4. The second challenge sees Sofia choose pheasant as the core ingredient for the French Invention Test. This time Siena blows the judges away with her dish, earning her a place in the Top 4.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-08",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 774653,
                    "name": "Flying Fish",
                    "overview": "The Junior MasterChefs are out of the kitchen and taken to Flying Fish restaurant where the six competitors will cook a dish from the restaurant’s menu and serve it to 40 guests. As Siena and Sofia have earned a Top 4 position, they will be the serving staff, while the others will need to do their best to dish up a meal resembling the restaurant’s. In the end it’s decided Isabella and Jack will round off the Top 4.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-12",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 774654,
                    "name": "Special Masterclass",
                    "overview": "The final Masterclass is a special one with Stephanie Alexander doing a class for Celebrity Chefs and their kids. The Celebrity Chefs are Matt Moran, Guillaume Brahimi, Kylie Kwong, Christine Mansfield and Giovanni Pilu. All the visitors will be making three dishes – one by Stephanie and two by George. Added to this is a special cook-along with George where people at home can cook the same dish George makes – and all in real time to the show.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-14",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 774655,
                    "name": "The Final 4",
                    "overview": "Down to the Top 4, and two challenges will decide the first Junior MasterChef finalists. The first test involves beetroot, rocket and snails. There are lots of creative dishes plated up, but Jack’s recreation of Heston Blumenthal’s Snail Porridge blows the judges away. The second challenge is a Round Pressure Test which sees them having to make one of George’s dishes. Time goes quickly, but in the end Isabella nabs the second place in the final.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-11-15",
                    "episode_number": 17,
                    "episode_type": "finale",
                    "id": 774656,
                    "name": "The Grand Final",
                    "overview": "It’s the Junior MasterChef Grand Final, and there’s excitement and nerves all round. First there’s fun with a ‘Remote Control Chef’ Challenge which sees Gary and George cooking off against each other with help from the Top 10. Next is the finale with two challenges that sees Isabella and Jack cook their hearts out...but by the second challenge featuring an Adriano Zumbo piece – it’s Isabella who takes the first Junior MasterChef title.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "The first series of Junior MasterChef Australia, the second spin off of the Australian reality television series MasterChef Australia began on 12 September 2010 and aired on Network Ten. Matt Preston, George Calombaris and Gary Mehigan returned alongside new judge, Anna Gare.\n\nThe series finale was won by Isabella Bliss, a 12-year-old girl from Queensland.",
            "id": 44385,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5258a7fe760ee346616ba171",
            "air_date": "2011-09-25",
            "episodes": [
                {
                    "air_date": "2011-09-25",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 774657,
                    "name": "Top 50 - Round 1",
                    "overview": "The warehouse welcomed Australia’s Top 50 junior chefs ready to cook like champions for a spot in the Top 20. Heat 1 featured all 50 cooking at the same time, with the contestants given 90 minutes to prepare and plate their dishes. Divided into five teams, each was given a mentor who revealed their core ingredient. Peter Gilmore unveiled poultry and game, Kylie Kwong vegetarian ingredients, Justin North red meat, Shaun Presland seafood and Adriano Zumbo desserts. The mentors selected the three best performers from their group, whose dishes were then tasted by the judges and the best five sent through to the Top 20. After tasting their way through an incredible array of recipes, the judges gave Harry, Tom, Greta, Steven and Keiren the first of this series’ Top 20 aprons.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-09-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 774658,
                    "name": "Top 50 - Round 2",
                    "overview": "The second heat of Junior MasterChef’s Top 50 was revealed to be a healthy fast food challenge, with the contestants having 80 minutes to serve up guilt-free goodies. Providing them with their ingredients was Matt Moran, serving from behind the counter in Junior MasterChef’s version of a fast food palace. Once again the kids cooked out of their skins, but it was Alysha, Jade, Marcus and Miraede that got their eager hands on precious Top 20 aprons. To introduce heat 3 an ice-cream van rolled into the warehouse carrying none other than Gary, who informed the contestants that they would be making ice-cream based desserts, with 80 minutes cooking time. Sweet treats galore followed as the kids cooked with maturity well beyond their years, as Caroline, Chandler, Dee and Indigo became the next crop of cheflings to make the Top 20 phase of the competition.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-02",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 774659,
                    "name": "Top 50 - Round 3",
                    "overview": "Heat four called upon the contestants to cook the ultimate cake for the ultimate guest: Prime Minister Julia Gillard. Given two hours and an amazing array of ingredients, the hopefuls produced an incredible display of dessert cooking, with the guest of honour being taken aback by them all. With only four Top 20 aprons up for grabs however, Gracie, Lily, Madi and Jack were judged as the best performers, sending them through to the next stage of the competition. Heat five, the last chance for a Top 20 apron, was an Italian challenge, with the little chefs needing to prepare their finest fare to impress guest judge Alessandro Pavoni. Once again the contestants cooked with incredible maturity, but it was Aya, Hannah and Zac who excelled, winning the three remaining Top 20 aprons.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-03",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 774661,
                    "name": "Top 20 arrive at the MC kitchen",
                    "overview": "The excited members of the Top 20 arrived for their first day in the MasterChef kitchen. Their first task: a Mystery Box Challenge. Each box contained 12 eggs, which all had to be used to create up to two dishes in 80 minutes. Gary revealed that the best six dishes would be tasted and points awarded to the best three. Lily won the challenge with her frittata and pavlova, Jack placed second with his Victoria sponge, with Gracie taking third with a chocolate cake and salmon crepes. George made a spectacular return to introduce the second, Greek-themed challenge. The contestants had 50 minutes to prepare a Greek dish using spatchcock, lamb or squid as the main ingredient. Madi’s fabulous lamb dish took the win, Jack again placed second with his stuffed squid hoods and Indigo secured third place points with her Skordalia spatchcock. At the end of day one Jack was sitting pretty at the top of the leaderboard.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-09",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 774660,
                    "name": "Offsite Challenge - Summit Restaurant",
                    "overview": "Gary revealed that the Top 20 were about to embark on their first Offsite Challenge. Madi was made captain of the Blue Team and selected the other team captains: Alysha (Yellow), Chandler (Green) and Miraede (Red). The contestants were taken to Summit Restaurant for the Challenge, which was explained by owner and chef Michael Moore. Each team was given a dish to prepare, which the results judged by 50 top food critics who dined in the restaurant. The cheflings came through the challenge in fine style, with the Green Team taking the win and six points for their dry-aged beef fillet dish; second place Red for their spiced poached cherry dessert; third place Blue with a poached quail dish and fourth place yellow for their grilled prawns with peppered goats cheese.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 774662,
                    "name": "Taste Test & Invention Test - Chocolate",
                    "overview": "The Top 20 arrived in the kitchen to find their chocolate dreams come true with piles of the sweet stuff everywhere. Gary introduced the first challenge: a taste test. The cheflings had to isolate the 20 ingredients found in the kitchen’s bountiful supplies of rocky road. Hannah and Tom came third, winning two points apiece for identifying 12 out of 20 ingredients. Chandler and Gracie placed joint second, guessing 13/20. First place and six points each was a six-way tie between Greta, Harry, Indigo, Lily, Miraede and Madi, who guessed 14/20 correctly. Being top of the leaderboard Lily chose raspberries and white chocolate as the core ingredients for the Invention Test, which was guest judged by master chocolate and pastry chef Kirsten Tibballs. The Top 20 produced some incredible desserts, with top honours going to Greta in third place, Jade in second and Chandler in first. Chandler’s win sent him to the top of the leaderboard, and those outside the Top 5 would have to cook-off to stay in the competition.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-16",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 774663,
                    "name": "Pressure Test & The Perfect Roast",
                    "overview": "Eight contestants faced a Pressure Test over two rounds to stay in the competition. The first round challenged them to make the 'Perfect Roast', with the best two performers safe to cook another day. The mouthwatering flavour combinations on display were incredible, but Tom's roast chicken with potato gratin and Alysha's balsamic glazed chicken went that extra mile and sent them through to the next stage of the competition. With six contestants battling for the final two spots, round two welcomed Tony Bilson to the Junior MasterChef kitchen. The contestants had to try and recreate Bilson's lobster risotto, with the cheflings all attacking the task without an ounce of fear. The standard was so high that Tony and the judges struggled to pick their favourites, but it was Marcus and Zac that edged out their peers, sending them into the Top 16.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-17",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 774665,
                    "name": "Mystery Box & Family Desserts",
                    "overview": "Sprinting into the Junior MasterChef kitchen for their first Top 16 task, the contestants faced a Mystery Box Challenge. Lifting the lids, the eager cheflings found they had pork loin, scallops, a whole pineapple, chillies, pears, limes, vanilla beans and mint with which to create a spectacular dish in 50 minutes. Making the most of all her ingredients, Greta’s vanilla scallops and ginger pork delighted the judges, securing her third place. Harry’s upside down pineapple pudding was runner-up, but no one was able to top the taste sensation delivered by Alysha’s six point-winning lime and honey pudding. For the second challenge the kitchen welcomed mothers and nanas as guest judges, with each contestant cooking their family recipe apple pie. In a two-way tie for third were Lily and Steven; second place was Zac; and thanks to her perfect pastry Indigo took the win, sending her to the top of the leaderboard.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-23",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 774664,
                    "name": "Offsite Challenge - Tobruk Sheep station",
                    "overview": "The Top 16 jumped in the cars and were whisked away from the MasterChef kitchen. Appearing on in-car screens, George explained they were trading city life for something much more rural. Arriving at Tobruk Sheep Station, the cheflings were divided into four teams, Indigo captaining the Blues, Gracie the Reds, Tom the Yellows and Lily the Greens. Each team had a total of two and a half hours to prepare a three-course menu of country inspired fare, with four different proteins to use: rabbit, lamb, beef and kangaroo. The contestants were then sent on a treasure hunt to find their ingredients before cooking could begin. George, Matt and guest judge Scott Pickett were overwhelmed by the results, but with dishes like kangaroo with beetroot and roasted tomato and lamb cutlets that Pickett himself said he couldn’t have cooked better, the Greens took another Offsite Challenge win.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-24",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 774666,
                    "name": "Prawn Invention Test & 5 Star Breakfast Challenge",
                    "overview": "For their first challenge the Top 16 had to create 5-star breakfasts for the judges, with an amazing spread of fresh ingredients to draw from. With safe passage through to the next round of the competition on the line, points were more precious than ever. The results were a treat for the senses, with Zac truly excelling himself with his first place-winning tasting plate. Dee came second with his brioche, while Keiren’s honey doughnuts secured him third. As winner Zac got to choose the core ingredient for the seafood-themed Invention Test, to be judged by Luke Nguyen. He selected prawns, much to the relief of his fellow cheflings. Zac again put in an impressive performance, this time getting two points for third. Greta was runner-up, but it was Alysha’s spicy prawn curry that was the clear standout winning her the round and six points. The leader board’s Top 8 were safe, but the bottom 8 would face a cook-off to stay in the game.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-30",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 774667,
                    "name": "The Perfect Curry & Cheesecake Pressure Test",
                    "overview": "Fighting to stay in the competition, the bottom 8 cheflings first competed in a Perfect Curry Challenge, guest judged by master Kumar Mahadevan. With 80 minutes to prepare their dishes there was no time to spare, with some contestants a little too eager with their spices. Tom’s dish in particular, dubbed the ‘Thaiferno’ by its maker, was such a firecracker it left George numb for words. Steven ‘s golden seafood curry and Jack’s chicken Massaman won top honours, sending them up to the balcony to watch round two safe from elimination. The second round was an Invention Test, with the six remaining contestants recreating a Matt Moran mango cheesecake with coconut tapioca. Failing to follow the recipe as exactly as their fellow hopefuls, Gracie and Tom struggled to get their desserts to set properly. Competition was fierce between the others for the remaining two safe spots, but Harry and Kieren’s practically flawless efforts sent them through, leaving Tom, Gracie, Marcus and Dee to say their goodbyes. Gary then revealed that the Top 12 were headed on the adventure of a lifetime to Los Angeles.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-31",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 774668,
                    "name": "Top 12 Travel to the USA",
                    "overview": "The kids jet-setted off to Los Angeles for their first US challenge: to cook a dish for America’s youngest ever Michelin star recipient Perry Hoffman. With the leader board reset to zero there was everything to play for. To decide who got the longest to search for ingredients at the famous Famers Markets, the contestants first competed in a Skills Challenge, having to juice enough oranges each to fill a one litre container. Once their task was completed their were ferried away to begin shopping. The Challenge took place at a fabulous mansion in Beverly Hills, with the cheflings truly embracing cooking American-style food. Jack placed third, Indigo runner-up and securing herself another massive six points was Greta with her mouthwatering gumbo.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-06",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 774669,
                    "name": "Perfect American Hamburgers and Prawn Quesadillas",
                    "overview": "Junior MasterChef’s American adventure continued with a Team Challenge at Venice Beach. Divided into Reds and Blues – Greta captaining the former, mentored by George and Zac the latter, mentored by Matt – the teams had to cook and serve burgers to the general public, who voted for their favourites. The competition was close throughout, but after running out of burger mix early leaders the Reds could do little but watch as the Blues overtook them in the closing stages. As losers of the challenge the Reds competed in a Mexican themed Pressure Test, each having to cook a delicious prawn quesadilla. Harry’s effort won him third place, Steven secured a valuable four points as runner-up while Greta took another win and a further six points to extend her lead. With the Top 12 reunited, Zac was selected to smash down a piñata, revealing a plentiful supply of Mickey Mouse ears and giving the cheflings a good idea of where they were heading for their next challenge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-07",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 774670,
                    "name": "Disneyland Challenge",
                    "overview": "The contestants arrived at Disneyland for a true fantasy challenge. Hidden around Uncle Walt’s kingdom were 12 ingredients that the mini-chefs had to work in pairs to find: heirloom tomatoes, rocket, baby basil, lemon, sweet potato, red apple, buffalo mozzarella, sea bass, pretzels, pecans and maple syrup. Once found the teams had one hour to create two Disney-inspired dishes – an entree and a main. Clearly relishing the amazing environment the cheflings cooked their hearts out, preparing an assortment of sumptuous fare. Zac and Alysha won two valuable points in third, Lily and Harry proved a formidable team in second, but in the judges’ eyes Kieren and Greta were the clear six point winners for their sweet potato and mozzarella ravioli, followed by pretzel and pecan-crumbed sea bass. Their cooking done, it was then time for the kids to relax and soak up the Disneyland magic.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-13",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 774671,
                    "name": "Mad Hatters Tea Party & A Pressure Test",
                    "overview": "The White Rabbit from Alice in Wonderland arrived on the Disneyland scene to clue the contestants in on their first challenge: creating cupcakes for the Mad Hatter’s Tea Party. After gathering their ingredients from the Tea Cups ride, the cheflings got straight down to the business of creating sugary magic. The results were inspirational, with Miraede’s lamb-shaped cupcakes – which she’d even cared to make a paddock for – taking third, Indigo’s beautiful cupcake bouquet second and Jack’s sumptuous chocolate indulgence first. Bottom six on the leader board Chandler, Harry, Kieren, Madi, Miraede and Steven then faced off in a Pressure Test, in which they had to create a Cajun chicken dish with pepper glaze. The kids gave their all, but the perfectly cooked proteins of Chandler and Harry gave them the edge and the last remaining spots in the Top 8.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-14",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 774672,
                    "name": "Double Mystery Box",
                    "overview": "Junior MasterChef 2011’s Top 8 arrived back in the MasterChef kitchen to be greeted with a Mystery Box Challenge – with a twist. Beneath their main containers was a beautiful assortment of fresh ingredients, but also a smaller box containing a further collection of produce. Those brave enough to lift the lid would have to cook with at least one of the ingredients before them. Although most of the contestants opted to play it safe, those who gambled impressively utilised the unfamiliar ingredients, particularly Zac, whose lamb’s liver dish took second place in the challenge. Greta’s beetroot salad was third, while Lily’s melt-in-the-mouth lemon delicious dessert was a deserving winner of six points. The second challenge was a Tag-Team cook-off set within a boxing ring. The boys were captained by guest chef Colin Fassnidge, the girls by Miguel Maestre. Both teams had an hour to make George’s barramundi and fettuccine dish, each contestant having to cook for 15 minutes, with the team captains allowed to tag in for 90 seconds to help overcome any snags. A pasta disaster for the boys threatened to destroy their chances, but in the all-important matter of taste Anna and Matt awarded them winning marks.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-15",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 774674,
                    "name": "Food Deception & Christmas Dinner",
                    "overview": "Master chocolatier Max Brenner was welcomed to the kitchen for the Savoury but Sweet Challenge. Unveiling two of his dishes – biscuit tuile nachos and an incredible chocolate burger – he explained that the cheflings had 80 minutes to follow his lead by creating dishes that look savoury but tasted sweet. The kids really pulled out all the stops, letting their culinary creativity shine; Jack came third with his spaghetti and meatballs dish, Zac second for his sweet pie and Indigo first with a mesmerising take on the traditional meat and three veg. The kids then enjoyed a MasterChef first – a slumber party - and were awoken the following morning by the booming laugh of Santa (who looked suspiciously like George). Unwrapping presents from under the tree, the kids found their core ingredients for a Christmas-themed Invention Test Challenge. Lily picked up two points for placing third in the challenge, Zac continued his impressive run by taking the runner-up spot, but once again Greta left the competition for dust as her peppered mushroom tarts secured another six points to maintain her lead in the competition.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-20",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 774673,
                    "name": "Perfect Pavlova",
                    "overview": "The judges explained that after the next challenge the top four contestants on the leader board would be safe, while the bottom four would go into a Pressure Test to stay in the game. The contestants had 80 minutes to create the ‘Perfect Pavlova’, producing results likely to satisfy even the biggest dessert lover. Indigo scored two points for third place, Greta took second and with a dish the judges simply couldn’t get enough of and Harry placed first. His six point haul unfortunately wasn’t enough to keep him out of the Pressure Test, joined by Alysha, Chandler and Lily. Guillame Brahimi was then welcomed to present a dish for the cheflings to create – a spectacular looking turban of scampi with spaghettini and caviar sauce. Despite the complexity of the recipe the kids took to the task admirably, but it was Harry and Alysha whose dishes were judged to be superior, leaving an emotional Chandler and Lily to say their goodbyes.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-21",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 774675,
                    "name": "Conveyor Belt Mystery Challenge",
                    "overview": "As finale week continued, the Top 6 were told by the judges that the leader board was now scrapped, leaving them all on a level playing field. By the end of the episode one contestant would be going straight through to the final, while two would be sent home. To add to the surprise, the cheflings were greeted by a giant Mystery Box with a conveyor belt at the centre. One by one 30 ingredients came out, with the contestants having to select a maximum of five to create a dish of their choice. Greta once again proved herself the chef to beat, winning the challenge with her baked salmon dish and giving her an advantage going into the Thai-themed Invention Test, in which she’d not only get a five minute head start but also the power to choose the core ingredient. Much to the dismay of her peers, she opted for duck. Her decision certainly paid off as she created a dazzling duck laab and a place in Junior MasterChef 2011’s Top 2. Harry, Jack and Zac’s dishes all impressed, winning them semi-final places, but Alysha and Indigo didn’t quite make the cut.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-22",
                    "episode_number": 20,
                    "episode_type": "standard",
                    "id": 774676,
                    "name": "Semi Final",
                    "overview": "Harry, Jack and Zac arrived outside the Sydney Opera House for their Junior MasterChef semi-final, with the judges explaining that they each had two hours to cook a signature dish main and dessert, but were strictly limited to spending an hour in total on each dish. The boys jumped into action, Jack opting to use lamb as his protein, Harry rabbit and Zac a selection of seafood. Jack struggled to smoke his lamb cutlets, ultimately opting to pan fry them instead, but managed to plate up an impressive dish, as did Harry and Zac. Despite there being a place in the final on the line the complexity of the desserts proved that no one was interested in playing it safe, the risk-tasking producing some stunning results. With little to separate the boys when it came to the judging, Jack’s flavours and techniques just edged out his competition, sending him through to the final to face Greta.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-23",
                    "episode_number": 21,
                    "episode_type": "finale",
                    "id": 774677,
                    "name": "Grand Final",
                    "overview": "Donna Hay was welcomed to the MasterChef kitchen to introduce the first part of finale: a fruit dessert challenge. Jack and Greta had one minute to select their preferred fruits from the pantry, then an hour to create beautiful dishes that would delight dessert queen Hay. Jack opted for a deconstructed strawberries and cream, Greta a citrus tart. Both dishes presented their difficulties; Jack had trouble making the chocolate pipes for his recipe, while Greta couldn’t get her lemon and orange curd to thicken. After the tasting the judges stepped up to deliver the first round of scoring: Donna, Anna, Gary and Matt all gave Jack 8/10, with George awarding 9/10. Greta won 8/10 from Anna, and 9s across the board from the other judges. The second half of finale was a Pressure Test, with the cheflings recreating a dish by the legendary Tetsuya, who guest judged. Greta and Jack cooked well beyond their tender years, creating and plating up dishes that could have easily been mistaken for being the work of Tetsuya himself. Jack again scored impressively, winning 8/10 from Tetsuya and Gary, and 9/10 from Anna, George and Matt. Greta needed big marks to win and delivered empatically, scoring 9/10 from Gary and Tetsuya and perfect 10s from the other judges, winning her the title of Junior MasterChef 2011.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "The second series of Junior MasterChef Australia premiered on Sunday, 25 September 2011. Auditions closed on 6 May 2011; children who will be aged between eight and twelve years old during the period from 13 June to 28 October 2011 were eligible. The judging panel consists of Gary Mehigan. George Calombaris, Matt Moran and Anna Gare. Matt Preston, who has been involved in every incarnation of the MasterChef Australia series up to this point, will be taking a step back from the series, stating he wants to concentrate on his duties as a food critic. He will be replaced by Matt Moran.\n\nSome parents of prospective participants have been critical of the far-reaching contract required by the program's production company.\n\nPrime Minister Julia Gillard filmed a guest appearance. The show also features a trip to Disneyland California.\n\nThe series was won by Greta Yaxley from Claremont, Western Australia.",
            "id": 44386,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5fa1d29acb6db500362f86be",
            "air_date": "2020-10-11",
            "episodes": [
                {
                    "air_date": "2020-10-11",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2499619,
                    "name": "Signature Dish",
                    "overview": "The Top 14 mini cooks have an open pantry to create their signature dish. The top two dishes will win the chance to use the immunity gong and save themselves from elimination during the competition.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-10-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2499620,
                    "name": "Honey Immunity Challenge",
                    "overview": "Collecting their own honey from a beehive, contestants must create a sweet or savoury dish that heroes honey. The best two dishes win immunity from the first elimination.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-10-13",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2499621,
                    "name": "1st Elimination",
                    "overview": "The first elimination starts out with a blindfold taste test. Those who move into the second round must cook a dish that the judges can eat using only a spoon, chopsticks or a real life human hand.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-10-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2499622,
                    "name": "Giant Mystery Box",
                    "overview": "The contestants enter the MasterChef kitchen and scream with delight as they notice a giant-sized mystery box but no judges in sight. ",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-10-19",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2499623,
                    "name": "Cook Along Immunity Challenge",
                    "overview": "Contestants in today's challenge must cook along with judge Andy, but with no recipe. The two cooks with the dishes closest to Andy's will win immunity from the next elimination.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-10-20",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2499624,
                    "name": "2nd Elimination",
                    "overview": "Morgan Hipworth from Bistro Morgan reveals that n today's challenge, contestants will be creating their own donut topping and fillings. The two least impressive dishes will send their makers home.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-10-26",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2499625,
                    "name": "Emelia Jackson Mystery Box",
                    "overview": "The contestants arrive at the MasterChef kitchen for a mystery box challenge set by none other than MasterChef Australia: Back To Win winner Emelia Jackson.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-10-27",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2499626,
                    "name": "Hand Pulled Noodle Elimination Challenge",
                    "overview": "Contestants will have 60 minutes to make a dish using hand-pulled noodles made by master Mr X. The best two noodle dishes will keep their makers safe from this Sunday's elimination.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-01",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2499627,
                    "name": "Snowy Elimination Challenge",
                    "overview": "Our juniors enter the MasterChef Kitchen and discover a winter wonderland - it's snowing. Today, the Junior MasterChefs will be braving the cold of a two-round elimination challenge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-02",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2499628,
                    "name": "Curtis Stone Mystery Box",
                    "overview": "Curtis Stone sets tonight's mystery box which is all about the humble potato. Contestants are vying for a place in the Semi-Final by creating a sweet or savoury dish featuring delicious spuds.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-03",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2499629,
                    "name": "Fruit & Veg",
                    "overview": "Contestants must hero a fruit or a vegetable in their dish. if they select a fruit they need to produce a savoury dish and if they select a vegetable they need to create a sweet dish.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-08",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 2499630,
                    "name": "Semi Final Pressure Test: Kirsten Tibballs",
                    "overview": "in tonight's pressure test contestants must recreate Kirsten Tibballs' lemon meringue tart. the top three dishes will send their mini-makers into the Grand Finale, the others will be heading home.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-09",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 2501549,
                    "name": "Grand Finale",
                    "overview": "Today's Grand Finale will see one exceptional cook crowned Australia's Junior MasterChef 2020, taking home a huge $25,000 in prize money.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 33160,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 167581,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    }
}