{"adult":false,"backdrop_path":"/xpqBVhoOEpb4yuByJm2t8GnUOsv.jpg","created_by":[{"id":1243069,"credit_id":"648c41fa42bf01013bbbff44","name":"Mallory Lewis","gender":1,"profile_path":null},{"id":3144923,"credit_id":"648c41ec42bf01013bbbff3d","name":"Katharine Holabird","gender":0,"profile_path":null},{"id":3144927,"credit_id":"648c41f6c2ff3d00e2df3d96","name":"Helen Craig","gender":1,"profile_path":null}],"episode_run_time":[],"first_air_date":"2009-09-05","genres":[{"id":10751,"name":"Family"},{"id":16,"name":"Animation"},{"id":10762,"name":"Kids"}],"homepage":"","id":33347,"in_production":false,"languages":["en"],"last_air_date":"2010-10-30","last_episode_to_air":{"id":775627,"name":"Angelina's Trick-or-Treat Feat; Angelina and the Laughing Poet","overview":"Angelina and friends make their own Halloween costumes when their ordered ones don't arrive in time for trick-or-treating; Alice has a difficult time keeping a straight face in a dance routine.","vote_average":0,"vote_count":0,"air_date":"2010-10-30","episode_number":9,"episode_type":"standard","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null},"name":"Angelina Ballerina: The Next Steps","next_episode_to_air":null,"networks":[{"id":99,"logo_path":"/bMuKs6xuhI0GHSsq4WWd9FsntUN.png","name":"Channel 5","origin_country":"GB"}],"number_of_episodes":50,"number_of_seasons":4,"origin_country":["GB"],"original_language":"en","original_name":"Angelina Ballerina: The Next Steps","overview":"Join Angelina Ballerina as she finds her way in her new school, puts together her own show and tries to land a leading role in the Mouskinov Ballet. Prepare to pirouette along with everyone's favorite ballerina in these sparkling stories!","popularity":9.192,"poster_path":"/7CvBWJXqJWYqjFJmdJGqlEfQYn.jpg","production_companies":[{"id":28159,"logo_path":"/vi4Y2pr4P7Yk38EjEuEm59ebaaU.png","name":"HiT Entertainment","origin_country":"GB"},{"id":29070,"logo_path":"/uKRBkaFxoJcLKB1gAYx17Mk57Kc.png","name":"SD Entertainment","origin_country":"US"}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"},{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2011-08-30","episode_count":2,"id":44467,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2009-09-05","episode_count":20,"id":44463,"name":"Season 1","overview":"","poster_path":"/l9SkH56hgW4TOM3TaTVlyet3MdO.jpg","season_number":1,"vote_average":0},{"air_date":"2010-01-23","episode_count":10,"id":44464,"name":"Season 2","overview":"","poster_path":"/hVyRknAltr5mZIlRn1UN3YsQQnT.jpg","season_number":2,"vote_average":0},{"air_date":"2010-09-04","episode_count":10,"id":44465,"name":"Season 3","overview":"","poster_path":"/whk9YT5YPXe0rAiaUE5ZDdL5VRW.jpg","season_number":3,"vote_average":0},{"air_date":"2009-11-13","episode_count":10,"id":44466,"name":"Season 4","overview":"","poster_path":"/gwlLFRs3tDzKC9NykMLoXZYCPSe.jpg","season_number":4,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"The little star with big dreams!","type":"Scripted","vote_average":7.2,"vote_count":5,"season_data":{"1":{"_id":"5258a86a760ee346616c2002","air_date":"2009-09-05","episodes":[{"air_date":"2009-09-05","episode_number":1,"episode_type":"standard","id":775568,"name":"Angelina's New Home","overview":"Angelina is not happy about all the changes in her daily routine now that her family has moved to the other side of Chipping Cheddar. Her plan to drop out of her new school is thwarted after she receives a special gift from her new teacher, Ms. Mimi, giving her the confidence and making her excited to embark on her new adventures at Camembert Academy for the Performing Arts.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-05","episode_number":2,"episode_type":"standard","id":775569,"name":"Angelina’s New School","overview":"Angelina is excited, yet nervous, about her first day of school at Camembert Academy. When she finds her new classmates proficient in other styles of dance, she tries to copy their moves – without success. Angelina soon discovers that when she’s true to her own style of dance – ballet – she excels, and soon understands that everyone is different, and different is good.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":3,"episode_type":"standard","id":775570,"name":"Angelina’s New Ballet Teacher","overview":"The day for Angelina to meet her new ballet teacher, Ms. Mimi, has finally arrived. However, Ms. Mimi’s teaching style is very different than that of Angelina’s former teacher and mentor, Miss Lilly. Loyal to Miss Lilly, the disappointed Angelina resists Ms. Mimi’s lessons. In the end, Angelina discovers that there’s more than one way of teaching things, and there’s more than one way to learn.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":4,"episode_type":"standard","id":775571,"name":"Angelina’s Dance Partner","overview":"Angelina is ecstatic to have the opportunity to dance with her best friend, Alice, at Camembert Academy’s Dance-with-a-Partner Day. She knows Alice will follow her choreography to a “T.” Unfortunately, Alice gets the sniffles. Angelina has to balance wanting to perform to her own choreography with Vici’s urge to improvise when the two decide to partner up in Alice’s absence.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-19","episode_number":5,"episode_type":"standard","id":775572,"name":"A Gift for Ms. Mimi","overview":"It’s Ms. Mimi’s birthday, and Angelina wants to give her the best birthday ever! As Angelina and her classmates check the list of items needed for a party, everything goes comically wrong; they can’t even buy a decent gift for their beloved teacher! Ms. Mimi is definitely surprised by the makeshift party her students throw for her, and is even more delighted by the song and dance they improvise on a whim, which ends up being the best gift of all.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":6,"episode_type":"standard","id":775573,"name":"Angelina’s Oldest Friend","overview":"Angelina loves her new Camembert Academy friends and also loves her old friend Alice. She expects that both sets of friends will love each other too. Unfortunately, their first encounter is not as smooth as Angelina would have liked.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":7,"episode_type":"standard","id":775586,"name":"Angelina & the Hip Hop Kid","overview":"There’s a new Hip Hop dancing mouseling at Camembert Academy: A.Z. The girls find him interesting, especially since he knows how to do Hip Hop, but they definitely do not want him as a ballet partner. It’s not until Angelina is reluctantly paired up with A.Z. that she learns you can’t judge a book by its cover. Not only does he know Hip Hop, but A.Z. is pretty good at ballet too!","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":8,"episode_type":"standard","id":775578,"name":"Angelina’s Broken Fiddle","overview":"When Angelina and Polly accidentally break their dad’s fiddle, they come up with elaborate excuses to get out of trouble. In the end, the girls learn to tell the truth and also redeem themselves by helping to pay for the fiddle repairs.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":9,"episode_type":"standard","id":775580,"name":"Angelina & Alice’s Big Night","overview":"Angelina has a recital coming up with her class at Camembert and wants Alice to attend as her special guest – but Alice has an ice skating event at the ice rink on the very same night, and she wants Angelina to come to her performance as her special guest! They struggle with the dilemma, and ultimately, find a way to rush back and forth between the two events. It’s exhausting, but worth it!","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":10,"episode_type":"standard","id":775605,"name":"Angelina and the Giant","overview":"Angelina and Alice have been given the task of designing the Giant prop for “Jackie and the Beanstalk”. Angelina gets a bit carried away trying to make the biggest and best prop ever. Subsequently her plans and the Giant come crashing to the ground! When she clears up the mess, she stumbles upon a much simpler and more effective way of making a big impact, learning that it’s best to keep things simple!","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":11,"episode_type":"standard","id":775577,"name":"Angelina’s Musical Day","overview":"Ms. Mimi’s class of mouselings plans to put on a production of “Peter and the Wolf.” In it, each character is identified by a musical riff played on a student’s favorite instrument. When Ms. Mimi comes to rehearsal with laryngitis, she uses these musical riffs to communicate with the mouselings. Vici tries it herself and attempts to communicate by using a recorder and no words. She\n\nends up showing everyone that friends don’t always need words to talk to each other.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":12,"episode_type":"standard","id":775579,"name":"Angelina’s Crazy Solo","overview":"Angelina and her friends are putting on a show, and they each have a specific job to do. Vici’s the Choreographer, Marco’s the Set Designer, Alice is the Stage Manager, Gracie’s on Props and Angelina is the Soloist! Despite Angelina’s thoughts that everyone should be interested in what SHE thinks, she learns that teamwork – and actually listening to each other – makes for the perfect show!","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":13,"episode_type":"standard","id":775602,"name":"Angelina and the Irish Jig","overview":"Vici has arrived back from holiday in Tippermousy, Ireland, with some Irish music. She’s keen to teach her friends how to dance the way the Tippermousy mouselings do. But when Angelina overbalances while trying out the tricky steps of the Irish Jig, she breaks the music player, and in turn, loses the music. To make amends, she decides to organize a surprise Irish party for Vici, but Vici thinks Angelina is organizing a whispering campaign behind her back...","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":14,"episode_type":"standard","id":775581,"name":"Angelina En Pointe","overview":"When Angelina learns the Mousnikov Ballet is holding auditions for their next show, she does whatever she can to try out; however, her young joints and muscles can’t hold her up en Pointe. She doesn’t let anything stop her as she continues to practice until she can no longer stand. Simultaneously, Marco is trying a new String Bass, but accidentally practices on a full-sized instrument instead of one that fits his size. They both learn that despite their efforts, they’ll have to wait to grow up before reaching new heights in their crafts.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":15,"episode_type":"standard","id":775593,"name":"Angelina’s Rock Band","overview":"At the Chipping Cheddar Music Day Picnic, Angelina finds her friends rehearsing in a band for a school project. They invite her to join in, as a tambourine player. She’s so excited and sees celebrity status in her future until she finds out that she only gets to hit the tambourine once during the entire song. Her enthusiasm wanes, and she becomes an unreliable band player. Besides, it’s only one little moment, how bad can it be if she doesn’t perform it correctly? It’s not until after the band politely kicks her out that she understands that even missing one tiny element can spoil the entire performance.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":16,"episode_type":"standard","id":775582,"name":"Angelina’s Lost Ice Skates","overview":"Angelina and Alice are getting ready for the big ice show – which Angelina will star in the show’s opening solo! As they rush out of the house, Mum and Polly bring out their forgotten ice skates and lunches. At the park, Angelina insists on practicing her land-based axels, and the mouselings forget their lunches on a bench for some birds to enjoy. After snacking on smoothies at Mrs. Thimble’s store, Angelina is in a bind when the ice skating show is set to begin and she realizes that she lost her skates – leaving her solo in jeopardy!","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":17,"episode_type":"standard","id":775592,"name":"Angelina’s Music Store","overview":"Angelina wants to celebrate the opening of her dad’s new music store with a splashy party and a musical demonstration. She enlists her musician friends to play some of the instruments that will be sold in the store. The trouble is Mrs. Thimble, whose store is directly across the street, doesn’t appreciate the loud music, which interferes with her daily nap. Angelina has to find a way to keep the party going without disturbing Mrs. Thimble. She finally comes up with a solution: using the instruments to play a soothing lullaby to help Mrs. Thimble fall asleep – solving two problems at once!","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":18,"episode_type":"standard","id":775600,"name":"Angelina & Ms. Mimi","overview":"When Ms. Mimi introduces the class to a new drum kit, Angelina behaves over- exuberantly and is mortified by Ms. Mimi’s gentle admonishment. In her efforts to regain Ms. Mimi’s favor, she upsets her friends by missing important rehearsals before eventually realizing that she has been overreacting in the first place.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":19,"episode_type":"standard","id":775590,"name":"Angelina and Super Polly","overview":"Polly adores a book about a normal mouseling girl who gets superhero powers when she hears a trumpet fanfare. Polly starts to think maybe she has super powers too! She gets a fanfare recording from her father, but after some humorous testing, it’s clear Polly has no superpowers at all. Angelina says everyone is super at something, and with Vici and Marco’s help, she has Polly try a variety of things to see what she’s super at. It turns out Polly’s a super singer! Angelina was right, everyone is super at something.","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":20,"episode_type":"finale","id":775597,"name":"Angelina’s Dance Like a Cake Day","overview":"Vici puts together a “Dance Like a Cake” Day in which her friends must bring a cake or sweet associated with a dance. AZ plans an upside down dance and plans to bring a Pineapple Upside Down Cake, Vici plans to bring Lemon Twist Bars so she can dance the Twist, Alice is set on pancakes and performs a gymnastic dance with flips, Angelina wants to do a Hansel and Gretel dance and will bring a gingerbread house and Marco is going to learn how to play the castanets. When Angelina’s cake ends in disaster thanks to Polly’s help, she doesn’t know what to do. Angelina asks each friend if she can join them, but each dance presents a problem for her. When she returns home, she gets an idea! With help from Marco and Ms. Mimi, she’s able to present the Flamenco with orange and oat cookies – and the party is a hit!","production_code":"","runtime":null,"season_number":1,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":44463,"poster_path":"/l9SkH56hgW4TOM3TaTVlyet3MdO.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258a86a760ee346616c200d","air_date":"2010-01-23","episodes":[{"air_date":"2010-01-23","episode_number":1,"episode_type":"standard","id":775610,"name":"Angelina and Cheddar Cheese Slide; Angelina and the Case of the Missing Music","overview":"Angelina and her pals need one more person for the \"Cheddar Cheese Slide\" dance. Gracie joins in, but because she only knows the French version, things don't go so smooth. Later Vici turns detective when Marco's sheet music disappears.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-30","episode_number":2,"episode_type":"standard","id":775609,"name":"Angelina, the Pet Sitter; Angelina and the Music Box","overview":"Angelina pet-sits Ms. Mimi's canary for a weekend, but the bird escapes from its cage; Angelina accidentally breaks a music box that Polly received from her grandmother.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-06","episode_number":3,"episode_type":"standard","id":775611,"name":"Angelina and the Dance-athon; Angelina and the Art Show","overview":"Gracie accidentally recycles the pledge sheet when Angelina and pals hold a Chipping Cheddar Earth Club dance marathon; Vici tries to paint Angelina and Gracie for the Camembert art show, but they can't hold still long enough for her to finish the picture.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-20","episode_number":4,"episode_type":"standard","id":775612,"name":"Angelina's Hiccups; Angelina and the Must-Have Bag","overview":"Angelina comes down with the hiccups prior to a performance; all of Angelina's friends have an \"Eva the Diva\" bag, so she wants one too.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-28","episode_number":5,"episode_type":"standard","id":775613,"name":"Angelina's Room; Angelina's Camembert Parade","overview":"Angelina and Gracie learn that being roommates isn't always easy when Gracie stays with Angelina for a few days; Angelina organizes a parade.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-06","episode_number":6,"episode_type":"standard","id":775614,"name":"Angelina Ballerina and the Band Leader; Angelina and Polly's Two-Hour Show","overview":"AZ breaks one of his drumsticks, making rehearsal for Angelina's musical ensemble impossible, until he discovers another way to keep the beat; Angelina and Polly put on a show for their parents, but Mr. and Mrs. Mouseling are so tired they can barely keep their eyes open.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-13","episode_number":7,"episode_type":"standard","id":775615,"name":"Angelina and the Marcel Mouseau Mime Challenge; Angelina and the Dance Craze","overview":"Marco has to choose between winning tickets to see his favorite mime or losing a bet to Angelina; Gracie's newfound love of disco dancing leads her to ignore her responsibilities to her friends.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-20","episode_number":8,"episode_type":"standard","id":775616,"name":"Angelia and the Mouselinghood of the Dancing Shoes; Angelina and Her Parents' Dance Lesson","overview":"Angelina, Gracie, Vici and Alice form a girls-only club; Angelina's parents take lessons to learn swing dance, but become frustrated when it proves to be more difficult than it looks.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-27","episode_number":9,"episode_type":"standard","id":775617,"name":"Angelina's New Jeans; Angelina and the Poster","overview":"AZ's uncomfortable new jeans make dancing difficult; Angelina and Marco can't agree on anything when they're paired together on a school project by Ms. Mimi.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-03","episode_number":10,"episode_type":"finale","id":775618,"name":"Angelina's Nature Dance; Angelina's Spring Fling","overview":"Polly goes missing while tagging along with Angelina, who has to create a nature-inspired dance routine for class; Angelina and her friends try spring traditions from around the world.","production_code":"","runtime":null,"season_number":2,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":44464,"poster_path":"/hVyRknAltr5mZIlRn1UN3YsQQnT.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258a86a760ee346616c2018","air_date":"2010-09-04","episodes":[{"air_date":"2010-09-04","episode_number":1,"episode_type":"standard","id":775619,"name":"Angelina's Fancy Tutu; Angelina and the Musical Theater","overview":"Angelina recounts how she found a fancy new tutu and returned it to its rightful owner. Later, Viki persuades her friends to put on their own show after the Camembert performance of \"Mousical the Musical\" is canceled.","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Perry Parmesan","credit_id":"615feb8b69eb900061e1d22f","order":500,"adult":false,"gender":2,"id":52139,"known_for_department":"Acting","name":"Seth MacFarlane","original_name":"Seth MacFarlane","popularity":23.719,"profile_path":"/8oQJqM51Z0Qtdb7sE6ZfX1peNCB.jpg"}]},{"air_date":"2010-09-11","episode_number":2,"episode_type":"standard","id":775620,"name":"Angelina and the Hearts on Ice; Angelina's Kitchen Band","overview":"Marco helps Angelina and Alice with a love-theme skating routine at Chipping Cheddar's big hockey game. Later, Ms. Mimi takes the mouselings on a field trip designed to show them that music is everywhere.","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-18","episode_number":3,"episode_type":"standard","id":775621,"name":"Angelina and the Carnival; Angelina Jumps the River","overview":"Viki surprises Marco by arranging for the Costa Mousa Carnival to come to Chipping Cheddar, but Angelina may not be able to attend: the festivities fall on Polly's birthday. Later, Angelina turns to Polly for help in completing an assignment.","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-25","episode_number":4,"episode_type":"standard","id":775622,"name":"Angelina and the Windy Children's Day; Angelina and Ms. Mimi's Dance","overview":"The mouselings' annual Children's Day celebration may be a disaster. Later, Ms. Mimi wows the mouselings with a modern dance, then recalls the difficulties she had in mastering it.","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-02","episode_number":5,"episode_type":"standard","id":775623,"name":"Angelina and the Mini-Mouseling; Angelina's Helpful Friend","overview":"Polly desperately wants to become taller, but learns to value her size when Angelina, A.Z., and Alice need someone small to play an important role in their school production of \"Goldilocks and the Three Mice.\" Later, Viki tries to lend a hand to too many people at once.","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-09","episode_number":6,"episode_type":"standard","id":775624,"name":"Angelina's Mother's Day; Angelina and the Father's Day Surprise","overview":"Ms. Mimi teaches the class about dynamics in music and dance, and Angelina makes use of her newfound knowledge to make her chores fun and give her mom a great Mother's Day gift. Later, she and Polly discover sheet music written by their dad while decorating his store for Father's Day. They learn that it's klezmer, a type of music performed at celebrations, so they decide to celebrate Father's Day with klezmer.","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-16","episode_number":7,"episode_type":"standard","id":775625,"name":"Angelina and Polly's Big Day; Angelina and the Smelly Cheese","overview":"Angelina becomes jealous when Alice babysits Polly; Mrs. Thimble makes a special cheese for the Fête Française, but the kids fear its overwhelming smell will drive everyone away.","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-23","episode_number":8,"episode_type":"standard","id":775626,"name":"Angelina's Indian Lunchtime; Angelina, AZ, and Cheezy Z","overview":"Marco wants to perform the Indian epic \"The Ramayana\" for a school performance, but his friends would rather do \"Mouselina.\" After learning the story of his selection, however, the mouselings change their minds and surprise him by learning the song and choreography. Later, A.Z. drops big hints as to what he wants for his birthday, but his friends have another gift in mind.","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-30","episode_number":9,"episode_type":"standard","id":775627,"name":"Angelina's Trick-or-Treat Feat; Angelina and the Laughing Poet","overview":"Angelina and friends make their own Halloween costumes when their ordered ones don't arrive in time for trick-or-treating; Alice has a difficult time keeping a straight face in a dance routine.","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-11","episode_number":10,"episode_type":"finale","id":775628,"name":"Angelina and the Dragon Dance; Angelina's Opera","overview":"Angelina and the Dragon Dance - Viki wants to perform a dragon dance with her partners for a school assignment. Her friends, however, have another idea and are too busy to listen to her. When Viki finally gets the chance to show them the celebratory dance from San Fran-cheese-co, her friends become inspired to perform the best dragon dance ever!Angelina's Opera - It's time for Chipping Cheddar's annual Cheese Day celebration and Angelina's class gets to present the cheese-related history to the whole town. There's so much to learn that Angelina wonders if she'll ever be able to remember it all until she discovers a fun way to present the information, making the Cheese Day a huge success!","production_code":"","runtime":null,"season_number":3,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":44465,"poster_path":"/whk9YT5YPXe0rAiaUE5ZDdL5VRW.jpg","season_number":3,"vote_average":0},"4":{"_id":"5258a86a760ee346616c2023","air_date":"2009-11-13","episodes":[{"air_date":"2009-11-14","episode_number":1,"episode_type":"standard","id":775629,"name":"Angelina's Sleepover; Angelina's Noisy, Messy Lunchtime","overview":"Angelina, Viki, and Gracie have a sleepover the night before the Silly Hat Carnival, but stay up too late and then oversleep, causing them to miss an important ballet rehearsal.\n\nMs. Mimi cancels lunchtime rehearsals when Angelina and her friends are too loud, noisy, and messy, leading Angelina to host the rehearsals in her attic dance studio.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-21","episode_number":2,"episode_type":"standard","id":775630,"name":"Angelina's Holiday Treats; Angelina and the Front Row Ticket","overview":"Angelina and Marco overindulge in candy canes and gingerbread cookies prior to a performance of \"Dance of the Sugar Plum Fairy\".\n\nAngelina is excited about seeing \"The Nutcracker\" and invites two of her friends to go with her but then realizes she only has one extra ticket, so now she has to decide between Alice and Viki.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-28","episode_number":3,"episode_type":"standard","id":775631,"name":"Angelina Keeps the Peace; Angelina and Alice Mousikova","overview":"Angelina, Viki, Gracie and A.Z. work together to develop a dance for class, but Gracie and AZ disagree over what the dance should be, so Angelina must find a way get everyone to agree with each other.\n\nAlice adopts the persona of her idol, Russian gymnast Anna Mousikova, after Miss Mimi assigns reports on the mouselings' heroes. Alice became so obsessed with her idol, she distances herself from her friends.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-05","episode_number":4,"episode_type":"standard","id":775633,"name":"Angelina and Gracie's Creative Day; Angelina's Big Part","overview":"Gracie contemplates copying an established dance for Make-It-All-Up-Day when she cannot come up with one on her own, but Angelina persuades her to improvise a new routine.\n\nAngelina has second thoughts about playing the main part in a school play \"Once Upon a Pillow\" when she learns her character is asleep for most of the performance.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-12","episode_number":5,"episode_type":"standard","id":775632,"name":"Angelina and the Tummy Butterflies; Angelina and the Magician","overview":"The mouselings learn about jazz dance, improvisation, and poetry, but when they have to present poems to the entire class Alice develops a serious case of \"tummy butterflies\" and Angelina must help Alice with memorizing her poem.\n\nGracie, who has been tap dancing for years, forgets practicing in favor of learning magic.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-19","episode_number":6,"episode_type":"standard","id":3331545,"name":"Angelina Cheerleader; Angelina's Ballet School","overview":"Angelina tries to support Marco in the Mouse Marathon, which includes forming a cheerleading team to cheer him on, but all the attention unnerves him.\n\nAngelina opens her own ballet school in the attic to teach Polly ballet, but her overbearing manner soon causes her sister to quit.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-26","episode_number":7,"episode_type":"standard","id":3331546,"name":"Angelina and the Roquefort's Rhythmic Ghost; Angelina's Lunch Table","overview":"Gracie, Angelina, Viki, and A.Z. think they heard a mysterious tapping noise in Roquefort Hall is from a ghost.\n\nAngelina's friendship with Gracie is strained due to the many friends that Angelina has and the limited time she has to spend with each of them.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-02","episode_number":8,"episode_type":"standard","id":3331660,"name":"Angelina and the Big News; Angelina's Secret Valentine","overview":"When Angelina, Viki, and Marco mistakenly think Ms. Mimi is getting married after overhearing her talking on the phone, they learn about wedding marches and organ music in order to make her wedding day special.\n\nAngelina receives a Valentine card from a secret admirer.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-09","episode_number":9,"episode_type":"standard","id":3331726,"name":"Angelina and the Front Page; Angelina's Cheese Roll","overview":"Angelina helps her dad take pictures of Camembert Academy and its students for a Mouseland Herald story, but the assignment turns difficult because Gracie wants to be in every shot.\n\nAngelina helps A.Z. learn the complicated \"Cheese Roll\" dance.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-16","episode_number":10,"episode_type":"finale","id":3331727,"name":"Angelina and the Musical Plant; Angelina's Hip Hop Boys Show","overview":"When the mouselings cannot agree on the music for a show, Angelina forges a compromise by applying a lesson from a science project.\n\nAngelina is set to direct a hip-hop dance show, but it may not go on when A.Z. hurts his foot.","production_code":"","runtime":null,"season_number":4,"show_id":33347,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":44466,"poster_path":"/gwlLFRs3tDzKC9NykMLoXZYCPSe.jpg","season_number":4,"vote_average":0}}}