{"adult":false,"backdrop_path":"/4TmwHKglVMefoAwDYtKxY6TJfs4.jpg","created_by":[{"id":1246129,"credit_id":"5258a90f760ee346616d0b22","name":"Lee Tim-sing","gender":2,"profile_path":"/dELmBD5Oa6hwI7vtk1t36sqYPbK.jpg"}],"episode_run_time":[45],"first_air_date":"2010-10-18","genres":[{"id":18,"name":"Drama"}],"homepage":"https://www.mytvsuper.com/en/programme/noregrets0004_125824/No-Regrets/","id":33667,"in_production":false,"languages":["cn"],"last_air_date":"2010-11-30","last_episode_to_air":{"id":1830927,"name":"Episode 32","overview":"SING tries to talk the people into putting down their weapons but fail. When they refuse to leave, he has no choice but fire. KWAN makes up his mind not to follow MUI to the US, unwilling to be her burden. SING volunteers to escort him to Guangxi, after which he will join MUI, then they will go to the US via Hong Kong together. Four days later, YEUNG bumps into KAT when he is going out to buy food. KAT tells MUI they were attacked, KWAN was killed while he himself has passed out. MUI waits for SING at the church but there is no sight of him. TEAK urges her to leave Guangzhou as soon as possible. SING has come round. The doctor at the hospital tells him he has been hit by a bomb. As he has lost his memory, he has to stay for observation. MUI places an ad at the papers looking for SING everyday ever since she has arrived at the States.","vote_average":0,"vote_count":0,"air_date":"2010-11-30","episode_number":32,"episode_type":"finale","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null},"name":"No Regrets","next_episode_to_air":null,"networks":[{"id":48,"logo_path":"/v78f4q6DYdRB8dLj4rQBpqQG8pW.png","name":"TVB Jade","origin_country":"HK"}],"number_of_episodes":32,"number_of_seasons":1,"origin_country":["HK"],"original_language":"cn","original_name":"巾幗梟雄之義海豪情","overview":"Set in the late 1930s to late 1940s in Canton, Republic of China during World War II, No Regrets is an epic drama that centers on a triad family, the Canton police force, and the Japanese occupation of the city.","popularity":7.248,"poster_path":"/IAFRyp0IOENGY9X8M06xMCMkdE.jpg","production_companies":[{"id":79261,"logo_path":"/4OKzkasr0IV8CSqejjgRfKw7e0m.png","name":"TVB","origin_country":"HK"}],"production_countries":[{"iso_3166_1":"HK","name":"Hong Kong"}],"seasons":[{"air_date":"2010-10-18","episode_count":32,"id":44594,"name":"Season 1","overview":"","poster_path":"/IAFRyp0IOENGY9X8M06xMCMkdE.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Cantonese","iso_639_1":"cn","name":"广州话 / 廣州話"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":9.3,"vote_count":3,"season_data":{"1":{"_id":"5258a90e760ee346616d0898","air_date":"2010-10-18","episodes":[{"air_date":"2010-10-18","episode_number":1,"episode_type":"standard","id":777914,"name":"Episode 1","overview":"Year 1984; Guangzhou. Human bones have been found at a construction site. It is believed that the site was a burial mount where the Japanese buried anti-Japanese citizens during the Japanese occupation. As soon as she hears the news, CHENG KAU-MUI goes to the site with her granddaughter and two friends, TONG KAT and YEUNG YEUNG, immediately. In 1936, KAT’s grandmother sold her piece of land and a cow so that she could have the money to bribe Superintendent LEUNG FEI-FAN to find GAT a job in his police station. Captain LAU SING’s plot to earn some quick money has thus been ruined. KAT’s timidity creates a bad impression on SING. Tung Tai Company, which is owned by gang kingpin CHENG LONG-KWAN, has got the license to run an opium den. At the opening of his first licensed opium den, his eldest daughter, MUI, goes down from Shanghai to attend the happy occasion……","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-19","episode_number":2,"episode_type":"standard","id":777915,"name":"Episode 2","overview":"SING and his team have arrested the robbers. When the Chief visits the police station, FAN takes all the credits as well as the award. LONG-HEI and the others discuss how to celebrate the 30th anniversary of Tung Tai Company. LEUNG decides to hold a banquet at a hotel. HEI suggests letting KIT take charge of some of MUI’s businesses. To her surprise, MUI offers to let KIT take whole charge of her operations. SING tells KAT to place a Pacapio bet for him. KAT is robbed on the way. MOK YIN-PING, a passer-by, advises him to turn to CHOI TAI-FUNG, the most influential man in town, for help. SING has won the Pacapio Grand Prize of over seven thousand dollars. KIT and FUNG refuse to give the prize money to him, because if SING really has placed a bet, there should be a copy of his ticket at the Tung Tai Pacapio Company. In the midst of their argument, MUI shows up and settles the matter. KIT wants to take PING home by force……","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-20","episode_number":3,"episode_type":"standard","id":777916,"name":"Episode 3","overview":"FUNG sends his men to track KAT down but to no avail. KWAN is very angry when he learns that KIT has been shot, so much so that he mobilizes all his followers to search for KAT. FUNG and HEI are holding an anniversary celebration. FAN takes his men to report the progress of the search. YEUNG recognizes that a cleaning staff at the ball is a relative of KAT’s. YEUNG and SING find KAT at last. KAT tells them how KIT was shot. SING and YEUNG return to the police station to look for information of a suicide case. They then visit CHOI HING, a key person of the case, only to find that HING has moved. FAN and KWAN force SING to reveal KAT’s whereabouts but he refuses to give in. MUI manages to make him open his mouth by asking him in an indirect way. The hospital calls and informs KWAN about KIT’s death. He breaks down when he hears KIT’s last wish and is determined to gun KAT down himself.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-21","episode_number":4,"episode_type":"standard","id":777917,"name":"Episode 4","overview":"MUI stops KWAN from shooting at KAT. The truth has come to light. SING invites KAT home to eat dog meat. With the concerted effort of SING and the others, LAI-SIM agrees to let a bed to KAT at a very affordable rent. MAU takes care of KIT’s funeral. When it is over, she gives HING a box of money then leaves Guangzhou. KWAN hates to see her leave, though he does not show it. SING’s wife, TUNG-NEI, has returned from her parents’ home. SING waits for her at the train station. With the help of SIM and the others, the couples finally make up with each other. SING sees HING being kidnapped. He also hears the noise of gun shots. In the meantime, a car carrying MUI drives by. KWAN takes back his decision of letting SIU-HONG take charge of the opium den. Instead, he tells HONG to learn from MUI, much to the displeasure of HEI.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-22","episode_number":5,"episode_type":"standard","id":777918,"name":"Episode 5","overview":"HEI brings along the six hundred resignation letters of the den’s staff to MUI. When he knows this, KWAN orders HEI to get them back. Typhoon signal number 10 has been hoisted. SING goes picking NEI up at the station, not expecting FAN, who happens to have driven by, will give her a lift. LAU-CHING has gone to Xiguan for a job interview. YEUNG rushes to Xiguan to take her home. When she finally appears, she is soaked to the skin. YEUNG gives her a piggyback ride back to Chu Lung Lane. SING’s intelligence report indicates that some armed robbers are planning to smuggle unlicensed opium to Guangzhou. SING and his mates take action in no time. When they are getting going, FAN appears. He orders that everybody to stay except YEUNG and KAT. SING tells his team members MUI plots to kill HING. Someone leaks the information to FAN. SING and the others go to the CHENG family to ask MUI about the overdue lottery money……","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-25","episode_number":6,"episode_type":"standard","id":777919,"name":"Episode 6","overview":"Claiming that loyalty is always her priority, MUI promises SING if FAN dares make things difficult for his team again she will always protect them. HONG gathers his followers together. He is determined to do anything he can to prove that MUI is not KWAN’s biological daughter. NEI is returning to her hometown to visit her grandmother. SING wants to go with her but FAN does not allow him to take leave. CHING has found a clerical job at a large company. She is so excited that she goes straight to the police station to tell SING the good news. FAN follows NEI to her hometown. MUI pays SING an attractive price to escort UNCLE LUNG, a former gang kingpin, to leave Guangzhou. Under HEI’s threat to kill his granddaughter, UNCLE LUNG admits that KWAN’s biological daughter has already died, and that MUI is a substitute. FAN is not happy with SING’s going on leave. SING resigns in anger……","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-26","episode_number":7,"episode_type":"standard","id":777921,"name":"Episode 7","overview":"SING and his mates are busy looking for a place to open a restaurant. CHING reports duty today. As YEUNG is meeting with a dim sum chef he gives her a lift. KWAN plans to send HONG to Shenyang, which has fallen in the hands of the Japanese, to explore business opportunities. He makes a sarcastic remark that he would not be surprised if one day HONG became a traitor. Sing Kei Restaurant opens today. KAT takes his grandmother to Chu Lung Lane to live with him. FAN sends some junkies to make a mess at SING’s restaurant. He also circulates rumors that its food is unhygienic. KAT’s grandmother has passed away. He is most grateful to SING, who spares no effort to help him with his grandmother’s funeral. SING closes his restaurant. NEI is annoyed that he should give the staff their entire redundancy pay. With the help of MUI, SING and his friends can resume their original posts……","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-27","episode_number":8,"episode_type":"standard","id":777920,"name":"Episode 8","overview":"SIM worries that FAN will nit-pick YEUNG at work. SING is taking his team to put a gang of swindlers under arrest, but FAN tells YEUNG to take charge of the action instead. CHING falls down in a faint on the street. YEUNG holds her in his arms and takes her to hospital. At the hospital, he reads her dairy by accident. SING worries a lot about CHING’s medical expenses. His neighbors raise money for him. NEI complains to FAN that SING loves CHING more than her after yet another argument with SING. When she is drunk, FAN takes her to a hotel. A neighbor informs SING about this. As soon as SING has finished telling him about his wife’s adultery with FAN, KAT rushes to the police station, swearing to take FAN’s life.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-28","episode_number":9,"episode_type":"standard","id":777922,"name":"Episode 9","overview":"The only treatment for CHING’s congenital heart disease is a surgery, but her only wish now is to live her remaining days peacefully with her family. MUI promises to do all she could to treat CHING if SING would do her a favor. He rejects her resolutely when he realizes she wants him to save LAI-WAH, who is now in prison in Hong Kong. MUI mixes threats with promises in order to make him agree. NEI has sent SING a divorce agreement. People in Chu Lung Lane despise her for her fickleness. For fear that the news would affect CHING’s condition, SIM reminds YEUNG not to tell her about it. FAN announces that he is leaving the force, as MUI has employed him as General Manager of the opium den. He also invites the team to come to NEI and his wedding. Two months later, SING sees FAN and NEI arguing over whether they should sell their jewelry in front of a jewelry shop.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-29","episode_number":10,"episode_type":"standard","id":777924,"name":"Episode 10","overview":"NEI visits CHING before she returns to her hometown. Her neighbors in Chu Lung Lane see her off at the train station. Now that CHING’s condition is stable, she hopes SING would let her work. WAH refuses to go to university in Shanghai because she would like to follow MUI’s career path. MUI agrees to find her a clerical job at Wing Yip Bank. HEI learns that MUI has visited WAH at her boarding school. She therefore decides it will be easier to find out about MUI’s real identity through WAH. WAH throws a tantrum when MUI visits her at the boarding school. When MUI finds a bugging device in the room, WAH is thrown into a panic, as she remembers she has mentioned MUI’s secret in the room. MUI picks up a fight with FUNG. Taking the tape of their conversation, MUI goes to the police station to ask SING to edit the tape for her. After a long separation, SING meets MUI again when he is putting up a roadblock.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-01","episode_number":11,"episode_type":"standard","id":777925,"name":"Episode 11","overview":"MUI takes SING to the opium warehouse. After telling him how she was kidnapped at the age of six and what she has gone through over the years, she is more determined to set the warehouse ablaze. SING gives her a hand. FUNG informs KWAN about the fire, pointing the finger at MUI. This nevertheless makes KWAN believe he and HEI are trying to pin the blame on MUI. MUI goes to Hong Kong to borrow opium from YING-HUNG, who holds an old grudge against her. CHING goes on an errand for her boss. She is trapped in a heavy rain in Xiguan. When SING has finally found her, she is running a high fever. WAH refuses to go to Shanghai. MUI makes her give in by force. MUI plans to advice KWAN to close some of the opium dens with the reason that they have failed to borrow opium from HUNG. Worried about her safety, SING takes a day off to accompany her.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-02","episode_number":12,"episode_type":"standard","id":777923,"name":"Episode 12","overview":"A rich guy tells WAH he will cut a record for her, she therefore pleads MUI to let her stay in Guangzhou. Of course MUI knows very well the real reason. LAN-HEUNG has come round. MUI makes a beeline for Hong Kong to see her. KWAN is going to Shanghai for a medical check-up. Before he goes, he hands MUI the rein, making HEI very jealous. FAN has escaped from prison. SING fears that he will harm MUI. MUI has been calling WAH for hours but cannot reach her anyhow. She is heartbroken later to know WAH has been raped by some westerners. HEI is having a meeting with Tung Tai’s disciples as MUI pops in to announce that quite a few cities have fallen into the hand of the Japanese. Then she orders a temporary closure of all the opium dens. HEI strongly opposes the idea. A gunfight between MUI and HEI’s supporters is about to begin when SING shows up with a gun to escort MUI out of the restaurant.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-03","episode_number":13,"episode_type":"standard","id":777927,"name":"Episode 13","overview":"LONG-HUNG has returned from Shanghai. He is taken aback by the news that the Japanese have also taken Beiping. He commends MUI for her foresight on the other hand. MUI goes to Shanghai to take KWAN back to Guangzhou. The sound of gunfire is echoing in the air. KWAN faints. MUI decides not to leave Shanghai before he gets better. The air raid siren goes off. People in Guangzhou rush to the bomb shelter. SING sees FAN in the shelter. A section of the railway has been bombed. The train service will not resume in ten days. Regardless of her seasickness, MUI decides to go to Hong Kong by boat. The attack of the Japanese has stopped because of the cloudy weather. CHING and YEUNG take the opportunity to go out. It is dead quiet on the streets. WAH sees FAN setting off skyrockets in the back alley. In the meantime, MUI gets a call from SING telling her FAN has turned a traitor.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-04","episode_number":14,"episode_type":"standard","id":777926,"name":"Episode 14","overview":"MUI mingles well with the people at Chu Lung Lane. According to radio broadcasts, Guangzhou has suffered heavy causality under the Japanese’s attack. In response to the government’s appeal, SING and his friends join the rescue. A film director invites WAH to play the leading role of a patriotic film. She hopes MUI will invest in it. SIM wants to go back to the countryside with YEUNG. She gives the title deed to the house to SING for his custody. SING is interrogating FAN when the air raid comes again. SING is so kind-hearted that he sets FAN free. The municipal government is moving to another city, so SING and the others return their guns to the force. CHING reads from the paper that MUI has drowned. Guangzhou is in a state of anarchy. FAN has formed a Victory Squad to clean out households. When the Victory Squad enters Chu Lung Lane, SING and the others have no choice but to let them in.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-05","episode_number":15,"episode_type":"standard","id":777928,"name":"Episode 15","overview":"Everybody is surprised to see YEUNG return. MUI visits her friends at Chu Lung Lane with a large pile of food. She is astonished to hear FAN’s voice as she arrives. SING and his fellow boarders dig a hideout next to the water vat in the kitchen so that CHING can hide in there during emergency. SING borrows a camera from MUI to take a “family photo” with his fellow flat mates. MUI receives a call telling her HEUNG is in a critical state. Her life lingering, she wishes to hear the voice of her daughter. Many places in Guangzhou have fallen. A Japanese team has come to Chu Lung Lane. After hiding CHING into the hideout, SING and the others wait for CAPTAIN MIYAZAKI in the sitting room. CAPTAIN MIYAZAKI sees the photo on the wall. He suspects that CHING is a guerrilla. Meanwhile, CHING crawls up to him. She explains in tears she has a congenial attack just now. She pleads him to spare the lives of the others.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-08","episode_number":16,"episode_type":"standard","id":777929,"name":"Episode 16","overview":"MUI visits Chu Lung Lane. CHING tells her the owner of the drugstore has seen WAH being taken to the back alley by some Japanese soldiers. And not long afterwards, WAH was released and the soldiers came to Chu Lung Lane for her. MUKAIYAMA TETSUYA goes to MUI’s office to talk about their cooperation. MUI asks her for exit passes in return. MUI runs into SING. She tells him she will be able to get some exit passes. She also urges him to take CHING to Hong Kong. MUI has managed to get one exit permit only. People at Chu Lung Lane agree to give it to CHING so that she can go to Hong Kong for treatment. FAN resumes his post as superintendent with the help of MAJOR KUROKI SAIGO from the Japanese army. SING and the others hand in their resignation. To their surprise, FAN suggests reconciliation. The first opium den jointly run by MUI and the Japanese army opens today. Someone throws eggs at MUI and call her traitor.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-09","episode_number":17,"episode_type":"standard","id":777930,"name":"Episode 17","overview":"MUI visits Chu Lung Lane. CHING tells her the owner of the drugstore has seen WAH being taken to the back alley by some Japanese soldiers. And not long afterwards, WAH was released and the soldiers came to Chu Lung Lane for her. MUKAIYAMA TETSUYA goes to MUI’s office to talk about their cooperation. MUI asks her for exit passes in return. MUI runs into SING. She tells him she will be able to get some exit passes. She also urges him to take CHING to Hong Kong. MUI has managed to get one exit permit only. People at Chu Lung Lane agree to give it to CHING so that she can go to Hong Kong for treatment. FAN resumes his post as superintendent with the help of MAJOR KUROKI SAIGO from the Japanese army. SING and the others hand in their resignation. To their surprise, FAN suggests reconciliation. The first opium den jointly run by MUI and the Japanese army opens today. Someone throws eggs at MUI and call her traitor.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-10","episode_number":18,"episode_type":"standard","id":777931,"name":"Episode 18","overview":"MUI has been attacked. COLONEL MUKAIYAMA TETSUYA calls for the arrest of the attacker in no time. KAT and his mates cannot stand FAN any longer. SING explains why they have to stay. MUI asks SING to help her shipping orphans to Hong Kong at the small hours. Without telling MUI, KWAN comes back from Shanghai. He accuses MUI of reopening the opium den with COLONEL MUKAIYAMA TETSUYA, making him a traitor too. FAN calls for an operation. Judging from the words of the thief they have arrested, SING believes he is a guerrilla. FAN is going to release the man. KAT informs SING without delay. SING forces Brownnoser Keung to reveal FAN’s plan. At the grand opening of the opium dens, SING risks his life to save MUI. SING enters into a coma following a shot. CHING collapses on her way to the hospital. In order not to affect SING’s condition, his fellow boarders cover this up from him.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-11","episode_number":19,"episode_type":"standard","id":777932,"name":"Episode 19","overview":"Cannot bear to involve SING in further troubles, MUI tells him not to see her again. HEI gives KUROKI SAIGO a tape that has recorded MUI’s remarks on opium when FAN introduces her to the Major. MUI awakes HEI in the middle of the night, questioning why she has to make things difficult for her. MUI takes one hundred exit permits to an orphanage and asks the director to send the orphanages abroad. She also asks him to look for a boy named YIP KWOK-SANG, who is the son of a guerilla. SING gets a mysterious call in the evening. Fearing that something bad will happen to MUI, he goes to Tung Tai, only to see MUI smoking opium. FAN threatens MUI with SANG’s exit pass endorsed by her. MUI needs a fix badly. SING stops her. He drags her to the church to help her kick the habit. SING and MUKAIYAMA TETSUYA have a fierce shooting competition.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-12","episode_number":20,"episode_type":"standard","id":777933,"name":"Episode 20","overview":"Thanks to SING’s whole night companion, MUI manages to quit. MUI learns accidentally that MUKAIYAMA TETSUYA and KUROKI SAIGO almost had a fight a couple of days ago. Making use of MUI and KUROKI SAIGO’s feud, HEI tries to sow discord between MUI and her father. MUI has been busy working with the Japanese in running opium dens lately. On the other hand, she continues to send as many orphanages away as possible. She is so constantly on the run that she goes back to opium at last. Later, she notices that every time she returns to the office to have a fix, SING is always waiting for her outside. She makes up her mind after some painful struggling. KAT goes fishing with YEUNG and CHING. They run into KUROKI SAIGO, who is in one of his black moods, on the way home. KAT gets seriously beaten up. SING and the others take him to hospital. When they are leaving the hospital, SING sees MUI’s car parking outside the Japanese restaurant……","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-15","episode_number":21,"episode_type":"standard","id":777934,"name":"Episode 21","overview":"MUI goes home pleased with what she has done. KWAN is shocked nevertheless to see the blood on her face. His blood pressure has been very high recently, so the doctor suggests that he be hospitalized. As WAH is a nurse, MUI asks her to take good care of KWAN while at the same time to keep a close watch on HEI. SING takes MUI home. For fear that they would lose contact with each other, they agree on where to meet up should the US bomb Guangzhou. YEUNG has bought many household commodities, claiming they are for a friend who is from Hong Kong. But CHING discovers later he is building a cave house for her. KAT sees FAN being with TETSUYA. FAN tells TETSUYA SING wants to have a marksmanship contest with him using real bullets. KAT volunteers to go for SING. FAN and his men go to the commander’s headquarters on the day of the contest. He knows things are not going as smoothly as he has expected when he sees MUI is also there.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-16","episode_number":22,"episode_type":"standard","id":777937,"name":"Episode 22","overview":"Epi 22\n\nMUI is in a good mood. She invites SING to go fishing, during which she reveals that the US army has bombed Tokyo, and that the Chinese army has made a counterattack. KWAN thinks very highly of WAH and is already thinking of finding her a job at Tung Tai. Prenatal check-up shows that ROSE’s embryo is not stable. She asks FAN to give up his plan to revenge MUI and SING. The guerillas ask MUI to ship a fax machine from Macau. SING is competing with TETSUYA. A traitor appears and informs TETSUYA that the guerillas are shipping a fax machine to Guangzhou. SING informs MUI immediately once he gets the chance. SING and MUI decide that CHING should leave Guangzhou as soon as possible. SING agrees to reconcile with FAN. He also asks KAT to make it up with BROWNNOSER KEUNG. The commander’s headquarters suspect that SING is a guerrilla. FAN orders YEUNG and the others to hand SING over.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-17","episode_number":23,"episode_type":"standard","id":777935,"name":"Episode 23","overview":"CHING sees a neighbor being beaten by Japanese solider when she revisits the hospital. Fortunately, COLONEL MUKAIYAMA TATSUYA, the younger brother of TETSUYA, goes up to his help. FAN and his subordinates go to Chu Lung Lane to arrest SING’s flat mates, with the reason that SING is a guerilla. Knowing it very well that it is not possible to make the Japanese believe he is innocent, SING tells them he is a friend of TETSUYA’s. SIM and her housemates are released, but YEUNG and his colleagues are still being kept. MUI begs TETSUYA to let her see SING. MUI leads SING to admit he is a guerilla. TETSUYA decides that SING and other guerillas will be executed together. On one hand, CHING is glad that her flat mates have been released, but on the other she is upset YEUNG is not among them. In order to save him, she is willing to sleep with TATSUYA. SING tells MUI on the execution ground that he has never loved her……","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-18","episode_number":24,"episode_type":"standard","id":777936,"name":"Episode 24","overview":"SING has been killed. MUI requests that she leaves on her own, and returns to the execution ground as soon as TETSUYA has left. The guerrillas are working to dig out possible survivors when she returns. YEUNG and his colleagues offer sacrifice to SING at the police station. FAN is not pleased. KAT encourages his colleagues to stand against him. YEUNG asks CHING about her relationship with TATSUYA, but she does not answer him directly. MUI has failed to keep her promises of making more money for the Japanese army. TETSUYA is so angry that he gives her an ultimatum. There is an air raid when MUI is on her way home and so she goes to the bomb shelter instead. There she sees KWAN and WAH acting intimately. TETSUYA makes a sudden visit, accusing MUI of putting off the poppies growing project. He decides to send her to a concentration camp so as to force her to figure out a way to boost the profits.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-19","episode_number":25,"episode_type":"standard","id":777938,"name":"Episode 25","overview":"MUI is taken to the concentration camp. She meets a few old friends there, and they try their best to protect her from the torture of the Japanese soldiers. TATSUYA goes to Chu Lung Lane. He is leaving for Hong Kong tomorrow and he hopes that CHING could see him off at the pier. CHING, YEUNG and KAT pay a secret visit to MUI. Her health is getting worse, but she is more worried about KWAN than herself. HEI tells TETSUYA she will serve the Imperial Army as MUI used to do. Later when she visits KWAN at the hospital, she suggests resuming their opium business with the Japanese. HEI has a meeting with the disciples to keep them up to date with Tung Tai’s business. KWAN appoints WAH to be his representative. HEI takes credit for saving the orphanages and tries her best to draw WAH to her side. MUI suspects that she has caught malaria. Believing that she will not make it, she writes a letter to SING……","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-22","episode_number":26,"episode_type":"standard","id":777940,"name":"Episode 26","overview":"The guerillas give MUI an injection to help her get better. CAPTAIN MIYAZAKI’s subordinates have all been killed by the guerillas. He demands to have a fight with their person-of-charge. It is SING as it turns out. SING tells his friends at Chu Lung Lane that he has saved MUI, requesting them to pretend she has been killed in a bombing. Later, he sends MUI to Chongqing for treatment. Before she goes, he gives her a modified hand grenade just in case she needs to protect herself. HEI and FUNG tell KWAN the concentration camp has been bombed. She then meets HONG, advising him to get back what he has lost before it is too late. Dressed up in a formal kimono, TATSUYA proposes to CHING. He invites SIM to be their witness. It hurts YEUNG to know how much CHING has suffered for him. He has a clash with the Japanese soldiers. KWAN and WAH are listening to the radio broadcast when HEI and HONG suddenly burst in.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-23","episode_number":27,"episode_type":"standard","id":777939,"name":"Episode 27","overview":"Now that she has recovered, MUI is going to return to Guangzhou. She tells TEAK she is ready to get even with HEI. As soon as he has returned to Guangzhou from a mission, SING learns that TATSUYA has forced CHING to marry him. She had a recurrence after that, and their fellow boarders have gone disappeared since. FAN is shot when he is trying to kill TETSUYA. The Japanese announce an unconditional surrender. CHING’s fellow boarders, who have been hiding in “Ching’s Abode”, rush her to the hospital. FAN apologizes to SING after he has returned to the police station, begging him to take care of his eldest son. SING visits CHING. She demands to leave with him. WAH and KWAN run into MUI and TEAK. KWAN is thrilled. HEI fears that MUI will take away HONG’s business, but MUI makes it clear that she is not a bit interested in Tung Tai anymore. KWAN tells MUI he is going to marry WAH.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-24","episode_number":28,"episode_type":"standard","id":777941,"name":"Episode 28","overview":"MUI keeps her promise by throwing a banquet for the people at Chu Lung Lane. When SING asks her about her next plan, she tells him she found HONG and HEI’s relationship suspicious. The Chief wants to promote SING as Assistant Chief in Nanjing. HUNG has returned to Guangzhou to show his support for MUI. HEI calls for another meeting with the disciples. As KWAN is out of tune, he sends WAH. MUI does not want to engage in sinister business again. HEI and HONG are even angrier when she proposes to open up a cotton factory. When she and WAH are alone, MUI asks her if she really loves KWAN. WAH concludes that MUI is meant to counter her. KWAN is sick of HEI and HUNG for their constant arguments over Tung Tai. HUNG is shocked by what MUI tells him.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-25","episode_number":29,"episode_type":"standard","id":777942,"name":"Episode 29","overview":"MUI tells HUNG what the disciples have seen after HONG was sent to Shenyang. HUNG is determined to have it checked out. MUI talks with WAH again about her relationship with KWAN. SING and YEUNG go to get CHING’s medical report. Their hearts sink when they know that her condition has worsened. MUI cheers SING him, telling him not to give up hope. They both cry when she has finished. YEUNG takes a day-off to take CHING out. She gets to know the report at last. YEUNG announces that he is marrying CHING when he is home, telling his flat mates CHING’s days are numbered. YIM confesses reading CHING’s diary in order to prevent her from getting close to YEUNG. HUNG has not found anything unusual about HONG and HEI. MUI turns to SING for help.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-26","episode_number":30,"episode_type":"standard","id":777943,"name":"Episode 30","overview":"SING, who is half drunk, and MUI, force HEI to reveal her true relationship with HONG. HEI ignores them. MUI takes out a hand grenade. FUNG betrays HEI and reveals her secret. Trembling with fear, HEI goes see KWAN. To her surprise, MUI helps her keep the secret of who is HONG’s biological father. HEI cannot get it why she has to do. MUI explains she has come to realize nothing is as important as one’s family members after the eight-year war against the Japanese. It is CHING and YEUNG’s wedding day. Everybody at Chu Lung Lane has come. CHING invites MUI to act as their witness, the other being SING. The bride and groom offer a cup of tea to their witnesses. WAH follows KWAN to a gathering. She is pleased that his disciples welcome her. KWAN has a stroke as he is making a speech. CHING passes out as she is writing in her diary what will happen on her last day in this world.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-29","episode_number":31,"episode_type":"standard","id":777944,"name":"Episode 31","overview":"CHING insists on going home, where she later dies peacefully in YEUNG’s arms. MUI visits KWAN. She hears WAH and KWAN quarreling as she is walking towards his room. MUI checks out with SING about the internal war that is soon to break out. MUI plans to open a bank named the Farmers Bank with MR WU. Reminding him to keep his words “to see each other again, alive or dead”, she invites SING to join the venture. HEI has returned to Guangzhou. According to her, HONG’s opium dens were ordered to close after the liberation. A subordinate of SING’s has given him an assassination list of the new government. SING rushes to protect MUI. SING has received an order that all police officers have to leave for Taiwan at once. Pointing his gun at KWAN, HONG orders MUI to lend him money. The people of Guangzhou break into KWAN’s place. MUI is beaten up.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-30","episode_number":32,"episode_type":"finale","id":1830927,"name":"Episode 32","overview":"SING tries to talk the people into putting down their weapons but fail. When they refuse to leave, he has no choice but fire. KWAN makes up his mind not to follow MUI to the US, unwilling to be her burden. SING volunteers to escort him to Guangxi, after which he will join MUI, then they will go to the US via Hong Kong together. Four days later, YEUNG bumps into KAT when he is going out to buy food. KAT tells MUI they were attacked, KWAN was killed while he himself has passed out. MUI waits for SING at the church but there is no sight of him. TEAK urges her to leave Guangzhou as soon as possible. SING has come round. The doctor at the hospital tells him he has been hit by a bomb. As he has lost his memory, he has to stay for observation. MUI places an ad at the papers looking for SING everyday ever since she has arrived at the States.","production_code":"","runtime":45,"season_number":1,"show_id":33667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":44594,"poster_path":"/IAFRyp0IOENGY9X8M06xMCMkdE.jpg","season_number":1,"vote_average":0}}}