{"adult":false,"backdrop_path":"/9h4QqiNnhsQ7lNEmVc8p6rBUfo4.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2010-08-18","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":33754,"in_production":false,"languages":["cs","en"],"last_air_date":"2011-08-26","last_episode_to_air":{"id":778633,"name":"Special Warfare Combatant-Craft Crewman, Advanced","overview":"","vote_average":0,"vote_count":0,"air_date":"2011-08-26","episode_number":6,"episode_type":"finale","production_code":"","runtime":null,"season_number":2,"show_id":33754,"still_path":null},"name":"Surviving the Cut","next_episode_to_air":null,"networks":[{"id":64,"logo_path":"/tmttRFo2OiXQD0EHMxxlw8EzUuZ.png","name":"Discovery","origin_country":"US"}],"number_of_episodes":12,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Surviving the Cut","overview":"With extraordinary, unprecedented access, Surviving the Cut takes viewers into the intense world of military elite forces training. From divers and snipers to para-rescue men and bomb specialists, the elite and how they earn a place in the coveted units are the focus in this compelling all new series.","popularity":2.144,"poster_path":"/zxNSvrLwM22CDHDmUqz54nwQeUM.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":null,"episode_count":13,"id":44625,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2010-08-18","episode_count":6,"id":44626,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2011-07-11","episode_count":6,"id":44627,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"Czech","iso_639_1":"cs","name":"Český"},{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":8,"vote_count":5,"season_data":{"1":{"_id":"5258a948760ee346616d487a","air_date":"2010-08-18","episodes":[{"air_date":"2010-08-18","episode_number":1,"episode_type":"standard","id":778622,"name":"Ranger School","overview":"US Army Ranger School is considered the toughest combat course on the planet. The course replicates the nonstop stress of war to forge the Army's elite combat leaders.\n\nFor sixty-one days and nights, this extreme training replicates the nonstop stress of warfare. Soldiers sleep an average of three hours a night and receive just one meal per day. They train continuously, running missions 20 hours straight in mountains, swamps and dense woodlands. Most lose 20 or more pounds before it's over, and many quit or fail the course along the way. Only one in three make it through.","production_code":"","runtime":null,"season_number":1,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-25","episode_number":2,"episode_type":"standard","id":778624,"name":"Air Force Pararescue","overview":"Air Force Pararescuemen are the most highly trained combat search and rescue experts in US Special Operations. When a pilot goes down behind enemy lines, these are the experts who stop at nothing to get him out. Nicknamed \"PJ's\" for, they are also surgically trained combat medics.\n\nFull training to become a PJ takes more than two years. Early on, students must survive one notoriously difficult milestone called \"Extended Training Day\" designed to weed out anyone not up to the staggering demands of the PJ job. It's 24 hours of pure hell: nothing else in any special operations training course rivals the torment of this single day. In the end, only nine men out of 100 survive the cut and are allowed to continue training as a PJ.","production_code":"","runtime":null,"season_number":1,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-01","episode_number":3,"episode_type":"standard","id":778623,"name":"US Marine Recon","overview":"Reconnaissance marines are the eyes and ears of the Marine Corps. The first men on the ground behind enemy lines, they gather intelligence and carry out missions that support the entire Corps. Their motto says it all: Swift, Silent, Deadly.\n\nBut to earn the name \"Recon Marine\", you must first survive the corps' famously grueling 12-week recon course. Marines are pushed to unconsciousness in the pool, and then wrestle their 90-pound packs into the pounding surf of the Pacific Ocean. It's a man-breaking, all-out endurance test that forges top soldiers with unparalleled skills.","production_code":"","runtime":null,"season_number":1,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-08","episode_number":4,"episode_type":"standard","id":778625,"name":"Special Forces Diver","overview":"The US Army's Special Forces Combat Dive Course takes only the Army's best soldiers. Most are already battle-proven Army Rangers and Green Berets. Now these elite special ops soldiers challenge themselves to become the most highly trained combat divers on the planet. For six weeks, they are tested in the most severe underwater conditions.\n\nTo earn the coveted Special Forces Divers Badge, these men will push the limits of the human body. to prove they have what it takes. One in three won't make it... the rest survive the cut.","production_code":"","runtime":null,"season_number":1,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-15","episode_number":5,"episode_type":"standard","id":778627,"name":"Navy EOD Final Certification","overview":"Navy Explosive Ordnance Disposal technicians or EOD are the only explosives and bomb specialists qualified for special operations.\n\nBefore a Navy EOD team can go to war with Special Forces, they must go through one final test. Like the job itself, it's all-or-nothing training: A five-day, non-stop series of high stress missions. Make the wrong move, allow fatigue or distraction to take over and the entire team will fail. The team that survives the cut stays together as a certified special ops team.","production_code":"","runtime":null,"season_number":1,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-22","episode_number":6,"episode_type":"finale","id":778626,"name":"Marine Snipers","overview":"Marine Snipers are legendary in the sniper world for being the best. This is where they learn their craft. Units will only send their best men to this course, but on average 1 in the 3 will fail. Becoming a marine sniper takes a level of discipline that few could ever hope to achieve. They will wait hours in the worst possible conditions but only have seconds to make the shot.","production_code":"","runtime":null,"season_number":1,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":44626,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5258a948760ee346616d4885","air_date":"2011-07-11","episodes":[{"air_date":"2011-07-11","episode_number":1,"episode_type":"standard","id":778628,"name":"Special Warfare Combatant-Craft Crewman, Basic","overview":"Basic Crewman Training is a five week course designed to weed out the weak. \n\nPool confidence events, punishing beach runs, obstacle courses and a non-stop 50 hour pain session in the chilling waters off the beaches of Coronado confirm that no person slides by here. \n\nPassing this course only gives you the right to start training with the Naval Special Warfare Forces. 75% will not survive the cut.","production_code":"","runtime":null,"season_number":2,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-18","episode_number":2,"episode_type":"standard","id":778629,"name":"US Army Sniper School","overview":"This is the military's premier Sniper school. Navy SEALs, Green Berets, and the military's best soldiers all assemble here to learn the craft of shooting from extreme distances. \n\n50% will not survive the cut at the six-week course. Using a wide range of special weapons and equipment, sniper candidates are put to the test to see if they can make the critical kill shot when they are called upon. \n\nMake it and they earn the coveted sniper badge. Miss by an inch and they're shipped home.","production_code":"","runtime":null,"season_number":2,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-25","episode_number":3,"episode_type":"standard","id":778631,"name":"US Air Force Special Operations Dive School","overview":"Air Force Special Ops is a small but highly valued asset of the Special Operations community. If you are in trouble, these guys will survive any climate to get you out. \n\nWater is the most unforgiving environment and they need to be able to operate flawlessly in it. Students are pushed to the limit as they struggle to learn the art of staying clam in adverse underwater conditions. \n\nBoth open circuit and closed circuit systems are mastered here, but the biggest skill required is surviving pure chaos where there is no air. 1 in 3 will not survive the cut.","production_code":"","runtime":null,"season_number":2,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-12","episode_number":4,"episode_type":"standard","id":778630,"name":"US Army Sapper School","overview":"Army sappers specialize in punching through an enemy's defensive lines. It's their job to take down whatever stands between combat forces and their target... by whatever means necessary. \n\nTo earn the sapper tab, soldiers must endure 4 weeks of intense physical punishment, science, and special demolitions tactics training. Sapper school moves fast and furious. There is no heavy equipment to help them break through: what they carry on their backs is what they have to work with. \n\nSoldiers suffer through weeks of demolitions testing and physical torment, then fight through a week of nonstop missions with less then 10 minutes of sleep a night. Carrying 80 pound packs, they must struggle up, over, and through any obstacles the instructors put in their path. \n\nOnly on the final day do they learn their fate. Over 50% will not earn the coveted Sapper Tab.","production_code":"","runtime":null,"season_number":2,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-19","episode_number":5,"episode_type":"standard","id":778632,"name":"US Army Special Operations Aviation Regiment Enlisted Green Platoon","overview":"When America's most elite Special Operations Forces need assault and attack helicopter support, there's one unit they want to provide it: the 160th Special Operations Aviation Regiment (SOAR). \n\nThey have the equipment and special tactics required to get the job done, often under the most remote and hostile conditions. They take the riskiest missions with the most severe consequences. Every soldier in the regiment must be Special Operations material. \n\nGreen Platoon is where they prove they have what it takes. For six weeks, they are pushed through a barrage of mental and physical stress testing: escape and evasion, long-distance land navigation, hand-to-hand combat, special weapons, and emergency medical response skills are front and center. \n\nIf you can't achieve these skills while under the pressure of non-stop punishment, you will not survive the cut. 1 in 3 will not make it.","production_code":"","runtime":null,"season_number":2,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-26","episode_number":6,"episode_type":"finale","id":778633,"name":"Special Warfare Combatant-Craft Crewman, Advanced","overview":"","production_code":"","runtime":null,"season_number":2,"show_id":33754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":44627,"poster_path":null,"season_number":2,"vote_average":0}}}