{"adult":false,"backdrop_path":"/7IJRQVO55DMLZ92jgQALkUlHgvr.jpg","created_by":[{"id":1211813,"credit_id":"5258a968760ee346616d6361","name":"Paul Dini","gender":2,"profile_path":"/ckPIKNntdyXgUajyXuRQJY0kHeY.jpg"}],"episode_run_time":[60,45],"first_air_date":"2010-10-16","genres":[{"id":9648,"name":"Mystery"},{"id":10765,"name":"Sci-Fi & Fantasy"},{"id":18,"name":"Drama"}],"homepage":"http://www.towerprep.com/","id":33785,"in_production":false,"languages":["en"],"last_air_date":"2010-12-28","last_episode_to_air":{"id":778796,"name":"Fathers","overview":"Gabe is sent to West Campus for refusing to reveal his source for Chemica Desin 2.0. His West Campus roommate is a guy named Demetrius, who was hired by Headmaster to protect Gabe from Jeremy and the Rooks. It is revealed to Ian that \"3's the charm\" meaning their third escape attempt will be successful, but only for three of them. Suki's father arrives to take her back home but she is rescued by Ian. Meanwhile, Headmaster and CJ argue in his office, until Headmaster sends a text to Ian pretending to be CJ. Ian and Suki both arrive to finally learn that CJ is Headmaster's daughter. Ian tells Headmaster he will be leaving the school, no matter what Headmaster does to stop him. The argument escalates into a physical fight, until Ian knocks out Headmaster. Ian, CJ and Suki then go to West Campus to rescue Gabe, just as he is about to be assaulted by The Rooks. The team escapes after crawling through a vent Ian found in an abandoned kitchen. Outside, they meet a woman who turnes out to be a hologram of Whisper 120. She tells them that seven people know the Headmaster is trying to return the school to what it was when Cornelius Tower founded it: Suki, Ian, CJ, Gabe, Headmaster, Cornelius Tower and one more person. Whisper tells the four that they have escaped and that \"not many people do\".","vote_average":6,"vote_count":1,"air_date":"2010-12-28","episode_number":13,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null},"name":"Tower Prep","next_episode_to_air":null,"networks":[{"id":56,"logo_path":"/c5OC6oVCg6QP4eqzW6XIq17CQjI.png","name":"Cartoon Network","origin_country":"US"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Tower Prep","overview":"Ian Archer wakes up one morning to find himself at a mysterious academy for teens with special abilities. Unable to find answers to his questions from the school’s faculty and cut off from any kind of outside contact or means of escape, Ian forms a secret group with fellow suspicious students.","popularity":3.55,"poster_path":"/c4ATUzfBJPuq0HkyNwXMSdtoUth.jpg","production_companies":[{"id":53592,"logo_path":null,"name":"Dolphin Entertainment","origin_country":""},{"id":7899,"logo_path":"/uYMD8NPD7Eph0cFd1WJZJrot1Fb.png","name":"Cartoon Network Studios","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2010-10-16","episode_count":13,"id":44641,"name":"Season 1","overview":"","poster_path":"/snLe4awpf3e8yJY1PaiXJ8puxOv.jpg","season_number":1,"vote_average":6.7}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"Getting in is the easy part","type":"Scripted","vote_average":7.8,"vote_count":9,"season_data":{"1":{"_id":"5258a966760ee346616d6192","air_date":"2010-10-16","episodes":[{"air_date":"2010-10-16","episode_number":1,"episode_type":"standard","id":778798,"name":"New Kid","overview":"Ian Archer (Drew Van Acker), is suspended for fighting while defending another student. That night, while playing a video game he hears a buzzing noise and blacks out. He wakes up at a mysterious preparatory school called Tower Prep, with no idea on how he got there. When he tries to escape he meets CJ Ward (Elise Gatien), Gabe Forrest (Ryan Pinkston) and Suki Sato (Dyana Liu) who, with the exception of CJ (who has no memory of her life before Tower Prep), were sent there by their parents. They all want to escape and find out where they are. Unfortunately, their escape plan is thwarted by creatures in the forest called \"Gnomes\", which force them back to the campus. Later, Ian and his new friends pull a prank on Ian's initial roommates for messing with him. As the episode ends, Ian mentions getting a note that says \"I'm scared, too...\", But the group claims they didn't give him the note, leaving them wondering who did.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":7,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-10-26","episode_number":2,"episode_type":"standard","id":778799,"name":"Monitored","overview":"A number of personal items are stolen and Ian is blamed since some of the stolen property is found in his room. Because of this, he must defend himself in the school tribunal and must be shadowed all day by a school monitor. Meanwhile, Gabe, CJ and Suki work to prove his innocence. While Ian is in his room, he finds a secret entrance to underground tunnels, where he discovers that the real thief was using them to frame him. The thief and Gabe's roommate, Howard Gilmore, stole the items and tried to frame Ian out of jealousy.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":7,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-11-02","episode_number":3,"episode_type":"standard","id":778797,"name":"Whisper","overview":"The gang attempts to find out who wrote the message \"I'm Scared Too\", and discovers an older version of Whisper, Whisper 23. They believe Whisper 23 holds the answers, but when they turn her on she locks the room down and forces them to play a deadly video maze game where the loser is electrocuted. They are saved by a power surge which short-circuits Whisper 23, and it is later revealed that Whisper 119 wrote the message and caused the power surge.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":7,"vote_count":2,"crew":[],"guest_stars":[{"character":"","credit_id":"5258a968760ee346616d6243","order":501,"adult":false,"gender":2,"id":101247,"known_for_department":"Acting","name":"Adrian Petriw","original_name":"Adrian Petriw","popularity":3.418,"profile_path":"/3jbR14GEKoUCbrs3NVmQw8eWRvu.jpg"}]},{"air_date":"2010-11-09","episode_number":4,"episode_type":"standard","id":778794,"name":"Buffer","overview":"Ian develops a rivalry with the Yellow buffer team and is offered a chance to join the red buffer team. Ian discovers that Coach History has a mysterious connection with the gnomes. In an attempt to learn what Coach History knows about the gnomes, Ian sacrifices his Buffer match in order to fight off the gnomes while CJ and Gabe steal evidence from Coach History about the gnomes. They then discover that the gnomes are really students at Tower Prep.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":7,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-11-16","episode_number":5,"episode_type":"standard","id":778791,"name":"The Rooks","overview":"Gabe tells Ian about a fraternity at the school called the Rooks, who choose certain students each year to join their ranks, subjecting them to demeaning activities. Ian is the only one who makes it in. He learns that Jeremy (the Rooks leader) plans to sabotage CJ's dance, so he betrays the Rooks, only to be beaten up by Jeremy (who has a preflex ability, like Ian). However, Gabe stops the Rooks and Headmaster cancels the dance organized by CJ. Coach and Headmaster discuss Ian and the Corvus H-40 (an ability enhancing chemical taken by the Rooks) and it's revealed they were Rooks when they attended Tower Prep.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":7,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-11-23","episode_number":6,"episode_type":"standard","id":778792,"name":"Book Report","overview":"While reading the Odyssey, Ian discovers notes about how to escape Tower Prep, written by a former student named Norman. While on his quest, Ian encounters students similar to the creatures in the book. It is later revealed Ian is not supposed to escape, but find out what Tower Prep is all about from within the school.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":"/nlggrrQLNauyNehnZ8PUzzIwfho.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-11-30","episode_number":7,"episode_type":"standard","id":778793,"name":"Election","overview":"Gabe decides to run for class president when the other candidate becomes ill. Students begin losing their powers shortly after the campaigning begins. Ian discovers a chemical called \"Chemica Desin\" implanted in the campaign buttons and infecting the students. Ross Anderson, the campaign manager for Emily Wright (Gabe's election opponent) was the culprit. Gabe wins the election and Headmaster and Nurse ask Ross to show them how she improved the chemical using only Tower Prep supplies.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-12-07","episode_number":8,"episode_type":"standard","id":778801,"name":"Field Trip","overview":"The Biology class is sent into the woods to research the Tower Prep flora and fauna. Paired randomly, they have little time to check out the forest to find out exactly where Tower Prep is located. Ian and Cal discover an underground gnome lair. In the end, it is revealed that Cal intended to become a gnome. Phillips, a student that once escaped the school, is revealed to be \"Redfang\", a creature haunting the woods. He is also the leader of a mysterous group hiding in the wild who will save as many students they can from becoming gnomes.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":7,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-12-14","episode_number":9,"episode_type":"standard","id":778800,"name":"Dreams","overview":"When Ian, Gabe, and Suki have dreams about a mysterious yellow elevator, they search for it in the tunnels. They observe a new student being brought out of the elevator. He becomes Ian and Gabe's new roommate and can infiltrate dreams. They discover Cornelius Tower's office (Tower Prep's founder) and investigate. They take some items from Cornelius' office and bring it to the observatory. Conner then escapes and reveals, in Ian's dream, that he is a \"scout\". They find that Conner took the things from the observatory, but left a picture of Cornelious Tower with a young child. Ian realizes that the young boy is himself.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-12-21","episode_number":10,"episode_type":"standard","id":778789,"name":"Phone Home","overview":"On his birthday, Ian demands to speak to his parents. Headmaster allows the call, but it is later revealed that it was really Whisper impersonating his mother. Suki spies on Headmaster's office and sees her brother, Shinji, who she believed was dead, he was once a student at Tower Prep. Knowing her brother plans to later call home, Suki attempts to piggyback onto the signal with a homemade satellite phone. As the group are about to reach the roof of the nearest satellite point they a blocked by a gaping hole. When they are about to swing across CJ kisses Ian, since earlier he had admitted he had never kissed a girl. When they get across they discover Whisper was upgraded from version 119 to Whisper 120. They then successfully make the call, but Ian's mom claims that it was to dangerous to talk and hangs up.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":"/totMCiO31QBRp5oGO8tgSok4K3H.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[{"character":"","credit_id":"5258a967760ee346616d61ad","order":500,"adult":false,"gender":2,"id":1121580,"known_for_department":"Acting","name":"Tim Fellingham","original_name":"Tim Fellingham","popularity":3.583,"profile_path":"/nUOe69E3kYrGseYLQlV4ukP1oiJ.jpg"}]},{"air_date":"2010-12-21","episode_number":11,"episode_type":"standard","id":778790,"name":"Trust","overview":"Ian suspects Cal is a spy for Headmaster just as the group's escape plan begins to come together. When he finds Cal in CJ's room, Ian begins to suspect CJ is giving Cal inside information. Elsewhere, a group of students known as The Broken are discovered in the woods. Emily Wright then reveals that she intends to join The Broken and their resistance. These actions may have also led to the Art teacher's dismissal (Art was the faculty advisor for the school newspaper). The group agrees to meet The Broken, but find their hideout empty. Ian and CJ clear their trust issues, and Headmaster meets with the school's head administration, telling them that The Broken is mended, but Ian is still \"broken\", but not for long.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[{"character":"Guide","credit_id":"595883b09251410a5901aba5","order":502,"adult":false,"gender":2,"id":1004890,"known_for_department":"Acting","name":"Travis Turner","original_name":"Travis Turner","popularity":8.075,"profile_path":"/A8j6zZcdXjTnLJ4l9T9Th8V04fG.jpg"}]},{"air_date":"2010-12-28","episode_number":12,"episode_type":"standard","id":778795,"name":"Snitch","overview":"Conner returns to the school and claims to know how to get out. He and his group of exiles believe West Campus is the way out of Tower Prep. He tries to get to West Campus but the gnomes made him turn back. He ends up in Ian's and Gabe's room with Chemica Desin 2.0. Ian sends him to the observatory, but the gnomes capture him in the tunnels. Ian takes the maps and key to West Campus and goes there himself to find out what really happens to students at West Campus. He finds a way out, but in the meanwhile Suki's brother tries to take her home. In the very end, it is revealed that Headmaster is CJ's father.","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-12-28","episode_number":13,"episode_type":"finale","id":778796,"name":"Fathers","overview":"Gabe is sent to West Campus for refusing to reveal his source for Chemica Desin 2.0. His West Campus roommate is a guy named Demetrius, who was hired by Headmaster to protect Gabe from Jeremy and the Rooks. It is revealed to Ian that \"3's the charm\" meaning their third escape attempt will be successful, but only for three of them. Suki's father arrives to take her back home but she is rescued by Ian. Meanwhile, Headmaster and CJ argue in his office, until Headmaster sends a text to Ian pretending to be CJ. Ian and Suki both arrive to finally learn that CJ is Headmaster's daughter. Ian tells Headmaster he will be leaving the school, no matter what Headmaster does to stop him. The argument escalates into a physical fight, until Ian knocks out Headmaster. Ian, CJ and Suki then go to West Campus to rescue Gabe, just as he is about to be assaulted by The Rooks. The team escapes after crawling through a vent Ian found in an abandoned kitchen. Outside, they meet a woman who turnes out to be a hologram of Whisper 120. She tells them that seven people know the Headmaster is trying to return the school to what it was when Cornelius Tower founded it: Suki, Ian, CJ, Gabe, Headmaster, Cornelius Tower and one more person. Whisper tells the four that they have escaped and that \"not many people do\".","production_code":"","runtime":null,"season_number":1,"show_id":33785,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":44641,"poster_path":"/snLe4awpf3e8yJY1PaiXJ8puxOv.jpg","season_number":1,"vote_average":6.7}}}