{"adult":false,"backdrop_path":"/ofSAqvkjeVmNkaON6iKqw84ka59.jpg","created_by":[{"id":7624,"credit_id":"5af848ef9251412c3900bf53","name":"Stan Lee","gender":2,"profile_path":"/kKeyWoFtTqOPsbmwylNHmuB3En9.jpg"}],"episode_run_time":[45],"first_air_date":"2010-08-05","genres":[{"id":99,"name":"Documentary"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"http://www.history.com/shows/stan-lees-superhumans","id":33831,"in_production":false,"languages":["fr","en"],"last_air_date":"2014-09-17","last_episode_to_air":{"id":1006714,"name":"Ultimate Super Team","overview":"Creating teams of comic book heroes requires a combination of incredible but unique superpowers. This time Daniel meets four people with totally separate powers…but could they be ultimate team of real life superhumans? Adam Winrich claims to have extraordinary accuracy with a whip and has turned this old-school object into a comic book weapon just like a real life Whiplash! Daniel seeks out Will Trubridge, a free-diver that claims he can dive deeper than anyone else with no mechanical assistance. Is he really a human submarine? Joel King claims he’s built a super-powered skateboard, capable of breaking the speed limit… on the freeway. Daniel watches his latest record attempt, where any mistake could be fatal.","vote_average":0,"vote_count":0,"air_date":"2014-09-17","episode_number":10,"episode_type":"finale","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null},"name":"Stan Lee's Superhumans","next_episode_to_air":null,"networks":[{"id":65,"logo_path":"/9fGgdJz17aBX7dOyfHJtsozB7bf.png","name":"History","origin_country":"US"},{"id":1064,"logo_path":"/xU5g31CXgsP7BhcDtXx9yW0Emrj.png","name":"RMC Découverte","origin_country":"FR"}],"number_of_episodes":31,"number_of_seasons":3,"origin_country":["US"],"original_language":"en","original_name":"Stan Lee's Superhumans","overview":"Stan Lee's Superhumans is a television series that debuted August 5, 2010 on History. It is hosted by comic book superhero creator Stan Lee and follows contortionist Daniel Browning Smith, \"the most flexible man in the world\", as he searches the globe for real-life superhumans – people with extraordinary physical or mental abilities. Many of the segments are fraudulenty manipulated and these appear side by side with other segments that are valid. For example, one segment shows a person applying an electric drill to their body[ after it is used to drill a hole in wood], except the direction of rotation of the drill is fraudulently reversed in the process.","popularity":4.336,"poster_path":"/fStGZv2jFxAu4j83V5Koj2QNBdm.jpg","production_companies":[{"id":113382,"logo_path":null,"name":"Tremer Productions","origin_country":"CA"},{"id":3507,"logo_path":"/m7iLIC5UfC2Pp60bkjXMWLFrmp6.png","name":"History","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2010-08-05","episode_count":8,"id":44668,"name":"Season 1","overview":"","poster_path":"/yjr2DudqaUBDnza0iRoZAkmQvtz.jpg","season_number":1,"vote_average":0},{"air_date":"2011-10-26","episode_count":13,"id":44669,"name":"Season 2","overview":"","poster_path":"/ahg8BT3FCGValDsB72oKuAuLVCV.jpg","season_number":2,"vote_average":0},{"air_date":"2013-03-07","episode_count":10,"id":44670,"name":"Season 3","overview":"","poster_path":"/jVfPSeu3Eq5z2zPJJVBo4fBmqrv.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"French","iso_639_1":"fr","name":"Français"},{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":7.2,"vote_count":9,"season_data":{"1":{"_id":"5258a990760ee346616d8e37","air_date":"2010-08-05","episodes":[{"air_date":"2010-08-05","episode_number":1,"episode_type":"standard","id":779207,"name":"Electro Man","overview":"Daniel Browning Smith, a man with Superhuman flexibility, travels to India to investigate a local legend that a man has developed immunity to electric current and can let it pass through his body, unharmed. Can anyone really be immune to electrocution? Daniel next meets Scott Flansburg, dubbed the \"Human Calculator.\" Scott can complex arithmetic (even square and cube roots) all in his head, faster than anyone on earth. Does his brain work in an entirely new way? Totally blind from birth, Juan Ruiz apparently visualizes the world using the same form of sonar used by bats and dolphins called echolocation. Juan demonstrates his incredible ability to Daniel by navigating around a complex course using only the echoes of his tongue clicks to guide him. Dennis Rogers is only 5ft 6\", but is pound for pound the strongest man in the world. He demonstrates his sheer strength bending hammers and horseshoes at will.","production_code":"","runtime":45,"season_number":1,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-12","episode_number":2,"episode_type":"standard","id":779204,"name":"Killer Punch","overview":"Daniel is in Vegas to meet Bob Munden the planet's fastest gunslinger, rumored to be faster than the blink of an eye, and with accuracy second to none. Using electromyography, and the fastest camera technology in the world, we investigate whether his speed goes beyond what science says is humanly possible. Timo Kaukonen is a World Sauna Champion and pushes his body to the limits. He has lasted for 16 minutes in temperatures hot enough to boil water. Daniel investigates to find out if he has a genetic difference that sets him apart. Warrior monk Shi Yan Ming shocked the world by moving to New York in 1992, marking the first time that a Shaolin monk has ever defected from China. By harnessing the power of Qi, or vital energy, he's taken Bruce Lee's infamous \"one-inch punch\" to a new level. \"Professor Splash,\" (aka Darren Taylor) is a world champion high-diver...with a difference. Daniel tries to find out how a man can survive a 35 foot belly flop into just one foot of water.","production_code":"","runtime":45,"season_number":1,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-19","episode_number":3,"episode_type":"standard","id":779205,"name":"Hammer Head","overview":"Daniel meets Dean Karnazes. He's run 50 marathons in 50 days, and then ran 1300 miles back to the start. But how can Dean's body not suffer the exhaustion and fatigue faced by everyone else on earth? John Ferraro is rumored to have a skull that can withstand sledgehammers, bowling balls and even jackhammers. Daniel investigates to find out if he has a genetic difference that makes his skull superhumanly strong. Chris claims to have incredible powers like that of the Marvel comic-book character \"Destiny\"; he believes that his dreams are a window into the future. But will Chris' remarkable claims of premonitions stand up to the scrutiny of our host? Kenny Muhammad, aka \"The Human Orchestra\", is the most extraordinary human mimic on the planet. This wizard of sound possesses an astounding ability that enables him to simultaneously generate an entire orchestra of sounds from his mouth.","production_code":"","runtime":45,"season_number":1,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-26","episode_number":4,"episode_type":"standard","id":779206,"name":"Human Speed Bump","overview":"Daniel's incredible journey continues, as he investigates Tim Cridland, who claims to be able to switch off pain. He demonstrates his ability to go beyond normal pain thresholds by impaling himself with skewers, with little or no bleeding. Derek Paravicini is a blind autistic man with an incredible \"superhuman\" gift. Derek can remember and accurate re-play any song he ever hears. Does his ability offer the world an insight into the power of the human brain? Jyothi Rai is known as India's Spiderman--scaling walls at an unbelievable speed. Able to run up a six-story structure in just seconds, Jyothi has perfected his climbing technique by taking inspiration from monkeys. Last year in Milan, nine trucks weighing a total of over 30,000 lbs ran over Tom Owen in quick succession. How can his body survive such force? Daniel tests Tom's abs to find out if he has the hardest muscles on earth.","production_code":"","runtime":45,"season_number":1,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-02","episode_number":5,"episode_type":"standard","id":779200,"name":"Human Wolf","overview":"Daniel meets Patrick Musimu, who's able to dive to 656 feet on a single breath; Miroslaw Magola claims to harnesses the power of psychokinesis; Shaun Ellis has become a wolf, by living, sleeping, bathing and feeding with a deadly pack of wolves.","production_code":"","runtime":45,"season_number":1,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Mind Force","credit_id":"643d2ae246aed4051c5043d9","order":500,"adult":false,"gender":2,"id":4014762,"known_for_department":"Acting","name":"Miroslaw Magola","original_name":"Miroslaw Magola","popularity":0.6,"profile_path":null}]},{"air_date":"2010-09-16","episode_number":6,"episode_type":"standard","id":779201,"name":"Human Crash Test Dummy","overview":"Isao Machii is a modern day samurai with unbelievable sword skills; Dr. Norman Gary can control an entire swarm of bees; Steve Santini performs incredible escapes requiring dexterity and body control; Rusty Haight, has had over a 1,000 car crashes.","production_code":"","runtime":45,"season_number":1,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-23","episode_number":7,"episode_type":"standard","id":779202,"name":"Rubber Band Man","overview":"Tim Friede has made himself a human guinea pig, allowing some of the world's deadliest snakes to bite him; Dan Meyers is the best sword swallower in the world; Garry Stretch Turner claims to have the World's stretchiest skin.","production_code":"","runtime":45,"season_number":1,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-30","episode_number":8,"episode_type":"finale","id":779203,"name":"Jaw Breaker","overview":"A man claims to be able to knock another to the ground without touching him; Salim Haini eats anything; Daniel pits himself against Ron White, U.S. Memory Champion; Greg Poe claims to be able to withstand forces of up to 12G's.","production_code":"","runtime":45,"season_number":1,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":44668,"poster_path":"/yjr2DudqaUBDnza0iRoZAkmQvtz.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258a990760ee346616d8e42","air_date":"2011-10-26","episodes":[{"air_date":"2011-10-27","episode_number":1,"episode_type":"standard","id":779208,"name":"Unbreakable","overview":"In a temple in Kuala Lumpur, Shaolin monk Hu Qiong demonstrates his unbreakable body by smashing steel on his head, and spears in his throat. Bio-mechanic professor Dan Voss measures the forces at play to prove this is real. Dan watches Hu, as he attempts to push an electric drill into his own temple for a whole minute. Then, Daniel arrives in San Diego to witness Chad Netherland hold back a 500 bhp car. He calls in a sports physiologist to examine Chad’s technique, and to work out the real forces at play. Next, Daniel brings Dickinson Oppon from Ghana to South Africa to find out if the rumors of his superhuman control over his stomach are actually true. And finally, Daniel meets Byron Ferguson at an archery range where super-slo-mo images capture his accuracy in detail. Then eye-tracking technology is brought in to see if his eyes actually track the targets, or is it just luck?","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-03","episode_number":2,"episode_type":"standard","id":779209,"name":"Shark Master","overview":"Daniel goes to Wisconsin to meet Aaron Evans who is called \"The Spring\", who could be the greatest jumper in the world; Melchor Menor, the \"Shins of Steel\" who can break baseball bats in half with a single kick; Ito Kenichi from Japan who has the ability to sprint on all fours; and Mike Rutzen from Cape Town, South Africa who claims to be able to control sharks.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-28","episode_number":3,"episode_type":"standard","id":779211,"name":"Yo Yo Ninja","overview":"When it comes to neck strength, John Evans is a legend. This six foot five, 24-inch neck ‘IRON MAN’ has 32 world records to prove it! Then, Daniel meets Hiro in Seattle. Using slomo cameras, motion capture and impact dynamics, we find out if Hiro Suzuki’s yoyo skills push the limits of speed and dexterity. Hiro then enters a duel with a semi-automatic handgun, to see if he really has turned the yoyo into a weapon. Next, Daniel meets professor Kevin Warwick, the world's leading expert in Cybernetics, who became the worlds first Cyborg in a ground breaking set of scientific experiments, using himself as a guinea pig, surgically inserting technological implants connected to his central nervous system. And finally, even more powerful than Current Mohan, Slavisa Pajkic ‘Biba’ from Serbia claims to be able to take a hit of 20,000 volts !","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-07","episode_number":4,"episode_type":"standard","id":779215,"name":"Super Special","overview":"The search is on to find more real-life superhumans! First Daniel is in Canada to meet Pat Poviliatis, a man who boasts his hands are tough enough to withstand the deadly jaws of a steel-tooted cougar-trap. Sam Whittingham claims to have built the fastest human powered machine on the planet. His combination of design genius, and physical strength could make him the ultimate superhuman man with a brain like a hard drive. Brad Williams claims to have Super Autobiographical Memory, which means his brain has the power to remember and catalog almost everything that has ever happened to him, down to the tiniest details. And Annalisa Flanagan is rumored to have the loudest voice on earth, 122db. That’s enough to cause physical pain and permanent ear damage.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-14","episode_number":5,"episode_type":"standard","id":779214,"name":"Human Shield","overview":"Rene Richter says he has the strongest teeth on earth, capable of bending coins. But we discover his strength lies in his jaw, which Rene says allows him to lift over 1000lbs. Kirby Roy has spent his life trying to become impervious to pain, using a controversial martial art called Combat Qi, he claims he is able to take strikes of limitless power to the most sensitive parts of the human anatomy. Daniel calls in some of the world's hardest hitters and kickers to put that to the test. Internet videos show college quarterback Alex Tanney performing mind-blowing trick throws. They look impossible, so Daniel wants Alex to prove he's for real. It's rumored Eric Scott is the best jet-pack pilot on earth, and he intends to prove it, by flying over a lake with no safety measures and only 30 seconds of fuel.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-21","episode_number":6,"episode_type":"standard","id":779210,"name":"Steel Face","overview":"Daniel Browning Smith is in Vegas to meet Brian Jackson who blows up a hot water bottle until it explodes. Daniel takes Brian to a lung specialist to measure the power output and pressure of his lungs. Lu Deyuan's extraordinary, traffic-stopping superhuman ability is eye watering! Daniel meets Lu in a Kuala Lumpur dockyard where he's hanging steel bars from his eyelids. Lu says he feels no pain and doesn't suffer from any injuries. Could Anthony Kelly have the fastest reflexes in the world? Daniel meets him catching tennis balls at 80mph, and use a high speed camera to capture his technique. At a Detroit Dojo, Daniel meets Japanese Nunchuck Master Hiroki deadly in the martial art of nunchaku combat. Cindi Bir and Daniel test his ability by challenging his accuracy with a baseball pitching cannon.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-28","episode_number":7,"episode_type":"standard","id":779213,"name":"Spiderpower","overview":"At high altitude, low oxygen causes hypoxia, altitude sickness and very quickly, death. But Ang Rita Sherpa claims he's climbed Everest 10 times with no extra oxygen. Daniel takes him to a leading Altitude Research facilityto witness the effects of altitude in a hyperbaric chamber. It's said spider-silk is the strongest material on earth. And Randy Lewis says he has founda way to copy it--by breeding a herd of goats with spider DNA, creating a goat that can produce spider-silk in its milk? Stan wants Daniel to find out if this could bethe first step to a real life Spiderman. It's rumored Tori Allen can climb Like Spiderman, but in fact it seems she was brought up with monkeys and has actually mastered many of their climbing tricks. Stan Lee created Rocket Racer, a super-powered skateboarding nemesis for Spiderman. But Bob Burnquist is said to perform jumps on his skateboard that have made Stan's comic books a reality.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-21","episode_number":8,"episode_type":"standard","id":779212,"name":"Beast Masters","overview":"Dean Sheldon claims to be immune to America's deadliest scorpion venom. Daniel asks him to prove it by collecting 22 wild scorpions form the Arizona desert, and putting them in his mouth, all at once! Kanzawa Sensei claims to be able to put any animal into a trance using mind control. Daniel brings him to a California to prove his powers on an alpaca ranch, before facing the ultimate challenge. George Aldrich is Nasa's supersniffer, employed to scent test every object that goes into space, as he says \\\"you can't open a window on the space shuttle!\\\" But how does his power compare to a sniffer dog? Daniel, and LAPD sniffer-dog trainer Lamb Lambert, set George a challenge. Martin Strehl claims he has swum the entire length of the Amazon, 3000 miles, a feat no other human has achieved.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-28","episode_number":9,"episode_type":"standard","id":779216,"name":"Rocket Blader","overview":"Stan sends Daniel to meet 38-year-old German speed fanatic Dirk Auer, who claims that with his incredible turbo powered rocket backpack and skates, he can reach amazing speeds. Guy Bavli claims he can move objects around a room using the power of his mind. We take him to a hardware store where he bends nails and cutlery off the shelves–and even appears to move objects without touching them. Daniel meets Nigel on a running track made of broken glass. A pain expert examines Nigel's physiology… if he feels pain in the rest of his body, could his feet hold the key to switching off pain? Steve Woodmore claims to be able to talk at a \\\"superhuman\\\" speed of 637 Words per Minute! That's 10.25 Words per second, four times faster than the average person.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-04","episode_number":10,"episode_type":"standard","id":779217,"name":"Robo Men","overview":"Matthius Schlitte was born with Proteus syndrome, giving him one arm MUCH bigger than the other. He has used this genetic difference as a gift,and through training, turned himself into a top arm wrestler, capable of beating men twice his size. Butcan he take on a super-charged robot, literally built to arm wrestle? Jean Yves Blondeau has designeda 32 wheel roller-suit that turns him into a human rollerskate with incredible speedand agility. Daniel wantsto push the Rollerman to the max, pitting him against a 100mph go-kart. Jack Dagger claims to be the deadliest knife thrower on earth. He sayshe can hit any target, no matter how small or how fast it is moving. Will Daniel survive a William Tell-esque apple on the head stunt? It's rumored Wolfgang Manicke and his posse have the power to destroy buildings with their bare hands. Daniel takes Wolfgang to a scientist to analyze his strength.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-18","episode_number":11,"episode_type":"standard","id":779218,"name":"Bird-Man","overview":"The ultimate superpower is flight, and Yokke Sommer is rumored to have achieved it–coming as close to a bird as any human has ever achieved. Daniel meets him on a 1000ft cliff in Norway, the site of many tragic deaths, where Yokke wants to prove his power by flying at over 120 mph just 3ft from the cliff face. Ram Barkai claims to be immune to cold–regularly swimming in temperatures cold enough to kill. He proves his unique abilityin the Nordic fjord-lands, before Daniel sets him the challenge of swimming a kilometre in water just 1 degree above freezing. Man has evolved to walk upright, and has gone on to be able to run faster and faster. But Roland Wagner has become the fastest backwards runner on earth and says his technique is actually better for the body. Hands of fire? Master Zhou claims he can produce heat inhis hands hot enough to boil water. Daniel puts him to the test to try and find an explanation.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-25","episode_number":12,"episode_type":"standard","id":779219,"name":"Supersight","overview":"Alexander Levit was born blind. Living in Los Angeles, he claims to not only see shapes but colors and writing on screens in \"Supersight.\" In the same area lives Mikhail Vasilyev, \"Human Magnet\" whose skin is adhesive and can hold non-magnetic objects, too. Stig Severinsen is \"Dolphin Man\" who can hold his breath 20 minutes. \"The Human Toolbox\" is Brad Byers of Vancouver, who can stick long objects into a channel in his head that begins at his nose.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-01","episode_number":13,"episode_type":"finale","id":779220,"name":"Finger of Steel","overview":"Daniel meets Ho in Kuala Lumpur, where he demonstrates his incredible ability, smashing through the rock hard exterior of a coconut with his index finger. Dan Voss measures the force of his \"finger of steel.\" And a load hammer replicates this force on a coconut. Next, Daniel meets Moses Langan in a busy Detroit shopping mall, where he has drawn a crowd with his spectacular ability. He appears to be able to turn his legs 180 degrees, and walk forwards! Orlando Duque demonstrates a breath-taking ability–diving from the same height as a twelve-story building and hitting the water at 55MPH without injury. Daniel and an Orthopaedic Surgeon Dirk Dolbere, investigate the forces Orlando can withstand. Joe Eigo says his jump defies gravity and insists he never uses trick photography, crash mats or safety wires.","production_code":"","runtime":45,"season_number":2,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":44669,"poster_path":"/ahg8BT3FCGValDsB72oKuAuLVCV.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258a990760ee346616d8e4d","air_date":"2013-03-07","episodes":[{"air_date":"2013-03-07","episode_number":1,"episode_type":"standard","id":980650,"name":"Throat of Steel","overview":"First, Daniel meets Ho in Kuala Lumpur, where he demontrates his incredible ability, smashing through the rock hard exterior of a coconut with his index finger. Dan Voss measures the force of his finger of steel. And a load hammer replicates this force on a coconut. Then he attempts to smash the shells of 3 coconuts in 30 secs. Then, Daniel meets Moses Langan in a busy Detroit shopping mall, where he has drawn a crowd with his spectacular ability. He appears to be able to turn his legs 180 degrees, and walk forwards! We use an open MRI to see what is going on inside his skeleton to allow this to take place. Next, Orlando Duque demonstrates a breath-taking ability, diving from the same height as a twelve-storey building and hitting the water at 55MPH without injury. Daniel and an Orthopaedic Surgeon Dirk Dolbere, investigate the forces Orlando can withstand. They then witnesses Orlando’s latest feat and are blown out of the water! And finally, Joe Eigo says his jump defies gravity and insists he never uses trick photography, crash mats or safety wires. Could his body be engineered differently? Sports physiologists use motion capture to investigate and the scientist is amazed by Joe’s gravity-defying final demo.","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-20","episode_number":2,"episode_type":"standard","id":994581,"name":"Painproof","overview":"Stan sends Daniel to meet four people who can control their perception of pain, and push their bodies to unthinkable levels. Having created so many fictional pain-proof characters in his comics, Stan never thought real people could possess immunity to pain, but these four individuals perform staggering feats of pain tolerance that challenge the known limits of the human body. Eduardo Lasaga claims he can withstand extreme amounts of bone-crunching weights on his body. But, is he really un-crushable? Evgeny Kuznetsov takes the gore factor to the extreme, withstanding the excruciating pain of dozens of darts penetrating his flesh, but he also doesn’t shed a drop of blood. Matthew Ahmet claims he’s trained his body to tolerate the same level of pain as the ultimate shaolin warriors. Li Xin’s demonstration of skull strength is almost too gruesome to watch, and he claims he’s developed a superhuman head, that is virtually indestructible.","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-27","episode_number":3,"episode_type":"standard","id":996109,"name":"Human Fireball","overview":"This time Stan wants Daniel to investigate four people who claim to have superhuman heat tolerance, performing potentially deadly demonstrations that push themselves, and the human body, to new limits. Daniel puts them to the test to find out if they really can stand the heat! Ted Batchelor claims he is fireproof. At Salinas Airfield, Ted attempts the longest full body burn of all time, running over 500 feet, whilst burning at temperatures of 2400 Fahrenheit. Kann Trichaan from Thailand is rumored to be immune to the searing heat of boiling cooking oil, and appears to feel no pain, even when submerging his hands for seconds at a time. Anandita Dutta Tamali is the most chilli-proof human on earth, but can she withstand pepper spray? Marshall Ullrich is said to be immune to the lethal effects of heatstroke, but Daniel tests his heat tolerance by challenging him to run in potentially fatal temperatures, in an oven!","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-20","episode_number":4,"episode_type":"standard","id":1003631,"name":"Powerlifting Pastor","overview":"Super-strength appears in almost all comics, whether a natural-born ability or the result of some misguided scientific experiment. This time Daniel investigates four claims of genuine real-life super-strength that appear to take human power to mind boggling levels. Ales Novak claims to have the ability to scale ropes incredibly fast, using his own pulling power. Daniel tests the man known as the human winch, to find out if he is truly superhuman. Kevin Fast claims he’s the strongest man in the world. He says his ability is a power granted by God, but he’s going to attempt to pull a 140 ton truck, a machine designed to move mountains. Jim Dreyer is an endurance swimmer who can swim for days on end, while towing tons of weight behind him, like a human tug boat. Lasha Pataraya says he has the world’s strongest ears. But Daniel tracks him down in Florida where he attempts to pull a five ton truck with just one ear.","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"53e768b9bcca0120c9000ec7","adult":false,"gender":0,"id":1351788,"known_for_department":"Directing","name":"Carl Lindahl","original_name":"Carl Lindahl","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-08-13","episode_number":5,"episode_type":"standard","id":1004385,"name":"Fearproof","overview":"This time Stan wants Daniel to meet four people who claim to be fear-proof, and push man’s limits to the very edge, performing staggering feats at extreme heights that would paralyze any normal person with fear. Julio Munoz claims to have the ability to switch off fear, and wants to prove it by attempting one of the scariest stunts of all time that requires superhuman nerves of steel. Tyler Bradt takes fearlessness to a whole new level, kayaking over waterfalls hundreds of feet high. Andy Lewis is a fearless slackliner who uses no safety harness when traversing deadly canyons on an inch-wide rope. Gary Connery has dedicated his life to become the first human to jump from an aircraft and land without a parachute, and survive. Daniel heads up to over 3000 feet to watch Gary attempt this insane feat.","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"53e768b9bcca0120c9000ec7","adult":false,"gender":0,"id":1351788,"known_for_department":"Directing","name":"Carl Lindahl","original_name":"Carl Lindahl","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-08-20","episode_number":6,"episode_type":"standard","id":1005155,"name":"Rapid Fire","overview":"Comics are full of inventors and geniuses that use machines to perform amazing feats. Stan sends Daniel to meet real life inventors who claim to have built machines that that merge man and machine. But can they take humans to the next level, to become superhuman? Jerry Miculek is rumored to be able to fire an old fashioned handgun, faster than a fully automatic. Daniel puts that claim to the test, to see if he is… a human machine gun. Francky Zapata claims he has built a machine that allows him to fly through and over the water, just like Iron Man. Time for Daniel to see what he’s capable of. Paul Swift is rumored to be the best driver on the planet, and can perform feats with a car that appear impossible. Eric Barone has built a new breed of bicycle in an attempt to become the fastest downhill cyclist of all time.","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-27","episode_number":7,"episode_type":"standard","id":1005334,"name":"Man vs. Beast","overview":"Animals are imbued with incredible abilities, like echo-location, super-sight. This time Stan is sending Daniel on a mission to find four people who claim they have the ability to match nature's superpowered animals. Ru Anting claims to have superpowered tear-ducts, that can shoot liquid even further than the deadly Spitting Cobra. Kie Willis claims to have a superhuman jump, that he says can match nature's most powerful jumpers, the leopard. Daniel investigates claims that Igor Zaripov could have jaws just as strong as one of nature's most powerful bites, the shark. Dan Goodwin, wants to climb the worlds tallest buildings like a human gecko, using nothing but sucker cups.","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-03","episode_number":8,"episode_type":"standard","id":1004846,"name":"High Voltage","overview":"Genetic mutation produces incredible comic-book superheroes. But Stan wants Daniel to meet four real people who claim to have a difference in their physiology, that makes them superhuman! Mr. Duong claims that his entire family possess a genetic mutation that makes them completely immune to electrocution, and can hang from a live pylon and survive. Orlando Serrell claims he was turned into a real life genius after being hit on the head, and can remember the exact weather every day since the accident. Thanks to a unique genetic mutation, Joshua Carter is able to perform a staggering feat of contortion, that rewrites the limits of the human body. Kortney Olsen claims to have thighs even stronger than a python. Daniel tests her crush force, to see if she has turned her body into a human weapon.","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"53e768b9bcca0120c9000ec7","adult":false,"gender":0,"id":1351788,"known_for_department":"Directing","name":"Carl Lindahl","original_name":"Carl Lindahl","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-09-10","episode_number":9,"episode_type":"standard","id":1005512,"name":"Disc of Death","overview":"The secret of any good superhuman is a deadly power hidden beneath an ordinary exterior. This time Stan is on the hunt for people with secret abilities that turn them into lethal human weapons! Lee Morrison says he has trained himself to deliver a super-powered strike, as deadly as a tiger claw. Brodie Smith is rumored to use an every day frisbee with killer accuracy. Daniel puts him head-to-head with a sniper to find out how accurate he really is. Rick Smith Jr. claims to be able to throw an everyday playing card with devastating accuracy and power, but can he throw it the length of a football field? Many people claim to have unique powers, but Paul Stringerl says he has the power and strength to run straight through a brick wall.","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"53e768b9bcca0120c9000ec7","adult":false,"gender":0,"id":1351788,"known_for_department":"Directing","name":"Carl Lindahl","original_name":"Carl Lindahl","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-09-17","episode_number":10,"episode_type":"finale","id":1006714,"name":"Ultimate Super Team","overview":"Creating teams of comic book heroes requires a combination of incredible but unique superpowers. This time Daniel meets four people with totally separate powers…but could they be ultimate team of real life superhumans? Adam Winrich claims to have extraordinary accuracy with a whip and has turned this old-school object into a comic book weapon just like a real life Whiplash! Daniel seeks out Will Trubridge, a free-diver that claims he can dive deeper than anyone else with no mechanical assistance. Is he really a human submarine? Joel King claims he’s built a super-powered skateboard, capable of breaking the speed limit… on the freeway. Daniel watches his latest record attempt, where any mistake could be fatal.","production_code":"","runtime":45,"season_number":3,"show_id":33831,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"53e768b9bcca0120c9000ec7","adult":false,"gender":0,"id":1351788,"known_for_department":"Directing","name":"Carl Lindahl","original_name":"Carl Lindahl","popularity":0.6,"profile_path":null}],"guest_stars":[]}],"name":"Season 3","overview":"","id":44670,"poster_path":"/jVfPSeu3Eq5z2zPJJVBo4fBmqrv.jpg","season_number":3,"vote_average":0}}}