{"adult":false,"backdrop_path":"/slom2IpZy98nlDXN9OwElOm9AFl.jpg","created_by":[],"episode_run_time":[60,45,42],"first_air_date":"2010-01-10","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.channel.nationalgeographic.com/series/border-wars/all/Overview","id":33914,"in_production":false,"languages":["en"],"last_air_date":"2015-04-15","last_episode_to_air":{"id":1054108,"name":"Crossing at All Costs","overview":"Follow along as border patrol agents hunt down drug runners and illegal immigrants trying to cross the border and sneak into the U.S. any way they possibly can.","vote_average":0,"vote_count":0,"air_date":"2015-04-15","episode_number":2,"episode_type":"finale","production_code":"","runtime":null,"season_number":6,"show_id":33914,"still_path":null},"name":"Border Wars","next_episode_to_air":null,"networks":[{"id":43,"logo_path":"/q9rPBG1rHbUjII1Qn98VG2v7cFa.png","name":"National Geographic","origin_country":"US"}],"number_of_episodes":61,"number_of_seasons":6,"origin_country":["US"],"original_language":"en","original_name":"Border Wars","overview":"Border Wars is an American documentary television series on the National Geographic Channel. The program follows agents of the U.S. Border Patrol, U.S. Customs and Border Protection, Immigration and Customs Enforcement, and other divisions of the Department of Homeland Security as they investigate and apprehend illegal aliens, drug smugglers, and other criminals violating immigration to the United States and customs laws. The series also follows Air Interdiction Agents, and Marine Interdiction Agents who patrol along the U.S.-Mexico border, as well as southern Florida and Puerto Rico.","popularity":2.77,"poster_path":"/9l7XItuAi6ckRNPwyBb1qD8FVne.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2010-01-10","episode_count":5,"id":44734,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2010-08-29","episode_count":17,"id":44732,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2011-09-04","episode_count":13,"id":44733,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2012-07-09","episode_count":14,"id":44735,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2012-11-14","episode_count":10,"id":44736,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0},{"air_date":"2013-07-07","episode_count":2,"id":44737,"name":"Season 6","overview":"","poster_path":null,"season_number":6,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Scripted","vote_average":7.5,"vote_count":2,"season_data":{"1":{"_id":"5258aa2a760ee346616e087d","air_date":"2010-01-10","episodes":[{"air_date":"2010-01-10","episode_number":1,"episode_type":"standard","id":779896,"name":"Last Defense","overview":"Border Patrol Agents William Ortiz and Eduardo Berlanga try to intercept a pickup truck filled with people who have crossed illegally from Mexico. When they reach the vehicle, they realize that two of the passengers are young twin girls. The situation heats up when they learn that the man claiming to be their father apparently is not being truthful.","production_code":"","runtime":null,"season_number":1,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-11","episode_number":2,"episode_type":"standard","id":779897,"name":"City Under Siege","overview":"A special undercover group shuts down a house in Nogales where illegal immigrants are believed to be living. After the house is surrounded and its occupants apprehended, agents must pick out the human smugglers, or \"coyotes,\" and get these suspected criminals off the streets","production_code":"","runtime":null,"season_number":1,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-18","episode_number":3,"episode_type":"standard","id":779898,"name":"Dead of Night","overview":"Aviation Enforcement Pilot John Manheimer and his Black Hawk team patrol the Sonoran Desert searching for illegal border crossers and drug smugglers. After an unmanned aerial vehicle spots suspected illegal border crossers in the mountains, Aviation Enforcement Officer Oscar Peru and his crew deploy to round them up in the rugged terrain. From a remote border patrol station, teams of five agents do seven-day rotations and are on call 24/7.","production_code":"","runtime":null,"season_number":1,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-01-25","episode_number":4,"episode_type":"standard","id":779899,"name":"The Front Lines","overview":"Officer Hector Navarro stops a silver pickup truck at the Nogales port of entry. The driver is acting suspiciously and traveling alone, which is a red flag. A police canine is called in to sniff for narcotics, and a cleverly hidden trove of heroin is uncovered - breaking an all-time record for drug busts at this port of entry.","production_code":"","runtime":null,"season_number":1,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-10","episode_number":5,"episode_type":"finale","id":779900,"name":"No End in Sight","overview":"A report on illegal immigration follows drug smugglers and job seekers as they risk their lives attempting to cross the Mexico-U.S. border. Also: a look inside the U.S. Border Patrol.\n\nAKA Inside US Border Wars","production_code":"","runtime":null,"season_number":1,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":44734,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5258aa2a760ee346616e0867","air_date":"2010-08-29","episodes":[{"air_date":"2010-08-29","episode_number":1,"episode_type":"standard","id":779872,"name":"Death on the Rio Grande","overview":"A young man drowns trying to cross the Rio Grande, and agents must now identify him and return his body to his family. Next, agents and officers target a human smuggling operation and raid a safe house containing more than 20 illegal immigrants living in cramped, unsuitable conditions. And inspection of a bell pepper shipment finds tiny invasive snails that could destroy thousands of acres of cropland if introduced into the U.S.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-01","episode_number":2,"episode_type":"standard","id":779873,"name":"Checkpoint Texas","overview":"An 18-wheeler carrying more than 1,000 pounds of concealed marijuana is discovered by a rookie agent and his canine partner. Meanwhile, a group of illegal crossers takes agents on a four-hour chase. An Ecuadorian woman and her young daughter - injured, dehydrated and famished - are rescued from the harsh terrain after being abandoned by smugglers, and face deportation unless the mother can prove they have reason to fear for their lives back home.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-08","episode_number":3,"episode_type":"standard","id":779879,"name":"Contraband Highway","overview":"At the border checkpoint in Hidalgo, Texas, a seemingly ordinary car is found to have firearms and ammunition hidden in its console and under its bumpers. Members of BORTAC, the tactical unit that identifies smuggling routes, discover what could be a remote transfer point for illicit goods. Further surveillance supports their theory, and the team hopes to close in on an active operation - if they can avoid detection by cartel scouts.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-15","episode_number":4,"episode_type":"standard","id":779877,"name":"Lost in the River","overview":"A group of suspected drug smugglers is tracked by the all-terrain vehicle (ATV) night unit at Rio Grande City Station. No sooner are they apprehended than the agents must call in reinforcements from the CBP's air unit, Omaha, to track down a group of illegal immigrants hiding in the brush. Another team of agents searches for nine people missing in the Rio Grande, initially finding only one body. The search becomes more urgent when they find two more bodies the next day.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-29","episode_number":5,"episode_type":"standard","id":779881,"name":"Dirty Money","overview":"New agents get their first taste of action; officers seize tens of thousands of dollars in suspected drug cartel money; special agents seek out corruption within their ranks.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-06","episode_number":6,"episode_type":"standard","id":779880,"name":"Fog of War","overview":"Working the varied terrain of San Diego, California are officers and agents of the Department of Homeland Security; men and women dedicated to their duty of defending the United States busiest border crossing. Three components of U.S. Customs and Border Protection watch over this 66-mile stretch of the border and beyond from the air, on the ground, and at the ports of entry. Their mission is to secure the border against smuggling of contraband and unlawful entry into the U.S. In this episode of Border Wars, officers and agents in San Diego discover thirty people elaborately concealed in a tractor-trailer, race to prevent people from illegally crossing the border under the cover of a blinding fog, and unearth a payload of hundreds of pounds of marijuana carefully hidden behind the cab of a tractor-trailer.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-13","episode_number":7,"episode_type":"standard","id":779866,"name":"Hidden Narcotics","overview":"In this episode of Border Wars, officers and agents of U.S. Customs and Border Protection work 24/7 to patrol the border between San Diego, California and the Mexican city of Tijuana. These men and women traverse rugged San Ysidro Mountain in search of illegal border crossers, stage an undercover sting operation to infiltrate a human smuggling organization, and uncover hidden narcotics inside a car passing through the San Ysidro port of entry - the busiest land border crossing in the world.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-20","episode_number":8,"episode_type":"standard","id":779874,"name":"Manhunt","overview":"On the U.S.-Mexico border, officers and agents work to fight the threat of terrorism while remaining vigilant against illegal immigration and contraband smuggling. In this episode of Border Wars, agents launch an uncover sting to stop an illegal human smuggling ring, chase down suspected illegal immigrants through the desert on foot, and discover a woman who hired smugglers to hide her in a car, saying her only goal is to be reunited with her son.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-03","episode_number":9,"episode_type":"standard","id":779882,"name":"Walk the Line","overview":"Meet the Shadow Wolves, an elite unit of just 12 Native American federal agents who hunt down drug smugglers crossing into the US through a desert the size of Connecticut using ancient techniques.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-10","episode_number":10,"episode_type":"standard","id":779878,"name":"3,000-Pound Coke Bust","overview":"Witness one of the Caribbean's largest drug busts of the year -- over 1.5 tons of cocaine worth more than $40 million found aboard a Panamanian fishing boat heading to the U.S. As the State Department negotiates for possession of the ship, the DEA and Coast Guard stand guard over the cargo. When a suspected smuggler requires medical attention, the situation becomes urgent in a scramble to get medication on board. Next, enter the underworld of North Miami Beach as officers patrol the streets.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-17","episode_number":11,"episode_type":"standard","id":779867,"name":"Murder on the Lake","overview":"Examining the Sept. 30, 2010, death of American tourist David Hartley, who was allegedly shot by Mexican pirates during a sightseeing trip on Falcon Lake near the Texas-Mexico border.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-01","episode_number":12,"episode_type":"standard","id":779868,"name":"Gang Task Force","overview":"In this episode of Border Wars, Miami and Puerto Rico, agents and officers with the Department of Homeland Security and the Drug Enforcement Administration intercept a boat with a multi-million dollar drug load, apprehend an alleged member of a transnational gang, and destroy a marijuana grow house. Immigration and Customs Enforcement (ICE) agents from a violent gang task force apprehend an alleged member of a dangerous gang to see if he will give them valuable inside information. Hours later, a DEA agent leads a raid on a marijuana grow house operation in West Palm Beach. At the same time, off the coast of Puerto Rico, the U.S. Coast Guard intercepts a fishing boat carrying what turns out to be more than 500 pounds of cocaine.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-08","episode_number":13,"episode_type":"standard","id":779869,"name":"High-Speed Chase","overview":"In Laredo, Texas, officers and agents of the Department of Homeland Security target drug smuggling and illegal immigration. In this episode of Border Wars, agents chase down a car filled with illegal immigrants heading north. When the group bails from their vehicle, agents must run through thick brush in search of the immigrants, who face imminent dehydration in the south Texas heat. At the Laredo Port of Entry, a group of officers uncover a spare tire thats loaded with a massive currency seizure - money likely headed into cartel hands south of the border. Meanwhile, the Laredo SWAT team prepares for a bust on a suspected gang members home in search of cocaine and black tar heroin.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-15","episode_number":14,"episode_type":"standard","id":779870,"name":"Cartel Crackdown","overview":"In this episode of Border Wars, Border Patrol Agents and Customs and Border Protection Officers in Laredo, Texas, work around the clock to stop illicit drugs and undocumented immigrants from slipping into the United States through the countrys largest inland port. Horse Patrol and Air Support team up to track a group of immigrants hiking through private ranchland just north of the border; Agents at the Rio Grande face off with smugglers to stop a group of suspected immigrants from rafting across the river into the United States; Customs and Border Protection Officers at a Port of Entry bridge uncover a dangerous drug rarely seen here; and Immigration and Customs Enforcement Officers team up with a Laredo SWAT team to bust a suspected coke house.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-22","episode_number":15,"episode_type":"standard","id":779871,"name":"Storm Surge","overview":"A truck with canned jalapenos is found to have marijuana; a human smuggler will not give up stranded immigrants; agents raid a suspected stash house.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-05","episode_number":16,"episode_type":"standard","id":779875,"name":"Weed Warehouse","overview":"A stolen vehicle is abandoned after it flips over during a high-speed chase, and a huge load of marijuana is found inside","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-31","episode_number":17,"episode_type":"finale","id":779876,"name":"Super Sunday","overview":"Agents beef up security in Miami in preparation for Super Bowl XLIV, while also patrolling the rest of the city for drug trafficking and illegal immigration.","production_code":"","runtime":null,"season_number":2,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":44732,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"5258aa2a760ee346616e0872","air_date":"2011-09-04","episodes":[{"air_date":"2011-09-04","episode_number":1,"episode_type":"standard","id":779883,"name":"Seize and Destroy","overview":"Drugs, guns, cars and money are just some of the items confiscated on a typical day by Customs and Border Protection (CBP). But what happens to this contraband after it is seized?","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-04","episode_number":2,"episode_type":"standard","id":779885,"name":"Cocaine Sting","overview":"Along the El Paso-Juarez border, agents and officers of the Department of Homeland Security investigate a young couple who are suspected human smugglers, uncover a floor of marijuana in an SUV, and target a high-level supplier in a drug sting.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-11","episode_number":3,"episode_type":"standard","id":779884,"name":"Marijuana Airdrop","overview":"CBP agents dismantle an observation point used by smugglers to monitor agents' movements in the remote desert, and seize a vehicle attempting to carry weapons and nearly $800,000 back to the Mexican cartels.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-18","episode_number":4,"episode_type":"standard","id":779887,"name":"Smuggler's Tunnel","overview":"In this episode of Border Wars, agents and officers struggle to stop cartels and illegal immigrants whove found weak spots in spite of increased fortification along the U.S.-Mexico Border. Four feet beneath Nogales, agents crawl through a claustrophobic drug smuggling tunnel, knowing they could come face to face with armed criminals. Near the Port of Entry, Nogales Rail Inspection Team is on high alert as a freight train full of new automobiles rumbles toward them. Trains, with infinite hiding places, are becoming a favorite place for cartels to stash drugs: If the officers arent careful, they could easily miss a load. In the desert, Border Patrols only dirt bike unit races after a group of illegal immigrants. But in this sprawling Indian Reservation, the agents will need skill - and luck - to catch them.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-25","episode_number":5,"episode_type":"standard","id":779886,"name":"Drug-Smuggling Grandma","overview":"With the help of a Blackhawk helicopter, agents arrest a suspected smuggler who is backpacking drugs into the U.S.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-02","episode_number":6,"episode_type":"standard","id":779888,"name":"Murder Capital","overview":"Customs and Border Protection patrol the crucial boundary between El Paso, one of the safest cities in the U.S. and Cuidad Juarez, considered one of the most dangerous cities in the world.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-16","episode_number":7,"episode_type":"standard","id":779889,"name":"Cartel Corridor","overview":"Border agents in Arizona defend a national park overrun by smugglers.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-23","episode_number":8,"episode_type":"standard","id":779890,"name":"Contraband Cargo","overview":"Border agents in El Paso, Texas battle to secure the city from human trafficking and drug smuggling.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-30","episode_number":9,"episode_type":"standard","id":779891,"name":"Going Underground","overview":"Agents and officers work around the clock to secure the border between El Paso, Texas, and Ciudad Juarez, Mexico.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-06","episode_number":10,"episode_type":"standard","id":779893,"name":"River Under Siege","overview":"Agents chase smugglers in a dangerous high-speed pursuit.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-13","episode_number":11,"episode_type":"standard","id":779892,"name":"Toxic Drug Tanker","overview":"Agents patrol the Rio Grande Valley in southernmost tip of South Texas. They catch drug smugglers burying contraband in tanker trucks and illegal immigrants sneaking around highway checkpoints in the middle of the night.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-20","episode_number":12,"episode_type":"standard","id":779894,"name":"Million Dollar Stash","overview":"Agents persue a pickup truck loaded down with drugs ferried from Mexico; a routine vehicle inspection uncovers a large stash of heroin.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-27","episode_number":13,"episode_type":"finale","id":779895,"name":"River Standoff","overview":"A search team races to rescue a mother and her son who were abandoned by smugglers in the brush.","production_code":"","runtime":null,"season_number":3,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":44733,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"5258aa2a760ee346616e0888","air_date":"2012-07-09","episodes":[{"air_date":"2012-07-09","episode_number":1,"episode_type":"standard","id":779901,"name":"Bullets Over the Border","overview":"Agents put themselves in harm’s way searching for armed smugglers fleeing a shoot-out with the Mexican military. Once at the riverbanks, they find a suspected smuggler who has been shot five times. Their mission quickly changes as they rush to save the man’s life.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-16","episode_number":2,"episode_type":"standard","id":779902,"name":"Meth Mobile","overview":"Drug smuggling has reached “Texas-sized” proportions in the Rio Grande Valley. A canine unit detects a suspicious vehicle coming in from Mexico, and agents discover a massive quantity of methamphetamine concealed within.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-23","episode_number":3,"episode_type":"standard","id":779904,"name":"Contraband Corridor","overview":"Law enforcement battles to intercept the massive flow of illicit traffic moving through the Rio Grande Valley. Agents in McAllen, Texas, track a group of illegal immigrants in the dark and find themselves outnumbered in a large field.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-30","episode_number":4,"episode_type":"standard","id":779903,"name":"Rio Grande Reefer","overview":"The Rio Grande River serves as a highway for illegal traffic and dangerous crossings. As the Department of Homeland Security’s surveillance intensifies, powerful drug cartels and human smugglers are trying more desperate tactics.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-06","episode_number":5,"episode_type":"standard","id":779905,"name":"Hidden Tunnel","overview":"In the southern border towns of Douglas and Nogales, Ariz., agents uncover new and more cunning methods smugglers create to avoid detection, including a drug tunnel under the border.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-13","episode_number":6,"episode_type":"standard","id":779906,"name":"Cartel Cash Stash","overview":"Along the southern Arizona border at the port of entry, agents detain two families within a 24-hour period, driving similar SUVs and carrying a combined total of nearly $1 million in cash and drugs.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-20","episode_number":7,"episode_type":"standard","id":779907,"name":"Teenage Drug Mules","overview":"A Blackhawk helicopter leads ground agents on an epic chase after an illegal immigrant through treacherous mountains near Douglas, Ariz. A live surveillance camera alerts Border Patrol agents to a known fence coyote who tries to guide illegal immigrants into downtown Nogales.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-27","episode_number":8,"episode_type":"standard","id":779909,"name":"Tunnel Smoke-out","overview":"Border Patrol agents cut off a getaway car as it tries to flee the scene of a drug drop in ranchland east of Nogales, Ariz. Agents arrest the driver and seize the drugs, then pursue the smugglers.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-03","episode_number":9,"episode_type":"standard","id":779908,"name":"Midnight Drug Trap","overview":"Downtown, Border Patrol and ICE agents discover a major drug-running tunnel and suspected smugglers may still be inside. With cartels watching their every move, they must risk their lives to map and destroy it.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-10","episode_number":10,"episode_type":"standard","id":779910,"name":"Cocaine Paradise","overview":"In Puerto Rico, agents keep a high-value drug seizure from South America secure as they transport it back to San Juan. They also use a DASH 8 plane and radar to find and seize a small drug-running boat in the dangerous Mona Passage.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-17","episode_number":11,"episode_type":"standard","id":779911,"name":"Cocaine Dump Truck","overview":"Agents in Puerto Rico enter one of San Juan’s most notorious housing projects for an undercover “buy and bust” operation to intercept a dump truck full of cocaine, and race to find illegal immigrants who have landed on a secluded beach.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-24","episode_number":12,"episode_type":"standard","id":779912,"name":"Cash in the Tank","overview":"When the Coast Guard rescues Cuban refugees from a remote island in the Mona Passage, Customs and Border Protection agents must race to intercept them and verify their identities.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-14","episode_number":13,"episode_type":"standard","id":779913,"name":"Traffic","overview":"Illegal traffic between the Rio Grande and the Falfurrias Checkpoint in South Texas.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-21","episode_number":14,"episode_type":"finale","id":779914,"name":"War Games","overview":"Tactical cat-and-mouse games used in the war on drugs.","production_code":"","runtime":null,"season_number":4,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":44735,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"5258aa2a760ee346616e0893","air_date":"2012-11-14","episodes":[{"air_date":"2012-11-14","episode_number":1,"episode_type":"standard","id":779916,"name":"Traffic","overview":"Illegal traffic between the Rio Grande and the Falfurrias Checkpoint in South Texas.","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-21","episode_number":2,"episode_type":"standard","id":779918,"name":"War Games","overview":"Tactical cat-and-mouse games used in the war on drugs.","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-28","episode_number":3,"episode_type":"standard","id":779915,"name":"War on the Streets","overview":"South Texas has become a hotspot for smuggling activities on the border.","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-05","episode_number":4,"episode_type":"standard","id":779917,"name":"Special Ops","overview":"Specially trained agents deal with problems specific to the border in South Texas.","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-12","episode_number":5,"episode_type":"standard","id":779922,"name":"Rio Grande Rookies","overview":"Not Available.","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-19","episode_number":6,"episode_type":"standard","id":779921,"name":"The War Comes Home","overview":"Agents in South Texas work to stop drug dealers, smugglers and undocumented immigrants from infiltrating residential neighborhoods and getting innocent bystanders involved.","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-26","episode_number":7,"episode_type":"standard","id":779924,"name":"24-Hour Watch","overview":"The action never stops for Customs and Border Patrol (CBP) agents and local law enforcement who patrol the border 24 hours a day, seven days a week. As dawn breaks, agents track a group of suspected illegal immigrants from Mexico.","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-02","episode_number":8,"episode_type":"standard","id":779920,"name":"Animals on the Frontline","overview":"For those rare occasions when human skills are insufficient, Customs and Border Protection (CBP) agents and local law enforcement officers turn to their friends in the animal world for some on-the-job help. In Rio Grande City, Archie, a CBP K-9, helps agents track a group of illegal immigrants spotted passing through.","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-09","episode_number":9,"episode_type":"standard","id":779923,"name":"Smuggler's Stash","overview":"Drugs, humans, weapons and money can be hidden anywhere by anyone at any time, and nobody knows that better than the law enforcement officers who work on or near the border. Laredo narcotics officers raid a residence in a school zone after a confidential informant buys crack cocaine direct from a drug dealer's house.","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-16","episode_number":10,"episode_type":"finale","id":779919,"name":"Cash and Corruption","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":44736,"poster_path":null,"season_number":5,"vote_average":0},"6":{"_id":"5258aa2a760ee346616e089e","air_date":"2013-07-07","episodes":[{"air_date":"2013-07-07","episode_number":1,"episode_type":"standard","id":980649,"name":"Cash and Corruption","overview":"In the Rio Grande Valley, money has become something of a drug  corrupting people's lives and luring them into believing in its broken promises. Officers at the Brownsville Port of Entry are performing a blitz enforcement operation  random searches for contraband  to deter the onslaught of smugglers. In nearby Laredo, Lucky and the narcotics unit hunt down desperate heroin dealers who are selling hits of black tar in school zones for $20.","production_code":"","runtime":null,"season_number":6,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-15","episode_number":2,"episode_type":"finale","id":1054108,"name":"Crossing at All Costs","overview":"Follow along as border patrol agents hunt down drug runners and illegal immigrants trying to cross the border and sneak into the U.S. any way they possibly can.","production_code":"","runtime":null,"season_number":6,"show_id":33914,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":44737,"poster_path":null,"season_number":6,"vote_average":0}}}