{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"1969-07-12","genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":34320,"in_production":false,"languages":["en"],"last_air_date":"1970-06-26","last_episode_to_air":{"id":1480804,"name":"Finals","overview":"Mike's studying hard for his finals exam. While the other boys have finished, Mike still has two to go.! While cramming for his last test, Mike has a headache & takes two sleeping pills instead of aspirin as he rushes off for the test. Mike falls asleep on the Bus & has to hitch a ride with a man on a motorscooter.","vote_average":0,"vote_count":0,"air_date":"1970-06-26","episode_number":13,"episode_type":"finale","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null},"name":"Doctor in the House","next_episode_to_air":null,"networks":[{"id":9,"logo_path":"/oz9pjTHnBUmlju8OkaTymhKbh6C.png","name":"ITV1","origin_country":"GB"}],"number_of_episodes":26,"number_of_seasons":2,"origin_country":[],"original_language":"en","original_name":"Doctor in the House","overview":"The misadventures of a group of medical students.","popularity":9.467,"poster_path":"/hidrnYNDzfqdhw6e0qdVBd5vVmU.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"1969-07-12","episode_count":13,"id":103203,"name":"Season 1","overview":"","poster_path":"/wawaJj00CNA8ARD0eRIRqN0BMIV.jpg","season_number":1,"vote_average":0},{"air_date":"1970-04-10","episode_count":13,"id":103204,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":3.5,"vote_count":2,"season_data":{"1":{"_id":"5ae7e7140e0a26105e01315e","air_date":"1969-07-12","episodes":[{"air_date":"1969-07-12","episode_number":1,"episode_type":"standard","id":1480778,"name":"Why Do You Want to Be a Doctor?","overview":"Michael Upton wants to be a doctor at St Swithin's Hospital. first however he needs the approval of the much feared Professor Loftus. once Approved he meets with fellow Students Duncan Waring, and Veteran Student Dick Stuart Clarke","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-07-19","episode_number":2,"episode_type":"standard","id":1480779,"name":"Settling In","overview":"On his first days at St Swithins Michael Upton Looks Forward to meet the new birds. he befriends a girl named Alice, and they both lead the other students to believe they spent the night together.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-07-26","episode_number":3,"episode_type":"standard","id":1480781,"name":"It's All Go","overview":"Mike & Duncan are in the dissecting room, Stuart-Clarke comes over & asks them if they're ready for their test yet. He asks them to try the Doctors who are revising for exams, it's easier to get their cards marked that way.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-08-02","episode_number":4,"episode_type":"standard","id":1480782,"name":"Peace and Quiet","overview":"Mike's moving out of the dorm because it's too noisy & he can't concentrate. He starts looking for a flat & after a few false starts finds one that he can just afford. Mike's unpacking his things & looking forward to some peace & quiet when Duncan comes in,followed by Stuart-Clarke,Huw & a few of the others he was trying to get away from. It seems the landlady has rented all of them the room, that's why it was so cheap.! Just when Mike thinks they couldn't possibly fit any one else in, one of the guys,girlfriends cousin arrives to stay for a while.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-08-09","episode_number":5,"episode_type":"standard","id":1480783,"name":"The Students are Revolting","overview":"Mike is called into the Dean's office because his picture is on the front page of the paper,at a protest rally. On closer inspection the rally is in New York so it can't be Mike & the Dean excuses him,but warns him he won't tolerate protests at St. Swithins. Mike, Dick & Duncan are in the cafeteria when they see some student activists enter the hospital grounds. The activists are looking for new members,but no one is interested. After protesting all night,they are led into the hospital to \"\"warm up\"\". Loftus has been working on his car & when he sees them he asks Duncan to call the Police. When the police arrive they think Loftus is one of them & take him away.! Next morning Loftus has his picture in the paper & the Dean wants to dismiss him. The Students protest in the hall to save Loftus & the Dean changes his mind.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-08-16","episode_number":6,"episode_type":"standard","id":1480784,"name":"Rallying Round","overview":"Mike is trying to study while the boys are organising a car rally. They're one short & convince Mike to join them. Mike & his partner Fiona get lost & Fiona drives to her sister's place for directions. While they are there a storm breaks so they have to spend the night. In the middle of the night Fiona's sister goes into labour & they want Mike to deliver the baby, Mike asks them to send for a Doctor & goes back to sleep. The baby is coming and Mike's panicking, he asks if there's any one who can deliver the baby. The cook comes into the room & tells them he can deliver the baby. Mike accompanys him,but feints when the baby is delivered. Next day, the other students arrive at the house & think Mike was the one who delivered the baby & congratulate him.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-08-23","episode_number":7,"episode_type":"standard","id":1480785,"name":"If in Doubt--Cut It Out","overview":"After attending a lecture on the appendix with short sighted Dr. Crowfoot, Mike thinks he has appendicitis. Reading from a medical textbook, Mike is sure he has the symptoms & tells the boys who rush him to St Swithins. Mike is shocked when he sees the Doctor who will perform the operation is Dr. Crowfoot.! After the operation, Dr.Crowfoot tells Mike they have to open him up again, it seems Dr.Crowfoot has lost one of his contact lenses.! Luckily for Mike he found it in his pajama shirt pocket & hands it back to the Doctor.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-08-30","episode_number":8,"episode_type":"standard","id":1480786,"name":"War of the Mascots","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-09-06","episode_number":9,"episode_type":"standard","id":1480787,"name":"Getting the Bird","overview":"Mike's worried because he can't 'get a bird' (girl) Duncan is spending a lot of time with his new girl Frances. Dick sets him up with a nurse they call 'rigor mortis'. After taking her to the pictures, Mike takes her back to the flat & soon realises why she is called 'rigor mortis'. When she leaves, Duncan arrives & tells Mike he's proposed to Frances but is having second thoughts. Mike has a plan to solve his problem, he gives him a bunch of flowers & tells him to propose to all the nurses.! Next morning Frances tells all her friends she's engaged & they say they are too.! She asks them who they are marrying & they all reply..... Duncan Waring.!!","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-09-13","episode_number":10,"episode_type":"standard","id":1480788,"name":"The Rocky Mountain Spotted Fever Casino","overview":"Dave wants to have a casino in the flat,he sent out flyers to all the students to visit the 'Rocky Mountain Spotted Fever Casino'. When a few heavyweights from the local underworld see the flyers they pay the boys a visit & 'convince' them to close down for the good of the health.! Dunc & Mike are looking for a part time job to earn some extra cash, Mike finds an ad in the paper for a doorman & bouncer. Duncan gets the job of bartender & Mike's the bouncer. When the Dean & Prof.Loftus turn up at the club, Mike & Dunc try to keep a low profile. A raid by the Police sees Mike & Dunc heading for the back door with the Dean & Prof. Loftus close behind. Back at St.Swithins, the Dean tells the boys he is willing to overlook the incident & won't expell them.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-09-20","episode_number":11,"episode_type":"standard","id":1480789,"name":"Keep It Clean","overview":"The boys are meeting to plan this years 'Ward Show'. Stuart-Clark arrives with the Dean who wants them to \"Keep it clean\" this year. Everyone backs out of the show except for Mike & Dunc.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-09-27","episode_number":12,"episode_type":"standard","id":1480790,"name":"All for Love","overview":"Mike has met a girl named Valerie & is smitten with her. He forgets to do an Essay for Prof. Loftus & promises it for the next day. Mike & Valerie spend the afternoon together & Valerie invites him into her place afterwards. Then Valerie's parents arrive home & Mike is surprised to discover that Prof. Loftus is Valerie's Father.! Mike wants to marry Valerie, but Mrs Loftus doesn't want her daughter to marry a Doctor. So Mike decides to leave Medicine so he & Valerie can be together. Mike's Dad tries to talk him out of giving it up, he writes a letter to the Dean who gives the letter to Prof.Loftus. Mrs Loftus tells Valerie she has to break it off with Mike.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1969-10-04","episode_number":13,"episode_type":"finale","id":1480791,"name":"Pass of Fail","overview":"It's exam time at St. Swithins, which means last-minute panic for the students.","production_code":"","runtime":30,"season_number":1,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":103203,"poster_path":"/wawaJj00CNA8ARD0eRIRqN0BMIV.jpg","season_number":1,"vote_average":0},"2":{"_id":"5ae7e7189251410d2000f5d9","air_date":"1970-04-10","episodes":[{"air_date":"1970-04-10","episode_number":1,"episode_type":"standard","id":1480792,"name":"It's All in the Little Blue Book","overview":"The students return for their second year at St.Swithins. Vincent (the porter) is trying to make some money on the side by selling the students white coats,locker keys & 'the little blue book'. The boys are glad they won't have Loftus this year, Until he walks into the room & tells them he's the new lecturer. After a full day of taking notes, it's time for a practical demonstration. Loftus asks Mike to examine the patient (a young woman)Miss Walker. Loftus tells Mike, Miss Walker has felt a lump in her left breast & wants him to examine her. An embarrased Mike,warms his hands before the examination & while feeling for the lump,Miss Walker is ticklish. Loftus thanks Miss Walker & she leaves the room, Then he orders Mike to strip to the waist so the other students can have some hands on experience with his cardio thoracic region.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-04-17","episode_number":2,"episode_type":"standard","id":1480793,"name":"What Seems to Be the Trouble?","overview":"The Boys spend their first day on the wards.Mike has trouble from the start with his patient.(Mr Drobnic)He's either asleep or gone downstairs for physio, When he finally does see him & asks \"\"what seems to be the trouble\"\"? Mr Drobnic doesn't speak english.! Dr. Merriford's wanting a report from the students at midday & Mike's running out of time. He has to take Mr Drobnic to X-ray in a wheelchair & while he's looking for it Mr Drobnic wheels himself away. Mike sees a wheelchair across from the escalator he has just traveled up & thinking it's his patient,wheels him back to the ward just as Dr.Merriford wants Mike's report on his patient. Mike pulls back the curtain & tells the Doctor his patients name & what he thinks he's suffering from. Only thing is the patient is a pregnant woman.!! The show closes with Mike looking for Mr Drobnic & sees him being loaded into the back of an ambulance. Mike chases after it.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-04-24","episode_number":3,"episode_type":"standard","id":1480794,"name":"Take Off Your Clothes ... and Hide","overview":"The boys go to a Strip Club & while watching a dancer strip,she feints on stage. The Manager asks if there's a Doctor in the House & the boys go backstage to see if they can help. The Dancer (Rita) has all the symptoms of pneumonia. Mike phones for an ambulance & she's admitted to St Swithin's. Rita recovers & one by one the boys come to see her. Rita's boss visits & wants to know when she will be returning to work. Mike says she needs rest & asks her if she ever wanted to get another job. Rita tells him she wanted to be a nurse when she was young. Mike tells Rita she could help at St. Swithin's if she would like when she's better. It soon turns out Rita's a better stripper than she is a nurse,She goes back to the strip club & changes her act from Meter Maid to Nurse.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-05-01","episode_number":4,"episode_type":"standard","id":1480795,"name":"Nice Bodywork--Lovely Finish","overview":"Mike and Dunc want to go to a rugby match in Cambridge but Dunc's car breaks down. Paul buys an old hearse cheap & parks it out the front of the Mortuary. Two orderlies load a coffin in the back while Paul goes to get the boys & then they're off to the match. Paul notices the coffin later & Mike & Dunc thought he was playing a joke on them. When they look inside the coffin,there is a body in there so they decide to take it back. Driving too fast, Paul soon has the police on his tail. He pulls over & Mike & Dunc hide in the woods with the coffin before the police catch up.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-05-08","episode_number":5,"episode_type":"standard","id":1480796,"name":"Look into My Eyes","overview":"Duncan pretends to be hypnotized until the lecturer wants to stick him with a pin. Later, Upton does hypnotise him & then can't 'Un-hypnotise' him.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-05-15","episode_number":6,"episode_type":"standard","id":1480797,"name":"Put Your Hand on That","overview":"Prof. Loftus wants Mike to assist him with an operation. Mike is keeping his distance from the table, feels sick and leaves the operating theatre. Later, he learns he and Duncan wakes him have been chosen by Loftus for two weeks residency together.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-05-22","episode_number":7,"episode_type":"standard","id":1480798,"name":"The Royal Visit","overview":"The Prince & Princess are coming to St. Swithins to open the new wing of the hospital. Paul & Danny are against the Monarchy & steal the dedication plaque & replace it with a furry toilet seat cover. The boys discover this before it's to late & go after Danny & Paul. Meanwhile Mike is giving a speech on behalf of the Medical Students & has to stretch his speech while the boys get the plaque back on the wall. When the Princess pulls the cord, the plaque is upside down & then falls on to the floor.!","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-05-29","episode_number":8,"episode_type":"standard","id":1480799,"name":"If You Can Help Somebody ... Don't!","overview":"Mrs Brown is a hypochondriac taking up bed space in the ward. Matron & Prof.Loftus know her history and want her out. Mike is sympathetic and offers to visit her at home later.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-06-05","episode_number":9,"episode_type":"standard","id":1480800,"name":"Hot Off the Presses","overview":"Danny signs Mike's name to edit the hospital magazine. Mike has some good ideas for his first edition, but Loftus has it all pre-arranged & there's no room left for Mike's contributions. The boys tell him he's the editor & he should put in what he wants. They print 4,000 copies & distribute it all over London. Ingrid is on the cover & has a centrefold inside. When Loftus sees the mag,he calls them into his office & tells them to get every copy back.! The boys get most of the copies back,but it cost them more than they earned.!","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-06-12","episode_number":10,"episode_type":"standard","id":1480801,"name":"A Stitch in Time","overview":"Mike & Duncan are rostered in Casualty for a fortnight. The victim of a robbery is brought in & Dunc takes him to X-ray. Mike is alone in casualty when a nervous man enters with an injury to his ear & sore ankles. Mike realises this guy is the robber. When Mike mentions the police the robber runs away. Later he returns & wants Mike to finish the Job of treating his ear & ankles. Loftus walks into casualty with bad cut on arm, together he & Mike manage to subdue the crim & the policeman arrests him.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-06-19","episode_number":11,"episode_type":"standard","id":1480802,"name":"May The Best Man ...","overview":"Mike unknowingly \"\"chats up\"\" Danny's new 'bird' at a party & he's so jealous he punches Mike in the eye. To make matters worse, Mike,Danny & Jenny have to spend the week working together in the lab. Danny doesn't let Jenny out of his sight, he's worried Mike will make a move on her. Mike swaps shifts to ease Danny's suspicions, but one night while working late Danny leaves the room & Mike & Jenny Kiss. Danny walks in on them & they fight in the lab. Next morning Jenny isn't speaking to either of them because of their behaviour. They apologise & invite Jenny out to dinner, but fight again over what to order for her.! Next day Mike is introduced to Jenny's fiance & he & Danny make up & agree not to let a woman come between them again....until a new nurse walks down the corridor & they follow her.!!","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jenny","credit_id":"5f012cfe7caa470035defb23","order":500,"adult":false,"gender":1,"id":14947,"known_for_department":"Acting","name":"Susan George","original_name":"Susan George","popularity":17.592,"profile_path":"/4B9LBCfwni5Q7lZbx68qJfQqW2B.jpg"}]},{"air_date":"1970-06-26","episode_number":12,"episode_type":"standard","id":1480803,"name":"Doctor on the Box","overview":"Prof.Loftus invites Mike & Dick to his office to help him with a film being made about St Swithins which is to be shown on the television. However, the producer is more interested in the mischief the medical students get up to than showing hospital practice. After a few 'wooden' performances the producer invites the students to the bar for a celebratory drink & films the drunken goings on & includes that as his main story item when the show goes to air. Prof Loftus tells Waring to switch off the TV he's seen enough.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1970-06-26","episode_number":13,"episode_type":"finale","id":1480804,"name":"Finals","overview":"Mike's studying hard for his finals exam. While the other boys have finished, Mike still has two to go.! While cramming for his last test, Mike has a headache & takes two sleeping pills instead of aspirin as he rushes off for the test. Mike falls asleep on the Bus & has to hitch a ride with a man on a motorscooter.","production_code":"","runtime":30,"season_number":2,"show_id":34320,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":103204,"poster_path":null,"season_number":2,"vote_average":0}}}