{
    "adult": false,
    "backdrop_path": "/7CTspUm3FljVOzCIXKkCvnrXgfk.jpg",
    "created_by": [
        {
            "id": 1241179,
            "credit_id": "5fde9d95d7107e003ec875e6",
            "name": "Charlie Parsons",
            "original_name": "Charlie Parsons",
            "gender": 2,
            "profile_path": null
        }
    ],
    "episode_run_time": [],
    "first_air_date": "2006-09-03",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "",
    "id": 34521,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2022-08-25",
    "last_episode_to_air": {
        "id": 3902089,
        "name": "Head vs. Heart",
        "overview": "",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2022-08-25",
        "episode_number": 24,
        "episode_type": "finale",
        "production_code": "",
        "runtime": null,
        "season_number": 9,
        "show_id": 34521,
        "still_path": null
    },
    "name": "Survivor South Africa",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 192,
            "logo_path": "/dJ9KWprPx7AXMOxBrGJoadLhhZQ.png",
            "name": "M-Net",
            "origin_country": "ZA"
        }
    ],
    "number_of_episodes": 148,
    "number_of_seasons": 9,
    "origin_country": [
        "ZA"
    ],
    "original_language": "en",
    "original_name": "Survivor South Africa",
    "overview": "The South African edition of the Survivor reality television game show format in which contestants are isolated in a remote location and progressively eliminated by the vote of their fellow contestants.",
    "popularity": 8.034,
    "poster_path": "/djdZUEFoTTjuLM0afMGjOIyAn7e.jpg",
    "production_companies": [
        {
            "id": 145886,
            "logo_path": null,
            "name": "Afrokaans Film & Television",
            "origin_country": ""
        }
    ],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2006-09-03",
            "episode_count": 13,
            "id": 45270,
            "name": "Panama",
            "overview": "Survivor South Africa: Panama is the first season of Survivor South Africa. The premiere aired on September 3, 2006.\n\nAfter 27 days, estate agent Vanessa Marawa defeated entrepreneur Jacinda Louw in a 3-2 jury vote, winning the title of Ultimate Survivor and the R1 million prize.",
            "poster_path": "/70eR67jHKmVc9AOa4iNjgnbPxiM.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2007-08-22",
            "episode_count": 13,
            "id": 45272,
            "name": "Malaysia",
            "overview": "Survivor South Africa: Malaysia is the second season of Survivor South Africa. The premiere aired on August 22, 2007.\n\nWith a larger cast than its predecessor, many of the sixteen new contestants boasted explosive personalities, leading to frequent interpersonal clashes throughout the game. Despite the high tensions, the Iban Alliance managed to take decisive control after the merge and produced both members of the Final Two. In the end, policewoman Lorette Mostert defeated maritime lawyer Grant Clark in a 3-2 vote to become the second Ultimate Survivor and win the R1 million prize.\n\nAfter this season, the Survivor South Africa series went on a two-year hiatus before the production of Survivor South Africa: Santa Carolina in November 2009.",
            "poster_path": "/rPXvovhw4NF53PZzxkB4P5SoItV.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2010-01-20",
            "episode_count": 15,
            "id": 45271,
            "name": "Santa Carolina",
            "overview": "Survivor South Africa: Santa Carolina is the third season of Survivor South Africa. The premiere aired on January 20, 2010.\n\nIn contrast to the previous two seasons, Santa Carolina featured an all-star cast of South African celebrities fighting to win money for their charities. The season saw two early quits as well as the rise of the series' first all-female alliance, which quietly took control of the post-merge game. In the end, 42 year-old exotic dancer GiGi van Schalkwyk defeated 42 year-old TV presenter Ashley Hayden in a 6-3 vote, winning the R1 million prize.",
            "poster_path": "/bpkAPT2jV1wKChtapo3udeazOFk.jpg",
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2011-02-24",
            "episode_count": 14,
            "id": 104033,
            "name": "Maldives",
            "overview": "Survivor South Africa: Maldives is the fourth season of Survivor South Africa.\n\nMaldives featured 19 new contestants who began the game divided into two informal groups, the \"Celebs\" and the \"Plebs\". Through an unusual tribe division process, the Goma and Raituhn tribes were formed on Day 4 and came to define the rest of the season's politics. The twist-heavy season introduced the modern Hidden Immunity Idol to Survivor South Africa as well as the Black and White Cowries, all of which contributed significantly to the season's active strategy. After 27 days of intense gameplay combined with numerous heated arguments, both of a strategic and personal nature, \"Celeb\" Hykie Berg defeated \"Pleb\" Letshego Moshoeu in an 8-3 jury vote to become the first male Ultimate Survivor of the series.\n\nFollowing the airing of Maldives, the Survivor South Africa series entered its second hiatus until its resumption with Champions in 2014.",
            "poster_path": "/sE2O6Su0aBEJFj50Rb13BFETPJh.jpg",
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2014-01-19",
            "episode_count": 18,
            "id": 104034,
            "name": "Champions",
            "overview": "Survivor South Africa: Champions is the fifth season of Survivor South Africa.\n\nSet in the South China Sea, Champions saw two South African sporting legends serve as captains for 20 new castaways. Though the season was largely defined by two primary alliances, allegiances within these factions were fleeting, leading to numerous blindsides especially after the merge. Champions is also notable for its extensive history of Hidden Immunity Idol thefts, a twist unique to this season. In the end, the leader of the dominant Rugrats Alliance, Graham Jenneker, defeated Buhle Madlala and Sivu Xabanisa in a 5-3-2 plurality jury vote to become the Ultimate Survivor.\n\nFollowing the airing of Champions, the Survivor South Africa series entered its third and most recent hiatus until its resumption with Philippines in 2018.",
            "poster_path": "/czl5IflwEfPd3R1unUjAThgXkGb.jpg",
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2018-05-03",
            "episode_count": 17,
            "id": 104032,
            "name": "Philippines",
            "overview": "Survivor South Africa: Philippines is the sixth season of Survivor South Africa.\n\nFollowing a four-year hiatus, Survivor South Africa returned with Philippines, whose game format was modified to align more closely with the flagship American series. From the start of the season, the castaways played aggressively, leading to numerous blindsides and the earliest rock draw to occur in franchise history. Upon the merge, the game took a lull as Werner Joubert's Luzon Alliance marched to the end with little effective resistance. After Werner was voted out, Jeanne Michel and Tom Swartz emerged as the season's Final Two. Though both were chastised for riding on Werner's coattails, Tom was able to sway an apparently unfavourable jury to his side as he defeated Jeanne in a 6-1 jury vote to become the Sole Survivor.",
            "poster_path": "/sbHrnIGDpAUN51C6LnTiInJrN4Y.jpg",
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2019-05-16",
            "episode_count": 18,
            "id": 128844,
            "name": "Island of Secrets",
            "overview": "Survivor South Africa: Island of Secrets is the seventh season of Survivor South Africa.\n\nThis season saw the introduction of the eponymous Island of Secrets, a variant of Exile Island that bestowed game-changing powers to its visitors. The season generally proceeded in a straightforward manner, with one player, Rob Bentele, controlling the entire post-merge game with little effective resistance. Despite this, the cast of fiery personalities provided the kindling for much tension, with many of the in-game conflicts centred around the brash temperament of Danté De Villiers, the ostracism of Jacques Burger at the final eight, and the criticism directed at the majority alliance's sanctimonious gameplay. In the end, Rob defeated his allies Nicole Capper and Durão Mariano in a 6-4-0 jury vote to become the seventh Sole Survivor.",
            "poster_path": "/8VAG95P1ymGI9y48IhPGceR9Wy3.jpg",
            "season_number": 7,
            "vote_average": 0
        },
        {
            "air_date": "2021-06-03",
            "episode_count": 16,
            "id": 197617,
            "name": "Immunity Island",
            "overview": "Survivor South Africa: Immunity Island is the eighth season of Survivor South Africa.\n\nNicole Wilmans defeated Anela Majozi in an 8-1 vote to win the title of Sole Survivor, becoming the first female winner since Survivor South Africa: Santa Carolina over a decade prior.",
            "poster_path": "/q7DkcJEpBN3QAG2Qzi5gN6iYL6m.jpg",
            "season_number": 8,
            "vote_average": 0
        },
        {
            "air_date": "2022-07-18",
            "episode_count": 24,
            "id": 301741,
            "name": "Return of the Outcasts",
            "overview": "Survivor South Africa: Return of the Outcasts is the ninth season of Survivor South Africa. The season featured twenty returning players from the previous seasons of the series.\n\nDino Paulo defeated Shane Hattingh in a 7-2 vote to become the Sole Survivor.",
            "poster_path": "/7UbyAgklqqBhIsZYSTaQH9DsD0E.jpg",
            "season_number": 9,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "Outwit. Outplay. Outlast",
    "type": "Reality",
    "vote_average": 7.4,
    "vote_count": 7,
    "season_data": {
        "1": {
            "_id": "5258d8ca760ee3466171dabb",
            "air_date": "2006-09-03",
            "episodes": [
                {
                    "air_date": "2006-09-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 787538,
                    "name": "Episode 1",
                    "overview": "Arriving in the Pearl Islands for a media briefing, 14 South Africans were divided into two tribes of 7 (Aguila in Blue and Rana in Red) and were marooned immediately in Panama.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-09-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 787539,
                    "name": "Episode 2",
                    "overview": "Tribal Council was difficult for Rana, but Jacinda was excited that her game had finally began. The atmosphere over at Aguila was positive, where their food and shelter situation was more stable. Brigitte and Sam were identified as a duo as Aguila noticed how close the two were getting since the beginning.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-09-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 787540,
                    "name": "Episode 3",
                    "overview": "The mood in Aguila rose as the tribe's decision to keep Mzi for his role as food provider over the combatant Sam saw tribe morale return to normal. While Rana were starving as they still struggled to make fire after a week in the game.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-09-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 787541,
                    "name": "Episode 4",
                    "overview": "Nico returned to camp furious that he was nearly voted out unanimously by the tribe, despite Aguila having no time to strategize after Jude's exit at Tribal Council. Rana's living situation continued to worsen as they were unable to make fire nine days into the game, with the women working hard to lift Gareth's morale to remain in the game.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-10-01",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 787542,
                    "name": "Episode 5",
                    "overview": "Zayn was left blindsided by the vote, leaving Gareth concerned as he expressed that he'd flip on Rana if given the opportunity as he had no loyalties in the tribe. While Nico kept clashing with the rest of Aguila, after Brigitte had stolen his cigarettes to keep focus on him. Mzi had lost the tribe's fishing hook, but managed to fashion a makeshift hook from one of the women's accessories to maintain his role as food provider.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-10-08",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 787544,
                    "name": "Episode 6",
                    "overview": "Danielle's switch at the previous Tribal Council surprised Aguila when she arrived at their camp on Day 13, where she explained that Sanele's evacuation led to her arrival. Her swap sparked life in Brigitte's game, as she and the tribe were getting alienated by Nico's personality around camp. Rana hoped that Danielle left with an understanding, hoping that her swap will benefit them all at the merge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-10-15",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 787543,
                    "name": "Episode 7",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-10-22",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 787546,
                    "name": "Episode 8",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-10-29",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 787545,
                    "name": "Episode 9",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-11-05",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 787547,
                    "name": "Episode 10",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-11-12",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 787548,
                    "name": "Episode 11",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-11-19",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 787549,
                    "name": "Episode 12",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2006-11-26",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 787550,
                    "name": "Episode 13",
                    "overview": "The final four Survivors battle it out for a place in the final two and the announcement of the winner comes in a live show broadcast from M-Net's studio's in Gauteng.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Panama",
            "overview": "Survivor South Africa: Panama is the first season of Survivor South Africa. The premiere aired on September 3, 2006.\n\nAfter 27 days, estate agent Vanessa Marawa defeated entrepreneur Jacinda Louw in a 3-2 jury vote, winning the title of Ultimate Survivor and the R1 million prize.",
            "id": 45270,
            "poster_path": "/70eR67jHKmVc9AOa4iNjgnbPxiM.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5258d8ca760ee3466171dad1",
            "air_date": "2007-08-22",
            "episodes": [
                {
                    "air_date": "2007-08-22",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 787566,
                    "name": "Episode 1",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 787565,
                    "name": "Episode 2",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 787567,
                    "name": "Episode 3",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 787569,
                    "name": "Episode 4",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 787568,
                    "name": "Episode 5",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 787571,
                    "name": "Episode 6",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 787570,
                    "name": "Episode 7",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 787572,
                    "name": "Episode 8",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 787573,
                    "name": "Episode 9",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 787574,
                    "name": "Episode 10",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 787575,
                    "name": "Episode 11",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": null,
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 787576,
                    "name": "Episode 12",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2007-11-14",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 787577,
                    "name": "Episode 13",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Malaysia",
            "overview": "Survivor South Africa: Malaysia is the second season of Survivor South Africa. The premiere aired on August 22, 2007.\n\nWith a larger cast than its predecessor, many of the sixteen new contestants boasted explosive personalities, leading to frequent interpersonal clashes throughout the game. Despite the high tensions, the Iban Alliance managed to take decisive control after the merge and produced both members of the Final Two. In the end, policewoman Lorette Mostert defeated maritime lawyer Grant Clark in a 3-2 vote to become the second Ultimate Survivor and win the R1 million prize.\n\nAfter this season, the Survivor South Africa series went on a two-year hiatus before the production of Survivor South Africa: Santa Carolina in November 2009.",
            "id": 45272,
            "poster_path": "/rPXvovhw4NF53PZzxkB4P5SoItV.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5258d8ca760ee3466171dac6",
            "air_date": "2010-01-20",
            "episodes": [
                {
                    "air_date": "2010-01-20",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 787551,
                    "name": "Episode 1",
                    "overview": "This season we head to Santa Carolina, an island off the coast of Mozambique in East Africa that was also called Paradise Island, now a deserted paradise.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-01-27",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 787552,
                    "name": "Episode 2",
                    "overview": "Following a terrible start in Survivor South Africa: Santa Carolina Episode 1, Chibudu is already two people down. First, Christina lasted one whole night before deciding it was too hard, so she made up a lame excuse and quit. Then, following his challenge injury, Garth was voted out because he was barely able to walk. To make matters worse, they seem to have their next in line already picked out, having decided their “leader” Craig is useless.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-02-03",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 787553,
                    "name": "Episode 3",
                    "overview": "Not that anybody liked him before, but the talk of Craig being useless is resurfacing. In his effort to prove he’s useful, he breaks their hook while fishing.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-02-10",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 787554,
                    "name": "Episode 4",
                    "overview": "Gys feels threatened by Hein, who then decides to go off on his own to catch them some fish. He manages to catch 5 fish for them for breakfast. All of a sudden, their treatment of him becomes much more warm.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-02-17",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 787555,
                    "name": "Episode 5",
                    "overview": "Timbila finds it awkward to have gotten rid of someone else other than Darren. They all say they’re mad at him because of what he said at tribal council. As if they liked him before.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-02-24",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 787556,
                    "name": "Episode 6",
                    "overview": "Each tribe must select an ambassador to capture an opposing tribemate, who will be part of their tribe from that point forward. That person will be granted immunity for the next tribal council. They will also be able to obtain an item of value from the other team.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-03",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 787558,
                    "name": "Episode 7",
                    "overview": "Nico is passing out parchments. Everybody must rate everybody else on a scale of 1-10. Afterward, they will get on stumps based on how they are ranked.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-10",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 787557,
                    "name": "Episode 8",
                    "overview": "There are still two tribes, and it does not seem as if Chibudu will be doing anything to change it. It’s rare we see any tribe get Pagonged, so there’s always a chance. But if they just roll over, they may as well just leave now.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-17",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 787559,
                    "name": "Episode 9",
                    "overview": "Kaseran’s not too heart broken that Louw is gone. It allows him to step up. This doesn’t sit too well with ProVerb, who views his attitude as if he’s trying to take over.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-24",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 787560,
                    "name": "Episode 10",
                    "overview": "The question becomes: if Gys does go home, what are they going to eat? In the meantime, Kaseran is catching crabs, while ProVerb will try his hand at fishing.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-03-31",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 787562,
                    "name": "Episode 11",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-07",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 787561,
                    "name": "Episode 12",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-14",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 787563,
                    "name": "Episode 13",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-21",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 787564,
                    "name": "Episode 14",
                    "overview": "The Live Reunion hosted in South Africa with the cast, excluding Jub Jub due to a criminal case laid upon him while the season was airing, where the winner was announced. It was revealed that the public's jury vote was awarded to Ashley. It was not enough, as GiGi was crowned Ultimate Survivor in a 6-3 vote.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2010-04-28",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 4653966,
                    "name": "Episode 15",
                    "overview": "After the Santa Carolina finale and reunion, the entire cast except for Jub Jub were invited back to look back at the highlights of the season.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Santa Carolina",
            "overview": "Survivor South Africa: Santa Carolina is the third season of Survivor South Africa. The premiere aired on January 20, 2010.\n\nIn contrast to the previous two seasons, Santa Carolina featured an all-star cast of South African celebrities fighting to win money for their charities. The season saw two early quits as well as the rise of the series' first all-female alliance, which quietly took control of the post-merge game. In the end, 42 year-old exotic dancer GiGi van Schalkwyk defeated 42 year-old TV presenter Ashley Hayden in a 6-3 vote, winning the R1 million prize.",
            "id": 45271,
            "poster_path": "/bpkAPT2jV1wKChtapo3udeazOFk.jpg",
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "5b008c6c0e0a2623e90013c5",
            "air_date": "2011-02-24",
            "episodes": [
                {
                    "air_date": "2011-02-24",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1492991,
                    "name": "Episode 1",
                    "overview": "The game began with the Celebrity and the Pleb castaways banished to their respective islands by Maldivian officials. There were 9 Celebrities and 10 Plebs, both groups unaware of the other's existence in the game. Settling into the conditions on their islands, the Celebrities and the Plebs were taken to reward and immunity challenges respectively, still unaware of the other challenge or group partaking in the game.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-03",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1492992,
                    "name": "Episode 2",
                    "overview": "The Celebs and Plebs finally met each other on Day 4, at the second reward challenge. Philicity received a blue buff due to Lukhanyo's elimination the night before. The castaways were introduced to their new tribe names, Raituhn (Yellow) and Goma (Blue). After a grueling reward challenge, the two tribes partook in the Black Cowrie challenge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-10",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1492993,
                    "name": "Episode 3",
                    "overview": "Returning from Tribal Council, Goma appeared determined to turn their unfortunate challenge run as soon as possible. The next morning, the entire tribe expressed how MXO's naive approach to the game would be useful for both alliances. Over at Raituhn, Tejan, Malusi and Harry discussed how fellow Pleb Tasleem holding the Black Cowrie would affect them at Tribal Council. Harry nominated himself to divert the celebrities' attention to him, so that a 5-5 tie between Tasleem and a celeb would not occur.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-17",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1492994,
                    "name": "Episode 4",
                    "overview": "The Celebs from Raituhn were furious over the deceit of Tsepho's removal from the game. Bonnie and Carmel felt blindsided by Tejan, whom they had thought up until then was aligning himself with the Celebs in Raituhn.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-24",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1492995,
                    "name": "Episode 5",
                    "overview": "Jacques on Goma in the early hours of the morning on Day 10 started to express feelings of withdrawing from the game, causing friction with Pleb Sindi, who thought it was a waste of time where someone else could have wanted the opportunity in playing Survivor. Back at Raituhn, the Celebs were not relieved after the previous night's vote of Tasleem.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-03-31",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1492996,
                    "name": "Episode 6",
                    "overview": "After Tribal Council, Hykie took Tejan aside and expressed his anger about the second blindside that Tejan pulled over the Raituhn Celebs. Tejan explained to him that he needed to get rid of Carmel to destroy any lingering division of Plebs vs. Celebs within their tribe. Day 12 came along with Malusi being on the receiving end of Hykie's frustration from the night before. Malusi also confirmed with the actor that the move was necessary to an extent. Over at Goma, morale was down as Jacques was about to quit. Vanessa and Roxy were especially worried, because their alliance would be down to two when the young musician walked. MXO indicated that he needs to align himself with the Plebs on Goma if he is to stay in the game.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1492997,
                    "name": "Episode 7",
                    "overview": "After Tribal Council, Vanessa explained her frustration with the group about her situation. The atmosphere around Goma wasn't great especially for outsiders Vanessa and Roxy, who felt betrayed by Simon and the collapse of their alliance when Jacques quit. At Raituhn, Tejan attempted to confirm with Bonnie and Hykie that the strongest players unite and pick off weak players before they get too far into the game.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-14",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1492998,
                    "name": "Episode 8",
                    "overview": "After the double Tribal Council, Malusi openly confronted the tribe about a lack of unity in the vote. He received an apparently random vote from Bonnie, when the rest of the tribe picked off Harry. Bonnie admitted that she voted for Malusi, leaving him rattled and doubtful about the impending merge. At Goma, Sean noted how, at this situation, Raituhn can pick off the remaining four Goma members off one by one at the merge, to Alison's frustration.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-21",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1492999,
                    "name": "Episode 9",
                    "overview": "Early in the morning of Day 18, Sean reflected on what was said in Tribal Council the night before about Malusi mentioning that last night's vote was extremely crucial for him. He noticed that Tejan took notice to what his alliance partner said, which let Sean know that there were weak links in the Raituhn 5. MXO, Sean and Alison all started to persuade Malusi into flipping over to side with the former Goma castaways, though all they could manage was to place more doubt on his mind.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-28",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1493000,
                    "name": "Episode 10",
                    "overview": "The previous Raituhn alliance was left in ruins with Malusi's exit the previous night. Sean and Alison saw that this was their time to strike at staying in the game. Hykie and Bonnie felt that it was time for Tejan to pay for his pre-merge betrayals from Raituhn, and Tejan stopped talking to Hykie.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-05",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1493001,
                    "name": "Episode 11",
                    "overview": "Letters from home arrived in boatmail on Day 22, leaving the Final 6 in tears. At the reward challenge, Nico surprised the castaways with their loved ones. The visit was cut short though, due to the reward challenge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-12",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1493002,
                    "name": "Episode 12",
                    "overview": "Morning on Day 24 was bitter for the entire Eku tribe. Alison felt disgusted with Hykie and Bonnie's confidence in their alliance, Bonnie was hurt by MXO's preacher and preacher's wife comment that he directed to Hykie and herself, and Letshego highlighted that she was the odd one out amongst the Final 5. MXO especially got on Bonnie's nerves during the day.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-19",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1493003,
                    "name": "Episode 13",
                    "overview": "MXO was the clear target of the Raituhn three. He retrieved treemail for the morning of Day 26, reading it before anyone else. He was shocked to discover that the next challenge was for immunity instead of reward, and he was excited at the prospect of potentially winning the challenge and staying in the game another day.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-26",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 1493005,
                    "name": "Live Finale",
                    "overview": "The Final Tribal Council commenced immediately following the events of the previous episode. Hykie and Letshego were given an opportunity to give opening statements to the jury.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Maldives",
            "overview": "Survivor South Africa: Maldives is the fourth season of Survivor South Africa.\n\nMaldives featured 19 new contestants who began the game divided into two informal groups, the \"Celebs\" and the \"Plebs\". Through an unusual tribe division process, the Goma and Raituhn tribes were formed on Day 4 and came to define the rest of the season's politics. The twist-heavy season introduced the modern Hidden Immunity Idol to Survivor South Africa as well as the Black and White Cowries, all of which contributed significantly to the season's active strategy. After 27 days of intense gameplay combined with numerous heated arguments, both of a strategic and personal nature, \"Celeb\" Hykie Berg defeated \"Pleb\" Letshego Moshoeu in an 8-3 jury vote to become the first male Ultimate Survivor of the series.\n\nFollowing the airing of Maldives, the Survivor South Africa series entered its second hiatus until its resumption with Champions in 2014.",
            "id": 104033,
            "poster_path": "/sE2O6Su0aBEJFj50Rb13BFETPJh.jpg",
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "5b008c76c3a3686c8c001afb",
            "air_date": "2014-01-19",
            "episodes": [
                {
                    "air_date": "2014-01-19",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1493006,
                    "name": "Episode 1",
                    "overview": "The twenty civilian castaways were marooned on a raft off an island in the South China Sea. They were pulled onto a boat with supplies, where Nico instructed them to take the supplies onto their raft and reach the shore. Team captains Corné Krige and Mark Fish were awaiting the castaways' arrival. The team captains selected tribes by school yard pick, forming the tribes, Selatan (Krige) and Utara (Fish). Nico explained to the castaways that both Corné and Mark would partake in all challenges and Tribal Councils, but they won't be able to vote until the very end for the winner, alongside the jury.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1493007,
                    "name": "Episode 2",
                    "overview": "After the first immunity challenge, Utara celebrated their victory with Mark highlighting Solly's efforts in the challenge. Meanwhile, Corné advised Selatan to not give up and vote for the weakest tribe member at the first Tribal Council.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-02",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1493008,
                    "name": "Episode 3",
                    "overview": "Returning from Tribal Council, Zavion lashed out at the rest of the tribe for voting out his closest ally, Ashleigh. Moyra and Gena explained that his and Marsha's gameplay forced a \"Rugrats Alliance\" to form to counter his own.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-09",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1493009,
                    "name": "Episode 4",
                    "overview": "After what came across as a surprise split vote for Philip the night before, he vowed to do whatever he could to improve his position in the Selatan tribe. His main focus was to prove his own worth around camp in comparison to David, the tribe's outcast.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-16",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1493010,
                    "name": "Episode 5",
                    "overview": "After their first Tribal Council, Buhle came clean to the entire tribe about her falling out with Sonette involving the hidden immunity idol. Selatan shared some sorely needed unity after avoiding Tribal Council for the first time.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-23",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1493011,
                    "name": "Episode 6",
                    "overview": "After voting off their biggest provider in Zan, Utara’s morale was down; meanwhile, Selatan’s mood was better, as the tribe bonded over a yoga session.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-02",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1493012,
                    "name": "Episode 7",
                    "overview": "A rainstorm rolled into both camps, and on Utara, Sonette was injured by a falling beam from the shelter. Solly was infuriated by Shane’s careless construction of the shelter from earlier, which he felt led to the accident.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-09",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1493013,
                    "name": "Episode 8",
                    "overview": "David thanked the rest of the Utara tribe for keeping him in the game before Shane told him to keep the perception that he was on the outs. Sonette felt paranoid that she would be targeted for elimination before David due to her perceived weakness in challenges.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-16",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1493014,
                    "name": "Episode 9",
                    "overview": "Marian continued to privately taunt Stephen over his claim that he had nothing to do with Gena’s idol being stolen by the rest of the original Utara.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-23",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1493015,
                    "name": "Episode 10",
                    "overview": "Reduced to a tribe of four, Utara expressed concern of how the merge will play out with the seven-strong Selatan. Shane hoped that sending Stephen home before the merge would be enough of an olive branch to Buhle to reunite the Utara tribe with David as their number for a majority.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-30",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1493016,
                    "name": "Episode 11",
                    "overview": "The next morning, Shane buried one of his idols by the water well. Zavion contemplated between voting out Marian or David, while Sivu told Solly about the stolen idol, causing Solly to distrust Shane and Marian.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-06",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1493017,
                    "name": "Episode 12",
                    "overview": "After his closest ally was eliminated, Shane stated his embarrassment over playing with the tribemates he was playing with, calling them \"children\". He was especially disgusted with David, and plotted to sabotage his personal belongings just to get back at him. Shane proceeded to verbally accost David for going against him. Meanwhile, Graham pulled Altaaf aside with a plan to blindside Solly or Buhle to take control of the game. Shane attempted to sway Altaaf to his side. Sivu set up a cricket game for the tribe to bond over.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-13",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1493018,
                    "name": "Episode 13",
                    "overview": "Zavion disclosed to Shane that Vel and Buhle would likely be the next targets by the majority; Graham aligned with Zavion and Shane, planning to bring in Sivu and David. Graham worried about the possible four-person alliance of Vel, Buhle, Altaaf, and Moyra bringing in Sivu to take control.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-20",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 1493019,
                    "name": "Episode 14",
                    "overview": "Altaaf was stunned that some of his alliance members turned on Moyra, while Shane celebrated staying in the game. However, he and Sivu agreed that they needed to make big moves instead of trusting others to make them so that they would stay in the game. Sivu sought to eliminate Zavion and Graham next. Zavion likewise targeted Shane, who considered bringing in Altaaf to make a move.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-27",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 1493020,
                    "name": "Episode 15",
                    "overview": "Graham decided he would stand a better chance against David in the finals than he would against Sivu or Altaaf.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-05-04",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 1493021,
                    "name": "Episode 16",
                    "overview": "Zavion affirmed his desire to reach the end alongside Graham and David, with Sivu as his first target for being a jury threat. David saw Zavion’s attempts to align with him for the final three as disingenuous; he was a swing vote between the alliances of Graham and Zavion, and Buhle and Sivu.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-05-11",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 1493022,
                    "name": "Episode 17",
                    "overview": "After Sivu and Buhle's successful blindside of Zavion, Juara were informed at the final immunity challenge that this season will have a Final Three as opposed to a Final Two.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-05-18",
                    "episode_number": 18,
                    "episode_type": "finale",
                    "id": 1493023,
                    "name": "Champions Finale & Reunion",
                    "overview": "Buhle, Graham, and Sivu reflected on the game on the last day before attending the Final Tribal Council. The jury admonished Graham's lack of owning his game, due to the fact he orchestrated blindsides of two of his closest allies (Moyra and Altaaf) and for his loss of control of the game at the last two Tribal Councils to Buhle and Sivu.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Champions",
            "overview": "Survivor South Africa: Champions is the fifth season of Survivor South Africa.\n\nSet in the South China Sea, Champions saw two South African sporting legends serve as captains for 20 new castaways. Though the season was largely defined by two primary alliances, allegiances within these factions were fleeting, leading to numerous blindsides especially after the merge. Champions is also notable for its extensive history of Hidden Immunity Idol thefts, a twist unique to this season. In the end, the leader of the dominant Rugrats Alliance, Graham Jenneker, defeated Buhle Madlala and Sivu Xabanisa in a 5-3-2 plurality jury vote to become the Ultimate Survivor.\n\nFollowing the airing of Champions, the Survivor South Africa series entered its third and most recent hiatus until its resumption with Philippines in 2018.",
            "id": 104034,
            "poster_path": "/czl5IflwEfPd3R1unUjAThgXkGb.jpg",
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "5b008b7f0e0a2623e00013af",
            "air_date": "2018-05-03",
            "episodes": [
                {
                    "air_date": "2018-05-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1492988,
                    "name": "Episode 1",
                    "overview": "Eighteen castaways were marooned in the Philippines and split into their tribes on a Bangka. Nico immediately introduced the first reward challenge of the season to the two tribes, Luzon (Red) and Mindanao (Blue).",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1492989,
                    "name": "Episode 2",
                    "overview": "In low spirits after nearly being eliminated at Tribal Council the previous night, Tom sought to solidify his position with the voting block of Ace, Annalize, Chané and Neil, all the while proving to his tribe that he could make fire by eventually starting the tribe's fire. Over at Mindanao, the mood of the camp was that Marthunis was the primary target if they went to Tribal Council to keep tribal morale up.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1492990,
                    "name": "Episode 3",
                    "overview": "After Neil's blindside, Tom furiously told off Palesa, Josie, Vusi and Ace when they celebrated by the campfire. The morning after, Tom expressed his desire to get rid of Ace for flipping on the Big 5 alliance as soon as possible. At Mindanao, PK's paranoia of an all-woman's alliance led by Jeanne and Stacey-Lee was getting on the nerves of Tevin, leaving the two women feeling on the bottom when they felt that Marthunis should there instead.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1871453,
                    "name": "Episode 4",
                    "overview": "After Tribal Council, Marthunis' fallout had put Werner, Tevin, and Toni on edge with the tantrum he threw, despite plans being made that they were pretending that Marthunis was on the outs, while Jeanne was still unaware of how close she was to being voted out instead of Stacey-Lee. The morning of Day 9 saw the tribes being redistributed from two to three, introducing a new yellow tribe called Visayas, before the reward challenge. Palesa claimed a clue to a hidden immunity idol during the tribe shuffle.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-31",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1871455,
                    "name": "Episode 5",
                    "overview": "The morning after Tribal Council, Josie resolved herself to continue looking for the idol on the new Luzon beach, feeling the pressure of being the last original Luzon member in the tribe. While over at Mindanao, Marthunis confided to PK that he was considering voting for Tevin at the next Tribal Council, causing PK and Tevin to sit him down and reign him back into their alliance of three. Tensions at Visayas between Tom and Palesa were building as both of them were trying to sway Murishca to side with their alliance.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-07",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1871456,
                    "name": "Episode 6",
                    "overview": "The morning of Day 13 started with Chané decided that she needed to step away from Tom, after he foolishly played their idol on himself after Murishca had resigned herself from the game. She approached Palesa and Vusi to inform them she was done following Tom. At Mindanao, the tribe's frustration with Marthunis' erratic behaviour was reaching a breaking point, with Marthunis himself noticing he was backing himself into a corner he couldn't get out of.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1871460,
                    "name": "Episode 7",
                    "overview": "After the surprise shuffle vote at Tribal Council, Annalize and Josie both felt nothing had changed as being the only original Luzon on each tribe, though both Luzon and Mindanao were now openly planning for the eventual merge. With Toni moving back to Mindanao, Werner grew paranoid about his position in Luzon. Jeanne openly plotting with Annalize made Werner consider flipping to original Luzon once the merge occurred. At Mindanao, Tevin felt Josie's intellect and beauty would be a distraction for him, and that he'd need to get rid of her before it would be too late.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-21",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1871464,
                    "name": "Episode 8",
                    "overview": "After Tevin's blindside, Mindanao felt certain that they had flipped the game away from original tribal lines before the merge had even began. Werner had resigned himself to sticking with the women at Luzon to the end of the game, sticking to a social approach at camp. Jeanne and the women considered Werner as their shield to get to the end. Katinka started to step up in the strategic discussions around camp, and approaching Werner and Annalize about taking out Jeanne if push comes to shove. Visayas had depleted their food supply and were desperate for reward.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-28",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1871466,
                    "name": "Episode 9",
                    "overview": "A depleted and exhausted PK and Toni on Mindanao found out on the morning of Day 22 that they had made it to the merge, alongside Visayas and Luzon. Gathered to a merge feast and a new tribe beach, the final 10 formed the merge tribe of Araw. Straight off the bat, Vusi and Werner approached each other about a potential alliance to remove Tom, while PK was adamant on flipping on the original Mindanao to take out Jeanne first and Tom second, to Toni's annoyance. Meanwhile, the women and Werner of original Mindanao had their sights set on Vusi due to his challenge performances.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-07-05",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1871468,
                    "name": "Episode 10",
                    "overview": "The Mindanao alliance comforted a crying Katinka, who received votes from the Visayas camp except for Tom. While the women supported her, PK rationalized why the Visayas alliance had voted the way they did.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-07-12",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1871474,
                    "name": "Episode 11",
                    "overview": "Furious after finding out that the majority alliance wanted to take out PK, Toni blew up on Werner aligning himself with weaker players like Katinka, who had given PK enough information that he was the target for the vote, instead of his original alliance with her. The women started to distance themselves from Toni as her emotional backlash was getting to young Katinka's nerves.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-07-19",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1871477,
                    "name": "Episode 12",
                    "overview": "The previous Tribal Council revealed to Werner and the majority alliance that Toni had finally realized that the original Mindanao alliance is dead, and that her days are numbered without flipping people from the majority. However, the alliance still wanted Toni and PK out, with Tom as a back-up plan. Annalize was threatened by Jeanne's performances at Tribal Council despite her lack of strategic gameplay.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-07-26",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1871481,
                    "name": "Episode 13",
                    "overview": "Stunned by Toni's parting words, Werner and Jeanne laughed at the perception that they were running the show on Araw, given that Katinka was the one who gave the orders to vote out Toni at the last Tribal Council. Using Katinka's inability to keep a secret about her alliances' goals, PK tried to stir up camp life by informing Tom of the final 3 deal Tom has with Werner and Katinka.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-02",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 1871485,
                    "name": "Episode 14",
                    "overview": "The last Tribal Council left Jeanne furious that her game was constantly berated by people joining the jury, with Werner acknowledging that possibly voting out Jeanne might calm a potential jury. Annalize informed Katinka that she had an extra vote from Exile Island. Katinka approached Tom with a plan to blindside Werner, but Tom went to Werner afterwards to reveal Katinka's plotting against the pastor.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-09",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 1871488,
                    "name": "Episode 15",
                    "overview": "Stunned by the previous vote, Jeanne was grateful for Werner saving her game with the immunity idol. Werner consolidated a final two deal with Tom, knowing that at least Jeanne and Tom would take him to the end if such a scenario.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-16",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 1871489,
                    "name": "Philippines Finale & Reunion",
                    "overview": "Jeanne came from behind to win her second immunity challenge, and the opportunity to vote out a jury member at Tribal Council. She tried to figure out whether Tom's role as social pariah throughout the game would be better to face than Annalize's favourable relationships with the entire jury.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-23",
                    "episode_number": 17,
                    "episode_type": "finale",
                    "id": 1871493,
                    "name": "Episode 17",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Philippines",
            "overview": "Survivor South Africa: Philippines is the sixth season of Survivor South Africa.\n\nFollowing a four-year hiatus, Survivor South Africa returned with Philippines, whose game format was modified to align more closely with the flagship American series. From the start of the season, the castaways played aggressively, leading to numerous blindsides and the earliest rock draw to occur in franchise history. Upon the merge, the game took a lull as Werner Joubert's Luzon Alliance marched to the end with little effective resistance. After Werner was voted out, Jeanne Michel and Tom Swartz emerged as the season's Final Two. Though both were chastised for riding on Werner's coattails, Tom was able to sway an apparently unfavourable jury to his side as he defeated Jeanne in a 6-1 jury vote to become the Sole Survivor.",
            "id": 104032,
            "poster_path": "/sbHrnIGDpAUN51C6LnTiInJrN4Y.jpg",
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "_id": "5d456648a0be28652fa2050f",
            "air_date": "2019-05-16",
            "episodes": [
                {
                    "air_date": "2019-05-16",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1871504,
                    "name": "I Just Want to Fix Your Crown",
                    "overview": "The three tribes were tasked to designate a tribe leader. Cobus, Paul, and Rocco were chosen for Ta'alo, Sa'ula, and Laumei respectively. The leaders had to pick their tribe's weakest player (Jacques, Seipei, and Laetitia were respectively chosen). However, the three leaders were informed they were being exiled to the Island of Secrets for the first night of the game immediately, while their tribe's weakest players were assigned to crucial roles for the reward challenge. Once at the Island of Secrets, the three leaders were given tribal dilemmas: a clue to a hidden immunity idol at their camps, or flint. While Rocco was the only one to choose flint for his tribe, he dug through Paul's jeans to have a look at the hidden immunity idol clue when he was alone.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-23",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1871505,
                    "name": "One Step Forward, Two Steps Back",
                    "overview": "Paul approached Nicole after Sa'ula's first Tribal Council with concerns about a sub-alliance forming within the Amigos, suggesting that Nicole, Steffi, and himself align first. Cobus shared his idol clue with Jacques in the early morning, and the two started looking by their tribe's well. Jacques found the hidden immunity idol from under Cobus' nose and hid it with his secret advantage. Meanwhile Ta'alo's patience with Tania was wearing thin, as Felix and Tania clashed during the rain for space in the shelter. Rocco tried to lead the Laumei men to consider voting out Mmaba at the first opportunity, while Mike and Geoffrey initially targeted Laetitia for her age. However, once they noticed that Rocco was defending Laetitia, Mike rallied Geoffrey, Mmaba, and Rose-Lee against Rocco.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-30",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1871506,
                    "name": "The Gods Have Smiled Upon Me",
                    "overview": "In awe of their sudden blindside of Paul, the Amigos officially brought Seipei into the alliance, but the relief was short-lived when it was discovered that Paul had possession of the tribe's flint as he left the game. This was yet another kick to Sa'ula's morale in desperate need of a challenge win.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1871507,
                    "name": "I'm Not Gonna Buy This B.S.",
                    "overview": "After his blunder with the idol at Tribal Council, Jacques felt that he had completely burnt his game with the Ta'alo tribe, yet he chose to lie about how he found the idol by claiming that he got a clue during the first reward challenge. The men at Ta'alo were confounded by Jacques' idol reveal and play. Jacques' wishes for a tribe swap were granted that morning, with the tribes reshuffling into three tribes of six.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-13",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1871508,
                    "name": "It's Time for a Hail Mary",
                    "overview": "Despite being on the bottom of the new Laumei, Durão started to bond with Jacques as a means of moving forward, while Felix expressed frustration about being forced to work with Jacques and Tania to survive the new Laumei.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-20",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1871509,
                    "name": "Let Them Play Barbie and Ken",
                    "overview": "After the successful blindside of Felix, Jacques revealed to the rest of Laumei that he had both the Laumei idol and the merge vote advantage. The four bonded and formed an alliance dubbed the Band of Misfits. Cobus and Steffi were concerned about Nathan's desire to remain in the game after trying to throw the previous immunity challenge, while Danté stole Ta'alo's flint to weaken Rob's standing among the tribe.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-27",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1871510,
                    "name": "The Game Chooses for You",
                    "overview": "Day 15 started with treemail suggesting a tribe shuffle or merge. The Band of Misfits decided that whatever happened, no one else must know about the Laumei idol. Standing at the reward challenge, the players were tasked with picking between 15 bowls of paint, indicating their new tribe colours",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-07-04",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1871511,
                    "name": "Putting My Foot in My Mouth",
                    "overview": "Danté's frustration with the original Laumei members' lack of contribution at camp was beginning to create animosity in Sa'ula. Nathan decided to capitalize on the tension to shift any attention on him and Nicole, and to solidify a partnership with Geoffrey and Mmaba in a potential merge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-07-11",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1871512,
                    "name": "Are You Crying?",
                    "overview": "After Tribal Council, Danté and Meryl argued with Nicole over Nathan's blindside and the plot to flush Meryl's idol. The next morning, the 13 remaining players were merged into a single tribe, Manumalo. Rob was stunned to see that Sa'ula had voted out Nathan. At the merge feast, Geoffrey took note of Danté and Meryl's strategizing, while Nicole tried to explain her betrayal to the remaining Amigos.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-07-18",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1871514,
                    "name": "He's Delicious-Looking...",
                    "overview": "Despite the close vote at Tribal Council, Geoffrey was in good spirits about his allegiances in the new Manumalo, while Rob was glad that the Spit-Shake Seven alliance had yet to be discovered. However, both Geoffrey and Nicole started to notice how allies were running towards Rob for strategic advice around camp.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-07-25",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1871515,
                    "name": "The Puppetmaster",
                    "overview": "While Rob and Seipei's plan to eliminate Geoffrey went down perfectly, Mmaba was left distraught with Mike's betrayal of their Day 1 alliance from the original Laumei tribe. Seipei's social game throughout the camp was becoming more apparent to Laetitia and Rob, with the latter learning that Seipei intended to get rid of the other women in the Amigo alliance after the Spit-Shake alliance takes out Danté and Laetitia.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-08-01",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1871516,
                    "name": "One Trick Pony",
                    "overview": "While Danté was left frustrated with the original Laumei members in not voting out Rob, Jacques and Cobus confronted Rob about leaving them out of Seipei's blindside. The morning after, knowing that the others were not listening to him, Danté resigned himself to saving his strength for the immunity challenge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-08-08",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1871518,
                    "name": "Trouble Council",
                    "overview": "Despite being included in the vote for Danté, Cobus and Jacques were frustrated that the Spit-Shake alliance were leaving them out of the loop, while Steffi was frustrated that Jacques didn't fall for the Amigos' pressure to flush out his idol. Trust within the Spit-Shake alliance left Cobus, Jacques, and even Nicole feeling vulnerable with how the last two Tribal Councils went.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-08-15",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 1871519,
                    "name": "The Biggest Mother-",
                    "overview": "As Manumalo returned to camp, Steffi told the tribe she accidentally voted for Cobus when the plan was to either vote Jacques out with the idol or flush it out of the game. While the tribe congratulated Jacques for his bold move, he openly declared that he would use his idol to take out the biggest player left if the rest of the tribe targeted him at the next Tribal Council, and the others reacted in shock and disgust by the language he used.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-08-22",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 1871522,
                    "name": "The Lightbulbs Are Switching On",
                    "overview": "As the tribe returned to camp, Rob initially did damage control with Mike, explaining that Mmaba had an advantage, but lied that the alliance didn't want to force Mike to betray another ally like Geoffrey. The Amigos and Laetitia were grateful that Jacques had finally used his idol and was left exposed.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-08-29",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 1871524,
                    "name": "Someone You Can Trust",
                    "overview": "After Jacques' ouster, a shellshocked Steffi decided that Rob's control of the votes was over, but that she had to make him see remaining loyalty from her. Rob tried to explain that he was trying to protect Laetitia and her in the event that Jacques had an idol, and that the Amigos were still tight.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-09-05",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 1871527,
                    "name": "Icarus",
                    "overview": "After successfully removing Mike from the game, Laetitia, Nicole, and Steffi gathered after returning to camp, solidifying their plans to blindside Rob next with an idol in his pocket. Meanwhile, a rattled Durão struggled to accept that he had been betrayed by Rob the entire merge and felt defeated.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-09-12",
                    "episode_number": 18,
                    "episode_type": "finale",
                    "id": 1871529,
                    "name": "Action Speaks Louder",
                    "overview": "Laetitia was left stunned at Nicole's betrayal at the previous Tribal Council, and dismissed Nicole's apology as lies. Meanwhile, Durão was still struggling to believe that he was in the game. Rob was happy with Nicole's poor jury management and felt that the only things left to survive were Laetitia's vote nullifier and the last immunity challenge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 7,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Island of Secrets",
            "overview": "Survivor South Africa: Island of Secrets is the seventh season of Survivor South Africa.\n\nThis season saw the introduction of the eponymous Island of Secrets, a variant of Exile Island that bestowed game-changing powers to its visitors. The season generally proceeded in a straightforward manner, with one player, Rob Bentele, controlling the entire post-merge game with little effective resistance. Despite this, the cast of fiery personalities provided the kindling for much tension, with many of the in-game conflicts centred around the brash temperament of Danté De Villiers, the ostracism of Jacques Burger at the final eight, and the criticism directed at the majority alliance's sanctimonious gameplay. In the end, Rob defeated his allies Nicole Capper and Durão Mariano in a 6-4-0 jury vote to become the seventh Sole Survivor.",
            "id": 128844,
            "poster_path": "/8VAG95P1ymGI9y48IhPGceR9Wy3.jpg",
            "season_number": 7,
            "vote_average": 0
        },
        "8": {
            "_id": "60b5e27a4350110078c69a39",
            "air_date": "2021-06-03",
            "episodes": [
                {
                    "air_date": "2021-06-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2993304,
                    "name": "Nothing Unites like a Common Enemy",
                    "overview": "Arriving in the Wild Coast, the castaways took part in a random draw to select the two tribes, Vuna and Zamba.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-06-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3003414,
                    "name": "I Can Go 'Bos'... No Pun!",
                    "overview": "After being left out of Jason's blindside, Shaun tried to work his way in with the men of Zamba, while Renier and Amy worked to solidify their secret duo. Meanwhile, unity over at Vuna was a bit wobbly with Carla getting annoyed with Pinty's commanding presence around camp.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-06-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3029645,
                    "name": "Always Be Closing",
                    "overview": "Carla felt pleased orchestrating Pinty's blindside, but noticed that the men were praising Mike for the move.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-06-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3029646,
                    "name": "Gloat or Vote",
                    "overview": "The outsider Vuna members on Zamba were happy with their decision to vote out Mike, to Carla and Wardah's misfortune. Day 9 saw Vuna's tribe raid of Zamba occur, with Amy having to reveal that it was her loss at Immunity Island that caused it to happen. During this, Anesu tried to reconnect with Paul and Chappies about Mike's elimination.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-07-01",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3029647,
                    "name": "Collateral Damage",
                    "overview": "Prior to the last Tribal Council, Thoriso approached Anesu and the original Vuna members about using their hidden immunity idol note, to earn some trust with the original Zamba 6 on Vuna. Anesu agreed in order for her allies to blindside the Zamba majority.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-07-08",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3062647,
                    "name": "Control the Flow",
                    "overview": "Returning from the Double Tribal Council, the Zamba tribe were left annoyed with the Vuna tribe's behaviour eating during their Tribal Council. Meanwhile Wardah felt blindsided again by another ally's removal from the game. Tyson felt alienated by the Zamba majority having targeted him, forcing an idol play.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-07-15",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3062648,
                    "name": "Look Behind You",
                    "overview": "With Dino voted out, tensions between Anela and Wardah continued to build with the numbers shifting in her advantage after the second tribe shuffle. After returning from Immunity Island, Anela lied that he won an extra vote for the first Tribal Council after merge. Qieän's behaviour around the new Zamba came across as selfish to the Vuna majority, eating food she had previously won in rewards openly in front of the tribe. Santoni felt uncomfortable with the new majority, knowing it would protect her only until the merge. At Vuna, Renier took the time to build bonds with Chappies, and reconnected with Amy and the Zamba women.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-07-22",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3062649,
                    "name": "Here for a Good Time",
                    "overview": "Early on Day 19, Marisha and Renier found the Vuna tribe's hidden immunity idol, promising to use it for the original Zamba alliance come merge. A few hours later, the tribes merged to form the Osindile tribe, and celebrated with a merge feast. Chappies let slip that the Vuna tribe had received videos from their loved ones on a Reward, to the displeasure of Shaun and the last Vuna tribe, and proceeded to look for an idol clue in front of everyone.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-07-29",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3062650,
                    "name": "A Deal with the Devil",
                    "overview": "Nicole broke into tears after Marisha's blindside, with the Vuna alliance celebrating their move gaining majority in the Osindile tribe. Shaun and Santoni locked heads when he figured out that she played double agent to blindside the Zamba alliance. This left Santoni feeling alienated, knowing she doesn't like her Vuna alliance, and didn't throw her vote like Anesu did to save face with the Zamba alliance. She spent the next morning trying to inform Nicole and Amy that Anesu was also involved in Marisha's blindside, also playing double agent with the Zamba alliance.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-08-05",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 3062655,
                    "name": "Tied Destinies",
                    "overview": "After voting out Shaun, Tyson felt that Kiran and himself were taking control over Osindile. However, Anesu was developing a plan to betray her Vuna alliance, as the men and Wardah had been keeping information about the Immunity Island Idol away from her. Bouncing ideas off Amy and Chappies, the Zamba minority saw a lifeline in Anesu.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-08-12",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 3062660,
                    "name": "Brownie Points Are Everything",
                    "overview": "After surviving the Tied Destinies twist, Tyson felt that he was in control of Osindile, with Kiran and Wardah as his right and left hand. Meanwhile, Anesu and Chappies were finally ready to blindside Tyson with Santoni as the Destiny Three against the Vuna majority.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-08-19",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 3062662,
                    "name": "All in a Day's Work",
                    "overview": "Despite Operation Destiny falling apart, Chappies and Santoni were prepared to use the Tribal Council Pass and Hidden Immunity Idol at the next Tribal Council to get revenge for Anesu. The remaining Vuna majority had figured Santoni managed to find the idol during her stint on Immunity Island.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-08-26",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 3062664,
                    "name": "A Very Weird Vibe",
                    "overview": "Anela was left stunned that Chappies saved him with the Tribal Council Pass, someone who kept on breaking trust against him throughout the merge. Chappies and Tyson continued arguing into the night upon returning to Osindile however. The next morning, Tyson and Kiran solidified allegiances with Anela, forming a League of Shadows, to work against Santoni and Chappies.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-09-02",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 3062666,
                    "name": "A Sour Taste in the Mouth",
                    "overview": "Following Anela's betrayal of the League of Shadows, Kiran talked to Nicole about voting Anela out next. However, Tyson was still dead set on voting out Chappies, who likewise pitched to Anela and Nicole that Kiran and Tyson were the most dangerous players left due to their strong partnership.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-09-09",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 3206394,
                    "name": "The Fruits of Your Labour",
                    "overview": "Following a fifth straight immunity win, Chappies chose to eat with Anesu, who gave him advice on how to present his game to the jury and which jurors would be tough to sway in his favor. Chappies also earned the right to eliminate a juror at the next Tribal Council, and he chose Wardah. Once Chappies returned to camp, Tyson pitched to him to break up the tight duo of Anela and Nicole, but Chappies, thinking this season would end in a final three, decided that Tyson was the more pressing threat.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-09-16",
                    "episode_number": 16,
                    "episode_type": "finale",
                    "id": 3206395,
                    "name": "The Final Decision & Immunity Island Reunion",
                    "overview": "Anela and Nicole agreed to take each other to the end no matter what if Chappies lost the final challenge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 8,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Immunity Island",
            "overview": "Survivor South Africa: Immunity Island is the eighth season of Survivor South Africa.\n\nNicole Wilmans defeated Anela Majozi in an 8-1 vote to win the title of Sole Survivor, becoming the first female winner since Survivor South Africa: Santa Carolina over a decade prior.",
            "id": 197617,
            "poster_path": "/q7DkcJEpBN3QAG2Qzi5gN6iYL6m.jpg",
            "season_number": 8,
            "vote_average": 0
        },
        "9": {
            "_id": "62da7c38a31440004fadf176",
            "air_date": "2022-07-18",
            "episodes": [
                {
                    "air_date": "2022-07-18",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3846878,
                    "name": "Twice the Game",
                    "overview": "Twenty returning Survivor South Africa Castaways arrived for redemption in the Sunshine Coast in the Eastern Cape. Nico informed the newly dubbed \"Outcasts\" that they were playing for R2 Million, the series' highest prize offer, and were divided into tribes by their previous placements. The red Yontau (Pre-Merge castaways) squared off in the first reward challenge of the season against the blue Masu (Post-Merge castaways).",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-07-19",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3846879,
                    "name": "Survivor 101",
                    "overview": "At the Outpost, Shane and Steffi urged Seamus and Thoriso to vote for Tejan, someone on the outs in Masu. However, Seamus decided that the two of them remain quiet of their own votes despite Thoriso wanting to gain favour with the others. Returning to their tribes, all four of them revealed the Outpost Idol and vote, but Shane and Steffi chose not to reveal that they offered Tejan to Yontau.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-07-20",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3846880,
                    "name": "The Ghost of Your Past Game",
                    "overview": "The Chappies blindside left Steffi and Shane uncomfortable in their place in the Breakfast Club, with Marian having to reassure Shane that he's safe in the alliance. Palesa was aware that Tevin giving her immunity at Tribal Council could make the perception of the Season Sixers acting as a quad more of a threat even though she felt in the majority of Masu. PK likewise felt comfortable in a seven strong alliance that excluded Shane and Steffi.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-07-21",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3846881,
                    "name": "Walking on Eggshells",
                    "overview": "The fallout of PK's vote saw Toni arguing with Danté, which overflowed to the morning where she had to leave the shelter due to Danté continuing to raise his voice at her, upsetting her further. Toni wished to be swapped from the tribe as soon as possible to get away from him. Meanwhile, Marian, Meryl, and Steffi solidified themselves as the Full Package trio within the Breakfast Club alliance.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-07-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3846882,
                    "name": "The Rope Dealer",
                    "overview": "While the tribe agreed that Pinty should be voted out next, Phil and Thoriso both wanted to break up the duo forming between Seamus and Tevin as soon as possible. Over at Masu, Toni tried to patch things up with Marian after inappropriately using Marian's skin condition against her in the game, aware that flipping to the pre-mergers would be sabotage in the future. Palesa tried to reconnect with Danté after the PK vote, but she felt that his ego was getting too much to handle as the current alpha male of the tribe.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-07-26",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3846883,
                    "name": "Sharp Tools",
                    "overview": "Tevin's blindside left Seamus rattled about his position in Yontau, blaming the vote on Dino. At Masu, Danté started chopping off the symbols around camp in the event of a tribe swap, with Toni wary of his alpha male status around camp.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-07-27",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3846884,
                    "name": "Expect the Unexpected",
                    "overview": "Pinty annoyed the rest of Yontau by celebrating Seamus' ouster at camp the next morning, despite Dino knowing that it was Shona who informed the tribe about Seamus' plans. In the lead up to a potential tribe swap, Toni tried to convince Tejan and Palesa that they should try and work on flipping Steffi against Danté if they have the chance.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-07-28",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3846885,
                    "name": "This is Gonna Be a Life Long Torture",
                    "overview": "The medical team extracted Shona from the challenge to examine her further. Nico declared a restart for the sudden death round, with Shane stepping in for Yontau and Felix replacing Killarney for Masu. With Nico releasing an additional two wooden balls into the mud pit, another hour passed in the challenge before Toni managed to score the winning point for Masu. Both tribes were emotionally drained after the challenge, with Meryl and Marian in tears after everything that had happened.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-01",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3846886,
                    "name": "Flat Out No",
                    "overview": "Phil owned up to messing up the plan, leaving Palesa unsure if she should work with the Yontau duo. However, Danté's frustrations with the Breakfast Club left Palesa as someone he was willing to continue working with. Meanwhile, Meryl and Marian started to question whether it was worth still working with Danté given his explosive response to the vote at Tribal Council. At Masu, Tejan shared the idol clue he received at the Outpost to Toni in the hopes to solidify themselves as a duo.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-02",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 3846887,
                    "name": "The Don",
                    "overview": "After leaving Felix and Thoriso on the bottom of new Masu, Tejan, at Toni's insistence, found the Idol hidden near the tribe's water well. When finding out that it would only work for someone at Yontau, they decided to try and sneak it across to Dino. While at Yontau, Shane started trying to court Dino and Phil to prepare a blindside against Danté.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-03",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 3846888,
                    "name": "Spanners in the Works",
                    "overview": "Despite feeling betrayed by Tejan and Toni, Felix didn't want to let revenge take over his game due to losing Thoriso at the last Tribal Council. Toni continued to cement her control over the new Masu, aware of the many connections she's forming across tribal lines since the swap. On Yontau, Phil's main goal was to find a means to protect himself until the merge, as his ally Dino only had one idol in his possession. Danté started using the inactive Masu idol he had to bluff to the Breakfast Club that he was assured of getting to merge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-04",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 3846889,
                    "name": "Guess What, You Are a Number!",
                    "overview": "The hopes of finding safety for himself vanished when Shane unraveled the advantage and discovered it was Yontau's hidden Diplomatic Immunity advantage, the very same advantage that Marian had just used hours earlier to switch tribes. Knowing that the advantage was useless to him, Shane sought to use the pouch it came in to bluff to the rest of Yontau that he too held an idol.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-08",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 3846890,
                    "name": "Work for It",
                    "overview": "The new Salan tribe celebrated after Tribal Council at the upgraded former Yontau camp, with Marian noticing how quickly Danté and Felix reached out to each other, being friends outside of the game. The tribe was provided breakfast meals the morning after the merge rather than the typical merge feast.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-09",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 3846891,
                    "name": "A Steady Ship",
                    "overview": "Tejan was blindsided by the vote, which saw Steffi sticking to her original Breakfast Club and Full Package alliance over the new Masu tribe. In a means to apologize to Tejan, Meryl explained that it was because Toni kept threatening her game, while Tejan was under the belief it was Steffi leading the charge against her, not Toni. Despite finally getting his way, the Breakfast Club started to turn their sights onto Danté, as his aggressive approach with Tejan had started to alienate Shane and the rest of the alliance. Meanwhile, Danté desperately wanted the Breakfast Club to listen to his concerns about Dino",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-10",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 3846892,
                    "name": "High Risk, High Reward",
                    "overview": "Tejan's outburst at Tribal Council left the Full Package trio exposed, with the Breakfast Club falling apart in order to target Steffi or Meryl for their strong social game. Killarney advocated for Steffi, while Shane and Marian wanted to get rid of Meryl.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-11",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 3883236,
                    "name": "Dipping into the Dark Side",
                    "overview": "As promised, Meryl gave Tejan her Reward Send token as a thanks for saving her at the previous Tribal Council, while her relationship with Marian appeared fractured on the floor. Marian felt disappointed in Phil for flipping against her ally, before telling the No B.S. men about all of the advantages that Meryl still held.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-15",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 3883237,
                    "name": "Balance of Power",
                    "overview": "Upon seeing Meryl was blindsided, Marian was in disbelief that the No B.S. alliance's plan worked, with Shane feeling the entire tribe felt temporarily united in the successful blindside of Meryl. Early tree mail on Day 28 alluded to a potential family visit with the upcoming reward, with the entire Salan tribe talking about missing their loved ones.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-16",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 3883238,
                    "name": "Goat Mode",
                    "overview": "After 17 minutes, Felix's block fell, giving Phil his second immunity challenge win of the season. The win made Marian more determined than ever to break up the duo of Felix and Phil, like she felt she had done with Danté and Felix previously. She rallied the rest of the tribe to target Felix at the upcoming vote. What complicated matters was when Felix discovered a rock with the Salan tribe's symbol on the beach while walking with Phil and Killarney, leading to Phil finding a clue to a hidden immunity idol in front of them.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-17",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 3883239,
                    "name": "A Whole Lot of B.S.",
                    "overview": "The vote had left Marian and Dino suspecting that Phil used Tejan's idol bluff to save Felix, with Shane angry that his and Marian's plan on splitting up the No B.S. alliance failed at the last minute. The No B.S. alliance was left in tatters after Phil saved Felix, leaving Dino feeling on the outs in the trio.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-18",
                    "episode_number": 20,
                    "episode_type": "standard",
                    "id": 3902085,
                    "name": "Our Little Alliance",
                    "overview": "Returning from the Outpost with a bowl of fruit for the tribe, Dino was aware that regardless of what he said, a target would be painted on him for a presumed advantage. So he withheld the River Cruise reward he won, but that he received a video from home rather. Furthering his lie, he told Phil in private that he could practice for the immunity challenge. Still worried about getting the votes on Felix, Marian decided to implement the buddy system on Killarney, to prevent her from changing her vote at someone else's suggestion.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-22",
                    "episode_number": 21,
                    "episode_type": "standard",
                    "id": 3902086,
                    "name": "A Game of Fluidity",
                    "overview": "Despite both Phil and Dino electing to vote out Felix, trust between the two of them was at an all time low, with Dino adamant in taking out his ally if he didn't win immunity, as he feared that his resume was going to be diminished compared to Phil's. Tree mail arrived with individual word puzzles for the Salan tribe to search for an advantage for the upcoming immunity challenge, with Shane finding it shortly before Dino could on the beach.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-23",
                    "episode_number": 22,
                    "episode_type": "standard",
                    "id": 3902087,
                    "name": "No Tools In My Toolkit",
                    "overview": "A mistake by Phil in the reward challenge led to a victory by Marian and Shane. Back at camp, Phil pitched an idea to Dino to convince Marian and Shane to split their vote in hopes that they can battle it out in the end, though Dino secretly sought to vote out Phil if he were to lose the immunity challenge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-24",
                    "episode_number": 23,
                    "episode_type": "standard",
                    "id": 3902088,
                    "name": "Peace. Calm. Confidence.",
                    "overview": "The final three's loved ones were brought out for a reunion and to witness the final immmunity challenge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-08-25",
                    "episode_number": 24,
                    "episode_type": "finale",
                    "id": 3902089,
                    "name": "Head vs. Heart",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 34521,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Return of the Outcasts",
            "overview": "Survivor South Africa: Return of the Outcasts is the ninth season of Survivor South Africa. The season featured twenty returning players from the previous seasons of the series.\n\nDino Paulo defeated Shane Hattingh in a 7-2 vote to become the Sole Survivor.",
            "id": 301741,
            "poster_path": "/7UbyAgklqqBhIsZYSTaQH9DsD0E.jpg",
            "season_number": 9,
            "vote_average": 0
        }
    }
}