{"adult":false,"backdrop_path":"/sjFi1GHTgaC2UKMHkK4mVB97RkW.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2010-08-17","genres":[{"id":10764,"name":"Reality"}],"homepage":"https://www.bbc.co.uk/programmes/b013pqnm","id":34549,"in_production":false,"languages":["en"],"last_air_date":"2016-10-27","last_episode_to_air":{"id":1234172,"name":"Class of 2015","overview":"A catch-up with the contestants from The Great British Bake Off 2015.","vote_average":0,"vote_count":0,"air_date":"2016-10-27","episode_number":11,"episode_type":"finale","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":null},"name":"The Great British Bake Off","next_episode_to_air":null,"networks":[{"id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","name":"BBC One","origin_country":"GB"},{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":89,"number_of_seasons":7,"origin_country":["GB"],"original_language":"en","original_name":"The Great British Bake Off","overview":"This British television baking competition selects from amongst its competitors the best amateur baker. The series is credited with reinvigorating interest in baking throughout the UK, and many of its participants, including winners, have gone on to start a career based on baking.","popularity":15.584,"poster_path":"/4lkXuLZhxUczr8ufy0tKgSRRYD2.jpg","production_companies":[{"id":52031,"logo_path":"/xXI1jqyY4QDrckA0QGiYnZye790.png","name":"Love Productions","origin_country":"GB"}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"}],"seasons":[{"air_date":"2010-08-17","episode_count":24,"id":45294,"name":"Specials","overview":"","poster_path":"/xigBMfMY8ULVstqElMa6VCaSI0V.jpg","season_number":0,"vote_average":0},{"air_date":"2010-08-17","episode_count":6,"id":45293,"name":"Series 1","overview":"Series 1 of The Great British Bake Off, aired on BBC 2, saw ten home bakers take part in a bake-off to test every aspect of their baking skills as they battled to be crowned the Great British Bake Off’s best amateur baker. Each week the nationwide tour saw keen bakers put through three challenges in a particular discipline. The rounds took place in various locations across the UK following a theme, for example, the episode on puddings would take place in Bakewell, bread baking would take place near Sandwich. This first series had a voiceover by Stephen Noonan; for the subsequent series this role was taken by the on-screen presenters Mel Giedroyc and Sue Perkins.","poster_path":"/ggZf5y6RDB7FJGOqekl0c2952bz.jpg","season_number":1,"vote_average":0},{"air_date":"2011-08-15","episode_count":11,"id":45296,"name":"Series 2","overview":"In this year's series of The Great British Bake Off twelve amateur bakers started the competition and they were gradually eliminated during each round of the contest. Unlike series 1, this year the competition was held in a single location - in the ground of Valentines Mansion, a 17th-century mansion house in Redbridge. In addition to their on-screen presenting roles, Mel Giedroyc and Sue Perkins also took over the narration of the show, which in series 1 had been done by Stephen Noonan. Series 2 also introduced the \"star baker\" award for the most impressive performer each week.\n\nThree and a half thousand people applied for the competition, and 12 were selected. Each episode was filmed over two 14-hour days.","poster_path":"/e5FdvQy2SCl1dO1sd6LJfSfpN6e.jpg","season_number":2,"vote_average":0},{"air_date":"2012-08-13","episode_count":14,"id":45295,"name":"Series 3","overview":"The third series of The Great British Bake Off began airing on Tuesday 14 August 2012. The series was filmed at Harptree Court in East Harptree, Somerset.\n\nSeven thousand applied for the competition and twelve contestants were chosen.","poster_path":"/owOu8A3FTilx8YxJnhn0e6kd3SR.jpg","season_number":3,"vote_average":0},{"air_date":"2013-08-19","episode_count":15,"id":45297,"name":"Series 4","overview":"The fourth series of The Great British Bake Off began airing on 20 August 2013. Mel Giedroyc and Sue Perkins again presented the show and Mary Berry and Paul Hollywood returned as judges. As with series three, the competition was held at Harptree Court in East Harptree, Somerset.","poster_path":"/kiglA2bggKVfP8PQZ3pCsV2SfA9.jpg","season_number":4,"vote_average":0},{"air_date":"2014-08-05","episode_count":16,"id":62219,"name":"Series 5","overview":"The fifth series of The Great British Bake Off first aired on 6 August 2014, with twelve contestants. Mel Giedroyc and Sue Perkins presented the show and Mary Berry and Paul Hollywood returned as judges. Twelve contestants competed in this series, and the competition was held in Welford Park in Berkshire.\n\nThe programme was moved from BBC Two to BBC One starting this year, but the Masterclass episodes remained on BBC Two. A companion series, The Great British Bake Off: An Extra Slice, hosted by comedian Jo Brand, started this year on BBC Two.","poster_path":"/d2Nedau7VK5khyk70ZCOyDOCpwq.jpg","season_number":5,"vote_average":0},{"air_date":"2015-08-04","episode_count":16,"id":69330,"name":"Series 6","overview":"The sixth series of The Great British Bake Off first aired on 5 August 2015, with twelve contestants competing to be the series 6 winner. Mel Giedroyc and Sue Perkins presented the show, and Mary Berry and Paul Hollywood returned as judges. The competition was held in the ground of Welford Park, Berkshire for a second year.","poster_path":"/6fOVnhFblCb722KQnXmpMSCD0KI.jpg","season_number":6,"vote_average":7.5},{"air_date":"2016-08-21","episode_count":11,"id":79474,"name":"Series 7","overview":"The seventh series of The Great British Bake Off aired from 24 August 2016, with twelve contestants competing to be crowned the series 7 winner.\n\nThis series was the last to be broadcast on BBC One, as the production company Love Productions opted to move the show to Channel 4. As such, it was also the last series to feature Sue Perkins, Mel Giedroyc, and Mary Berry.\n\nIn the United States, the seventh series was broadcast as the fourth season on PBS and streamed as Collection 4 on Netflix.","poster_path":"/rhxYkx3rInFRtHkZyfqOTe5Nxup.jpg","season_number":7,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Reality","vote_average":7.595,"vote_count":79,"season_data":{"1":{"_id":"5258d902760ee34661720dfb","air_date":"2010-08-17","episodes":[{"air_date":"2010-08-17","episode_number":1,"episode_type":"standard","id":788033,"name":"Cake Week","overview":"This first show uncovers that Queen Victoria is responsible for Britain's wedding cake tradition, that the Puritans tried to ban cake because it was too pleasurable, and that cake baking contributed to women's liberation.\n\nThe ten bakers tackle three increasingly difficult challenges as their cake-making ability is tested. They start with their signature bake – the cake they love that says something about them. Next up is the technical challenge – a blind recipe for Victoria sandwich that delivers drastically different results. Finally they tackle the ingredient even professionals fear – chocolate. Whose chocolate celebration cake will win the day? And which two bakers will leave the show at the end?","production_code":"","runtime":60,"season_number":1,"show_id":34549,"still_path":"/r0jQYV9sb84cdleUZYZRxdHjCJa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-24","episode_number":2,"episode_type":"standard","id":788035,"name":"Biscuits Week","overview":"Mel Giedroyc and Sue Perkins take the eight passionate home bakers who made it through the first round to Scone Palace near Perth to make biscuits and teatime treats.\n\nJudging their efforts are renowned baking writer Mary Berry and master baker Paul Hollywood.\n\nOver two days the home bakers are set three increasingly difficult challenges as they bake their signature biscuits, attempt many a baker's nemesis – scones – and finally a tower of petit fours with meringues, choux pastry and macaroons.\n\nAs the bakers battle it out, Mel and Sue find out how the digestive became Britain's favourite biscuit; ask what's so Scottish about shortbread and discover why Sir Ranulph Fiennes has the world's most expensive biscuit.\n\nWhich of the eight bakers will wow the judges with their originality and skill? And which two bakers will fail to make it through to the next round?","production_code":"","runtime":60,"season_number":1,"show_id":34549,"still_path":"/vzVmsCaky5hYyXompXqK3NR3Mtb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-31","episode_number":3,"episode_type":"standard","id":788032,"name":"Bread Week","overview":"It is week three of the competition and the six remaining bakers are making bread in Kent. If they found cakes and biscuits challenging, it’s bread that’s considered the real test of a baker’s mettle.\n\nIn the shadow of Sarre Windmill, the bakers will be kneading, proving and knocking back their dough under the watchful eye of baking writer Mary Berry and master baker Paul Hollywood. And as they battle it out to produce the perfect loaf, Mel and Sue will be tasting Britain’s earliest bread roll, finding out what happened to bread during the Industrial Revolution and relating the hidden history of the sandwich.\n\nMaking bread is an ancient skill. Which of the bakers will best cope with the pressure and who will be the one who has to leave the Bake Off?","production_code":"","runtime":60,"season_number":1,"show_id":34549,"still_path":"/nr7Aa7lIhpZBcNx7UlUHelwUX7Y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-07","episode_number":4,"episode_type":"standard","id":788031,"name":"Puddings Week","overview":"It’s week four of and the remaining five bakers have travelled to Bakewell in Derbyshire. This time the bakers are reinventing an often neglected British classic – the pudding.\n\nThere will be sticky toffee puds, peach and blueberry \"boy-bait\", rhubarb and orange betty and a cherry queen of puddings.\n\nBut the surprise bake set by judges Paul Hollywood and Mary Berry really tests the baker’s ability to cope with the pressure. Will the bakers rise to the occasion?\n\nAs the puds go in the oven, Mel and Sue roam the country finding out how and why puddings changed from ‘meat’ to ‘sweet’, visiting the birthplace of school puddings and discovering how puddings helped change Britain’s image overseas.","production_code":"","runtime":60,"season_number":1,"show_id":34549,"still_path":"/r95yCIwARD14IY0tLJNOc6Z2S3F.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-14","episode_number":5,"episode_type":"standard","id":788034,"name":"Pastry Week","overview":"It’s the penultimate round and as the travelling marquee pitches up in the Cornish village of Mousehole, it’s time for the bakers to get to grips with the most difficult of all baking skills – pastry. They bake their own versions of hearty British pies, get down to details with exquisite pastry canapés, and take a crash-course in crimping for this week’s surprise bake.\n\nWhile they’re rubbing-in and rolling-out, Mel and Sue will be finding out that Britain’s earliest pies really were humble, how pastry became an art form and how pies used to have a more sinister side.\n\nThen judges Mary Berry and Paul Hollywood will decide who will be the final three to go through to the final.","production_code":"","runtime":60,"season_number":1,"show_id":34549,"still_path":"/mVwpVJlNEySh1LGz6ev8QHowPHk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-21","episode_number":6,"episode_type":"finale","id":788036,"name":"Tea Party","overview":"It's the Grand Final and the last three surviving contestants face their biggest challenge yet - baking for the Bake Off's Afternoon Tea Party. In order to be crowned the victor, they will need to bring together all of their skills, making cakes, bread and pastry.","production_code":"","runtime":60,"season_number":1,"show_id":34549,"still_path":"/1J0oCikd2eA248VOlzGTQJzX6p6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 1","overview":"Series 1 of The Great British Bake Off, aired on BBC 2, saw ten home bakers take part in a bake-off to test every aspect of their baking skills as they battled to be crowned the Great British Bake Off’s best amateur baker. Each week the nationwide tour saw keen bakers put through three challenges in a particular discipline. The rounds took place in various locations across the UK following a theme, for example, the episode on puddings would take place in Bakewell, bread baking would take place near Sandwich. This first series had a voiceover by Stephen Noonan; for the subsequent series this role was taken by the on-screen presenters Mel Giedroyc and Sue Perkins.","id":45293,"poster_path":"/ggZf5y6RDB7FJGOqekl0c2952bz.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258d902760ee34661720e2e","air_date":"2011-08-15","episodes":[{"air_date":"2011-08-16","episode_number":1,"episode_type":"standard","id":788068,"name":"Cupcakes Week","overview":"For their first challenge, the bakers were asked to bake 24 cupcakes in two hours. They were allowed to make two different types of cupcakes. For the technical challenge, the bakers were asked to bake a Coffee and Walnut Battenburg cake using Mary Berry's recipe in two hours. The cake needed to have the perfect sponge which held its form (perfect symmetry), distinguish flavours, and a smooth exterior. For the showstopper, the bakers were asked to bake a chocolate tiered celebration cake with elaborate, multi-layer design in five hours.","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":"/ezfj6h6geWw8sMDCDx5RtK3tWH2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-23","episode_number":2,"episode_type":"standard","id":788069,"name":"Tarts Week","overview":"The second round of The Great British Bake Off, hosted by Mel Giedroyc and Sue Perkins, continues in the search for Britain's best amateur baker. Eleven bakers remain and this time their pastry skills are scrutinised as the bakers tackle tarts. Over two days the bakers will face three increasingly complicated challenges whilst trying to avoid a soggy bottom.\n\nJudged by acclaimed master baker Paul Hollywood and legendary cookery writer and baker Mary Berry, the bakers start with a signature bake: a quiche that says something about them. Next is the dreaded technical challenge where they are faced with baking a classic tarte au citron. Finally, our bakers have to deliver in bulk as they are asked to deliver 24 show-stopping sweet miniature tarts.\n\nThe pressure of pastry proves too much for some. Who will be named Star Baker and whose Bake Off journey will be over?","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":"/8bzQG5ch2uWEliXbXUBFfuEiJWQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-30","episode_number":3,"episode_type":"standard","id":788070,"name":"Bread Week","overview":"The contestants start this week with the signature bake, a free-form flavoured loaf that produces a variety of interesting results, including a combination of chocolate and onion. Next is the technical challenge - focaccia - that really separates the wheat from the chaff. Finally, a mammoth six-hour hour challenge requires the bakers to create a display bread basket that is filled with 24 bread rolls.","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":"/pdqKfYC7CxiHBspjgHk3DbpOCo1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-06","episode_number":4,"episode_type":"standard","id":788071,"name":"Biscuits Week","overview":"The search for Britain's best amateur baker, with Mel Giedroyc and Sue Perkins, is now haf-way through. The bakers take on biscuits and these bite-sized, delicate delights prove too much for some.\n\nAs always starting with the signature bake, the remaining eight must impress legendary cookery writer Mary Berry and artisan baker Paul Hollywood with their interpretation of a classic biscuit. Who will crumble when it comes to judging and whose ginger nuts are too hot to handle?\n\nNext up, the technical challenge, where following a Mary Berry recipe is not as simple as it would seem for our bakers, who start feeling the pressure when faced with brandy snaps.\n\nFinally, the toughest showstopper challenge yet as they attempt to bake and present a macaroon display that must taste as good as it looks. With five hours on the clock, every second counts. This is the last chance to impress the judges before someone's dream of becoming Britain's best amateur baker is over.","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":"/oIe40MDyYSmO1JqoR7Y04hJnMsc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-13","episode_number":5,"episode_type":"standard","id":788072,"name":"Pies Week","overview":"The search for Britain's best amateur baker, with Mel Giedroyc and Sue Perkins, reaches the fifth round and everyone is out to avoid the dreaded soggy bottom as the seven remaining bakers face pies.\n\nThe marquee is soon filled with the delicious aroma of fresh baking as the signature challenge has the bakers doing all they can to impress acclaimed master baker Paul Hollywood and legendary cookery writer and baker Mary Berry with their signature family pie. Topping their pie with either flaky or rough puff pastry, some decide to play it safe whilst others get more experimental.\n\nNext is the dreaded technical challenge where for lifelong vegetarian Jason delivering six individual, beautifully baked and seasoned pork pies to the judging table proves problematic.\n\nFinally, there is a sweet showstopper challenge in the shape of a meringue pie. The judges' expectations are high with hopes of crisp pastry bases and delicious custard and fruit fillings topped with a perfect meringue.","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-20","episode_number":6,"episode_type":"standard","id":788073,"name":"Desserts Week","overview":"The all-lady quarter-final of The Great British Bake Off, hosted by Mel Giedroyc and Sue Perkins. The remaining five have to impress with their dessert skills. As usual starting with the signature bake, the exacting judges Mary Berry and Paul Hollywood are expecting to see and taste baked cheesecakes that reach their high expectations. Next is the technical challenge and the bete noir of most bakers, a chocolate roulade.\n\nFinally, the spectacular showstopper that requires the bakers to impress with hundreds of choux pastry profiteroles that must be perfectly baked, filled and then assembled into a croquembouche. This king of desserts is traditionally served at French weddings and Mary and Paul expect to see an impressive tower of choux pastry buns with superb flavoured fillings and held together with hardened caramel.\n\nWho will have what it takes to book a place in the semi-finals?","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-27","episode_number":7,"episode_type":"standard","id":788074,"name":"Patisserie Week","overview":"Mel Giedroyc and Sue Perkins host the semi-final. After seven weeks of gruelling challenges, the four remaining bakers must prove they are worth a place in the final.\n\nTo begin, the signature challenge requires them to make a baked, layered, mousse cake, and the standards are high as Mary-Anne again attempts something different with a joconde sponge and decor paste.\n\nAs usual, judges Mary Berry and Paul Hollywood set the tasks. This week's technical challenge is Paul's favourite sweet treat - iced fingers. Finally, for the showstopper, the bakers have to make a labour-intensive and technically demanding layered or laminated pastry dough to produce a batch of three different types of pastries or croissants.\n\nWith a place in the final within their grasp, the bakers know they have to deliver their very best to the judging table every time.","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-04","episode_number":8,"episode_type":"standard","id":788075,"name":"The Final","overview":"It’s the grand final for the contestants and after seven tough weeks the three finalists face their biggest challenge yet – baking for The Great British Bake Off’s street party.\n\nThey will be baking for judges Mary Berry and Paul Hollywood, but also friends, family and former Bake Off contestants. Our finalists will reach new height of baking. They will be making a selection of petits fours and puff pastry, a first for The Great British Bake Off.\n\nThey also be baking mille-feuille, mini Victoria sponges, strawberry and cream meringue nests and miniature strawberry and rhubarb cheesecakes.\n\nWho will be crowned as Britain’s best amateur baker on Great British Bake Off 2011? If sonly it could be all of of them…","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-06","episode_number":9,"episode_type":"standard","id":788076,"name":"Masterclass","overview":"The ultimate baking masterclass with The Great British Bake Off judges Mary Berry and Paul Hollywood.\n\nFor the first time ever, Mary and Paul get behind the workstations and bake. Revisiting the technical challenges from the series, this programme, in a step-by-step guide, demonstrates all tips and tricks you need to know at home to get a perfect result every time.\n\nFirst in a two-part series, this programme features how to bake Mary's take on a traditional British cake - a coffee and walnut Battenberg, her classic tarte au citron with a deliciously sharp lemon filling, Paul's traditional Italian flatbread, focaccia and Mary's brandy snaps.","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-13","episode_number":10,"episode_type":"standard","id":788077,"name":"Masterclass","overview":"The ultimate baking masterclass with The Great British Bake Off judges Mary Berry and Paul Hollywood.\n\nMary and Paul get behind the workstations and bake. The programme revisits the technical challenges from the series as Mary and Paul guide you through challenges faced by the bakers in this year's Bake Off. In a step-by-step guide they demonstrate all tips and secrets you need at home get achieve a perfect bake every time.\n\nThe masterclass features Paul's luxury pork pies, filled with the perfect combination of pork loin and a quail's egg, and Mary's chocolate roulade recipe where Mary will show you how to get the perfect roll every time. Plus Paul's traditional iced fingers and Mary's sachertorte.","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-20","episode_number":11,"episode_type":"finale","id":788078,"name":"Series 1 Revisited","overview":"In 2010, talented baking enthusiasts from all over Britain came together to compete in the first ever Great British Bake Off. Over six challenging weeks 10 bakers battled it out until finally a winner was crowned.\n\nOne year later, this programme reflects on the highlights from series one. Catching up with the bakers to hear the highs and lows of their journey, where they are now and how The Great British Bake Off changed their lives.\n\nWith judges Mary Berry and Paul Hollywood, who give their own personal accounts and memories from the series.","production_code":"","runtime":60,"season_number":2,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 2","overview":"In this year's series of The Great British Bake Off twelve amateur bakers started the competition and they were gradually eliminated during each round of the contest. Unlike series 1, this year the competition was held in a single location - in the ground of Valentines Mansion, a 17th-century mansion house in Redbridge. In addition to their on-screen presenting roles, Mel Giedroyc and Sue Perkins also took over the narration of the show, which in series 1 had been done by Stephen Noonan. Series 2 also introduced the \"star baker\" award for the most impressive performer each week.\n\nThree and a half thousand people applied for the competition, and 12 were selected. Each episode was filmed over two 14-hour days.","id":45296,"poster_path":"/e5FdvQy2SCl1dO1sd6LJfSfpN6e.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258d902760ee34661720e20","air_date":"2012-08-13","episodes":[{"air_date":"2012-08-14","episode_number":1,"episode_type":"standard","id":788052,"name":"Cakes","overview":"Signature Challenge: Upside-down Cake. Showstopper Challenge: A cake, when sliced reveals a hidden design.  Technical Challenge: Rum Babas.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-21","episode_number":2,"episode_type":"standard","id":788053,"name":"Bread","overview":"Signature Challenge: 24 Flatbreads.  Showstopper Challenge: 12 sweet and 12 savoury Bagels.  Technical Challenge: Eight-strand plaited loaf.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-28","episode_number":3,"episode_type":"standard","id":788054,"name":"Tarts","overview":"Things are hotting up in the Bake Off tent as the remaining ten bakers do their best to wow Paul Hollywood and Mary Berry with some unusual flavour combinations for their tartes tatin.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-04","episode_number":4,"episode_type":"standard","id":788055,"name":"Desserts","overview":"Amateur bakers have their skills tested to the limit. The bakers face three challenges, all designed for a sweet tooth, including a mainstay of French baking - the creme caramel.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-11","episode_number":5,"episode_type":"standard","id":788056,"name":"Pies","overview":"The bakers turn their attention to cooking perfect pies.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-18","episode_number":6,"episode_type":"standard","id":788057,"name":"Puddings","overview":"The bakers are challenged to make two types of sponge puddings, take on a difficult Mary Berry recipe, and deliver a showstopping strudel.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-25","episode_number":7,"episode_type":"standard","id":788058,"name":"Sweet Dough","overview":"The bakers take on three sweet dough challenges.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-02","episode_number":8,"episode_type":"standard","id":788059,"name":"Biscuits","overview":"The remaining bakers face a biscuit based quarter-final.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-09","episode_number":9,"episode_type":"standard","id":788061,"name":"Patisserie","overview":"The bakers seeking a place in the final have to frantically work against the clock to deliver petits fours to Paul and Mary's exacting standards.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-16","episode_number":10,"episode_type":"standard","id":788060,"name":"The Final","overview":"A year after taking part, we catch up with the bakers from series 2 of The Great British Bake Off. What was it really like to compete in the tent, be judged by Mary Berry and Paul Hollywood, and comforted by Mel Giedroyc and Sue Perkins? And how has their shared love of baking and appearing on the series changed their lives?","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-22","episode_number":11,"episode_type":"standard","id":788062,"name":"Masterclass","overview":"Paul Hollywood and Mary Berry show how to tackle treacle tarts and rum babas.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/pdEle1GPQV0p6dr1j6At9xDo2U1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-23","episode_number":12,"episode_type":"standard","id":788063,"name":"Revisited","overview":"A chance to catch up with the bakers from series 2 of The Great British Bake Off.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-24","episode_number":13,"episode_type":"standard","id":788064,"name":"Masterclass","overview":"Recipes include the queen of puddings, chocolate tea cakes and jam doughnuts.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-25","episode_number":14,"episode_type":"finale","id":788065,"name":"Masterclass","overview":"Mary Berry and Paul Hollywood show which signature bakes they would have chosen to make.","production_code":"","runtime":60,"season_number":3,"show_id":34549,"still_path":"/5xECII3TOqALLinplCFDOQo6zqQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 3","overview":"The third series of The Great British Bake Off began airing on Tuesday 14 August 2012. The series was filmed at Harptree Court in East Harptree, Somerset.\n\nSeven thousand applied for the competition and twelve contestants were chosen.","id":45295,"poster_path":"/owOu8A3FTilx8YxJnhn0e6kd3SR.jpg","season_number":3,"vote_average":0},"4":{"_id":"5258d902760ee34661720e3c","air_date":"2013-08-19","episodes":[{"air_date":"2013-08-20","episode_number":1,"episode_type":"standard","id":788088,"name":"Cake","overview":"The Bake Off returns and for the first time ever, the tent welcomes a baker's dozen to do battle. Mel Giedroyc and Sue Perkins coax them through their baking trials, all the while under the scrutiny of the inimitable judges Mary Berry and Paul Hollywood. With a range of baking styles and personalities, the Bake Off tent is packed with the best amateur bakers from around the country; from space engineer to student, teacher to dentist, psychologist to carpenter. But after ten weeks of whisking, crimping and piping, only one can emerge victorious. This time, nobody is safe because Mary and Paul may decide to lose not one but two bakers at any time.\n\nThe judges set the signature challenges as true home baker staples so that they can immediately see the bakers' personalities and their range of skills and ideas, setting them apart from each other. The first challenge is a sandwich cake. While this might seem simple, there is a difficult choice to be made between going for the classic or being experimental. Something tried and tested might not stand out, but going for ambitious flavours and ideas could miss the mark.\n\nMary's first technical challenge is for angel food cake, which is not the bakers' idea of heaven as they attempt to follow the bare bones of the recipe, which proves to be a recipe for disaster for some. The showstopper explores all things chocolate, and is their final chance to secure their place in the Bake Off and save them from being the first to leave the tent.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-27","episode_number":2,"episode_type":"standard","id":788093,"name":"Bread","overview":"One week down and the remaining 12 bakers have 9 weeks and 27 gruelling challenges to get through before they can be crowned Winner of the Great British Bake Off. But having survived cake, now they battle bread.\n\nKnowing that Paul will be watching their every move and prove, they must bake 36 perfectly thin and crispy signature bread sticks, a technically tricky English muffin, and the most outrageous showstopping loaves of bread ever seen on television... from a Christmas wreath to a proud peacock and a psychic octopus.\n\nAs the bakers try to perfect their breakfast muffins, we explore their rise in popularity in Georgian England, initially distributed by a network of muffin men, now immortalised in the famous nursery rhyme.\n\nMel and Sue try to help but instead leave chaos in their wake, as Mary and Paul use the challenges to find out what type of bakers they are and exactly how far they can push their baking skills. They are looking for real talent and natural instinct, creativity and baking brilliance.\n\nAt any time, two bakers might be asked to leave, making this year tougher than ever before... nobody is safe.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-03","episode_number":3,"episode_type":"standard","id":788091,"name":"Desserts","overview":"It's week three, and the heat in the kitchen is already too much for some, as the remaining 11 bakers get ready to deal with desserts.\n\nMary and Paul are upping the ante. Having survived cake and bread, this is the first week we see the bakers having to multi-task across several different baking skills at the same time; a signature trifle combining biscuit, cake, jelly or custard in perfectly distinct layers; a technically difficult task of making floating islands, which result in various forms of unrecognisable landmass by the end of the bake and a showstopper that pulls out all the stops, getting the bakers to juggle 24 petit fours that the judges might finally deem acceptable. They are taking no prisoners, and for the first time ever, there's a baking burglary in the Bake Off tent and it becomes a crime scene.\n\nMel explores the origins of the trifle and discovers how it was transformed in the Georgian era from an elitist dessert for the aristocracy to a dish that was accessible to the masses.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-10","episode_number":4,"episode_type":"standard","id":788090,"name":"Pies and Tarts","overview":"It's week four in the tent and the baking is getting serious, as the remaining bakers put on their pinnies to pimp up pies and tarts.\n\nFrom the country's oldest known cookbook, we discover the almost 700 year old history of the English custard tart. It might once have been popular at the decadent court of King Richard II but it is now a technical challenge in the Bake Off tent, one which causes more than the intended wobble for the bakers.\n\nStarting with what should be a home baker staple, their signature double-crusted fruit pies present a challenge to even the most experienced bakers, let alone the one baker who has a deep-hatred of all things fruit, and the showstopper sorts the bakers from the boys, as they set about making a filo pie centrepiece. Mel and Sue come to their aid as the bakers' nerves are stretched tighter than the filo pastry they are making from scratch.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-17","episode_number":5,"episode_type":"standard","id":788081,"name":"Biscuits and Traybakes","overview":"Almost halfway through the Bake Off and the remaining eight bakers are faced with biscuits and traybakes.\n\nFirst up, a Signature Challenge that requires them to do something apparently simple - produce their favourite traybake. The bakers offer Mary Berry and Paul Hollywood their twists on everything from bakewells to banoffees and brownies.\n\nNext they face the thinnest Technical Challenge ever devised on Bake Off - the French classic tuiles, biscuits formed into fragile rolls and decorated with delicate designs of piped chocolate.\n\nAnd finally, a Showstopper of epic proportions as the bakers make 'biscuit towers'. Mel and Sue follow the trail of biscuit crumbs as the bakers produce architectural feats inspired by everything from ancient Japanese civilization to one of time travel's most feared enemies.\n\nMeanwhile, we discover how the Tottenham Cake, a pink, iced traybake produced by the Quakers of North London, became a match day treat at White Hart Lane.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-24","episode_number":6,"episode_type":"standard","id":788092,"name":"Sweet Dough","overview":"It is week six in the tent and time for sweet dough week - but will it prove bittersweet for the bakers?\n\nThey kick off with a signature tea loaf. Most of the bakers choose to make something connected to home, so Mary Berry and Paul Hollywood are presented with everything from locally sourced loaves from Yorkshire and Oxford to Devonshire-inspired panettone and Welsh bara brith.\n\nMeanwhile we explore the history of the Sally Lunn, and the story of the torta negra - the well-travelled tea loaf that creates a taste of Wales in the middle of Patagonia.\n\nThe bakers face Paul's most twisted Technical Challenge yet and a Showstopper that draws on all of Europe for inspiration, creating 36 sweet European buns - from Swedish cinnamon buns to German schnecken and French brioches.\n\nOver halfway through and the stakes are high... but will their dough rise too?","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-01","episode_number":7,"episode_type":"standard","id":788079,"name":"Pastry","overview":"With only six bakers left in the tent the stakes are getting higher and this week they face pastry.\n\nThe remaining bakers bring the old fashioned suet pudding bang up to date, banishing nightmares of stodgy school dinners for good with their range of creative signature suet puds, from 'spotted dick with a kick' to fig roly-poly. Delving further into the history of suet takes us to the Isle of Mull, where the clootie dumpling has been at the heart of the community for centuries.\n\nThe technical challenge this week proves to be hell on earth, as the bakers are set one of Mary's choux pastry recipes and they must make eight perfect religieuse. These are delicate choux buns filled with crème patissiere, topped with shining ganache and balanced delicately one on top of the other.\n\nAs they reach the end of their pastry marathon, the bakers reach the showstopper and must make three different types of perfectly puffed pastries. One type must be filled, another must be iced and the third is up to them. From palmiers to cream horns, they have just four hours to impress the judges.\n\nOn your marks...get set...BAKE!","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-08","episode_number":8,"episode_type":"standard","id":788080,"name":"Quarter Final","overview":"It is the quarter final and there are just five bakers left. In the last seven weeks they have been tested on normal cakes, breads, pastries, pies and puddings so the judges are upping the ante. This week's challenges test them on how they cope working with unconventional flours and unusual desserts which push their creativity to the max.\n\nFor the signature challenge, the bakers must make a loaf using non-traditional wheat flours, encouraged instead to use the rarer flours such as spelt, rye, potato or tapioca flours. Whilst the bakers get busy with their loaves, the programme explores the history of the National Loaf. This culinary creation was borne out of necessity during World War Two, when the Ministry of Food developed a flour to make imports go further and keep the nation healthy in times of rationing.\n\nThe technical round sees the bakers challenged to each make a dacquoise, made with three layers of fragile coiled meringue, sandwiched with coffee custard and topped with hazelnut praline, a dessert which also happens to be gluten free. For their final challenge, the bakers must push themselves out of their comfort zone to create showstopping novelty vegetable cakes - which must also be dairy free.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-15","episode_number":9,"episode_type":"standard","id":788084,"name":"French Week","overview":"It is the semi-final and there are just four bakers left. This time it is the French round, and the challenges include savoury canapes and opera cake.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-22","episode_number":10,"episode_type":"standard","id":788085,"name":"Class of 2012","overview":"Each year thousands of people apply to The Great British Bake Off and only a handful are chosen, but what exactly is it like to take part? Talking candidly about their experience, the Class of 2012 return to the Bake Off tent to give a special insight to life inside the tent.\n\nThey divulge how it felt to face the steely blue eyes and judgement of Mary and Paul, how they coped with having ingredients siphoned off by Mel and Sue, and to what extent practising bagels, pies, petit fours, meringues, hidden design cakes and gingerbread constructions took over their lives. Reliving their perfectly risen highs and soggy bottom lows, the bakers also reveal how their experience in a tent, in the middle of a field, in extreme weather conditions, has changed their lives.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-22","episode_number":11,"episode_type":"standard","id":788082,"name":"Bake Off Final","overview":"It's the final of The Great British Bake Off! 13,000 applicants were narrowed down to 13 of Britain's best amateur bakers, and the 13 became three. There are just three final challenges standing between the bakers and the title of winner of the Great British Bake Off. Mary and Paul have chosen the final challenges to test the bakers on the areas in which they wanted to see how far they had grown in skill and creativity.\n\nThe Signature Challenge asks them to create a technically difficult picnic pie - a savoury pie packed full of fillings that create a creative design, surrounded by shortcrust pastry with perfectly baked sides strong enough to be served out of the tin. The Technical is one of Paul's, as they are tasked to make 12 perfectly shaped pretzels, six savoury with rock salt and six sweet, flavoured with poppy seeds and topped with sweet orange zest and glaze. For the very final challenge in this year's Bake Off they must bake the ultimate showpiece in a baker's repertoire - a wedding cake. Three tiers that are their last chance to showcase their creative, baking brilliance.\n\nAll of their efforts will be prepared for their family and friends at the GBBO summer garden party, who will be there to support the winner - but which of our female finalists will it be?\n\nBake Off finalists; on your marks....get set......BAKE!","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-29","episode_number":12,"episode_type":"standard","id":788083,"name":"Masterclass 1","overview":"Mary and Paul take over the tent for the ultimate baking masterclass. Mary makes a whole orange cake and angel food cake, Paul makes breakfast muffins and olive bread sticks, and together they make a chocolate cake showstopper.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-30","episode_number":13,"episode_type":"standard","id":788086,"name":"Masterclass 2","overview":"Paul and Mary show what they would have done in dessert and pie challenges. Mary: 'Tipsy Trifle', floating islands and 'Wobbly Apricot Tart'. Paul: custard tarts and spanakopita.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-31","episode_number":14,"episode_type":"standard","id":788087,"name":"Masterclass 3","overview":"Paul and Mary show what they would have done in the biscuit and pastry test. Mary: ginger spiced traybake and tuiles with chocolate mousse. Paul :iced tea loaf, sweet dough brioche tete, and  apricot couronne.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-01","episode_number":15,"episode_type":"finale","id":788089,"name":"Masterclass 4","overview":"Paul and Mary show what they would have done for the challenges in the final weeks of the Bake Off. Paul: wheat-free crusty rye loaf and sweet and savory pretzels. Mary: sussex pond pudding, choux pastry religious, and an opera cake.","production_code":"","runtime":60,"season_number":4,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 4","overview":"The fourth series of The Great British Bake Off began airing on 20 August 2013. Mel Giedroyc and Sue Perkins again presented the show and Mary Berry and Paul Hollywood returned as judges. As with series three, the competition was held at Harptree Court in East Harptree, Somerset.","id":45297,"poster_path":"/kiglA2bggKVfP8PQZ3pCsV2SfA9.jpg","season_number":4,"vote_average":0},"5":{"_id":"53e691f6c3a3684436001866","air_date":"2014-08-05","episodes":[{"air_date":"2014-08-06","episode_number":1,"episode_type":"standard","id":1003557,"name":"Cake","overview":"The baking challenge is back, welcoming the tent's youngest-ever baker and the oldest.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/h3ouNHw8ulM0cI8L2LnFZkeK9Bo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-13","episode_number":2,"episode_type":"standard","id":1003558,"name":"Biscuits","overview":"The remaining 11 bakers are challenged to create three-dimensional biscuit scenes.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/qkVcdjhq1OUO7zhE449CfIviLGB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-20","episode_number":3,"episode_type":"standard","id":1003559,"name":"Bread","overview":"In week three, the remaining ten bakers get ready to brave bread.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/7sYK79oAtn43JcmJrNkRargGHz4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-27","episode_number":4,"episode_type":"standard","id":1004504,"name":"Desserts","overview":"As week four begins, the bakers must multitask across several baking skills at once.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/qXelLz1IIH9aLp1VGW9hUT529sH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-03","episode_number":5,"episode_type":"standard","id":1005315,"name":"Pies and Tarts","overview":"Almost half way through the Bake Off and the remaining bakers are facing pies and tarts.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/qYZq3Hj0dvwD3ABqqqVsXQX488e.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-10","episode_number":6,"episode_type":"standard","id":1005902,"name":"European Cakes","overview":"Past halfway in their baking marathon and the remaining six bakers face three European cakes.  For their signature challenge the bakers are asked to bake yeast-leavened cakes; a tricky cross between cake and bread that sees some of the bakers opting out of Europe...  Mary sets the bakers their most demanding technical challenge yet in which they must make a Swedish princess torte. With 24 different stages and only two-and-a-quarter hours to do it in, the bakers have their work cut out for them, while Sue explores the events that led to the huge array of Danish cakes and pastries in the Danish cake table tradition.\n\nAnd finally, a showstopping finale that puts the hungry into Hungary... The bakers must make their own contemporary version of the dobos torte. Traditionally a multi-layered Hungarian cake, the bakers must go one step further and make a two-tiered dobos torte with an emphasis on all things caramel in every way they can imagine... but whose Bake Off will come to a sweet but sticky end?  On your marks, get set... bake!","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/fewPlPnx9G2LdiEZiWS9oZrzsXG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-17","episode_number":7,"episode_type":"standard","id":1008684,"name":"Pastry","overview":"Presenters Mel Giedroyc and Sue Perkins set the remaining contestants three tasks involving pastry, beginning by asking them to make signature savoury parcels. For the technical challenge, they must prepare a cake that hails from the Brittany region of France - the kouign amann, which none of the bakers has ever heard of - before creating two different types of eclair in the showstopper round.  Mary Berry and Paul Hollywood judge the hopefuls' efforts before deciding who is star baker and who is going home.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/c3kQeAGvLHNysL32XGraUUF9Tua.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-24","episode_number":8,"episode_type":"standard","id":1008685,"name":"Advanced Dough","overview":"The nation's favourite baking contest is about to get a whole lot hotter in the kitchen, as it reaches the quarter-final stage, and just five amateur bakers remain. They've all impressed to various extents during Bread Week - at least sufficiently to make it through - but now their skills are thoroughly tested as they take on enriched doughs. They have a signature bake in which they must work with soft dough to create artful works, a technical that sees them recreate an Eastern European cross between bread and pastry, and a showstopper involving doughnuts.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/3puSpBrboNXF7qze091xZxZQwCc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-01","episode_number":9,"episode_type":"standard","id":1010716,"name":"Semi-final - Patisserie","overview":"It's Patisserie Week, and the remaining four bakers will need to demonstrate that they have skills worthy enough to see them through to this year's final. The bakers are challenged to make a signature baklava - two types of any flavour they like, before the technical challenge demands they knock up a German Schichttorte, a cake cooked in stages under the grill to create 20 layers of different coloured sponge. Finally, the showstopper sees the semi-finalists baking non-stop to create two entremets in which they should demonstrate as many personal skills and techniques as they can.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/sfuMsFmCPG4MAklBrpw0VhxEA5y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-08","episode_number":10,"episode_type":"standard","id":1010717,"name":"The Final","overview":"The three finalists face a Signature Challenge in which they have just three hours to prove they have mastered a pastry technique that usually takes a whole day. They then have to tackle a Technical Challenge without the aid of a recipe, before rustling up a Showstopper that turns sponge, caramel, choux pastry and petits fours into a winning combination.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/amQZ0zMyEo2tmwcLlVSyCJPBEKq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-09","episode_number":11,"episode_type":"standard","id":1011439,"name":"Masterclass","overview":"After 10 weeks of stiff competition, calm finally descends on the Bake Off tent as judges Paul Hollywood and Mary Berry take up the reins to demonstrate how they would have tackled the contest's signature, technical and showstopper challenges had the roles been reversed. They begin with tasks from the first two weeks of the series, with Paul making a blackcurrant and liquorice Swiss roll and two types of savoury biscuits, while Mary prepares a cherry cake with lemon icing, Florentines and miniature classic coffee and walnut cakes.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-10","episode_number":12,"episode_type":"standard","id":1011440,"name":"Masterclass 2","overview":"Back in the Bake Off tent, Mary Berry and Paul Hollywood roll up their sleeves, baking the challenges that they set the bakers in bread and desserts weeks on the Great British Bake Off.\n\nPaul takes us through his ciabatta technical and his show-stopping roquefort and walnut loaf one step at a time and Mary shows us how to make her layered tiramisu cake from desserts week. Paul shows his saucy side with chocolate volcano fondant puds and Mary finishes off with her flamboyant neapolitan baked alaska.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-12","episode_number":13,"episode_type":"standard","id":1011441,"name":"Class of 2013","overview":"We catch up with last year's bakers, who have come a long way since their time in the tent.\n\nThis programme looks back at the golden moments - and recurring nightmares - of the bakers dozen from last year, as they revisit their time in the tent and share their memories as the Class of 2013.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-15","episode_number":14,"episode_type":"standard","id":1011442,"name":"Masterclass 3","overview":"Once again taking over the Bake Off tent, Mary and Paul tackle the signature, technical and show-stopper challenges from the second half of the series.\n\nJust as the challenges got harder for the bakers, Mary and Paul must also make their more elaborate bakes, showing us how to achieve the perfect results at home.\n\nMary makes a swirling chocolate and orange tart and the most complicated technical challenge of the series, the Swedish prinsesstarta. Paul dusts off his pastry skills making mini sausage plaits and demystifies the delicious kouign amann, which so baffled the bakers in the tent. Finally, Mary constructs her own version of the two-tiered dobos torte, complete with caramel of all kinds, with hints and tips on how to achieve perfection at home.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-16","episode_number":15,"episode_type":"standard","id":1011443,"name":"Masterclass 4","overview":"In the final masterclass of the series, Mary Berry and Paul Hollywood dust off the flour one last time, creating the signature, technical and show-stopping challenges from the last part of the Great British Bake Off.\n\nMary makes a pair of chouxs with her lemon and raspberry eclairs, while Paul gets fruity with his cherry and chocolate loaf. Paul explains how to stretch your skills to make the technical povitica, followed by his show-stopping raspberry and chocolate doughnuts. And Mary finishes with her elaborate double chocolate entremets that will impress at any dinner party, giving helpful advice to inspire you to achieve the same at home.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-16","episode_number":16,"episode_type":"finale","id":1033446,"name":"Christmas Masterclass 2014","overview":"In the countdown to Christmas, Mary and Paul are getting festive in the kitchen. They have six brand new recipes to bake for the family this Christmas, inspired by rich traditions from all over Europe.","production_code":"","runtime":60,"season_number":5,"show_id":34549,"still_path":"/hIc0bRO4IAzn231u9LnbqFyZ5SH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 5","overview":"The fifth series of The Great British Bake Off first aired on 6 August 2014, with twelve contestants. Mel Giedroyc and Sue Perkins presented the show and Mary Berry and Paul Hollywood returned as judges. Twelve contestants competed in this series, and the competition was held in Welford Park in Berkshire.\n\nThe programme was moved from BBC Two to BBC One starting this year, but the Masterclass episodes remained on BBC Two. A companion series, The Great British Bake Off: An Extra Slice, hosted by comedian Jo Brand, started this year on BBC Two.","id":62219,"poster_path":"/d2Nedau7VK5khyk70ZCOyDOCpwq.jpg","season_number":5,"vote_average":0},"6":{"_id":"55c269279251413ddc00060d","air_date":"2015-08-04","episodes":[{"air_date":"2015-08-05","episode_number":1,"episode_type":"standard","id":1095204,"name":"Cake","overview":"The 12 new bakers don their aprons and head for the iconic tent for cake week.","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":"/gW3oB6g1HzHCkTNR5lGLJKEMG0J.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-08-12","episode_number":2,"episode_type":"standard","id":1095205,"name":"Biscuits","overview":"With cake week over, the remaining bakers must prove themselves with biscuits.","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":"/1UQKC2mYpWjHcoIXeAYvUqHjHf6.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-08-19","episode_number":3,"episode_type":"standard","id":1096230,"name":"Bread","overview":"The ten remaining bakers tackle quick breads, baguettes and 3D bread sculptures.","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":"/ybjfI2PkBttxMPfliviwIIKjO9C.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-08-26","episode_number":4,"episode_type":"standard","id":1101123,"name":"Desserts","overview":"Three baked cheesecakes make up the showstopper.","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":"/fVgrce1WmAIZMKcom7e8DbRUFN2.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-09-02","episode_number":5,"episode_type":"standard","id":1103452,"name":"Alternative Ingredients","overview":"The remaining bakers must bake without sugar, gluten or dairy.","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-09-09","episode_number":6,"episode_type":"standard","id":1103542,"name":"Pastry","overview":"The bakers prove their pastry skills, making frangipane tarts, flaounes and vol-au-vents.","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-16","episode_number":7,"episode_type":"standard","id":1107415,"name":"Victorian","overview":"Season 6, Episode 7","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-09-23","episode_number":8,"episode_type":"standard","id":1109503,"name":"Patisserie","overview":"","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-09-30","episode_number":9,"episode_type":"standard","id":1111890,"name":"Chocolate","overview":"The pressure is on, as the remaining bakers must get to grips with one of the most difficult ingredients, chocolate.","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-10-07","episode_number":10,"episode_type":"standard","id":1111973,"name":"The Final","overview":"Only three of the original twelve bakers remain. They've made it to the final. Over 27 challenges, they've worked their way through every baking discipline Mary and Paul have thrown at them - from cakes to bread, pastry to puddings, and biscuits to chocolate. Along the way they have tackled recipes from the 70s and 80s, they've gone back to the Victorian era, they've made gluten-free bread, strange meringue concoctions, incredible constructions out of biscuits, bread and choux... They have all survived, and now they face their last three challenges. The signature challenge sees the finalists tackle enriched dough to create delicious filled iced buns. The technical requires them to conquer something they have all struggled with, and finally, for their last ever showstopper, they must make a classic British cake. Mary and Paul expect nothing short of perfection. So who will hold their nerve? Who will be crowned winner of The Great British Bake Off 2015? On your marks, get set... bake!","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-10-12","episode_number":11,"episode_type":"standard","id":1113370,"name":"Masterclass 1","overview":"After ten weeks of baking highs and lows, calm descends on the Bake Off tent as Mary and Paul take up the reins to make the signature, technical and showstopper challenges that they set the bakers in the first couple of weeks of the series. Step by step, they take us through the recipes, methods, tricks and tips to ensure that even the most amateur bakers can get it right at home every time. Mary kicks off with a classic madeira cake followed by her frosted walnut cake. Paul makes hazelnut and orange biscotti and shows us the right way to make the technically tricky arlettes. He then demonstrates how to make a foolproof plait. Mary provides a handy tip on how to stop ramekins from slipping in a bain marie and closes the show with her take on the retro classic black forest gateau.","production_code":"","runtime":55,"season_number":6,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-16","episode_number":12,"episode_type":"standard","id":1116623,"name":"Masterclass 2","overview":"Back in the Bake Off tent, Mary and Paul roll up their sleeves, baking the challenges that they set the bakers in Bread and Desserts weeks of the Great British Bake Off. Paul is in his element as he shows how to make soda bread in under an hour and then bakes baguettes, perhaps the most iconic of all French breads. Mary makes cappuccino creme brulees without a blow torch and creates the classic meringue cake which foxed the bakers in week 4 - the Spanische windtorte. Paul shows us how to decorate a pie and Mary reveals her tip for making a checkerboard cake before going on to bake a tiered white chocolate and raspberry cheesecake.","production_code":"","runtime":55,"season_number":6,"show_id":34549,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-10-19","episode_number":13,"episode_type":"standard","id":3484725,"name":"Masterclass 3","overview":"Mary Berry and Paul Hollywood make the challenges they set the bakers. Mary bakes her version of a sugar-free carrot cake and Paul makes a lime and passion fruit charlotte russe.","production_code":"","runtime":55,"season_number":6,"show_id":34549,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-10-23","episode_number":14,"episode_type":"standard","id":3484727,"name":"Masterclass 4","overview":"In the final masterclass of the series, Mary and Paul heat up the ovens and get out the mixing bowls one last time to create the signature, technical and showstopper challenges from the last part of the Great British Bake Off. Mary makes a tennis cake based on the 19th-century recipe that was the technical challenge from Victorian week. Paul makes two types of cream horns - the first filled with a mocha creme pat and the rest with a limoncello tutti frutti cream. Mary shows us how to be delicate, precise and perfect with her mokatines, and Paul gets to grips with an epic construction in choux pastry - le religieuse a l'ancienne.","production_code":"","runtime":56,"season_number":6,"show_id":34549,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-12-17","episode_number":15,"episode_type":"standard","id":3484728,"name":"Christmas Masterclass (2015)","overview":"After the drama and deliciousness of Bake Off, the much-missed Mary and Paul are back to bring a generous dollop of baking cheer to Christmas this year. Step by step, they take us through stunning recipes that all the family can make during the festive season. Mary kicks off with a pavlova wreath and Paul makes a Chelsea bun Christmas tree. Mary makes a decadent trifle layered with fruit compote and Paul puts leftovers to irresistible use with his turkey and ham pie. Mary makes a truly beautiful rosace a l'orange and Paul closes the show with his magnificent towering pandoro.","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2015-10-04","episode_number":16,"episode_type":"finale","id":4157773,"name":"The Class of 2014","overview":"We catch up with last year's bakers, who have come a long way since their time in the tent.\n\nThis programme looks back at the golden moments - and recurring nightmares - of the bakers dozen from last year, as they revisit their time in the tent and share their memories as the Class of 2014.","production_code":"","runtime":60,"season_number":6,"show_id":34549,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Series 6","overview":"The sixth series of The Great British Bake Off first aired on 5 August 2015, with twelve contestants competing to be the series 6 winner. Mel Giedroyc and Sue Perkins presented the show, and Mary Berry and Paul Hollywood returned as judges. The competition was held in the ground of Welford Park, Berkshire for a second year.","id":69330,"poster_path":"/6fOVnhFblCb722KQnXmpMSCD0KI.jpg","season_number":6,"vote_average":7.5},"7":{"_id":"57bc5901c3a3682e27009bef","air_date":"2016-08-21","episodes":[{"air_date":"2016-08-22","episode_number":1,"episode_type":"standard","id":1216779,"name":"Cake Week","overview":"Twelve new amateur bakers enter the iconic tent and take on three cake-making challenges.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":"/witpYCFikRhxJAF87QZ2s3nFjcL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-08-29","episode_number":2,"episode_type":"standard","id":1218520,"name":"Biscuit Week","overview":"The remaining bakers face three biscuit challenges. Who will see their dreams crumble?","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":"/8gfKnSBoAGML51Pe0C7IrR7pau.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-07","episode_number":3,"episode_type":"standard","id":1220782,"name":"Bread Week","overview":"The bakers face an ovenless technical challenge and a three-flour showstopper.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":"/iJqgjm0XgqGu2jxN0DPn3Ze2Gd7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-14","episode_number":4,"episode_type":"standard","id":1222966,"name":"Batter Week","overview":"Mary and Paul have set three challenges to test the bakers on some store cupboard classics.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":"/b7e0hZOmcU82OD7kD1XXJ9HRYqt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-22","episode_number":5,"episode_type":"standard","id":1224972,"name":"Pastry Week","overview":"It is Pastry Week, and with just eight bakers left, Mary and Paul are looking for perfection. They have set three challenges to test the bakers on three very different types of pastry. For the signature challenge it is breakfast time, Danish style.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":"/ojBX6LxHNaiovulHwC71U3HNCiZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-28","episode_number":6,"episode_type":"standard","id":1227247,"name":"Botanical Week","overview":"Mary and Paul set three challenges inspired by nature for Botanical Week.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":"/7xIL8I1D8BvYgAoObrk9aeXGFoS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-05","episode_number":7,"episode_type":"standard","id":1229158,"name":"Dessert Week","overview":"The bakers face three sweet challenges, including a mousse marathon showstopper.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-12","episode_number":8,"episode_type":"standard","id":1229159,"name":"Tudor Week","overview":"For the first ever Tudor Week, the bakers face pies, biscuits and a marzipan showstopper.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-19","episode_number":9,"episode_type":"standard","id":1232961,"name":"Patisserie Week","overview":"The semi-final sees the bakers tackling three patisserie-based challenges.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-26","episode_number":10,"episode_type":"standard","id":1234162,"name":"The Final","overview":"It is the final, and with just three of the original twelve bakers remaining. The theme for the final is a Royal Bake Off, as the tent plays host to three challenges to impress the Queen.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-27","episode_number":11,"episode_type":"finale","id":1234172,"name":"Class of 2015","overview":"A catch-up with the contestants from The Great British Bake Off 2015.","production_code":"","runtime":60,"season_number":7,"show_id":34549,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 7","overview":"The seventh series of The Great British Bake Off aired from 24 August 2016, with twelve contestants competing to be crowned the series 7 winner.\n\nThis series was the last to be broadcast on BBC One, as the production company Love Productions opted to move the show to Channel 4. As such, it was also the last series to feature Sue Perkins, Mel Giedroyc, and Mary Berry.\n\nIn the United States, the seventh series was broadcast as the fourth season on PBS and streamed as Collection 4 on Netflix.","id":79474,"poster_path":"/rhxYkx3rInFRtHkZyfqOTe5Nxup.jpg","season_number":7,"vote_average":0}}}