{"adult":false,"backdrop_path":"/nyES3eO3F5VlD7FJE1iJ5QKgDIW.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2005-09-26","genres":[{"id":35,"name":"Comedy"},{"id":10764,"name":"Reality"}],"homepage":"http://www.worstdriver.ca","id":34638,"in_production":false,"languages":["en"],"last_air_date":"2018-12-17","last_episode_to_air":{"id":1992034,"name":"The Final Three","overview":"Three of the country's most delinquent drivers attempt their final challenges; Canada's worst driver is named.","vote_average":0,"vote_count":0,"air_date":"2018-12-17","episode_number":8,"episode_type":"finale","production_code":"","runtime":60,"season_number":14,"show_id":34638,"still_path":null},"name":"Canada's Worst Driver","next_episode_to_air":null,"networks":[{"id":106,"logo_path":"/cjw4Msu4fkMWOsV6LlA7x8ZOQ1l.png","name":"Discovery","origin_country":"CA"}],"number_of_episodes":113,"number_of_seasons":14,"origin_country":["CA"],"original_language":"en","original_name":"Canada's Worst Driver","overview":"Canada's Worst Driver is a Canadian television series on Discovery Channel, based on Britain's Worst Driver, and is part of the Worst Driver television franchise. It and sister series Canada's Worst Handyman are the two highest-rated programs on Discovery Channel. The series is produced by Proper Television, whose president, Guy O'Sullivan, was the director for the original Britain's Worst Driver series; as such, Canada's Worst Driver is considered to be the production company's flagship show.\n\nUnlike other Worst series around the world, the Canadian version emphasizes the learning process of the contestants and the science of driving, and as such is often more serious than the other Worst shows around the world, which are mainly played for laughs. It is the longest running of any Worst series to date.\n\nThe series is also aired dubbed in French in Canada, as the Les zéros de conduite on Canal D.","popularity":5.79,"poster_path":"/xWk9KojwlrfPEi67hU3iNJdUZVA.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2012-10-28","episode_count":2,"id":45372,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2005-10-02","episode_count":8,"id":45370,"name":"Season 1","overview":"","poster_path":"/nFKaAFW9Dz489AtjZWas4aCaNpt.jpg","season_number":1,"vote_average":0},{"air_date":"2006-10-16","episode_count":8,"id":45366,"name":"Season 2","overview":"Canada's Worst Driver 2 is the second season of Canada's Worst Driver, a Discovery Channel Canada television series which seeks to improve the driving skills of eight selected contestants, who are also trying to avoid being named the show's eponymous and dubious title. In this series, eight contestants and their nominators arrive at the Driver Rehabilitation Centre, located on the grounds of CFB Borden, where the contestants' keys are confiscated. Over the course of several weeks, the contestants take on challenges designed to improve their driving skills. Starting with the second episode and at the end of each subsequent episode thereafter, the most improved driver, as determined by host Andrew Younghusband and a panel of judges, may choose to graduate a contestant, in which case the contestant is no longer considered to be in the running for Canada's Worst Driver. This continues until three contestants remain, where one final challenge will determine who among them is Canada's Worst Driver. Unlike the previous season, which focused on winter driving conditions, this season focuses on summer driving skills. Also, the Driver Rehabilitation Program is one week shorter, guaranteeing that at least three contestants remain in the final episode.","poster_path":"/oIvuFZDbQx8AzlT6kAT489eUfZC.jpg","season_number":2,"vote_average":0},{"air_date":"2007-10-29","episode_count":8,"id":45371,"name":"Season 3","overview":"Canada's Worst Driver 3 is the third season of Canada's Worst Driver, a Discovery Channel Canada television series which seeks to improve the driving of eight nominated contestants, each of which trying to avoid being named Canada's Worst Driver. Like the two previous seasons, eight contestants and their nominators arrive at the Driver Rehabilitation Centre, which in this season is the ghost town of Edgar, Ontario, north of Barrie. Starting with the second episode, one driver \"graduates\" from the rehabilitation program and is eliminated from contention for the series' dubious title. This proceeds until three contestants remain, when a final challenge will take place, and one is given the title of Canada's Worst Driver. Unlike the two previous seasons, however, the focus of this season is on extreme driving, in the hope that knowledge of these techniques will help them become more confident and competent at the wheel. Also unlike the two previous seasons, the contestants' driver's licenses are confiscated instead of their keys.","poster_path":"/9gn4wUsUlnpnW8qUE40E9L4XI7R.jpg","season_number":3,"vote_average":0},{"air_date":"2008-10-27","episode_count":8,"id":45365,"name":"Season 4","overview":"Canada's Worst Driver 4 is the fourth season of Canada's Worst Driver, a Discovery Channel Canada television series which seeks to improve the driving of eight nominated contestants, each of which trying to avoid being named Canada's Worst Driver. Like previous series, each contestant is nominated by a loved one, and are taken to the Driver Rehabilitation Centre, located this year at an abandoned correctional facility in Guelph, Ontario. At the rehabilitation centre, each contestant is taught key driving skills, and are tested in various challenges, with three challenges to an episode. Before each challenge, host Andrew Younghusband performs each challenge to demonstrate that they are doable without error by an average driver. The first episode, where the contestants must drive to the Driver Rehabilitation Centre from a location an hour's drive away in the traditional first challenge, serves as a skills evaluation. Starting with the second episode, and at the end of every episode thereafter, the experts and Andrew decide on which of the remaining contestants have been sufficiently rehabilitated to be let go onto public roads. This continues until three contestants remain, where two traditional final challenges determine who is named Canada's Worst Driver. Though normally one contestant leaves in every episode, the experts may, at their discretion, refuse to allow anyone to graduate, or conversely graduate more than one contestant in an episode. In extreme circumstances, the experts may also choose to expel a contestant with no intention of improving their driving skills. This year, like the previous season, roughly half of the challenges are new to the series, while the other half, such as the initial drive to the Driver Rehabilitation Centre, the Eye of the Needle, the Water-Tank Challenge, the Mega-Challenge, and the series-ending road test, are returning from previous seasons. However, the challenges this season are more specifically tuned for the individual contestants than in previous years, to better address driving issues specific to each contestant. For this year, a fleet of brand-new luxury cars have been commissioned for some of the challenges.","poster_path":"/wClrcCMJPZHIlsLXVEMKGMJAHq4.jpg","season_number":4,"vote_average":0},{"air_date":"2009-10-26","episode_count":8,"id":45367,"name":"Season 5","overview":"Canada's Worst Driver 5 is the fifth season of Canada's Worst Driver, the Canadian automotive television series on Discovery Channel which seeks to improve the skills of eight of the worst motorists in Canada.\n\nIn this season, the eight contestants are taken to the Driver Rehabilitation Centre in CFB Borden, which had been previously used in Canada's Worst Driver 2. Unlike Canada's Worst Driver 2, however, it is only referred to on-air as an \"undisclosed military location\".\n\nThe series launch was set to coincide with the launch of a new law in Ontario prohibiting the use of handheld electronic devices while driving. Similar bans have been instituted in Atlantic Canada and Quebec, with Manitoba and Saskatchewan considering similar laws. This season will also be the second to be featured on the iTunes Store and the first to have new episodes one day after first airing.","poster_path":"/82ELS9bisOxHUeqkWpLSdTKJCho.jpg","season_number":5,"vote_average":0},{"air_date":"2010-10-25","episode_count":8,"id":45368,"name":"Season 6","overview":"Canada's Worst Driver 6 is the sixth season of the Canada's Worst Driver series, where eight contestants known by those close to them for being bad drivers are taught lessons on improving their driving skills. As with previous seasons, the contestants are taken to the Driver Rehabilitation Centre, which takes place this year at Dunnville Airport in Dunnville, Ontario. The season finale is slated to be in Niagara Falls, Ontario for the first time this year.\n\nFor this season, a new series logo has been commissioned, coinciding with an increase in fundamentals of high-performance driving in the lessons this year.","poster_path":"/vky7nAm6Zwodxtk0BQJ1ZdCsr1F.jpg","season_number":6,"vote_average":0},{"air_date":"2011-10-24","episode_count":8,"id":45373,"name":"Season 7","overview":"","poster_path":"/9Llqij373KHg1JVeQvYwgZKIi8V.jpg","season_number":7,"vote_average":0},{"air_date":"2012-10-29","episode_count":8,"id":45369,"name":"Season 8","overview":"","poster_path":"/nPAfUlQOeCfq3umTfAmmVP4Rvfu.jpg","season_number":8,"vote_average":0},{"air_date":"2013-10-28","episode_count":9,"id":71620,"name":"Canada's Worst Driver Ever","overview":"Nine of the country's most appalling drivers from past seasons of Canada's Worst Driver return to the Rehab Centre. After safely driving their nominators to the Rehab Centre, it's up to each driver to prove that they possess the necessary driving skills to finally graduate from the Rehab Centre.","poster_path":"/t6fjzkd8D4PrwB65QSJjsIMthYr.jpg","season_number":9,"vote_average":0},{"air_date":"2014-10-27","episode_count":8,"id":71621,"name":"Season 10","overview":"","poster_path":"/4bpiRQkzJ52zx3MScx1guPYEADf.jpg","season_number":10,"vote_average":0},{"air_date":"2015-10-26","episode_count":8,"id":71765,"name":"Season 11","overview":"","poster_path":null,"season_number":11,"vote_average":0},{"air_date":"2016-10-24","episode_count":8,"id":81376,"name":"Season 12","overview":"","poster_path":null,"season_number":12,"vote_average":0},{"air_date":"2017-10-23","episode_count":8,"id":112003,"name":"Season 13","overview":"","poster_path":null,"season_number":13,"vote_average":0},{"air_date":"2018-10-29","episode_count":8,"id":112004,"name":"Season 14","overview":"","poster_path":null,"season_number":14,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.1,"vote_count":8,"season_data":{"1":{"_id":"5258d96a760ee3466172845b","air_date":"2005-10-02","episodes":[{"air_date":"2005-10-02","episode_number":1,"episode_type":"standard","id":789265,"name":"Episode 1","overview":"For the first episode we are introduced to the eight driver's and the people who nominated them for the show. As well as the the team of experts assigned to help make each person a better driver. The challenges included the drive to the Rehab Centre and Stopping.","production_code":"","runtime":60,"season_number":1,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-02","episode_number":2,"episode_type":"standard","id":789267,"name":"Episode 2","overview":"In episode two the learning process begins with a challenge on how to handle a car, by using a sunroof and a tank of water. The wetter you were the worse you did. Next challenge was parallel parking with a twist it had to be done with a fire hose simulating rain. The last challenge of the show was night driving through an obstacle course.","production_code":"","runtime":60,"season_number":1,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-10","episode_number":3,"episode_type":"standard","id":789263,"name":"Episode 3","overview":"With one driver gone an seven left episode three starts off a little backwards or should I say reverse. Challenge number one of the show is reversing when confronted by a tractor on a one way street. This challenge gives the drivers a jump start on the second challenge of the day which is there knowledge and the mechanics of the 3 point turn. The last challenge is a fun one it’s called “Eye of the Needle”. The contestants have to drive at 60 km/h or above in a straight trying not to hit any boxes on either side of there car.","production_code":"","runtime":60,"season_number":1,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-17","episode_number":4,"episode_type":"standard","id":789264,"name":"Episode 4","overview":"With three new challenges and only 5 drivers left the bad are leaving and the terrible are the only ones left. The first challenge makes the drivers drive a big yellow truck backwards through an obstacle course. The second challenge puts Canada’s worst drivers in the passenger seat in a blindfold navigation challenge, where the nominators are force to driver blindfold as the contestants tell them where to go. The last challenge was drive a standard car up a hill without stalling it.","production_code":"","runtime":60,"season_number":1,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-24","episode_number":5,"episode_type":"standard","id":789269,"name":"Episode 5","overview":"In this episode of Canada’s worst drivers, the worst drivers have to try to turn the corner. Then, the drivers have experience parking lot chaos and the results are a clumsy ballet of bumps, blows and menacing moves. Is the panel of experts ready to let one of Canada's worst driver go?","production_code":"","runtime":60,"season_number":1,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-31","episode_number":6,"episode_type":"standard","id":789262,"name":"Episode 6","overview":"In this episode, the worst drivers must manoeuvre a van, that’s packed full of breakables objects, through an obstacle course. Then, they are given directions to go from point A to point B, and to find their way through a city. Has anyone earned the right to graduate from the Driver’s Rehabilitation Centre in this episode?","production_code":"","runtime":60,"season_number":1,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-07","episode_number":7,"episode_type":"standard","id":789266,"name":"Episode 7","overview":"Today, the remaining drivers have to get behind the wheel of a pickup truck and maneuver through an obstacle course.","production_code":"","runtime":60,"season_number":1,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-11-14","episode_number":8,"episode_type":"finale","id":789268,"name":"Episode 8","overview":"In the final episode of this season of Canada's Worst Driver. The remaining drivers have to face the biggest challenge yet -- driving in the streets of Old Montreal. At the end of the episode, Canada's worst driver will be revealed.","production_code":"","runtime":60,"season_number":1,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":45370,"poster_path":"/nFKaAFW9Dz489AtjZWas4aCaNpt.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258d96a760ee3466172842f","air_date":"2006-10-16","episodes":[{"air_date":"2006-10-16","episode_number":1,"episode_type":"standard","id":789231,"name":"Episode 1","overview":"A new wave of Canada's worst drivers arrived!","production_code":"","runtime":60,"season_number":2,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-23","episode_number":2,"episode_type":"standard","id":789233,"name":"Episode 2","overview":"Our new candidates to Canada's worst driver title have to face challenges involving parallel parking, lane control, and reversing. Has anyone improved enough to graduate from the Driver's Rehabilitation Centre?","production_code":"","runtime":60,"season_number":2,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-30","episode_number":3,"episode_type":"standard","id":789232,"name":"Episode 3","overview":"In this episode of Canada's worst drivers, the candidates are going back to the basic of driving and have to learn road sign recognition and reversing in a straight line.","production_code":"","runtime":60,"season_number":2,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-06","episode_number":4,"episode_type":"standard","id":789230,"name":"Episode 4","overview":"In this episode, Canada's worst driver have to take a smooth driving course, but it turns into a shower of failure. They also have to test their navigation skills in a navigational challenge.","production_code":"","runtime":60,"season_number":2,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-13","episode_number":5,"episode_type":"standard","id":789235,"name":"Episode 5","overview":"Canada's worst drivers try to turn the corner - but it's not that easy when they're in the middle of a moat. Then, they dare to navigate the public roads at night, searching for party supplies as well as their dignity. Finally, the remaining drivers screech and steer their way through a speed slalom course full of surprises. As always, the panel of experts watch the play-by-play to decide which driver - if any - will be merging back onto Canadian roads.","production_code":"","runtime":60,"season_number":2,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-20","episode_number":6,"episode_type":"standard","id":789234,"name":"Episode 6","overview":"By now, these pitiful drivers are begging to leave the Drivers Rehabilitation Centre. But first, they must face their fears in an off road course through the Rehab Center's very own desert. Then they encounter blindfolds and a very challenging stick shift.","production_code":"","runtime":60,"season_number":2,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-27","episode_number":7,"episode_type":"standard","id":789237,"name":"Episode 7","overview":"This final episode of crashes, crunches and driver destruction answers just that: Our last three drivers take turns parking a tent trailer, redefining the term \"jack-knife\". Then it's on to the daunting Mega Challenge, before they are released onto the ultimate driving challenge - downtown Toronto! The time has come for the team of experts to single out the worst of the worst as one unlucky driver is given the dubious title this season of Canada's Worst Driver.","production_code":"","runtime":60,"season_number":2,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-04","episode_number":8,"episode_type":"finale","id":789236,"name":"Episode 8","overview":"This special episode follows each driver's personal journey in rehab – from the first drive to the Driver's Rehabilitation Centre to the rush-hour road finale in downtown Toronto - we also look back at the breakthroughs and breakdowns that made the drivers' experiences so unforgettable.","production_code":"","runtime":60,"season_number":2,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"Canada's Worst Driver 2 is the second season of Canada's Worst Driver, a Discovery Channel Canada television series which seeks to improve the driving skills of eight selected contestants, who are also trying to avoid being named the show's eponymous and dubious title. In this series, eight contestants and their nominators arrive at the Driver Rehabilitation Centre, located on the grounds of CFB Borden, where the contestants' keys are confiscated. Over the course of several weeks, the contestants take on challenges designed to improve their driving skills. Starting with the second episode and at the end of each subsequent episode thereafter, the most improved driver, as determined by host Andrew Younghusband and a panel of judges, may choose to graduate a contestant, in which case the contestant is no longer considered to be in the running for Canada's Worst Driver. This continues until three contestants remain, where one final challenge will determine who among them is Canada's Worst Driver. Unlike the previous season, which focused on winter driving conditions, this season focuses on summer driving skills. Also, the Driver Rehabilitation Program is one week shorter, guaranteeing that at least three contestants remain in the final episode.","id":45366,"poster_path":"/oIvuFZDbQx8AzlT6kAT489eUfZC.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258d96a760ee34661728466","air_date":"2007-10-29","episodes":[{"air_date":"2007-10-29","episode_number":1,"episode_type":"standard","id":789270,"name":"Rock Bottom","overview":"Another eight dangerous, yet licensed, drivers are brought to the Driver Rehabilitation Center. Who will be declared Canada's Worst Driver for 2007?","production_code":"","runtime":60,"season_number":3,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-05","episode_number":2,"episode_type":"standard","id":789271,"name":"Car Confidential","overview":"The only thing they have to fear is fear itself...and each other.","production_code":"","runtime":60,"season_number":3,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-12","episode_number":3,"episode_type":"standard","id":789272,"name":"Cool Bus","overview":"Parallel parking? No problem! Parallel parking a school bus? Ummmmmmm....","production_code":"","runtime":60,"season_number":3,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-19","episode_number":4,"episode_type":"standard","id":789275,"name":"Skid Marks","overview":"Possibly the most bizarre driving test ever conceived: the two-car teeter-totter.","production_code":"","runtime":60,"season_number":3,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-26","episode_number":5,"episode_type":"standard","id":789273,"name":"Bumpy Road Ahead","overview":"The remaining five contenders for the title of Canada's Worst Driver must learn how to deal with off-road conditions.","production_code":"","runtime":60,"season_number":3,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-03","episode_number":6,"episode_type":"standard","id":789274,"name":"Unhappy Trails","overview":"The final four learn how to maneuver with a trailer hitch....or not.","production_code":"","runtime":60,"season_number":3,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-10","episode_number":7,"episode_type":"standard","id":789276,"name":"Road Test","overview":"The final three drivers in the Drivers Rehabilitation Center are taken for their final test: the roads of Ontario.","production_code":"","runtime":60,"season_number":3,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-17","episode_number":8,"episode_type":"finale","id":789277,"name":"101 Problems on Canadian Roads","overview":"Andrew Younghusband counts down the 101 most common mistakes perpetrated by motorists today. Almost all of these mistakes will earn you a traffic ticket...if you're lucky.","production_code":"","runtime":60,"season_number":3,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"Canada's Worst Driver 3 is the third season of Canada's Worst Driver, a Discovery Channel Canada television series which seeks to improve the driving of eight nominated contestants, each of which trying to avoid being named Canada's Worst Driver. Like the two previous seasons, eight contestants and their nominators arrive at the Driver Rehabilitation Centre, which in this season is the ghost town of Edgar, Ontario, north of Barrie. Starting with the second episode, one driver \"graduates\" from the rehabilitation program and is eliminated from contention for the series' dubious title. This proceeds until three contestants remain, when a final challenge will take place, and one is given the title of Canada's Worst Driver. Unlike the two previous seasons, however, the focus of this season is on extreme driving, in the hope that knowledge of these techniques will help them become more confident and competent at the wheel. Also unlike the two previous seasons, the contestants' driver's licenses are confiscated instead of their keys.","id":45371,"poster_path":"/9gn4wUsUlnpnW8qUE40E9L4XI7R.jpg","season_number":3,"vote_average":0},"4":{"_id":"5258d96a760ee3466172841c","air_date":"2008-10-27","episodes":[{"air_date":"2008-10-27","episode_number":1,"episode_type":"standard","id":959491,"name":"Guilty As Charged","overview":"A new group of dangerous drivers come to the Driver Rehabilitation Center to try and work out their personal driving issues and avoid being named Canada's Worst Driver.","production_code":"","runtime":60,"season_number":4,"show_id":34638,"still_path":"/nvgE0RbIuPl9aMFV5r7gcBrKQtL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-03","episode_number":2,"episode_type":"standard","id":789229,"name":"Big Manoeuvres","overview":"This week, the nominees learn to handle a large delivery truck, how to corner on ice and how to parallel park on an actual city street.","production_code":"","runtime":60,"season_number":4,"show_id":34638,"still_path":"/jTuuWk3nzLhsYET1Al4JpPhcRth.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-10","episode_number":3,"episode_type":"standard","id":957340,"name":"The Urge to Merge","overview":"The nominees find themselves being tested on a basic driving skill: merging in traffic. However, when the nation's worst drivers are involved, anything can happen.","production_code":"","runtime":60,"season_number":4,"show_id":34638,"still_path":"/hyFYj21DbMo0jXS71nyFz5TwuHt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-17","episode_number":4,"episode_type":"standard","id":959978,"name":"Shifty Manoeuvres","overview":"Our six remaining drivers still stuck in rehab get thrown in the deep end in this episode dedicated entirely to driving stick.","production_code":"","runtime":60,"season_number":4,"show_id":34638,"still_path":"/rmcnAGv7qo0Y9HuZMRYrOCrNRrp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-24","episode_number":5,"episode_type":"standard","id":957341,"name":"A Turn for the Worst","overview":"In an episode devoted entirely to smooth turning, the first order of business for our 5 remaining drivers is a lesson in the dangers of distracted driving.","production_code":"","runtime":60,"season_number":4,"show_id":34638,"still_path":"/knhW6h05TzZdJgL37SPEm6hHG6P.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-01","episode_number":6,"episode_type":"standard","id":957342,"name":"It's All Reverse","overview":"Everything goes backwards for our 5 remaining drivers in this all reversing episode.","production_code":"","runtime":60,"season_number":4,"show_id":34638,"still_path":"/xZmnq2K316KpgScCcpRevjLgrB8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-08","episode_number":7,"episode_type":"standard","id":957343,"name":"Practice Makes Perfect","overview":"The final four drivers tackle some of the toughest challenges they've seen in rehab to date.","production_code":"","runtime":60,"season_number":4,"show_id":34638,"still_path":"/q47swhz5sdej01sx4BjSI9s2N6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-15","episode_number":8,"episode_type":"finale","id":959490,"name":"The Verdict","overview":"In this final episode of the series, the remaining three face some of the biggest challenges in the show's four-year history.","production_code":"","runtime":60,"season_number":4,"show_id":34638,"still_path":"/cXU2TUu25fL7YJu4GF7NR6x64VA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"Canada's Worst Driver 4 is the fourth season of Canada's Worst Driver, a Discovery Channel Canada television series which seeks to improve the driving of eight nominated contestants, each of which trying to avoid being named Canada's Worst Driver. Like previous series, each contestant is nominated by a loved one, and are taken to the Driver Rehabilitation Centre, located this year at an abandoned correctional facility in Guelph, Ontario. At the rehabilitation centre, each contestant is taught key driving skills, and are tested in various challenges, with three challenges to an episode. Before each challenge, host Andrew Younghusband performs each challenge to demonstrate that they are doable without error by an average driver. The first episode, where the contestants must drive to the Driver Rehabilitation Centre from a location an hour's drive away in the traditional first challenge, serves as a skills evaluation. Starting with the second episode, and at the end of every episode thereafter, the experts and Andrew decide on which of the remaining contestants have been sufficiently rehabilitated to be let go onto public roads. This continues until three contestants remain, where two traditional final challenges determine who is named Canada's Worst Driver. Though normally one contestant leaves in every episode, the experts may, at their discretion, refuse to allow anyone to graduate, or conversely graduate more than one contestant in an episode. In extreme circumstances, the experts may also choose to expel a contestant with no intention of improving their driving skills. This year, like the previous season, roughly half of the challenges are new to the series, while the other half, such as the initial drive to the Driver Rehabilitation Centre, the Eye of the Needle, the Water-Tank Challenge, the Mega-Challenge, and the series-ending road test, are returning from previous seasons. However, the challenges this season are more specifically tuned for the individual contestants than in previous years, to better address driving issues specific to each contestant. For this year, a fleet of brand-new luxury cars have been commissioned for some of the challenges.","id":45365,"poster_path":"/wClrcCMJPZHIlsLXVEMKGMJAHq4.jpg","season_number":4,"vote_average":0},"5":{"_id":"5258d96a760ee3466172843a","air_date":"2009-10-26","episodes":[{"air_date":"2009-10-26","episode_number":1,"episode_type":"standard","id":789240,"name":"Basic Training","overview":"Eight of the country's most appalling drivers and their nominators begin the rehabilitation process by first driving to The Rehab Centre, situated at an undisclosed Ontario military location.\n\nThis year's drivers begin their Basic Training with some skills evaluation. Our Basic Assessment Challenge reveals a dreadful lack of even the most fundamental driving abilities in all of the candidates.\n\nOur group of experts considers this bunch to be the worst group of drivers we've ever had at the Driver's Rehabilitation Centre, and it's anybody's guess at this point as to who ultimately will be branded Canada's Worst Driver.","production_code":"","runtime":60,"season_number":5,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-02","episode_number":2,"episode_type":"standard","id":789238,"name":"Standard Manoeuvres","overview":"This episode, our bad drivers must use the eyes in the back of their heads. Their mission: to shoulder check successfully without causing a crash. The Basic Training continues as our 8 hazardous drivers head off to see the doctor who puts their eyesight, reflexes and mental agility put to the test.\n\nLater, the pressure rises as the drivers attempt to drive and Parallel Park a stick shift vehicle in our off-road course - without stalling. That's the idea anyway. Finally, they take on the infamous Reverse Figure 8 challenge, only this year they will be driving ALL their fellow participants around in a limousine.\n\nOne driver graduates after showing significant improvement and our experts continue to watch closely to determine who will be Canada's Worst Driver.","production_code":"","runtime":60,"season_number":5,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-09","episode_number":3,"episode_type":"standard","id":789239,"name":"Head to Head Combat","overview":"With such a poor showing at the first reverse challenge, the remaining 7 drivers attempt another reversing challenge.\n\nThis time they will be going head to head around a tricky Reverse Figure 8. Next, our drivers attempt to decipher the meaning of road signs. You'll be amazed at some of the answers! Later, it's tight manoeuvring as they attempt to move a car laterally in our S-turn Challenge. Finally, our drivers put the pedal to the medal as they demonstrate their driving abilities - or lack there of - in the infamous Eye of the Needle Challenge.\n\nOur driving experts quickly realize that basic manoeuvring is not a strong point for Canada's Worst Drivers. One driver is sent home and the experts continue to scrutinize as the search continues for Canada's Worst Driver.","production_code":"","runtime":60,"season_number":5,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-16","episode_number":4,"episode_type":"standard","id":789241,"name":"Tanked","overview":"In this episode, the six remaining drivers still stuck in Rehab find themselves preoccupied as they manoeuvre and multi-task their way through the Distraction Demonstration.\n\nNext, our abysmal drivers are going in circles as they attempt to execute Drifting Donuts. Finally, an old favourite is back and our drivers attempt to drive as smoothly as possible through the trusty Water Tank Challenge. It turns out the final six wind up very wet behind the ears when it comes to smooth driving.\n\nAs our drivers towel off, our panel of experts make their decision. Another driver heads home and we continue the search for Canada's Worst Driver.","production_code":"","runtime":60,"season_number":5,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-23","episode_number":5,"episode_type":"standard","id":789242,"name":"Close to Home","overview":"In this episode, the six remaining drivers begin with the basics...mastering the 4 steps of a perfect lane change.\n\nSound simple but guess what? It isn't. Then as day becomes night, it's not over for our abysmal 6 as they are dropped off in the middle of nowhere.\n\nTheir mission: to find their way back to their hotel in our Night Time Navigational Challenge. Finally, our drivers learn the fastest way to turn around as they try to master the perfect Hand Brake J-Turn.\n\nOne driver avoids the title and returns to public roads. Our experts continue to watch closely to determine who will be Canada's Worst Driver.","production_code":"","runtime":60,"season_number":5,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-30","episode_number":6,"episode_type":"standard","id":789243,"name":"Riding the Rails","overview":"The bad driving continues this episode as our remaining 5 drivers learn the fastest way to turn around and attempt a Reverse 180 Turn.\n\nNext, the drivers must know where their wheels are at all times as they try to ride the rails in a challenge called the Trough. Later, our drivers try their hand at a new found sport at the rehab centre. They go head to head in the first Shopping Cart Hockey shoot out at rehab. Finally with trailer in tow, our remaining drivers attempt to tow and reverse not one, but two trailers at the same time.\n\nAt the end of this episode, one lucky driver graduates and our experts narrow the field to 4, in the search for Canada's Worst Driver.","production_code":"","runtime":60,"season_number":5,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-07","episode_number":7,"episode_type":"standard","id":789244,"name":"Uphill Battle","overview":"The final four drivers tackle some of the toughest challenges they've seen in rehab to date.\n\nIt all begins as the remaining drivers get behind the wheel of a powerful 4x4 and attempt to complete an Off Road Challenge. With last episode's result being so poor, we revisit the \"know where your wheels are challenge\". The twist - our final four must complete The Trough in reverse.\n\nFinally, our final four learn the skills needed for a high speed Swerve and Avoid. The results are disastrous. It's an explosive episode you don't want to miss.\n\nAt the end of this episode, one lucky driver graduates avoiding the title and our experts narrow the field to the 3 finalists in the search for Canada's Worst Driver.","production_code":"","runtime":60,"season_number":5,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-14","episode_number":8,"episode_type":"finale","id":789245,"name":"Judgment","overview":"In this final episode of the series, the remaining three face some of the biggest challenges in the show's history.\n\nFirst, our atrocious trio attempt the Reverse Serpentine Challenge. It sounds simple enough, and it should be, except for the simple fact that these are the absolute worst of Canada's worst drivers.\n\nThen it's the Mega Challenge - which combines the most challenging aspects of every course our drivers have faced across the series. Finally the drivers take their final exam: a drive through the City of Toronto during rush hour, with Andrew as their passenger!\n\nWatch this exciting final episode to find out who escapes national humiliation... and who is finally named Canada's Worst Driver.","production_code":"","runtime":60,"season_number":5,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"Canada's Worst Driver 5 is the fifth season of Canada's Worst Driver, the Canadian automotive television series on Discovery Channel which seeks to improve the skills of eight of the worst motorists in Canada.\n\nIn this season, the eight contestants are taken to the Driver Rehabilitation Centre in CFB Borden, which had been previously used in Canada's Worst Driver 2. Unlike Canada's Worst Driver 2, however, it is only referred to on-air as an \"undisclosed military location\".\n\nThe series launch was set to coincide with the launch of a new law in Ontario prohibiting the use of handheld electronic devices while driving. Similar bans have been instituted in Atlantic Canada and Quebec, with Manitoba and Saskatchewan considering similar laws. This season will also be the second to be featured on the iTunes Store and the first to have new episodes one day after first airing.","id":45367,"poster_path":"/82ELS9bisOxHUeqkWpLSdTKJCho.jpg","season_number":5,"vote_average":0},"6":{"_id":"5258d96a760ee34661728445","air_date":"2010-10-25","episodes":[{"air_date":"2010-10-25","episode_number":1,"episode_type":"standard","id":789246,"name":"Ready, Set, Go!","overview":"The newest batch of bad drivers arrive near the town of Dunnvlle, Ontario to begin the process of determining who is Canada's Worst Driver for this season.","production_code":"","runtime":60,"season_number":6,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-01","episode_number":2,"episode_type":"standard","id":789247,"name":"Driving Blind","overview":"The nominees learn how to back up a recreational vehicle and check their blindsides while driving down a course.","production_code":"","runtime":60,"season_number":6,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-08","episode_number":3,"episode_type":"standard","id":789248,"name":"Up in Smoke","overview":"Nominees participate in challenges that involve a teeter totter for cars and a braking in a tight corner. One nominee gets bogged down in a mud pit in an outdoor challenge.","production_code":"","runtime":60,"season_number":6,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-15","episode_number":4,"episode_type":"standard","id":789249,"name":"Wet Behind the Gears","overview":"The nominees attempt to navigate a reverse figure eight course, drive through a high speed slalom and take on the annual water tank challenge.","production_code":"","runtime":60,"season_number":6,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-22","episode_number":5,"episode_type":"standard","id":789250,"name":"Episode 5","overview":"The nominees learn how to avoid suddenly appearing objects, how to do donuts in their cars and take on the lane changing challenge, where tempers threaten to boil over.","production_code":"","runtime":60,"season_number":6,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-29","episode_number":6,"episode_type":"standard","id":789251,"name":"Episode 6","overview":"The remaining nominees take on the annual \"Eye of the Needle\" challenge, attempt to back up towing a trailer and drive out of a tight spot.","production_code":"","runtime":60,"season_number":6,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-06","episode_number":7,"episode_type":"standard","id":789252,"name":"Episode 7","overview":"The three finalists take part in the annual \"mega challenge\" and individual road tests before the title of Canada's Worst Driver is awarded to one of them.","production_code":"","runtime":60,"season_number":6,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-13","episode_number":8,"episode_type":"finale","id":789253,"name":"Episode 8","overview":"The three finalists take part in the annual \"mega challenge\" and individual road tests before the title of Canada's Worst Driver is awarded to one of them.","production_code":"","runtime":60,"season_number":6,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"Canada's Worst Driver 6 is the sixth season of the Canada's Worst Driver series, where eight contestants known by those close to them for being bad drivers are taught lessons on improving their driving skills. As with previous seasons, the contestants are taken to the Driver Rehabilitation Centre, which takes place this year at Dunnville Airport in Dunnville, Ontario. The season finale is slated to be in Niagara Falls, Ontario for the first time this year.\n\nFor this season, a new series logo has been commissioned, coinciding with an increase in fundamentals of high-performance driving in the lessons this year.","id":45368,"poster_path":"/vky7nAm6Zwodxtk0BQJ1ZdCsr1F.jpg","season_number":6,"vote_average":0},"7":{"_id":"5258d96a760ee3466172847c","air_date":"2011-10-24","episodes":[{"air_date":"2011-10-24","episode_number":1,"episode_type":"standard","id":789279,"name":"Take Off, Eh!","overview":"Eight of the country's most appalling drivers and their nominators begin by safely driving to The Rehab Centre. Once they arrive, their driving education commences.\n\nThis year's drivers begin their rehabilitation with some skills evaluation. Our Basic Assessment Challenge reveals a dreadful lack of even the most fundamental driving abilities in all of the candidates.\n\nOur group of experts is astonished and considers this bunch to be the worst group of drivers we've ever had at the Driver's Rehabilitation Centre. It's anybody's guess at this point as to who ultimately will be named Canada's Worst Driver.","production_code":"","runtime":60,"season_number":7,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-31","episode_number":2,"episode_type":"standard","id":789280,"name":"Use Your Mirrors, Eh?","overview":"The country's most awful drivers and their nominators begin by carrying out the simplest of tasks in our Hilly Rails challenge, This task involves attempting to drive in a straight line... driving forwards and then backwards along rails lined up over a shallow water drop. Next, the drivers keep an eye on where they want to go -- and head to the infamous Eye of the Needle Challenge.\n\nFinally, the remaining drivers all pile into a bus and tackle the Reverse Figure Eight Challenge. All of the candidates think they know the technique, but learning to use side mirrors may prove to be more difficult than it looks.\n\nOne driver graduates after showing an improvement and our experts continue to watch closely to determine who will be Canada's Worst Driver.","production_code":"","runtime":60,"season_number":7,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-07","episode_number":3,"episode_type":"standard","id":789281,"name":"Dangerous Driving","overview":"The remaining drivers start by quickly becoming distracted behind the wheel and learn how dangerous distracted driving can really be. It becomes quite clear that old habits need to change. Next, our drivers are paired-up and tackle the Head-to-Head Challenge. The race is on to see who understands the S-Turn. It is a challenge that is going to be double the fun and double the frustration.\n\nFinally, the drivers race down the track and are required to check their blind spot to succeed in this task. Checking their blind spot remains to be challenging for some of our abysmal drivers.\n\nIt's anybody's guess at this point as to who ultimately will be branded Canada's Worst Driver.","production_code":"","runtime":60,"season_number":7,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-14","episode_number":4,"episode_type":"standard","id":789282,"name":"Buckle Up","overview":"With six abysmal drivers remaining at the Rehabilitation Centre, the search is on for Canada's Worst Driver. This episode, our driving delinquents begin by attempting to manoeuvre and park a huge tow trailer. Next, the drivers head up a ramp into a large circle and attempt the Three Point Turn Challenge. This should be easy as 1- 2- 3... but remember, we are dealing with Canada's Worst Drivers.\n\nFinally, they buckle up and head to the annual Water Tank Challenge -- a task that may dampen some dreams of graduating. As our drivers towel off, our panel of experts make their decision. Another driver heads home and we continue the search for Canada's Worst Driver.","production_code":"","runtime":60,"season_number":7,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-21","episode_number":5,"episode_type":"standard","id":789283,"name":"Park and Slide","overview":"The country's most appalling drivers begin this episode in a busy parking lot. Frustrations rise as they each attempt to maneuver and secure a parking space. Then, stress levels elevate as our abysmal drivers attempt to parallel park. It will be a tight squeeze for our drivers as they attempt the challenge in a massive automobile. Later, our drivers try their hand at the Trough.\n\nKnowing where your wheels are has never been more important. Finally, the \"worst\" tackle a true Canadian driving task as they slide into the Icy Corner Challenge. Learning the proper method to taking an icy corner has never been more frightening.\n\nOnce our drivers finish their day, our panel of experts make their decision. One driver heads back onto the public roads and we continue the search for Canada's Worst Driver.","production_code":"","runtime":60,"season_number":7,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-28","episode_number":6,"episode_type":"standard","id":789284,"name":"Hard!","overview":"Our drivers begin the episode by learning that anyone with a licence is allowed to drive a truck attached with a huge snow plow. But the question is, will Canada's worst drivers be able to plow their way through the challenge? Then, we find out what our drivers know about everyday rules of the road. The results will surprise you. Later, our drivers slide over to the curling ice and try their hand at Car Curling.\n\nUsing all they've learnt in rehab so far, they must deliver the best draw weight so the stone reaches the house. Finally, with training under their belts, they attempt the Moose Evasive Challenge.\n\nOne driver heads back to the public roads after showing an improvement and our experts continue to watch closely to determine who will be Canada's Worst Driver.","production_code":"","runtime":60,"season_number":7,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-05","episode_number":7,"episode_type":"standard","id":789285,"name":"Glazed Over","overview":"There is no time for a coffee break as our drivers begin this episode by attempting to do Donuts. Next, our drivers are put to the ultimate test as they try to manoeuvre themselves through the tight corners of the Cross. Then, its time for \"the worst\" to put the pedal to the metal as they deal with reversing and speed at the same time in our Reverse Slalom Challenge.\n\nFinally, the group gets behind the wheel of a huge cube truck. After fastening their seatbelts, they attempt to make a special delivery.\n\nOne driver will return to Canadian roads again after showing an improvement and our experts continue to watch closely to determine who will be Canada's Worst Driver.","production_code":"","runtime":60,"season_number":7,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-12","episode_number":8,"episode_type":"finale","id":789286,"name":"Oh Canada","overview":"With the title of Canada's Worst Driver looming, the three remaining motorists begin by riding in a car together as each one attempts to reverse in a simple line. Later, our drivers are determined to show everyone what they've learned at rehab. Using all the knowledge they've acquired, they attempt this year's Mega Challenge.\n\nFinally, our remaining three tackle a public drive through the busy downtown core of Hamilton, Ontario. As the drivers wait with anticipation, the experts make their final decisions.\n\nOne driver graduates and the title of Canada's Worst Driver is finally crowned.","production_code":"","runtime":60,"season_number":7,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":45373,"poster_path":"/9Llqij373KHg1JVeQvYwgZKIi8V.jpg","season_number":7,"vote_average":0},"8":{"_id":"5258d96a760ee34661728450","air_date":"2012-10-29","episodes":[{"air_date":"2012-10-29","episode_number":1,"episode_type":"standard","id":789254,"name":"Here they come...","overview":"Eight of the country's most appalling drivers and their nominators begin by safely driving to The Rehab Centre. Once they arrive at the rehabilitation centre, their driving education will commence.","production_code":"","runtime":60,"season_number":8,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-05","episode_number":2,"episode_type":"standard","id":789255,"name":"Look-out!","overview":"Driver training is well underway and eight of the country's most appalling drivers and their nominators begin by being paired up and tackle the Reverse Head-to-Head Challenge.","production_code":"","runtime":60,"season_number":8,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-12","episode_number":3,"episode_type":"standard","id":789256,"name":"Look where you want to go!","overview":"Only seven drivers remain at the Rehab Centre and our drivers begin by all boarding a school bus together as they each take turns attempting to manoeuver the giant school bus around a figure eight track.","production_code":"","runtime":60,"season_number":8,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-19","episode_number":4,"episode_type":"standard","id":789257,"name":"Making a splash!","overview":"With Rehab well under way, our remaining 6 delinquent drivers are all attempting to get their licenses back and return to the public roads.","production_code":"","runtime":60,"season_number":8,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-26","episode_number":5,"episode_type":"standard","id":789258,"name":"Ice Cream","overview":"With rehab well under way, our remaining drivers being this episode with a sweet treat.","production_code":"","runtime":60,"season_number":8,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-03","episode_number":6,"episode_type":"standard","id":789259,"name":"Hole in One","overview":"The pressure is on for our remaining drivers to prove to the experts that they have the skills to return to public roads.","production_code":"","runtime":60,"season_number":8,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-10","episode_number":7,"episode_type":"standard","id":789260,"name":"1 - 2 - 3 GO!","overview":"With only 4 drivers remaining, the pressure is on to impress the expert panel. Our abysmal drivers begin this episode by attempting the Three Point Turn Challenge. This should be easy as 1- 2- 3... but remember we are dealing with Canada's Worst Drivers.","production_code":"","runtime":60,"season_number":8,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-17","episode_number":8,"episode_type":"finale","id":789261,"name":"Trophy Please...","overview":"With the title of Canada's Worst Driver looming, the three remaining drivers begin this final episode by riding in a car together. Keeping their wits about them, each one attempts to slalom through simple course.","production_code":"","runtime":60,"season_number":8,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"","id":45369,"poster_path":"/nPAfUlQOeCfq3umTfAmmVP4Rvfu.jpg","season_number":8,"vote_average":0},"9":{"_id":"562ec6eec3a3681b5200bb5e","air_date":"2013-10-28","episodes":[{"air_date":"2013-10-21","episode_number":0,"episode_type":"standard","id":1132691,"name":"Remember...","overview":"Host Andrew Younghusband introduces each of the returning drivers through a review of their performances in their original appearances. At the end of the episode, he briefly outlines the challenges that they will face. He also restates his personal belief that Angelina is Canada's Worst Driver Ever, though says that he is willing to be proven wrong.","production_code":"","runtime":60,"season_number":9,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-28","episode_number":1,"episode_type":"standard","id":1132692,"name":"They're Back!","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-04","episode_number":2,"episode_type":"standard","id":1132693,"name":"Where's Your Blind Spot?","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-11","episode_number":3,"episode_type":"standard","id":1132694,"name":"Splish-Splash!","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-18","episode_number":4,"episode_type":"standard","id":1132695,"name":"Easy as 1-2-3","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-25","episode_number":5,"episode_type":"standard","id":1132696,"name":"They Shoot! They Score!","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-02","episode_number":6,"episode_type":"standard","id":1132697,"name":"Slip and Slide","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-09","episode_number":7,"episode_type":"standard","id":1132698,"name":"What Happened?","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-16","episode_number":8,"episode_type":"finale","id":1132699,"name":"The Envelope Please!","overview":"","production_code":"","runtime":60,"season_number":9,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Canada's Worst Driver Ever","overview":"Nine of the country's most appalling drivers from past seasons of Canada's Worst Driver return to the Rehab Centre. After safely driving their nominators to the Rehab Centre, it's up to each driver to prove that they possess the necessary driving skills to finally graduate from the Rehab Centre.","id":71620,"poster_path":"/t6fjzkd8D4PrwB65QSJjsIMthYr.jpg","season_number":9,"vote_average":0},"10":{"_id":"562f0517925141400600ae69","air_date":"2014-10-27","episodes":[{"air_date":"2014-10-27","episode_number":1,"episode_type":"standard","id":2787605,"name":"Welcome to Rehab...","overview":"For the past nine seasons host Andrew Younghusband has tackled the hazards of winter driving, adapted high-performance tips from the racetrack, and manouvered through big city gridlock. And now, for Season 10, CANADA’S WORST DRIVER contends with the most rampant challenge on the roads today: Distracted driving.","production_code":"","runtime":60,"season_number":10,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-03","episode_number":2,"episode_type":"standard","id":2787606,"name":"Crash, Bang, Boom!","overview":"The nominees for Canada's Worst Driver tackle a series of driving challenges in the hope of getting their keys back and leaving the Driver Rehabilitation Centre.","production_code":"","runtime":60,"season_number":10,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-10","episode_number":3,"episode_type":"standard","id":2787609,"name":"What Just Happened?","overview":"With Ian Brannan being named perhaps surprisingly the first graduate of the season - he being so named because he recognized the bad driving choices he was making - there are seven nominees left at the Drivers' Rehabilitation Centre. The panel believes the distracted driving demonstration is more important now than ever with cell phone use causing driving accidents being on the rise. Four of the remaining nominees are addicted to their cell phone while driving, another who would use it if his passengers would allow it, and another whose distraction is eating and drinking while ...","production_code":"","runtime":60,"season_number":10,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-17","episode_number":4,"episode_type":"standard","id":2787612,"name":"Piece of Cake","overview":"With Santana Pike being named the second graduate, six nominees remain at the Centre. The nominees' first challenge is to test if they know how fast they are driving by covering their speedometer. They are required to drive at both 50kph and 70kph, the latter which also entails them hitting on their brakes at a given point to avoid hitting a wall, which they should be able to do if they are indeed driving at the requested speed. Their second challenge is the annual water tank challenge, which includes a straightaway acceleration and deceleration section, a forward precision ...","production_code":"","runtime":60,"season_number":10,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-24","episode_number":5,"episode_type":"standard","id":2787614,"name":"1 - 2 - 3 - Go!","overview":"There are five nominees left at the Centre with the graduation of George Firth. Before the next set of challenges, Andrew tries to impress on the five the importance of proper seating behind the wheel and the negative consequences of not doing so if/when an air bag is deployed. The first challenge for the five is to do a three point turn in a school bus in an enclosure. This task may be difficult for some who either do not grasp the concept or who do not even know what a three point turn is. The second and third challenges require Philippe to teach them the associated and related...","production_code":"","runtime":60,"season_number":10,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-01","episode_number":6,"episode_type":"standard","id":2787617,"name":"Know Your Limits","overview":"With the panel deciding not to graduate anyone at the last graduation ceremony based on the nominees' own wants, there are still five left at the Centre. As it is one of the most destructive and frightening activities for the nominees as a collective in their everyday driving, parking in a crowded parking lot is their first challenge. They must obey all standard rules, one nominee who is totally oblivious to legalities of property damage in parking lots. They must park into any available legal space in one go, in each case backing up, a penalty incurred if the parking...","production_code":"","runtime":60,"season_number":10,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-08","episode_number":7,"episode_type":"standard","id":2787619,"name":"Slip and Slide","overview":"With Mariah Carriere being named the latest graduate, there are four nominees left in the running to be named Canada's Worst Driver. Their first challenge is to do a straight reverse one kilometer in length, the longest reversing challenge ever on the show. There are several sections, the side barriers made of different materials and the lane being differing widths throughout the course. The nominees are told that it is a race, that they are to complete the course as fast as they can. Most do not however realize that success still entails not hitting anything. Tim holds himself ...","production_code":"","runtime":60,"season_number":10,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-15","episode_number":8,"episode_type":"finale","id":2787622,"name":"Icing on the Cake...","overview":"This final episode of crashes, crunches and outright destruction determines who's unfit to get their car keys back; one unlucky driver is named Canada's Worst Driver.","production_code":"","runtime":60,"season_number":10,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"","id":71621,"poster_path":"/4bpiRQkzJ52zx3MScx1guPYEADf.jpg","season_number":10,"vote_average":0},"11":{"_id":"56380742c3a3681b5901d92a","air_date":"2015-10-26","episodes":[{"air_date":"2015-10-26","episode_number":1,"episode_type":"standard","id":2787626,"name":"Ready, Set, Go!","overview":"Nine drivers and their nominators take on the first of many challenges to determine which of them is Canada's Worst Driver.","production_code":"","runtime":60,"season_number":11,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-02","episode_number":2,"episode_type":"standard","id":2787627,"name":"Left Right - Red Green","overview":"Contestants tackle a series of driving challenges, including the Head-To-Head Reverse, the Ride the Rails and checking blind spots.","production_code":"","runtime":60,"season_number":11,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-09","episode_number":3,"episode_type":"standard","id":2787628,"name":"Turtle! Turtle!","overview":"","production_code":"","runtime":60,"season_number":11,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-16","episode_number":4,"episode_type":"standard","id":2787630,"name":"Nailing the Needle","overview":"","production_code":"","runtime":60,"season_number":11,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-23","episode_number":5,"episode_type":"standard","id":2787633,"name":"Slip and Crash","overview":"","production_code":"","runtime":60,"season_number":11,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-30","episode_number":6,"episode_type":"standard","id":2787634,"name":"Soaked And Wet","overview":"","production_code":"","runtime":60,"season_number":11,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-07","episode_number":7,"episode_type":"standard","id":2787636,"name":"Easy as Pie","overview":"","production_code":"","runtime":60,"season_number":11,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-14","episode_number":8,"episode_type":"finale","id":2787637,"name":"The Checkered Flag","overview":"","production_code":"","runtime":60,"season_number":11,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 11","overview":"","id":71765,"poster_path":null,"season_number":11,"vote_average":0},"12":{"_id":"580e47c79251416e12001ade","air_date":"2016-10-24","episodes":[{"air_date":"2016-10-24","episode_number":1,"episode_type":"standard","id":1234044,"name":"Episode 1","overview":"Eight dismal drivers and their nominators set out for the Driver Rehabilitation Centre and take on the first of many challenges to determine which of them is Canada's Worst Driver","production_code":"","runtime":60,"season_number":12,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-31","episode_number":2,"episode_type":"standard","id":2787644,"name":"Check, check!","overview":"The nominees for Canada's Worst Driver tackle a series of driving challenges in the hope of getting their keys back and leaving the Driver Rehabilitation Centre.","production_code":"","runtime":60,"season_number":12,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-07","episode_number":3,"episode_type":"standard","id":1236322,"name":"What Just Happened?","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-14","episode_number":4,"episode_type":"standard","id":1239675,"name":"Swerve and What?","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-21","episode_number":5,"episode_type":"standard","id":1241761,"name":"Is it Almost Over?","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-28","episode_number":6,"episode_type":"standard","id":2787651,"name":"Crash, Bang, I Quit!","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-05","episode_number":7,"episode_type":"standard","id":1245393,"name":"Know Your Limits","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-12","episode_number":8,"episode_type":"finale","id":2787653,"name":"Drum Roll Please...","overview":"","production_code":"","runtime":60,"season_number":12,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 12","overview":"","id":81376,"poster_path":null,"season_number":12,"vote_average":0},"13":{"_id":"5bde2bfc0e0a2605790197a2","air_date":"2017-10-23","episodes":[{"air_date":"2017-10-23","episode_number":1,"episode_type":"standard","id":1611360,"name":"It All Begins Now...","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-30","episode_number":2,"episode_type":"standard","id":1611361,"name":"Look Here. Look There.","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-06","episode_number":3,"episode_type":"standard","id":1611362,"name":"Threading The Needle...","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-13","episode_number":4,"episode_type":"standard","id":1611363,"name":"Look Out!","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-20","episode_number":5,"episode_type":"standard","id":1611364,"name":"All Wet!","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-27","episode_number":6,"episode_type":"standard","id":1611365,"name":"No Parking","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-04","episode_number":7,"episode_type":"standard","id":1611366,"name":"Ice, Ice Maybe","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-11","episode_number":8,"episode_type":"finale","id":1611367,"name":"Drum Roll Please...","overview":"","production_code":"","runtime":60,"season_number":13,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 13","overview":"","id":112003,"poster_path":null,"season_number":13,"vote_average":0},"14":{"_id":"5bde2c11c3a3682b39019ca4","air_date":"2018-10-29","episodes":[{"air_date":"2018-10-29","episode_number":1,"episode_type":"standard","id":1611351,"name":"Start Your Engines!","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-05","episode_number":2,"episode_type":"standard","id":1611352,"name":"Look Where You Wanna Go","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-12","episode_number":3,"episode_type":"standard","id":1611353,"name":"Check. Check.","overview":"","production_code":"","runtime":60,"season_number":14,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-19","episode_number":4,"episode_type":"standard","id":1992030,"name":"Crash. Bang. Boom","overview":"The remaining drivers learn about the dangers of distracted driving","production_code":"","runtime":60,"season_number":14,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-26","episode_number":5,"episode_type":"standard","id":1992031,"name":"Back it up!","overview":"As pressure builds amongst the drivers, tempers flare.","production_code":"","runtime":60,"season_number":14,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-03","episode_number":6,"episode_type":"standard","id":1992032,"name":"Ups and Downs","overview":"The remaining drivers take on the Teeter Totter and the Water Tank Challenge.","production_code":"","runtime":60,"season_number":14,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-10","episode_number":7,"episode_type":"standard","id":1992033,"name":"Slippery When Wet","overview":"The remaining drivers face the Icy Corner Challenge.","production_code":"","runtime":60,"season_number":14,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-17","episode_number":8,"episode_type":"finale","id":1992034,"name":"The Final Three","overview":"Three of the country's most delinquent drivers attempt their final challenges; Canada's worst driver is named.","production_code":"","runtime":60,"season_number":14,"show_id":34638,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 14","overview":"","id":112004,"poster_path":null,"season_number":14,"vote_average":0}}}