{"adult":false,"backdrop_path":"/qHiXGMFPAyDun4kxWpgsnzp3VjF.jpg","created_by":[{"id":1365586,"credit_id":"58cbe7ecc3a36828890111cf","name":"David McKee","gender":2,"profile_path":"/5pxV3fNHvtePip88xedv54bFBY4.jpg"}],"episode_run_time":[15],"first_air_date":"1971-02-25","genres":[{"id":10762,"name":"Kids"},{"id":16,"name":"Animation"}],"homepage":"","id":34870,"in_production":false,"languages":["en"],"last_air_date":"2005-01-01","last_episode_to_air":{"id":794889,"name":"The Gladiator","overview":"Seeing some workmen busy repairing his road, Mr Benn is reminded of the Romans, who built very good roads. He heads for the costume shop and tries on a Roman Gladiator’s outfit; stepping through the changing room door, Mr Benn arrives in ancient times, by a road under construction. One of the workers is Mr Benn’s old friend, Smasher Lagru**, who explains that they are building the road to lead to the Emperor’s Arena. Just then the Emperor himself arrives, and, having approved of the workers’ handiwork, he invites Smasher and Mr Benn to accompany him on a visit to watch the Gladiators fight each other – and the lions – in the Arena. Mr Benn sees this as an opportunity save the lives of the combatants, and to show the Emperor that fighting is silly…","vote_average":0,"vote_count":0,"air_date":"2005-01-01","episode_number":14,"episode_type":"finale","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/bDUgWOmFBNfcnRcTXugnsaQuoN9.jpg"},"name":"Mr. Benn","next_episode_to_air":null,"networks":[{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":14,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Mr. Benn","overview":"Popular British children's animation series. Mr Benn is the ordinary, bowler-hatted office worker who lives in the ordinary suburban street of Festive Road. However, when he tries on a costume in a mysterious shop, he steps out of the changing room into a different time and place, appropriate to his apparel. His adventures include him being a spaceman, a pirate and a cowboy.","popularity":1.884,"poster_path":"/rPivclumQ8Me8KVQ7QFVczMWq3j.jpg","production_companies":[{"id":16923,"logo_path":null,"name":"Zephyr Films","origin_country":"GB"}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"}],"seasons":[{"air_date":"1971-02-25","episode_count":14,"id":45688,"name":"Mr. Benn","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.1,"vote_count":10,"season_data":{"1":{"_id":"5258dbbf760ee34661751a30","air_date":"1971-02-25","episodes":[{"air_date":"1971-02-25","episode_number":1,"episode_type":"standard","id":794876,"name":"Red Knight","overview":"Mr Benn has been invited to a fancy-dress party. He dislikes parties, but enjoys dressing up, so he looks round the shops for a costume to wear, but everywhere he finds only ordinary everyday clothes. Turning into a small lane on his way home, Mr Benn comes across a costume shop where he chooses an outfit of red knight's armour. Changing into the armour, Mr Benn passes through another door in the shop's changing room and finds himself in another world where he stumbles upon a dragon...","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/AasY5PJ1jEcBz2JbcHf4ogacHxa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1971-03-11","episode_number":2,"episode_type":"standard","id":794886,"name":"Clown","overview":"Mr Benn decides to find out what it is like to make people laugh, so he visits the costume shop to try on a clown outfit. But when he steps through the changing room door, instead of a circus ring, he finds himself standing in a field by a car. Mr Benn drives off down the road and soon meets a travelling circus, whose troupe asks him to join them; they all set off together - only to come to a halt when they reach a raging river. Seeing that the bridge has fallen down, each of the acts tries a different way of crossing, but all attempts fail. Mr Benn makes a suggestion: if they work together, they should be able to succeed…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/cyKKQWKymr90XWHwuE2y19XBafN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1971-03-18","episode_number":3,"episode_type":"standard","id":794880,"name":"Ballooning","overview":"Seeing some children playing in the street with balloons, Mr Benn decides on a visit to the costume shop. After donning a suit and top hat he finds himself in a crowd of spectators at a hot air balloon race. Seeing that one of the contestants is on his own, Mr Benn offers to accompany him on the flight; the man accepts, but warns that they will probably lose to a cheat named Baron Bartrum. The signal is given and the balloons try to take off ; however, only the Baron’s balloon succeeds, as the rest have all been sabotaged – including Mr Benn’s balloon, which is tied to a drainpipe. Mr Benn decides to teach the Baron a lesson: that cheaters never prosper…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/mxOBQBXhV5T1kzNWGFiKp1Azcrd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1971-03-25","episode_number":4,"episode_type":"standard","id":794883,"name":"The Wizard","overview":"Having watched a magic show at the park, Mr Benn decides to pay a visit to the costume shop. After donning a wizard’s cape and pointed hat, he steps through the changing room door and arrives in a wizard’s cave; here he is met by two men, who ask if he will come with them to the Palace to meet their king and queen. Arriving at the royal court of the happy kingdom, Mr Benn learns from the queen that she believes he husband – a short, placid, happy man – is just not ‘kingly’ enough; the queen therefore wants Mr Benn to use his wizardly powers to change him. However, every time Mr Benn tries to transform the king, things do not turn out the way the queen wished for…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/1hSXMIodaqryiEetWHLJvtFWW0d.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1971-04-01","episode_number":5,"episode_type":"standard","id":794887,"name":"The Spaceman","overview":"Strolling in the park, Mr Benn sees a kite. Deciding to try a trip into space, he returns to the costume shop, puts on a spacesuit, and steps through the changing room door… into the cockpit of a spaceship that is about to blast off! Together with the vessel’s two crewmen, Mr Benn travels through space, eventually arriving on a planet festooned with precious minerals and jewels; however, a dejected man dressed in rags tells them that the treasure will turn to rocks as soon as they leave, and he suggest that they try the next planet, which has everything they could want - and for free. The three astronauts travel to this world, but although the planet’s goods and food are indeed wonderful, everything is in black and white. The next planet is too noisy, and the one after that is too hot. Mr Benn soon realises that there is no place like home…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/fSD5sjkmtienb3jaD2k2AxjTSfM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1972-01-14","episode_number":6,"episode_type":"standard","id":794877,"name":"Big Game Hunter","overview":"Mr Benn dons a safari suit and steps through the door of the costume shop’s changing room; he emerges from a tent in a hot, steamy jungle, where a big game hunter mistakes him for his guide. Mr Benn doesn’t want to see any of the animals hurt by the hunter’s gun, so he leads the man on a merry dance through the jungle, dismissing each animal as too small a challenge for him…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/nB6yRHpJwGVHn7OJinVctIPKifm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1972-06-15","episode_number":7,"episode_type":"standard","id":794881,"name":"The Zookeeper","overview":"Feeling trapped inside his house, Mr Benn heads off to the costume shop for an adventure. After the shopkeeper gives him a blue uniform and hat, Mr Benn wonders what he will be; stepping through the changing room door he finds himself at a zoo, and realises that he must be the zookeeper. However, all the animals in this zoo are sad and unhappy. A parrot explains that the animals are miserable because their cages are too small - so Mr Benn decides to turn the tables on the zoo’s visitors, by showing them what it is like to be locked up…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/9FSmJTb0ep2qKznHT5Km3SMUdRX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1972-08-09","episode_number":8,"episode_type":"standard","id":794878,"name":"The Cook","overview":"After putting on a chef’s tunic and hat, Mr Benn arrives in a dark, dingy street full of hungry children. Seeing a group of cooks, he follows them to the royal palace, where hundreds of other chefs are busy preparing sumptuous meals for the delight of the King’s daughter, princess Annabella. However, the princess seems very unhappy, and refuses to eat any of the delicious food brought before her. Mr Benn realises that Annabella’s sadness is not caused by hunger, and he sets off to put an idea into effect…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/jh5ghj3MleQka5tFr6KXcMfdXKp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1972-08-16","episode_number":9,"episode_type":"standard","id":794879,"name":"The Caveman","overview":"Fed up with the noise of the traffic outside his house, Mr Benn heads off for the costume shop. Putting on a caveman’s animal skin, he steps into a prehistoric land and meets a tribe of cavemen sheltering inside some cramped caves. Just as Mr Benn asks why they do not sit on the grass outside, he narrowly avoids being trampled into the ground by a hoard of stampeding dinosaurs. When the cave people explain that they have to put up living in the caves because there is nowhere else to live, Mr Benn decides to give the tribe a lesson in building construction…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/Fiz2juspBnrdC4PWYLPXRjIR82.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1972-09-13","episode_number":10,"episode_type":"standard","id":794885,"name":"The Magic Carpet","overview":"After seeing a carpet seller, Mr Benn decides to have an Arabian adventure. Putting on a turban in the costume shop, Mr Benn takes the accompanying magic carpet and walks through the changing room door; he arrives in a beautiful city, and sees a young boy being forced by a wicked man to retrieve a magic bottle from a narrow cave. The boy succeeds, but an eagle snatches the bottle from him and flies with it to a mountaintop. Mr Benn offers to help the boy, and together they discover that the bottle contains a genie – which then grants the young lad three wishes…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/4OvfyU5NzShfM91HURX0qmfs6qo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1972-11-18","episode_number":11,"episode_type":"standard","id":794882,"name":"The Frogman","overview":"Having spent some time by the river watching the boats go byMr Benn sets off for the costume shop and tries on a frogman’s suit. On leaving the changing room he arrives on a rocky shoreline, but when he dives in and begins to explore the water, he is soon interrupted by the crew of two submarines, who are each searching for a sea monster. Mr Benn then encounters a beautiful mermaid, and helps her to find a seashell for her undersea kingdom’s ruler. Paying a visit to King Neptune, Mr Benn learns that the monarch and his pet sea monster are no longer able to go out because of the nuisance the two submarines are causing in their attempts to photograph the creature. Mr Benn comes up with a cunning plan to trick the sailors into believing they have seen the monster, so that they will then go away…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/9nSS9gclDOuOXJjOFYXyOaDqgYu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1972-12-16","episode_number":12,"episode_type":"standard","id":794888,"name":"Pirate","overview":"After the shopkeer suggests that Mr Benn try on a pirate’s outfit, our suburban hero arrives on the deck of a pirate ship commanded by Captain Tempest. When the lookout spies a sailing ship on the horizon, the captain orders his crew to plunder the vessel for its booty; however, the sailors seem strangely unwilling to carry out their orders, and the sailing ship gets away. Mr Benn soon learns that the crew don’t really want to be pirates, and they are willing to try anything to get out of attacking innocent vessels…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/qEtCHDkgrAf29sl5yn6NaeWt6Pw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1972-12-25","episode_number":13,"episode_type":"standard","id":794884,"name":"The Cowboy","overview":"The children of Festival Road are playing cowboys and Indians; meanwhile, Mr Benn cannot face the long queue to see a Western movie at the local cinema. Instead, he goes to the costume shop and tries on a cowboy outfit; after leaving the changing room, Mr Benn arrives in the Wild West, where some cowboys and Indians are taking part in a friendly game of Hide-and-Seek. But when Mr Benn learns that the cowboys have never won a game, he decides to make sure that this time, they do…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/jnO2mPP56NL2VGeCo48340Wd8F3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-01","episode_number":14,"episode_type":"finale","id":794889,"name":"The Gladiator","overview":"Seeing some workmen busy repairing his road, Mr Benn is reminded of the Romans, who built very good roads. He heads for the costume shop and tries on a Roman Gladiator’s outfit; stepping through the changing room door, Mr Benn arrives in ancient times, by a road under construction. One of the workers is Mr Benn’s old friend, Smasher Lagru**, who explains that they are building the road to lead to the Emperor’s Arena. Just then the Emperor himself arrives, and, having approved of the workers’ handiwork, he invites Smasher and Mr Benn to accompany him on a visit to watch the Gladiators fight each other – and the lions – in the Arena. Mr Benn sees this as an opportunity save the lives of the combatants, and to show the Emperor that fighting is silly…","production_code":"","runtime":15,"season_number":1,"show_id":34870,"still_path":"/bDUgWOmFBNfcnRcTXugnsaQuoN9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Mr. Benn","overview":"","id":45688,"poster_path":null,"season_number":1,"vote_average":0}}}