{"adult":false,"backdrop_path":"/wqHmhwSjCkPXYoCcQBWT1MsAGVb.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2010-12-02","genres":[{"id":9648,"name":"Mystery"},{"id":99,"name":"Documentary"}],"homepage":"http://www.history.com/shows/brad-meltzers-decoded","id":34992,"in_production":false,"languages":["en"],"last_air_date":"2012-01-20","last_episode_to_air":{"id":796071,"name":"Devil's Graveyard, Alaska","overview":"What if I told you there's a place in Alaska that claims more bodies than the Bermuda Triangle? The Alaska Triangle--the region between Anchorage, Juneau and Barrows--has a disappearance rate sixteen times the national average, and scientists are entirely incapable of explaining why. Is it Alaska's extreme geological activity that creates magnetic anomalies causing instruments--and humans--to act crazy? Or is it vortexes--swirling, turbulent flows of energy--that are causing entire ships, planes and people to disappear without a trace? Local tribesmen, Search and Rescue workers, and the families of the missing all have their theories as to what is causing people in Alaska to vanish off the face of the earth.","vote_average":0,"vote_count":0,"air_date":"2012-01-20","episode_number":13,"episode_type":"finale","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null},"name":"Brad Meltzer's Decoded","next_episode_to_air":null,"networks":[{"id":65,"logo_path":"/9fGgdJz17aBX7dOyfHJtsozB7bf.png","name":"History","origin_country":"US"}],"number_of_episodes":23,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Brad Meltzer's Decoded","overview":"Brad Meltzer's Decoded, is an American mystery and conspiracy theory investigation television series, produced by Go Go Luckey and Berman/Braun, that premiered December 2, 2010 on the History channel. The series is hosted by political thriller author and non-fiction writer Brad Meltzer and follows a team of investigators who try to determine the meanings behind various symbolism, alleged secret codes and conspiracies that surround us every day.","popularity":3.634,"poster_path":"/DRYYwDoPuVzuWJ2A64MP0YvQYx.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2012-12-21","episode_count":1,"id":45772,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2010-12-02","episode_count":10,"id":45770,"name":"Season 1","overview":"","poster_path":"/DRYYwDoPuVzuWJ2A64MP0YvQYx.jpg","season_number":1,"vote_average":0},{"air_date":"2011-10-05","episode_count":13,"id":45771,"name":"Season 2","overview":"","poster_path":"/DRYYwDoPuVzuWJ2A64MP0YvQYx.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5.6,"vote_count":5,"season_data":{"1":{"_id":"5258dc29760ee34661759c89","air_date":"2010-12-02","episodes":[{"air_date":"2010-12-02","episode_number":1,"episode_type":"standard","id":796052,"name":"The White House","overview":"The team gets to the bottom--literally--of a mystery concerning the cornerstones of our democracy. Laid by the ultra secretive Freemasons, this landmark piece of stone vanished. The search for the White House cornerstone has been on for over 200 years, everyone from Harry Truman to Barbara Bush have looked for it. Is it a coincidence...or is there a secret conspiracy tied to these stones and the buildings they were meant to support?","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-09","episode_number":2,"episode_type":"standard","id":796053,"name":"Secret Presidential Codes","overview":"The team investigates the secret presidential codes of Thomas Jefferson and how they may be partially responsible for the death of one of the world's greatest explorers, Meriwether Lewis, of Lewis and Clark fame. Meltzer discovers that although the Lewis family has been working for 15 years to exhume his body, the National Parks is preventing the exhumation. This episode attempts to answer why the federal government would want to keep the body buried against the family's wishes and what really happened to the man who more than 200 years after his death remains our most iconic explorer.","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-16","episode_number":3,"episode_type":"standard","id":796054,"name":"Statue of Liberty","overview":"Best-selling author Brad Meltzer and his team thought they knew what the Statue of Liberty stood for. But now they learn that America's most powerful icon of freedom might actually be loaded with secret symbols put there by a sinister group bent on world domination. They investigate claims that the Illuminati, a secret European society loosely affiliated with the freemasons, turned every inch of the statue into a coded message, from the torch Liberty holds high, to the rays emanating from the crown, even to the precise height of the statue itself. Things get even stranger when a highly regarded numerologist shows the team why he believes the statue is really a monument to the all-powerful number 7. As they evaluate these unsettling claims, Brad and the team are forced to reconsider whether one of America's most enduring symbols is really who she appears to be.","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-23","episode_number":4,"episode_type":"standard","id":796055,"name":"The Lincoln Assassination","overview":"Best-selling author Brad Meltzer and his Decoded team examine claims that John Wilkes Booth actually escaped to freedom after murdering President Abraham Lincoln in 1865. The \"official\" version of events says federal agents cornered Booth and killed him just days after the assassination. But Brad and the team uncover glaring inconsistencies in that 150-year-old account: Why did the authorities hide Booth's body from public view? Why was Booth autopsy's conducted in complete secrecy in the cramped confines of an ironclad gunboat? Searching for answers to these and other troubling questions, the team finds startling evidence that strongly suggests Booth may indeed have lived into old age without ever facing punishment for his crime.","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-30","episode_number":5,"episode_type":"standard","id":796058,"name":"Confederate Gold","overview":"Best-selling author Brad Meltzer and his team dig into one of the Civil War's most enduring legends: that millions of dollars' worth of missing gold and silver from the Confederate treasury are still buried in secret hiding places across America. According the legend, the only way to find that buried treasure is to decode cryptic signs and symbols left behind by a shadowy Confederate group known as the Knights of the Golden Circle. Brad and the Decoded team join veteran treasure hunter Bob Brewer, whose lifetime effort to understand the KGC's secret code paid off when he uncovered a small fortune in buried Confederate coins. Bob soon shows just how well he understands those codes as he and the team follow KGC clues to the location of another possible treasure trove.","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-06","episode_number":6,"episode_type":"standard","id":796057,"name":"D.B. Cooper","overview":"Best-selling author Brad Meltzer and the team jump at the chance to take on one of the FBI's most puzzling unsolved crimes: the 1971 disappearance of airline skyjacker D.B. Cooper, who bailed out of a jetliner at ten thousand feet over Washington state with two parachutes and two hundred thousand dollars in ransom money strapped to his body. Working closely with the former FBI agent who headed up the unsuccessful search for Cooper, Brad and the team examine new evidence that points to a former airline employee named Kenny Christiansen, whose own brother suspects he was actually the skyjacker who called himself D.B. Cooper. This sets up a climactic meeting between the Decoded team and Christensen's possible accomplice, the man who may have helped D.B. Cooper and his two hundred thousand dollar ransom vanish into thin air.","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-13","episode_number":7,"episode_type":"standard","id":796049,"name":"2012","overview":"There has long been speculation that on December 21, 2012, the world as we know it will end. Some predict that we'll be wiped out by a natural disaster like a giant tidal wave, an Earth-wide earthquake or a tremendous volcanic eruption. Others believe that on that day in December, the Earth will collide with a mysterious \"Planet X,\" causing magnetic pole shifts, gravitational reversals or a black hole so big that our solar system will simply disappear. What's more, believers say that this news is not really news at all; on the contrary, they argue, we have known about the coming apocalypse since the ancient Maya predicted and recorded it on their Long Count calendar more than 2,200 years ago.","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-20","episode_number":8,"episode_type":"standard","id":796050,"name":"The President's Inner Circle","overview":"What if the United States was saved by the most covert spy ring in US History, made up almost entirely of ordinary people? They were called: The Culper Spy Ring. This group of code-named spies worked stealthily to steal secrets from the British, giving the Americans a heads up on surprise attacks and enemy troop movements. The Decoded team will uncover if this small circle of shopkeepers, tavern owners and housewives may have played the most important role in defeating the British in the Revolutionary War more than 200 years ago.","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-27","episode_number":9,"episode_type":"standard","id":796051,"name":"Secret Societies","overview":"Best-selling author Brad Meltzer and his team try to penetrate Bohemian Grove, one of America's most tightly guarded gatherings of the rich and powerful. The Decoded team converges on the group's hideaway in a northern California redwood forest to pursue rumors of ritual sacrifice and secret agreements that control the lives of everyday Americans. Brad soon finds out just how difficult it is to uncover Bohemian Grove's secrets. He knew sending the team into the Grove would be risky, but he never expected they'd be calling him for bail money.","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-03","episode_number":10,"episode_type":"finale","id":796056,"name":"Apocalypse in Georgia","overview":"Best-selling author Brad Meltzer and the team search for the true meaning of the mysterious Georgia Guidestones. Often called America's Stonehenge, this granite monument is located on a remote hilltop outside Atlanta. Brad and the team examine the multilingual messages carved into the stones for any clues to the monument's anonymous creator, who's known only by the pseudonym -- J.C. Christian. The Decoded team checks out rumors that the Guidestones are really the work of a secretive religious sect called the Rosicrucians, who've been accused of practicing alchemy and mind control.","production_code":"","runtime":60,"season_number":1,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":45770,"poster_path":"/DRYYwDoPuVzuWJ2A64MP0YvQYx.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258dc29760ee34661759c94","air_date":"2011-10-05","episodes":[{"air_date":"2011-10-05","episode_number":1,"episode_type":"standard","id":796059,"name":"Ft. Knox","overview":"Every now and then a researcher will discover a historical enigma, an unproven rumor, a story with a puzzling outcome. Such encounters are an irresistible challenge for Brad Meltzer, the #1 New York Times best-selling author. What if I told you Fort Knox was empty? Buddy, Scott and McKinley travel to Kentucky to investigate the history of the legendary vault, and discover the devastating impact it would have on our economy and our pocketbooks if the gold were gone. Fort Knox has not been audited since 1974, but does that mean the government is shielding its empty pocket book from the prying eyes of the American public, or is the privacy in place to protect a different secret altogether?","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-12","episode_number":2,"episode_type":"standard","id":796060,"name":"Declaration of Independence","overview":"The Declaration of Independence is the founding document of American Democracy. Could it contain hidden messages from our nation's forefathers intended to be discovered years later? Buddy, Mac and Scott travel across America to try and uncover the mysteries behind our nation's most prized document.","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-19","episode_number":3,"episode_type":"standard","id":796061,"name":"Mount Rushmore","overview":"Does Mount Rushmore, one of America's greatest icons of Democracy have a more sinister meaning? Buddy, Mac and Scott travel to Big Sky country to decode the intended message possibly hidden within this great American symbol.","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-26","episode_number":4,"episode_type":"standard","id":796062,"name":"Patton","overview":"Was General Patton, America's most revered four-star general, murdered? Buddy, Mac and Scott explore the mysterious circumstances behind the military icon's controversial death, noting threats made by Patton's numerous enemies. Did one of these enemies murder the General?","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-16","episode_number":5,"episode_type":"standard","id":796063,"name":"Spear of Destiny","overview":"What if I told you that for two thousand years, many of the world's most powerful men have pursued an ancient artifact they believed would bring them unparalleled power? It's the lance that allegedly pierced Jesus' side while he was nailed to the cross. Known as the Spear of Destiny, it passed through the hands of leaders like Napoleon and Adolf Hitler, and today there are a number of shadowy institutions around the world that are still chasing the Spear. Yet the question remains: does the Spear really exist, or has it been lost forever? Decoded pursues the truth about the Spear across two continents, and tries to solve this centuries-old mystery.","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-23","episode_number":6,"episode_type":"standard","id":796064,"name":"Billy the Kid","overview":"What if I told you Billy the Kid wasn't killed by Pat Garrett? For a more than a hundred years, it's been believed that Sheriff Pat Garrett shot the Kid dead in 1881, but new theories have emerged that Billy in fact survived and went on to live a long life. So how did Billy manage to escape from Pat Garrett, and why would Garrett lie about it? Investigating the life and adventures of the legendary outlaw may prove that the history of the American West needs to be rewritten.","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-30","episode_number":7,"episode_type":"standard","id":796065,"name":"UFO","overview":"What if I told you the government had proof of alien life but was actively covering it up? Millions of Americans believe in UFOs, but the government vehemently denies any alien encounters, from the infamous Roswell incident to the ultra-secretive military base known as Area 51. Finally, members of top military and aviation organizations break their silence to reveal exactly what the government knows about alien life, and what they stand to gain by lying about it.","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-07","episode_number":8,"episode_type":"standard","id":796066,"name":"Da Vinci","overview":"What if I told you that the crystal ball for our future may be found in the work of Leonardo Da Vinci? Experts believe an obscure sketch that was stolen and hidden by a Cardinal in the Catholic Church may be part of Da Vinci's cryptic prophecies. But what exactly was Leonardo predicting, and why was it so dangerous that a Cardinal felt the need to hide it from the world? To comprehend Da Vinci's predictions for our future, the team investigates history's greatest mind, uncovering Da Vinci's controversial political views, his blasphemous obsession with death, and even the mystery shrouding the Mona Lisa's identity.","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-14","episode_number":9,"episode_type":"standard","id":796067,"name":"2012: The Beginning","overview":"What if I told you the apocalyptic prophecies of 2012 were coming true? Across the globe, predictions from Mayan texts to the King James Bible appear to be coming true with eerie accuracy. What can we look forward to on December 21, 2012, the date Mayan astronomers list as the end of time? Will we fall prey to a massive natural disaster, an unnatural disaster brought about by harm to our environment, or will we do what the Mayans did and destroy ourselves? Decoded investigates the science and the psychology behind the doomsday prophecies of 2012.","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-21","episode_number":10,"episode_type":"standard","id":796068,"name":"Mafia: Alive?","overview":"What if I told you that the Mafia and organized crime have taken on a brand new look that most people would never recognize? Today's mob has evolved into something more powerful, sophisticated and deadly than ever. Starting with Al Capone's notorious Chicago Outfit, Decoded traces the progression of the mob from Whitey Bulger's fearsome Irish Mafia, to today's Mexican cartels who are bringing their violent operations onto American soil, and the Cyber Mafia--online gangsters who can steal your money and identity without leaving their home. So what exactly does the new Mafia look like today, and what can we do to protect ourselves?","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-28","episode_number":11,"episode_type":"standard","id":796069,"name":"Vatican","overview":"What if I told you that the Vatican--seat of the Catholic Church--may be responsible for the murder of one of its own popes? Pope John Paul the First was in office just thirty-three days before he was found dead of mysterious causes and whisked away by Vatican officials with no investigation. Decoded travels to Rome and learns that the fallen Pope was at the center of a banking scandal involving Freemasons and even Mafia members operating from within the walls of the Vatican. Some even say that the scandal and the murder were foretold in a prophecy delivered by the Virgin Mary that the Vatican conspired to withhold from its followers. Could Pope John Paul the First, who vowed to reform corruption in the Vatican, have been murdered by the criminals he vowed to expose?","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-04","episode_number":12,"episode_type":"standard","id":796070,"name":"Houdini: Murdered?","overview":"What if I told you Harry Houdini's death was not an accident, as we've been led to believe, but an act of murder? Most contend the world's most famous magician died when one of his tricks went fatally wrong, but new evidence suggests that his death may have been no accident. Most compelling is the long list of famous--and infamous--suspects who all had their reasons for wanting Houdini dead. By investigating Houdini's possible murder, the team discovers the world's most thrilling entertainer may have had an equally exciting life off the stage, including deadly feuds, love affairs, and even involvement in international espionage.","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-20","episode_number":13,"episode_type":"finale","id":796071,"name":"Devil's Graveyard, Alaska","overview":"What if I told you there's a place in Alaska that claims more bodies than the Bermuda Triangle? The Alaska Triangle--the region between Anchorage, Juneau and Barrows--has a disappearance rate sixteen times the national average, and scientists are entirely incapable of explaining why. Is it Alaska's extreme geological activity that creates magnetic anomalies causing instruments--and humans--to act crazy? Or is it vortexes--swirling, turbulent flows of energy--that are causing entire ships, planes and people to disappear without a trace? Local tribesmen, Search and Rescue workers, and the families of the missing all have their theories as to what is causing people in Alaska to vanish off the face of the earth.","production_code":"","runtime":60,"season_number":2,"show_id":34992,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":45771,"poster_path":"/DRYYwDoPuVzuWJ2A64MP0YvQYx.jpg","season_number":2,"vote_average":0}}}