{"adult":false,"backdrop_path":"/hvLjMoZ9StBSeSYPAZBlrwU0ifR.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"1990-09-15","genres":[{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"}],"homepage":"http://www.billandted.org","id":35006,"in_production":false,"languages":["en"],"last_air_date":"1991-11-16","last_episode_to_air":{"id":796142,"name":"The Apple Doesn't Fall Far From The Phone Booth","overview":"Ted's dad is threatening to send Ted to military school, so the dudes visit him as a teenager to learn discipline, only the find Ted's dad wasn't as disciplined as he claimed!","vote_average":0,"vote_count":0,"air_date":"1991-11-16","episode_number":8,"episode_type":"finale","production_code":"","runtime":30,"season_number":2,"show_id":35006,"still_path":null},"name":"Bill & Ted's Excellent Adventures","next_episode_to_air":null,"networks":[{"id":16,"logo_path":"/wju8KhOUsR5y4bH9p3Jc50hhaLO.png","name":"CBS","origin_country":"US"}],"number_of_episodes":21,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Bill & Ted's Excellent Adventures","overview":"The misadventures of two time-travelling slackers as they travel into the distant past and future.","popularity":9.608,"poster_path":"/6JhwrUjk905wmhp7s7B0UeuyOma.jpg","production_companies":[{"id":365,"logo_path":null,"name":"Nelson Entertainment","origin_country":""},{"id":1353,"logo_path":"/yXhCcOFK5Fy3ZBQwhBYx8Zu9ZIw.png","name":"Hanna-Barbera Productions","origin_country":"US"},{"id":20477,"logo_path":"/u0zjebYOFWdLcpR4hxE8o2zwHKQ.png","name":"DiC Entertainment","origin_country":"US"},{"id":23899,"logo_path":"/i9PntvaSOFRynGQPTNHY83FHhPk.png","name":"Orion Television","origin_country":""}],"production_countries":[],"seasons":[{"air_date":null,"episode_count":5,"id":45780,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"1990-09-15","episode_count":13,"id":45779,"name":"Season 1","overview":"","poster_path":"/dfwFJ1eAQd1YbxOFuxAzrWEkce5.jpg","season_number":1,"vote_average":0},{"air_date":"1991-09-14","episode_count":8,"id":45778,"name":"Season 2","overview":"","poster_path":"/28DdDRbLp3wQ7wAJiZYwGVfXHlD.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.714,"vote_count":14,"season_data":{"1":{"_id":"5258dc2f760ee3466175a4ec","air_date":"1990-09-15","episodes":[{"air_date":"1990-09-15","episode_number":1,"episode_type":"standard","id":796143,"name":"One Sweet & Sour Chinese Adventure - To Go","overview":"Bill & Ted are rehearsing in Bill's garage when their loud music knocks Missy's \"brand-new antique\" Chinese vase off its shelf.  Desperate to replace the broken vase before Missy gets home, the dudes travel back to Ancient China in search of an authentic substitute.  Once in China they are arrested for causing a mess in a vase store (called 1000 Vases of Dr. Lao - a joke relating to the cult movie classic The 7 Faces of Dr. Lao) and are sentenced to building the Great Wall of China (a couple of days work - which falls down as soon as they are released).  Unaware that their phone booth, which was parked in a tow away zone, has been taken to Kublai Khan's palace, the dudes stop at Oodles of Noodles for some lunch.  Rufus slips them a note via fortune cookie to let them know about their booth, and they have to explain the concept of Chinese take-out to the waitress named Kitten Kaboodles, who offers them a free vase which is exactly like Missy's.  On their way to the palace they are shanghaied and taken aboard Marco Polo's ship, which is for the best because Kublai Khan had given Marco Polo the phone booth (claiming it would take four photos for a dollar except it was broken) as a going away gift.  Bill & Ted find themselves put to work swabbing the deck and later painting the ship.  Not appreciating the wild paint job the dudes do on his ship, he makes them walk the plank (and a shark ends up eating their vase), but through a wild series of mishaps they all end up taking the booth back to Italy when the ship sinks.  In Italy, Marco Polo reports back to his boss, who is angry when he finds out Marco Polo forgot the rice.  Bill and Ted offer the man their take out noodles instead, which he likes so much he decides to rename them (his dog Spaghetti eventually providing the inspiration).  Marco Polo sees Bill and Ted off, both of whom are disappointed they didn't get a vase, until Marco offers them one of the free vases he got from the same Chinese restaurant.  Upon returning home, the dudes accidentally break the new vase and have to confess to Missy they broke her vase.  Missy then confesses her vase was a freebie given out by the new Chinese restaurant in town, Oodles of Noodles.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258dc2f760ee3466175a597","order":500,"adult":false,"gender":2,"id":13593,"known_for_department":"Acting","name":"Jonathan Winters","original_name":"Jonathan Winters","popularity":10.327,"profile_path":"/c2pp7XSUBTbUyptlDjaEhoyz9QX.jpg"},{"character":"","credit_id":"5258dc2f760ee3466175a5ad","order":501,"adult":false,"gender":2,"id":22865,"known_for_department":"Acting","name":"Little Richard","original_name":"Little Richard","popularity":6.032,"profile_path":"/1JKKUNsQLHORat0YxqDYyQeydhS.jpg"},{"character":"","credit_id":"5258dc2f760ee3466175a5c3","order":502,"adult":false,"gender":2,"id":14104,"known_for_department":"Acting","name":"Phil Hartman","original_name":"Phil Hartman","popularity":13.295,"profile_path":"/6LLX6bfWMD1MDN4DV2di8nzFZil.jpg"},{"character":"","credit_id":"5258dc2f760ee3466175a5d9","order":503,"adult":false,"gender":2,"id":4175,"known_for_department":"Acting","name":"Jeffrey Tambor","original_name":"Jeffrey Tambor","popularity":11.664,"profile_path":"/e4IkxsEo5O4oUWrIpXlEhWa6lqB.jpg"}]},{"air_date":"1990-09-22","episode_number":2,"episode_type":"standard","id":796144,"name":"The Birth Of Rock 'N Roll Or Too Hip For The Womb","overview":"Bill and Ted are in danger of flunking their Music Appreciation class most heinously (they identify the William Tell Overture as the theme song to The Lone Ranger) unless they write an essay on classical music by the next morning.  They head to the San Dimas Mall to do some research but aren't able to relate since none of the old time dudes played electric guitar.  Rufus shows up, unable to assist them, but with clearance to say three words, \"Wolfgang Amadeus Mozart\".  The dudes travel back to Salzburg, Austria, to ask Mozart for help with their report, but accidentally go back too far and end up babysitting the way juvenile pre-composer instead.  Intending to take Mozart into the future in hopes he'll relate to Deacon, the trio is waylaid when Wolfie needs to make a pitstop and they end up in Macon, Georgia in the 50's where Wolfie's pranks inadvertently gets a young dishwasher named Richard Penneman fired from his job.  Bill & Ted recognize the unemployed man as Little Richard and encourage him to pursue a future in recording, helping him along by paying him to babysit Mozart while they search for another composer to help with their report.  In search of William Tell (who wrote that most outstanding overture) the dudes venture to Switzerland, and after a harrowing slide down the Matterhorn in their phone booth, they run afoul of the egregious authority figure who's obsessed with the beauty of his own hat, which they cause to land in some mud, and are thrown into prison.  In the meantime, Little Richard books a recording studio to record his first demo and with the help of an intrigued little Mozart, comes up with a whole new style of music destined to take the world by storm.  Meanwhile, during their incarceration Bill & Ted briefly meet William Tell, who simply informs them he hates music before making his escape.  Facing a lengthy prison sentence, the dudes plead to have an alternative punishment, and are told if one can shoot an arrow of the other one's head they can go free.  Ted succeeds in shooting an apple off Bill's head with a paper triangular football (folded from an 81/2\" x 11\" piece of notebook paper, three hole punched) but only after he also manages to knock the authority figure's hat in the mud again.  They make an escape back to Georgia in time to see Little Richard and the Wolfman ride up in a fancy car (driven by Rufus), the former now a huge musical success.  Little Richard returns the favor by performing \"Good Golly, Miss Molly\" with Mozart in the San Dimas High School yard for Bill & Ted's report on how rock 'n roll and classical music are really one in the same.  They then return Mozart to his time period where his parents are distressed to learn he has decide to become a most bodacious musician.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-09-29","episode_number":3,"episode_type":"standard","id":796145,"name":"A Most Excellent Roman Holiday","overview":"Bill and Ted are called to Vice Principal Ryan's office for a meeting with their parents after they sign up for spring term classes . . . choosing only Study Hall and Girls P.E.  There they learn they are to take a series of most egregiously tough classes, including Latin!  They are horrified to learn that the Latin class is made up entirely of dweebs, and that their first assignment is to decipher the Latin on a rare ancient Roman coin minted for only one day in the realm of Julius Caesar.  Conferring at the Circle K, they decide to go back to when the coin was made to find one.  Accidentally they find themselves in Latin America instead, in the midst of an Incan rain dance ceremony.  They are mistaken for rain gods and given a sumptuous banquet.  All is well until they are called upon to make it rain, and when they can't the Incans attempt to boil them in oil as a sacrifice to their Sun God.  The Three Most Important People send Rufus to their aid, but before he arrives the dudes are able to escape by talking the Incans into letting them make one phone call.  As Bill & Ted head to Ancient Rome, Rufus finds himself the new target of the Incans' sacrifice (luckily he is later saved by the Three Most Important People).  After a close call landing in the middle of a fight between two gladiators, Bill & Ted decide the best way to get the coin they need is by working for it.  They are hired by a woman who needs help catering Caesar's tailgate party.  They find themselves in the palace of Julius Caesar and unwittingly become the scapegoats for two evil Romans plotting to do away with Caesar by poisoning his grape juice.  Spilling food on Caesar, Bill accidentally rips the man's robe trying to clean it, but the new ripped style catches on with those in attendance, leading to the first toga party.  As the dudes attempt to serve Caesar his grape juice, the emperor calls for a food taster (picking out Rufus, who is in disguise as a partying Roman).  It is discovered the drink is poisoned, and Rufus helps the boys escape.  They are pursued by the two evil Romans, in a combination James Bond / Ben Hur style chariot race.  Ducking into the Coliseum to escape their pursuers, Bill & Ted find themselves the main attractions facing a hungry lion.  Rufus steps in, acting as referee, to save the dudes from being eaten.  Realizing they need to save Rufus in turn, Bill & Ted hope to rain out the game by doing the Incan rain dance, which works.  Bill & Ted are then captured and about to be found guilty of trying to murder Caesar when the real assassins are revealed and Bill & Ted are declared heroes instead.  Caesar proclaims it Bill & Ted day and announces the minting of a one-time only, collector's item commemorative coin.  Back in San Dimas, the Latin class has deciphered the front side of the coin as meaning \"Let the festivities be prolonged ad infinitum\", or as Bill & Ted point out, \"Party On, Dudes\".  The dudes pass their Latin assignment by translating the flip side of the coin as \"Be Excellent to Each Other\".","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-10-06","episode_number":4,"episode_type":"standard","id":796146,"name":"Model 'T' For Ted","overview":"After Detective Logan manages to survive Ted's 41st (and last) driving lesson in his dad's most macho squad car, Bill expects Ted to drive them down to the record store to pick up the new Iron Maiden CD.  Borrowing Detective Logan's Classic 1973 Plymouth Duster named \"Blue Betty\", and with Rufus along as their licensed driver (he shows up to take their phone booth in for its 20,000 Year Checkup) they end up stalled in the middle of an intersection and blocking traffic.  Leaving Rufus to try to fix the car, the dudes go back in time to try to find someone to help them.  Dialing in Plymouth they end up at Plymouth Rock when the Pilgrim's have just landed.  Caught between the fighting Pilgrims and Indians, they offer to cook them dinner to help them come together.  They are told to cook a baby turkey, but unable to harm the little creature they instead serve up cherry, cranberry, corn, squash and trout Frosty Slushes then Chicago-style pizza, which land them in the stocks.  They are freed by a Native American wanting their trout Frosty Slush recipe and again attempt to use the booth to continue their quest, but the booth goes out of control because of not being serviced and they end up on the ship of Sir Frances Drake, who is being attacked by the infamous Pirate O'Malley.  When the ship is boarded by the pirates, it turns out Pirate O'Malley is a woman, and Bill & Ted point out she doesn't have a parrot on her shoulder and offer her the baby turkey they rescued earlier.  It is then disclosed that O'Malley wasn't attacking Drake to rob him, she simply wanted him to join her bowling league (the cannonballs were actually bowling balls).  Returning to San Dimas, the dudes find Rufus being arrested by Ted's dad for stealing and tearing apart his car.  Overhearing Ted's Dad saying it would take a Henry Ford to put the car back together, they attempt to travel to Detroit in 1903, but accidentally end up in Dayton, Ohio, where they meet the Wright Brothers.  The brothers are working on a faster bicycle, but Bill & Ted use it to fly up to where their phone booth has gotten stuck, inspiring the Orville and Wilbur to go build a phone booth.  Finally arriving in the right time, the dudes find Henry Ford stalled in an intersection in his horse and wagon and convince him to go to San Dimas with them.  They find Ted's dad's car in the impound lot and Henry Ford manages to put it back together.  He enjoys the work so much he decides he will build cars from then on.  Bill & Ted then explain to Detective Logan that Rufus was only trying to help them fix Blue Betty, then overhear that a load of Iron Maiden CDs has spilled into an intersection and hurry there to help them clean up the mess, and are given free copies of the CD in return for their help.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-10-20","episode_number":5,"episode_type":"standard","id":796147,"name":"The More Heinous They Are, The Harder They Fall","overview":"Ted is practicing guitar in his room when a most odious aroma assails his noseholes.  He finds his little brother, Deacon, in the backyard turning on the water hose to wash himself off.  Deacon relates how Killer Gabron, a bully at school, threw him into a garbage can.  Ted decides to try helping Deacon deal with his bully problem.  He finds Bill playing video games at the Kozy Korner and as they ponder the situation Rufus appears briefly (in the video game) to tell them they need to figure out what to do themselves.  They decide to go back into history and find a most heinous bully to take care of Deacon's bully.  They first visit Henry VIII, but he cannot help them because he has a date with Ann Bolin, so he suggests they try Ivan the Terrible.  They go to Russia to seek out Mr. Terrible, only to find that in reality he's a major dweeb (his fierceness, he explains, is all image).  They next head to South Dakota to seek out Calamity Jane, who they find, true to her name, makes calamities happen wherever she goes.  She agrees to go with them, but her awesome talent of destruction sabotages their booth, so they push her out before they spiral out of control through time.  They pop up into the silver shop of Paul Revere.  When Bill accidentally knocks over the Liberty Bell, causing it to crack, Paul Revere mistakes the dudes for British spies.  Escaping from the shop, the dudes duck onto a ship where they are put to work unloading a shipment of British tea.  They accidentally drop two crates of tea into Boston Harbor, which inspires some revolutionists (who just happen to be dressed like Indians for a costume party) to stand up to their oppressors and dump all of the tea into the harbor.  Bill & Ted are heralded as the leaders of the American Revolution.  They ask if anyone can help them fix their phone booth, and Benjamin Franklin volunteers, using a kite to channel lightning into the booth.  The revolutionists ask Bill & Ted to stay and help them.  Ted makes a speech, saying he has learned that only if people work together can they stand up to bullies.  The dudes return to San Dimas and tell Deacon to stand up to Killer Gabron.  Deacon does this, inspiring the other kids in his class to also stand up to the bully, who gets his just desserts (ending up in the garbage himself).  Bill and Ted ponder the fact that they brought about the American Revolution but no one will ever know, so they time travel to 1776 to sign the Declaration of Independence, only to find that John Hancock has hogged all the space (we learn it was, in fact, Rufus, singing the name big so the dudes would not be able to sign themselves).","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-10-27","episode_number":6,"episode_type":"standard","id":796148,"name":"Birds Of A Feather Stick To The Roof Of Your Mouth","overview":"Bill & Ted agree to housesit for Bill's neighbor, an eccentric explorer and bird expert named Mr. Stickler.  They are instructed to make sure Mr. Stickler's cat, Max, stays out of the house to protect Prince Rupurt the III, his prized African buff-headed wood hoopoe.  Unfortunately, no sooner does Mr. Stickler leave than the dudes find out they accidentally left the door open and Max has already made a snack of the rare bird.  Realizing they need to find a replacement bird, they look up \"bird\" in the Circuits of Time directory and end up in Antarctica with explorer, Admiral Byrd.  Having landed on his sleigh dog's kennels, the dudes must rebuild them before going with Admiral Byrd, which they do by making it out of ice, igloo style.  Unfortunately they are not in time to fly with Admiral Byrd and start out after him on dogsled.  They meet up shortly afterward to find all their compasses going crazy, and Byrd announces they have discovered the South Pole.  Unfortunately for the dudes, there are no birds around except penguins, so they continue their search through time.  They land in Egypt where they are put to work on the Pharaoh's tomb.  They accidentally cause a giant block to drop on the Pharaoh's barge and are brought before King Tut for punishment.  Seeing they are about to use a large tablet to write upon, Ted suggests they use one of Prince Rupert's feathers and some of Nefertiti's eye makeup, showing them how to write with a pen and paper.  Impressed by this, King Tut gives Bill & Ted the honor of immortalizing his face in stone.  They proceed to build the Sphinx for him.  Unfortunately, they make the nose so large it falls off.  Infuriated, King Tut sends his guards after the dudes and they are only able to escape after Rufus intervenes, distracting the guards with the second booth.  They next travel to Africa where they end up on the boat of Henry Stanley, newspaperman, and his monkey companion, Jane, who are searching for explorer Dr. Livingston.  He points out there are plenty of the birds around and even catches one for them.  Mr. Stanley asks Bill & Ted to stay for dinner.  Unfortunately the villagers serve them the dudes' replacement bird and they must continue on with Mr. Stanley to find another one.  After making it through some white water rapids, Henry Stanley finds Dr. Livingston, who offers Bill & Ted another replacement hoopoe, anxious to get rid of the noisy creature.  The dudes hurry the new Prince Rupert the III to Mr. Stickler's house and it looks like their deception has worked until Prince Rupert turns out to be a Princess Rupert and lays an egg.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-11-03","episode_number":7,"episode_type":"standard","id":796149,"name":"A Black Night In San Dimas","overview":"Bill & Ted are rehearsing for Wyld Stallyns to play at the school dance (no one else tried out).  They arrive late at school and accidentally slip into the girls' health class during a movie and are caught by Miss Spleen, who reprimands them for being late for her math class and forgetting homework and threatens to have them expelled and kept from playing at the school dance.  Later at the Kozy Korner, Ted purchases a blue Frosty Slush in a silver collector's cup before the dudes head back in time to pick up the Princess Babes to sing with the band at the dance.  They accidentally end up in the middle of the Crusades where they run afoul of Saladin.  He is ready to arrest them until he spots Ted's silver collector's cup and believes it to be the Silver Chalice.  Just then the Black Knight bursts in and steals the Silver Chalice for himself.  Believing Bill & Ted crossed them, Saladin's men start after them but they are able to escape in the booth.  They arrive in England just as the Black Knight returns from the Crusades with the Silver Chalice as a gift for the king, who offers the Knight one of his daughters in marriage as a reward.  Determined to save the babes, Bill & Ted infiltrate the castle and dress as jesters to entertain at a banquet.  Their feeble attempts at juggling and magic acts tips off the Black Knight, who announces they are there to steal the Silver Chalice.  The dudes manage to get away and sneak into the rooms of the Princess babes, where the Black Knight shows up and demands Joanna's hand in marriage.  At the wedding, the princesses are saved when Rufus disguises himself as Joanna long enough to allow the dudes and babes to escape.  Chasing after them, the Black Knight is sucked into the time circuit and swept along to San Dimas with them.  At Ted's house the Black Knight lands on the roof and crashes down through the chimney.  They keep him in a state of unconsciousness by playing Lawrence Welk polka classics for him.  Bill & Ted leave Deacon with the Princess Babes and Black Knight as they hurry to school to avoid being punished by Miss Spleen.  Back at Ted's house, the Black Knight comes to and chases after Deacon and the Princesses.  Unable to reach anyone by phone, Bill & Ted hurry home to find out what's happened.  They spot Detective Logan racing to where the Black Knight is riding through town, causing havoc.  Realizing they must do something, the dudes look in the Circuits of Time Directory for someone to help them and come across an ad for Wyatt Earp.  They travel back to Tombstone, Arizona, where they land on a stagecoach Jesse James is trying to rob.  They continue on to town with Jesse James on their tail, leading the bandit right into the hands of sheriff Wyatt Earp.  Wyatt Earp declines going back to San Dimas with them, saying he has a lunch date with Calamity Jane, but deputizes the dudes to take on the Black Knight themselves.  Returning to San Dimas, they face the Black Knight in the center of town at high noon and they attempt to rope the Black Knight but fail (Ted forgets to hang on to his end of the rope).  The Black Knight escapes, and Bill & Ted are picked up and returned to school by Ted's dad.  They are just in time for Miss Spleen's math class where they haven't done their homework.  Miss Spleen gives them a chance to still attend the dance by asking them to solve a long, complicated problem on the blackboard.  They take a guess and actually get it right, so they are allowed to play at the dance, only to find out Miss Spleen will be the chaperon.  At the dance, Wyld Stallyns are performing when the Black Knight bursts in.  He is knocked off his horse by the loud cacophony of sound when Joanna accidentally knocks Ted's electric guitar out of his hands, and when Miss Spleen investigates she and the Black Knight fall immediately in love.  Rufus arrives to whisk the happy couple away back to England, and Wyld Stallyns continues to play at the dance.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-11-10","episode_number":8,"episode_type":"standard","id":796150,"name":"Pocket Watch Full Of Miracles","overview":"Bill is sleeping soundly on a Saturday morning when Missy wakes him up, asking him to go buy a present for Mr. Preston's surprise birthday party.  She had found an antique pocket watch just like the one Mr. Preston always talked about losing as a child.  Instead Bill rehearses with Ted in the garage, and when they blow an amp they decide to use the money to buy themselves a new amplifier, thinking they can simply go back in time and get the watch before Bill's dad loses it instead.  However in the excitement of getting a new amp, they forget to get the watch.  Unable to find a listing for Bill's dad, they call the Circuits of Time operator and get Rufus, who is working the switchboard.  Rufus explains they are not allowed to go back into their own pasts for fear they might accidentally mess something up.  Instead Ted calls Bill's dad and pretends he's a contest representative and says Mr. Preston will win a bevy of fabulous prizes if he can remember his phone number from when he was ten.  Having what might be the number, they dial back to San Francisco, 1956, landing on the cable car tracks.  They mistake a hip kid for Bill's dad and follow him into a beatnik club, where they are scared off by the kid's mean-looking dad.  Riding the cable car back to their booth, the realize they are sitting next to Bill's dad, and when they get off the cable car a man tries to steal the kid's watch, but Bill & Ted intervene, giving the watch back to Bill's dad.  Unfortunately, he unknowingly drops it again and it rolls down a hill and gets run over by a cable car.  Bill & Ted then travel to Big Bend, West Virginia, since Bill's dad had said it was an antique railroad pocket watch.  They land on the private train of the railroad boss and find out the man owns the watch they are looking for.  Thrown off the train, they are caught by John Henry.  The boss man is introducing a new steam drill which will take over the work of his men.  John Henry offers to take on the boss man's new machine to prove that men can still work better than machines, and at Bill's urging asks for the watch if he wins.  John Henry wins the contest and is given the watch, which he then gives to Bill, but the angry boss man tries to run them down with his train and proceeds in flattening the watch once more.  Next the dudes go to Switzerland, land of watches.  There they have no luck finding a watch, but they help lure Hannibal's elephants through the pass by enticing them with a chocolate bar, which the native Swiss people start making their own chocolate.  The elephants fight over the chocolate and end up ripping the sugar sacks on each other's backs, sprinkling the countryside with a coating of sugar (people promptly take up skiing).  The dudes save Hannibal from being crushed by one of the elephants and in return he gives them his watch, but it turns out to be a sundial.  Having overheard the railroad boss as saying his watch once belonged to Queen Victoria, they head to England and land on Big Ben before dropping into her coach.  She kicks them off and they infiltrate Buckingham Palace dressed as beefeaters.  They are captured, but not before ruining the Queen's ceremonial crown.  Ted fashions a hat out of the proclamation and crowns Queen Victoria empress of India.  As a reward, she says they can have whatever they want, and Bill asks for her watch.  She agrees when Ted throws in a box of antique Swiss chocolates as well.  They hurry back to San Dimas in time to give Bill's Dad his birthday present, and Mr. Preston is amazed to find they have found the exact same watch he lost on his tenth birthday, with the inscription \"Time is Money\" inside.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-11-24","episode_number":9,"episode_type":"standard","id":796151,"name":"This Babe Ruth \"Babe\" Is A Dude, Dude","overview":"Bill and Ted are heading to school, admiring their new pump sneakers which they have for gym class.  They notice Rufus going into the bowling alley nearby to rent all the shoes they have to deliver to the Yankee soldiers who have missed a shipment of shoes.  Bill & Ted offer their own pump sneakers to the cause as well.  In gym class, they anger Coach Sweatsocks when they run through the hurdles instead of over them and do not have their shoes.  He punishes them to polish his trophies, including his autographed Babe Ruth baseball.  They accidentally drop the Babe Ruth baseball into some water, which washes off the signature.  Seeking Babe Ruth, whom Coach Sweatsocks said was a famous Yankee, and remembering Rufus was delivering shoes to Yankee soldiers, they head back to the Civil War where the only reference to baseball they can find is a guy named Abner Doubleday, who is perfecting the idea of the game.  Bill & Ted get involved in a ball game between the Yankees and Confederates, where they offer suggestions on how to improve the game (such as only having four bases and using a baseball instead of cannonballs).  Unfortunately they only manage to lose the baseball itself.  Getting into their booth to escape they discover a woman hiding inside, who introduces herself as Harriet Tubman, who was leading a group of escaped slaves to the North.  Her short travel in the Circuits in Time inspires her to build an underground railroad.  Bill & Ted continue on, landing in Transylvania.  Their booth is accidentally taken by a hunchbacked man who works for \"The Count\".  Bill and Ted are then captured by a mob of angry villagers, who want to drown them for being cousins of Count Dracula.  Rufus arrives to give the dudes back their shoes, and helps them escape from their captors.  They head to the castle to retrieve their phone booth and find an irate Dracula angry because he can't get any sleep in the new \"coffin\", which is the boys ringing phone booth.  The dudes pose as coffin repair men and play a soothing tune for Dracula on the dial buttons.  They then manage to get Dracula out of the booth and continue on to Yankee stadium where they hope to get some hot dogs.  They are almost kicked out by a policeman for not having tickets but manage to elude the man.  To their surprise, they hear Babe Ruth being announced as coming up to bat.  They ask him for an autograph, but he doesn't have time and so he gives them a small photo instead.  The policeman catches up with the dudes and throws them out of the park, where they crash into a vendor's cart.  Then man is trying to sell a new invention he calls Blibber Blubber, which Bill & Ted soon realize is actually bubble gum.  They offer to trade the photo of Babe Ruth for some of the gum, which gives the inventor the idea to market the new candy with trading cards of baseball players.  As the boys stand chewing their gum, they hear the announcer inside the stadium relate that Babe Ruth has hit home run number 60 out of the park.  They are thrilled to find the baseball also contains the Babe's signature.  They hurry the ball back to the gym where Coach Sweatsocks is thrilled to see they have cleaned his ball and have their shoes back.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-12-01","episode_number":10,"episode_type":"standard","id":796152,"name":"When The Going Gets Tough Bill & Ted Are History","overview":"Bill & Ted give a free Wyld Stallyns concert in the park, only to be totally walked out on.  This depresses them to the point they decide not to continue trying to be musicians.  In the future San Dimas, the Three Most Important People summon Rufus and explain what has happened, saying that their future is on shaky ground.  If Bill & Ted do not continue to try to create their music, life as they know it will cease to happen and time has started running backwards.  They tell Rufus that he must not tell them about what is happening to the future, he must instead show them that they need to keep trying.  Rufus drops in on the dudes, slightly younger and his hair longer.  He realizes that he will continue to get younger until Bill & Ted decide to go back to music, and so he asks them to help him with an unspecific problem, giving them an itinerary they are supposed to follow.  Their first stop is at Thomas Edison's laboratory.  They find Edison trying to perfect his phonograph, but having no luck.  Bill & Ted encourage Edison not to give up, and Ted accidentally knocks one of the inventor's stale pancakes (he hadn't felt like eating in a while), which inspires Edison to pound his cylinder flat and make a record instead.  Returning to the booth, they find Rufus has turned into a geeky teenager.  They continue to follow the itinerary Rufus gave them and end up in the workshop of Leonardo DaVinci, who is working on his spiny-winged-up-and-down-flying-thingy without much success.  Rufus turns nine years old and starts running amok in the inventor's workplace.  Young Rufus insists he can build Leonardo's flying thingy and proceeds to make one out of the phone booth.  It succeeds in flying, for a little bit, but it inspires Leonardo to keep trying.  Not sure they're reading their next destination correctly, they take a chance and end up in the lab of Joseph Priestley, who had just discovered how to carbonate water.  Rufus becomes an even younger kid and starts mixing chemicals together, managing to mix some cherry jam in with the soda, making the first soft drink.  Joseph Priestley is inspired to start working right away on diet soft drinks.  Their next stop takes them to the docks of Spain where Christopher Columbus is trying to convince people to invest in his voyage to the new world.  At this point Rufus turns into a mere infant.  Bill & Ted convince Columbus to try getting a loan from the Queen (if he doesn't discover America, there will be no Columbus Day, one less school holiday).  The Queen and King Ferdinand give him the money just to get rid of him.  Returning to San Dimas, Bill & Ted realize they have found the inspiration from the historical figures they have met to continue trying to make it as Wyld Stallyns, which restores Rufus to his former self and puts the future right again.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-12-08","episode_number":11,"episode_type":"standard","id":796153,"name":"Never The Twain Shall Meet","overview":"Bill & Ted face the most heinous event of their lives when Mr. Ryan announces they are expelled.  Terrified of what Ted's dad will do to him, the dudes ask for a second chance.  Mr. Ryan says that if they can line up someone incredible for tomorrow's Career Day they may have a chance to stay in school.  At the Kozy Korner they try to decide who to get to speak.  Remembering the statuettes on Mr. Ryan's desk, they go in search of Shakespeare and Mark Twain.  They arrive in England to find Shakespeare's newest play, Romeo and Juliet, about to open.  When they buy tickets with U.S. money they are considered crooks and chased by ushers.  They accidentally end up on the stage where the confuse the theater goers, who begin throwing vegetables.  Overhearing Shakespeare lamenting over what he chose to be, they urge him to \"Be what you want to be . . . or not.  Whatever.\"  Bill & Ted reach their booth and travel to Sacramento, California, where their booth lands in one of the flumes at Sutter's Mill.  John Sutter insists that the boys are going to work in his mine until they've paid for the damage to his flume.  Finding they aren't making much progress with mining, Bill & Ted instead revert the flume into the first waterslide and charge other miners admission to ride.  Getting back into their booth, they find it to be full of frogs from the river they had been working in.  Bill & Ted try again to find Mark Twain, but only see a listing for Samuel Clemmons and travel to the Mississippi River where they land on a riverboat, releasing the frogs to run amok on the boat.  They find the captain, Samuel Clemmons, yelling out \"mark twain\" (two fathoms) and try to ask him where Mr. Mark Twain is.  Unfortunately the frogs cause such a commotion and Samuel Clemmons gets fired from what he says is yet another job (he'd been through many careers already).  Bill & Ted play leapfrog to lure the frogs into one room and in deciding what to do with the creatures they get the idea to hold races on the boat's deck and have the passengers bet on the races.  Unfortunately the races get out of control and it proves to be no solution.  However, Samuel Clemmons is not upset . . . the incident has inspired him to write a short story and become a writer (Bill & Ted never make the connection that he is in fact Mark Twain).  Returning to San Dimas without a speaker, they decide to ask the mayor to attend as a last resort and are surprised when the man agrees, arriving with a police escort to the San Dimas auditorium and impressing Vice Principal Ryan enough to keep him from expelling the dudes.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-12-15","episode_number":12,"episode_type":"standard","id":796154,"name":"A Job, A Job - My Kingdom For A Job","overview":"Bill & Ted's fathers make it clear that they are not getting any more advances on their allowances, leaving the dudes with a most serious low cash flow crisis.  Rufus meets them at the Kozy Korner where he shows them a Wyld Stallyns hologram which has suffered an electrical glitch and wiped out the sound and he's been sent back to find out what song it is.  The dudes want to rehearse but realize that they need money and have to find part time jobs.  They apply for work in the food court at the San Dimas Mall, only to find they have no past experience to put on their applications.  They decide to go to France to study food and land at the palace of Marie Antoinette, who is in tears because her chefs have quit and there is no one to bake her birthday cake.  Bill & Ted offer to bake the cake in exchange for a recommendation.  Outside they find Jacques and Joseph Montgolfier working on blowing up their hot air balloon and ask if they can borrow their fire to bake their cake.  The balloon gets away from them and snatches up their phone booth, taking Bill, Ted and Marie Antoinette on a ride.  Seeing the masses of people below, Marie thinks they are an admiring crowd and throws them some of her birthday cake, saying \"Let them eat cake!\"  She writes a recommendation in the frosting of the cake and they head on to their next destination.  They land in Venice, Italy, where they get jobs as gondola taxi hacks.  Their first passenger is Lucrezia Borga, who is running away from her father to meet with her secret lover, who chases after them.  When their gondola is swamped by a larger boat, they escape by using the phone booth as their gondola instead.  Lucrizia asks Bill & Ted to sing her message to her lover, Antonio, and he comes down to meet her.  Her father finds them and chases after the dudes again, who disguise themselves as fish mongers to escape.  Lucrizia is grateful to them for helping her escape from her father and gives them a recommendation as well.  They next travel to Northern Mexico where they meet up with Juan D'Onote on his search for the Lost City of Gold, who is impressed they could find water in the desert (their booth was full of water from the Venice canals).  They are given jobs as scouts, but the previous scout is angered and threatens them with violence for taking his job.  An Indian arrives and shows that his people already live in the Lost City of Gold.  D'Onote claims the land and comes up with the name Santa Fe.  Bill & Ted are chased off by D'Onote's former guide, but are helped in their escape by the Indians.  They next land in a Japanese barber shop where they meet samurai in training Matsu Basho, who would rather write haikus than cut hair.  Bill & Ted find Basho's haiku's too depressing and write their own enthusiastic one.  As they sing, they cut a samurai's hair for him unevenly and put it up into a bun instead.  Basho's father is happy with the new style and congratulates his son.  Back at the San Dimas mall, Bill & Ted are offered jobs at the Geisha Grill, but spotting someone they think is the samurai they run off before they can take the jobs (it turns out it was only the Grill's cook).  Rufus drops in on the boys again to see how things are going, and Bill & Ted say they have learned working is hard and they will be more careful with their money.  They also play their new haiku for Rufus, who is thrilled when he realizes they are the missing lyrics he's been looking for.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1990-12-22","episode_number":13,"episode_type":"finale","id":796155,"name":"A Grimm Story Of An Overdue Book","overview":"Bill & Ted are getting ready to climb aboard the school bus heading for an excellent school ski trip when Rufus drops in and asks if they would attend Be Excellent to Each Other Day in the future, but they decline, telling him about their ski trip.  Before they can board the bus, however, a Bookmobile with flashing lights pulls up and they find themselves facing Sgt. Joe Donaldson of the library police.  He informs Ted that he is the library's Most Wanted fugitive for not returning the library's copy of Little Red Riding Hood which he checked out when he was six, and that he now owes $35,000 in back library fines.  Asking if they can at least make one phone call, they escape to their booth and decide to find the Grimm Brothers to obtain a copy of the book.  They find the two authorities on grammar being evicted from their home for not paying their rent.  Brother Jacob decides he might want to try his hand at writing folk tales, while Brother Wilhelm says it's silly.  Bill & Ted realize they must stick with the brothers until they write their stories.  They help the Brothers escape from the law and take them through time.  Landing at Valley Forge, they end up getting to ski after all, running down George Washington.  The Brothers Grimm are sent to the brig, Bill & Ted are made lieutenants, and Washington buys a portrait which Rufus was doing of him nearby (he buys the painting from Rufus for a dollar).  Washington instructs Bill & Ted to come up with something for his last seven soldiers to eat, but isn't impressed with their snow cones and plain frosty slushes.  The cold treats make Washington sneeze, causing an avalanche which clears a path and allows Martha Washington to be able to get through with some food, covered with snow (this inspires Jacob to think up Snow White and the Seven Soldiers).  Bill & Ted and the Brothers Grimm manage to escape in their booth to Tennessee where they find themselves in a forest facing an angry bear.  In their escape they run into Davy Crockett who says he's trying to track down their bear, which has taken off with their phone booth.  Jacob starts thinking up stories about three bears living in a house.  Rufus arrives to ask if they still want to attend the party with him, but when the bear shows up again they all beat a hasty retreat, only the bear and Davy Crockett manage to go along for the ride.  They all end up in the future at Be Excellent to Each Other Day.  Davy Crockett wrestles with the bear, which the Three Most Important People find outstanding entertainment.  Bill, Ted and the Brothers Grimm go back to time traveling, and during their trip Brother Wilhelm gets so fed up with Jacob's idea for the Bear and the Three Most Important People he throws his brother's notes out of the booth and they have to stop to try to find the pages.  During this stop, Bill & Ted spot a beautiful blonde riding a horse and follow her, ending up landing on her horse.  She says she is Lady Godiva and says she shouldn't pick up hitchhikers, and since they have to go anyway they jump off her horse, inadvertently pulling her red cape off of her.  Seeing the red cape, Jacob becomes inspired to write Little Red Riding Hooded Cape.  Returning to San Dimas, Bill & Ted are taken to the head librarian, who is shocked when they hand her the original manuscript, which she says will pay off all Ted's fines.  The librarian checks to see who the next Most Wanted fugitive is, and it turns out to be Bill, so after the dudes board the schoolbus for their ski weekend we see the Bookmobile chasing them out of town.","production_code":"","runtime":30,"season_number":1,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":45779,"poster_path":"/dfwFJ1eAQd1YbxOFuxAzrWEkce5.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258dc2e760ee3466175a4e1","air_date":"1991-09-14","episodes":[{"air_date":"1991-09-14","episode_number":1,"episode_type":"standard","id":796135,"name":"Now Museum, Now You Don't First","overview":"Heinous mishaps at the San Dimas Art Museum leave both the Venus De Milo and Mona Lisa in shambles and two dudes traveling throughout time trying to replace them.","production_code":"","runtime":30,"season_number":2,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-09-21","episode_number":2,"episode_type":"standard","id":796136,"name":"The Totally Gross Anatomy Of A Gym Teacher","overview":"Bill & Ted find out the hard way exactly what bogus shape their gym coach is in when the new Squint phone system shrinks them and they end up taking a \"fantastic voyage\" through the man's body.","production_code":"","runtime":30,"season_number":2,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-09-28","episode_number":3,"episode_type":"standard","id":796137,"name":"The Star Strangled Banner","overview":"The very existence of all music is threatened when Missy Mom is picked to sing the Star Spangled Banner at the opening of the San Dimas baseball game and her rendition makes Roseanne Barr sound good!","production_code":"","runtime":30,"season_number":2,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-05","episode_number":4,"episode_type":"standard","id":796138,"name":"Leave It To Bill & Ted","overview":"Bill & Ted travel into television to try to change the outcome of one of their favorite old situation comedies, Leave it to Badger.","production_code":"","runtime":30,"season_number":2,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-19","episode_number":5,"episode_type":"standard","id":796139,"name":"Goodbye Columbus.... And America","overview":"Bill & Ted decide to take a cruise and end up on Columbus' ship where they discourage the explorer from wanting to find America & place the future in jeopardy.","production_code":"","runtime":30,"season_number":2,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-26","episode_number":6,"episode_type":"standard","id":796140,"name":"A Most Bogus Day In The Neighborhood","overview":"Another trip into television brings the guys face to face with their childhood idol, Mr. Radish, who is ready to give up his show for lack of viewer interest.","production_code":"","runtime":30,"season_number":2,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-11-02","episode_number":7,"episode_type":"standard","id":796141,"name":"Bill & Ted's Excellent Adventure In Babysitting First","overview":"The dudes go back into their own pasts to try to locate a guitar once owned by Mr. Preston, and end up babysitting themselves!","production_code":"","runtime":30,"season_number":2,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-11-16","episode_number":8,"episode_type":"finale","id":796142,"name":"The Apple Doesn't Fall Far From The Phone Booth","overview":"Ted's dad is threatening to send Ted to military school, so the dudes visit him as a teenager to learn discipline, only the find Ted's dad wasn't as disciplined as he claimed!","production_code":"","runtime":30,"season_number":2,"show_id":35006,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":45778,"poster_path":"/28DdDRbLp3wQ7wAJiZYwGVfXHlD.jpg","season_number":2,"vote_average":0}}}