{"adult":false,"backdrop_path":"/oabyVy7XfFKySoAdHRYlQatEI3T.jpg","created_by":[{"id":17835,"credit_id":"5258ddc7760ee34661771a7a","name":"Ricky Gervais","gender":2,"profile_path":"/2mAjcq9AQA9peQxNoeEW76DPIju.jpg"},{"id":39189,"credit_id":"5258ddc7760ee34661771a80","name":"Stephen Merchant","gender":2,"profile_path":"/6WM2rK6390Nwk398syJbGcPvRct.jpg"}],"episode_run_time":[30],"first_air_date":"2010-02-19","genres":[{"id":35,"name":"Comedy"},{"id":16,"name":"Animation"}],"homepage":"http://www.hbo.com/the-ricky-gervais-show/index.html","id":35305,"in_production":false,"languages":["en"],"last_air_date":"2012-07-13","last_episode_to_air":{"id":1133437,"name":"The Year","overview":"Karl ruminates on the insect world; Stephen recalls the horrors of buying condoms.","vote_average":0,"vote_count":0,"air_date":"2012-07-13","episode_number":13,"episode_type":"finale","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/nbjTkGcp9m1MmaUZW4APg6ixGy2.jpg"},"name":"The Ricky Gervais Show","next_episode_to_air":null,"networks":[{"id":49,"logo_path":"/tuomPhY2UtuPTqqFnKMVHvSb724.png","name":"HBO","origin_country":"US"}],"number_of_episodes":39,"number_of_seasons":3,"origin_country":["US"],"original_language":"en","original_name":"The Ricky Gervais Show","overview":"The Ricky Gervais Show is an American cartoon series produced for and broadcast by HBO and Channel 4. The series is an animated version of the popular British audio podcasts and audiobooks of the same name, which feature Ricky Gervais and Stephen Merchant, along with colleague and friend Karl Pilkington, talking about various subjects behind the microphone. The TV show consists of past audio recordings of these unscripted \"pointless conversations,\" with animation drawn in a style similar to classic era Hanna-Barbera cartoons, presenting jokes and situations in a literal context.\n\nThe animated Ricky Gervais Show has aired 39 episodes across three seasons since it premiered in 2010. There were some plans for a possible fourth season which would have used newly recorded audio, but this was shelved in June 2012. Series 3 of The Ricky Gervais Show premiered on 20 April 2012 on HBO, and on 8 May 2012 on E4.","popularity":8.438,"poster_path":"/17pjo5C1TO6PxfEtMAZX31byHRN.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2010-02-19","episode_count":13,"id":46036,"name":"Season 1","overview":"","poster_path":"/zm1dUr7WlxCsuranbPYOoFEIh8X.jpg","season_number":1,"vote_average":0},{"air_date":"2011-01-14","episode_count":13,"id":46037,"name":"Season 2","overview":"","poster_path":"/bGWePe3uv0mTnyYN88RSP937AXU.jpg","season_number":2,"vote_average":10},{"air_date":"2012-04-20","episode_count":13,"id":71715,"name":"Season 3","overview":"","poster_path":"/po2ElVoBmV2wH4Wt0g13HJPkFLy.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.24,"vote_count":96,"season_data":{"1":{"_id":"5258ddc6760ee346617718ce","air_date":"2010-02-19","episodes":[{"air_date":"2010-02-19","episode_number":1,"episode_type":"standard","id":799671,"name":"Space Monkey","overview":"Ricky and Stephen debate the merits of 20th century inventions with Karl; the guys introduce 'Monkey News.'","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/kzPSin8X7swYfIb81YTSoCQ36kk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-26","episode_number":2,"episode_type":"standard","id":1029467,"name":"Knob at Night","overview":"Stephen shares a news story about 42 midget warriors who were mutilated by a single lion in a Cambodian ring fight, as well as the latest email from a fan, Paul \"The Party Animal\" Parker, who describes a Serbian man who invented a sex machine for women. Karl ponders how to avoid being conned into donating to charities. That conversation segues into a discussion of sex and butt plugs. A dialogue about America's first nudist organization leads Ricky to critique naked gym jocks, inspiring a revelation from Karl. The guys debate if there is ever a good time to eat the penis of a kangaroo? In Monkey News: A pair of chimps are shot to death after viciously attacking a male visitor to an animal sanctuary, targeting his nose, limbs and genitals.","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/o3phUPKcXCJzDWtPV1SY09IMo95.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-05","episode_number":3,"episode_type":"standard","id":1029468,"name":"Charity","overview":"Adding to his wish list of improbable inventions, Karl offers up a serum that ages dead people backwards. Also up for discussion: Do African families really want goats as charitable gifts? Is a space flight worth the money and effort? If you could have any super power, what would it be? How rare is it to see a Chinese homeless person? In \"Monkey News,\" a Moscow network fired so many employees it had to hire a chimp to host a talk show, with Cher as one of the guests.","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/64tt3kQBuDohwH9aUMe9B8wt6jG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-12","episode_number":4,"episode_type":"standard","id":1029470,"name":"Dolphins","overview":"Karl admits he's getting a face rub at a spa, but frets he'll end up getting an enema as well. Also: A discussion about the customs of undocumented tribes in New Guinea. Ricky and Karl's recent trip to an antiquities store, where Karl wondered, \"What's the newest thing you've got?\" An e-mail from an Australian fan insisting there are dangerous armed dolphins ready to do battle. In \"Monkey News,\" Karl recounts the marital regrets of a sympathetic zookeeper who brings home a lonely monkey","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/ukfYl2j6hUDDA8qvzGOxEY6BjjH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-19","episode_number":5,"episode_type":"standard","id":1029472,"name":"Glass Houses","overview":"Karl answers questions from fans; Karl deciphers the true meaning of sayings; Karl’s New Year’s resolution; “Monkey News.”","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/117vRfDoghI4YyjXhGZz2Ieak9B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-26","episode_number":6,"episode_type":"standard","id":799665,"name":"Cobblers","overview":"After receiving a fan letter asking what body part he could live without, Karl recalls when he tried to wash the dishes without using his thumbs. Other fan mail questions: If Karl could be anyone in the world, who would he be? What does he think of the philosopher Descartes? What does he make of the saying “a stitch in time saves nine”? In “Monkey News,” a builder complains when he discovers a chimp working at a new construction site, only to be told the chimp is a good worker.","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/cEbxfo5Ex0il2V6hHRWeJZQ3xTu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-09","episode_number":7,"episode_type":"standard","id":799666,"name":"The Diary","overview":"Ricky and Stephen read passages from Karl's diary, which chronicles his daily observations, as well as profound thoughts. A fan letter asks the guys if they had any nicknames growing up; In \"Monkey News\": When one member of a bobsled team unexpectedly quits at the Winter Olympics, the team secretly replaces him with a monkey.","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/cg8TU77oWbOAd5XiBtd9vQ1orvg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-16","episode_number":8,"episode_type":"standard","id":1029473,"name":"Nuts","overview":"A fan letter asks Karl: If he were on a sinking ship, and could only save either Ricky or Stephen, who would he choose? Karl finds a news report that hedgehogs will be extinct by 2025. Also up for discussion: the story of a man who has a transplanted kidney from a woman and now claims he has an increased interest in housework. In \"Monkey News\": The owner of an airline reportedly hired a monkey to fly as co-pilot during a strike.","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/6BbFikToPyPHdw2SY92UqzMpMuk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-23","episode_number":9,"episode_type":"standard","id":1029475,"name":"The Jockey","overview":"More e-mail questions for Karl, such as: If Karl could talk to any animal, which would it be and what would he say? Highlights from Karl's diary, including why he doesn't like meetings, and why he and his girlfriend always get in an argument after she gets a haircut. In \"Monkey News\": A story from the 1950s about a gangster who bought a racehorse. When none of the jockeys wanted to be involved with him, he got a monkey to race the horse.","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/uwc7Crlx7A0eNBNkcCm4HzwNNOO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-30","episode_number":10,"episode_type":"standard","id":799667,"name":"The Fight","overview":"Topics include: school curricula; physical altercations; human anatomy; whistling and happiness; birds and flight; Karl's thoughts on doppelgangers and the Big Bang; and the origins of the universe. Also: a \"Monkey News\" segment about eye surgery.","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/sXKudlHT2JCAI17g3Rtp1cQ3gk8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-07","episode_number":11,"episode_type":"standard","id":799668,"name":"Beetles","overview":"A fan letter asks Karl to reveal the most romantic thing he's done for his girlfriend on Valentine's Day. Another fan asks him to interpret Wittgenstein's statement \"If a lion could talk, we could not understand him.\" From Karl's diary: He creates a jingle after giving a homeless man some change, and describes his trip to Malaga, Spain. In \"Monkey News\": Karl relates the story of Enos, a monkey who flew in the space shuttle in the 1960s.\n\n","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/krsOBusc4ZJ1w5nVmMg8oQnLy93.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-14","episode_number":12,"episode_type":"standard","id":799669,"name":"Noises","overview":"Stephen asks Karl questions posed to guests on \"Inside the Actors Studio, leading to a discussion of organ donation. From Karl's diary: A news report from India about an elephant who had a giant pair of slippers, and Karl's belief that scientists should give up trying to kill germs because it will only make them stronger and bigger.","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/zGxO7fvo0NSUhEzIKQ6GVNpiQ4T.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-21","episode_number":13,"episode_type":"finale","id":799670,"name":"Freaks","overview":"Another question for Karl from \"Inside the Actors Studio\": \"If heaven exists, what would you like to hear God say when you enter the pearly gates?\" From Karl's diary: A news report that humans will have spoken to aliens by the year 2025 leads him to worry that aliens will try to read his mind, while a story about a baby who looked like a frog makes Karl think life would be more interesting if there were different types of humans. Plus, Karl's top five freaks.","production_code":"","runtime":30,"season_number":1,"show_id":35305,"still_path":"/hrknn5BRQ5Bxedm0pgR5rwPnHiM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":46036,"poster_path":"/zm1dUr7WlxCsuranbPYOoFEIh8X.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258ddc6760ee346617718d9","air_date":"2011-01-14","episodes":[{"air_date":"2011-01-14","episode_number":1,"episode_type":"standard","id":799677,"name":"Clive Warren","overview":"Karl tells Ricky and Stephen about his pitch of a movie starring \"Clive Warren\" and Rebecca De Mornay. Stephen reads more pages from Karl's diary, revealing Karl's dislike of camping in Australia and his habit of saving insects from falling into a swimming pool.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/tZuq8cNnPaDGaA1coZ17mKKT8Tr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-21","episode_number":2,"episode_type":"standard","id":799678,"name":"Doppleganger","overview":"Karl discusses what his doppelganger would be like. Ricky gives Karl a riddle. Karl and Stephen say what they do not like about Ricky's cat. Stephen discusses his holiday in Rio, where he went for Carnival.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/eTfDxB8vtURvv0EPhTvKamGLbXx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-28","episode_number":3,"episode_type":"standard","id":799679,"name":"The Fly","overview":"The trio discuss animals and diseases; evolution; a fly that is supposedly a pet; Karl's diary.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/HcZqnGBiU1qJT2qO5JSkHJug5P.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-04","episode_number":4,"episode_type":"standard","id":799674,"name":"Onion","overview":"Ricky gives Karl some animal facts. Karl ponders the question of whether you control your brain, or your brain controls you. From Karl's diary we investigate the curious case of the invisible Chinese man, why blind people have affairs, the feasibility and usefulness of putting a mirror on the Moon, and birthdays.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/9zprgiyVeZtApWZUrn3tfQaOkZv.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-02-11","episode_number":5,"episode_type":"standard","id":799672,"name":"Insects","overview":"Karl shares his thoughts on why insects are so deserving of his attention. Karl talks about his disappointment when learning about a killer octopus; what he would change in crabs; more stuff about insects. Karl's diary is also mostly about insects.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/mVrrtMvJhGXnRkPvMtMhW1jopdY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-18","episode_number":6,"episode_type":"standard","id":799680,"name":"Kidneys","overview":"Karl talks about having been rushed to hospital. He says that kidney stones were found and he had a catheter put into his penis. Karl ponders a phenomenon; Karl's diary; and more.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/pQ3zFcTGrAxztZBcHpXyK4uPrIh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-04","episode_number":7,"episode_type":"standard","id":799675,"name":"Night Club","overview":"Karl ponders height extremes when he learns that one of his new fans is actor Warwick Davis.\n\nStephen talks about a night when he and his friends visited a nightclub in London. The bouncer refused them entry due to them not having any girls with them.\n\nKarl's diary is about his hospital visit for his kidney and a TV documentary in which he believes a monkey acted as a toll taker on a bridge.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/wnFQdfkTnoHxg4WdMaHyFuhB92L.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-11","episode_number":8,"episode_type":"standard","id":799676,"name":"Future","overview":"Karl makes several predictions about humanity's distant future, including his belief that everyone will be ugly, that we will be physically weaker, the little finger will cease to exist, trousers will cease to be produced and we will blend all of our food.\n\nStephen says that if he knew it were the last day of Earth's existence, he would smash up a bar and kill a person. Karl says that he would kick a duck up the arse.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/1FkGwQwlZEb3T0caTd8tzOEpsn1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-18","episode_number":9,"episode_type":"standard","id":799673,"name":"Natural History","overview":"Ricky talks about undiscovered species. He talks about a drawing he did when he was in his early teens of an animal which consisted of a lion's head, a gorilla's arms, the body of a rhinoceros, the tail of a scorpion and the legs of a cheetah. Karl says that his design for an animal would consist of the head of an owl, an armadillo's body on a slug base and with peacock feathers.\n\nKarl talks about having met a man who had drawn a design for a car which enabled defecating while driving. Karl says his father had a friend who kept a monkey as his pet.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/pFeu3EbykBKeKIaig0OjaKae0cY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-25","episode_number":10,"episode_type":"standard","id":799682,"name":"Leg Rubber","overview":"Karl discusses his childhood memories of having thousands of Tic Tacs in his house, given to his father by a friend.\n\nKarl tells of his visit to a \"professional leg rubber\", who tells Karl ridiculous things and charges £48 for half an hour.\n\nKarl talks about his visit to a Harley Street doctor's surgery for a medical. In the waiting room, he was surprised to find Boyz among the magazines. He looked through it, thinking it might enlighten him about the appeal of homosexual sex.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/r58NpWqE6hSGRo52hmjwGTpWm2r.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-01","episode_number":11,"episode_type":"standard","id":799681,"name":"Mrs. Battersby","overview":"Karl talks about the brain having two sides and \"sensing\" when trouble is near. He recounts having eaten a beetle, having been lost in London and having talked to a ghost in Cornwall. Karl then reveals that the ghost encounter was something his mother told him, rather than a personal memory of his. He talks about his aunt not wanting double glazing. He says that if he was a manager, he would sack staff who were absent due to thick snow impeding their route to work.\n\nKarl's Diary includes his belief that Martians are more advanced than us because their days are longer, allowing for greater productivity. Another of his diary entries is about a pub whose new owners have been criticised for barring a regular customer, who is a horse.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/1PFnbX8rMQ0IqIDnlPZvzfIVscY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-08","episode_number":12,"episode_type":"standard","id":799683,"name":"Art","overview":"The trio discuss art, including Marcel Duchamp's Fountain and Damien Hirst's The Physical Impossibility of Death in the Mind of Someone Living as well as sculptures.\n\nKarl talks about a tricycle-riding fat woman nicknamed Miss Piggy who lived on the same estate as him.Ricky says that adaptations of literature and film can be improved by featuring the Muppets.\n\nKarl says that his favourite films are The Elephant Man, Kes and Mission: Impossible 2.\n\nKarl talks about his fondness of whistling, and Ricky says that he finds it annoying.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/shcH74oSUnrTMe93j6KgVuTSvdh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-15","episode_number":13,"episode_type":"finale","id":799684,"name":"Munchies","overview":"Ricky asks Karl if he would give up his real life to live in a virtual reality isolation tank.\n\nKarl discusses his thoughts about problems, holidays and happiness. Whilst recounting having met an older man on holiday, Karl finally laughs.","production_code":"","runtime":30,"season_number":2,"show_id":35305,"still_path":"/ztYmD42FYb9IwFUtadpuszEfNcI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":46037,"poster_path":"/bGWePe3uv0mTnyYN88RSP937AXU.jpg","season_number":2,"vote_average":10},"3":{"_id":"5634c9d1c3a3681b610184d4","air_date":"2012-04-20","episodes":[{"air_date":"2012-04-20","episode_number":1,"episode_type":"standard","id":1133425,"name":"Bryan's Brain","overview":"Karl ruminates on museum collections, his invention for a mug coaster, and a new movie pitch.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/ywsjjDxQLQ8S8fQwJ3kdSGrCQ52.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-27","episode_number":2,"episode_type":"standard","id":1133426,"name":"Comic Relief","overview":"Karl feels he's getting up in age and is starting to spend more time with his doctors. No longer young and free, he thinks about his will, which he believes is a form of charity, though Ricky disagrees. Karl's attorney suggested he marry his girlfriend for tax purposes, which would finally give his parents a reason to meet hers.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/uoTf860MfuihnNx4tguKdUx9Lxg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-04","episode_number":3,"episode_type":"standard","id":1133427,"name":"Armed Forces","overview":"Karl explains why he would have liked to join the Army and recounts his most harrowing acts of bravery.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/kaDdambjwFogOI27viCoDVS3FDu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-11","episode_number":4,"episode_type":"standard","id":1133428,"name":"Room 102","overview":"Ricky, Stephen and Karl discuss what things Karl would banish from the world, and what item he would take if stranded on an island.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/rS7lL48Ja3aSEr7mQNRyRfIQ4mP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-18","episode_number":5,"episode_type":"standard","id":1133429,"name":"Karl’s Day","overview":"Karl walks Ricky and Stephen through a typical day in his life. After being woken by his girlfriend Suzanne going off to work, he mulls about, taking his breakfast while sitting on the bed as he listens to the radio.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/cLsX2Js2nRDSJmu8Ytx0nZU4IhI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-25","episode_number":6,"episode_type":"standard","id":1133430,"name":"The English","overview":"Ricky, Stephen and Karl discuss the essence of Englishness, and what other nationality Karl would like to be.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/3NKs0YyHlUgrpoRENxPSFQ48x7h.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-01","episode_number":7,"episode_type":"standard","id":1133431,"name":"Law & Order","overview":"Ricky, Stephen and Karl discuss capital punishment, the Ten Commandments and hostage negotiation.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/pehOdzowZYlB3QxSmWUOtJTrxrc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-08","episode_number":8,"episode_type":"standard","id":1133432,"name":"Medicine","overview":"Karl shares his thoughts on medical advancements, how being sick makes him feel better, and his idea for a machine that would allow doctors to feel their patients' pain.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/vsbDM5Vpv01tZXFuPoF4MpJ0qpc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-15","episode_number":9,"episode_type":"standard","id":1133433,"name":"Earth","overview":"Karl contemplates the beginnings of the Universe, evolution, recycling and toilets abroad.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/pT85OcvVMHDmpkXzsMKcOLkGf9R.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-22","episode_number":10,"episode_type":"standard","id":1133434,"name":"Society","overview":"Ricky, Stephen and Karl discuss the laws of society and civil rights.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/xIn3kE405OqrtzaiK2Tj3A6e9No.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-29","episode_number":11,"episode_type":"standard","id":1133435,"name":"Wartime","overview":"Karl interprets the meaning of wartime sayings and imagines a scenario in which he is the wife of a GI.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/rMFwbJk0oPkRluvf2bftK65rc2q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-06","episode_number":12,"episode_type":"standard","id":1133436,"name":"World Cup","overview":"Ricky, Stephen and Karl ponder the problem of overzealous sports fans; Karl shares his saliva-volume test.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/atGAjyuc1B2vEdewwvnAGJb6FZb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-13","episode_number":13,"episode_type":"finale","id":1133437,"name":"The Year","overview":"Karl ruminates on the insect world; Stephen recalls the horrors of buying condoms.","production_code":"","runtime":30,"season_number":3,"show_id":35305,"still_path":"/nbjTkGcp9m1MmaUZW4APg6ixGy2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":71715,"poster_path":"/po2ElVoBmV2wH4Wt0g13HJPkFLy.jpg","season_number":3,"vote_average":0}}}