{"adult":false,"backdrop_path":"/hwpoeLVP2VsvVqZcOU8CMBHSuFf.jpg","created_by":[],"episode_run_time":[43],"first_air_date":"2011-01-19","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.foodnetwork.com/restaurant-impossible/index.html","id":35358,"in_production":false,"languages":["en"],"last_air_date":"2023-04-06","last_episode_to_air":{"id":4278808,"name":"Trick or Treat","overview":"At the Dutch Treat in Franconia, New Hampshire, Robert Irvine meets John, an owner who has lost the desire to keep his family restaurant going. His wife, Jenn, is more than willing to help, but no matter what she and Robert do, the Dutch Treat doesn't stand a chance without John.","vote_average":0,"vote_count":0,"air_date":"2023-04-06","episode_number":15,"episode_type":"standard","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null},"name":"Restaurant: Impossible","next_episode_to_air":null,"networks":[{"id":143,"logo_path":"/aKkZnTIGTn92sUODLxqP8ZmgyIA.png","name":"Food Network","origin_country":"US"}],"number_of_episodes":268,"number_of_seasons":22,"origin_country":["US"],"original_language":"en","original_name":"Restaurant: Impossible","overview":"Chef Robert Irvine tries to turn around restaurants across America that are facing an impending demise if things don't improve. With a $10,000 budget and two days to work, Irvine uses his creativity and resourcefulness to turn the eatery's fortunes around.","popularity":21.577,"poster_path":"/q5lCbuk4obBqUtlx1969wSD0qNh.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2012-08-22","episode_count":22,"id":46085,"name":"Specials","overview":"","poster_path":"/psHEmmxW8YhruhK6kLTJbbZdROr.jpg","season_number":0,"vote_average":0},{"air_date":"2011-01-19","episode_count":7,"id":46084,"name":"Season 1","overview":"","poster_path":"/2vzT46vJOuNVkC7BMXXFVZHcbIe.jpg","season_number":1,"vote_average":0},{"air_date":"2011-07-06","episode_count":18,"id":46086,"name":"Season 2","overview":"","poster_path":"/6fSyJCMAWhJ53HtodagxfrzPU12.jpg","season_number":2,"vote_average":0},{"air_date":"2012-02-08","episode_count":13,"id":46087,"name":"Season 3","overview":"","poster_path":"/8yoDFWZzOS5PioyEMKThSb8PdVq.jpg","season_number":3,"vote_average":0},{"air_date":"2012-07-11","episode_count":15,"id":46088,"name":"Season 4","overview":"","poster_path":"/eqg4mepgxuJxweupLQtAPLl4ymk.jpg","season_number":4,"vote_average":0},{"air_date":"2012-11-21","episode_count":13,"id":46089,"name":"Season 5","overview":"","poster_path":"/xLpFL9Zkp8XKrvk1pbx24B6kqy6.jpg","season_number":5,"vote_average":0},{"air_date":"2013-04-14","episode_count":13,"id":46090,"name":"Season 6","overview":"","poster_path":"/zimQ0cKJE0SBGMY5KkwPXmkskeU.jpg","season_number":6,"vote_average":0},{"air_date":"2013-10-23","episode_count":14,"id":46091,"name":"Season 7","overview":"","poster_path":null,"season_number":7,"vote_average":0},{"air_date":"2013-03-05","episode_count":13,"id":234744,"name":"Season 8","overview":"","poster_path":null,"season_number":8,"vote_average":0},{"air_date":"2014-07-23","episode_count":13,"id":343007,"name":"Season 9","overview":"","poster_path":null,"season_number":9,"vote_average":0},{"air_date":"2014-11-24","episode_count":7,"id":343008,"name":"Season 10","overview":"","poster_path":null,"season_number":10,"vote_average":0},{"air_date":"2015-03-18","episode_count":8,"id":343009,"name":"Season 11","overview":"","poster_path":null,"season_number":11,"vote_average":0},{"air_date":"2015-10-22","episode_count":7,"id":343010,"name":"Season 12","overview":"","poster_path":null,"season_number":12,"vote_average":0},{"air_date":"2016-03-09","episode_count":8,"id":75619,"name":"Season 13","overview":"","poster_path":null,"season_number":13,"vote_average":0},{"air_date":"2019-04-20","episode_count":4,"id":122443,"name":"Season 14","overview":"","poster_path":null,"season_number":14,"vote_average":0},{"air_date":"2019-07-20","episode_count":8,"id":130081,"name":"Season 15","overview":"","poster_path":null,"season_number":15,"vote_average":0},{"air_date":"2019-12-26","episode_count":13,"id":138974,"name":"Season 16","overview":"","poster_path":"/q5lCbuk4obBqUtlx1969wSD0qNh.jpg","season_number":16,"vote_average":0},{"air_date":"2020-04-29","episode_count":9,"id":149648,"name":"Season 17","overview":"","poster_path":null,"season_number":17,"vote_average":0},{"air_date":"2021-01-07","episode_count":15,"id":181510,"name":"Season 18","overview":"","poster_path":null,"season_number":18,"vote_average":0},{"air_date":"2021-05-20","episode_count":22,"id":196240,"name":"Season 19","overview":"","poster_path":null,"season_number":19,"vote_average":0},{"air_date":"2021-08-26","episode_count":19,"id":240964,"name":"Season 20","overview":"","poster_path":null,"season_number":20,"vote_average":0},{"air_date":"2022-04-28","episode_count":14,"id":295924,"name":"Season 21","overview":"","poster_path":null,"season_number":21,"vote_average":0},{"air_date":"2022-12-29","episode_count":15,"id":319762,"name":"Season 22","overview":"","poster_path":null,"season_number":22,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Reality","vote_average":6.7,"vote_count":32,"season_data":{"1":{"_id":"5258de14760ee34661776ac2","air_date":"2011-01-19","episodes":[{"air_date":"2011-01-19","episode_number":1,"episode_type":"standard","id":800460,"name":"Villari's","overview":"Chef Robert Irvine is in Palmyra, NJ to see if he can save a 60yr old family restaurant from failure. Paul Villari III took over his family's restaurant from his father 15 years ago and has watched as the customer base has literally died off. Paul has been unable to bring a new customer base in and has found himself on the brink of having to shut down this neighborhood icon. With outdated décor and a disastrous kitchen, it's a race to the finish as Robert tries to put Villari's back on the path to success. Will he succeed or will this be Restaurant: Impossible?","production_code":"","runtime":43,"season_number":1,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-26","episode_number":2,"episode_type":"standard","id":800459,"name":"Mainelli's","overview":"Robert heads to Providence, R.I., to save Mainelli's, a former neighborhood-favorite Italian restaurant with bad service and an extensive menu of dishes the kitchen just can't get right. Upon discovering food safety issues, Robert closes down the restaurant until further notice. After attempting to teach the cooking staff basic techniques, Robert enlists design help for a much-needed interior renovation. With time ticking away, Robert needs to pull out all the stops to complete this mission and keep Mainelli's from closing for good.","production_code":"","runtime":43,"season_number":1,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-02","episode_number":3,"episode_type":"standard","id":800458,"name":"Rascal's BBQ and Crab House","overview":"Robert travels to Rascal's BBQ & Crab House in New Castle, Del., where many pass by but almost none stop to eat. Rascal's hides behind mountains of trash and one of the dirtiest kitchens Robert has seen. He orders a mass cleaning, and as the trash sorting begins, some treasures surface to update the restaurant's aesthetic. Robert also introduces fresh dishes and a new catering menu to help revive this dump. As the mission comes to an end, Robert still needs to do some serious work to triumph over the trash.","production_code":"","runtime":43,"season_number":1,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-09","episode_number":4,"episode_type":"standard","id":800455,"name":"Salt Works II","overview":"A new restaurant with young owners keeps Robert on his toes in this mission. Salt Works II in Wilmington, N.C., prides itself on serving down home cooking, but when Robert steps into the kitchen he finds that they only cook canned food. He immediately jumps into action modernizing the interior and changing the menu while urging the staff to work as a team. In hopes of attracting a new client base to go with the younger feel of the restaurant, Robert hits the streets to bring in the nearby college students. With time running out, he needs to confirm that the staff can execute the new menu so this restaurant can stay afloat.","production_code":"","runtime":43,"season_number":1,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-16","episode_number":5,"episode_type":"standard","id":800456,"name":"Meglio's","overview":"At Meglio's in Bridgeton, Mo., near St. Louis, Robert finds an Italian restaurant stuck in the past with a laundry list of problems. They claim to cook old family recipes, but Robert discovers that the extent of their cooking involves opening frozen food bags. After getting over the initial shock, he attempts to retrain the cooking staff and explain why they should provide quality food for customers using a smaller menu and fresher ingredients. With a last-minute design dilemma and an unfocused owner, Robert faces tough odds to make this mission a success.","production_code":"","runtime":43,"season_number":1,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-23","episode_number":6,"episode_type":"standard","id":800457,"name":"Secret Garden","overview":"In Jacksonville, Fla., Robert strives to save The Secret Garden Café, a failing breakfast/lunch locale owned by partners Zack and Michael. From the get go, it's obvious that this restaurant has no clear direction or theme, less-than-thrilling dishes, disorganized staff, and haphazard décor. Robert spins into action by putting staff through the wringer, creating new dishes, updating the décor in massive ways, and marketing the restaurant while working tirelessly to ensure all is set for a successful grand re-opening. With countless ups and downs throughout, this mission could prove impossible.","production_code":"","runtime":43,"season_number":1,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-03-02","episode_number":7,"episode_type":"finale","id":800461,"name":"Flood Tide","overview":"Robert must overcome the impossible to save the formerly venerable Flood Tide Restaurant in Mystic, Conn., which has earned a bad reputation due to its coarse owner. Robert evaluates an evening of service during which he finds many problems including a dirty kitchen. While encouraging the staff to take pride in their work, he tackles the kitchen mess. Then, he updates the menu and décor and retrains the staff to make better use of their time and materials. As the clock winds down it becomes a race to the finish to see if Robert will be successful.","production_code":"","runtime":43,"season_number":1,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":46084,"poster_path":"/2vzT46vJOuNVkC7BMXXFVZHcbIe.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258de14760ee34661776ae4","air_date":"2011-07-06","episodes":[{"air_date":"2011-07-06","episode_number":1,"episode_type":"standard","id":800465,"name":"Dodge City","overview":"Chef Robert Irvine heads to Harrisburg, PA in an effort to try and save Dodge City USA from closing its doors after 30 years of service. He will have to find a way to tackle a Wild West theme that has run its course for decades. From the deer heads on the to the porcelain pigs behind the counter, this cowboy's dream has become a nightmare for its owners because they refuse to modernize their restaurant and leave their time warp. Will the owners listen to Robert and be able to step out of the past and make the best of these changes? Or will this prove to be a Restaurant: Impossible?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-13","episode_number":2,"episode_type":"standard","id":800466,"name":"La Stanza","overview":"At La Stanza, in Philadelphia, PA, Robert finds an old-world Italian restaurant being ruined by the owner's young daughter. 24-year-old Lucia has no restaurant experience and she's running the dark, funeral parlor-looking place right into the ground. Robert has his hands full on this mission teaching her everything there is to know about managing a restaurant, updating the menu, brightening up the décor and getting the word out about the restaurant on live TV. With countless ups and downs and a design that may prove too challenging to get finished, this mission could very well be... impossible.","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-20","episode_number":3,"episode_type":"standard","id":800468,"name":"Sweet Tea","overview":"Chef Robert Irvine's mission takes him to Chapin, SC where a little restaurant by the name of Sweet Tea is being run into the ground by its new owners. Robert is under enormous pressure of helping this restaurant succeed because a father's life savings and future retirement hangs in the balance. Christine and Jeffrey Spencer have been running this restaurant for less than a year and, at this rate, may not make it another year. Christine's father bought it for her in hopes that Sweet Tea would be the break she needed to be able to take care of her family. Instead, Christine and Jeffery are just weeks away from losing their jobs, their restaurant, and nearly every penny from her father's retirement fund. This small town restaurant has really made Robert question if he can truly overcome a Restaurant: Impossible!","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-02","episode_number":4,"episode_type":"standard","id":800467,"name":"County Fare","overview":"Chef Robert Irvine pulls a sneak attack on County Fare, a neighborhood diner in Stafford, VA, only to find this place is no picnic. The downtrodden diner has been in existence for 5 years and is now on the verge of bankruptcy due to mismanagement, a lack of identity and an overall cleanliness issue. The owner, a former Marine, has sunk his lifesavings into the restaurant and is now in jeopardy of losing everything. Robert, a military man himself, will do whatever he can in 2 days and with $10,000 to make sure this place doesn't go down without a fight. But he quickly discovers that this will be more difficult than he imagined... the kitchen is repulsive, the food is inedible and the décor needs a serious overhaul. They are in desperate need of a high quality signature dish to draw in customers but the staff lacks the basic cooking skills needed.","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-03","episode_number":5,"episode_type":"standard","id":800469,"name":"Snooty Fox","overview":"Robert is racing to Indianapolis, IN to help Snooty Fox, a struggling English pub-style restaurant. It's been a mainstay in the city for 28-years but because of their aging clientele, it likely won't last another 8-months. Robert is underwhelmed by the British-influence and overwhelmed by grime and food safety issues. The first thing he does is close the kitchen down. But there are bigger fish (and chips) to fry when the head chef quits with no notice. With two days to get this place back on its feet, Robert kicks into high gear - interviewing new chefs, overhauling the décor and updating the menu. With time quickly running out, trouble with the design keeps everyone wondering if the Snooty Fox is ever going to run again.","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-10","episode_number":6,"episode_type":"standard","id":800470,"name":"Pastori's","overview":"Robert Irvine takes his skills and knowledge to the Nutmeg State of Connecticut where he faces his most arduous mission to date, to save not only a restaurant on the verge of collapse but a family in disrepair. Pastori's has been owned by Bill and Georgia Savvidis for more than two-decades. After many successful years, the Italian restaurant has fallen on hard times and is now only 4 to 6 months from closing forever. Adding to the difficulties, Bill recently fired his head cook, who happens to be his oldest son. Customers are now complaining about a noticeable decline in the food quality. If bad food and family feuds are not enough trouble, Robert is also confronted with an interior design that is about as fun as a waiting room. Robert has two-days and $10,000 to save this restaurant and this family... could this mission truly be impossible?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-31","episode_number":7,"episode_type":"standard","id":800471,"name":"Scrimmages","overview":"Chef Robert Irvine travels to Scrimmages restaurant in Wilmington, Delaware and quickly learns that the phrase 'there is no I in team' truly applies here. Scrimmages has been owned for five years by four equal partners: brothers Brian and Jerry, their childhood friend Mike and Brian's former boss Leon. As the revenues have disintegrated so has the partnership. Robert has two-days and $10,000 to turn around a sub-par restaurant and also mend fences among battling partners.","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-07","episode_number":8,"episode_type":"standard","id":800472,"name":"Mamma D's","overview":"Pigs and chickens and goats? Oh my! This Restaurant Impossible takes chef Robert Irvine to rural Pipersville, Pa., and Mamma D's, a place that is part restaurant, part vineyard and mostly petting zoo. Owners Luigi and Liz Desiato are all over the place with ideas - they have a vineyard, a farm stand, a wine store, a petting zoo and, of course, the restaurant. Robert is confused by what he sees and can't get over the smell, the animals and the clutter everywhere. Could this mission prove to be too much for Robert?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-14","episode_number":9,"episode_type":"standard","id":800474,"name":"Off Street Cafe","overview":"This mission takes Robert to Cerritos, a small town in sunny Southern California. But what he finds is the Off Street Café, a gloomy restaurant co-owned by the ex-mother and daughter-in-law team of Robin and Rose. Will Robert be able to mend extended family fences get the Off Street Café back on track?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-21","episode_number":10,"episode_type":"standard","id":800473,"name":"The Trails","overview":"Robert hits the trail to San Diego, CA where he finds The Trails Eatery. An adorable little café owned and run by a young, energetic woman named Stacey. While, the surface here looks great, underneath the nicely painted exterior, is a business spiraling into bankruptcy. Will Stacey take Robert's advice or will it be the end of the line for The Trails?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-28","episode_number":11,"episode_type":"standard","id":800475,"name":"Cap'n and the Cowboy","overview":"Chef Robert Irvine finds himself walking into a salty sea dog's worst nightmare on this mission to Port Charlotte, Florida... home of the run-down, overly cluttered, kitschy and disgusting Cap'n and the Cowboy restaurant.","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-02","episode_number":12,"episode_type":"standard","id":800477,"name":"Mad Cactus","overview":"Chef Robert Irvine finds himself in a prickly situation as he travels to Strongsville, OH. Here, he comes face-to-face with the Mad Cactus restaurant and he immediately sees why the cactus is so mad. This dark, dirty and disgusting Tex-Mex themed restaurant, along with its lackadaisical owner, upsets Robert to no end, but it's when he finds out that they're not even cooking 'real' food that things really get heated.","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-09","episode_number":13,"episode_type":"standard","id":800476,"name":"McShane's","overview":"Chef Robert Irvine's visit to McShane's Restaurant in East Syracuse, NY proves to be the most horrendous place he has faced to date. Inside there is dirt upon dirt upon dirt all the way to the soda tubing at the bar. Can Robert help the owner, Cindy bring the place back from the brink of bankruptcy?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-16","episode_number":14,"episode_type":"standard","id":800478,"name":"Coffee's Boiling Pot","overview":"When Chef Robert Irvine comes to Coffee's Boiling Pot in Madison, Louisiana the odds are stacked against him. Not only have the owners, Tim and Allene Oalmann, neglected the former landmark restaurant, but they have been divorced for three years and are barely able to speak to each other. Can Chef Robert and his team restore the restaurant to its former splendor and get the feuding exes on speaking terms again in only two days and with $10,000?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-23","episode_number":15,"episode_type":"standard","id":800479,"name":"St. James Soup Kitchen","overview":"Chef Robert Irvine's overhaul of The St. James Soup Kitchen in Newark, NJ is his biggest challenge to date. Can he and his team renovate a dilapidated, fire-ravaged kitchen and dining room for $10,000 in only two days? 31,000 hungry people are counting on him.","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-07","episode_number":16,"episode_type":"standard","id":800482,"name":"Wildcat Cafe","overview":"It's back to school for Chef Robert Irvine as he travels to Canton South High School in Canton, OH to help the students of its culinary arts program that is struggling to survive due to state budget cuts. Canton South boasts the Wildcat Cafe, a working for profit restaurant located in the school which too is struggling with outdated, broken equipment in the kitchen and a dilapidated dining room. Can Robert help turn around the cafeteria as well as change the lives of some of the students?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-04","episode_number":17,"episode_type":"standard","id":800480,"name":"Sullivan's","overview":"Chef Robert Irvine's expertise at saving failing restaurants is put to the test at Sullivan's in Fruita, CO. The restaurant is on the verge of bankruptcy and owner Ginny is on the verge of a breakdown. Neglected and dirty, Sullivan's needs chef Robert and his team to give it a new identity in the kitchen and in the dining room. Will the tight deadline and $10,000 budget be too much to save this failing pub?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-11","episode_number":18,"episode_type":"finale","id":800481,"name":"Hoffman's","overview":"Chef Robert Irvine's intervention of Hoffman's Bistro and Patisserie in Santa Cruz, Calif., couldn't come soon enough. The 10-year-old venture is more than $2 million in debt, and the stress on the family-run business has resulted in a tense and uncomfortable environment for employees and customers alike. Chef Robert's drastic plan to completely overhaul the restaurant is needed to save the business, but with only two days and $10,000, will they be able to reopen without alienating customers and tearing the family apart?","production_code":"","runtime":43,"season_number":2,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":46086,"poster_path":"/6fSyJCMAWhJ53HtodagxfrzPU12.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258de14760ee34661776af5","air_date":"2012-02-08","episodes":[{"air_date":"2012-02-08","episode_number":1,"episode_type":"standard","id":800485,"name":"Moss' Prime Rib & Spaghetti House","overview":"When Chef Robert Irvine gets to Moss' Prime Rib and Spaghetti House in Elyria, OH, he soon realizes that the problems of this restaurant go beyond the subpar food. Owners Robert and Sandi are bullish and stubborn, refusing to accept the help that their struggling business needs. Can Robert and his team rebuild this struggling restaurant and the family behind it in two days?","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-15","episode_number":2,"episode_type":"standard","id":800483,"name":"Chatterbox","overview":"Chef Robert Irvine often sees restaurant owners with little experience and lofty ideas of how to run a restaurant, but Lynn, the owner of Chatterbox in Windham, New Hampshire, takes the cake. A former stay-at-home mom, she used her late husband's life insurance policy to open up a restaurant, hoping to provide for her five children. Robert has just two days to give the well-intentioned but naive family the tools and skills to run a successful family business.","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-22","episode_number":3,"episode_type":"standard","id":800484,"name":"Anna Maria's","overview":"Chef Robert Irvine has seen many dirty and neglected restaurants, but none have made him physically ill like Anna Maria's in Scranton, PA. The Italian eatery's glory days, and last apparent cleaning, were 25 years ago, and owners Jack and Mary, with their son Tucker, are in over their head trying to keep the doors open. Chef Robert Irvine's biggest challenge will be getting the kitchen up to code with only $10,000 and two days.","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-29","episode_number":4,"episode_type":"standard","id":800488,"name":"Del's","overview":"When Chef Robert Irvine visits Del's in Pittsburgh, PA, it's clear that the biggest issue with this failing 62-year-old icon is not the food or décor, but owner Marianne. Under the stress of losing the family heirloom, Marianne lashes out at her staff, driving away customers and earning a terrible reputation in the neighborhood. Can Robert save Marianne from herself and the restaurant from its imminent closing?","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-07","episode_number":5,"episode_type":"standard","id":800486,"name":"Woody's Tupelo Steakhouse","overview":"When Chef Robert Irvine first sees Woody's Tupelo Steakhouse in Tupelo, MS, it's clear why owner Feather and her mom, Tricia, are drowning in debt. The dining room is a dusty, dark cave and the horrible tableside service is worse than the mediocre food. With only two days and $10,000 can Robert re-establish the restaurant into a Tupelo dining destination?","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-14","episode_number":6,"episode_type":"standard","id":800487,"name":"Valley View","overview":"The Valley View Restaurant in Quarryville, PA is failing for a litany of reasons. This tiny diner located in the heart of Amish country is suffering from an outdated décor and menu, as well as reeling from structural issues. But Chef Robert Irvine's biggest challenge to turn this business around will be in changing the family roles of the three generations of women running this business into the ground.","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-25","episode_number":7,"episode_type":"standard","id":800490,"name":"Pelican Grill","overview":"Chef Robert Irvine swoops in to save the Pelican Grill, a small breakfast and lunch place in Seabrook, Texas. Owners John and Laura are losing $2,000 a month and their savings can only keep them afloat for so long. In only two days, and with only $10,000, chef Robert needs to overhaul not only the uninspired, cluttered interior, but also the lack of leadership and structure at the center of the restaurant's problems.","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-02","episode_number":8,"episode_type":"standard","id":800489,"name":"Mama Lee's","overview":"Chef Robert Irvine is tasked with turning around Mama Lee's Soul Food Restaurant in San Antonio, Texas, a four-year-old restaurant that has never turned a profit and is only weeks away from closing. This cavernous restaurant is full of problems: a huge, outdated dining room; a useless, cockroach overrun restaurant; and an owner who lacks the passion, knowledge and leadership that Mama Lee's needs to succeed. Robert calls in reinforcements -- HGTV's Kitchen Cousins Anthony and John -- but even with all hands on deck, will he be able to pull off his biggest renovation to date?","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-09","episode_number":9,"episode_type":"standard","id":800491,"name":"Pappas Restaurant","overview":"Chef Robert Irvine's latest mission takes him to Pappas Restaurant in Benicia, Calif., a family-owned Greek restaurant on the brink of extinction. Michael \"Pappa\" has owned and operated his namesake restaurant for over 15 years with his two sons, whose constant fighting is the source of much of the restaurant's problems. Robert has only two days to repair this dysfunctional family as well as the drab interior and lackluster food if Pappas Restaurant can have a chance at survival.","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-16","episode_number":10,"episode_type":"standard","id":800492,"name":"Ristorante Barolo","overview":"","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-23","episode_number":11,"episode_type":"standard","id":800493,"name":"University Grill","overview":"Chef Robert Irvine heads to Burlington, N.C., in an attempt to save the University Grill. The five-year-old establishment was opened by siblings Eleni, George and Manny to help provide for their parents during retirement, but is now facing failure due in part to the family feud among the siblings. Can chef Robert resolve the sibling rivalry and help turn the University Grill profitable?","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-30","episode_number":12,"episode_type":"standard","id":800494,"name":"Pollard's Bar-B-Que","overview":"Chef Robert Irvine heads to Memphis to save a failing barbecue restaurant that's experiencing growing pains after upgrading from a takeout operation to a giant eat-in restaurant only four months earlier. Chef Robert may have met his match in stubborn owner Tarrance, who is clinging onto his cherished family barbecue recipe and refusing to see how cutting corners and failing to adapt to the challenges of a large restaurant is causing his business to fail. Can Chef Robert get through to Tarrance and help turn around this family business before it all goes up in smoke.","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-13","episode_number":13,"episode_type":"finale","id":800495,"name":"White House Edition","overview":"Michelle Obama tasks Chef Irvine with a unique challenge at Horton's Kids in Washington, D.C., a nonprofit community center that provides afterschool meals, a resource room and family cooking classes.","production_code":"","runtime":43,"season_number":3,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":46087,"poster_path":"/8yoDFWZzOS5PioyEMKThSb8PdVq.jpg","season_number":3,"vote_average":0},"4":{"_id":"5258de14760ee34661776b03","air_date":"2012-07-11","episodes":[{"air_date":"2012-07-11","episode_number":1,"episode_type":"standard","id":800496,"name":"Longbranch Steak and Seafood","overview":"Owner Lisa's husband gave her a restaurant as a wedding gift, and she has struggled financially and emotionally since. Chef Robert has to fix a filthy kitchen and insubordinate staff and give Lisa the confidence and tools to run a successful restaurant.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-18","episode_number":2,"episode_type":"standard","id":800498,"name":"The Main Dish","overview":"Owners Lynn and Ken bought the restaurant five years earlier because Ken loved to cook, but with no restaurant experience at all, the couple is now working 80 hours a week and in more than $50,000 debt.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":"/rGMF6ntQabpVBPagKy9NbFUrKeh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-25","episode_number":3,"episode_type":"standard","id":800499,"name":"Zandi's Grill","overview":"Zandi's Grill in isn't failing just due to its bad location, lackluster food, poor service, and tired decor. It's failing because its owners have completely lost their passion.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-01","episode_number":4,"episode_type":"standard","id":800500,"name":"Italian Village","overview":"Chef Robert Irvine hopes to return a 30-year-old staple to its early glory days. Not only will he need to overhaul the menu and dark interior, but he will need to fix the control issues hurting the business and the family behind the restaurant.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-08","episode_number":5,"episode_type":"standard","id":800497,"name":"Stella's Italian Restaurant","overview":"Chef Robert helps a mother and son keep their 15-year-old restaurant alive. The son is clueless about food costs and lacks leadership skills.  Robert must give Stella's a complete overhaul or else its doors will certainly close.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-29","episode_number":6,"episode_type":"standard","id":800502,"name":"Gusanoz Mexican Restaurant","overview":"Chef Robert helps a husband and wife save their 6-year-old Mexican restaurant. Initially popular, growing pains got the best of the restaurant, which suffered in food and operations quality, leaving a huge, expensive mess for Robert to clean up.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-05","episode_number":7,"episode_type":"standard","id":800503,"name":"Frankie's","overview":"Frankie’s was purchased by then best friends Jay and Tina 13 years ago; the stress of a failing business has corroded their relationship to the point where they are unable to be in the same room.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-12","episode_number":8,"episode_type":"standard","id":800504,"name":"Paliani's Restaurant","overview":"Chef Robert Irvine travels to Burton, Mich., where he's on a mission to rescue a single mom, Marina, and her restaurant, Paliani's, from demise. Paliani's has a kitchen in disarray, a dining room that's a disgusting mess, and an owner who doesn't realize her own role in its downfall. Robert needs to use every penny of the $10,000 budget and every second of the two-day deadline to help turn Paliani's into Burton's new hot spot!","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-19","episode_number":9,"episode_type":"standard","id":800505,"name":"Michele's","overview":"Of all the owners Chef Robert Irvine has worked with on Restaurant: Impossible, none may have been more unprepared than Michele and Andy, owners of Michele's in Corry, Pa., who purchased their restaurant at auction on a whim, despite having no experience in the business. In two days, Robert must choose a new cook, teach Michele basic management skills, refurbish the interior, and address Andy's critical and harsh attitude.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":"/lfif5S0NEKGHjopfKRACYvbxR5c.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-26","episode_number":10,"episode_type":"standard","id":800506,"name":"Maple Tree Cafe","overview":"Chef Robert Irvine heads to Las Vegas to help 26-year-old Ashley save the Maple Tree Cafe. Not only is Ashley new to the restaurant industry, but she's hired mostly family members, who are also inexperienced, to support her dream. Robert will have only two days to fix the strained family relationships, and give Ashley the tools and courage she needs to run her business.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":"/gppuDSoXP8LQzoAXaYJ3WYWSrke.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-03","episode_number":11,"episode_type":"standard","id":800507,"name":"Whistle Stop","overview":"Chef Robert Irvine's latest mission introduces him to the Whistle Stop in Hot Springs, Ark., and Linda, a former employee who bought the business when the previous owners abruptly told her they were shutting down. The business turned out to be a poor investment, and Linda has used the inheritance her late husband left her to keep the doors open. Robert has only two days and $10,000 to restore the dining room, clean the kitchen and train the staff.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-10","episode_number":12,"episode_type":"standard","id":800508,"name":"Valley Inn","overview":"Chef Robert Irvine is in Palos Hills, Ill., to help save the Valley Inn restaurant. Opened 40 years ago by Faye and Frank, Sr., it's now being run by sons Dennis and Frank, Jr. Once very profitable, the death of Frank, Sr., combined with a difficult economy, has left the family downtrodden and the restaurant struggling to bring in customers.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-17","episode_number":13,"episode_type":"standard","id":800509,"name":"Oleander Bar and Grill","overview":"Chef Robert Irvine heads to Olean, N.Y., to meet Kelli and her daughter, Abby, owners of the Oleander Bar and Grill. Open only six months, the restaurant is facing financial ruin, and Kelli and Abby face the threat of losing the restaurant. When Robert arrives, it's clear that the tension between Kelli and Abby is the root of this young restaurant's problems: The two cannot agree on anything, causing confusion for the employees, and their fighting drives away customers.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":14,"episode_type":"standard","id":800510,"name":"Wedding Impossible","overview":"When he's not rescuing a restaurant, Restaurant: Impossible's host Robert Irvine is busy planning the wedding of a lifetime: his own. And you're invited! This first-time departure for Food Network gives viewers an intimate look into the personal life of their star chef Robert Irvine as he gets ready to marry wrestling star and entertainer Gail Kim. Featuring some of the biggest names in food and set against one of the most magnificent backdrops in the country, Napa Valley, Robert will introduce us to his family, his friends and allow us to be a part of one of the most important moments of his life.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":"/2m2uMvy6cTIrcQTJpn3o164oK4G.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":15,"episode_type":"finale","id":800501,"name":"Behind the Impossible","overview":"Host Robert Irvine plans the wedding of a lifetime: his own, to wrestling star and entertainer Gail Kim.","production_code":"","runtime":43,"season_number":4,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":46088,"poster_path":"/eqg4mepgxuJxweupLQtAPLl4ymk.jpg","season_number":4,"vote_average":0},"5":{"_id":"5258de14760ee34661776b11","air_date":"2012-11-21","episodes":[{"air_date":"2012-11-21","episode_number":1,"episode_type":"standard","id":800511,"name":"Poco's on the Boulevard","overview":"Chef Robert Irvine is heading to Kansas City, Mo., to save a once flourishing family restaurant and repair the relationship between two sisters. Poco's on the Boulevard once served delicious, authentic Latin food, but since the death of chef/owner Poco, her daughters Claudia and Dana have been struggling to maintain the restaurant's food quality and profits.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-28","episode_number":2,"episode_type":"standard","id":800512,"name":"Rohrer's Tavern","overview":"Chef Robert Irvine heads to North Bend, Ohio, to help revive Rohrer's Tavern, a local staple for more than 60 years. Current owner Lisa has faithfully stuck to the legacy of Rohrer's to a fault: tried and true customers are still around, but the lack of new patrons has put Lisa one month away from closing this local icon.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-05","episode_number":3,"episode_type":"standard","id":800513,"name":"Bronk's Bar and Grill","overview":"Chef Robert Irvine's next mission brings him to the small town of Lake City, Minn., where Erik and Tracy are only a month away from losing their 11-year-old restaurant, Bronk's Bar and Grill. An untrained staff and frozen food in the kitchen, and a generic design in the dining room are just some of the challenges Robert must battle armed with two days and $10,000","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-19","episode_number":4,"episode_type":"standard","id":800514,"name":"Rising Sun Bistro","overview":"The French-themed Rising Sun Bistro in Kalispell, Mont., is facing a mountain of problems: A chaotic kitchen, an uninspired decor, $500,000 worth of debt, and owners who can't stand looking at each other. Chef Robert Irvine has two days and $10,000 to get the resaurant, and the owners, on the right track.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-02","episode_number":5,"episode_type":"standard","id":800515,"name":"Whiskey Creek Steakhouse","overview":"Pat and Karan, owners of the Whiskey Creek Steakhouse in Keyport, Wash., have lost nearly everything in the 20 years their restaurant has been open. As if the poorly cooked food and dreary design weren't big enough problems for Chef Robert Irvine to fix, he also must confront the staff when he uncovers money may be missing from the restaurant's financial records.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-16","episode_number":6,"episode_type":"standard","id":800522,"name":"Windseeker Restaurant","overview":"Windseeker Restaurant in Dalles, Ore., is suffering from years of bad publicity and negative word of mouth. Chef Robert Irvine has only two days and $10,000 to help owner Veta break bad habits, clean up the restaurant's image, and entice customers to this off-the-beaten-path destination.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-23","episode_number":7,"episode_type":"standard","id":800523,"name":"Sapori D'Italia","overview":"Chef Robert Irvine is called to Fountain Hills, Ariz., where the family behind Sapori D'Italia desperately needs his help: The Italian restaurant's customers have been replaced with the sounds of fighting. Robert must fix a broken family in order to fix their restaurant.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-20","episode_number":8,"episode_type":"standard","id":800516,"name":"Nanny Goats Cafe and Feed Bin","overview":"Chef Robert's newest mission is to save the failing restaurant, Nanny Goats Cafe and Feed Bin, in Kilgore, Texas. Owner Nancy was once a successful restaurateur, but Nanny Goats has depleted her savings, and led to the volatile relationship with her daughter that's driving customers away. With the restaurant in a financial mess, food being cooked unsafely, and a restaurant that resembles a flea market, Robert and his team will need every minute and dollar of the two day limit and $10,000 budget if they're going to save Nanny Goats.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-27","episode_number":9,"episode_type":"standard","id":800517,"name":"Dinner Bell Restaurant","overview":"Chef Robert is in Madison, Tenn., to help owner, Tommy, keep the doors of the Dinner Bell Restaurant open. And Robert is just in time, as Tommy's only two days from having to close the doors on his four-year-old business for good. Robert and his team must clean the restaurant, freshen the menu and fix the staff's bad habits in two days, before Tommy loses everything.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-10","episode_number":10,"episode_type":"standard","id":800518,"name":"Maniaci's Italian Bistro","overview":"Maniaci's Italian Bistro in Mohnton, Pa., was a thriving family business that was run by Mrs. Maniaci until her death: Five years later, her three sons are running the business into the ground. Chef Robert has two days and $10,000 to overhaul the menu, décor and give the Maniaci brothers a fresh start to keep their mother's dream alive.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-13","episode_number":11,"episode_type":"standard","id":800519,"name":"Caseyville Cafe","overview":"Chef Robert quickly sees why the Caseyville Café in Caseyville, Ill., is failing: From the kitchen to the servers, the staff have completely overrun Diane and Robin's restaurant, costing this Mother-Daughter team tens of thousands of dollars — and their relationship. Robert can only help Diane and Robin fix the menu and décor of the restaurant once he gives the staff an ultimatum: decide who's in and who's out, or else Robert leaves and the mission is over.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-17","episode_number":12,"episode_type":"standard","id":800521,"name":"Soup To Nuts Diner","overview":"The Soup to Nuts Diner in Tavares, Fla., is a 1950s-themed diner that looks like it hasn't been cleaned since then! Owner Sharon is losing so much money on the restaurant that she's on the verge of losing her house to foreclosure. Chef Robert Irvine must tackle a restaurant that's filthy from the dining room, to the kitchen, to the young staff's attitudes in order to turn the Soup to Nuts Diner into a success.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-24","episode_number":13,"episode_type":"finale","id":800520,"name":"Sweet Tea's Restaurant And Catering","overview":"Sweet Tea's Restaurant opened as a storefront to a successful catering business three years ago, but the non-descript building hasn't attracting customers.","production_code":"","runtime":43,"season_number":5,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":46089,"poster_path":"/xLpFL9Zkp8XKrvk1pbx24B6kqy6.jpg","season_number":5,"vote_average":0},"6":{"_id":"5258de14760ee34661776b1f","air_date":"2013-04-14","episodes":[{"air_date":"2013-04-14","episode_number":1,"episode_type":"standard","id":800526,"name":"Something's Fishy","overview":"Chef Robert ravels to Fishkill, N.Y., to help Joe and Dena save their floundering restaurant, Joe Willy's Seafood House. While experienced in purchasing seafood, Joe's skills as a head cook leave a lot to be desired, and the stress of the failing business is taking its toll on Dena and their three kids. Robert must force Joe to get past his pride in order to save his restaurant — and his family.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-21","episode_number":2,"episode_type":"standard","id":800527,"name":"Father Knows Worst","overview":"Chef Robert Irvine heads to Murrells Inlet, S.C., to help George and Theresa save their 16-year old family-run Old World Italian Restaurant. Despite growing health and financial problems, George and Theresa can't seem to hand over control to their culinary-trained son, George, Jr. Will Robert's tough love approach be able to fix 16 years of old habits in two days? Read more at: http://www.foodnetwork.com/restaurant-impossible/old-world-italian-restaurant/index.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-28","episode_number":3,"episode_type":"standard","id":800524,"name":"Creepy In Clearwater","overview":"Gus and Evi, the owners of Smitty's Restaurant in Clearwater, Fla., don't just have one problem, they have hundreds — problems that only an exterminator can fix. The exterminator costs Chef Robert and his design team precious money and time, and pulling all the pieces together will truly be a race to the finish.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-12","episode_number":4,"episode_type":"standard","id":800528,"name":"Drowning In Debt","overview":"Chef Robert Irvine has faced many stubborn owners in the past, but he may have met his match in Carolyn, the owner of Mom & Dad's Italian Restaurant in DeFuniak Springs, Fla. Carolyn and her husband George bought the restaurant 24 years ago, but now, six years after George's death, Carolyn refuses to make any changes, despite the ill-prepared food and mounting debt.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-19","episode_number":5,"episode_type":"standard","id":800525,"name":"Muskrat Mayhem","overview":"Chef Robert Irvine travels to Smyrna, Del., to meet three generations of women fighting to keep the Wagon Wheel Family Restaurant open for business. While restaurant is in mayhem over the frozen food, outdated decor, dysfunctional family and disrespectful staff, the only thing keeping the restaurant alive right now is muskrat. Robert has just two days to repair a broken family, or even the popularity of the muskrat won't be enough to keep the wheels on this restaurant any longer.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-26","episode_number":6,"episode_type":"standard","id":800529,"name":"In the Pits","overview":"Lynn has owned Bryan's Smokehouse in Lufkin, Texas for 15 years: Business was great at first, but now an oversaturated market and a staff of misfits have put Lynn further and further into debt.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-09","episode_number":7,"episode_type":"standard","id":800530,"name":"Lost in the Woods","overview":"After losing his successful corporate job, Roger, who has no previous restaurant experience, purchased the Pinehurst Country Lodge in Greeley, Pa., six months ago, and is now $350,000 in debt and on the verge of losing everything. Chef Robert Irvine has just two days to give Roger the tools and authority to lead his staff towards success.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-16","episode_number":8,"episode_type":"standard","id":800531,"name":"Sink or Swim","overview":"Chef Robert is off to Twin Lakes, Wis., to Pier West Restaurant, which has a scenic view and a boatload of problems. As Chip's restaurant falls deeper and deeper into debt, his family is getting angrier and angrier. No one has Chip's back except Robert. He has just two days to give Chip the tools he needs to run this restaurant and reunite the family.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-23","episode_number":9,"episode_type":"standard","id":800532,"name":"It's All Greek to Me","overview":"","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-14","episode_number":10,"episode_type":"standard","id":800533,"name":"Kalico Kraziness","overview":"Chef Robert travels to Douglas, Mich., to save the Kalico Kitchen and longtime owner Catherine, whose vocabulary is so colorful that it's turning the staff and her son against her.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-21","episode_number":11,"episode_type":"standard","id":800535,"name":"Barely Edible","overview":"The 26-year-old Edible's Restaurant & Pub in Horsham, Pa, is suffering from a complete lack of inspiration and motivation, and its food belies its name.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-28","episode_number":12,"episode_type":"standard","id":800534,"name":"Benner Street in Bethlehem","overview":"Owners Dorothy and Thom should be close to retirement but they are so far in debt, they may never be able to stop working. Chef Robert has to tackle an outdated decor, a lack of alcohol at the bar and a husband/chef who fights constantly with his wife.","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-25","episode_number":13,"episode_type":"finale","id":800536,"name":"Pie in the Sky","overview":"","production_code":"","runtime":43,"season_number":6,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":46090,"poster_path":"/zimQ0cKJE0SBGMY5KkwPXmkskeU.jpg","season_number":6,"vote_average":0},"7":{"_id":"5258de15760ee34661776b2d","air_date":"2013-10-23","episodes":[{"air_date":"2013-10-23","episode_number":1,"episode_type":"standard","id":800537,"name":"Mama Campisi's Restaurant","overview":"","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-30","episode_number":2,"episode_type":"standard","id":800538,"name":"Ducky's Family Restaurant","overview":"","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-06","episode_number":3,"episode_type":"standard","id":800539,"name":"Windsor 75","overview":"","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-13","episode_number":4,"episode_type":"standard","id":800540,"name":"Coach Lamp Restaurant & Pub","overview":"","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-20","episode_number":5,"episode_type":"standard","id":968391,"name":"Soul Searching","overview":"The once strong relationship between the owners of the Georgia Boy Cafe has deteriorated.","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-27","episode_number":6,"episode_type":"standard","id":968687,"name":"Unlucky Number Seven","overview":"The Seven restaurant, named for the owner's seven children, battles bad luck.","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-04","episode_number":7,"episode_type":"standard","id":968846,"name":"Unfixable Family","overview":"The volatile owners of Mike LaSusa's Italian Restaurant in Oak Creek, Wis. battle over every decision.","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-18","episode_number":8,"episode_type":"standard","id":969325,"name":"Goombazz Gone Wild","overview":"Goombazz Big City Eatzz, has struggled to find a strong customer base and is now more than $300,000 in debt.","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-01","episode_number":9,"episode_type":"standard","id":969962,"name":"Clueless in the Country","overview":"Chef Robert Irvine meets one of the most clueless owners he's encountered at Heather's Country Kitchen.","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-15","episode_number":10,"episode_type":"standard","id":970471,"name":"Monkey Business","overview":"Chef Robert Irvine is appalled by the condition of the Spunky Monkey Bar & Grill in Auburn, Wash.","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-29","episode_number":11,"episode_type":"standard","id":971010,"name":"Dirty Laundry","overview":"The owner of Hillbillies Restaurant in Murphys, Calif., needs transition from pushover to an empowered business owner.","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-05","episode_number":12,"episode_type":"standard","id":971309,"name":"Mumbo Jumbo","overview":"The owner of the San Francisco Mexican restaurant Estrada's is over $400,000 in debt.","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":13,"episode_type":"standard","id":800541,"name":"Holiday: Impossible 2","overview":"","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":14,"episode_type":"finale","id":968989,"name":"Holiday: Impossible 2","overview":"Chef Robert tries to transform two locations on the Jersey Shore that were devastated by Hurricane Sandy.","production_code":"","runtime":43,"season_number":7,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":46091,"poster_path":null,"season_number":7,"vote_average":0},"8":{"_id":"61b08b42af3da60095828e65","air_date":"2013-03-05","episodes":[{"air_date":"2013-03-05","episode_number":1,"episode_type":"standard","id":3382147,"name":"Up in Smoke","overview":"Five years ago, Lisette and Steve got married, blending their families, and purchased the Mill Creek BBQ Restaurant in Redlands, Calif., modeling it after her father's established nearby restaurant. Instead of the faster, more casual version of her father's restaurant, Chef Robert Irvine finds some of the most tasteless barbecue and inefficient management he's ever come across. He'll have just two days to change the barbecue from boring to bold, get Steve to regain his mojo and find a way to repair the severely broken relationship between Lisette and her 21-year-old daughter.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-12","episode_number":2,"episode_type":"standard","id":3441258,"name":"A Lot to Lose","overview":"Bland food, poor service and no lunch crowd are among the problems identified by Robert, when he arrives at \"Tootie's Texas Barbecue\" in Cathedral City, Cal., which is owned by a woman who recently battled cancer.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-19","episode_number":3,"episode_type":"standard","id":3441259,"name":"Fiery Family Fusion","overview":"A couple who have spent two years trying to make Pasion Latin Fusion Restaurant, in Albuquerque, N.M., a success ask for help from Robert Irvine, who determines that tension between the owner's wife and brother is bad for business.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-26","episode_number":4,"episode_type":"standard","id":3441260,"name":"Pizza: Impossible","overview":"A New York-style pizzeria, in Baton Rouge, Louisiana, serves great food but the business struggles because of a stubborn owner who is scaring away customers with his \"my way or the highway\" attitude.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-02","episode_number":5,"episode_type":"standard","id":3441261,"name":"Ungratifying","overview":"Robert Irvine is in Houston to turn around the Gratifi Kitchen and Bar. In addition to a kitchen so filthy that Robert shuts it down just minutes into his visit, Kevin's poor attitude is a cause of tension for the employees.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-09","episode_number":6,"episode_type":"standard","id":3441263,"name":"Face the Music","overview":"Robert tries to help \"Urban Roots\", a restaurant and entertainment venue in Oklahoma City, become a success, but first he has to reignite the owner/chef's passion for cooking and light a fire under the lackadaisical staff.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-23","episode_number":7,"episode_type":"standard","id":3441264,"name":"Treading Water","overview":"Robert offers advice to a seemingly passionless businesswoman who's finding it difficult to keep \"Bryant's Seafood World\" in Hueytown, Alabama, afloat after taking over the hometown favorite four years ago.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-30","episode_number":8,"episode_type":"standard","id":3441266,"name":"Bummed Out","overview":"High emotions and yelling mark Robert's trip to \"Bumbino's Italian Ristorante\" in Orange County, Florida, where he deals with crumbling relationships, the firing of staff and a switch made in the kitchen.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-07","episode_number":9,"episode_type":"standard","id":3441268,"name":"Meet the Impossible","overview":"Chef Robert Irvine celebrates the show's 100th episode by offering a glimpse at what goes on behind the scenes. Included: interviews with the people who make the makeovers possible; and a look back at the dirtiest kitchens.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-21","episode_number":10,"episode_type":"standard","id":3441270,"name":"Living in the Dark Ages","overview":"A BBQ restaurant, with a caveman/dinosaur theme, needs to be saved from extinction in Winter Garden, Fla. On Robert's to-do list is an overhaul of the décor, consisting of inflatables & foam rocks; & offer tips to control the kitchen chaos.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-28","episode_number":11,"episode_type":"standard","id":3441271,"name":"The Writing on the Wall","overview":"Robert helps the owner and operator of a successful sawmill turn \"Big Jim's Bama Q\" in Hammondville, Ala., into a barbecue destination, but first he has to teach him a thing or two about what it takes to thrive in the food business.8","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-04","episode_number":12,"episode_type":"standard","id":3441272,"name":"Saving Grace","overview":"A business and marriage are in trouble when Robert arrives at \"Grace's Place Bagels and Deli\", in Palm Coast, Florida, which is owned by a couple who are $320,000 in debt and are failing because of a lack of communication and teamwork.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-11","episode_number":13,"episode_type":"finale","id":3441273,"name":"No Day at the Beach","overview":"The Portu-Greek Café in Hudson, Florida, proves to be a challenge for Robert, who has to teach the self-described stubborn owner and his bickering family how to cooperate.","production_code":"","runtime":43,"season_number":8,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"","id":234744,"poster_path":null,"season_number":8,"vote_average":0},"9":{"_id":"64751379dd258900e20c4cca","air_date":"2014-07-23","episodes":[{"air_date":"2014-07-23","episode_number":1,"episode_type":"standard","id":4480339,"name":"Fork in the Road","overview":"A friendship is falling apart over the struggles of the 3-year-old \"Fork Diner\" in Calhoun, Georgia, which chef Robert Irvine deems unsuccessful because of boring food, a lack of cleanliness and a staff that's disinterested.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-30","episode_number":2,"episode_type":"standard","id":4480340,"name":"Culture Clash","overview":"A restaurant in Atlanta has the false reputation of being strictly for Muslims, which is keeping potential customers away. Another challenge Robert faces is the owner, whose experience in catering isn't translating into running this business. Also: A fight breaks out amongst the design team and the makeover is put in jeopardy.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-06","episode_number":3,"episode_type":"standard","id":4480341,"name":"Bowling: Impossible","overview":"Paul's Bar and Bowling in Paterson, N.J., a family-owned neighborhood staple since 1929, needs help getting out of an 8-year slump. In order to succeed, Robert tries to take the business into the 21st century, beginning with a total design overhaul.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-13","episode_number":4,"episode_type":"standard","id":4480353,"name":"Golf: Impossible","overview":"The Pomona Golf and Country Club in Egg Harbor City, N.J., is a nine-hole golf course and clubhouse that has been run by three cousins for the past decade. With few changes to the clubhouse in its 45 years, a lack of new and younger clients has prevented this business from turning a profit, straining the owners' relationships in the process. Chef Robert Irvine is tasked with coming up with a whole new business plan to get these owners' heads out of the sand.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-20","episode_number":5,"episode_type":"standard","id":4480354,"name":"Holy Cow!","overview":"The divorced owners of the Country Cow Restaurant and Bar in Campton, N.H., are on their best behavior for Robert's visit, but the staff and behind-the-scenes footage reveal that animosity between the couple is a problem that needs his uttermost attention.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-27","episode_number":6,"episode_type":"standard","id":4480355,"name":"No Laughing Matter","overview":"Robert deals with an owner who fancies himself a stand-up comedian and is more focused on telling jokes to customers than paying attention to the quality of food he's serving at Uncle Andy's Diner in Portland, Maine.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-03","episode_number":7,"episode_type":"standard","id":4480369,"name":"Take It or Leave It","overview":"Robert offers to buy El Bistro in Titusville, Pa., after the owner, a single mother of four with a love of cooking, asks for help turning around her failing restaurant.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-10","episode_number":8,"episode_type":"standard","id":4480370,"name":"Spicing Things Up","overview":"Robert deals with clueless owners, a scantily-clad waitstaff and $300,000 in debt when he arrives at Spicy Bar and Grill in Falls Church, Va. Also: A new chef needs to be hired.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-17","episode_number":9,"episode_type":"standard","id":4480371,"name":"Military: Impossible","overview":"Robert travels to Fort Bragg, N.C., on a mission to breath new life into the Green Beret Club, one of the only full-service restaurants on the post. Among the challenges he faces is finding a way to keep tradition alive while making some necessary changes.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-24","episode_number":10,"episode_type":"standard","id":4480372,"name":"Drama at Momma's","overview":"Robert deals with feuding sisters at \"Mamma Lucrezia's\" in Bellefonte, Pa., which despite excellent food coming from the kitchen, is losing $1000s a month and faces competition from a nearby Italian restaurant, owned by their brother.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-06","episode_number":11,"episode_type":"standard","id":4480373,"name":"Paradise: Impossible","overview":"Robert Irvine is in South Padre Island to help the Padre Rita Grill. The grill has both food and music, but they're not doing either very well. Robert must overhaul the tacky decor and get the owners focused on the bottom line.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-13","episode_number":12,"episode_type":"standard","id":4480374,"name":"An Abundance of Emotions","overview":"Robert offers help to the owner of Abudanza Restaurant in Wilbraham, Mass., a proud man with years of executive chef experience, but who is burnt out from the demands of the job and caring for a sick child.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-03","episode_number":13,"episode_type":"finale","id":4480375,"name":"Recipe for Disaster","overview":"Robert Irvine deals with an explosive family that's about to implode while trying to keep Papa C's Eastside Cafe in Fairport, N.Y., in business. Included: The owner and his three sons play the \"blame game\" rather than do their jobs; inches of grease and grime need to be removed before the restaurant can be reopened.","production_code":"","runtime":43,"season_number":9,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"","id":343007,"poster_path":null,"season_number":9,"vote_average":0},"10":{"_id":"64751881c2823a00c4213b74","air_date":"2014-11-24","episodes":[{"air_date":"2014-11-24","episode_number":1,"episode_type":"standard","id":4480376,"name":"Without a Prayer","overview":"A few years ago, Keith and Stephanie's restaurant, Mama E's Wings & Waffles restaurant in Oklahoma City, was thriving and was featured on Diners, Drive-ins and Dives. But a failed attempt at opening a second location put a strain on their finances — and their marriage. Chef Robert Irvine must get this volatile couple communicating again if he's going to be able to save their restaurant.","production_code":"","runtime":43,"season_number":10,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-15","episode_number":2,"episode_type":"standard","id":4480377,"name":"Oh Brother!","overview":"Through the financial help of their mother and stepfather, brothers Gabe and Javier have owned the Knife and Fork Gastropub in San Antonio for two years. Although it appears wildly successful, the restaurant is being run into the ground, so the parents have called in Chef Robert Irvine to intervene. He'll have to find out where the money is going, get this restaurant clean and get the brothers to find their drive.","production_code":"","runtime":43,"season_number":10,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-14","episode_number":3,"episode_type":"standard","id":4480378,"name":"Revved Up","overview":"Restaurant: Impossible goes hog wild in Albuquerque, N.M., at the Shade Tree Customs and Cafe where Chef Robert Irvine meets a handful of characters who opened a full service restaurant above their motorcycle repair shop. Robert must unravel the mystery of why this restaurant is failing and tackle the blah menu, while the design team is challenged with elevating the Shade Tree's decor without losing its motorcycle soul.","production_code":"","runtime":43,"season_number":10,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-28","episode_number":4,"episode_type":"standard","id":4480379,"name":"Mystic Mystery","overview":"Mike and Erika opened Mystic Treats in Ashland, Ore., three years ago, hoping to attract customers with their vegetarian and offbeat pizzas. Three years and multiple failed concepts later, they've called in Chef Robert Irvine for help. Robert will have to start from scratch, educating the owners, choosing an identity, focusing the menu and creating a design vision — all in just two days.","production_code":"","runtime":43,"season_number":10,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-04","episode_number":5,"episode_type":"standard","id":4480384,"name":"Betting the House","overview":"Chef Robert Irvine has seen a lot of desperate restaurants, but Zoog's Caveman Cookin' in Port Hadlock, Wash., may just be the worst. At just two years old, it's repulsively dirty and the owner has lost his passion, leaving his inexperienced daughter to run the place. And if this wasn't enough of a challenge for Robert to overcome, the government shows up, threatening to close the doors of the restaurant.","production_code":"","runtime":43,"season_number":10,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-11","episode_number":6,"episode_type":"standard","id":4480385,"name":"Dog and Pony Show","overview":"Chef Robert Irvine arrives at the Dog & Pony Ale House in Renton, Wash., where he meets the owner, Kristen. Despite Kristen's whit and smarts, she's being overwhelmed by a vocal group of customers who cause her to buy equipment and change the menu on a whim, trust issues with her staff and hundreds of thousands in debt owed to the IRS. Robert will have to give Kristen the tools she needs to toughen up and turn this confused bar into a place worthy of all its patrons, before the Dog & Pony is shut down and Kristen loses everything.","production_code":"","runtime":43,"season_number":10,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-18","episode_number":7,"episode_type":"finale","id":4480386,"name":"Game Over","overview":"Brothers Jon and Bobby opened Bene Pizza and Pasta, a restaurant/arcade in Omaha 13 years ago. Business was booming until Bobby got sick and business dropped, requiring their mom's financial help to keep the doors open. Chef Robert Irvine has his hands full trying to mend the years' worth of hurt feelings between the brothers, get mom to loosen her reins and figure out what to do with the noisy arcade.","production_code":"","runtime":43,"season_number":10,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"","id":343008,"poster_path":null,"season_number":10,"vote_average":0},"11":{"_id":"6475188add258900e20c4f06","air_date":"2015-03-18","episodes":[{"air_date":"2015-03-18","episode_number":1,"episode_type":"standard","id":4482189,"name":"4,000 Square Feet of Trouble","overview":"At over 4,000 square feet, WhaBah Steakhouse in Bowling Green, Ky., presents Robert with his biggest challenge yet! The eight-year-old restaurant/music venue made more than a million dollars in its first year, but the owner has hit the wall and is now facing bankruptcy. Robert and his team will have to turn the owner's spirits around and tackle the many challenges of this supersized space in just two days.","production_code":"","runtime":43,"season_number":11,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-25","episode_number":2,"episode_type":"standard","id":4482192,"name":"Double Trouble","overview":"24-year-old Frankie is torn between his family's two Italian restaurants in Summerville, S.C., and he convinces Chef Robert Irvine to help him save both. Tackling twice the work without any extra time, Robert must get the family and the design team to focus on this double-sized mission.","production_code":"","runtime":43,"season_number":11,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-01","episode_number":3,"episode_type":"standard","id":4482193,"name":"Chocolate: Impossible","overview":"A French Bistro with a chocolate boutique in Texas is deeply in debt, but the owner refuses to advertise or cater to the local community.","production_code":"","runtime":43,"season_number":11,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-08","episode_number":4,"episode_type":"standard","id":4482194,"name":"When Life Gives You Lemons...","overview":"Robert's mission takes him just outside of Chicago, to Zest Bistro — a restaurant located INSIDE The Lemon Tree Grocer! For the first time in RI history, Robert has to fix both a restaurant AND a grocery store!","production_code":"","runtime":43,"season_number":11,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-22","episode_number":5,"episode_type":"standard","id":4482195,"name":"Prescription for Failure","overview":"Chef Robert Irvine is challenged to fix an old fashioned lunch counter, located inside a family-owned pharmacy.","production_code":"","runtime":43,"season_number":11,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-29","episode_number":6,"episode_type":"standard","id":4482197,"name":"Going Down With the Ship","overview":"Bad business decisions are hastening the demise of Gigi's Music Cafe in Sunshine, Fla.","production_code":"","runtime":43,"season_number":11,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-06","episode_number":7,"episode_type":"standard","id":4482198,"name":"The Ambush","overview":"To get a truer picture, Robert ambushes the owners of Tornatore's Pizzeria in Orlando, Fla.","production_code":"","runtime":43,"season_number":11,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-13","episode_number":8,"episode_type":"finale","id":4482199,"name":"Bad Juju","overview":"The JuJu Bag in New Orleans is half cafe and half barber salon, and both are in desperate need of makeovers.","production_code":"","runtime":43,"season_number":11,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 11","overview":"","id":343009,"poster_path":null,"season_number":11,"vote_average":0},"12":{"_id":"647518966743fa00a99ec5bc","air_date":"2015-10-22","episodes":[{"air_date":"2015-10-22","episode_number":1,"episode_type":"standard","id":4482200,"name":"Ambush: Breakfast Break-In","overview":"In the Season 12 premiere, Robert leads a surprise makeover ambush of Theresa's Restaurant in Bradenton, Fla. Once there, he realizes the owner is her own worst enemy by being a micromanager. Also: He faces a kitchen staff mutiny and some design challenges.","production_code":"","runtime":43,"season_number":12,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-29","episode_number":2,"episode_type":"standard","id":4482202,"name":"Ambush: Son Sneak Attack","overview":"The owners of Lake Arrowhead Sports Grill in Blue Jay, Cal., receive a surprise visit from Robert, which was arranged by their son, who's concerned that after five years the business is failing, along with his parents' marriage and his mom's health.","production_code":"","runtime":43,"season_number":12,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-05","episode_number":3,"episode_type":"standard","id":4482203,"name":"Ambush: Eyes on the Surprise","overview":"The owner of a bar and grill in Crestwood, Ill., which hasn't turned a profit in the eight months it has been open, is also in danger of losing her husband due to the strain her failing business has put on her marriage. When Robert arrives unannounced, he has to deal with a furious bar manager, big-time financial problems and an unexpected theft.","production_code":"","runtime":43,"season_number":12,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-12","episode_number":4,"episode_type":"standard","id":4482205,"name":"Ambush: Stay... Or Go?","overview":"Chef Robert Irvine heads to Ellendale's Restaurant in Nashville after former employees reach out for help. The restaurant has become rundown, and owner Julie's management style has left the staff frustrated and unmotivated. The employees see the potential in this historic Nashville staple, but Julie isn't the type to ask for help and is worried about how being on TV will affect her restaurant's reputation. Time is ticking away, so Robert begins to worry: will she let him stay and help, or will she make him go?","production_code":"","runtime":43,"season_number":12,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-19","episode_number":5,"episode_type":"standard","id":4482214,"name":"Ambush: Fight to the Finish","overview":"Chef Robert Irvine is headed to New Kensington, Pa. to ambush Stacey, the owner of Stella's Dine-Inn Restaurant. Stacey's daughter reached out after witnessing constant, out-of-control fighting between her mother, who is desperate to keep the restaurant going in her late husband's memory, and her brother, Dom, who serves as the main cook. Robert must work hard to help this family from being torn apart while also facing design struggles with the very large restaurant space.","production_code":"","runtime":43,"season_number":12,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-03","episode_number":6,"episode_type":"standard","id":4482220,"name":"Ambush: Facing Fears","overview":"Chef Robert Irvine is called to the Cape Horn Family Restaurant in Red Lion, Pa. after receiving a plea for help from the owner Joni's husband, Barry. Joni is having trouble paying the bills and has lost control of her staff, but after Robert installs hidden cameras he realizes it's Joni herself who needs work. As Robert navigates a rollercoaster of emotions with Joni, he aims to help her face her fears and repair her self-confidence in order to change her staff and, more importantly, herself.","production_code":"","runtime":43,"season_number":12,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-17","episode_number":7,"episode_type":"finale","id":4482234,"name":"Ambush: Special Delivery","overview":"For his next mission, Chef Robert Irvine heads to La Casa Bianca in Whitehouse Station, N.J. to give the owner, Paul, the surprise of a lifetime. Paul's daughter, Megan, reached out to Robert for help after noticing the restaurant floundering and her father losing his passion for the business. It's up to Robert to help reignite Paul's fire and get him back in the game!","production_code":"","runtime":43,"season_number":12,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 12","overview":"","id":343010,"poster_path":null,"season_number":12,"vote_average":0},"13":{"_id":"56f2d04992514134d60003e5","air_date":"2016-03-09","episodes":[{"air_date":"2016-03-09","episode_number":1,"episode_type":"standard","id":1178284,"name":"Ambush: Faded Star","overview":"Chef Robert Irvine heads to Starlite Restaurant and Pizza in West Orange, N.J. after receiving a plea from the owner Patty's son. Patty has worked there since she was 13 years old and considers it home, but hasn't made a profit in almost ten years despite cashing in her retirement and mortgaging her home. When Robert arrives, he finds an extremely dirty kitchen and an old-school staff that is completely unwilling to change, including Patty herself. Will Robert be able to return this beloved restaurant to its former glory, or will the Starlite shine no more?","production_code":"","runtime":43,"season_number":13,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-16","episode_number":2,"episode_type":"standard","id":1178285,"name":"Ambush: Beneath the Surface","overview":"For his next mission, Chef Robert Irvine responds to a call from Tamara, whose mother Raquel owns De Rican Chef in Virginia Beach, Va. Raquel wanted a restaurant that specialized in authentic Puerto Rican food and expanded her business with help from her son, Reuben, but they are barely making a profit and their relationship is suffering. As Robert tries to get to the bottom of their problems, Raquel drops a bombshell about why she has lost her passion, leading Robert to try to heal the family and restore Raquel's love for her special piece of home.","production_code":"","runtime":43,"season_number":13,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-23","episode_number":3,"episode_type":"standard","id":1178286,"name":"Ambush: A Taxing Situation","overview":"Chef Robert Irvine receives a heartbreaking plea from Megan, who owns the BFE Bar and Grill in Waynesboro, Ga. with her husband, Mike. The restaurant is deep in debt and their family is suffering, but when Robert shows up, he also finds out that the state suspended their liquor license for not paying their taxes. Robert quickly learns he will have to pick and choose what to fix: their reputation is in the dumps, they're understaffed, and food service is painfully slow. It's a fight to the finish as he desperately tries to fix as much as he can and the owners try to pay back their taxes before the grand reopening.","production_code":"","runtime":43,"season_number":13,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-30","episode_number":4,"episode_type":"standard","id":1178287,"name":"Ambush: In Robert We Trust","overview":"After receiving a plea for help from an employee, Chef Robert Irvine and his team head to Peppino's Ristorante Italiano in Oviedo, Fla. Owners Susan and Luigi bought the restaurant hoping that their son, Nato, would eventually take over, but they feel they can't trust him due to his poor work ethic and attitude. With just two days and $10,000, Robert has his hands full with updating the decades-old menu, service, and decor, as well as figuring out whether Nato is even capable of running the business.","production_code":"","runtime":43,"season_number":13,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-04-13","episode_number":5,"episode_type":"standard","id":1178288,"name":"Ambush: Out of Control","overview":"Sarah and Justin only opened SiP Bistro in Holly Springs, N.C. three years ago, but their business is already hurting. Though Sarah has a background in hotel and restaurant management, her husband, Justin, is demeaning to the entire staff and hasn't allowed his wife to take control or make decisions. On top of trying to mend their relationship and negotiate a healthy balance of control, Chef Robert Irvine and his team must also do a full dining room renovation and find a way to make the extremely small kitchen as efficient as possible.","production_code":"","runtime":43,"season_number":13,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-04-20","episode_number":6,"episode_type":"standard","id":1178289,"name":"Ambush: Exercise Surprise","overview":"Chef Robert Irvine receives a desperate plea from Ayana, the oldest daughter of Luvina and Jameel, owners of So Natural Organic Restaurant and Market in Harker Heights, Texas. Luvina and Jameel opened the business because they are passionate about healthy food, but with zero restaurant experience, they've quickly fallen into debt and cannot afford to hire staff outside of their own family. After a disastrous lunch service test, Robert finds he must not only teach the owners efficient operating procedures but show them how to turn their okay-tasting healthy food into great food that just happens to be healthy.","production_code":"","runtime":43,"season_number":13,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-04-27","episode_number":7,"episode_type":"standard","id":4485659,"name":"Ambush: Cray, Cray","overview":"Chef Robert Irvine receives a pressing plea from Jamie, best friend of Cray Eatery and Drinkery's owner Crystal in Columbus, Ohio. Crystal opened Cray after being inspired by infused liquors from Cambodia, but her lack of experience and dismissive nature have led to her being unable to pay bills and begging for free labor from friends. Robert soon discovers that the restaurant is also unclean, the food service is slow, and the liquor infusions are nauseating. While the restaurant concept is unique, Robert must find a way to solve all of its other problems and help Crystal put her failures behind her.","production_code":"","runtime":45,"season_number":13,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-04","episode_number":8,"episode_type":"finale","id":4485660,"name":"Ambush: Third Ambush Is the Charm","overview":"Chef Robert Irvine receives a heart-wrenching plea from Yianni, the son of the owner of Broad Street Bistro in North Versailles, Pa. Owner Tasso has only had the restaurant for a year and a half, but he's struggling to keep it afloat as it is dirty and dark with subpar food and a helpless staff. Tasso's wife, Kathy, is unhappy with all of the time he spends at the restaurant, and Yianni, a trained chef, tried to help out but his father would not listen. After ambushing both Kathy and Tasso, Robert plans a third surprise ambush that will keep everyone guessing.","production_code":"","runtime":45,"season_number":13,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 13","overview":"","id":75619,"poster_path":null,"season_number":13,"vote_average":0},"14":{"_id":"5cb7010f92514108d1f57fdc","air_date":"2019-04-20","episodes":[{"air_date":"2019-04-20","episode_number":1,"episode_type":"standard","id":1762523,"name":"Dying Diner","overview":"Robert Irvine steps back in time at a struggling retro joint in Escondido, Calif., called Rosie's Cafe; the owner of the ugly, disorganized restaurant is a young woman who has the passion but lacks experience.","production_code":"","runtime":43,"season_number":14,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-27","episode_number":2,"episode_type":"standard","id":1762525,"name":"Fight at Filomenia's","overview":"Robert heads to Costa Mesa, Calif., to help turn around the struggling Filomena's Italian Kitchen and Market; despite a clean kitchen, organized dining room and allegedly good food, the owner hasn't been able to pay herself one dime since opening.","production_code":"","runtime":43,"season_number":14,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-04","episode_number":3,"episode_type":"standard","id":1784760,"name":"Mom Finds Her Mojo","overview":"When Robert arrives at Incredible Cafe in San Diego, he finds a restaurant that is anything but incredible; the kitchen is an abomination and the woman who runs it is in crippling debt; Robert helps to reignite her passion.","production_code":"","runtime":43,"season_number":14,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-11","episode_number":4,"episode_type":"finale","id":1784761,"name":"Smoky Steakhouse","overview":"Robert arrives in Safford, Ariz., to help turn things around at the Copper Steer Steakhouse; the restaurant was the dream of Parrish and Maureen, but it turned into a nightmare as they started losing money with no clue how to turn things around.","production_code":"","runtime":43,"season_number":14,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 14","overview":"","id":122443,"poster_path":null,"season_number":14,"vote_average":0},"15":{"_id":"5d568534e8131d4aa1898491","air_date":"2019-07-20","episodes":[{"air_date":"2019-07-20","episode_number":1,"episode_type":"standard","id":1891090,"name":"Hard Times at Josephine's","overview":"Robert Irvine heads to Chicago's South Side to try to save an iconic restaurant from closing its doors. After more than 30 years as a beacon in the community, Josephine's Cooking is one month from closing. Robert must motivate the co-owner, Victor, to take over the reins and relieve his aging, strong-willed mother, Josephine. With only two days and $10,000, Robert has his hands full trying to keep an important piece of South Side history alive.","production_code":"","runtime":43,"season_number":15,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-07-27","episode_number":2,"episode_type":"standard","id":1891091,"name":"A Family Restaurant at War","overview":"Robert Irvine heads to Columbia, Mo., to rescue McLanks Family Restaurant from shutting down. The restaurant is run by a single mother and her five adult children who fight constantly, and the tension is tearing both the family and the restaurant apart. It's up to Robert to fix their relationship and get them to work together before McLanks closes for good.","production_code":"","runtime":43,"season_number":15,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-03","episode_number":3,"episode_type":"standard","id":1891092,"name":"Caribbean Catastrophe","overview":"Robert Irvine heads to Chez Olga in Grand Rapids, Mich., where the struggling Caribbean restaurant's dingy dining room, bland menu and terrible kitchen are tearing apart the mother and daughter who run it. Robert must completely revamp the look and menu as well as get the owners to work as partners, or this restaurant is sure to fail.","production_code":"","runtime":43,"season_number":15,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-10","episode_number":4,"episode_type":"standard","id":1891093,"name":"A Single Dad Sparks His Passion","overview":"Robert Irvine is in Nutter Fort, W.V., where a West Virginian-Italian-American-barbecue-family restaurant has a confused identity and is in for one of the biggest transformations ever. Single dad Mike Audia is going to lose his restaurant and his home unless Robert puts everything he has into helping him turn the restaurant around.","production_code":"","runtime":43,"season_number":15,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-17","episode_number":5,"episode_type":"standard","id":1891094,"name":"Dull Diner Dilemma","overview":"Robert Irvine is faced with the problem of making a run-of-the-mill diner stand out in the heart of diner country in North Chelmsford, Massachusetts. After 13 years in business, mother and daughter co-owners Rosie and Bridget have run out of money and options. If they are going to be able to save Rosie’s Diner, Robert is going to need to change almost everything in this outdated restaurant.","production_code":"","runtime":43,"season_number":15,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-24","episode_number":6,"episode_type":"standard","id":1891095,"name":"Saving a Family's Legacy","overview":"Robert Irvine comes to the rescue of a Maryland seafood restaurant that has been in the family for more than 60 years and is on the brink of closing its doors. Third-generation owner Chad and his sister, Cara, attempt to salvage what's left of their family legacy, determined to keep alive the memory of their late parents and grandparents. With the finances in disarray, nonexistent leadership and a divide between the uninspired staff and stubborn management, Robert faces one of his toughest challenges to keep this family business afloat.","production_code":"","runtime":43,"season_number":15,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-31","episode_number":7,"episode_type":"standard","id":1891096,"name":"Lakefront Disaster","overview":"Robert Irvine heads to Tomahawk, Wisc., to try to save a small-town steakhouse from closing. Owner Brenda is just one month away from shutting the doors for good, and she needs Robert to remind her of her passion for the business and help her fix more than 30 years of bad habits. With only two days and $10,000, Robert has his hands full trying to save Besse's on Clear Lake.","production_code":"","runtime":43,"season_number":15,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-07","episode_number":8,"episode_type":"finale","id":1891097,"name":"A Daughter Finds Her Groove","overview":"Robert Irvine travels to Muncie, Ind., where the rundown Madison Street Retro Diner is in dire straits. Owner Rita Watkins is in charge of the place, but her health is failing, and her daughter, Melissa, can't seem to step up to the plate and take over. Robert has two days to give Melissa the tools and confidence she needs or this home-style, American restaurant has no chance of survival.","production_code":"","runtime":43,"season_number":15,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 15","overview":"","id":130081,"poster_path":null,"season_number":15,"vote_average":0},"16":{"_id":"5e01e1b765686e001598edc8","air_date":"2019-12-26","episodes":[{"air_date":"2019-12-26","episode_number":1,"episode_type":"standard","id":2028056,"name":"Dumplings in Delaware","overview":"Chef Robert Irvine rolls up to the Southern Grille of Ellendale in Ellendale, Del. The owner of the Southern-style restaurant, Ronald, is working too hard to be in so much debt. If Robert can't help him reconnect with what makes him and his restaurant special, the local spot for Southern home cooking is doomed.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-02","episode_number":2,"episode_type":"standard","id":2027666,"name":"Cleaning Up in Mississippi","overview":"Chef Robert Irvine has his work cut out for him when he arrives in Ridgeland, Miss. Rossini's Cucina Italiana is absolutely filthy, and even worse, owners Lori and Toni seem to have given up. Robert has to roll up his sleeves and get his hands dirty in order to clean up this small-town restaurant.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-09","episode_number":3,"episode_type":"standard","id":2028029,"name":"Help Is On the Way","overview":"Chef Robert Irvine is in Akron, Ohio, to save Edgar's Restaurant. Fixing a restaurant in only two days is impossible enough, but when Glenn, the restaurant's owner, is less than honest with Robert, it creates a whole new set of problems. If Robert can't figure out what makes Glenn tick, this restaurant has no chance.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-16","episode_number":4,"episode_type":"standard","id":2028059,"name":"Old Habits Die Hard","overview":"At Perella's Ristorante in Warren, R.I., Chef Robert Irvine meets an owner whose stubbornness is holding back his restaurant. Lou hasn't updated the menu, the decor or his opinions since the restaurant opened 25 years ago, and he may lose his restaurant and his legacy if Robert can't convince him to change his ways.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-23","episode_number":5,"episode_type":"standard","id":2028058,"name":"New Roles, New Results","overview":"Chef Robert Irvine comes to the rescue of Foxfire Grill in Alexandria, Va., where the owners, Terri and Jackie, simply can't figure out why they aren't making money. Their restaurant has a good location, they're smart, and they work hard. So what gives? If Robert can't identify and solve the problem, they'll have no choice but to close.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-30","episode_number":6,"episode_type":"standard","id":2028057,"name":"Out with the Old, In with the New","overview":"At Carmine's Chianti Cow in Port Jervis, N.Y., Chef Robert Irvine meets an owner whose identity crisis is threatening his restaurant. Stuck in a rut serving the same food as the previous owner, Chef Keith needs a wake-up call or this potential small-town gem is doomed to close.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-06","episode_number":7,"episode_type":"standard","id":2028060,"name":"Saving a Piece of History","overview":"Robert Irvine tries to save a piece of history in Garrettsville, Ohio, by rescuing a restaurant in a 200-year-old mill. Shelli, the owner of Garrett's Mill Brewing Co., is in over her head after her husband had to return to his trucking job to keep the business afloat. They have a $500,000 payment coming due, and the historic mill is just months away from grinding to a halt.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-13","episode_number":8,"episode_type":"standard","id":2028061,"name":"Beloved Restaurant on the Rocks","overview":"Robert Irvine visits Ferguson, Mo., to help a beloved community restaurant on the brink of closing its doors. The owners of Drake's Place, Sonny and Bridget, are out of both money and options. They wish their son would step up more, but Sonny also struggles to give up control. It's up to Robert to see if he can salvage their dream of making this restaurant their family legacy.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-20","episode_number":9,"episode_type":"standard","id":2170884,"name":"Cajun Seafood Crisis","overview":"The Balcony restaurant in Larose, La., is one of the oldest Cajun seafood restaurants in the bayou. The owner has worked there for 28 years, but her friendly relationship with the employees has cost her their respect. Now, Chef Robert Irvine needs her to become the boss she's never been, or she'll lose everything she's worked for.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-27","episode_number":10,"episode_type":"standard","id":2175665,"name":"Lost in the Bayou","overview":"At Lil G's Kajun Restaurant in Louisiana, Chef Robert Irvine meets Therese, who bought the restaurant 12 years ago, having no experience. With her daughter's help, Therese has managed to stay afloat, but after consecutive years of losing more than $100,000, they've run out of options. If Robert can't reverse the tide, Lil G's name is mud.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-05","episode_number":11,"episode_type":"standard","id":2182699,"name":"Chattanooga Blues","overview":"Mike and Cherita started their family-run restaurant, Blue Orleans in Chattanooga, after losing everything in Hurricane Katrina. Now they are going through a divorce, and their kids, Dallen and Jolie, are caught in the crossfire. Chef Robert Irvine works to make the restaurant successful and bring peace back to the family.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-12","episode_number":12,"episode_type":"standard","id":2188793,"name":"Greek Tragedy","overview":"Chef Robert Irvine heads to Delray Beach, Fla., to work with Bobby, the owner of Taverna Trela, in hopes of reviving the flagging clientele. Bobby reveals that he has neglected the place due to the loss of his parents, and Robert must dig deep to find a way to fix this family-run Greek restaurant before it's too late.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":13,"episode_type":"finale","id":2190477,"name":"Saving a Pastor's Passion","overview":"After investing $200,000 and losing $4,000 a month, Andrew, a pastor and owner of home-style restaurant Loyd Have Mercy in Titusville, Fla., has lost hope of turning things around. It's up to Robert Irvine to help Andrew rediscover his passion and his self-confidence, or his restaurant will be shutting its doors forever.","production_code":"","runtime":43,"season_number":16,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 16","overview":"","id":138974,"poster_path":"/q5lCbuk4obBqUtlx1969wSD0qNh.jpg","season_number":16,"vote_average":0},"17":{"_id":"5eabf63066f2d2001bac93c1","air_date":"2020-04-29","episodes":[{"air_date":"2020-04-30","episode_number":1,"episode_type":"standard","id":2917058,"name":"Quarantine Check-In","overview":"Robert checks on the Restaurant: Impossible family during the pandemic.","production_code":"","runtime":43,"season_number":17,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-07","episode_number":2,"episode_type":"standard","id":2917061,"name":"First Episode Rewatch","overview":"Robert and his wife watch the very first episode of Restaurant: Impossible.","production_code":"","runtime":43,"season_number":17,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-14","episode_number":3,"episode_type":"standard","id":2917063,"name":"Saving a Pastor's Passion","overview":"Robert Irvine tries to restore a pastor's faith in his Florida restaurant.","production_code":"","runtime":43,"season_number":17,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-21","episode_number":4,"episode_type":"standard","id":2250561,"name":"Fixing a Family in Houston","overview":"Buried in debt, Habanera and the Guero in Houston, Texas, is on the verge of closing. The infighting is destroying the business and a 3-year-old daughter is stuck in the middle. Robert Irvine will have to convince the owner, Ben, to step back from the obsessive control of his partner and chef, Vanessa, and concentrate on the rest of the restaurant, or Ben will lose both his business and his family.","production_code":"","runtime":43,"season_number":17,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-28","episode_number":5,"episode_type":"standard","id":2260181,"name":"Revisited: Helping One of Our Own","overview":"Robert Irvine returns to Rosie's Cafe in Escondido, Calif., where he previously helped the owner, Kaitlyn, revive her failing restaurant. She has since suffered a near-fatal car accident, and Robert comes back to pull off a spectacular event -- breaking every rule in television if necessary -- to help this Restaurant: Impossible family member with her mounting medical bills.","production_code":"","runtime":43,"season_number":17,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-04","episode_number":6,"episode_type":"standard","id":2297070,"name":"Back on Track in Glendora","overview":"Robert Irvine heads to T. Phillip's Alehouse and Grill in Glendora, Calif., and finds a restaurant that looks more like a dive bar. The owner, Jen, can't stand up for herself and everyone walks all over her. Robert must find a way to break down Jen's walls in order to build her, and the restaurant, back up.","production_code":"","runtime":43,"season_number":17,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-11","episode_number":7,"episode_type":"standard","id":2305475,"name":"Ginger Monkey Is Going Under","overview":"The chef and owner, Jackson, of the Ginger Monkey in Chandler, Ariz., has a ton of experience but can't keep up with the demands of his high-volume restaurant. With three years of losses on the books, he's failing big-time. There's something wrong with this picture, and Robert Irvine is ready to solve the mystery!","production_code":"","runtime":43,"season_number":17,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-18","episode_number":8,"episode_type":"standard","id":2917064,"name":"Revisited: Out of Date","overview":"Robert returns to Paterson, NJ, to check on Paul's Bar and Bowling.","production_code":"","runtime":43,"season_number":17,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-07-16","episode_number":9,"episode_type":"finale","id":2917066,"name":"Revisited: Soul of a Marriage","overview":"Robert Irvine revisits Oklahoma City soul food restaurant Mama E's Wings and Waffles to see whether the owners have been able to overcome their marital challenges and work together to make their restaurant a success. Robert also rewatches his trip to London.","production_code":"","runtime":43,"season_number":17,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 17","overview":"","id":149648,"poster_path":null,"season_number":17,"vote_average":0},"18":{"_id":"6029d91e8258fc003f9c2bf5","air_date":"2021-01-07","episodes":[{"air_date":"2021-01-07","episode_number":1,"episode_type":"standard","id":2731512,"name":"Moving On in Montana","overview":"Robert Irvine helps the widowed owner of Don Luis Restaurant in Billings, MT, move past the grief of losing her husband. Carmen hasn't altered a thing in her restaurant since Luis' passing, and she must accept change if her business is to survive.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-14","episode_number":2,"episode_type":"standard","id":2731513,"name":"Destination, Hawk Springs","overview":"Robert Irvine ventures to The Emporium in the small town of Hawk Springs, WY, where owner Dennis is struggling to lead his staff and attract customers. If Robert can't make him change his ways, Dennis' daughter might walk away from the business forever.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-21","episode_number":3,"episode_type":"standard","id":2731514,"name":"Colorado Couple in Crisis","overview":"The couple that runs Millonzi's in Fairplay, CO, is buried in debt and on the brink of divorce. Robert must get Tim and Jennifer to work as a team again if they have any hope of salvaging their relationship or their 14-year old restaurant.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-28","episode_number":4,"episode_type":"standard","id":2731516,"name":"Bogged Down in Buffalo","overview":"In Buffalo, single father Steven Marchione is struggling to keep the family's legacy restaurant Casa Di Francesca's open after a series of tragic life events. Robert has 48 hours to make Steven the leader his restaurant needs to save the business.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-04","episode_number":5,"episode_type":"standard","id":2731517,"name":"Community Hub in Chaos","overview":"Robert visits Park Vue Soul Food Bar and Restaurant in Buffalo, where an inexperienced mother and daughter team is desperately trying to serve their community. Robert helps give them the skills they need to save their dream.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-11","episode_number":6,"episode_type":"standard","id":2731518,"name":"Taking Ownership in Vegas","overview":"Julissa, the widowed owner of the Polaris Street Cafe in Las Vegas, is struggling to save her deceased husband's dream restaurant. If Robert can't get her to find her own path, that dream will die, and so will the business.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-18","episode_number":7,"episode_type":"standard","id":2745508,"name":"Saving an American Dream","overview":"","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-24","episode_number":8,"episode_type":"standard","id":2917051,"name":"A Dream in Shambles","overview":"Robert heads to Las Vegas to work his magic at A Pizza Melody","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-04","episode_number":9,"episode_type":"standard","id":2745784,"name":"House of Cards","overview":"A model and a former poker player opened Cafe No Fur in Las Vegas, Nev., but they're so stuck in their dysfunctional ways that the restaurant is on the verge of folding after only two years. Robert Irvine must get them to change their stubborn ways or all bets are off on the restaurant's survival.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-11","episode_number":10,"episode_type":"standard","id":2745762,"name":"Listless in Louisiana","overview":"Robert Irvine travels to Lafitte, La., to visit Boutte's Bayou Restaurant, where owner Nick is too proud to ask for help as he tries to keep the iconic coastal watering hole afloat. Robert must help Nick become a real leader and learn to trust his staff before it's too late.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-18","episode_number":11,"episode_type":"standard","id":2745768,"name":"Friends in Need","overview":"Robert Irvine arrives at Dunbar's Creole Cuisine in New Orleans to find a restaurant full of history but in dire need of his help. The livelihood of two families depends on the success of this legacy restaurant, and with no systems in place, no set roles and the restaurant matriarch refusing to change, Robert has his work cut out for him.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-08","episode_number":12,"episode_type":"standard","id":2824286,"name":"Nancy Foots the Bill","overview":"Robert Irvine is in Geneva, NY, at Cosentino's Ristorante, where co-owners Bill and Nancy are struggling to save their family restaurant. Their marriage is suffering from an unbalanced workload while their inexperienced son serves unappetizing food.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":13,"episode_type":"standard","id":2775980,"name":"Turning Anger into Action","overview":"Robert Irvine heads to Las Vegas heads to Vegas to work his magic at A Pizza Melody. The owner's anger issues have turned his dream of owning his own restaurant into a nightmare, and his husband has spent almost $1 million trying to make it a success, to no avail.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":14,"episode_type":"standard","id":2947296,"name":"Two Stops in Tennessee","overview":"Robert Irvine visits Z Fish House in landlocked Loudon, Tenn., where the owner, Ed, needs a life preserver. Robert helps Ed rediscover his passion and lead his staff to success. Then Robert returns to Chattanooga, Tenn., and checks in at Blue Orleans, where the owners' divorce was derailing their restaurant business.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":15,"episode_type":"finale","id":2915451,"name":"The Anchor and The Balcony","overview":"Robert Irvine visits The Anchor in Louisville, Tenn., where the owner, an Air Force veteran, is struggling to keep the restaurant open; then Robert returns to The Balcony in Larose, La.","production_code":"","runtime":43,"season_number":18,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 18","overview":"","id":181510,"poster_path":null,"season_number":18,"vote_average":0},"19":{"_id":"60a7adbf8dbc330059955904","air_date":"2021-05-20","episodes":[{"air_date":"2021-05-20","episode_number":1,"episode_type":"standard","id":2965870,"name":"The Sinking Anchor","overview":"Turning around a failing restaurant is a daunting challenge under the best of circumstances. Attempting to do it in just two days with only $10,000 may be impossible. But Chef Robert Irvine is ready to take on the challenge. He’ll channel MacGyver and use a lot of muscle to rescue these desperate places from complete collapse. Can one man, in two days, with just $10,000, turn the tide of a failing restaurant and pave the road to a successful future? Find out as Robert Irvine takes on Restaurant: Impossible.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-27","episode_number":2,"episode_type":"standard","id":2980582,"name":"RESPECT","overview":"Robert Irvine visits Mr. B’s Southern Kitchen in Tampa, Fla., and finds two siblings being torn apart by their failing restaurant. Then Robert returns to The Balcony in Larose, La., to see if the changes he made on a previous visit to the family-run restaurant have been maintained.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-03","episode_number":3,"episode_type":"standard","id":3027453,"name":"Floundering Fish House","overview":"Robert Irvine visits Z Fish House in landlocked Loudon, Tenn., where the owner, Ed, needs a life preserver. Robert helps Ed rediscover his passion and lead his staff to success. Then Robert returns to Chattanooga, Tenn., and checks in at Blue Orleans, where the owners' divorce was derailing their restaurant business.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-10","episode_number":4,"episode_type":"standard","id":3027454,"name":"Sub Shop SOS","overview":"Robert Irvine visits Spring Hill, Fla., where Turnpike's Rest Stop is suffering due to a communication breakdown between the owner and her daughter, and their oversized subs are the root of financial troubles. Then Robert returns to Glendora, Calif., to check on T. Phillip's, whose owner struggled with confidence, leadership and crippling debt.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-17","episode_number":5,"episode_type":"standard","id":3027455,"name":"Restoring a Reputation","overview":"At Deraney's Two City Tavern in small-town Barnesville, Ga., owner Christopher is losing his family home, his restaurant and his reputation. Robert Irvine must help him understand his business, change his work ethic and make amends to his staff and community in order to save his restaurant.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-24","episode_number":6,"episode_type":"standard","id":3027456,"name":"A Friendship in Peril","overview":"Robert Irvine has to save more than a restaurant at J's in Waveland, Miss. Owners Louis and Jeff are months from losing everything, including their friendship of 40 years. Robert has to teach them how to run a restaurant and help mend their relationship if they're going to have any chance of saving their business and their lifelong friendship.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-01","episode_number":7,"episode_type":"standard","id":3027458,"name":"Big Trouble in Tennessee","overview":"Big Tom's Backyard Grill and Bar in Cleveland, Tenn., has turned from a dream into a nightmare, and it's costing owners Tom and Sabrina their marriage. With Tom on the brink of another heart attack, Robert Irvine has 48 hours to help him change his ways so he can be the husband and leader that the restaurant needs to survive.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-08","episode_number":8,"episode_type":"standard","id":3027460,"name":"Irish Eyes Are Frowning","overview":"Katie has bitten off more than she can chew at Grille No. 13 in Waldorf, Md. She's $350,000 in debt and has no time to spend with her infant daughter. Robert Irvine must teach Katie to work smarter if he's going to save this Irish pub and help her reclaim her time with her baby.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-15","episode_number":9,"episode_type":"standard","id":3078396,"name":"Soul Food in the Dark","overview":"At Soul Food in the Park in York, Penn., owner Audra makes up for her lack of knowledge and confidence by yelling at her husband. Robert Irvine and his team race the clock to completely renovate her rundown building and help Audra overcome her anger issues to save both her restaurant and her marriage.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-22","episode_number":10,"episode_type":"standard","id":3088887,"name":"The Sinking Ship Inn","overview":"Ship Inn, a fine dining restaurant in Exton, Penn., has veered completely off course and is sinking under the owner Michael's overbearing management style and $895,000 of debt. Robert Irvine has 48 hours to overcome Michael's resistance to change and repair his fractured relationships in order to right the Ship Inn.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-29","episode_number":11,"episode_type":"standard","id":3088922,"name":"Resentment on the Bayou","overview":"Greg and Janice, the married owners of On The Bayou in Milwaukee, Wis., can't stop fighting, and it's destroying their restaurant and relationship, leaving them with nothing but debt and resentment. Robert Irvine must redefine their roles and rekindle their relationship to save their livelihood.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-08-12","episode_number":12,"episode_type":"standard","id":3088923,"name":"The Dutiful Son","overview":"Robert Irvine travels to Milwaukee where owner Abel runs Mexican Village, a Tex-Mex restaurant. Purchased as a gift for his mother and grandfather, it's drowning in debt and destroying his relationship with his children. Robert must help Abel to make some hard choices to save his restaurant and his family.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-08-19","episode_number":13,"episode_type":"standard","id":3088924,"name":"Delusions of Grandeur","overview":"In Orland Park, Ill., brothers Yaser and Nader are close to losing their French bistro, Gaston's. They blame the competition for their restaurant's failures, and Robert Irvine must convince these delusional owners to transform their business and accept reality or their fantasy will end in bankruptcy.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":14,"episode_type":"standard","id":3162944,"name":"Extreme British Makeover","overview":"Moved to Season 20 Episode 01!\n\n----\n\nExpat Lee has lost all hope and is on the brink of losing his restaurant, From Across the Pond, in Colleyville, Texas. In a very personal two-day transformation, Robert Irvine tries to help his fellow countryman realize he's capable of turning around his 15-year-long failure.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":15,"episode_type":"standard","id":3180589,"name":"A Big Mess in Texas","overview":"Moved to Season 20 Episode 02!\n\n----\n\nChef Robert Irvine travels to Joshua, Texas, to save a failing Tex-Mex restaurant. Owners Carmen and Wayne are serving subpar food, and the environment in the restaurant is toxic. To top it off, Carmen and Wayne's relationship is in dire straits, too, so Robert has his hands full cleaning up this Tex-Mex mess and helping turn things around.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":16,"episode_type":"standard","id":3406734,"name":"Big Ego, Big Trouble","overview":"Moved to Season 20 Episode 03!\n\n----\n\nAt Soul Food in the Park in York, Penn., owner Audra makes up for her lack of knowledge and confidence by yelling at her husband; Robert Irvine and his team race to completely renovate her rundown building and help Audra overcome her anger issues.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":17,"episode_type":"standard","id":3406735,"name":"Dirtiest. Kitchen. Ever.","overview":"Moved to Season 20 Episode 04!\n\n----\n\nChef Robert Irvine heads to the Jalisco Cafe in San Diego and tackles one of the filthiest kitchens of his career; with endless obstacles and only 48 hours to turn this restaurant around, the challenge might actually be impossible.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":18,"episode_type":"standard","id":3406736,"name":"Burnt Out in Berkeley","overview":"Moved to Season 20 Episode 05!\n\n----\n\nn Berkeley, Calif., 50-year legacy restaurant KC's BBQ is on the brink of closure; chef Robert Irvine must help the owner regain his self-confidence, treat his daughter like a true partner and accept change in order to save their family restaurant.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":19,"episode_type":"standard","id":3450285,"name":"Virtually Impossible","overview":"Moved to Season 20 Episode 06!\n\n----\n\nChef Robert Irvine travels to Loveland, Colo., to revive a family-run Mexican restaurant. Owners Ritchie and his mother Alma haven't made a dime since they opened six years ago. Ritchie has been running virtual kitchens to make ends meet, but they are failing too. Robert has two days to turn this restaurant's virtual disaster into a successful business or risk closing its doors forever.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":20,"episode_type":"standard","id":3406737,"name":"Slumping Sales in San Jose","overview":"Moved to Season 20 Episode 07!\n\n----\n\nChef Robert Irvine finds The Breakfast Place in San Jose, Calif., struggling to stay open; the co-owners are burnt out and don't have the confidence to lead their staff; Robert must try to save their friendship and business before it's too late.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":21,"episode_type":"standard","id":3443253,"name":"Out with the Old, In with the New","overview":"Moved to Season 20 Episode 08!\n\n----\n\nChef Robert Irvine travels to San Diego to save Kaiserhof, a German restaurant that's stuck in the past. The owner and chef, Peter, is afraid to make changes for fear of disturbing his late father's original design and menu. Robert has to flex some serious muscle to drag Peter into the present and keep this restaurant from going under.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":22,"episode_type":"finale","id":3450289,"name":"Not So Peachy Keen","overview":"Moved to Season 20 Episode 09!\n\n----\n\nWhen Chef Robert Irvine pulls off the highway to visit Denos I-76, a diner in Keenesburg, Colo., he finds the owner, Darlene, abandoned by her employees and working herself into the ground. Robert must help her find staff and inspiration to turn this nondescript truck stop into a must-see destination.","production_code":"","runtime":43,"season_number":19,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 19","overview":"","id":196240,"poster_path":null,"season_number":19,"vote_average":0},"20":{"_id":"61eb1139c669ad007bcac594","air_date":"2021-08-26","episodes":[{"air_date":"2021-08-26","episode_number":1,"episode_type":"standard","id":3460813,"name":"Extreme British Makeover","overview":"Expat Lee has lost all hope and is on the brink of losing his restaurant, From Across the Pond, in Colleyville, Texas. In a very personal two-day transformation, Robert Irvine tries to help his fellow countryman realize he's capable of turning around his 15-year-long failure.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-09-02","episode_number":2,"episode_type":"standard","id":3460817,"name":"A Big Mess in Texas","overview":"Chef Robert Irvine travels to Joshua, Texas, to save a failing Tex-Mex restaurant. Owners Carmen and Wayne are serving subpar food, and the environment in the restaurant is toxic. To top it off, Carmen and Wayne's relationship is in dire straits, too, so Robert has his hands full cleaning up this Tex-Mex mess and helping turn things around.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-30","episode_number":3,"episode_type":"standard","id":3460822,"name":"Big Ego, Big Trouble","overview":"At Soul Food in the Park in York, Penn., owner Audra makes up for her lack of knowledge and confidence by yelling at her husband; Robert Irvine and his team race to completely renovate her rundown building and help Audra overcome her anger issues.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-06","episode_number":4,"episode_type":"standard","id":3460824,"name":"Dirtiest. Kitchen. Ever.","overview":"Chef Robert Irvine heads to the Jalisco Cafe in San Diego and tackles one of the filthiest kitchens of his career; with endless obstacles and only 48 hours to turn this restaurant around, the challenge might actually be impossible.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-13","episode_number":5,"episode_type":"standard","id":3460825,"name":"Burnt Out in Berkeley","overview":"In Berkeley, Calif., 50-year legacy restaurant KC's BBQ is on the brink of closure; chef Robert Irvine must help the owner regain his self-confidence, treat his daughter like a true partner and accept change in order to save their family restaurant.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-20","episode_number":6,"episode_type":"standard","id":3460826,"name":"Virtually Impossible","overview":"Chef Robert Irvine travels to Loveland, Colo., to revive a family-run Mexican restaurant. Owners Ritchie and his mother Alma haven't made a dime since they opened six years ago. Ritchie has been running virtual kitchens to make ends meet, but they are failing too. Robert has two days to turn this restaurant's virtual disaster into a successful business or risk closing its doors forever.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-27","episode_number":7,"episode_type":"standard","id":3460827,"name":"Slumping Sales in San Jose","overview":"Chef Robert Irvine finds The Breakfast Place in San Jose, Calif., struggling to stay open; the co-owners are burnt out and don't have the confidence to lead their staff; Robert must try to save their friendship and business before it's too late.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-02-03","episode_number":8,"episode_type":"standard","id":3460828,"name":"Out with the Old, In with the New","overview":"Chef Robert Irvine travels to San Diego to save Kaiserhof, a German restaurant that's stuck in the past. The owner and chef, Peter, is afraid to make changes for fear of disturbing his late father's original design and menu. Robert has to flex some serious muscle to drag Peter into the present and keep this restaurant from going under.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-02-24","episode_number":9,"episode_type":"standard","id":3480103,"name":"Not So Peachy Keen","overview":"When Chef Robert Irvine pulls off the highway to visit Denos I-76, a diner in Keenesburg, Colo., he finds the owner, Darlene, abandoned by her employees and working herself into the ground. Robert must help her find staff and inspiration to turn this nondescript truck stop into a must-see destination.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-10","episode_number":10,"episode_type":"standard","id":3522905,"name":"Holding on to the Past","overview":"At Rest Haven in Clarksdale, MS, owner Paula's unwillingness to change is destroying her father's Lebanese restaurant and her son's chance of inheriting it; Robert Irvine must teach Paula to trust her son and her staff to save the family's legacy.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-24","episode_number":11,"episode_type":"standard","id":3522906,"name":"It's Not Rocket Science","overview":"Daniel, a former NASA physicist in Huntsville, Ala., thought he could wing it in the restaurant business. His soul food spot, Mizz Juju's, has opened and closed multiple times, never made money and has no equipment. After 10 years of failures, including a broken engagement and spending his parent's entire retirement savings, Daniel needs Chef Robert Irvine's help to save his business, rebuild his life and repay his parents.","production_code":"","runtime":43,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-07","episode_number":12,"episode_type":"standard","id":3608060,"name":"Hard Knocks in Hendersonville","overview":"In Hendersonville, N.C., Chef Robert Irvine meets Ray, an ex-con who has spent decades turning his life around for the sake of his son. But Ray's restaurant, Dreadlife Kitchen, hasn't been so lucky. Facing obstacles ranging from bad decor to no systems to no identity, Robert must help Ray find the courage to transform his business and build his brand to save his restaurant.","production_code":"","runtime":45,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-04-21","episode_number":13,"episode_type":"standard","id":3460829,"name":"No Help Wanted","overview":"In Charlotte, N.C., the owner of 7th Restaurant and Lounge, Don, has beaten all odds since becoming paralyzed after being robbed at gunpoint. As the sole provider for his extended family, Don never asks for help and doesn't want to show any sign of weakness. If Chef Robert Irvine can't convince him that running a restaurant takes a village, Don and his family could lose everything.","production_code":"","runtime":45,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":14,"episode_type":"standard","id":3654486,"name":"The Final Shot","overview":"Chef Robert Irvine heads to Smith's Soul Food Bistro in Gastonia, N.C., where the owner, Cheryl, is an ex-basketball coach on a mission to help kids in her community find their purpose through working at her restaurant. Unfortunately, Cheryl has no idea how to run the place. She's hemorrhaging money, and Smith's is on the verge of closing. Robert must teach Cheryl to run her restaurant with the discipline she learned on the court or risk leaving a lot of kids out in the cold.","production_code":"","runtime":45,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":15,"episode_type":"standard","id":3678435,"name":"Best Friends Forever","overview":"Best friends Renesha and Brandy have no idea how to run their restaurant, Moondoggy's Pizza in Brunswick, Ga., and it's on the brink of collapse. Renesha feels disrespected by the staff and customers while Brandy's failure to lead or communicate is sinking them deeper into debt. With their friendship and restaurant on the line, Robert Irvine must teach them the basics of running a business and how to build a better culture among their staff.","production_code":"","runtime":45,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":16,"episode_type":"standard","id":3729156,"name":"My Way or the Highway","overview":"Chef Robert Irvine travels to Forks and Flavors in Kennesaw, Ga., to meet up with married co-owners David and Darnell. Executive Chef David is struggling to run his kitchen under the shadow of his husband's big personality. It's Darnell's way or the highway, but his constant need to be right is wreaking havoc on the day-to-day operations of the restaurant. Robert must develop and execute a plan to save this restaurant and their relationship.","production_code":"","runtime":45,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":17,"episode_type":"standard","id":3729150,"name":"Family Recipe for Disaster","overview":"Robert Irvine treks to Sylacauga, Ala., to visit Giovanni's Italian Restaurant. Grieving owner Chrissy is struggling to keep her family's restaurant going after the sudden death of her sister. Robert must help Chrissy rediscover her passion if this outdated restaurant is going to survive.","production_code":"","runtime":45,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":18,"episode_type":"standard","id":3678436,"name":"Marriage on the Rocks","overview":"In Stone Mountain, Ga., the failing Sweet Potato Cafe is destroying its owners' finances and their 25-year marriage. Karen feels burnout from carrying most of the responsibilities for the business while Darrell takes a back seat. Robert Irvine must convince Darrell to pull his weight in the cafe and help rekindle Karen's passion in the kitchen or else their business and their relationship may not survive.","production_code":"","runtime":45,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":19,"episode_type":"finale","id":3729163,"name":"Mistrust and Malaise in Madison","overview":"Robert Irvine travels to Madison, Fla., where Grumpy's Diner owner Jessica is struggling to keep the business afloat. She wants to pass the business down to her son, Justin, but he lacks the self-confidence and vision to lead the diner into the future. Robert must get Justin to believe in himself and prove to his mom that he's ready to take over the business, or Grumpy's may not survive.","production_code":"","runtime":45,"season_number":20,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 20","overview":"","id":240964,"poster_path":null,"season_number":20,"vote_average":0},"21":{"_id":"62982db71e9225004f80cb8e","air_date":"2022-04-28","episodes":[{"air_date":"2022-04-28","episode_number":1,"episode_type":"standard","id":3756957,"name":"The Final Shot","overview":"Robert Irvine heads to Smith's Soul Food Bistro in Gastonia, NC, where owner Cheryl is an ex-basketball coach on a mission to help kids in her community. Robert must teach Cheryl to run her restaurant with the same discipline she learned on the court.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-05","episode_number":2,"episode_type":"standard","id":3756962,"name":"Best Friends Forever","overview":"Robert Irvine visits Brunswick, GA, where two best friends have no idea how to run their restaurant, Moondoggy's Pizza. With their friendship and restaurant on the line, he teaches them how to build a better culture among their staff.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-12","episode_number":3,"episode_type":"standard","id":3756963,"name":"My Way or the Highway","overview":"Chef Robert Irvine travels to Forks and Flavors in Kennesaw, GA, to meet up with married co-owners David and Darnell. Executive Chef David struggles to run his kitchen under the shadow of Darnell's big personality and need to be right about everything.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-19","episode_number":4,"episode_type":"standard","id":3756964,"name":"Family Recipe for Disaster","overview":"Robert Irvine treks to Sylacauga, AL, to visit Giovanni's Italian Restaurant. Grieving owner Chrissy is struggling to keep her family's restaurant going after the sudden death of her sister, and Robert must help her rediscover her passion.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-26","episode_number":5,"episode_type":"standard","id":3756965,"name":"Marriage on the Rocks","overview":"In Stone Mountain, GA, Robert Irvine visits the failing Sweet Potato Cafe, which is destroying its owners' finances and their 25-year marriage. He must help them balance responsibilities and rekindle their passion for the business.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-02","episode_number":6,"episode_type":"standard","id":3759002,"name":"Mistrust and Malaise in Madison","overview":"Robert Irvine travels to Madison, Fla., where Grumpy's Diner owner Jessica is struggling to keep the business afloat. She wants to pass the business down to her son, Justin, but he lacks the self-confidence and vision to lead the diner into the future. Robert must get Justin to believe in himself and prove to his mom that he's ready to take over the business, or Grumpy's may not survive.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-09","episode_number":7,"episode_type":"standard","id":3759003,"name":"Fighting for Your Family","overview":"The Barreiros run Amistad Grill in Homestead, Fla., as a family, but the stress within the business is tearing them apart. Owner Omar is a family man, but his trust issues cause him to constantly scold his wife and daughter in the restaurant. Robert Irvine must teach Omar to slow down, listen to his family, and cook with love and care, or their livelihood will be lost.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-16","episode_number":8,"episode_type":"standard","id":3759004,"name":"Schooling a Teacher","overview":"In Granada, Miss., the owner of the failing 333 Restaurant, Allyson, is busy teaching art full-time but still forces the restaurant's manager to contact her before making any decision, big or small. Left without a leader, the chaotic restaurant is just months from shutting its doors. Since Allyson won't give up teaching, Robert Irvine must convince her that trusting and empowering her staff is the only way she can save her restaurant.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-23","episode_number":9,"episode_type":"standard","id":3795918,"name":"Legacy on the Line","overview":"Robert Irvine heads to Shreveport, La., to meet Mavice, the owner of her father's legacy restaurant, Eddie's. The seafood spot is best known for its famous stuffed shrimp, but neither the signature dish nor the restaurant are what they used to be. Mavice's stubborn refusal to adapt is running the food, finances and family into the ground. Robert must convince Mavice to make the changes necessary to save her family's legacy and their livelihood.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-30","episode_number":10,"episode_type":"standard","id":3795919,"name":"Anguish in Abilene","overview":"Robert Irvine travels to Texas Cowboy BBQ in Abilene, Texas, where he meets George and Taylor, co-owners with a marriage and a restaurant on the rocks. Taylor wants to be a bigger part of the restaurant, but George is closed off, angry and unable to accept help. Robert must get George to confront his painful past, open his heart and accept his wife's help in order to save their business and marriage.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-07","episode_number":11,"episode_type":"standard","id":3795938,"name":"A Trifecta of Failure","overview":"Robert Irvine visits Steak-N-Stuff, a family-run restaurant in Cottonwood, Ariz., where co-owners Mark and Susie are struggling to keep the place alive. Mark's son, Blake, wants more responsibility, but Mark is determined to do everything himself, even if it takes a serious toll on his already compromised health. It's up to Robert to unravel the truth behind this failing restaurant and help this family get back on track.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-14","episode_number":12,"episode_type":"standard","id":3834885,"name":"Stuck in the Old School","overview":"Robert Irvine heads to Boulder City, Nev., to help struggling pizza restaurant Vinny's Little Italy. Owner Vinny is stuck in his ways, refuses to listen to his family or staff, and is on the brink of losing everything. Robert must drag Vinny into the 21st century in order to save this restaurant from becoming a thing of the past.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-07-21","episode_number":13,"episode_type":"standard","id":3834886,"name":"Lifting the Weight","overview":"Robert Irvine visits Greg's BBQ, a family restaurant in Belen, N.M., that's run by an ex-Marine who can't stop micromanaging his son who works alongside him. Owner Greg suffers from several health conditions and years of untreated stress, which is hurting the restaurant and putting his life in danger. Robert must teach Greg to trust his son, step back from the kitchen and start valuing his own health, before it kills him.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":14,"episode_type":"finale","id":3838536,"name":"Small Town, Big Problems","overview":"Robert Irvine ventures to a small town in Wyoming, where the owner is struggling to balance his staff, customers and family.","production_code":"","runtime":42,"season_number":21,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 21","overview":"","id":295924,"poster_path":null,"season_number":21,"vote_average":0},"22":{"_id":"63963211d05a0300ae500edc","air_date":"2022-12-29","episodes":[{"air_date":"2022-12-29","episode_number":1,"episode_type":"standard","id":4099774,"name":"A Mother's Guilt","overview":"Robert Irvine heads to Ash Fork, Ariz., where owner Felicia's failing restaurant has forced her to sacrifice her time with her children. Overwhelmed by guilt, she is ignoring her mountain of debt and her deteriorating business. Robert must help Felicia turn her attitude and strategy around to save the restaurant and her family.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-01-05","episode_number":2,"episode_type":"standard","id":4099776,"name":"Living Up to Mom","overview":"Robert Irvine travels to The Amigo Cafe on Arizona's Navajo Reservation, where owner Julene's struggle to turn a profit has taken a toll on her health; Robert helps Julene's daughter, Heather, gain the confidence to step into her mother's shoes.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-01-12","episode_number":3,"episode_type":"standard","id":4099777,"name":"Clueless in Idaho","overview":"Robert Irvine visits Nampa, Idaho, to rescue a Hawaiian restaurant called Island Kine Grinds. Married owners Renus and Ludi are on the edge of both bankruptcy and despair. Renus' health issues have left him physically incapable of helping Ludi, who is overwhelmed managing the restaurant by herself. Robert must help Renus heal his mind, body and spirit or else their marriage and business could fail.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-01-19","episode_number":4,"episode_type":"standard","id":4155800,"name":"Missing Pepper in Baton Rouge","overview":"In Baton Rouge, La., an owner struggles to keep going after losing her husband years ago. Over a quarter-million dollars in debt, Yolanda is letting everything fall apart in her restaurant. Robert Irvine must help her let go in order to save her dying business, but if she can't find the strength to become a motivated owner, she'll lose a lot more than just her restaurant.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-01-26","episode_number":5,"episode_type":"standard","id":4155801,"name":"Roux the Day","overview":"In Baton Rouge, La., owner Maurice claims to be proud of his restaurant, but his lack of leadership and inability to inspire his staff threaten to destroy the business. If Robert Irvine can't teach Maurice how to lead effectively, his restaurant has no chance to survive.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-02-02","episode_number":6,"episode_type":"standard","id":4198118,"name":"Hot Doggin' It in Memphis","overview":"In Memphis, a father's passion project has turned into a nightmare. Owner Tyrone has lost his way, and his family is suffering because of it. Robert Irvine must teach him about more than just the ins and outs of running a restaurant before this family loses their livelihood and their bond.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-02-09","episode_number":7,"episode_type":"standard","id":4198119,"name":"Running on Empty","overview":"Robert Irvine faces a unique challenge in Opelika, Alabama, where he must save a restaurant located at a gas station. Owner Penny's health is failing, and so is her lifelong dream. Unless she makes big changes to more than just the restaurant, she'll lose everything.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-02-16","episode_number":8,"episode_type":"standard","id":4199410,"name":"Fighting for Gigi","overview":"At GiGi's Place in Covington, Georgia, owner Gigi's health is failing, but she can't take a step back with her daughter and her longtime head chef fighting constantly. Everything Gigi worked for is about to fall apart unless Robert Irvine can repair a relationship that may be too far gone.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-02-23","episode_number":9,"episode_type":"standard","id":4199411,"name":"Stalled on the Runway","overview":"In Greenville, South Carolina, an airport cafe hangs in the balance. Owners Lem and Mike believe a nearby playground is the root of their problems, with too many kids driving away their paying customers. If Robert Irvine can't convince them their problems are fixable, this restaurant will be grounded permanently.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-02","episode_number":10,"episode_type":"standard","id":4199412,"name":"Sunnyside Down","overview":"Robert Irvine heads to Williamston, Mich., to resurrect the Sunnyside Café, a little breakfast joint with big problems. Owner Jeanette is an intense micromanager who alienates her staff and refuses to make any changes to the restaurant inside or out. Robert wastes no time addressing the problems and finding solutions to keep this restaurant from going under.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-09","episode_number":11,"episode_type":"standard","id":4240016,"name":"Driven to Tears","overview":"In Coleman, Mich., Robert Irvine finds a failing restaurant that's destroying a loving marriage. Insecure and hypersensitive, owner Leah won't listen to her husband and co-owner Chris' advice, forcing him to step away. Now, with the business spiraling even deeper into debt, Robert must help Leah find her confidence and allow Chris to be a full partner again if they're going to have any chance to save the business and their marriage.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-16","episode_number":12,"episode_type":"standard","id":4240017,"name":"A Family Divided","overview":"In Middletown, N.Y., an unforgivable mistake has driven a wedge between Franco Di Roma's married owners. Franco refuses to change, Karen refuses to show up, their son refuses to work with them and the restaurant is on the brink of collapse. Robert must help them bridge the divide and forgive each other or their restaurant and family might not survive.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-23","episode_number":13,"episode_type":"standard","id":4240018,"name":"The Imbalanced Chef","overview":"At The Balanced Chef in Rome, New York, owner Brian is facing a mountain of problems. His concept is confusing, and he's facing very serious health issues. The stakes are high as Robert Irvine must help Brian figure out a plan to reduce stress personally and professionally.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-30","episode_number":14,"episode_type":"standard","id":4291850,"name":"Mountain Town Mess","overview":"In Lincoln, New Hampshire, Robert Irvine discovers he has more than just a restaurant to repair. The White Mountain Tavern's co-owners have a volatile relationship and toxic standing in the community, giving Robert only two days to fix two massive problems.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-04-06","episode_number":15,"episode_type":"standard","id":4278808,"name":"Trick or Treat","overview":"At the Dutch Treat in Franconia, New Hampshire, Robert Irvine meets John, an owner who has lost the desire to keep his family restaurant going. His wife, Jenn, is more than willing to help, but no matter what she and Robert do, the Dutch Treat doesn't stand a chance without John.","production_code":"","runtime":42,"season_number":22,"show_id":35358,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 22","overview":"","id":319762,"poster_path":null,"season_number":22,"vote_average":0}}}