{"adult":false,"backdrop_path":null,"created_by":[{"id":1188400,"credit_id":"6074493b2a09bc00578d709a","name":"Esben Storm","gender":2,"profile_path":"/ngOjcLhbedqNo8m0Uu6wsrpmPMg.jpg"},{"id":1372113,"credit_id":"60744a08fb8346006f89634f","name":"Adam Bowen","gender":0,"profile_path":null}],"episode_run_time":[25,30],"first_air_date":"2007-06-09","genres":[{"id":35,"name":"Comedy"}],"homepage":"http://www21.sbs.com.au/kick/","id":3552,"in_production":false,"languages":["en"],"last_air_date":"2007-08-18","last_episode_to_air":{"id":254247,"name":"Issie, Ozzie, Oi Oi Oi!","overview":"Miki decides to leave for Europe with Nico as Joe and Jan put their house up for sale. \n\nLayla upsets more people than just her mother, when she faces up to whom she really loves. \n\nHoa has to accept that a small dream is better than no dream, and besides, he has Lien. \n\nHoperoo player, Issi and his dad, are being sent back to Eritrea, so Ozzie agrees to play goalie for the big match. \n\nAlthough Miki has departed, Joe decides he belongs on Hope Street. Halfway to the airport, Miki changes her mind and heads back to the big match into Joe’s arms.","vote_average":0,"vote_count":0,"air_date":"2007-08-18","episode_number":13,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null},"name":"Kick","next_episode_to_air":null,"networks":[{"id":223,"logo_path":"/aQ7chdTN42fz0qtmih3yYnDWp4F.png","name":"SBS","origin_country":"AU"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["AU"],"original_language":"en","original_name":"Kick","overview":"Kick is an Australian television series that was first broadcast on 9 June 2007 on SBS TV. It is set in Brunswick in Melbourne, Australia. The series follows the adventures of wild twenty-something Miki Mavros who is forced to move back in with her Greek-Australian parents on Hope Street after a failed attempt to \"make it big\". Miki begins work as a secretary for suave Anglo-Indian Dr. Joe Mangeshkar, who has a girlfriend named Jan, and things spiral out of control. Miki manages a local neighbourhood soccer team, hence the series title Kick.\n\nThe show also follows the adventures of Miki's neighbours on Hope Street, including the Salim family, a Lebanese-Australian Muslim family with siblings Amen, Osama \"Ozzie\", Taghred and Layla. Amen is an aspiring businessman with questionable ethics. Osama is going through typical teenage angst and has a crush on Taghred's friend Tatiana. Taghred is an aspiring soccer star. Layla is a university student arranged to be married to Sharif, but everything changes when Layla falls for fellow fencer Jackie.\n\nThe first season of the show is available on DVD.","popularity":2.221,"poster_path":"/o7WisN3Q0aRaFpWSmynwnWl5vBG.jpg","production_companies":[{"id":125389,"logo_path":null,"name":"Storm Productions","origin_country":""}],"production_countries":[{"iso_3166_1":"AU","name":"Australia"}],"seasons":[{"air_date":"2007-06-09","episode_count":13,"id":10766,"name":"Season 1","overview":"","poster_path":"/ok6iqZysEJdUegHjXOtqox0IA0N.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":3,"vote_count":2,"season_data":{"1":{"_id":"525752b519c29531db10e26b","air_date":"2007-06-09","episodes":[{"air_date":"2007-06-09","episode_number":1,"episode_type":"standard","id":254237,"name":"Kick Start","overview":"Broke and unemployed, performer Miki takes refuge with her parents, Takis and Dora, on working-class Hope Street. Wannabe entrepreneur, Hoa, is planning a karaoke spectacular. Uni student Layla fences against Jackie and it's love at first sight. Teenagers Tatiana and Taghred try to enlist Ozzie's help in getting to the soccer trials. Finally, after the police visit Miki's house, her no-nonsense mother, Dora, forces Miki to apply for a job as a receptionist with the local GP, conservative, 30-something Joe. Neither Joe nor Miki seriously think Miki can do the job but there's a spark between them and she gets it.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":"/zaBod0KUcfQJRvqUchVhQDhXj7M.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-06-16","episode_number":2,"episode_type":"standard","id":254239,"name":"You Can't Stop The Music","overview":"Miki's receptionist style proves too eccentric for Dr Joe, and he replaces her. She's devastated. Tatiana's prospects at the soccer trials are ruined by Osama's angry reaction to racist taunts. So, with Miki as manager, Tatiana forms her own soccer team - the Hoperoos. Layla reluctantly breaks a date with Jackie. Snatching triumph from the jaws of disaster, Hoa stages his karaoke spectacular in Hope Street park. Layla and Amen perform a dance routine and Tatiana, Taghred and Suong sing but Miki is the headline act. Impressed, Joe decides Miki is the receptionist he needs.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":"/9aBzVHzBPqImRdfrZfMV0biECq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-06-23","episode_number":3,"episode_type":"standard","id":254240,"name":"I Feel A Tingle","overview":"Miki wants to land the part of a hooker in a TV commercial. Plus, she's holding down her receptionist job and organising the Hoperoos. Joe is fed up with Miki's unreliability, and Jan's home renovation obsession and her disinterest in sex its driving him to therapy. Meanwhile, Layla goes deeper into Jackie's world and Ozzie's frustration with his mother is resolved. Tatiana's loyalty to soccer is challenged when she's offered a gig as lead singer of Dead Fish, while Hoa believes he's on to a sure thing with talented young chef, Jana. Finally Miki gets offended by the commercial director's ethnic stereotyping and storms out of her audition.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":"/xC6wL6nm3nNprWTqoAaQnAT4A8P.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-06-30","episode_number":4,"episode_type":"standard","id":254238,"name":"Attitude","overview":"Miki's tirade against the TV director attracts the interest of handsome, suave, Nico. Joe however, unamused by Mikis work attitude, fires her again. Layla is torn between Sharif, her fiancé, and Jackie. Hoas plans to makeover an old-fashioned restaurant are ruined by the drunken Jana but he and Lien end up having an evening out together. Tatiana has doubts about the Dead Fish music but it's ultimately Osama who steers her back to soccer. Nico makes Miki an offer she can't refuse and, undaunted by being fired, she hatches a strategy to re-ingratiate herself with Joe.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":"/d5YnJQKuatIzTgVRlI9MV6D5GuW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-07","episode_number":5,"episode_type":"standard","id":254245,"name":"Get It While You Can","overview":"Anxious to prove to Joe that she has an active sex life, Miki sets up a date with Nico. Joe retaliates by arranging an evening out with Jan. Hoa ignores Lien and Suong's warnings about his business partnership with shifty Amen, and Tatiana rebels when she's undemocratically appointed captain of the Hoperoos. Layla and Jackie are frustrated in their attempts to be alone together, and Ozzie is arrested on an underage driving charge. Miki pretends to Joe that she and Nico enjoyed a night of passion. Joe, whose sex-life with Jan is non-existent, is very jealous. Then Joe is thrilled to discovers what really happened, or didn't happen, between Nico and Miki.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-14","episode_number":6,"episode_type":"standard","id":254243,"name":"Love The One You’re With","overview":"There's big time chemistry between Miki and Ravi - Joes tearaway younger brother. Joe is irked and jealous and refuses to attend a party which Ravi has arranged in the Mangeshkar backyard. Jackie meets the Salim family, and Layla is terrified her cover will be blown. When Hoas plans are appropriated by a crooked businessman, he thinks Amen has betrayed him. Tatiana tries to form a breakaway soccer team but, with Ozzie's help, the Hoperoos are reunited. After the wild party, Joe is certain that Miki and Ravi have had a one-night-stand. Miki isn't telling. She's shocked to find out that Ravi is expecting his sixth child.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-21","episode_number":7,"episode_type":"standard","id":254249,"name":"And the Singer Is…","overview":"Miki has told Joe she has put show biz aspirations behind her. Meanwhile, she has to organise a band for a Hoperoos benefit dance. When the band's singer drops out, Miki panics. Hoa arranges a scratch team of adults to play against the Hoperoos. Everyone puts pressure on Hoa to recruit his newly sworn enemy, Amen. Tatiana faces rebellion within the Hoperoos ranks. Layla and Jackie go away on a fencing weekend, hoping to spend some time together. The Hoperoos are shocked when they lose against the adults, but Miki finally finds a singer for the Hoperoos benefit dance. Everyone (especially Joe) is delighted by her choice.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-28","episode_number":8,"episode_type":"standard","id":254244,"name":"Playing With Fire","overview":"Miki freaks when she realises she's pregnant to Joe's brother, Ravi. Takis and Dora discover that Joe hasn't had sex for six months, so Hope Street unites to ensure that Joe and Jan break the drought. Tatiana's infatuation with Amen affects her soccer; and Hoa is enraged when Lien and Suong poison his new business associate, Stephanie, with too much chilli. Layla accepts Jackie's invitation to go dancing at an all-girl club, and is surprised by who she sees there. After a candle-lit dinner, Nico comes on strong but Miki's growing closer to Joe. Meanwhile, she seems to have a serious dose of morning sickness.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-04","episode_number":9,"episode_type":"standard","id":254242,"name":"Baby, Believe Me!","overview":"Off colour Miki refuses to let Joe examine her, that's too intimate. Dora is delighted when she assumes Nico is the reason for Miki's health problem. Ozzie faces expulsion from school when he stands up to a bullying teacher. Not only is Hoa sued by Stephanie, but Lien and Suong are brought to account for their chilli attack. Sharif shows Layla what could be their dream apartment but an unexpected snag freaks Layla out. Although the Hoperoos lose again, Tatiana scores a personal victory against Amen. Joe finally examines Miki, and they get very close until Jan comes between them again.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-11","episode_number":10,"episode_type":"standard","id":254241,"name":"While The Cat's Away","overview":"After an angry misunderstanding over professional conduct, Miki and Joe become closer than ever. Hoa gets a gig slap-dancing at a Tyrolean restaurant and consoles Lien after she's groped by Amen. Tatiana and Ozzie make a documentary about Hope St.; Get Up, Stand Up - Nico scores Miki a stand-up gig at a trendy club. Layla is shocked when Jackie crashes her engagement party. Ozzie films Tatiana being red-carded for punching the striker of an opposing football team. Hoa lines up a dodgy business deal and recruits Lien's help. Joe's reconciliation with Jan breaks down and he goes to Miki's gig, where he's stunned that much of her schtick is about him. Then he's devastated to see Nico and Miki passionately kiss.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-11","episode_number":11,"episode_type":"standard","id":254248,"name":"Get Up, Stand Up","overview":"Joe is offered his dream job at a city hospital, and Nico offers Miki a gig at a festival in Greece. However, neither Miki nor Joe can commit, due to their unspoken love for each other. After Lien drunkenly jeopardises Hoa\\'s business deal, Lien and Hoa have their first shock kiss. Jackie tells Layla their relationship is pointless, and Ozzie presents evidence which causes the soccer judiciary to clear Tatiana. Joe is shocked when Jan reveals that Miki slept with Ravi; Issi, Ozzie, Oi Oi Oi! - Miki decides to leave for Europe with Nico, as Joe and Jan put their house up for sale. Layla upsets more people than just her mother. Joe decides he belongs on Hope Street. Halfway to the airport, Miki changes her mind.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-18","episode_number":12,"episode_type":"standard","id":254246,"name":"Crunch Time","overview":"Joe is offered his dream job at a city hospital and Nico offers Miki a gig at a festival in Greece. However, neither Miki nor Joe can commit, due to their unspoken love for each other. \n\nAfter Lien drunkenly jeopardises Hoa’s business deal, Lien and Hoa have their first shock kiss. \n\nJackie tells Layla their relationship is pointless and Ozzie presents evidence which causes the soccer judiciary to clear Tatiana. \n\nJoe is shocked when Jan reveals that Miki slept with Ravi. Now Joe and Miki must decide whether their futures will be with or without each other","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-08-18","episode_number":13,"episode_type":"finale","id":254247,"name":"Issie, Ozzie, Oi Oi Oi!","overview":"Miki decides to leave for Europe with Nico as Joe and Jan put their house up for sale. \n\nLayla upsets more people than just her mother, when she faces up to whom she really loves. \n\nHoa has to accept that a small dream is better than no dream, and besides, he has Lien. \n\nHoperoo player, Issi and his dad, are being sent back to Eritrea, so Ozzie agrees to play goalie for the big match. \n\nAlthough Miki has departed, Joe decides he belongs on Hope Street. Halfway to the airport, Miki changes her mind and heads back to the big match into Joe’s arms.","production_code":"","runtime":null,"season_number":1,"show_id":3552,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":10766,"poster_path":"/ok6iqZysEJdUegHjXOtqox0IA0N.jpg","season_number":1,"vote_average":0}}}