{
    "adult": false,
    "backdrop_path": "/9DzYwCwBEFnGQLYp6Q131gInXjz.jpg",
    "created_by": [],
    "episode_run_time": [
        25
    ],
    "first_air_date": "1998-04-07",
    "genres": [
        {
            "id": 16,
            "name": "Animation"
        },
        {
            "id": 10765,
            "name": "Sci-Fi & Fantasy"
        },
        {
            "id": 10759,
            "name": "Action & Adventure"
        }
    ],
    "homepage": "http://ccsakura-official.com/",
    "id": 35790,
    "in_production": false,
    "languages": [
        "ja"
    ],
    "last_air_date": "2018-06-10",
    "last_episode_to_air": {
        "id": 1734092,
        "name": "Sakura's Clear Cards",
        "overview": "Sakura has seen the mysterious robed person in her dreams many times. It turns out Akiho has been having the same dreams herself, and she's grown worried over their unsettling contents.",
        "vote_average": 5,
        "vote_count": 1,
        "air_date": "2018-06-10",
        "episode_number": 22,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 25,
        "season_number": 4,
        "show_id": 35790,
        "still_path": "/pZsUDtjSTmg6nbDDfb4CEwiXaNL.jpg"
    },
    "name": "Cardcaptor Sakura",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 2026,
            "logo_path": "/eMVZPvSxfpFUxzzqzbYIYgE9uJK.png",
            "name": "NHK BS2",
            "origin_country": "JP"
        },
        {
            "id": 2306,
            "logo_path": "/6XY0tlrKcuh2J1oqlBWNtmyjyoH.png",
            "name": "NHK BS Premium",
            "origin_country": "JP"
        }
    ],
    "number_of_episodes": 92,
    "number_of_seasons": 4,
    "origin_country": [
        "JP"
    ],
    "original_language": "ja",
    "original_name": "カードキャプターさくら",
    "overview": "Sakura Kinomoto, an elementary school student who discovers that she possesses magical powers after accidentally freeing a set of magical cards from the book they had been sealed in for years. She is then tasked with retrieving those cards in order to avoid an unknown catastrophe from befalling the world.",
    "popularity": 178.229,
    "poster_path": "/4KWM7glMkjKuYK7WY5VFTZScveN.jpg",
    "production_companies": [
        {
            "id": 3464,
            "logo_path": "/9k0nr75nwnNeT2MHerf1OXJN0hj.png",
            "name": "Madhouse",
            "origin_country": "JP"
        },
        {
            "id": 59118,
            "logo_path": "/9nTCEBgGaaI5swkv8gy2vny0Mb5.png",
            "name": "Kodansha",
            "origin_country": "JP"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "JP",
            "name": "Japan"
        }
    ],
    "seasons": [
        {
            "air_date": "1998-09-25",
            "episode_count": 5,
            "id": 46559,
            "name": "Specials",
            "overview": "",
            "poster_path": "/pFCHDyt9VkgHW79UdxH5ZI6jF5X.jpg",
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "1998-04-07",
            "episode_count": 35,
            "id": 46557,
            "name": "Season 1",
            "overview": "",
            "poster_path": "/dBJF9NRm6cee0i06C1xOdHfXGjd.jpg",
            "season_number": 1,
            "vote_average": 9.5
        },
        {
            "air_date": "1999-04-05",
            "episode_count": 11,
            "id": 46556,
            "name": "Season 2",
            "overview": "",
            "poster_path": "/3mBdXJcIDA98TFFLX0zNWKSdKdq.jpg",
            "season_number": 2,
            "vote_average": 10
        },
        {
            "air_date": "1999-09-07",
            "episode_count": 24,
            "id": 46558,
            "name": "Season 3",
            "overview": "",
            "poster_path": "/ikEhvUGvRNTDiQ1hAO7kCShmkTu.jpg",
            "season_number": 3,
            "vote_average": 10
        },
        {
            "air_date": "2018-01-07",
            "episode_count": 22,
            "id": 96699,
            "name": "Clear Card",
            "overview": "Fourteen-year-old Sakura starts junior high school along her friends, including Syaoran, who had just returned to Tomoeda. After having a dream with a mysterious cloaked figure, all of Sakura's cards turn blank and are rendered powerless, thus she starts her quest to find out what is wrong. In doing so, Sakura and her allies discover and capture new transparent cards using a new key.",
            "poster_path": "/mO0zPqdlhWfvfav7OWORdcCOQCw.jpg",
            "season_number": 4,
            "vote_average": 5.8
        }
    ],
    "spoken_languages": [
        {
            "english_name": "Japanese",
            "iso_639_1": "ja",
            "name": "日本語"
        }
    ],
    "status": "Ended",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 8.6,
    "vote_count": 697,
    "season_data": {
        "1": {
            "_id": "5258e0a9760ee346617ac1e0",
            "air_date": "1998-04-07",
            "episodes": [
                {
                    "air_date": "1998-04-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 810331,
                    "name": "Sakura and the Mysterious Magic Book",
                    "overview": "Sakura Kinomoto awakens from a dream of standing near the Tokyo Tower. She introduces herself, her family, and her friends. After coming home from a normal day at school, Sakura hears a sound coming from the basement. She finds a glowing book and opens it to find a deck of 52 cards. When she accidentally activates the Windy card, the other cards blow out of her house. Cerberus appears from the book and formally appoints Sakura as the \"Cardcaptor\" and gives her the Sealing Wand. Sakura captures the Fly Card, but she adamantly insists she does not want the job. All the same, she shows quick thinking, considerable magical power, and sheer joy on her first ride on the tamed Fly",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/pZ0eFsHPia5sgebM0RZTVdqLwbc.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "63a2816f51f99a008959d1ea",
                            "adult": false,
                            "gender": 2,
                            "id": 3331938,
                            "known_for_department": "Visual Effects",
                            "name": "Kazunori Shibata",
                            "original_name": "柴田和紀",
                            "popularity": 2.303,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-04-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 810333,
                    "name": "Sakura's Wonderful Friend",
                    "overview": "Tomoyo meets Cerberus after she discovers Sakura's secret and gets a full explanation of the lost Clow Cards and Sakura's designation as Cardcaptor. Cerberus gets given the nickname \"Kero-chan\" that will stick for the rest of the series. The next day, the students find the school's desks and equipment in large piles. Kero believes it was the work of the card and forces Sakura to go to school at night where she confronts The Shadow. Using the Windy card's binding ability, Sakura is able to capture the Shadow card. Sakura finally accepts her role as a Cardcaptor because of Tomoyo's support.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/rfEJLEVQQvazVXEh3yZ4Da0hkJ5.jpg",
                    "vote_average": 10,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-04-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 810335,
                    "name": "Sakura's Heart-throbbing First Date",
                    "overview": "Sakura's class is on a field trip to the aquarium. During the penguin show, something catches the trainer's leg and a penguin and pulls them into the water, but they are saved by Sakura's brother, Toya, who is working part-time there. At school, Tomoyo gives Sakura and Cerberus mobile phones and on the way home, Sakura bumps into Yukito who invites her on a casual \"date\" which is at a cafe where Yukito knew Toya was working. While they are eating, The Watery breaks the glass of the aquarium causing a flood. For the first time Sakura has to formulate a plan to capture a card, rather than jumping into battle and attacking with Windy. Using her wits and an unintentional clue from Yukito, she lures Watery into a freezer to immobilizes and capture it.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/uDTxZcFm5S5DZYSrC2RkjK1W3Zx.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-04-28",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 810338,
                    "name": "Sakura's Exhausting Sunday",
                    "overview": "While cleaning the house, Sakura finds two dormant Clow Cards, The Wood and The Rain. But while running an errand for her father, the two cards activate creating a jungle inside the house. Sakura uses The Watery to capture The Rain card and The Wood yields on her own. Sakura gets the hard-earned lesson that a card is not fully subdued until she signs her name on it.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/5bpAUUJvdt8qCoDK4nbuPtPwx6r.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "63a2816f51f99a008959d1ea",
                            "adult": false,
                            "gender": 2,
                            "id": 3331938,
                            "known_for_department": "Visual Effects",
                            "name": "Kazunori Shibata",
                            "original_name": "柴田和紀",
                            "popularity": 2.303,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-05-05",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 810339,
                    "name": "Sakura and the Panda and the Cute Store",
                    "overview": "On the way to school, Sakura meets Maki Matsumoto who is opening a stuffed doll shop called Twin Bells. Sakura and her friends visit the shop after school to find most of the merchandise unpacked, so they offer to help. Chiharu Mihara, who has a fondness for stuffed animals, buys a stuffed panda, but it disappears shortly after taking it home. Sakura discovers the panda back in Twin Bells and Maki explain the reason for opening the shop and her business has been plagued by mysterious happenings that almost forced her to close down. While Tomoyo distracts Maki in the back, Sakura and Kero search the shop to find The Jump, which escapes with all the stuffed dolls in the shop. At Penguin Park, The Jump grows into a giant by absorbing the stuffed dolls, but it knocks itself out after it trips and falls allowing Sakura to capture it.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/jBnSOxolJTuGehVvlsQiSD9S9h3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "636eb48c9bcd0f00763e3c22",
                            "adult": false,
                            "gender": 2,
                            "id": 1842766,
                            "known_for_department": "Visual Effects",
                            "name": "Minoru Murao",
                            "original_name": "Minoru Murao",
                            "popularity": 1.88,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-05-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 810341,
                    "name": "Sakura and Her Mother's Memory",
                    "overview": "Naoko tells everyone a scary story about a bright light she chased into the woods. After school, Sakura and her friends visit the woods to see the light Naoko saw. When they do see it, everyone runs in fear, claiming they saw something appearing from the light, but everyone saw something different. Sakura returns at night in case it was a card despite her fear of ghosts. After following it near a cliff, the light takes the form of Sakura's deceased mother, Nadeshiko. Sakura, who is delighted to see her mother, walks towards it and off the cliff, but she is saved by an unknown entity and safely lowered into Yukito arms who is passing by. Sakura returns to the cliff a few days later and once again walks off the cliff. She realizes that it couldn't be her mother and discovers it to be really The Illusion.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/rqS1bRSngLhuHTjeNpFsfGKMpQy.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-05-19",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 810310,
                    "name": "Sakura's First Challenge as a Thief!?",
                    "overview": "At an art museum trip, Sakura witnesses a boy attempting to change a painting. During the commotion, she couldn't hear anything and Kero is sure that it was caused by a Clow Card, The Silent. Sakura sneaks out of the house at night and into the museum where they meet the boy from earlier also sneaking in. The boy, Yūki Tachibana, explains the painting is by his deceased father and his mission to restore the painting which a Clow Card has covered up. Every time Sakura attempts to capture the card, it transports the group outside. Using The Shadow, Sakura is able to silently capture Silent from a distance restoring the painting and discovering Yūki is actually a girl. A stranger, dressed in an odd costume, appears at the end of the episode and quietly mutters that he senses a Clow Card.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/uXBSXxZcQ8RnAM69jUEQwEG6sbY.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-06-02",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 810311,
                    "name": "Sakura's Rival Appears!",
                    "overview": "Sakura has the same recurring dream she had in episode one, specifically focusing on the boy wielding a sword in Chinese clothing. She hears from both Cerberus and Yukito that it might be a \"foretelling dream\". A new transfer student arrives from Hong Kong named Syaoran Li and is seated behind Sakura. He terrifies Sakura with his glares all day and during recess, he demands Sakura to give him the Clow Cards. On the way home, there is a lighting storm, but no rain. Cerberus explains Syaoran is from the Li clan, a famous family of Chinese sorcerers from which Clow's mother came. The same lighting storm for earlier appears and Sakura deploys to battle the Thunder card. Syaoran demonstrates his command over elemental magic and calls on thunder god to return the Thunder card to its original form. He instruct Sakura to use the Shadow card to encage the Thunder card so it could be captured. Thanks to Syaoran's constant derogatory remarks, Sakura is left feeling upset after a card capture for the first time.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/6h8T5vzwR1cW3mZa4LlNLVizwRX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-06-09",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 810312,
                    "name": "Sakura and the Mysterious Broach",
                    "overview": "Sakura, usually cheerful, is forlorn by Syaoran's confidence and obviously superior skill. Rika and Tomoyo take Sakura to a shop to try to cheer her up. The three each buy brooches and return to Sakura's house for tea and pudding. When Rika puts on her brooch, The Sword takes control of her and attacks Sakura with a sword. Syaoran saves Sakura who refuses to attack Rika and stops him from attacking her as well. Using Illision to distract Rika, Sakura is given the chance to capture Sword. The next day, Syaoran is dismayed when he sees Sakura offer a gift of chocolate to Yukito, and quickly gives sweets of his own. Tomoyo has to explain to Sakura that Syaoran is \"interested\" in Yukito just like Sakura is.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/Abt8I24yI6kExS7b8lZZch5TwTU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "636eb48c9bcd0f00763e3c22",
                            "adult": false,
                            "gender": 2,
                            "id": 1842766,
                            "known_for_department": "Visual Effects",
                            "name": "Minoru Murao",
                            "original_name": "Minoru Murao",
                            "popularity": 1.88,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-06-16",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 810313,
                    "name": "Sakura and the Flowery Athletics Meet",
                    "overview": "It's Sports Day at Sakura's school so family members has come to cheer the students on. Sakura meets Tomoyo's mother, Sonomi Daidōji for the first time. When Sonomi and Sakura's father, Fujitaka, meet, both are shocked. From their conversation, it is revealed that Sonomi is a cousin to Sakura's mother and she blames Fujitaka for her death, though not in any direct way. While Sonomi and Fujitaka race in the parent's race, there is a shower of flower petals. Sakura suspects a Clow Card and finds The Flower on the roof of the school.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/tSvIpePOf1qp68kWcGf9gG7ESOl.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-06-23",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 810314,
                    "name": "Sakura, Tomoyo and the Big House",
                    "overview": "Sakura is invited to Tomoyo's home for the first time. She is shocked to find Tomoyo's house to be an elaborate mansion with maids. Sonomi rushes over when she hears of Sakura's visit and shares the memories of Nadeshiko with Sakura over tea. While Sonomi is taking care of business over the phone, Tomoyo presents a special box and explains the key to the box bounces out whenever she tries to open it and Kero senses it's the work of a Clow Card. Sakura uses the Sword card to slice away the protective barrier of the Shield card and captures it. Inside the box is a dried bouquet of cherry blossoms from Sakura's mother's wedding and the first present Sakura ever gave Tomoyo, an eraser shaped like a bunny.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/nQezFfSKPDAdydClgZ6YPBgZPDZ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-06-30",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 810315,
                    "name": "Sakura's Endless Day",
                    "overview": "Sakura and Kero encounter some problems with time as Sakura, Kero and Syaroan find that they are the only ones who realize that Time is starting the same day over and over and over again. It's time for Sakura to take action and capture this time-meddling Clow Card!",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/ApA5UvA2QfrWrMPkU2UaNRCLMbd.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "636eb48c9bcd0f00763e3c22",
                            "adult": false,
                            "gender": 2,
                            "id": 1842766,
                            "known_for_department": "Visual Effects",
                            "name": "Minoru Murao",
                            "original_name": "Minoru Murao",
                            "popularity": 1.88,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-07-07",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 810316,
                    "name": "Sakura and the Elephant's Strength Contest",
                    "overview": "Sakura's class is visiting the zoo for a field trip and her group is assigned to observe the elephants. Near noon, something begins to break open the cages causing chaos among the visitors and Kero is positive it's a Clow Card. The Power card, although invisible, begins to torment the elephants and Sakura steps in to save them by challenging it to a game of tug-of-war. Sakura is no match for the Power card even with the help of the elephants. Just as Sakura is about to lose, Syaoran uses the Time card to stop time to help her win the battle, thus tricking Power into surrendering.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/1qxHHHxnkBLTfRmsq8JWE3RmFHU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-07-14",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 810317,
                    "name": "Sakura, Touya and Cinderella",
                    "overview": "Sakura is invited to the high school culture festival. She meets Tomoyo and Syaoran there and catches a play by Yukito and Toya's class. During the play, a mist forms outside the auditorium and enters through the vents where it destroys the stage and puts Toyo and a girl named Yoko in danger. Sakura and Syaoran head towards the lighting room where Sakura summons the Shadow card to capture the Mist card and Syaoran summons the wind to save the falling Toya and Yoko.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/ltrFAV20ySHHi6HO5ZDr0DeBvp6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-07-21",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 810318,
                    "name": "Sakura and Kero's Big Fight",
                    "overview": "Syaoran captures his second Clow Card after defeating the Storm card. Tension develops between Kero and Sakura over the Syaoran issue which builds into a fight the next day after Kero makes a mess after building a room inside Sakura's desk drawer. While Sakura is at school, Kero eats liquor-filled chocolate and wanders out the window drunk. The next day, he finds himself with a young girl named Akane who lives alone with her mother. Unable to escape, Kero secretly contacts the worried Sakura by fax. Akane wishes she could fly to see her father in heaven and the Float card makes her dreams come true. Sakura comes to her rescue and brings Kero back home. As a way of making amends, Sakura redesigns her bottom desk drawer to become Cerberus's bedroom from now on.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/9zVk4yDhCowWMK1iSkHfjLPypB1.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-08-04",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 810319,
                    "name": "Sakura and the Rainbow of Memories",
                    "overview": "Sakura's family and Yukito takes a vacation to the country side. Sakura meets the old owner of a country mansion near their rented cottage. He invites her over for tea, tennis, and they become good friends. He shows her the room of his granddaughter, now deceased, and gives Sakura clothes that once belonged to her. The next day, Fujitaka gives Sakura cookies to give to the old man. When she brings them out to eat, the old man asks her about her father. On the last day of her vacation, Sakura asks the old man to stand in the balcony of his granddaughter's room. From a distance, Sakura uses the Rain card to give the old man a rainbow as a goodbye gift. Sonomi comes out of hiding to speak with the old man to reveal the old man is the grandfather of both Sonomi and Nadeshiko, and Sakura's great grandfather.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/pJLO33rCyhruOkNpao2vdwwPVTG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "636eb48c9bcd0f00763e3c22",
                            "adult": false,
                            "gender": 2,
                            "id": 1842766,
                            "known_for_department": "Visual Effects",
                            "name": "Minoru Murao",
                            "original_name": "Minoru Murao",
                            "popularity": 1.88,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-08-11",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 810320,
                    "name": "Sakura's Scary Courage Test",
                    "overview": "Sakura and her class is on a trip to the beach for a few days. On the first night, Naoko tells one of her scary story causing Sakura to flee to the teacher's lodging, but she is found by Syaoran who senses something in a cave nearby. Together at the beach, the two have their first civil conversation where Syaoran tells Sakura about Wei, a person he lives with. A test of courage is held the next night where the students must enter the cave and place a candle next to the shrine inside. But once inside, Sakura's friends begin to disappear. Syaoran, the only one left, forbids Sakura from panicking and walks her through the process of capturing the Erase card even while he's starting to fade away. Syaoran refuses the card after Sakura offers to give it to him.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/wvfQBt9mBnym7KyQUHBJkaGUICp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-08-18",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 810321,
                    "name": "Sakura, Yukito and the Summer Festival",
                    "overview": "Sakura visits a festival with Tomoyo, Yukito, and Toya. After meeting Chiharu and Takashi, Sakura and Yukito wander away from the group where they find glowing lights falling from a tree like snow at the back of the shine — just like a dream Sakura envisioned the night before. Just as Sakura is about tell Yukito something, she is interrupted by their friends. When everyone leaves for snow cones, Sakura captures The Glow.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/zrwnTIlxlsLFo6bXKOihdWO3gbZ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "66047d78c5840d0184c3e260",
                            "adult": false,
                            "gender": 2,
                            "id": 2498463,
                            "known_for_department": "Visual Effects",
                            "name": "Masaharu Tada",
                            "original_name": "多田雅治",
                            "popularity": 1.775,
                            "profile_path": null
                        },
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "66047dafaafebd016316f810",
                            "adult": false,
                            "gender": 2,
                            "id": 1705554,
                            "known_for_department": "Visual Effects",
                            "name": "Motoaki Satou",
                            "original_name": "Motoaki Satou",
                            "popularity": 1.555,
                            "profile_path": null
                        },
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "66047de0fcec2e0186c3e18b",
                            "adult": false,
                            "gender": 2,
                            "id": 107566,
                            "known_for_department": "Directing",
                            "name": "Yuzo Sato",
                            "original_name": "佐藤雄三",
                            "popularity": 8.356,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-09-01",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 810322,
                    "name": "Sakura and the Summer Vacation Homework",
                    "overview": "The summer holidays are coming to an end and Sakura still has a lot of summer vacation homework to do. Making a deal with her brother and Kero to help her, Sakura is left with only a book report and meets with Tomoyo at the library. There, they meet Syaoran who refuses to share a library cubicle with them because his fortune predicted bad luck with women. The book Sakura needs for her book report is missing so Sakura and Tomoyo search the library, but notice the book disappearing and reappearing in different places. The book eventually appears outside the library where they meet Syaoran who is also after the book. Kero reveals it’s the work of the Move card and for the first time, thanks to Move's unpredictable actions, Sakura is forced to rely solely upon her magical senses to catch a card. Sakura is rewarded with the book and a new card, but accidentally plunges into the river, taking Syaoran with her. Syaoran invites the girls over to his place so Sakura can change into dry clothes, but to everybody’s surprise, a Chinese girl enters the apartment and leaps on Syaoran with a hug.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/g78254wJSslBzTCROqORmeMD0gB.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "636eb48c9bcd0f00763e3c22",
                            "adult": false,
                            "gender": 2,
                            "id": 1842766,
                            "known_for_department": "Visual Effects",
                            "name": "Minoru Murao",
                            "original_name": "Minoru Murao",
                            "popularity": 1.88,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-09-08",
                    "episode_number": 20,
                    "episode_type": "standard",
                    "id": 810323,
                    "name": "Sakura and the Fighting Exchange Student",
                    "overview": "When Syaoran enters the room, he's markedly pale and haggard compared to his usual tough-and-healthy look. When Meiling enters the room, it's clear that her presence has exhausted him and he is desperate to escape it. Mr. Terada explains that she is from Hong Kong and cousin to Syaoran. Meiling is quick to add that she is actually his fiancee, and obviously believes Sakura wants to take Syaoran away from her. Syaoran asks Meiling why she came, and she answers that she was lonely for him. He explains that he's not going back until he gets the Clow Cards, but she doesn't particularly care about that. She reminds him that a fortune-teller in Hong Kong predicted someone else would get them, a reminder that clearly grates on his nerves. It's only after he makes it clear he won't return home without the Cards that Meiling decides she will get involved and 'help', so that he can collect them faster.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/6wTTNqnReZ1OC5ssk8yoZxb0k38.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-09-16",
                    "episode_number": 21,
                    "episode_type": "standard",
                    "id": 810324,
                    "name": "Sakura's Long Marathon",
                    "overview": "During a school race, Meiling is determined to win with Syaoran, in their usual \"One-Two Finish\" they were known for in their previous school. During the race, both Syaoran and Sakura take off at top speed after seeing that Yukito is watching. As the run, the Loop card causes traps Sakura and Syaoran, causing them to run in circles. After they realize what has happened, Sakura is able to use the Sword card to cut the loop. Syaoran carries Meiling, who hurt her ankle, the rest of the way to the finish line, joined by Sakura.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/cH5Uli3OF05q50eavC0FoSp44D0.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "636eb48c9bcd0f00763e3c22",
                            "adult": false,
                            "gender": 2,
                            "id": 1842766,
                            "known_for_department": "Visual Effects",
                            "name": "Minoru Murao",
                            "original_name": "Minoru Murao",
                            "popularity": 1.88,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-09-23",
                    "episode_number": 22,
                    "episode_type": "standard",
                    "id": 810345,
                    "name": "Sakura and Her Kind Father",
                    "overview": "Sakura's father has an important presentation to complete so Sakura and her brother decide to help by taking on all the chores around the house. Sakura decides to do more and brings a snack for her father at the university. While she is there, the Sleep card shows up and starts to make all the students and professors fall asleep. Sakura manages to capture the card with the help of Windy, however her father's laptop is ruined in the process. Although her father forgives her, Sakura still feels guilty so her father deicides to make her his personal assistant and they eventually get the presentation finished.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/bFV5iCnItHJoBX95pf9Ix2o4Bih.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "64b6aa95e0ca7f01442bccd6",
                            "adult": false,
                            "gender": 1,
                            "id": 1540497,
                            "known_for_department": "Visual Effects",
                            "name": "Kumiko Horikoshi",
                            "original_name": "堀越久美子",
                            "popularity": 3.466,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-09-30",
                    "episode_number": 23,
                    "episode_type": "standard",
                    "id": 810325,
                    "name": "Sakura, Tomoyo and the Wonderful Song",
                    "overview": "When a rumor starts that a voice is heard in the elementary school music classroom, everyone assumes that it is a ghost singing (much to Sakura's dismay). That evening, Toya comes home with Yukito for a sleepover, much to Sakura's liking. When they arrive home Sakura asks Yukito for tea, and Toya asks, too. When they sit down and talk about the ghost, much to Sakura's dismay yet again, Toya starts on about some of the students hearing the voice some time at ten o'clock in the night. Sakura gets frightened, but then Yukito adds that he heard that the voice was really wonderful, so Sakura decides that she will check it out in case of a Clow Card and to record it. When they get there Sakura is obviously frightened. Then she gets a surprise from Syaoran and Meilin. Suddenly, they hear a voice coming from the music room. They decide to check it out. When they arrive at the music room. Meilin suddenly leaps up and opens the door to the room making the Clow Card disappear. Although Sakura recognizes the song and remembers that it is the song Tomoyo sang to her and will be doing the song for the chorus. They hear it yet again and follow it to the stairs. During the chase, Syaoran and Kero tell the rest that the Clow Card is the Song card.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/q4Q0UASxHGBDfgYEJZVtLmtbuES.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-10-06",
                    "episode_number": 24,
                    "episode_type": "standard",
                    "id": 810326,
                    "name": "Sakura's Mini Great Adventure",
                    "overview": "When Tomoyo comes over to measure Sakura for a new outfit, Sakura comes in contact with the Little card, which shrinks her and her magic. While Tomoyo and Kero search for her, Sakura winds up in the backyard, being chased by a cat and a praying mantis. When Toya and Yukito come home, Tomoyo hides Kero while Sakura confronts the Little card, but it runs away from her. Eventually, Sakura chases the card into the kitchen, where it almost shrinks Toya, but it bounces away. The card bounces up the stairs, and Sakura gives up because it was not possible to continue. Luckily, she was then found by Kero, who explained the Little card to her. Meanwhile, Tomoyo is in Sakura's room when she hears the Little card. She is about to touch it when Sakura comes riding on Kero and runs into the Little card, thus returning to her normal size. She then seals the Little card. Later, Sakura, Tomoyo, Toya, and Yukito are enjoying Tomoyo's strawberry tart that she brought, when Sakura remembers that she promised Kero a piece. In the end, Sakura manages to get him a tiny slice. He whines and then uses the Little card to make himself tiny and eat the now huge slice of cake.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/7vJx2vkgzSoQvuoskwc7TOJlwpj.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-10-13",
                    "episode_number": 25,
                    "episode_type": "standard",
                    "id": 810327,
                    "name": "Sakura and Another Sakura",
                    "overview": "On her way home Sakura bumps into a woman in the street. After arriving at school the next day, Sakura discovers that her math teacher will be on extended vacation and the replacement is the woman she bumped into the day before, Ms Mizuki. During the lunch break Syaoran reveils to Sakura and Tomoyo that the substitute has a strong magical presence and that they should be careful around her. When school finishes Sakura and Tomoyo go to a shrine to pick up a romance charm. Upon arriving Sakura feels a presence. While at the Shrine they also see Meilin and Syaoran. After a brief conversation they are all transported into a labyrinth, it is soon discovered that this is the work of the Maze card. A number of escape attempts using the Fly and Sword cards are foiled. The Maze then starts to change shape and Meilin is separated from the others. While searching for Meilin, they find her with Ms Mizuki and they soon escape the labyrinth with Ms Mizuki's help. The Clow Card is then captured, however it goes to Ms Mizuki who promptly goes on to give it to Sakura.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/l2bjKCSFeS7hXhVxBn3vHhqMwpD.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "636eb48c9bcd0f00763e3c22",
                            "adult": false,
                            "gender": 2,
                            "id": 1842766,
                            "known_for_department": "Visual Effects",
                            "name": "Minoru Murao",
                            "original_name": "Minoru Murao",
                            "popularity": 1.88,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-10-20",
                    "episode_number": 26,
                    "episode_type": "standard",
                    "id": 810328,
                    "name": "Sakura and the Wonderful Teacher",
                    "overview": "On her way home Sakura bumps into a woman in the street. After arriving at school the next day, Sakura discovers that her math teacher will be on extended vacation and the replacement is the woman she bumped into the day before, Ms Mizuki. During the lunch break Syaoran reveils to Sakura and Tomoyo that the substitute has a strong magical presence and that they should be careful around her. When school finishes Sakura and Tomoyo go to a shrine to pick up a romance charm. Upon arriving Sakura feels a presence. While at the Shrine they also see Meilin and Syaoran. After a brief conversation they are all transported into a labyrinth, it is soon discovered that this is the work of the Maze card. A number of escape attempts using the Fly and Sword cards are foiled. The Maze then starts to change shape and Meilin is separated from the others. While searching for Meilin, they find her with Ms Mizuki and they soon escape the labyrinth with Ms Mizuki's help. The Clow Card is then captured, however it goes to Ms Mizuki who promptly goes on to give it to Sakura.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/5YMr5jzMdCE8I0csBHNQBXuG6Pq.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-10-27",
                    "episode_number": 27,
                    "episode_type": "standard",
                    "id": 810329,
                    "name": "Sakura and the Shrine of Memories",
                    "overview": "After waking up early, Sakura goes for a skate and remembers the dream she had the night before about a mysterious figure standing on the Tokyo tower. She soon ends up at the shrine were the Maze card was captured and meets Ms Mizuki. Sakura and Yukito go on to help Ms Mizuki clean the shrine. After school, Sakura and her father are together and it is revealed that Toya know Ms Mizuki when she was an assistant teacher while Toya was in Junior High. Kero is soon alerted to a strong presence coming from the shrine. While at the shrine they meet up with Syaoran who is also looking for the card. Kero soon slopes off to get drinks and Syaoran and Sakura are left to talk. Syaoran once again warns Sakura of how dangerous Ms Mizuki can be and they both admit their love for Yukito. Syaoran is so embarrassed that he runs off in distress and Sakura is swallowed by a dark shadow. It is soon revealed that it is the work of the Return card and that she has gone back in time. While in the past Sakura see a number of scenes involving her brother and Ms Mizuki and you find out that both appear to love each other, but she tells him to not linger in the past and look forward, since she has to go to England but, when she returns, Touya will have a new love in his life and both she and Toya will be best friends. Sakura is soon returned to the present with the help of Syaoran and the Time card and Sakura captures the Return card and it then goes to Syaoran.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/vdF1YfcT0kmK2EtWGPscRo6guEa.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-11-03",
                    "episode_number": 28,
                    "episode_type": "standard",
                    "id": 810330,
                    "name": "Sakura and the Incantation Cards",
                    "overview": "One of Sakura's friends makes a jump and passes a P.E. test. But she and her other friends all think it was because she made a wish on the \"Jump\" card. Sakura becomes worried and asks to see she is relieved to see that it is not the real Jump card, and she still asks where they got them. They tell them at Twin Bells. Both her and Tomoyo go to check it out. They see Maelin there. After seeing that one card is missing they ask who bought it and what it was. when they discover that it is a real Clow card they go looking for whoever bought it. After running into Syaoran, he and Sakura find Meiling. She refuses at first to give the card back, but when she releases the Shot card's power accidentally and Syaoran is hurt, Sakura comes up with a plan to capture it and does so.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/5CNO3vcmawEcEFfFIhaHGuNmJ2n.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-11-10",
                    "episode_number": 29,
                    "episode_type": "standard",
                    "id": 810332,
                    "name": "Sakura's Sweet Cooking",
                    "overview": "Sakura practices in the kitchen with her father for an upcoming home-economics class, as Sakura is worried about how she will do. Sakura's classmates decide which cakes they will bake. The following day, everyone begins making their various cakes, but after leaving them to bake over lunch, they come back to find them to be far too sweet. The next day, everyone starts over and make sure they measure the ingredients correctly. Sakura and Syaoran sense a Clow Card, and afterwards everyone except them exits the classroom. They discover it to be the Sweet card, which flies around the room turning everything into sweets and confections. Sakura captures the card after throwing salt on it to temporarily immobilize it, which causes the room to revert back to normal. After everyone comes back, and the cakes have turned out great, except for Meilin's, who made hers too hard.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/j0RIZpcij3d1j1i0lme0HrEUWYt.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-11-17",
                    "episode_number": 30,
                    "episode_type": "standard",
                    "id": 810334,
                    "name": "Sakura and the Injured Card",
                    "overview": "When an attempt at capturing the Dash card doesn't go so well, Sakura's upperclassman Rei, a girl from the track club, finds it and takes it home. After the Dash enchants Rei to become faster as thanks for her kindness, Sakura has a hard time capturing because she feels bad, but Syaoran doesn't and one day he finds and lures it to the woods. After Kero and Syaoran tell her that it'd be worse if Rei won her races through \"cheating\", Sakura then captures it. But it goes to Syaoran, since he weakened it. During an upcoming tournament, Rei is sad upon the loss of her friend, but Syaoran casts an illusion of the Dash card at the race fields; encouraged, Rei wins without the power of magic.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/7x3wiFZ9faC1LplqRlVpAHuem29.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-11-24",
                    "episode_number": 31,
                    "episode_type": "standard",
                    "id": 810336,
                    "name": "Sakura and the Nameless Book",
                    "overview": "Naoko, Sakura's classmate and friend, goes to a bookstore and buys a mysterious book which has no title and the things she writes in it comes to life. Sakura catches the card which appears to be the Create card by using the newly captured Big to enlarge her size and seal the dragon she encountered away.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/8RlE4GWJtIeQnVUxJr4KGSP1BRx.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-12-01",
                    "episode_number": 32,
                    "episode_type": "standard",
                    "id": 810337,
                    "name": "Sakura, Kero, Shaoran and ...",
                    "overview": "During an attempted card capture, Kero and Syaoran were holding down a card (CHANGE) that took form of an animal. Sakura turned it back into a card, but because they were both touching the card at the same time, Kero and Syaoran swapped bodies. Kero tried to make it though a day as Syaoran without anyone noticing, but didn't do very well. At the end they finally change back when Sakura used the CHANGE card.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/uJBEkSlCwQ9ApWGByt5OGh9dN0Q.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-12-15",
                    "episode_number": 33,
                    "episode_type": "standard",
                    "id": 810340,
                    "name": "Sakura's Cold Ice Skating",
                    "overview": "Sakura’s fourth grade class takes a trip to the town’s ice skating rink. At the ice skating rink, the students begin to feel low, freezing temperatures due to the Freeze card. Eventually, the Freeze card beings to freeze everyone by covering them with ice, except those with magical powers, which include Sakura, Syaoran, and Ms. McKenzie, who was hiding near the back of the rink during Freeze’s appearance. With the help of Syaoran’s distractions, Sakura is able to capture the Freeze card into a clow card and ultimately, Syaoran became the master of the Freeze card due to his idea of getting Freeze to appear out of the ice rink.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/hUJb58xiHyPBtPWVcspJxRYujpp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-12-22",
                    "episode_number": 34,
                    "episode_type": "standard",
                    "id": 810342,
                    "name": "Sakura and Yukito and the Daytime Moon",
                    "overview": "Sakura and Yukito participate as a two people team in the quiz tournament. As they get to the 10th question which is the last, Ms. Mizuki warns them about the full moon tonight. They go in the forest and then suddenly Sakura becomes dazed and begins to fall off the cliff. Yukito dashes to Sakura and covers her while his leg becomes injured.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/e5q8gX4MnPEGNgbTXOHHsMSlTql.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1998-12-29",
                    "episode_number": 35,
                    "episode_type": "finale",
                    "id": 810346,
                    "name": "Sakura's Wonderful Christmas",
                    "overview": "Christmas is coming, which is also Yukito's birthday, but Sakura is unsure what to get him. She asks Meilin for advise who tells her it can anything because if the person likes her they will like the gift. Sakura asks Yukito to go to the amusement park with her, using tickets given to her by Chiharu. Tomoyo and Kero follow them to film Sakura's \"date\". Sakura and Yukito run into Syaoran and Meilin. While they are at a cafe, the Firey card appears. Syaoran uses the Time card, giving Sakura time to use Sleep and put everyone at the park asleep. She then tries to capture Firey using Windy, but Firey is a strong attack card and Windy is unable to defeat it. Sakura has to use two elemental cards, Watery and Windy, together in order to capture Firey. With Firey captured, Kero regains a small amount of his power, enabling him to make small fires. Sakura gives Yukito his Christmas present: a doll of himself.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 1,
                    "show_id": 35790,
                    "still_path": "/kHTWh0dYxtjtjiQCtkC69UANzjy.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 46557,
            "poster_path": "/dBJF9NRm6cee0i06C1xOdHfXGjd.jpg",
            "season_number": 1,
            "vote_average": 9.5
        },
        "2": {
            "_id": "5258e0a9760ee346617ac1d5",
            "air_date": "1999-04-05",
            "episodes": [
                {
                    "air_date": "1999-04-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 810299,
                    "name": "Sakura and the Snowy New School Year",
                    "overview": "A new trimester starts and Sakura is now a fifth grader. She walks to school with Yukito, who gives Sakura a watch as a late birthday and start of fifth grade present. Sakura's new homeroom teacher turns out to be Ms. Mizuki. Sakura looks out the window and thinks she sees cherry blossoms, but realizes it is snow. Later, the snow is piling very quickly, even though it is April. It turns out to be the doings of a Clow Card. Sakura with Tomoyo look down at the snow-covered city to find the card with the Fly card. They stop at the big penguin at Penguin Park where Syaoran and Meilin appear. Syaoran tells the group that it is the doings of the Snow card. Suddenly, a blizzard surrounds them and it appears to be following people with magical powers. Sakura tries to use the Fly card to get herself, Kero, and Syaoran away from the blizzard. Syaoran uses a fire spell to try to stop the blizzard from following them, but it just becomes more furious. In the middle of the flight, Sakura realizes the watch she got from Yukito is gone. Sakura gets angry and releases the power of Firey to burn all the snow and captures the Snow card. Even though Sakura caught a card, she cries because she lost Yukito's present to her. Kero leaves Sakura and Syaoran to get Meilin and Tomoyo. Ms. Mizuki appears and gives Sakura the watch she lost and Sakura thanks her, while Syaoran glares at Ms. Mizuki.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/tv9P5KL0A1UlRj82Jp8Ht29Vnzp.jpg",
                    "vote_average": 10,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-04-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 810300,
                    "name": "Sakura and Tomoyo's Vanished Voice",
                    "overview": "Sakura and her friends are at a picnic with a portable karaoke device Tomoyo got from her mother's company. It is Tomoyo's turn to sing, and she begins singing. The next day at school, Sakura and Tomoyo talk about the song that Tomoyo will sing in choir. At cheerleading practice, Sakura, Chiharu, and Naoko talk about Tomoyo's singing, and decide to go listen after practice. However, Tomoyo's voice is stolen by a Clow Card. Later that night at Sakura's house, Kero tells Sakura that the Voice card caused this. Sakura and Syaoran go to Tomoyo's house to try to seal away the Clow Card. Then, Syaoran and Sakura begin thinking of ways to capture the Voice card. After a comment by Sakura about the Song card, Syaoran comes up with the idea as using the Song card to sing with Tomoyo's voice to draw out the Voice card. It works and the Voice card comes into Tomoyo's house. Syaoran seals the exits with seals, so that the Voice card cannot escape and Sakura seals the card. Tomoyo's voice is returned to her, and she is able to sing in the choir. Sakura and her friends go to the concert and listen to the choir's singing.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/oE5axERjHC9mYJwzrrs8ophuu9D.jpg",
                    "vote_average": 10,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-04-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 810301,
                    "name": "Sakura's Merry Strawberry Hunt",
                    "overview": "Sakura's grade goes on a field trip to pick strawberries. Sakura and Tomoyo bump into Yukito and Toya who are working part-time at the strawberry field. On the way to the greenhouse, Syaoran senses something from the storehouse, but Meilin pushes him along. The class enters the greenhouse and begins picking strawberries. Sakura hears the door to the storehouse will not open, but when she and Tomoyo go to investigate, they find it open. Syaoran and Meilin come into the storehouse, and Syaoran says that he feels a strange presence. The door suddenly closes and locks them inside. Syaoran informs the group that it it the Lock card that has trapped them. After Rika, Naoko, and Chiharu come to the storehouse, they go look for Ms. Mizuki and tell Toya and Yukito. While looking for a key to unlock the door, Sakura sees Ms. Mizuki through the window, who gives her a hint, but Ms. Mizuki then disappears. Sakura realizes that Ms. Mizuki was trying to tell her to use her key. The Lock card shows its true form when Sakura tries to put her key into the lock. Syaoran seals the exits and Sakura quickly seals the Lock card before it can get into the keyhole. Toya, Yukito, Rika, and Naoko come into the messy storehouse, now that the Lock card has been captured. Sakura and the others clean up the storehouse together. Sakura's group learns how to make and bakes desserts with strawberries. After the desserts are made, Sakura brings a piece to Toya and Yukito.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/rayrbyAssfAzh1sWmWxe8cHqPpU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-04-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 810298,
                    "name": "Sakura's Dizzy Fever Day",
                    "overview": "Sakura has a fever, but goes to school anyway because of a group project. Later, Sakura gets dizzy and is sent home with Toya by the nurse. Toya stays home to watch over her. When Toya is making food for her, Sakura senses a Clow Card, and it turns out to be the Cloud card. Sakura uses the Mirror card to make a clone of herself, so Toya will not notice that she is gone. Sakura, using the Fly card so she can capture the Cloud card. Toya comes in Sakura's room with food and offers it to Sakura's clone. Sakura travels toward the Cloud card, but when she is blown off her staff, Syaoran saves her with a wind spell. Sakura learns that Syaoran and Meilin are going after the Cloud card as well. Back in Sakura's room, Sakura's clone asks for the medicine and Toya replies that she should not take medicine when she is not sick, because she is not Sakura. Toya asks the Mirror card to hide the fact that he has a vague idea of what Sakura is doing and the Mirror card agrees. Back outside, Syaoran hits the Cloud card with various spells and gets it to its original form and Sakura seals it. The card is Syaoran's, but he gives it to Sakura. Sakura returns to her room and falls asleep in her bed. Nadeshiko appears and heals Sakura. She tells Toya that she was a bit worried and then tells Sakura to do her best, before disappearing. Sakura's father appears saying that he was worried about Sakura because she was acting strange this morning, and Toya tells him his hunch was right and that mother appeared. The next morning, Sakura is as cheerful as ever, and her father is home helping make breakfast. Sakura thanks her mother for staying by her side.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/gSm6NvqqbrKMlpWINyjL6b7W5PT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "63a7c1a40f21c6007870fd87",
                            "adult": false,
                            "gender": 2,
                            "id": 3567668,
                            "known_for_department": "Visual Effects",
                            "name": "Katsuya Yamamoto",
                            "original_name": "Katsuya Yamamoto",
                            "popularity": 0.35,
                            "profile_path": null
                        },
                        {
                            "job": "Animation Director",
                            "department": "Visual Effects",
                            "credit_id": "65adf0fd158c8500cb2eddaf",
                            "adult": false,
                            "gender": 2,
                            "id": 2879856,
                            "known_for_department": "Visual Effects",
                            "name": "Akira Takeuchi",
                            "original_name": "武内啓",
                            "popularity": 2.093,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-05-10",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 810302,
                    "name": "Sakura and the Sakura in the Dream",
                    "overview": "Sakura, Tomoyo, Meilin and Syaoran head into town for a day of fun. The four are not alone in their venture as the Dream, in the form of a butterfly, tags along. When the group enters Tokyo Tower to see an exhibit there, Sakura falls under the Dream's spell. At first, the vision that the Dream presents to Sakura is comical. Later, the Dream takes a more serious tone by expanding upon Sakura's reoccurring dreams concerning the Clow guardians' Final Judgment. Sakura becomes frightened of the images of this future, however, the Dream flashes clips from Sakura's past to remind Sakura of all the obstacles that she has overcome. Outside of Sakura's dream, Syaoran realizes that something is wrong and uses the Time card to freeze the Dream card. Snapped out of the Dream's spell, Sakura is able to successfully capture the Dream card. However, as it was Syaoran that stopped the card's effects, the Dream card belongs to Syaoran.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/AruVpVO2Q8oWv3fl50GH82lB0UF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "650e2f7cf29d66011cfc4f4d",
                            "adult": false,
                            "gender": 2,
                            "id": 1847885,
                            "known_for_department": "Visual Effects",
                            "name": "Takashi Tomioka",
                            "original_name": "富岡隆司",
                            "popularity": 2.405,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-05-17",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 810303,
                    "name": "Sakura and Shaoran and a Sea of Sand",
                    "overview": "Ms. Mizuki announces that the class will by doing a play for the school arts festival. Sakura realizes that the woman she sees in her reoccurring dream is Ms. Mizuki. Roles are assigned by amida drawing. Sakura has the role of the prince and Syaoran is the princess. The two have lunch with Yukito, who asks about the play. Sakura and Syaoran are too embarrassed to tell him what roles they are playing. They agree to practice their lines together in the morning at school. Toya makes Sakura breakfast and warns her about doing \"reckless\" things. Sakura meets Syaoran in a hallway and the Sand card rushes around behind them. They practice outside and almost get to the kissing scene, when the Sand card forms a vortex around them. They get away using Fly, but Syaoran gets caught in the vortex again. Sakura uses Watery and Syaoran uses Freeze to freeze the Sand. Sakura seals the card and it comes to both of them, but she lets Syaoran have it.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/opV7uCjO0bX54ZrRlhAQ8rKA3T5.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-05-24",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 810304,
                    "name": "Sakura's Pitch-Dark Literary Fest",
                    "overview": "Sakura and Syaoran are working hard at memorizing the play. Finally the day of the play comes, and after a few denials about going out on stage from Syaoran, the play is on. The play goes well until right before Sakura and Syaoran kiss, when the Dark card appears. Sakura is almost lost in the Dark card until she realizes that she holds the Light card in her heart. The two card counteract each other and show themselves. Sakura seals both cards and before being sealed, they tell her that the final judgment is coming and that is will be up to Yue.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/s62t7fIXk0ooBcNp7Vf7wxiuCb6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-05-31",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 810305,
                    "name": "Sakura's Goodbye to Meiling",
                    "overview": "Meilin gets a call from her mother, who wants her to come home. Meilin tells Sakura the next day that she is going back to Hong Kong next week. Syaoran appears, and asks Meilin if she told the teacher she is going back to Hong Kong yet. Meilin asks Syaoran if he feels she is getting in his way, and Syaoran says that is not it. Meilin runs off, calling Syaoran an idiot. At the end of school, Sakura invites Meilin to her house and they have a chat with tea and sweets. Sakura tries to make Meilin feel that she is not a nuisance to Syaoran. Meilin tells Sakura about how she fell in love with Syaoran. In the middle of their conversation, Sakura senses a Clow Card. Meilin decides not to go, but Sakura drags her along and tells her there are things only she can do. Meanwhile, Syaoran is getting beaten by the Twin card. After a couple of failed attempts, Sakura thinks that Meilin and Syaoran can work together to keep the two bodies of the Twin card immobilized, so she can seal them away; they try it, and it works. Sakura seals the Twin card, and it goes to Syaoran because he and Meilin weakened it. Syaoran tells Meilin that he never thought that she was in his way. Sakura, Tomoyo, and Kero go to the airport with Syaoran to say goodbye to Wei and Meilin. Meilin asks Syaoran if he remembers the promise, which is until Syaoran finds a girl he likes more than her, she will be his bride. Meilin whispers a thank you to Sakura for saving them with her magic, before she leaves.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/hlq9179liAyYAdR0vfZCV81qv2O.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "64b6aa95e0ca7f01442bccd6",
                            "adult": false,
                            "gender": 1,
                            "id": 1540497,
                            "known_for_department": "Visual Effects",
                            "name": "Kumiko Horikoshi",
                            "original_name": "堀越久美子",
                            "popularity": 3.466,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-06-07",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 810306,
                    "name": "Sakura and Kero and the Mysterious Teacher",
                    "overview": "Sakura once again has the dream in which she is facing the Tokyo Tower. She clearly sees Ms. Mizuki, but this time, Mizuki is accompanied by another figure with long hair and wings. She wakes up early to see Yukito compete in an archery competition. Sakura explains what she knows of her dream to Kero before running down to make breakfast. She meets up with Syaoran and Tomoyo at the archery competition, and Kero tags along too. At the archery tournament, Sakura finds that Ms. Mizuki is one of the challengers and ends up in the finals alongside Yukito. During the fierce match, Kero pokes his head out of Sakura's bag upon sensing tremendous magical power, shooting a piercing glare at Ms. Mizuki. Sensing his gaze, Ms. Mizuki loses her focus and the tournament. Later during lunch, Sakura discovers that Kero is missing from her bag. Searching for him, she is astonished to find him in the middle of a private conversation with Ms. Mizuki. While walking home, they run into Toya once again, this time dressed in a bear costume giving out balloons. After he leaves, there is an earthquake, likely caused by the final Clow Card.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/rHK7wBy4FoNomkW8w2o1ZWg2j6c.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-06-14",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 810307,
                    "name": "Sakura and the Last Clow Card",
                    "overview": "The earthquake was caused by the Earthy card. Ms. Mizuki is nearby, but there is nothing going on around her. Sakura uses to Sleep card to put everyone except herself, Kero, Tomoyo, and Syaoran asleep; Ms. Mizuki is not affected by the card, however. Sakura uses the Fly card to see from above; while Syaoran makes sure everyone is safe. Sakura eventually uses the Woody card to seal it away. Now with the final card in her possession, Kero is able to transform into his true form. After a short celebration, Syaoran explains that Kerberos, representing the sun, is one of two guardians of the Clow Cards, the other being Yue the judge, representing the moon. Kero explains that the sole owner of the cards will be determined after Yue appears. Suddenly, Yukito magically floats with a light blue aura, and turns into Yue. Ms. Mizuki explains to Sakura that Yukito is Yue. Yue begins the Final Judgment of Syaoran, who tries to fight Yue with a seal, but Yue tells him that it is useless, and he can only use the Clow Cards he currently has. Syaoran tries to use the Time card, but since it is under Yue's jurisdiction, Yue can use it against him. Syaoran is defeated, and it is time for Sakura's Final Judgment.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/4YvjyoOGF8iKC7obD3u2arsX9ob.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Background Designer",
                            "department": "Art",
                            "credit_id": "5aea1e4a92514172aa000ea9",
                            "adult": false,
                            "gender": 1,
                            "id": 2034871,
                            "known_for_department": "Art",
                            "name": "Yuka Okamoto",
                            "original_name": "岡本有香",
                            "popularity": 1.502,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-06-21",
                    "episode_number": 11,
                    "episode_type": "finale",
                    "id": 810308,
                    "name": "Sakura and the Final Judgment",
                    "overview": "Sakura initially refuses to fight Yue, but after he repeatedly attacks her she tries to find card that can confine him without hurting him. She uses the Woody card, but it is a card under Yue's sign of the moon, and he turns it against her, and Yue declares she has failed. Sakura learns that if she fails the Final Judgment, everyone who has ever had anything to do with the cards will forget their feelings for the person they love the most. After seeing a vision of such a world, Ms. Mizuki uses the bell to enable her to break free from Woody's hold. She explains that her bell was created by Clow Reed to give Sakura another chance. Ready to try again, Sakura releases her wand and it transforms, the end changing to a Star. She call's Windy, which Yue denounces as being under him as well, but this time he is unable to turn it against her and is captured. Sakura expresses her understanding of his love for Clow, promises to try her best, asking if they can be friends rather than her being his master. Yue declares the trial successful and acknowledges her as his and Kero's new master. Sakura has a vision of Clow Reed who thanks her and explains that her power is of the Stars, rather than the Sun or Moon. Sakura celebrates with Tomoyo and Syaoran, while Kero and Yue chat briefly before they return to their false forms.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 2,
                    "show_id": 35790,
                    "still_path": "/eW5fJ1lGu3frNQNCqHRBu15pyjC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 46556,
            "poster_path": "/3mBdXJcIDA98TFFLX0zNWKSdKdq.jpg",
            "season_number": 2,
            "vote_average": 10
        },
        "3": {
            "_id": "5258e0a9760ee346617ac1eb",
            "air_date": "1999-09-07",
            "episodes": [
                {
                    "air_date": "1999-09-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 810365,
                    "name": "Sakura and the Mysterious Transfer Student",
                    "overview": "Sakura’s class receives a new transfer student, Eriol Hiiragizawa, a boy from England, and he starts charming Sakura, making Syaoran jealous. Later on, Sakura receives a vision from Clow Reed that he may bring trouble to her, and that night an unnatural storm hits town. Sakura decides to investigate, and discovers that the storm was created by magic. Sakura tries to end the storm, however trouble arises when Sakura attempts to use her Clow Cards.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/y86btfWs0gupZAmU4pDuupI0eeb.jpg",
                    "vote_average": 10,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-09-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 810366,
                    "name": "Sakura and the Awakened Key of Star",
                    "overview": "Rain still falls on Tomoeda. In her kitchen, Sakura thinks about the previous night when she was unable to release her key into the staff. Touya comes downstairs and notes that she's up early as well as calling her a monster, but is visibly concerned when Sakura makes no retort. She asks him if Yukito was going to visit their house that night and he tells her that Yukito hadn't planned on it, but that he would probably come if they were having something good for dinner. In Sakura's room, Kero thinks about the strange presence he sensed the day prior, hoping it wasn't what he thought it was.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/b7gL4XAXlRt7PbZ9BT3Wos9Tsct.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-09-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 810367,
                    "name": "Sakura and the Dangerous Piano",
                    "overview": "Exhausted from the events of the other night, Sakura remains in bed and sleeps into the afternoon before being visited by Syaoran and Tomoyo. Kero explains that Sakura used a great deal of power to transform the Clow Card, explaining her sudden tiredness. Since the Fiery Card was transformed to be under jurisdiction of Sakura's power, Sakura's friends henceforth transform the cards into \"Sakura Cards\". Later at school, Sakura overhears Eriol playing the piano and has Tomoyo sing to his music; unbeknownst to them, however, Eriol enchants the piano while he plays.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/hUErCcz8gYwRm2Idpw9q3bq1bze.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-09-28",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 810368,
                    "name": "Sakura and Shaoran and the Invisible Threads",
                    "overview": "Sakura begins to wonder if the bizarre goings on are connected to Clow Reed's presence, though she is aware that Clow is long deceased. At recess, Rika shows everyone a teddy bear she made. Sakura decides to get her own teddy-bear-making kit at the craft store where she sees Eriol buying several spools of string. That night, Sakura and Kero once again sense Clow Reed's presence and meet up with Syaoran and Tomoyo.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/u8BdBH7Qm7JipAs3lc0P7ahBDIz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-10-05",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 810369,
                    "name": "Sakura and the Big Stuffed Doll",
                    "overview": "Several people at school have started making their own teddy bears to give to their loved ones, while Eriol helps Sakura make her bear for Yukito, secretly enchanting one of its ears. Syaoran, who also has feelings for Yukito and has made his own bear, begins falling in love with Sakura as well. Yue approaches the confused Syaoran and tells him that the reason he seems to be in love with Yukito is that he, having descended from Clow Reed, feels an attraction to the moon powers Yue emits as a creation of Clow. That night, Sakura gives Yukito the bear, only to see it grow in size in response to Eriol's magic.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/oyUE3vljmt6t93G3zLBNTo3kzfa.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-10-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 810370,
                    "name": "Sakura's Sheep Warning!?",
                    "overview": "Yue secretly confides with Kerberos that he has recently been losing his energy, and that Sakura's powers alone aren't enough to help him maintain himself; he adds that if his power disappears, both he and his alter ego Yukito, who is oblivious to this incident but growing increasingly aware of it, will fade from existence. Toya, who is aware of Yukito's predicament, attempts to tell him the truth, but is once again interrupted by Nakuru, making it clear she is doing so on purpose. Meanwhile, Sakura's attention is drawn to a large, deep hole in the middle of the playground. She is able to enter the hole, though her friends are not since it is sealed by Clow Reed's magic.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/lL1gZMiDy3mMMKJ0C5OiXpKPjJY.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-10-19",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 810371,
                    "name": "Sakura and the Panic Bicycle",
                    "overview": "Sakura learns that the Clow Cards she is unable to use are beginning to lose their power, and will become ordinary cards if they aren't converted into Sakura Cards. Unwilling to let this happen, Sakura brings her Star Wand and despite Kero's misgivings, recklessly converts several cards at once although she's left weakened. However, she loses control of one of the cards, the Dash, which panics and flees, possessing Toya's bike which Eriol had enchanted earlier while helping Sakura clean her yard.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/jl4dl45ZOpYigOdug52b0gSUc2K.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-10-26",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 810372,
                    "name": "Sakura and the Calendar of Memories",
                    "overview": "Fujitaka gives Sakura her mother's old calendar, and learns about her great-grandfather (the two had previously met, though Sakura remains unaware of his identity) and how he disapproved of his granddaughter's marriage to Fujitaka. Hoping to set things right, Sakura hand-makes a gift and uses the Flower card to decorate it, along with a letter about how happy her mother was.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/yXhAEwCfuhPo72CyFlS10OjZDIy.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-11-02",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 810347,
                    "name": "Sakura and Sakura in Wonderland",
                    "overview": "While reading Alice in Wonderland, Sakura is sucked into the book's fantasy due to another of Eriol's enchantments, this time on a leaf he gave Sakura to use as a bookmark. There she meets the story's characters who have taken on the forms of her friends and family: Eriol is the Cheshire Cat, Yukito is the White Rabbit, Toya is the Mad Hatter, Syaoran is Tweedle-Dum and Tweedle-Dee, Tomoyo is Humpty Dumpty, and Kero is the Red Queen.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/f9cas7L41MfvOwwNPobIkZ2lUEv.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-11-09",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 810348,
                    "name": "Sakura and Kero and a Candy Date??",
                    "overview": "Sakura's school is hosting a bazaar, and Kero attends to eat sweets, hiding in the woods. Nakuru, meanwhile, brings Spinel Sun along and hides him in the same forest while she attends the bazaar. Kero meets Suppie (the pet name Nakuru gave him) but is completely oblivious to his true nature and befriends him, forcing him to eat some of the sweets. As a result, Suppie becomes intoxicated by the sugar and goes on an eating binge throughout the school. Kero, who is unable to explain the predicament to Sakura, asks her to use the Sleep card on all the customers, allowing him to get rid of Suppie.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/dZbYiU9uYtcA1s4jnAJEuFX8o5b.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-11-16",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 810349,
                    "name": "Sakura and Shaoran and the Elevator",
                    "overview": "Syaoran's feelings for Sakura have been steadily increasing, though he still doesn't understand why, and Sakura remains blissfully unaware of it. Soon Sakura invites him to go to a teddy bear festival with her, Tomoyo, and Eriol. However, Eriol secretly traps Sakura and Syaoran on an elevator, where the two grow closer. Eriol then creates a large hole in the wall of the elevator, causing Sakura to fall through. Distraught, Syaoran calls out to Sakura by her first name for the first time.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/j22sIxMUi3xMFYdJnKly4H98xGP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-11-30",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 810350,
                    "name": "Sakura and Double Trouble",
                    "overview": "Eriol casts a spell on Kerberos and Yue so that they are unable to revert to their guise forms, much to Sakura's dismay, since it is understandably difficult to hide their true forms for long. Fortunately, Toya and Fujitaka are out for the day, and Sakura has them help around the house while reminiscing about their time with Clow Reed.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/iLyqYGf0DUDysgHjMTCAm74ROx3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-12-07",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 810351,
                    "name": "Sakura and Tomoyo and the Ball Trap",
                    "overview": "Sakura grows in magical strength and power for every Clow Card she transforms into a Sakura Card, while Yue's energy begins to falter. Yue also comes to the realization that Eriol is in fact Clow Reed and transforms in front of him. However, Eriol makes Yukito faint and erases his memory of him ever realizing who Eriol truly is; Clow Reed, since he is not yet ready to reveal himself and also reverses Yue's transformation back into Yukito. Syaoran, in the meantime, has fully realized his strong romantic feelings for Sakura and consults with Tomoyo, who helps him deal with his jealousy towards Eriol and gives him the confidence (just barely, though) to speak his mind to the oblivious Sakura. Before he can do so, however, both he and Sakura sense Clow Reed's presence once again, this time in the form of a basketball that leads them through the school at night.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/dTLeHPsh6BXqmS20ed2lRbZjA35.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-12-14",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 810352,
                    "name": "Sakura and Her Precious Friend",
                    "overview": "Remembering his promise to Meiling that he would be her \"fiancé\" until he found someone he loved more, Syaoran calls her to tell her that he is in love with Sakura, though he is taken by surprise when Meiling arrives in Tomoeda for the day. While Meiling spends the day with her old friends, the group is attacked by a set of enchanted penguin statues at the playground.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/qnZKCC6tJPxkjjHLKV7thngIx5M.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "1999-12-21",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 810353,
                    "name": "Sakura and Card and Present",
                    "overview": "Kero is almost positive that Toya knows everything about Sakura's secret, though Sakura dismisses his claims, saying Toya would make fun of her if he did. Toya, meanwhile, is certain that Nakuru is deliberately interrupting him while he tries to tell Yukito the truth about why he is always feeling fatigued. The two make plans to buy a Christmas present for their father, though Sakura senses Clow Reed's presence again.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/hgW6QwJhl3z5tVH9usaGXOwFCME.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2000-01-04",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 810354,
                    "name": "Sakura and the Mysterious Fortune",
                    "overview": "Sakura goes to a New Year's festival and notices that Yukito isn't around. Toya goes to check on him, discovering that he has not only collapsed from fatigue, but he's also beginning to fade from existence since Sakura's power, despite how strong it has become, is not enough to sustain Yue. Later at the festival, she receives a fortune from Eriol which he secretly made and enchanted, saying that she will begin to learn the \"truth\" in her \"first dream of the year.\" That night, Sakura transforms the Dream card in her sleep and has a dream of the sky being blanketed by darkness emanating over Tsukimine Shrine, where she sees the silhouettes of Eriol, Spinel Sun, and Ruby Moon. When Sakura awakens to realize what she's done, she and Kero begin to suspect that they will meet the three silhouetted figures very soon.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/kDrUftwZCvTs5e54bybSraW7zWp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2000-01-11",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 810355,
                    "name": "Sakura and the Pool and the Big Wave",
                    "overview": "Sakura and her friends go spend the day at a new indoor water park, where Eriol causes the water to rise to dangerous levels. When Rika, who has trouble swimming, nearly drowns, Sakura uses the transformed Watery card to save her, risking being seen using her magic by everyone. However, it appears Eriol would have returned things to normal if Sakura was too late, making his motives unclear.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/6c3ZnZuXcXQEZYQGcLauMqrY7VL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2000-01-18",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 810356,
                    "name": "Sakura and the Snow-blowing Ski School",
                    "overview": "There is an avalanche that Sakura must stop. She transforms & uses The Time(Which we all know uses alot of magic), The Fly to get to the spot of the avalanche, and attempts to use The Firey(One of the four element cards, also requires ALOT of magic) and faints. The Time's magic then ends and the avalanche almost falls on Sakura, but Eriol stops it. This marks the one and only time Eriol has to assist Sakura with a problem bestowed upon her by himself. Eriol also mentions how the one thing he does not want to do is cause Sakura pain, but it seems as if he can't not cause her pain.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/2jWEst6QJQXk52zlCLO0mXsEbWi.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2000-02-15",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 810357,
                    "name": "Sakura and Yukito and His Fading Power",
                    "overview": "Toya and Yukito are starring in an independent film directed by Nakuru for their school fair, and Nakuru gives Sakura a role. Sakura later begins to notice that Yukito is losing his power and is starting to fade away. Things come to a head when Yukito passes out and falls of a veranda while shooting the film, though he is saved by Toya and, secretly, Sakura. Toya finally manages to tell Yukito the truth about his power, telling off Nakuru when she attempts to interfere. In order to maintain Yue's power and existence, thus allowing Yukito to survive, Toya sacrifices his powers to save him, though losing the ability to sense when Sakura is in danger. As such, Toya has Yue promise to protect Sakura, as well as himself. Having overheard, Sakura realizes that Toya had indeed known about her secret all along. She confronts Kero about why he didn't tell her about Yue/Yukito; Kero explains that he did so to prevent her from blaming herself, since her power alone wasn’t enough to sustain him, and thus act irrationally because of it. Not wanting Yukito to disappear again, Sakura resolves to confess her true feelings to him.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/sRa3EHVBHLQmSBWNCqhRjYQoqde.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2000-02-22",
                    "episode_number": 20,
                    "episode_type": "standard",
                    "id": 810358,
                    "name": "Sakura's Most Favorite Person",
                    "overview": "After viewing Nakuru's film, Sakura tours the high school fair with her friends, while Toya comforts Yukito when he appears troubled by the fact that he is not human. Alone with Yukito in one of the attractions, Sakura tells Yukito how much she likes him. However, Yukito gently rebuffs her, saying that her love for him is merely platonic, and that he already has someone he loves; Sakura, in a rare moment of insight, realizes that person to be her brother, Toya. Yukito tells Sakura that the person she loves most is still out there when Sakura senses Clow Reed's presence once more. Using the Maze and Illusion cards, Sakura manages to trap the presence and discovers it to be coming from Eriol, though she loses consciousness. Eriol jumbles her memory of the discovery, acknowledging that she has indeed grown powerful to find him. Sakura tells Syaoran of her experience with Yukito and, despite her understanding and acceptance of the matter, begins to cry. Knowing that now is not the time to tell her that he loves her, Syaoran comforts her and assures her that she will find the person who she loves the most.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/nUptrzdYsbWRmnHxBR2SJFyeHx3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2000-02-29",
                    "episode_number": 21,
                    "episode_type": "standard",
                    "id": 810359,
                    "name": "Sakura and Shaoran and the Tsukimine Shrine",
                    "overview": "Sakura heads to school in the morning, but does not see Yukito. She notices that there is a festival and asks Syaoran whether he wants to go to the festival at Tsukimine Shrine. He agrees, much to Sakura's delight. As the lessons continue, Sakura feels sleepy again. Syaoran notices this and is worried. As Tomoyo and Sakura walk home, Sakura admits that she feels much better now and thanks Syaoran and Tomoyo for their help. As Syaoran and Sakura walks to the shrine, Sakura gives Syaoran her handmade scarf, which Syaoran shyly accepts. Toya, Yukito (and Eriol) turn up and the shrine (Sakura invited them);Sakura happily goes with Yukito. Sakura and the rest waits near the lake while Yukito and Toya went to get drinks. As Sakura walks near the lake, she felt Clow's presence and Eriol summons a strange-looking horse. Sakura transforms the Wood card in an attempt to immobilize the horse but fails. The horse cuts the power lines and Syaoran sends a blast of lightning but the damage was not enough. Syaoran then sends a blast of wind to push the horse into the water. Sakura transforms the Thunder card to electrocute the horse and succeeds. As the power lines are cut, there are no lights. Sakura then transforms the Glow card to illuminate the shrine, while Syaoran wonders whether he should confess his love to Sakura.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/qys0I9725FrVVtKkL7dr7d65nkp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2000-03-07",
                    "episode_number": 22,
                    "episode_type": "standard",
                    "id": 810360,
                    "name": "Sakura and the Past and Clow Reed",
                    "overview": "Sakura uses the Return card with the help of the cherry blossom tree at the temple. In the past she first sees Keroberos and Yue talking. Kerobers says hes concerned about the cherry blossom tree because its already spring and it hasn't blossomed. Clow Reed sees Sakura then walks over to the 2. He uses the flower card to help the tree. The images fade and Sakura passes out. (Return is a time card and requires alot of energy to use.   Sakura wakes up and finds herself leaning against a sleeping Keroberos. Clow Reed said he let her rest so her energy could return. He says he knows she's from the future. She tells him that strange things are happening in the future and they sences his magic.   The scene changes and Sakura is runnig down a hall in Clow's house. She runs past a room but doubles back to see. This time she can only watch, for the Return cards power is running out. Yue and Keroberos seem upset. Clow Reed has told them that he is going to die.  Both guardians are upset at this.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/wAan4bdvtv9zRRpQMSGii2qe2Ao.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2000-03-14",
                    "episode_number": 23,
                    "episode_type": "standard",
                    "id": 810361,
                    "name": "Sakura meets Clow Reed",
                    "overview": "Eroile stands above Sakura, Synoran, Kero and Tomoyo, and reveals the truth at last: He is the reincarnation of Clow Reed himself!\n\nHe then casts a spell that eclipses both the sun and the moon. This puts those not entuned with magical power to sleep.\n\nAs Yue and Toya race to the shrine, Toya collapses, with no power to call his own any more, the spell is able to affect him also.\n\nEroile then challenges Sakura to use her abilities to break his spell of Darkness or everyone will sleep forever!\n\nWith Kero and Yue being kept busy by Spinal Sun and Ruby Moon, Sakura knows she is vulnerable, so she strikes quickly. She uses the shield card to protect Synoran and Tomoyo and uses the jump card to get closer to Elrole, but the sorcerer summons a fire spell to drive her back, Skaura falls backwards, Synoran uses wind magic to catch her, but in doing so, drains himself of all his remaining strength.\n\nAfter further battle, and more card changing, Sakura realises that only the power of light can shatte",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/nBGpHHREvmA86sSkSAXsUvDvzJ8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "63ead243813cb6008ec42e4f",
                            "adult": false,
                            "gender": 2,
                            "id": 1847857,
                            "known_for_department": "Visual Effects",
                            "name": "Norimitsu Suzuki",
                            "original_name": "鈴木典光",
                            "popularity": 2.079,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2000-03-21",
                    "episode_number": 24,
                    "episode_type": "finale",
                    "id": 810363,
                    "name": "Sakura and her True Feelings",
                    "overview": "The challenge is over at last.\n\nAll the cards have been captured, all have been turned.\n\nThe tests are over, or are they?\n\nThere may be just one remaining, one that may have to be resolved with the heart.\n\nLife has been difficult for Sakura and Li since the day Synoran confessed to sakura that he was in love with her, Li finds it difficult to approach Sakura, whilst Sakura herself is torn, not knowing if she feels the same way for Synoran.\n\nThe two barly exchange words when they return to school, where they are told by Tereda-Sensi that Eroil is transferring back to England.\n\nSakura, Li, Tomoyo [Armed with her camera as always] and Kero head for Eroil mansion, seeking answers, they are startled when the mansion's front door opens by itself, as do all the other doors from within the building.\n\nWhen the final door opens, the four are shocked to discover that Eroile is holding a party for them!",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 3,
                    "show_id": 35790,
                    "still_path": "/rjcLEa6dwpCQFF36BJfdIktlAp0.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 46558,
            "poster_path": "/ikEhvUGvRNTDiQ1hAO7kCShmkTu.jpg",
            "season_number": 3,
            "vote_average": 10
        },
        "4": {
            "_id": "5a36f63fc3a36814a8059286",
            "air_date": "2018-01-07",
            "episodes": [
                {
                    "air_date": "2018-01-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1416448,
                    "name": "Sakura and the Clear Cards",
                    "overview": "It's April, the cherry trees are in full bloom, and Sakura has entered Tomoeda Middle School. She's reunited with Syaoran, who has returned from Hong Kong, and her new student life has begun.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/qt2JwzcIguV0HA1eCsFACEnrOhp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae1fc7c224006536de34",
                            "adult": false,
                            "gender": 2,
                            "id": 2381458,
                            "known_for_department": "Directing",
                            "name": "Kunio Wakabayashi",
                            "original_name": "若林邦甫",
                            "popularity": 0.96,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "664dddcaa482f10d04fd175e",
                            "adult": false,
                            "gender": 2,
                            "id": 4006722,
                            "known_for_department": "Visual Effects",
                            "name": "Daiki Suzuki",
                            "original_name": "鈴木大輝",
                            "popularity": 0.062,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1734068,
                    "name": "Sakura and the Room with No Exit",
                    "overview": "It's the new term, and the hot topic at school is clubs! Sakura and Tomoyo decide to join the same clubs they did in elementary school, cheerleading and chorus.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/yXlABBSpHLDwCP58gZgvlFN3jjy.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae2d8a0e9b001bf40c00",
                            "adult": false,
                            "gender": 2,
                            "id": 1768635,
                            "known_for_department": "Directing",
                            "name": "Tetsuo Ichimura",
                            "original_name": "Tetsuo Ichimura",
                            "popularity": 0.603,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "664dddcaa482f10d04fd175e",
                            "adult": false,
                            "gender": 2,
                            "id": 4006722,
                            "known_for_department": "Visual Effects",
                            "name": "Daiki Suzuki",
                            "original_name": "鈴木大輝",
                            "popularity": 0.062,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1734069,
                    "name": "Sakura's Heavy Rain Alert",
                    "overview": "It's been raining buckets all day. Sakura and Tomoyo take shelter in a park on the way home from school, and suddenly the Key of Dreams at Sakura's chest begins to shine... Is it the work of a card?",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/wOdDNPs7XJTDDqQdlcXdJUFbnCf.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae3736390900458cbc7b",
                            "adult": true,
                            "gender": 2,
                            "id": 1681345,
                            "known_for_department": "Directing",
                            "name": "Mitsutaka Noshitani",
                            "original_name": "熨斗谷充孝",
                            "popularity": 2.609,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "664dddcaa482f10d04fd175e",
                            "adult": false,
                            "gender": 2,
                            "id": 4006722,
                            "known_for_department": "Visual Effects",
                            "name": "Daiki Suzuki",
                            "original_name": "鈴木大輝",
                            "popularity": 0.062,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-28",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1734070,
                    "name": "Sakura and the Lovely Transfer Student",
                    "overview": "A new transfer student named Akiho Shinomoto joins Sakura's class. She's just arrived in Japan after living overseas, so her Japanese is still very stiff and formal. Sakura invites her to eat lunch with her group, excited to make a new friend.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/7LMWaD6D1G8XsxeRyc8Zq7mdiEz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae44fe077a0045d0612b",
                            "adult": false,
                            "gender": 2,
                            "id": 2177827,
                            "known_for_department": "Directing",
                            "name": "Daisuke Tsukushi",
                            "original_name": "筑紫大介",
                            "popularity": 1.492,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-04",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1734071,
                    "name": "Sakura Feels a Pull at the Flower Viewing",
                    "overview": "Sakura is having a flower-viewing party with her friends Tomoyo, Syaoran, Chiharu, Naoko, and Yamazaki, as well as the new transfer student Akiho.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/l44u9Jz88JpwvkAPE7cczUos3tZ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae4f7eb5f200466425d8",
                            "adult": false,
                            "gender": 2,
                            "id": 1494116,
                            "known_for_department": "Directing",
                            "name": "Hideki Hosokawa",
                            "original_name": "細川ヒデキ",
                            "popularity": 2.678,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-11",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1734072,
                    "name": "Sakura, the Rabbit, and the Song of the Moon",
                    "overview": "Sakura continues to face the hooded figure in her dreams. At school, everyone says they want to hear Akiho sing again after being charmed by her voice at their flower-viewing party, so they meet in the music room after classes are over.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/yNRo53InMFjOfEikt5Y4EQSUj9M.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "64860965d2b20900ad3cf699",
                            "adult": false,
                            "gender": 1,
                            "id": 2381999,
                            "known_for_department": "Directing",
                            "name": "Yuki Nishibata",
                            "original_name": "西畑佑紀",
                            "popularity": 0.757,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-18",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1734073,
                    "name": "Sakura and a Game of Tag in the Garden",
                    "overview": "Sakura and Kero-chan visit Tomoyo's house to test the abilities of the Record card. Tomoyo's mother appears and gives Sakura an enthusiastic welcome, then the girls head outside to test the card.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/np1oR6oTVkrNCYxpbhqlq5hmOol.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae1fc7c224006536de34",
                            "adult": false,
                            "gender": 2,
                            "id": 2381458,
                            "known_for_department": "Directing",
                            "name": "Kunio Wakabayashi",
                            "original_name": "若林邦甫",
                            "popularity": 0.96,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-25",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1734074,
                    "name": "Sakura, the Clock, and a Hide-and-Seek Game",
                    "overview": "Sakura finds out that Akiho has moved into the mansion formerly inhabited by Clow Reed's reincarnation, Eriol. She pays a visit with Tomoyo and meets Kaito, the butler who's been taking care of Akiho since her childhood.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/iTVVz2z7lScVnsph0ps2rGup1ED.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae78a22d3e001e1c28fd",
                            "adult": false,
                            "gender": 2,
                            "id": 2377015,
                            "known_for_department": "Directing",
                            "name": "Masayuki Iimura",
                            "original_name": "飯村正之",
                            "popularity": 2.116,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-04",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1734075,
                    "name": "Sakura's Thrilling Aquarium Visit",
                    "overview": "Sakura invites Syaoran out for the day with tickets given to her by her father. She's worked hard on the rolled omelets for their lunch, and now they make their way to the aquarium Sakura visited when she captured the Clow Card, Watery.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/jFYSIJjcX1HtrZXiGN4jiUwEv6Q.jpg",
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae2d8a0e9b001bf40c00",
                            "adult": false,
                            "gender": 2,
                            "id": 1768635,
                            "known_for_department": "Directing",
                            "name": "Tetsuo Ichimura",
                            "original_name": "Tetsuo Ichimura",
                            "popularity": 0.603,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-11",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1734076,
                    "name": "Sakura and the Sleep Labyrinth",
                    "overview": "Akiho pays a visit to Sakura's house one evening while her father and brother are both away. They look at Sakura's elementary school pictures and have dinner together, but then Akiho suddenly falls asleep.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/jVz4Jq37kncLqTyiswtEhuAxZp0.jpg",
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae9774d6c0004660a2f9",
                            "adult": false,
                            "gender": 0,
                            "id": 3235666,
                            "known_for_department": "Directing",
                            "name": "Toshiaki Kamihara",
                            "original_name": "Toshiaki Kamihara",
                            "popularity": 0.001,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-18",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1734077,
                    "name": "Sakura and the Upside-down Penguin",
                    "overview": "Syaoran meets Kaito through a chance encounter on the way home from school. He informs Eriol, whom he's beem secretly keeping in touch with, and they both begin to suspect Kaito is a very powerful magician.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/F9vMfGlWkOEhDCm6NjQiHy9BUT.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226aea2363909001bea8c69",
                            "adult": false,
                            "gender": 2,
                            "id": 2039478,
                            "known_for_department": "Visual Effects",
                            "name": "Toshihiro Kikuchi",
                            "original_name": "菊池聡延",
                            "popularity": 1.515,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-25",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1734078,
                    "name": "Sakura and the Icy Ball-Sports Tournament",
                    "overview": "It's the day of the ball-sports tournament everyone's been looking forward to. The athletic Sakura makes a strong g showing in the basketball event!",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/u0nihYSGY56uQJhbjFtvmTy06IX.jpg",
                    "vote_average": 6,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae4f7eb5f200466425d8",
                            "adult": false,
                            "gender": 2,
                            "id": 1494116,
                            "known_for_department": "Directing",
                            "name": "Hideki Hosokawa",
                            "original_name": "細川ヒデキ",
                            "popularity": 2.678,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-04-08",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1734079,
                    "name": "Sakura and Welcome Back, Meiling",
                    "overview": "Sakura is overjoyed to see Syaoran's cousin, Meiling, make an unannounced visit from Hong Kong. Meiling asks to stay at Sakura's house, so they head straight there. Meanwhile, the power Toya lost by giving it to Yukito is gradually starting to return.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/ydW6MVeNO4NGnS2woHjgMTW4kSA.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226aec2b0ba7e00659b3da6",
                            "adult": false,
                            "gender": 2,
                            "id": 2386047,
                            "known_for_department": "Directing",
                            "name": "Masaharu Tomoda",
                            "original_name": "友田政晴",
                            "popularity": 2.491,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-04-15",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 1734080,
                    "name": "Sakura, the Shrine, and the Zoo",
                    "overview": "Sakura is visiting the Tsukimine Shrine market with Meiling, Akiho, and the rest of their friends. She enjoys a day of browsing the many shops and stalls on the grounds along with Akiho, who's never seen a Japanese shrine before.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/m9EY8KcSrurBAjSStVXbNCv8D5s.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226aecf01757f0048bb2f7d",
                            "adult": false,
                            "gender": 2,
                            "id": 1509822,
                            "known_for_department": "Directing",
                            "name": "Daisuke Takashima",
                            "original_name": "高島大輔",
                            "popularity": 1.549,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-04-22",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 1734082,
                    "name": "Sakura's Nostalgic Viewing Party",
                    "overview": "Sakura has been invited to Tomoyo's house, along with Meiling and Akiho. Tomoyo says there's something she wants to show them and leads everyone to her home theater, where she plays the video of a play they were all part of in elementary school.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/mnNIJk87cGMht17oSdowlGFfAsH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae1fc7c224006536de34",
                            "adult": false,
                            "gender": 2,
                            "id": 2381458,
                            "known_for_department": "Directing",
                            "name": "Kunio Wakabayashi",
                            "original_name": "若林邦甫",
                            "popularity": 0.96,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-04-29",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 1734086,
                    "name": "Sakura and Meiling's Friend",
                    "overview": "Sakura manages to capture the card that showed up at Tomoyo's house, but her relief is short-lived. As they're returning home, Sakura and Meiling are suddenly attacked by a mysterious girl in the road!",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/krmH71G1a7Hqw9XGlYXLJHhPZD4.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae78a22d3e001e1c28fd",
                            "adult": false,
                            "gender": 2,
                            "id": 2377015,
                            "known_for_department": "Directing",
                            "name": "Masayuki Iimura",
                            "original_name": "飯村正之",
                            "popularity": 2.116,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-06",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 1734087,
                    "name": "Sakura and the Crazy Sweets",
                    "overview": "Today is the cooking lesson in home ec class that everyone's been looking forward to. Sakura's morning is thrown into a panic when she forgets her apron, but she and her friends are excited to make roll cakes in class.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/v6t4vALGe5mQDXTxY5aUOppyc54.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Key Animation",
                            "department": "Visual Effects",
                            "credit_id": "6226ad4da22d3e004896a377",
                            "adult": false,
                            "gender": 0,
                            "id": 3434530,
                            "known_for_department": "Visual Effects",
                            "name": "Lu Hongxi",
                            "original_name": "Lu Hongxi",
                            "popularity": 0.516,
                            "profile_path": null
                        },
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "64860965d2b20900ad3cf699",
                            "adult": false,
                            "gender": 1,
                            "id": 2381999,
                            "known_for_department": "Directing",
                            "name": "Yuki Nishibata",
                            "original_name": "西畑佑紀",
                            "popularity": 0.757,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-13",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 1734088,
                    "name": "Sakura and the Fire and Water Birds",
                    "overview": "When Sakura senses a card late at night, she heads to Tsukimine Shrine with Kero-chan, Tomoyo, and Syaoran.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/vG5s4VCCUo85TQEs2RSiI7T7qAL.jpg",
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae2d8a0e9b001bf40c00",
                            "adult": false,
                            "gender": 2,
                            "id": 1768635,
                            "known_for_department": "Directing",
                            "name": "Tetsuo Ichimura",
                            "original_name": "Tetsuo Ichimura",
                            "popularity": 0.603,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-20",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 1734089,
                    "name": "Sakura and Akiho's Lullaby",
                    "overview": "Sakura is finally about to go and read to children with Yukito, and she invites Akiho, Syaoran, and Tomoyo to come along. Sakura's enthusiasm convinces Akiho to join her for the reading, while Syaoran agrees to contribute a piano accompaniment.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/71TZHgPWERiCfpj1kXJ1kfLhAwX.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226af18a3144000450288ca",
                            "adult": false,
                            "gender": 2,
                            "id": 1467473,
                            "known_for_department": "Directing",
                            "name": "Akira Kato",
                            "original_name": "加藤顕",
                            "popularity": 3.166,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-27",
                    "episode_number": 20,
                    "episode_type": "standard",
                    "id": 1734090,
                    "name": "Sakura, Rainbows, and Grandpa",
                    "overview": "Sakura is spending her Sunday morning making rolled omelets for the homemade lunches she's taking for her outing with Syaoran.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/kEnTfTQhI6mGLGiyRscGdJ2eASL.jpg",
                    "vote_average": 6,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226af2b1bf2660019a77ce5",
                            "adult": false,
                            "gender": 2,
                            "id": 2376289,
                            "known_for_department": "Directing",
                            "name": "Naoki Hishikawa",
                            "original_name": "菱川直樹",
                            "popularity": 2.999,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-03",
                    "episode_number": 21,
                    "episode_type": "standard",
                    "id": 1734091,
                    "name": "Sakura, the Mirror, and the Key of Memories",
                    "overview": "Cerberus and Yue meet with Eriol via magic to discuss Sakura's new cards. Eriol has found out that Kaito took something from the magic association he once belonged to, but at that moment, Kaito's magic severs the trio's communication link.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/3Zaj8Mehqem07KS889hnEm2si7N.jpg",
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae4f7eb5f200466425d8",
                            "adult": false,
                            "gender": 2,
                            "id": 1494116,
                            "known_for_department": "Directing",
                            "name": "Hideki Hosokawa",
                            "original_name": "細川ヒデキ",
                            "popularity": 2.678,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-10",
                    "episode_number": 22,
                    "episode_type": "finale",
                    "id": 1734092,
                    "name": "Sakura's Clear Cards",
                    "overview": "Sakura has seen the mysterious robed person in her dreams many times. It turns out Akiho has been having the same dreams herself, and she's grown worried over their unsettling contents.",
                    "production_code": "",
                    "runtime": 25,
                    "season_number": 4,
                    "show_id": 35790,
                    "still_path": "/pZsUDtjSTmg6nbDDfb4CEwiXaNL.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [
                        {
                            "job": "Writer",
                            "department": "Writing",
                            "credit_id": "6226ad8bc7c2240045de596f",
                            "adult": false,
                            "gender": 1,
                            "id": 555348,
                            "known_for_department": "Writing",
                            "name": "Nanase Ohkawa",
                            "original_name": "Nanase Ohkawa",
                            "popularity": 3.389,
                            "profile_path": null
                        },
                        {
                            "job": "Director",
                            "department": "Directing",
                            "credit_id": "6226ae1fc7c224006536de34",
                            "adult": false,
                            "gender": 2,
                            "id": 2381458,
                            "known_for_department": "Directing",
                            "name": "Kunio Wakabayashi",
                            "original_name": "若林邦甫",
                            "popularity": 0.96,
                            "profile_path": null
                        },
                        {
                            "job": "3D Artist",
                            "department": "Visual Effects",
                            "credit_id": "651400140499f200abbcf830",
                            "adult": false,
                            "gender": 2,
                            "id": 4293497,
                            "known_for_department": "Visual Effects",
                            "name": "Hirotomo Makino",
                            "original_name": "牧野大友",
                            "popularity": 0.565,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                }
            ],
            "name": "Clear Card",
            "overview": "Fourteen-year-old Sakura starts junior high school along her friends, including Syaoran, who had just returned to Tomoeda. After having a dream with a mysterious cloaked figure, all of Sakura's cards turn blank and are rendered powerless, thus she starts her quest to find out what is wrong. In doing so, Sakura and her allies discover and capture new transparent cards using a new key.",
            "id": 96699,
            "poster_path": "/mO0zPqdlhWfvfav7OWORdcCOQCw.jpg",
            "season_number": 4,
            "vote_average": 5.8
        }
    }
}