{"adult":false,"backdrop_path":"/cqdLPcoZnU1n629OP2wkr2lOLqi.jpg","created_by":[],"episode_run_time":[30,44],"first_air_date":"2010-04-21","genres":[{"id":99,"name":"Documentary"},{"id":18,"name":"Drama"}],"homepage":"","id":36160,"in_production":false,"languages":["en"],"last_air_date":"2012-08-14","last_episode_to_air":{"id":822219,"name":"Mind Control","overview":"Three spine-tingling stories about mind-control: a man with a mysterious implant believes aliens have been monitoring his every move; a séance turns a housewife into a literary genius; and, a California woman suspects she is the target of a sinister government experiment.","vote_average":0,"vote_count":0,"air_date":"2012-08-14","episode_number":10,"episode_type":"finale","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null},"name":"Weird or What?","next_episode_to_air":null,"networks":[],"number_of_episodes":32,"number_of_seasons":4,"origin_country":["US"],"original_language":"en","original_name":"Weird or What?","overview":"Weird or What? is a series on the Discovery Channel and History hosted by William Shatner. Each episode contains three separate stories of the bizarre and unexplained. As the show unfolds, it weighs various supernatural and scientific theories that attempt to explain the story, and sometimes features tests conducted as proof of a theory's plausibility. The show features strange occurrences such as ghosts, aliens, monsters, medical oddities and natural disasters.","popularity":5.422,"poster_path":"/ak07iPfiT2kEIUEBpYAmn0PbwP8.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":null,"episode_count":10,"id":47025,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2010-04-21","episode_count":10,"id":47021,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2011-09-12","episode_count":10,"id":47022,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2012-05-28","episode_count":10,"id":47023,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":null,"episode_count":2,"id":47024,"name":"? season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7,"vote_count":8,"season_data":{"1":{"_id":"5258e372760ee346617e96b7","air_date":"2010-04-21","episodes":[{"air_date":"2010-04-21","episode_number":1,"episode_type":"standard","id":822204,"name":"Strange Survival","overview":"Following a catastrophic malfunction in New York City, a highrise window washer’s platform plummets nearly 50 stories and miraculously, he survives. In Death Valley, rocks and boulders appear to be moving around on their own. Can this strange and seemingly impossible phenomenon be explained? And, seven dismembered human feet wearing trainers wash up on the beaches of Vancouver. Can science determine the sinister force behind this macabre mystery?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-28","episode_number":2,"episode_type":"standard","id":822205,"name":"Ghost Ship","overview":"Residents of a Texas town report strange lights in the night sky and claim to have seen US Air Force planes in hot pursuit of UFOs. Did they witness an alien visitation? From the depths of the ocean, scientists record one of the loudest sounds in the natural world. Can they determine its mysterious source? And, a fishing trawler vanishes in perfectly calm waters off the Northern California coast only to be found mysteriously undamaged on the ocean floor. What happened?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-05","episode_number":3,"episode_type":"standard","id":822199,"name":"Cocaine Mummies","overview":"Before a major San Francisco earthquake, thousands of sea lions disappear from the harbour. Did they sense the impending disaster? A century after its discovery, experts remain baffled by a mysterious medieval manuscript written in a secret code. What secrets does it contain? And, while testing ancient mummies, forensic scientists find evidence of cocaine — a Peruvian product not found in Egypt until thousands of years later. Was there trans-Atlantic travel long before Columbus?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-12","episode_number":4,"episode_type":"standard","id":822200,"name":"Grim Reapers","overview":"A surfer in Monterey Bay, California, is attacked by a Great White shark but is miraculously saved by dolphins. Did they intentionally risk their lives to save him? Across America, domestic pets are accurately identifying people about to die. Can they smell death? And, in Missouri, a skinny teen lifts a car to free the man trapped underneath. Just how is that possible?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-19","episode_number":5,"episode_type":"standard","id":822201,"name":"Moving Rocks","overview":"In Death Valley, rocks and boulders appear to be cruising around on their own. Can this strange and seemingly impossible phenomenon be explained? North Carolina’s Brown Mountain is home to a strange and unexplained light show. But with so many competing theories, can science reveal the source of the mysterious dancing lights? And, tribe members in the remote mountains of Northern Mexico are known to run 18 times further than a marathon in one session – barefoot! Can science reveal the secret to this super human ability?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-02","episode_number":6,"episode_type":"standard","id":822202,"name":"Time Travel","overview":"A mysterious woman suddenly materializes in a California bathroom. Is she a traveller from another time? And could a gargantuan experiment in Switzerland actually make time travel possible? An ancient American stone structure suggests the incredible. Did pagan worshippers practice human sacrifice in New Hampshire? And, amazingly, plants seem to possess strange powers allowing them to detect human thought. Is that weird – or what?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-09","episode_number":7,"episode_type":"standard","id":822203,"name":"Human Popsicle","overview":"Beating incredible odds, a man is struck by lightning six times and survives! Is he a human lightning rod? After wandering into the eye of a winter storm, a toddler is literally frozen solid and is then thawed again without injury. How is that possible? Deep beneath the Pacific Ocean, the discovery of mysterious anchor-like stones threatens the foundations of American history. Did Chinese explorers reach American shores thousands of years before Columbus?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-16","episode_number":8,"episode_type":"standard","id":3808337,"name":"Fate Or Coincidence","overview":"A dental receptionist is shot in the chest at point blank range and amazingly, she survives. Did her breast implants save her life? In a bizarre twist of fate, a young man saves the life of a woman only to discover she saved his life seven years earlier. Is it a random coincidence, or are mysterious universal forces at work? And, around the globe, most of the world’s 1.3 billion cows are literally facing the same direction. Are they aligning themselves with the Earth’s magnetic fields?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-23","episode_number":9,"episode_type":"standard","id":3808338,"name":"Personality Transplant","overview":"After receiving a heart transplant, a patient undergoes an uncanny transformation and assumes the personality of his donor. Do human organs store memory and our very ‘essence’? Across the planet, perfect circles of ice are appearing in lakes and rivers, some so big they’re even visible from space. Can the amazing phenomenon be explained? And, a Philadelphia mum undergoes a routine DNA test that reveals she’s somehow genetically unrelated to her four children. How is that possible?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-30","episode_number":10,"episode_type":"finale","id":3808339,"name":"Mind Control War","overview":"The US Army investigates the paranormal to see if future conflicts could be fought using mind control. Do these invisible powers truly exist? A boy loses his thumb in a horrific accident only to have it grow back thanks to a mysterious magical powder. Do humans really have the power to regenerate our limbs? And, on a remote Indonesian island inhabited by Komodo dragons, archaeologists make an incredible discovery that could rewrite the history of human evolution. Did humans once share the Earth with a race of ‘hobbits’?","production_code":"","runtime":45,"season_number":1,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":47021,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5258e372760ee346617e96c2","air_date":"2011-09-12","episodes":[{"air_date":"2011-09-12","episode_number":1,"episode_type":"standard","id":822212,"name":"Alien Encounters","overview":"All over the planet, strange events suggest that aliens are among us: In Colorado, a farmer discovers a cow mysteriously mutilated by unknown forces, and it’s a phenomenon that’s been reported by farmers around the globe; a Texas man is repeatedly abducted from his bed and, like thousands of people worldwide, claims he is the subject of extraterrestrial experiments; and, in Ohio, an astronomer’s powerful telescope intercepts a mysterious message from outer space that could be the most important broadcast in history.","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-19","episode_number":2,"episode_type":"standard","id":822211,"name":"Life After Death","overview":"Three eerie stories that suggest there is indeed life after death: An emotional visit to a Civil War battlefield and a series of bizarre circumstances lead a Connecticut man to believe he is the reincarnation of a dead general; hoping to communicate with spirits and uncover genuine proof of the afterlife, scientists in England conduct a series of groundbreaking séances and what they find defies logic; and, in Haiti, a man dies after a sudden and mysterious illness but returns from the grave 20 years later!","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-26","episode_number":3,"episode_type":"standard","id":822209,"name":"Monsters","overview":"Three bizarre stories about monsters: A West Virginia town is terrorized by the ‘mothman’, a seven-foot winged demon with glowing red eyes; in Newfoundland, a fisherman discovers the remains of an unidentified sea creature on a local beach sparking theories of the monsters that lurk in the oceans’ unexplored depths; and, there’s panic in the streets of New Delhi when thousands report being attacked by the ‘monkey man’, a sinister hairy creature with metallic claws!","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Research Scientist, Canadian Department of Fisheries","credit_id":"634d1b7b12eb890082c52405","order":502,"adult":false,"gender":2,"id":3744444,"known_for_department":"Acting","name":"Garry Stenson","original_name":"Garry Stenson","popularity":1.4,"profile_path":"/sduIeHqbACF9rlVDVQqEyz6f3VI.jpg"}]},{"air_date":"2011-10-03","episode_number":4,"episode_type":"standard","id":822208,"name":"End of the World","overview":"Three incredible stories that could spell the end of human life on Earth: Decoding ancient Mayan texts, a physicist predicts a huge cataclysm will destroy the world in 2012 and believes the culprit is a deadly super-volcano lurking beneath Yellowstone National Park; a NASA scientist makes an incredible alien discovery and believes a solar storm could destroy the planet; and, one of the world’s greatest minds makes a startling prediction about a sinister robot takeover — man and machine will merge by 2050.","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-17","episode_number":5,"episode_type":"standard","id":822210,"name":"Parallel Worlds","overview":"Three incredible stories about the parallel dimensions that may exist alongside our own: While hiking in a New York state park, a woman has a terrifying encounter with a mysterious human-shaped shadow she believes is an entity from another world; in a New Jersey suburb, a weird machine transports a six-year-old boy and his father hundreds of miles in a split second; and, discovered in Belize and Mexico, perfectly-carved ancient crystal skulls are thought to be cosmic gateways to another realm.","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-24","episode_number":6,"episode_type":"standard","id":822207,"name":"Freaks of Nature","overview":"Three mysterious freaks of nature: On the East Coast of Canada, a small community is devastated by an earth-shattering ‘boom’ that leaves scientists scratching their heads; swallowing ships and planes and terrorizing sailors and pilots, a paranormal fog haunts Lake Michigan and seems to alter the very fabric of time; and, a blinding double flash of light over the Indian Ocean sends a nation into panic and forces the US government to ask some serious questions.","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-31","episode_number":7,"episode_type":"standard","id":822206,"name":"Paranormal Mysteries","overview":"Real-life ghost stories that make the paranormal come alive: Featuring strange lights, apparitions and a penchant for murder, a California woman is terrorized by an invisible attacker who turns her home into a living hell; seemingly possessed, a New England mother undergoes a violent and demonic transformation before turning to an ancient Catholic ritual for help; and, a British teenager is terrified when she is visited by her first ghost and later struggles to understand her ‘gift’.","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-07","episode_number":8,"episode_type":"standard","id":822214,"name":"Medical Mysteries","overview":"Three incredible stories where the human body reaches beyond the limits of modern medicine: When her parachute fails on her first-ever solo skydive, an Arkansas adrenaline junkie plummets to the earth but somehow she and her unborn baby survive; in upstate New York, a retired firefighter is incinerated as he lies in bed and with no plausible explanation, investigators are left with a terrifying question; seemingly able to harness electrical power, a supercharged British schoolgirl causes havoc when she drains batteries, fries appliances and causes streetlamps to flicker!","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-14","episode_number":9,"episode_type":"standard","id":822213,"name":"Power of the Mind","overview":"Three incredible stories about the untapped power of the human brain: While hearing about a murder on the radio, a Los Angeles housewife has a strange and sudden vision that eventually helps crack the case; suggesting that total recall is possible, a California man remembers every single moment from every single day of his life; and, several years after a debilitating freak accident leaves her in chronic pain, a woman visits a controversial Ohio faith healer who miraculously cures her symptoms.","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-21","episode_number":10,"episode_type":"finale","id":3808343,"name":"Ancient Mysteries","overview":"Three ancient artifacts that could turn the history of the world upside down: In a Mexican cave, a young girl finds a bizarrely-shaped thousand-year-old skull that may prove aliens once walked the planet; featuring detailed images of dinosaurs, a Peruvian doctor discovers ancient stone carvings that could rewrite the story of evolution; and, excavated from one of Cairo’s oldest pyramids, a 2000-year-old wooden model may be proof that ancient Egyptians invented modern flight.","production_code":"","runtime":45,"season_number":2,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":47022,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"5258e372760ee346617e96cd","air_date":"2012-05-28","episodes":[{"air_date":"2012-05-28","episode_number":1,"episode_type":"standard","id":822220,"name":"Amazing Survival","overview":"Three incredible stories of people who cheated death: On 9/11, a man survives impossible odds in the collapse of the World Trade Center; a Texas man is cut in two by a freak rail accident; a safari guide in Zimbabwe is savagely attacked by a hippo but lives to tell his story.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-04","episode_number":2,"episode_type":"standard","id":822222,"name":"Man Beasts","overview":"Three stories of mysterious creatures that are seemingly half-man and half-beast: a New Jersey woman and her son come face to face with the legendary Jersey Devil; a sleepy South Carolina town is terrorized by a giant reptile; in Wisconsin, a bloodthirsty werewolf-like creature appears on a remote country road.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-11","episode_number":3,"episode_type":"standard","id":822217,"name":"Aliens Walk Among Us","overview":"Three stories that suggest aliens are among us: a Mexican rancher slays a terrifying and mysterious creature; an Arizona woman claims to have been fathered by an alien; a young serviceman befriends a colony of extraterrestrials.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5e8909fb60b58d0018eb7c2b","order":500,"adult":false,"gender":0,"id":2589815,"known_for_department":"Acting","name":"Charles Hall","original_name":"Charles Hall","popularity":0.6,"profile_path":null}]},{"air_date":"2012-06-18","episode_number":4,"episode_type":"standard","id":822221,"name":"Curses","overview":"Three ghostly stories about blood-curdling curses: in Britain, a string of deadly house fires is linked to a mysterious painting; in Florida, a sinister doll ruins the lives of anyone who crosses it; and, driven by vengeful spirits, a wealthy California heiress embarks on one of the most bizarre construction jobs in history.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-25","episode_number":5,"episode_type":"standard","id":822216,"name":"Weird Animal Behaviour","overview":"Three stories about the supersensory power of animals: an octopus correctly predicts winners in the soccer World Cup; in Scotland, more than 50 dogs plunge to their deaths from the same bridge; and, a housecat makes an epic cross-country journey to find its owner.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-09","episode_number":6,"episode_type":"standard","id":822224,"name":"Ghosts in the Machine","overview":"In Florida, the pilots of a crashed plane are spotted on board Eastern Airlines; in Britain, a near-fatal attack on a boy is blamed on a painting; and, after a devastating earthquake, a New Zealand man is savagely beaten by a ghost.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-16","episode_number":7,"episode_type":"standard","id":822223,"name":"Premonitions","overview":"Three incredible stories about the predictive power of the sub-conscious: a man warns of a horrific plane crash before it happens; a child’s intuition saves his family from a volcanic eruption; and, claiming he can see the future, a California man predicts 9/11 and hurricane Katrina with uncanny accuracy.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Himself","credit_id":"5f08f3eed5ffcb003582097e","order":501,"adult":false,"gender":0,"id":2708358,"known_for_department":"Acting","name":"Louis Turi","original_name":"Louis Turi","popularity":0.6,"profile_path":null}]},{"air_date":"2012-07-23","episode_number":8,"episode_type":"standard","id":822218,"name":"Mysterious Vanishings","overview":"Baffling stories of people who disappeared without a trace: in Australia, three men mysteriously vanish from a yacht; nearly a dozen people disappear from a remote Vermont mountaintop; and, a pilot is chased by unidentified aircraft before disappearing into thin air.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-30","episode_number":9,"episode_type":"standard","id":822215,"name":"More Medical Mysteries","overview":"Three medical mysteries seemingly beyond the realm of science: A woman becomes so toxic she hospitalizes dozens of people; a man is struck by lightning and becomes a musical genius; and, a Tennessee teen cries tears of blood.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-14","episode_number":10,"episode_type":"finale","id":822219,"name":"Mind Control","overview":"Three spine-tingling stories about mind-control: a man with a mysterious implant believes aliens have been monitoring his every move; a séance turns a housewife into a literary genius; and, a California woman suspects she is the target of a sinister government experiment.","production_code":"","runtime":45,"season_number":3,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":47023,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"5258e372760ee346617e96d8","air_date":null,"episodes":[{"air_date":null,"episode_number":1,"episode_type":"standard","id":967550,"name":"Episode 1","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":2,"episode_type":"standard","id":822225,"name":"Episode 2","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":36160,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"? season 4","overview":"","id":47024,"poster_path":null,"season_number":4,"vote_average":0}}}