{"adult":false,"backdrop_path":"/rDDn1U7m9WcSGUCgod9nllRGFMH.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"2008-10-03","genres":[{"id":18,"name":"Drama"},{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"},{"id":18,"name":"Drama"}],"homepage":"http://www.linebarrels.jp/index.html","id":36248,"in_production":false,"languages":["ja"],"last_air_date":"2009-03-20","last_episode_to_air":{"id":823217,"name":"Steel Flowers","overview":"Anywhere else, Hayase Kouichi is just a normal junior high school student. However, he’s become a part of the Linebarrel, made and lost friends, and discovered the thing that he wants to protect the most. And just as Kouichi reflects upon his life up to now, Linebarrel decides to finally show its true and ultimate form!","vote_average":0,"vote_count":0,"air_date":"2009-03-20","episode_number":24,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null},"name":"Linebarrels of Iron","next_episode_to_air":null,"networks":[{"id":201,"logo_path":"/qNooLje0YQh1y3y9LUM2Y5QCtiF.png","name":"CBC","origin_country":"JP"}],"number_of_episodes":24,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"鉄のラインバレル","overview":"Centers around Kouichi Hayase, a fourteen-year-old boy living a mediocre life, until an accident turns him into the pilot of a gigantic robot called \"Linebarrel\" and leads him to encounter a mysterious girl.","popularity":10.381,"poster_path":"/ieHjmuA24mG0InX2WZH7uQ9TfEy.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"2009-08-06","episode_count":2,"id":47129,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2008-10-02","episode_count":24,"id":47128,"name":"Season 1","overview":"","poster_path":"/9meU8ajZ6CCOQJB9dQAd0otvziP.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7,"vote_count":1,"season_data":{"1":{"_id":"5258e3bd760ee346617ef4b1","air_date":"2008-10-02","episodes":[{"air_date":"2008-10-03","episode_number":1,"episode_type":"standard","id":823232,"name":"Boy And Iron","overview":"Kouichi Hayase is a high school student who is often bullied at school, but dreams of one day becoming a hero. After being bullied into buying stuff for his schoolmates, he decides to take a shortcut through a forest, which is when a giant object falls on him. After regaining consciousness, he sees a giant robot in front him and a naked girl lying beside him. He covers her with his jacket, and after waking, she is revealed to have partial amnesia and goes with him to his house. Soon after, other giant robots begins to attack the town. The girl tells Kouichi that they are enemies, and goes into town with the intent of fighting them. Following her, Kouichi encounters his friend, Hideaki Yajima, who plans to use himself as bait in order for the two to get away. After Kouichi reveals his frustration in not being able to do anything, the girl reveals her name, Emi Kizaki, and has him summon a giant robot, known as a Machina called Linebarrel. Though he defeats the enemies with his newfound power, he is shocked when Emi tells him that he is dead.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Key Animation","department":"Visual Effects","credit_id":"64a2e50711386c00adc7a8f5","adult":false,"gender":2,"id":1848300,"known_for_department":"Visual Effects","name":"Toshiharu Sugie","original_name":"Toshiharu Sugie","popularity":1.959,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"64a2e513e8d02800ff8a8ecc","adult":false,"gender":0,"id":2332820,"known_for_department":"Visual Effects","name":"Tsutomu Suzuki","original_name":"Tsutomu Suzuki","popularity":1.052,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"64a2e5308289a000caf0ef3d","adult":false,"gender":2,"id":555097,"known_for_department":"Directing","name":"Yoshimitsu Ohashi","original_name":"Yoshimitsu Ohashi","popularity":2.379,"profile_path":"/tJlHkXEuqHrj0AVi2m6NmRfTnJX.jpg"},{"job":"Key Animation","department":"Visual Effects","credit_id":"64a2e547e9da6900c7633993","adult":false,"gender":2,"id":1819244,"known_for_department":"Visual Effects","name":"Naoyuki Asano","original_name":"Naoyuki Asano","popularity":2.924,"profile_path":"/5CSW1zsVQGL1FY5ac8EYWtuEoNV.jpg"},{"job":"Key Animation","department":"Visual Effects","credit_id":"64a2e5538e20c500ae131a12","adult":false,"gender":0,"id":2160968,"known_for_department":"Visual Effects","name":"Maki Uchida","original_name":"Maki Uchida","popularity":0.6,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"64a2e56111386c00adc7a923","adult":false,"gender":1,"id":1848214,"known_for_department":"Visual Effects","name":"Kyoko Kotani","original_name":"Kyoko Kotani","popularity":2.085,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"64a2e57211386c011c3aa1b5","adult":false,"gender":2,"id":1789719,"known_for_department":"Directing","name":"Hiroyuki Okuno","original_name":"Hiroyuki Okuno","popularity":3.611,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"64a2e57e8289a000ebe421c7","adult":false,"gender":2,"id":2958528,"known_for_department":"Visual Effects","name":"Hiroshi Konno","original_name":"Hiroshi Konno","popularity":1.96,"profile_path":null}],"guest_stars":[]},{"air_date":"2008-10-10","episode_number":2,"episode_type":"standard","id":823219,"name":"Runaway Justice","overview":"At an unknown location, the Katou Organization, which belongs to an organization bent on capturing the Machina Linebarrel, and JUDA, which is publicly known for being the world's largest medical equipment maker, are engaged in a heated battle. With JUDA's forces being overpowered, they ask for reinforcements, which comes in the form of another Machina called Vardant and its pilot, Reiji Moritsugu. As he handles the enemy, the other members of JUDA are discussing the recent actions of their enemy, the Katou Organization. Meanwhile, Kouichi's family welcomes Emi into their household, and Kouichi shows his newfound abilities and confidence at school by beating those who bullied him. Later, Kouichi expresses his gratitude to Emi for having killed him, giving him a new life, after which the Katou Organization begins a new attack to lure out the Linebarrel. Kouichi is thrown into battle once again, and two of JUDA's Machinas are also in the fray in an effort to stop the enemy as well. Kouichi, however, declares that he is the only real \"justice\", and goes on to fight both sides, not realizing the collateral damage he is causing. After the Machinas retreat and Kouichi declares his job done, Emi and Yajima are stunned to see his actions and the damage he has caused.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-17","episode_number":3,"episode_type":"standard","id":823233,"name":"Blue Terror","overview":"Kouichi has caused massive damage to the town during his battle on Linebarrel fighting the secret Katou Organization. Kizaki feels guilty for getting the citizens entangled in the battle, but Kouichi himself has no such notion, truly believing that he is the hero of justice. Then, Vardant, controlled by JUDA’s ace pilot Reiji Moritsugu, appears before Kouichi.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-24","episode_number":4,"episode_type":"standard","id":823226,"name":"The Price of Justice","overview":"Having lost Linebarrel, Kouichi gives in to despair and violently takes his anger out on innocent civilians. Since he is a factor, no one can match his physical power unarmed. On behalf of Risako Niiyama who is worried about Kouichi, Yajima decides to confront Kouichi. In the pouring rain, Yajima and Kouichi engage in a fistfight, when a Hagure Machina appears before them.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-31","episode_number":5,"episode_type":"standard","id":823228,"name":"A Guide to Tomorrow","overview":"Kunio Ishigami, JUDA's president, offers Koichi a chance to join them in their fight against the Kato-Kikan, which he refuses. But when the twin pilots Shizuna and Izuna Endo get themselves in serious trouble, Kunio asks for his help.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-07","episode_number":6,"episode_type":"standard","id":823227,"name":"Bright Night","overview":"Koichi moves to a new apartment at JUDA's quarters, and is formally introduced to the other pilots. Much to his surprise, Emi also transfers to his school.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-14","episode_number":7,"episode_type":"standard","id":823220,"name":"A Disaster After School","overview":"Domyouji, one of Kouichi's classmates, starts acting over-familiar toward Kizaki. Sensing Kizaki's discomfort, Kouichi challenges Domyouji to a fight, but oddly enough, cannot even touch him. Later on, Kouichi is visited by Hisataka Katou, president of the Katou Organization, who attempts to offer him a position in the Katou Organization. It is revealed that both Kizaki and Katou are from a different dimension. Meanwhile, Risako confronts Kizaki concerning her relationship with Kouichi.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-21","episode_number":8,"episode_type":"standard","id":823234,"name":"Prankish Devils","overview":"Kouichi, Moritsugu, and Miu are given a mission to assist the retreat of a U.S. Force transportation aircraft and to exterminate the enemy there. It is the first official assignment for Kouichi. Kouichi and Moritsugu team up and take on Masaki Sugawara and Yurianne Faithful of the Katou Organization, who are leading a vast troop of Armas. Meanwhile, Miu, who is backing up the retreat of general troops on Painkiller, is attacked by a new enemy Machina.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-28","episode_number":9,"episode_type":"standard","id":823223,"name":"The Black Chamber","overview":"To find out more about the mysterious spheres the Katou Organization is deploying around the world, Kouichi and company storm one of their bases in South America. However, Yamashita leaves his position in order to help Reiji, only to receive a cold reaction from him.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Key Animation","department":"Visual Effects","credit_id":"63927df16e0d7200a3f22adf","adult":false,"gender":2,"id":1129512,"known_for_department":"Visual Effects","name":"Katsuhiko Kitada","original_name":"Katsuhiko Kitada","popularity":0.605,"profile_path":"/7P3fgI6u87S2rRC9o4puvR6AQH.jpg"}],"guest_stars":[]},{"air_date":"2008-12-05","episode_number":10,"episode_type":"standard","id":823224,"name":"Over Drive","overview":"Christmas season has arrived. Kouichi is invited to a party Risako is organizing. Kouichi finds out that the JUDA task force is also preparing a Christmas party. Unlike Kouichi, who feels unenthusiastic about this “workplace” party, it is more of a family party for most of the members who consider JUDA their home. The party mood is suddenly interrupted by the news of an American satellite weapon being taken over by the Katou Organization. This would allow the Katou Organization to attack any part of the world. Assigned to shoot down the satellite weapon, Kouichi and Yamashita head into outer space.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-12","episode_number":11,"episode_type":"standard","id":823225,"name":"Super Nova","overview":"Kouichi and Yamashita are met by a new Arma of the Katou Organization, called Yaoyorozu, in outer space. While controlling the satellite weapon, Yaoyorozu, piloted by Riku Ousei, continues its simultaneous assault on different parts of the world. Kouichi’s attempts to obliterate Yaoyorozu are thwarted by its incredible maneuverability and speed. The operation to destroy the satellite weapon from the ground also ends in failure. With no options left, even Linebarrel gets diverted off the combat zone.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-19","episode_number":12,"episode_type":"standard","id":823230,"name":"From The Tropics With Love","overview":"The members of the JUDA task force have come to a tropical island as a company outing. Thanks to the good-natured whim of Kunio Ishigami, Risako and Domyouji have also been invited to join them. Kouichi finds himself in an uncomfortable position as Domyouji asks him which is his true love interest, whether it is Risako or Kizaki. Their brief vacation is interrupted as the members go missing one by one by a mysterious, reptilian creature.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-26","episode_number":13,"episode_type":"standard","id":823231,"name":"The Dark Executioner","overview":"The tropical vacation is still the hot topic discussed between Domyouji and the task force members. Only Kizaki does not seem to share their post-vacation hype. The vacation has also left an awkward rift between Kouichi and Kizaki. Kouichi and Yamashita are summoned to a meeting and head to Ishigami’s room. At that instant, they hear a gunshot from Ishigami’s room. Finding out that Moritsugu shot Ishigami, Kouichi is eager to battle him for what he has done. After Kouichi fails to take Moritsugu, Kizaki fights in his place.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-09","episode_number":14,"episode_type":"standard","id":823235,"name":"Blood Spilt, Tears Lost","overview":"Unexpected incidents occur one after another. Ishigami is mourned for his death, and the secrets of Linebarrel are revealed, leaving Kouichi in shock and others including Yui Ogawa in distress. Meanwhile, Eiji Kiriyama, who had aligned himself with the Katou Organization, continues to tighten his control over Japan until the country virtually falls into the hands of Kiriyama and the Katou Organization. JUDA is acknowledged as the anti-national armed group and is attacked by the Jinrai brigade of the Japan Self-Defense Forces. Kouichi tries to breach their defenses with Linebarrel, which is the only working Machina left.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-16","episode_number":15,"episode_type":"standard","id":823236,"name":"Vector","overview":"Kouichi and Kizaki find a safe area and take a brief but much needed refuge. Kizaki, who is starting to regain her memory, confesses to Kouichi that she is afraid of recalling memories she had long ago lost. Seeing Kizaki desperately fighting her angst, Kouichi makes a certain resolution. However, their peace is short-lived as they are suddenly attacked by Idaten and Kagutsuchi, piloted by Takurō Sawatari and Dimitri Magarov.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-23","episode_number":16,"episode_type":"standard","id":823229,"name":"Judgment at Dusk","overview":"With a renewed sense of justice, the JUDA task force members begin their battle against the enemy. The first step is to regain JUDA which has been taken over by Kiriyama and his horde. While Kouichi diverts Kiriyama with Linebarrel, the others sneak into the facility via an emergency route. As they make their way in, they find that the facility is protected by JUDA’s state-of-the-art security system, filled with unusual stages to prove their identities as the JUDA task force members.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-30","episode_number":17,"episode_type":"standard","id":823218,"name":"The Mechanical Curse","overview":"Risako and Kouichi are puzzled when Yajima returns, trying to keep the secret of his so-called death. But behind the seemingly good comeback, Yajima reveals himself to be the pilot of Apparition, one of the new Machinas of the Katou Organization, before the rest of JUDA during their party. He later kidnaps Kizaki, fulfilling a mission from Katou.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-06","episode_number":18,"episode_type":"standard","id":823214,"name":"Memento Mori","overview":"Following Yajima's instructions, Kouichi reaches an abandoned Russian base in search for Kizaki, but it was only Katou who was waiting for him there. Meanwhile, Yajima questions Kizaki about her feelings for Kouichi and the rest of the JUDA team struggles to protect Misaki Town from an invasion from the enemy.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-13","episode_number":19,"episode_type":"standard","id":823216,"name":"The Reaching Sun, the Raging Shadow","overview":"Glain-Neidr, piloted by Masaki, appears in Misaki Town and starts to install the last Sphere. Miu, Yamashita, and the Jinrai brigade, led by Domyouji, return fire, but are no match. Meanwhile, Kouichi rescues Kizaki and heads back to the JUDA headquarters, to which he is stopped by Yajima. Yajima insists that Kouichi stop fighting and return to Risako. The two are unable to reconcile. On the beach in the pouring rain, Yajima and Kouichi exchange blows using Linebarrel and Apparition.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-20","episode_number":20,"episode_type":"standard","id":823221,"name":"Man of Destiny","overview":"Since the last battle, Miu's slump hasn't gone away and with PAINKILLER unable to advance, has further prolonged her state. Miu' reckless drive to train, has left her body and spirit broken. Miu finally cheers up when Kouichi comes to visit... Meanwhile, KATO-KIKAN has set up Spheres throughout the world on a large-scale trajectory to open up a multidimensional invasion. It's up to Shizuna and Izuna to convince the UN to take action...but will they listen?","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-27","episode_number":21,"episode_type":"standard","id":823222,"name":"Wings of Madness","overview":"The JUDA Corporation is now responsible in holding back the launch of the Spheres installed. However, Yamashita has a different mobilization unit out, after receiving a letter designating him to fulfill a special duty surrounding a secret reunion around the base of Mount Fuji near the Aokigahara Sea of Trees. It is there and then that Yamashita must face off against Moritsugu. Meanwhile, the rest of the JUDA members are shocked to that Kiriyama is still alive, as he demonstrates his newfound power in an attempt to obliterate them.","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-06","episode_number":22,"episode_type":"standard","id":823213,"name":"He Who Eats Demons","overview":"Standing in Koichi’s way is none other than his nemesis: Moritsugu Reiji. Blasting forward, Moritsugu is prepared to show Koichi and company their inexperience and lack of power, compared to his. Unable to gain enough power and strength against Moritsugu, Koichi is left almost helpless. As Vardant’s violent battle ensues, will Linebarrel be able to show off its power?","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-13","episode_number":23,"episode_type":"standard","id":823215,"name":"How You Die Decides How You Live","overview":"The enemy invasion has begun and it’s up to Kouichi and his team to defend the earth. Kouichi and his Linebarrel take it upon themselves to drive the invaders into the space-time continuum and back into their respective dimension. As Kouichi and his Linebarrel blast off into space, Kizaki initiates a surprise attack against the infiltrators…","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-20","episode_number":24,"episode_type":"finale","id":823217,"name":"Steel Flowers","overview":"Anywhere else, Hayase Kouichi is just a normal junior high school student. However, he’s become a part of the Linebarrel, made and lost friends, and discovered the thing that he wants to protect the most. And just as Kouichi reflects upon his life up to now, Linebarrel decides to finally show its true and ultimate form!","production_code":"","runtime":30,"season_number":1,"show_id":36248,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":47128,"poster_path":"/9meU8ajZ6CCOQJB9dQAd0otvziP.jpg","season_number":1,"vote_average":0}}}