{"adult":false,"backdrop_path":"/z8U5TieGteOtukxxAvruqdeQNjh.jpg","created_by":[{"id":1229051,"credit_id":"5257554e19c29531db12f01e","name":"Kieran Prendiville","gender":0,"profile_path":null}],"episode_run_time":[50],"first_air_date":"1996-02-11","genres":[{"id":35,"name":"Comedy"},{"id":18,"name":"Drama"}],"homepage":"http://www.world-productions.com/wp/content/shows/ballyk/ballyk.htm","id":3734,"in_production":false,"languages":["en"],"last_air_date":"2001-04-15","last_episode_to_air":{"id":262041,"name":"Smoke Signals","overview":"Father Mac is outraged when he learns that Vincent has married Barry and Lyn, and to make matters worse the Bishop has found out as well. Also, the bank has foreclosed on the priest's house, so Vincent is forced to find a place to sleep in various places. Meanwhile, Louis's dog is unwell, and when Siobhan seeks to find out why she finds some strange plants on the mountain, which attracts the interest of both Doc Ryan and Frankie. And then there's Liam, the cool dude....!","vote_average":0,"vote_count":0,"air_date":"2001-04-15","episode_number":8,"episode_type":"finale","production_code":"","runtime":50,"season_number":6,"show_id":3734,"still_path":"/37xA7mq3pk3qkX2APAWj7nIieFr.jpg"},"name":"Ballykissangel","next_episode_to_air":null,"networks":[{"id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","name":"BBC One","origin_country":"GB"}],"number_of_episodes":57,"number_of_seasons":6,"origin_country":["GB"],"original_language":"en","original_name":"Ballykissangel","overview":"Ballykissangel is a BBC television drama set in Ireland, produced in-house by BBC Northern Ireland. The original story revolved around a young English Roman Catholic priest as he became part of a rural community. It ran for six series, which were first broadcast on BBC One in the United Kingdom from 1996 to 2001.","popularity":69.363,"poster_path":"/dZUfIrlXUXcptaTGNqy2jc5DGyA.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":null,"episode_count":5,"id":11176,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"1996-02-11","episode_count":6,"id":11171,"name":"Season 1","overview":"","poster_path":"/8xFV6Ln1t30uGbDzbedA1RpslkW.jpg","season_number":1,"vote_average":0},{"air_date":"1997-01-05","episode_count":8,"id":11170,"name":"Season 2","overview":"","poster_path":"/wao0VUWBzmnIvMRBQpvuUQ3O8e1.jpg","season_number":2,"vote_average":0},{"air_date":"1998-03-01","episode_count":11,"id":11175,"name":"Season 3","overview":"","poster_path":"/3Y7KwG8xVd2O5nWRBVprqzwajdI.jpg","season_number":3,"vote_average":0},{"air_date":"1998-09-20","episode_count":12,"id":11174,"name":"Season 4","overview":"","poster_path":"/jRpf0YR0S4wfqlTsVWK2O4dG25L.jpg","season_number":4,"vote_average":0},{"air_date":"1999-09-26","episode_count":12,"id":11173,"name":"Season 5","overview":"","poster_path":"/uVjoOQk4xaLAxHq9rr0MhBfHmgi.jpg","season_number":5,"vote_average":0},{"air_date":"2001-03-01","episode_count":8,"id":11172,"name":"Season 6","overview":"","poster_path":"/xRCpiQnuKumyUzk3fvrjmUQWRBZ.jpg","season_number":6,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.9,"vote_count":8,"season_data":{"1":{"_id":"5257553f19c29531db12e46a","air_date":"1996-02-11","episodes":[{"air_date":"1996-02-11","episode_number":1,"episode_type":"standard","id":262019,"name":"Trying to Connect You","overview":"Father Peter Clifford's journey from England ends in his new parish, the small Irish town of Ballykissangel. It's a change from his previous job in the centre of Manchester, but this rural Irish community is hardly the sleepy village he expected.\n\nThe local bar owner, Assumpta Fitzgerald, seems to have a serious attitude towards the clergy, and is very surprised to discover that the man she offers a lift to is the new parish curate. Niamh wants to know what her boyfriend, the local Garda, will be like to live with when they get married. She is determined to have the two of them live together beforehand, but he does not want to commit a \"\"mortal sin\"\". Both seek advice from the new priest. As Father Clifford arrives, a new modern confessional is being delivered. Niamh's father, Brian Quigley, who seems to think that a fax-equipped confessional will be a great addition to the church, has donated it.","production_code":"","runtime":50,"season_number":1,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null},{"department":"Directing","job":"Director","credit_id":"5257554419c29531db12e683","adult":false,"gender":2,"id":1212186,"known_for_department":"Directing","name":"Richard Standeven","original_name":"Richard Standeven","popularity":1.831,"profile_path":null}],"guest_stars":[]},{"air_date":"1996-02-18","episode_number":2,"episode_type":"standard","id":262020,"name":"The Things We Do for Love","overview":"As Peter Clifford settles into his new parish, Brian Quigley's holiday home development seems stalled by a young couple living in a caravan near to the site. Peter gets involved when he hears that Brian is responsible for their baby's illness. He appears to have ordered \"\"organic fertiliser\"\" to be dumped beside their caravan.\n\nBut Peter has his own problems. His past catches up with him in the shape of Jennie, a former parishioner who thinks he once had feelings for her. She follows him from Manchester and arrives in BallyK as he is trying to establish himself in the parish.\n\nThe young couple in the caravan need to move, and in an effort to get some money together for them, the BallyK vet, Siobhan, suggests that they bet against their own side in the next Gaelic football match . . . a match in which Peter is the reserve goalkeeper.","production_code":"","runtime":50,"season_number":1,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null},{"department":"Directing","job":"Director","credit_id":"5257554419c29531db12e683","adult":false,"gender":2,"id":1212186,"known_for_department":"Directing","name":"Richard Standeven","original_name":"Richard Standeven","popularity":1.831,"profile_path":null}],"guest_stars":[{"character":"Jenny Clark","credit_id":"5257554419c29531db12e6bc","order":502,"adult":false,"gender":1,"id":17286,"known_for_department":"Acting","name":"Lena Headey","original_name":"Lena Headey","popularity":38.268,"profile_path":"/rKoDN3VOIkvoubUsuYXgMe93hJW.jpg"}]},{"air_date":"1996-02-25","episode_number":3,"episode_type":"standard","id":262024,"name":"Live in My Heart and Pay No Rent","overview":"Niamh's wedding plans are disrupted when a stone statue falls off the church and through her fiancee's car. As he had only just got out of the car he takes it as a sign that he should become a priest. Peter tries to talk him out of it, but Ambrose calls off the engagement. Niamh has other problems to deal with, as she becomes disgusted at the idea of her father meeting up with an ex-girlfriend.\n\nLocal Hill farmer, Eamonn, attempts to provide evidence of his elusive sheep to the European Union, in order to get his subsidy, by constructing wooden sheep. Niamh decides she wants her wedding reception to go ahead, even if she's not having the wedding. 'Hardly a Wedding reception' results in large sales of stout which Assumpta was given without charge, and after a little intervention by Peter, Ambrose gatecrashes the party and Proposes to Niamh.","production_code":"","runtime":50,"season_number":1,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[]},{"air_date":"1996-03-03","episode_number":4,"episode_type":"standard","id":262026,"name":"Fallen Angel","overview":"Angel FM, a pirate radio station in the village, keeps Ambrose busy, while Father Peter is told he must get his own transport or lose his job. Assumpta gives him driving lessons which prove to be a little more dangerous than she anticipated.\n\nWhilst on a hospital visit, Peter meets a former judge, Michael Bradley, who has a low opinion of the church. Peter befriends him but is shocked when Mr Bradley tells him that he helped his wife to die. The young priest turns to Father Mac for advice, but during the conversation it emerges that the driving test that he is about to take will be fixed. Peter takes the test as Mr Clifford, rather than Father Peter, and passes. He triumphantly returns to the town only to be told that Michael Bradley has died. When he returns to the hospital, he is given a set of keys to a sleek vintage car that Bradley has left to him.","production_code":"","runtime":50,"season_number":1,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-03-10","episode_number":5,"episode_type":"standard","id":262022,"name":"The Power and the Gory","overview":"Brian Quigley is persuaded to stand for election against Sean Dooley, after the death of the local representative to the Irish Parliament - The Dail. Brian pays for a replacement church bell, something that Peter is right to be suspicious of. Niamh is also unimpressed by her father's reluctance to pay for her wedding reception. A television crew arrives to cover the election, and the reporter turns out to be Assumpta's ex-boyfriend, Leo McGarvey, who is still in love with her.\n\nLiam and Donal, Brian's workmen, find on Brian's building site - a skeleton. While Ambrose is tempted to press charges against Brian, Peter suggests that they shouldn't postpone the wedding any longer, and if Brian is willing to pay for it, Ambrose could drop the charges.\n\nDooley wins the election, but Father Mac and Brian are not disappointed - this means that Dooley will be off to Dublin, and out of their way. Leo gives up chasing Assumpta, but suggests that she has feelings for Peter.","production_code":"","runtime":50,"season_number":1,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e6ff","order":503,"adult":false,"gender":2,"id":34715,"known_for_department":"Acting","name":"James Nesbitt","original_name":"James Nesbitt","popularity":10.603,"profile_path":"/gdbR1DhI7dOi027mQgnWwYgYGxj.jpg"}]},{"air_date":"1996-03-17","episode_number":6,"episode_type":"finale","id":262027,"name":"Missing You Already","overview":"Father Peter is told that he must return to England, but the BallyK community is determined to put a stop to that idea\n\nIn the meantime, Brian is working overtime on a range of gimmicks designed to attract visitors to BallyK. The plan, which is causing most concern to Siobhan, is the idea of putting a live sheep at the top of some scaffolding - which Brian plans to crown in a ceremony. Siobhan makes a rescue attempt, which Peter and Assumpta inevitably get involved in.\n\nPlans for Niamh's and Ambrose's wedding are overshadowed by Brian's other venture - a three-day licence for a makeshift pub which is taking most of Assumpta's business.","production_code":"","runtime":50,"season_number":1,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[]}],"name":"Season 1","overview":"","id":11171,"poster_path":"/8xFV6Ln1t30uGbDzbedA1RpslkW.jpg","season_number":1,"vote_average":0},"2":{"_id":"5257553f19c29531db12e45c","air_date":"1997-01-05","episodes":[{"air_date":"1997-01-05","episode_number":1,"episode_type":"standard","id":262004,"name":"For One Night Only","overview":"Assumpta doesn't hold a very high opinion of the church. In the annual slave auction she is sold to Father Mac who does not hold a very high opinion of Assumpta. As a result, she has to provide accommodation for two visiting parish priests and a Bishop. Father Mac is less than impressed when he finds Father Peter pulling pints as Assumpta's slave.\n\nA musician, Enda O'Sullivan, moves into BallyK and is cast as Assumpta's love interest in the village play. Niamh is thrilled and thinks Assumpta should go out with him. Enda's ankle is injured during rehearsals and Peter is brought in to replace him, which leads to a compromising situation witnessed by Father Mac. Brian refuses to fund the play unless Enda plays the lead role. With a little help from Dr Ryan Enda is back on his feet in time for the opening night - much to Peter's disappointment.","production_code":"","runtime":50,"season_number":2,"show_id":3734,"still_path":"/9dHZDIfpMI52IPyVPrkUlRPzcKd.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-01-12","episode_number":2,"episode_type":"standard","id":262000,"name":"River Dance","overview":"Local school teacher, Brendan, faces losing his job because of falling numbers at the National School in BallyK But parents and fiends discover that Father Mac is responsible for the decision, and so they rally round to save their favourite teacher.\n\nHaving seen Enda panning for gold in the River Angel, Liam and Donal decide that they can exploit the situation. They create a shrine on the riverbank and tourists pay to hear tales of the Angel's abundant gold. However, Peter is less than impressed with the tacky statue of the Blessed Virgin, with its glowing heart.\n\nNiamh's and Ambrose's attempts to conceive are exhausting Ambrose, but the regulars at Fitzgerald's are amused that he is constantly called on to do his duty. Enda sends his son to the BallyK National School, thus making up the number of pupils, and Brendan's job is safe. Niamh finally announces that she is pregnant.","production_code":"","runtime":50,"season_number":2,"show_id":3734,"still_path":"/lHPC1K5kA4S2lJIfM1R0xhS7Flb.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-01-19","episode_number":3,"episode_type":"standard","id":261999,"name":"In the Can","overview":"Brian makes a video to attract American tourists to Ballykissangel, but the locals' acting skills are tested to the limit - and it's not a pretty sight. Niamh's food cravings are taking their toll on Ambrose, whilst her father is impressed when she dishes up tripe casserole for dinner.\n\nAssumpta finally gives in to Niamh's matchmaking attempts and goes on a date with Enda, only to discover that his baby-sitter's feelings for him are more than platonic. Meanwhile, Peter causes a stir with his plans for a folk Mass.","production_code":"","runtime":50,"season_number":2,"show_id":3734,"still_path":"/ta9ZNnpibZdP3s6k4Xxo3UdIjAc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-01-26","episode_number":4,"episode_type":"standard","id":262006,"name":"The Facts of Life","overview":"A baby that has been abandoned on Peter's doorstep cause him and Assumpta a sleepless night. As the hunt continues for the baby's mother, Peter organises a 'sex talk' for the local youths. Unsurprisingly, Father Mac does not approve.\n\nAfter only a few weeks pregnancy, Niamh miscarries. Husband Ambrose is on bed rest after slipping on a bar of soap in the bath, and his replacement, Garda McMullen, is demanding to say the least. Brian begins to bribe the new Garda in order to complete an illegal part of his latest business venture. Superintendent Foley is impressed with McMullen's performance, but is concerned about Ambrose's and Brian's relationship; so he plans to post Ambrose to an inner-city job. It's only when Brian discusses the bribes with McMullen in front of the Superintendent that the truth emerges and McMullen is moved on.","production_code":"","runtime":50,"season_number":2,"show_id":3734,"still_path":"/kWYy5pBwiPTHzKTnY85skqPyqf4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5257554219c29531db12e57a","order":500,"adult":false,"gender":1,"id":1003411,"known_for_department":"Acting","name":"Helen Norton","original_name":"Helen Norton","popularity":1.599,"profile_path":"/2CaNGn9F5b19dbf5Z17ZVHHYQXw.jpg"}]},{"air_date":"1997-02-02","episode_number":5,"episode_type":"standard","id":262010,"name":"Someone to Watch over Me","overview":"Every village has a busybody, and Kathleen is best places in BallyK. As the owner of the grocery shop she keeps track of everybody's business. Her cousin Nora Harrigan takes a job as Brian's housekeeper, which immediately upsets Niamh. Brian is well aware that Nora finds him attractive.\n\nNiamh is still getting over the loss of her baby, but everyone seems to forget that it was also Ambrose's child. Brendan's new pupils prove to be the perfect distraction for Niamh as she controls the disruptive crowd as only she can.\n\nBrian's life is now entirely organised by Nora and he's starting to feel hen-pecked. He discovers that Nora's previous two husbands died and is worried that she wants him to be number three. She mistakenly makes a move on Father Mac in the sauna and he tells Brian to get rid of her.","production_code":"","runtime":50,"season_number":2,"show_id":3734,"still_path":"/8AhTCvaPrcDMh3U3UxepLCFpQ8U.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554219c29531db12e5b8","adult":false,"gender":0,"id":1229336,"known_for_department":"Directing","name":"Dermot Boyd","original_name":"Dermot Boyd","popularity":0.974,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-02-09","episode_number":6,"episode_type":"standard","id":262012,"name":"Only Skin Deep","overview":"Brian is organising a beauty contest as part of the village festival, to find the new model for a bottled water company. Every entrant has to be local. Eamonn stuns the town by introducing his niece, Naomi. She's from Dublin and finds the rural life dull. After a bit of detective work by Siobhan it transpires that Naomi is the daughter of a shipping firm owner. Brian wanted the contract so in order to get her into the contract he brought her in as Eamonn's BallyK-born niece. Her father is not impressed when a local girl wins the contest.\n\nAmbrose unexpectedly befriends the school's worst troublemaker and persuades him to do an act at the festival. After an argument with Brian Siobhan is comforted by Brendan. When he wakes up in her bed the next morning he is worried what she will want out of the relationship.","production_code":"","runtime":50,"season_number":2,"show_id":3734,"still_path":"/hTCGTnIGzOQZvY2KstJhsPbJxRU.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554219c29531db12e5b8","adult":false,"gender":0,"id":1229336,"known_for_department":"Directing","name":"Dermot Boyd","original_name":"Dermot Boyd","popularity":0.974,"profile_path":null}],"guest_stars":[]},{"air_date":"1997-02-16","episode_number":7,"episode_type":"standard","id":262013,"name":"Money, Money, Money","overview":"Kathleen's house goes up in flames and as she has no insurance the villagers start a collection, although Peter is hard pressed to find any money, given Father Mac's constant demands on his income.\n\nWhen the collection falls a long way short Siobhan suggests betting on a dog race to boost the total. Brian is told about a scam at the race by an old acquaintance. The amount of money he stands to win is irresistible. Peter receives some information during confession, and the money is placed on the wrong dog. Brian has also been tricked.\n\nThe villager's last resort is a poker tournament. It's a big gamble, but the only way to get the money back. Brian's adversary, Mossy Phelan, plays in the tournament and Siobhan represents the village and after a long night only Siobhan and Mossy are left and Brian saves the day by throwing in a cheque allowing Siobhan to win.\n\nKathleen returns to her restored house, but despite the huge efforts by the village she remains convinced that Father Mac paid for i","production_code":"","runtime":50,"season_number":2,"show_id":3734,"still_path":"/uRg5X3iX5F8ULTacA9txL2x9Oyq.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554219c29531db12e5b8","adult":false,"gender":0,"id":1229336,"known_for_department":"Directing","name":"Dermot Boyd","original_name":"Dermot Boyd","popularity":0.974,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257554419c29531db12e625","order":501,"adult":false,"gender":2,"id":1234611,"known_for_department":"Acting","name":"Garrett Keogh","original_name":"Garrett Keogh","popularity":1.534,"profile_path":null}]},{"air_date":"1997-02-23","episode_number":8,"episode_type":"finale","id":262011,"name":"Chinese Whispers","overview":"Two mysterious strangers have the villagers intrigued. They come to the conclusion that they are revenue men, and everyone apparently has something to hide: Eamonn has been using farm diesel in his car; Father Mac has concerns about his finances; and Assumpta persuades Peter to hide her stash of duty free lager.\n\nAssumpta's problems have been mounting up and she tells Niamh that she might leave the village to run a wine bar in Dublin. Peter is upset that she didn't talk to him first. Everyone's minds are put at rest when the strangers are revealed to be fraud investigators who are arresting Sean Dooley for bribery and corruption.\n\nNiamh reveals that she is pregnant again, and the party that follows uses up Assumpta's tax-free lager.","production_code":"","runtime":50,"season_number":2,"show_id":3734,"still_path":"/fE9ZiSz5dojaA6Sb2DZcRUw0bmc.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554219c29531db12e5b8","adult":false,"gender":0,"id":1229336,"known_for_department":"Directing","name":"Dermot Boyd","original_name":"Dermot Boyd","popularity":0.974,"profile_path":null}],"guest_stars":[]}],"name":"Season 2","overview":"","id":11170,"poster_path":"/wao0VUWBzmnIvMRBQpvuUQ3O8e1.jpg","season_number":2,"vote_average":0},"3":{"_id":"5257554019c29531db12e4a2","air_date":"1998-03-01","episodes":[{"air_date":"1998-03-01","episode_number":1,"episode_type":"standard","id":262082,"name":"When a Child Is Born","overview":"With the birth of Niamh's baby approaching the last thing she needs is a stressful visit from Ambrose's mother, Imelda.\n\nKathleen discovers a miracle at the church 0 a statue has started to sweat. Within hours the town is filled with people and Peter is suspicious that several residents stand to gain from the 'miracle': Assumpta's doing good business at the pub; Padraig's got his first scoop for the local paper; Liam's and Donal's fast-food van is doing a roaring trade; and father Mac is happy to see the donations increase.\n\nPadraig's journalistic talent is also put to good use trying to find out what Brian is up to. He's buying land from Eamonn, but he also wants two access roads and he's not saying why.\n\nThe 'sweat' on the statue is finally identified as chip fat, and Peter gives Liam and Donal an angry lecture on the evils of exploiting the church for their own gain.\n\nAmbrose's mother is sent home on the advice of Dr Ryan, but Niamh gives birth in the car on the way back, with Ambrose d","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-03-08","episode_number":2,"episode_type":"standard","id":262080,"name":"Changing Times!","overview":"Brian's latest business venture to attract Korean investors involves bulldozing a local beauty spot. It's not something the locals are going to allow without a fight and they stage a protest on the site. Peter initially refuses to take sides in the protest, but Assumpta accuses him of sitting on the fence. He eventually realises that she is right - not only about Brian's plans but also about hiding his feelings.\n\nAssumpta and Peter are left alone on the site one night, and it leads to Peter finally hinting at his feelings for her. But later, he tells her he's still a priest - he's going on retreat and Assumpta makes a major decision.\n\nDonal and his girlfriend, Sue Ellen, inspire a romantic streak in Eamonn, who sets his sights on Kathleen. She's not an easy target, but he's groomed and rehearsed by Sue Ellen before he goes to talk to her.\n\nNiamh persuades her father to leave the beauty spot alone.","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554219c29531db12e5b8","adult":false,"gender":0,"id":1229336,"known_for_department":"Directing","name":"Dermot Boyd","original_name":"Dermot Boyd","popularity":0.974,"profile_path":null}],"guest_stars":[]},{"air_date":"1998-03-15","episode_number":3,"episode_type":"standard","id":262081,"name":"Stardust in Your Eyes","overview":"With Assumpta on a break in London, Niamh is left to look after the pub, but the new baby is taking it's toll her and she agrees to let Ambrose's mother Imelda help her.\n\nBrian is still trying to bring Korean business to BallyK, but it involves the assistance of the whole community, which could be a problem. Brendan is concerned that the children will be exploited. The Koreans are impressed, but despite his best efforts Brian loses the deal. All his finances were tied up in the deal and he now faces bankruptcy.\n\nDespite the collapse of the deal, the 1950s party in Padraig's ballroom is a great success.","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554219c29531db12e5b8","adult":false,"gender":0,"id":1229336,"known_for_department":"Directing","name":"Dermot Boyd","original_name":"Dermot Boyd","popularity":0.974,"profile_path":null}],"guest_stars":[]},{"air_date":"1998-03-22","episode_number":4,"episode_type":"standard","id":262077,"name":"The Fortune in Men's Eyes","overview":"Brian is depressed but not defeated after the loss of a major investment. The bank has repossessed his house and car, and when he learns that Ambrose's mother has quite a bit of money tucked away his attitude towards her changes completely. While Niamh doubts his interest in her will come to anything, Ambrose is convinced that marriage could be on the horizon. Imelda refuses to let Brian have all her money, but does help him out with a smaller amount.\n\nDonal and Sue Ellen are also heading for marriage, but Brian's losses mean laying off Liam and Donal. The strength of their friendship is tested to the limit after Liam sees Sue Ellen two-timing Donal with a richer man.\n\nWith father Peter on an enforced retreat, Father Mac decides to prove that accurate at Ballykissangel is unnecessary, but he is soon proved very wrong.","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554219c29531db12e5b8","adult":false,"gender":0,"id":1229336,"known_for_department":"Directing","name":"Dermot Boyd","original_name":"Dermot Boyd","popularity":0.974,"profile_path":null}],"guest_stars":[]},{"air_date":"1998-03-29","episode_number":5,"episode_type":"standard","id":262078,"name":"I Know When I'm Not Wanted","overview":"Peter returns to BallyK to discover a pair of scantily clad young women in his house. It transpires that Brian's bankruptcy has forced him to rent out the house. There is much worse to come when Assumpta gets back to the pub with her new husband, Leo McGarvey, in tow. It's a shock for Peter, but he takes particular offence that she didn't tell him about it.\n\nPeter distracts himself by organising a pub quiz against a rival team from Cildargan. All the relationships in the village seem to have broken down while he's been away, and it needs something to bring them together. Surprisingly, Donal saves the day with his newfound interest in philosophy. It helps to restore the community spirit, but doesn't solve Peter's problems.\n\nAmbrose's investigations into a string of burglaries ends when he makes an arrest during one of Kieran's sleepless nights.","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e6ff","order":503,"adult":false,"gender":2,"id":34715,"known_for_department":"Acting","name":"James Nesbitt","original_name":"James Nesbitt","popularity":10.603,"profile_path":"/gdbR1DhI7dOi027mQgnWwYgYGxj.jpg"}]},{"air_date":"1998-04-05","episode_number":6,"episode_type":"standard","id":262086,"name":"Personal Call","overview":"Assumpta's marriage isn't going well. Leo is finding it difficult settling in and an article written he is writing confirms Assumpta's suspicions. Peter can see there are problems but manages to keep out of it, although Leo knows there is more to Assumpta's relationship with the priest than meets the eye.\n\nPeter blames himself when Father Mac has a heart attack, and he makes up for it by helping to keep the condition a secret from the parishioners.\n\nAssumpta starts a women's group because she feels that the women in the area aren't assertive enough. Kathleen takes particular offence, but Niamh seems to have got the hang of assertiveness without too much help. She offers to lend her father money to help him out of his financial problems, but there are strings attached.","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554219c29531db12e5b8","adult":false,"gender":0,"id":1229336,"known_for_department":"Directing","name":"Dermot Boyd","original_name":"Dermot Boyd","popularity":0.974,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e6ff","order":503,"adult":false,"gender":2,"id":34715,"known_for_department":"Acting","name":"James Nesbitt","original_name":"James Nesbitt","popularity":10.603,"profile_path":"/gdbR1DhI7dOi027mQgnWwYgYGxj.jpg"}]},{"air_date":"1998-04-12","episode_number":7,"episode_type":"standard","id":262091,"name":"Lost Sheep","overview":"A young woman arrives in BallyK hoping to find news of her family. Kathleen and Father Mac are particularly uncomfortable around her and Padraig thinks he might be the girl's father, but his suspicions are unfounded.\n\nParenthood is also an issue for Siobhan who finds out she is pregnant. Brendan is the father, but she won't tell him until she's worked out what she's going to do. After much contemplation she decides to keep the baby and tells Brendan.\n\nAssumpta's and Leo's marriage continues to flounder: Leo feels isolated in BallyK. Any glamour he may have envisaged in running a pub has long since disappeared and Assumpta is keeping him at arms length. She feels they missed their chance the first time around, but Leo remains adamant - he's only ever loved her. He leaves town having told Peter that trying to make his marriage work is a waste of time because Assumpta's still interested in someone else.","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554219c29531db12e5b8","adult":false,"gender":0,"id":1229336,"known_for_department":"Directing","name":"Dermot Boyd","original_name":"Dermot Boyd","popularity":0.974,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e6ff","order":503,"adult":false,"gender":2,"id":34715,"known_for_department":"Acting","name":"James Nesbitt","original_name":"James Nesbitt","popularity":10.603,"profile_path":"/gdbR1DhI7dOi027mQgnWwYgYGxj.jpg"}]},{"air_date":"1998-04-19","episode_number":8,"episode_type":"standard","id":262088,"name":"The Waiting Game","overview":"The town catches lottery fever after it is announced that the winner bought the Lotto ticket in Kathleen's shop. The win is worth £6 million. Nobody knows who it is and the normally calm community begin to suspect each other.\n\nAmbrose's latest mission is an undercover job in Cildargan. It's a dangerous task and Niamh's worries are entirely justified.\n\nPeter is visiting his dying mother in Manchester and Father Mac's superiors are desperate for him to find the lottery winner so that the church can benefit from the win, a suggestion which appals him. In fact, the whole town has become engulfed in greed and jealousy. It is finally revealed that the winner was a tourist.\n\nSiobhan and Brendan begin to come to terms with their new relationship.","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-04-26","episode_number":9,"episode_type":"standard","id":262084,"name":"Pack Up Your Troubles","overview":"Assumpta returns from talking to Leo in Dublin and is upset to discover that Peter's mother is dying and he is visiting her in England. Brian finally has some money and starts up his new business - paint balling weekends designed to motivate businessmen. The teams end up rampaging all over the village and one ends up being shot by Eamonn for trespassing on his land. Siobhan and Brendan's news finally becomes public when she can't treat Eamonn's sheep because it's a risk to the baby. Peter's mother has died and Dr Ryan asks Assumpta to 'phone him.","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-05-03","episode_number":10,"episode_type":"standard","id":262085,"name":"The Reckoning","overview":"Peter returns to BallyK with a lot of things on his mind. Ambrose catches him, and most of the regulars, at Fitzgerald's after hours, and all face charges. Assumpta's pleas that it was a private party fall on deaf ears.\n\nAssumpta and Peter are double-booked to baby-sit for Kieran, and it gives Peter the opportunity to tell her how he feels. She wants to know exactly what he wants, but it is clear that he still doesn't know himself.\n\nThe pub regulars are let off the hook after it is revealed that they were only drinking cans bought from Kathleen's shop.\n\nPeter and Assumpta discuss their situation again, and Peter takes time to make his decision. A disparaging remark about Assumpta, made by Father Mac, helps Peter to make up his mind. He wants Assumpta, whatever it takes. They make plans for him to leave the priesthood and work at the pub.\n\nBut tragedy strikes at the pub, that night. Assumpta has been having problems with the fuse box and she is electrocuted as the lights fail again. Father","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[{"character":"Hairy Head","credit_id":"571cf5ecc3a3685d2600032f","order":507,"adult":false,"gender":2,"id":63362,"known_for_department":"Acting","name":"Ned Dennehy","original_name":"Ned Dennehy","popularity":21.531,"profile_path":"/wTacXk4meFOJRK38rED0lrhlLw3.jpg"}]},{"air_date":"1998-05-04","episode_number":11,"episode_type":"finale","id":262089,"name":"Amongst Friends","overview":"Peter says a final goodbye to Assumpta and takes off on a long walk. Ambrose eventually finds him at the statue of the Blessed Virgin where he and Assumpta once met and talked. Ambrose is angry that Peter seems to think that he is the only one who is grieving. He went to school with her, and every person in BallyK had something to do with her upbringing. He takes Peter home where Father Mac, who wants to know whether Peter will be staying with the Church, confronts him. It's not something Peter wants to think about.\n\nA journalist is trying to dig up some dirt about Assumpta, but is blocked at every turn by her friends.\n\nPeter organises a wake on the hillside, and the next day he conducts Kieran's christening. Afterwards, he leaves the town without saying goodbye to anyone but Brendan. He takes one look back at the village and leaves in much the same way that he arrived.","production_code":"","runtime":50,"season_number":3,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[]}],"name":"Season 3","overview":"","id":11175,"poster_path":"/3Y7KwG8xVd2O5nWRBVprqzwajdI.jpg","season_number":3,"vote_average":0},"4":{"_id":"5257553f19c29531db12e494","air_date":"1998-09-20","episodes":[{"air_date":"1998-09-20","episode_number":1,"episode_type":"standard","id":262066,"name":"All Bar One","overview":"Fitzgerald's is waiting for its new owner and there are plenty of prospective bidders: Brian wants Niamh to run it; but his main competition is Bella Mooney, who wants to turn the pub into an upmarket bar. Liam and Donal are put to work trying to sabotage the other bids, which they manage to quite successfully. . . with one exception. After a last minute change of heart the pub is sold to Brian.\n\nSean Dillon returns to BallyK after twenty years, and his appearance reawakens some deep feelings in the locals.\n\nMeanwhile, a stranger awaits the arrival of her brother - the new priest, a former monk.","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554719c29531db12ea9a","adult":false,"gender":2,"id":1221055,"known_for_department":"Directing","name":"Chris Clough","original_name":"Chris Clough","popularity":1.4,"profile_path":null}],"guest_stars":[]},{"air_date":"1998-09-27","episode_number":2,"episode_type":"standard","id":262064,"name":"He Healeth the Sick","overview":"Father Aidan's alleged healing hands land him in trouble when it transpires that the woman he helped is making a fraudulent compensation claim for her injuries. He appeals to her conscience to get her to withdraw the claim.\n\nNiamh is disgusted when Brian changes the pub's name in an effort to appeal more to the tourists. She walks out and leaves him surrounded by irate customers. He makes allowances for her family life, which eventually brings her back, but Ambrose is not happy.\n\nSean's compassion for an injured fox puts him in Eamonn's bad books, and Padraig is influenced by past events - Sean owns Padraig's family's land.","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-10-04","episode_number":3,"episode_type":"standard","id":262067,"name":"Bread and Water","overview":"With the birth of Siobhan's baby approaching she starts to look at all her options for the big event, but Brendan is disturbed when she decides on a water birth.\n\nSean's daughter, Emma, turns up unannounced. He had previously lied to her about where he was, and after an argument she takes Niamh's car. Later, she turns up at the pub and discovers she has something in common with Niamh.\n\nOn the way back to Sean's farm they find that Siobhan has gone into labour. There isn't time to get her back to Sean, so they hijack Brian's hot tub and use it as a birthing pool.\n\nAidan is proved to be wiser than Orla thought when it comes to money, and to Ambrose's amazement his boss approves of the family living over the pub.\n\nMeanwhile, Brian's dreams lead him to a golf course that he feels it is his destiny to buy.","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-10-11","episode_number":4,"episode_type":"standard","id":262069,"name":"Par for the Course","overview":"Brian is still planning to buy the golf course, but he can't find the necessary funds without some help. Orla knows a man who might have the answer - Micky Keeler, a lotto winner who is blackballed every time he tries to join a club - thanks to his criminal record. Liam and Donal are employed to fix a round of golf between Micky and Brian.\n\nBrendan is hostile to the idea of Aisling's christening because he feels left out. Aidan's preparations for the event, his first ever christening, don't go as planned when he nearly drowns the doll he's practising on.\n\nEmma becomes increasingly annoyed by her new surroundings - no running water, no radio reception, and the shop doesn't stock smoky bacon crisps.\n\nA nephew of Eamonn's, Danny, turns up in need of shelter for an illegally stabled horse.","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Micky Keeler","credit_id":"571cf58cc3a3685d060003d6","order":506,"adult":false,"gender":2,"id":25074,"known_for_department":"Acting","name":"Stanley Townsend","original_name":"Stanley Townsend","popularity":4.185,"profile_path":"/ry1kek817WYHOh1npa3ojxmGJcI.jpg"}]},{"air_date":"1998-10-18","episode_number":5,"episode_type":"standard","id":262062,"name":"The Odd Couple","overview":"Donal becomes very secretive about the new woman in his life, Suzie. He's taking time off work and it's affecting his relationship with Liam. He has to keep her well fed or she may become violent - Suzie is a former circus bear that Donal saved from being put down.\n\nSiobhan isn't allowing Brendan much access to Aisling, but that changes when she is called out and leaves Brendan literally holding the baby. Suzie escapes and goes on a rampage through the village. Donal is determined she should be free, but when she is cornered in Fitzgerald's there is a danger she will be shot. But Aidan steps in with a simple answer that saves the day - a few words of Latin!\n\nMeanwhile, Kevin gets into trouble with his father when he helps Sean renovate an old motorbike.","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5257554719c29531db12ea9a","adult":false,"gender":2,"id":1221055,"known_for_department":"Directing","name":"Chris Clough","original_name":"Chris Clough","popularity":1.4,"profile_path":null}],"guest_stars":[]},{"air_date":"1998-10-25","episode_number":6,"episode_type":"standard","id":262073,"name":"Turf","overview":"Dr Ryan's winning streak in the local horse race is threatened by Razor, who belongs to Danny. He is betting on himself in order to raise the funds to stable Razor in Dublin. If he loses he'll sell Razor to pay back his loans.\n\nBrian is linking the race with a membership drive for the golf course, but his business partner has plenty of ideas about who should be eligible to join. He offers Dr Ryan life membership if he wins the race.\n\nOrla moves into the police house and immediately finds herself in the thick of the action when a drug dealer, whom Ambrose had previously arrested, starts to take revenge. Orla takes up Padraig's offer of a room, but it causes tensions between Padraig and Kevin.\n\nDanny is injured before the race, so Emma rides instead. She comes in second. Sean has been looking to buy Emma a horse for her birthday and Eamonn sells him Razor.","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Micky Keeler","credit_id":"571cf58cc3a3685d060003d6","order":506,"adult":false,"gender":2,"id":25074,"known_for_department":"Acting","name":"Stanley Townsend","original_name":"Stanley Townsend","popularity":4.185,"profile_path":"/ry1kek817WYHOh1npa3ojxmGJcI.jpg"}]},{"air_date":"1998-11-01","episode_number":7,"episode_type":"standard","id":262072,"name":"It's a Family Affair","overview":"Brian is preparing for the pre-opening tournament at his golf course. Micky Keeler doesn't approve of the tournament list but he eventually agrees - then tries to bribe Liam and Donal to fix the draw. But Brian is one step ahead of him: disgusted with Micky he gives free membership away without asking him.\n\nDanny sets off to Dublin with Razor and Sean is angry when he finds out. He and Ambrose go after him while Emma builds a few bridges with Eamonn. Danny takes a tumble, Sean drops the charges and gives Razor back to him.\n\nNiamh is worried that Orla might fancy her dad, but Orla reveals that Sean would be her man of choice.\n\nAnother one of Liam's and Donal's jobs for Brian goes wrong and fills the marquee with smoke. They transfer to Fitzgerald's but Brian is annoyed to discover that Niamh and Orla have locked the pub up and gone for a night out.","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Micky Keeler","credit_id":"571cf58cc3a3685d060003d6","order":506,"adult":false,"gender":2,"id":25074,"known_for_department":"Acting","name":"Stanley Townsend","original_name":"Stanley Townsend","popularity":4.185,"profile_path":"/ry1kek817WYHOh1npa3ojxmGJcI.jpg"}]},{"air_date":"1998-11-08","episode_number":8,"episode_type":"standard","id":262070,"name":"Rock Bottom","overview":"A statue is discovered on Sean's land. It's a 'sheelnagig' - a fertility symbol. Kathleen is disgusted by it and even more disgusted by Aidan's apathy towards it. The statue goes missing and Siobhan knows who the culprit is.\n\nDanny and Emma become good friends, although Emma thinks Eamonn's plans for the farm are a little over-ambitious.\n\nOrla is disappointed when a dinner with Sean comes to nothing.\n\nA satellite dish is installed in Fitzgerald's to watch football on, but it ends up tuned to an Argentinian soap opera, which the locals quickly get addicted to.\n\nPadraig is facing life without Kevin, who has gone to visit his mother in England, and he turns to drink. His friends are there to help him, but the problem still remains.","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-11-15","episode_number":9,"episode_type":"standard","id":262068,"name":"As Stars Look Down","overview":"Henry, an African Bishop who was once one of Father Mac's curates, pays a flying visit to the town. Aidan has organised a bingo night but there is a danger that the celebrity bingo caller won't make it, and father Mac suggests Aidan does the job. Kathleen starts coaching him. but becomes frustrated at his lacklustre style. He attempts the calling on his own, but it is a disaster and Orla steps in to save her brother from embarrassment.\n\nSean is aware that Emma is spending more time with Danny and he's not too happy about it. During bad weather they are stranded on a hill by the lake. They take shelter in a cold, empty house where they spend the night, only to face Sean the next morning.\n\nHenry has been offered a job in the Vatican, but he feels that taking it will make him look like a coward. He faces hostility from the regime and would like to be there to see it through. Father Mac persuades him that the Vatican position might be of more use to the people he serves.","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Henry","credit_id":"571cf6b192514135ff004dae","order":508,"adult":false,"gender":2,"id":16752,"known_for_department":"Acting","name":"David Harewood","original_name":"David Harewood","popularity":5.906,"profile_path":"/8scO8ISd5UH6MNMr9kyb4H6aAWD.jpg"}]},{"air_date":"1998-11-22","episode_number":10,"episode_type":"standard","id":262076,"name":"Births, Deaths and Marriages","overview":"Siobhan and Brendan are secretly planning their wedding but Aidan is not convinced that their reasons are genuine. Having kept it quiet, Siobhan tells Niamh that they are marrying for practical and financial reasons. Niamh bullies Siobhan into buying a dress and then organises a surprise wedding reception, but the wedding is called off at the altar.\n\nEmma decides to find out about her great grandfather, but she meets resistance from Kathleen, and she turns to Brian. He reveals that Michael Dillon was married to Nora Byrne, Eamonn's aunt, and their son was illegitimate. At least some of the bad feeling between the two families originates from that relationship, but Emma discovers that the couple were planning to get married all along.\n\nEamonn has a fall while trying to rescue one of his sheep, and Danny enlists Sean's help in rescuing him. Eamonn refuses Sean's help while he recuperates, but Danny doesn't have a clue so he helps anyway.\n\nNiamh persuades Ambrose to get a social life, but hi","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-11-29","episode_number":11,"episode_type":"standard","id":262074,"name":"It's a Man's Life","overview":"Niamh's and Ambrose's relationship is disintegrating and he takes it out on everyone else by applying the letter of the law. He doesn't know where to start to repair his marriage, and things are made more difficult when Niamh confesses her problems to Sean.\n\nKathleen receives a valuable package from a former boyfriend, and Aidan sets them up with as reunion. They had agreed that he would go to England, and then come back when he had enough money for them to get married. She lent him money but never heard from him again. That's the reason she never married.\n\nDonal is appointed as Liam's boss when he suggests a moneymaking scheme to Brian - retrieving golf balls out of the lake on the course, and reselling them. They manage to pull all kinds of things out of the lake, including a section of a Russian satellite, but have trouble finding what they are actually looking for.\n\nWhile Niamh is in Dublin, Kieran makes a nuisance of himself with whoever is looking after him. Siobhan can't cope with","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-12-06","episode_number":12,"episode_type":"finale","id":262075,"name":"The Final Frontier","overview":"A big storm threatens the town, all the animals on Eamonn's farm are acting strangely and Donal's Uncle Minto thinks the storm could be a signal of an imminent UFO landing. Not only that, but he thinks he's going to be abducted by the aliens.\n\nEmma receives an acceptance letter from an art college in London and has to decide whether to accept. She wants to know if Danny will be upset if she goes.\n\nAmbrose is finding it difficult to talk to Niamh and Brian suspects that there's something between her and Sean. He could be right. She fells that she is now 'established' and keeps wondering what might have happened if things had been different. After their talk, Sean drives her home and Ambrose sees them. He confronts her and she admits that she's bored with him never changing, always loving her, never moving on. Ambrose goes round to Sean's convinced that he and Niamh are having an affair.\n\nSean's newly constructed farmhouse is wrecked by the storm and a tree falls through the roof, just miss","production_code":"","runtime":50,"season_number":4,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":11174,"poster_path":"/jRpf0YR0S4wfqlTsVWK2O4dG25L.jpg","season_number":4,"vote_average":0},"5":{"_id":"5257553f19c29531db12e486","air_date":"1999-09-26","episodes":[{"air_date":"1999-09-26","episode_number":1,"episode_type":"standard","id":262048,"name":"Two Flew over the Cuckoo's Nest","overview":"It is still the night of the bonfire party, which ended the previous series. Niamh decides she must tell Ambrose that the marriage is over.\n\nThe next day, Niamh leaves Kieran with Siobhan and spends the day with Sean at the lake, and they discuss their future. Sean tells her that he loves her. Meanwhile, Ambrose goes for a walk by the shore at Durrus Head. He is engrossed in thought about his troubled marriage when he sees two people in difficulty on the rocks below. He shouts to tell them that he will try to find a way for them to escape the incoming tide.\n\nElsewhere, a Frenchman called D'Argan, has come to challenge \"\"the head man of the village\"\" to a balloon race. Donal and Liam go to find Brian who is the closets they can think of. Brian is uninterested until he discovers that the event is to complete a race started 200 years previously, and that £40,000 is at stake. However, Monsieur D'Argan has forgotten that the French economy has had one major change since Napoleonic times.\n\nInspec","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5257554719c29531db12e992","order":504,"adult":false,"gender":2,"id":58654,"known_for_department":"Acting","name":"Owen Teale","original_name":"Owen Teale","popularity":12.602,"profile_path":"/fEr21q41i2e92wqKdoxeFdbDZva.jpg"}]},{"air_date":"1999-10-03","episode_number":2,"episode_type":"standard","id":1327699,"name":"Hello and Farewell","overview":"The sudden loss in Ballykissangel has left everyone in tears, particularly Niamh who must deal with the new changes in her life. In the meantime, Orla moves into a new cottage hoping for some freedom.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-10","episode_number":3,"episode_type":"standard","id":262047,"name":"Catch of the Day","overview":"Liam and Donal have been sent to buy washed sand for a bunker on Brian's golf course. With fifty pounds in their pockets they reckon that sand from the beach will be just as good. While they are loading the sand onto a lorry, a car drives past at speed, stops, and the occupants push a large wooden chest into the sea. Liam and Donal open the chest and even though they're not sure what the contents are, bring it home. They later discover that the caviar inside is worth a lot of money.\n\nSean and Niamh have not spoken since the funeral. Niamh talks to Father Aidan in the confessional and his advice is that she has to decide what is best for her. After much indecision, she agrees to meet Sean. She tells him that she is going to leave BallyK.\n\nMeanwhile, Orla and Conor have their first date - if it is a date. They are both intensely competitive and they end up racing around a muddy course on Quad Bikes.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5257554719c29531db12e992","order":504,"adult":false,"gender":2,"id":58654,"known_for_department":"Acting","name":"Owen Teale","original_name":"Owen Teale","popularity":12.602,"profile_path":"/fEr21q41i2e92wqKdoxeFdbDZva.jpg"}]},{"air_date":"1999-10-17","episode_number":4,"episode_type":"standard","id":262046,"name":"Moving Out","overview":"Niamh has decided that she must move away from BallyK. The decision spurs Brian to sell Fitzgerald's. Two parties are interested. One is a retired civil servant from Dublin, who is looking for an investment. He manages to annoy Brian by talking about getting the pub \"\"up to scratch\"\". The second party is Oonagh Dooley, who is more interested in keeping the family atmosphere of the pub.\n\nBrian takes a liking to Oonagh, but he doesn't realise that she is the wife of his former enemy, Paul Dooley. When the deal with the civil servant falls through, Brian makes Oonagh and offer to rent the pub, leaving Niamh with some control.\n\nEmma and Sean fall out over driving lessons and Sean's and Niamh's relationship. Emma feels that Sean should be doing something. Niamh is grateful that Aidan has given her the freedom to make up her own mind.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-24","episode_number":5,"episode_type":"standard","id":262050,"name":"Eureka","overview":"A woman representing Australian mining interests arrives in BallyK looking for a \"\"man called Quigley\"\". If Brian can prove his relationship to another Quigley from BallyK, who owned an Australian gold mine in 1854, he stands to earn half a million Australian dollars.\n\nBrian's attempts to prove his relationship with jack Quigley are ambushed several times by bad luck until he eventually uncovers the evidence. But there are doubts about the genuineness of the Australian offer.\n\nOrla unexpectedly invites a man onto Conor's boat. She claims that he is a writer for a fishing guide, and a favourable review in the book will give Conor's business the boost it needs. But, if he is an expert, why doe he not use the correct bait? Is it just part of an elaborate cover-up to keep his true reason for being on board hidden?\n\nImelda arrives to help Niamh, but her criticisms and barbed comments are too much to bear, and there is a frank exchange of views.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-31","episode_number":6,"episode_type":"standard","id":262055,"name":"Behind Bars","overview":"Paul Dooley is released from prison, having spent six months inside for tax fraud. Now bankrupt he does not know that his wife, Oonagh, has arranged a new life for him and their two children, Dermott and Grainne, in Ballykissangel. Paul is furious.\n\nAs the Dooleys move in, Niamh moves out, planning to leave the village and move to the outskirts of Dublin. As she waits for the key to arrive at the Estate Agent's, she goes to a pub where she and Sean have spent some time in the past. Sean, who had earlier spotted in town, is already there. He tries to avoid her, but fails, and they sit together and fantasise about what a future together might have been like. They say goodbye.\n\nRomance is blossoming for Orla and Conor - or rather it would if it were not for the interruptions. Conor plans a romantic evening at Orla's cottage, but she has invited half the village to a party to celebrate keeping her job at Fitzgerald's.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-11-07","episode_number":7,"episode_type":"standard","id":262058,"name":"Brendan's Crossing","overview":"The Headmaster's post is soon to be vacant and Brendan is in line for the job. He withdraws his name from the list of candidates when he sees a Christian Brother is one of the candidates, and with father Mac on the Board Brendan thinks the Brother has the job in the bag. When Sean points out that the Brother will be his boss, Brendan decides that he must go for the job, After a certain amount of swatting and worrying, he is successful.\n\nPaul is causing Oonagh problems: He decides to \"\"recycle\"\" the slops from the bar, takes in a paying guest for the night, even though there is no accommodation, and forces Orla to resign - briefly.\n\nEmma helps Danny's pig to give birth, and has to put up with Danny's mother hen act in the process.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-11-21","episode_number":8,"episode_type":"standard","id":262057,"name":"A Few Dollars More","overview":"Uncle Minto reckons that there is a fortune to be made with illegal spirits. He enlists the help of Liam and Donal to make it, and soon convinces Paul to buy a large consignment, behind Oonagh's back. Unfortunately, things don't go as they hope, and the scam does not go unnoticed - the pub's guest, Frankie, seems to know what's going on.\n\nA reluctant Orla lets Conor stay the night on her couch while his boat is being fixed. Things get decidedly awkward when he brings her breakfast in bed, and then Aidan arrives to see Conor doing the washing-up.\n\nFrankie turns out to be the new Garda.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e79e","order":2,"adult":false,"gender":1,"id":1227797,"known_for_department":"Acting","name":"Catherine Cusack","original_name":"Catherine Cusack","popularity":3.927,"profile_path":"/4ZBZOqdxVBT8ymLqzIRY74AjiBv.jpg"}]},{"air_date":"1999-11-28","episode_number":9,"episode_type":"standard","id":262054,"name":"The Outsiders","overview":"Conor tells Orla that he has been offered some work in Spain, and wants to know if there is a future for them. She tells him to go.\n\nFrankie finds her own brand of justice for Paul - Community Service, painting the school gym. However, he gets all the others who had been involved in the illegal liquor scam to help him out, much to the dismay of Brian and Father Mac.\n\nMeanwhile, Brian has told Liam and Donal to cut the hedges at the golf course, but they get carried away with a bit of topiary.\n\nHowever, Brian is beginning to feel lonely with Niamh no longer around. When he sees the hedge, instead of telling the boys off he tells them he likes it, and asks them if they can do a giraffe - Kieran would like that. Then, he sees Sean outside Kathleen's shop, shopping for one, and gives him Niamh's address and telephone number.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-12-05","episode_number":10,"episode_type":"standard","id":262059,"name":"With a Song in My Heart","overview":"Sean decides to go and see Niamh, although it turns out to be a far bigger experience than he had expected, what with ruining the market and racing through a stream to get Kieran.\n\nMeanwhile, Aiden is having trouble getting people to join the choir, and Orla doesn't help by telling a few lies to the Dooley children, which makes them think they are going to be on TV. Also, there is a young girl with a wonderful voice whose mother doesn't want her to have anything do with the church.\n\nAt the close, Sean asks Niamh to marry him, and she tells him that she loves him.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-12-19","episode_number":11,"episode_type":"standard","id":262060,"name":"Love's Labours","overview":"Mairead has a crush on Aiden, but he doesn't realise this until she kisses him. Her mother wants answers, and Frankie has to question Aiden, who blames himself. Meanwhile, Niamh and Sean announce their engagement, and set about arranging the wedding. But Brendan is worried about his best man's speech, and Sean seems to be having second thoughts. Even Niamh is unsure: everything and everyone she knows are here in Ballykissangel, but she would rather leave and be with Sean. Liam and Donal, in a desperate attempt to find money for a wedding present, end up in the bookies. To their surprise they are lucky with the horses and before long they have raised the sum of two thousand pounds. An old man, who has been watching them proposes a game of cards. They play 'higher or lower' with the old man and have soon bet away all their money. That night, as they sit despondently at the bar of Fitzgerald's, Paul produces a parcel 'some old man' left for them. They open it to find a cut glass ornament","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-12-28","episode_number":12,"episode_type":"finale","id":262052,"name":"Arrivals and Departures","overview":"It is the day before Niamh and Sean's Wedding and the men of the village are desperate for him to have a stag night. Sean isn't too excited about the prospect of a night around the bar in Fitzgerald's, so Uncle Minto suggest a Celtic ceremony instead. Sean agrees, and while Minto begins to consecrate the land for the celebration, Liam and Donal are plotting how they can turn this into a more conventional stag night involving alcohol. Meanwhile, the women are going on a pub crawl. When Sean arrives in the woods, and sees the party split, he insists that the men unite. Most of the men try Minto's potion and begin to notice strange things happening. Brendan is cured of a toothache, while Danny keeps seeing Rabbits! Later, Brian learns from Sean of the plans to move away from Ballykissangel.    In Cilldargen, the woman, even Kathleen, are getting thoroughly inebriated. Siobhan is run off the road by a rogue driver. Frankie is called to investigate and asks Aidan to assist.","production_code":"","runtime":50,"season_number":5,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":11173,"poster_path":"/uVjoOQk4xaLAxHq9rr0MhBfHmgi.jpg","season_number":5,"vote_average":0},"6":{"_id":"5257553f19c29531db12e478","air_date":"2001-03-01","episodes":[{"air_date":"2001-03-01","episode_number":1,"episode_type":"standard","id":262033,"name":"God.com","overview":"It's all change at BallyK. There's a new priest, Father Vincent Sheahan, who has arrived from Australia, there's a new stable owner, Avril Burke, and a new mechanic at Padraig's old garage, Edso Dowling. Within hours of arriving in BallyK, Father Vincent has to turn detective to find out who has set up a website, guiltgone.com, purporting to be a Ballykissangel confessional. Meanwhile, Brian Quigley has dissappeared, leaving his clothes neatly folded on the beach (remember Reggie Perrin?). Has he drowned, or does the list of his debtors point to his having 'done a runner'?","production_code":"","runtime":50,"season_number":6,"show_id":3734,"still_path":"/lQxLwUxRGPEourRfRYr45A2SwOF.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e778","order":0,"adult":false,"gender":1,"id":1220084,"known_for_department":"Acting","name":"Susannah Doyle","original_name":"Susannah Doyle","popularity":17.445,"profile_path":"/gMU3ESkffQPQ2knM0OgXrm6gN4J.jpg"},{"character":"","credit_id":"5257554519c29531db12e79e","order":2,"adult":false,"gender":1,"id":1227797,"known_for_department":"Acting","name":"Catherine Cusack","original_name":"Catherine Cusack","popularity":3.927,"profile_path":"/4ZBZOqdxVBT8ymLqzIRY74AjiBv.jpg"},{"character":"","credit_id":"5257554519c29531db12e7cc","order":4,"adult":false,"gender":2,"id":96671,"known_for_department":"Acting","name":"Mick Lally","original_name":"Mick Lally","popularity":1.357,"profile_path":null},{"character":"","credit_id":"5257554519c29531db12e7f8","order":505,"adult":false,"gender":1,"id":78285,"known_for_department":"Acting","name":"Marion O'Dwyer","original_name":"Marion O'Dwyer","popularity":3.373,"profile_path":"/rBWpMQohUabjRTuvENWEiHyKjx1.jpg"}]},{"air_date":"2001-03-04","episode_number":2,"episode_type":"standard","id":262030,"name":"Drink","overview":"Father Vincent has got troubles: he's tested positive for drink driving, and the bank is about to take away the cottage which used to belong to Brian, and in which he lives. Meanwhile, Liam's fallen in love with Siobhan's niece, Elaine, and Siobahan is furious with Brendan for being irresponsible. Then there's Paul, who wants to buy Louis's cottage . . .","production_code":"","runtime":50,"season_number":6,"show_id":3734,"still_path":"/4tTLN4YDTHATaZLHT2d8fjsQKJ0.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e778","order":0,"adult":false,"gender":1,"id":1220084,"known_for_department":"Acting","name":"Susannah Doyle","original_name":"Susannah Doyle","popularity":17.445,"profile_path":"/gMU3ESkffQPQ2knM0OgXrm6gN4J.jpg"},{"character":"","credit_id":"5257554519c29531db12e79e","order":2,"adult":false,"gender":1,"id":1227797,"known_for_department":"Acting","name":"Catherine Cusack","original_name":"Catherine Cusack","popularity":3.927,"profile_path":"/4ZBZOqdxVBT8ymLqzIRY74AjiBv.jpg"},{"character":"","credit_id":"5257554519c29531db12e7cc","order":4,"adult":false,"gender":2,"id":96671,"known_for_department":"Acting","name":"Mick Lally","original_name":"Mick Lally","popularity":1.357,"profile_path":null},{"character":"","credit_id":"5257554519c29531db12e7f8","order":505,"adult":false,"gender":1,"id":78285,"known_for_department":"Acting","name":"Marion O'Dwyer","original_name":"Marion O'Dwyer","popularity":3.373,"profile_path":"/rBWpMQohUabjRTuvENWEiHyKjx1.jpg"}]},{"air_date":"2001-03-11","episode_number":3,"episode_type":"standard","id":262032,"name":"The Cat and Daddy G","overview":"The Dooley's new pet goat, Daddy G, is causing havoc at the pub, and is moved to Avril's stables. Avril, however, has money worries, and is thinking of selling The Cat, her beloved racehorse. Meanwhile, Father Vincent is called to the police station to hear a man's confession, and finds himself in an ethical dilemma.","production_code":"","runtime":50,"season_number":6,"show_id":3734,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e778","order":0,"adult":false,"gender":1,"id":1220084,"known_for_department":"Acting","name":"Susannah Doyle","original_name":"Susannah Doyle","popularity":17.445,"profile_path":"/gMU3ESkffQPQ2knM0OgXrm6gN4J.jpg"},{"character":"","credit_id":"5257554519c29531db12e79e","order":2,"adult":false,"gender":1,"id":1227797,"known_for_department":"Acting","name":"Catherine Cusack","original_name":"Catherine Cusack","popularity":3.927,"profile_path":"/4ZBZOqdxVBT8ymLqzIRY74AjiBv.jpg"},{"character":"","credit_id":"5257554519c29531db12e7cc","order":4,"adult":false,"gender":2,"id":96671,"known_for_department":"Acting","name":"Mick Lally","original_name":"Mick Lally","popularity":1.357,"profile_path":null},{"character":"","credit_id":"5257554519c29531db12e7f8","order":505,"adult":false,"gender":1,"id":78285,"known_for_department":"Acting","name":"Marion O'Dwyer","original_name":"Marion O'Dwyer","popularity":3.373,"profile_path":"/rBWpMQohUabjRTuvENWEiHyKjx1.jpg"}]},{"air_date":"2001-03-18","episode_number":4,"episode_type":"standard","id":262028,"name":"Spirit Proof","overview":"Brendan goes fishing, and sees the ghost of Finbar Corcoran, a highwayman who was hanged in the 18th century. In telling the story he also informs Paul that Fitzgerald's bar now owns the lucrative local fishing rights, and Paul persuades Father Sheahan that angling holidays will bring in money to the trust. But then people start reporting sightings of Finbar, and Frankie and Vincent seek an explanation. But the most terrifying sight is that of Kathleen learning to drive!","production_code":"","runtime":50,"season_number":6,"show_id":3734,"still_path":"/1eg4a47JMVrJJdPHGQ7bPtVp7BZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e778","order":0,"adult":false,"gender":1,"id":1220084,"known_for_department":"Acting","name":"Susannah Doyle","original_name":"Susannah Doyle","popularity":17.445,"profile_path":"/gMU3ESkffQPQ2knM0OgXrm6gN4J.jpg"},{"character":"","credit_id":"5257554519c29531db12e79e","order":2,"adult":false,"gender":1,"id":1227797,"known_for_department":"Acting","name":"Catherine Cusack","original_name":"Catherine Cusack","popularity":3.927,"profile_path":"/4ZBZOqdxVBT8ymLqzIRY74AjiBv.jpg"},{"character":"","credit_id":"5257554519c29531db12e7cc","order":4,"adult":false,"gender":2,"id":96671,"known_for_department":"Acting","name":"Mick Lally","original_name":"Mick Lally","popularity":1.357,"profile_path":null},{"character":"","credit_id":"5257554519c29531db12e7f8","order":505,"adult":false,"gender":1,"id":78285,"known_for_department":"Acting","name":"Marion O'Dwyer","original_name":"Marion O'Dwyer","popularity":3.373,"profile_path":"/rBWpMQohUabjRTuvENWEiHyKjx1.jpg"}]},{"air_date":"2001-03-25","episode_number":5,"episode_type":"standard","id":262040,"name":"Paul Dooley Sleeps with the Fishes","overview":"Donal and Liam are after Paul to repay the money he borrowed, and the only way Paul can get the money is to sell the priest's house. Also, Oonagh is fed-up with receiving junk mail addressed to Assumpta, and decides to chnage the name of the pub. Meanwhile, when Avril's husband turns up in BallyK, she doesn't know how to handle the situation, and Vincent fights to provide some support.","production_code":"","runtime":50,"season_number":6,"show_id":3734,"still_path":"/2IzCtgVm9FiMk4QQWmU5Lpm7jlZ.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e778","order":0,"adult":false,"gender":1,"id":1220084,"known_for_department":"Acting","name":"Susannah Doyle","original_name":"Susannah Doyle","popularity":17.445,"profile_path":"/gMU3ESkffQPQ2knM0OgXrm6gN4J.jpg"},{"character":"","credit_id":"5257554519c29531db12e79e","order":2,"adult":false,"gender":1,"id":1227797,"known_for_department":"Acting","name":"Catherine Cusack","original_name":"Catherine Cusack","popularity":3.927,"profile_path":"/4ZBZOqdxVBT8ymLqzIRY74AjiBv.jpg"},{"character":"","credit_id":"5257554519c29531db12e7cc","order":4,"adult":false,"gender":2,"id":96671,"known_for_department":"Acting","name":"Mick Lally","original_name":"Mick Lally","popularity":1.357,"profile_path":null},{"character":"","credit_id":"5257554519c29531db12e7f8","order":505,"adult":false,"gender":1,"id":78285,"known_for_department":"Acting","name":"Marion O'Dwyer","original_name":"Marion O'Dwyer","popularity":3.373,"profile_path":"/rBWpMQohUabjRTuvENWEiHyKjx1.jpg"}]},{"air_date":"2001-04-01","episode_number":6,"episode_type":"standard","id":262038,"name":"In a Jam","overview":"News spreads that Father Vincent will be organizing the annual parish fete, so Liam and Donal set about arranging the 'Cow-in-the-Field' competition, and a battle ensues in the jam-making competition. Meanwhile, Avril's stables are in financial difficulties, and a trip to the doctor brings some worrying news for Siobhan.","production_code":"","runtime":50,"season_number":6,"show_id":3734,"still_path":"/d1egqie8TqwJndmrYpZ1RCPc5tA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e778","order":0,"adult":false,"gender":1,"id":1220084,"known_for_department":"Acting","name":"Susannah Doyle","original_name":"Susannah Doyle","popularity":17.445,"profile_path":"/gMU3ESkffQPQ2knM0OgXrm6gN4J.jpg"},{"character":"","credit_id":"5257554519c29531db12e79e","order":2,"adult":false,"gender":1,"id":1227797,"known_for_department":"Acting","name":"Catherine Cusack","original_name":"Catherine Cusack","popularity":3.927,"profile_path":"/4ZBZOqdxVBT8ymLqzIRY74AjiBv.jpg"},{"character":"","credit_id":"5257554519c29531db12e7cc","order":4,"adult":false,"gender":2,"id":96671,"known_for_department":"Acting","name":"Mick Lally","original_name":"Mick Lally","popularity":1.357,"profile_path":null},{"character":"","credit_id":"5257554519c29531db12e7f8","order":505,"adult":false,"gender":1,"id":78285,"known_for_department":"Acting","name":"Marion O'Dwyer","original_name":"Marion O'Dwyer","popularity":3.373,"profile_path":"/rBWpMQohUabjRTuvENWEiHyKjx1.jpg"}]},{"air_date":"2001-04-08","episode_number":7,"episode_type":"standard","id":262036,"name":"Getting Better All the Time","overview":"A faith healer, Conseula Dunphy, comes to the area: Father Mac is worried, Michael Ryan is contemptuous, and Vincent has an open mind. Vincent's life is complicated, however, with the arrival of an old friend and his girlfriend who want him to marry them - but there are complications. Meanwhile, Liam thinks that he and Donal should invest the money they had from Brian in the syndicate which owns Avril's horse, The Cat. And then there's the large stone in the field that Paul's leasing.....","production_code":"","runtime":50,"season_number":6,"show_id":3734,"still_path":"/mYh0p7VTleIIaUFJj2S91tSJM2A.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e778","order":0,"adult":false,"gender":1,"id":1220084,"known_for_department":"Acting","name":"Susannah Doyle","original_name":"Susannah Doyle","popularity":17.445,"profile_path":"/gMU3ESkffQPQ2knM0OgXrm6gN4J.jpg"},{"character":"","credit_id":"5257554519c29531db12e79e","order":2,"adult":false,"gender":1,"id":1227797,"known_for_department":"Acting","name":"Catherine Cusack","original_name":"Catherine Cusack","popularity":3.927,"profile_path":"/4ZBZOqdxVBT8ymLqzIRY74AjiBv.jpg"},{"character":"","credit_id":"5257554519c29531db12e7cc","order":4,"adult":false,"gender":2,"id":96671,"known_for_department":"Acting","name":"Mick Lally","original_name":"Mick Lally","popularity":1.357,"profile_path":null},{"character":"","credit_id":"5257554519c29531db12e7f8","order":505,"adult":false,"gender":1,"id":78285,"known_for_department":"Acting","name":"Marion O'Dwyer","original_name":"Marion O'Dwyer","popularity":3.373,"profile_path":"/rBWpMQohUabjRTuvENWEiHyKjx1.jpg"}]},{"air_date":"2001-04-15","episode_number":8,"episode_type":"finale","id":262041,"name":"Smoke Signals","overview":"Father Mac is outraged when he learns that Vincent has married Barry and Lyn, and to make matters worse the Bishop has found out as well. Also, the bank has foreclosed on the priest's house, so Vincent is forced to find a place to sleep in various places. Meanwhile, Louis's dog is unwell, and when Siobhan seeks to find out why she finds some strange plants on the mountain, which attracts the interest of both Doc Ryan and Frankie. And then there's Liam, the cool dude....!","production_code":"","runtime":50,"season_number":6,"show_id":3734,"still_path":"/37xA7mq3pk3qkX2APAWj7nIieFr.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257554019c29531db12e525","adult":false,"gender":0,"id":1229051,"known_for_department":"Writing","name":"Kieran Prendiville","original_name":"Kieran Prendiville","popularity":2.018,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257554519c29531db12e778","order":0,"adult":false,"gender":1,"id":1220084,"known_for_department":"Acting","name":"Susannah Doyle","original_name":"Susannah Doyle","popularity":17.445,"profile_path":"/gMU3ESkffQPQ2knM0OgXrm6gN4J.jpg"},{"character":"","credit_id":"5257554519c29531db12e79e","order":2,"adult":false,"gender":1,"id":1227797,"known_for_department":"Acting","name":"Catherine Cusack","original_name":"Catherine Cusack","popularity":3.927,"profile_path":"/4ZBZOqdxVBT8ymLqzIRY74AjiBv.jpg"},{"character":"","credit_id":"5257554519c29531db12e7cc","order":4,"adult":false,"gender":2,"id":96671,"known_for_department":"Acting","name":"Mick Lally","original_name":"Mick Lally","popularity":1.357,"profile_path":null},{"character":"","credit_id":"5257554519c29531db12e7f8","order":505,"adult":false,"gender":1,"id":78285,"known_for_department":"Acting","name":"Marion O'Dwyer","original_name":"Marion O'Dwyer","popularity":3.373,"profile_path":"/rBWpMQohUabjRTuvENWEiHyKjx1.jpg"}]}],"name":"Season 6","overview":"","id":11172,"poster_path":"/xRCpiQnuKumyUzk3fvrjmUQWRBZ.jpg","season_number":6,"vote_average":0}}}