{"adult":false,"backdrop_path":"/lJVtcLeH2PHKwC3V4V31F00ooQw.jpg","created_by":[{"id":52342,"credit_id":"541057a3c3a3685eab001a85","name":"Olivier Marchal","gender":2,"profile_path":"/r4NRcHShGE9G0OvI8tSlh5DZMTU.jpg"}],"episode_run_time":[50],"first_air_date":"2009-10-12","genres":[{"id":10759,"name":"Action & Adventure"},{"id":18,"name":"Drama"}],"homepage":"http://www.canalplus.fr/series/pid3971-braquo.html","id":37363,"in_production":false,"languages":["fr"],"last_air_date":"2016-10-03","last_episode_to_air":{"id":1214050,"name":"All The Way And Until The End","overview":"It's the home stretch for Caplan, Walter and Roxanne. At the end of this path of extreme justice that they've carved themselves, with their noblest intentions, love, family and death await them. And they will all pay a heavy price.","vote_average":10,"vote_count":2,"air_date":"2016-10-03","episode_number":8,"episode_type":"finale","production_code":"","runtime":50,"season_number":4,"show_id":37363,"still_path":"/jpViK1nPdXuyhub5vsfVKgaTA8z.jpg"},"name":"Braquo","next_episode_to_air":null,"networks":[{"id":285,"logo_path":"/9aotxauvc9685tq9pTcRJszuT06.png","name":"Canal+","origin_country":"FR"}],"number_of_episodes":32,"number_of_seasons":4,"origin_country":["FR"],"original_language":"fr","original_name":"Braquo","overview":"A group of police officers in Paris use violence and intimidation to solve crimes.","popularity":38.235,"poster_path":"/uZNrgZq8XAixiel5enJm0HpGJAC.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2009-10-12","episode_count":8,"id":48630,"name":"Season 1","overview":"","poster_path":"/yHVVVGNqhnz2lSWZFm0cOswMDjO.jpg","season_number":1,"vote_average":8.9},{"air_date":"2011-11-21","episode_count":8,"id":48631,"name":"Season 2","overview":"","poster_path":"/p2I8cUGcqjbpjIAdm6wdjUMwuEC.jpg","season_number":2,"vote_average":10},{"air_date":"2014-02-10","episode_count":8,"id":60359,"name":"Season 3","overview":"Caplan and his team must end a war between two clans.","poster_path":"/3gwlTivLrEasuV6Y53i6sc2wYYE.jpg","season_number":3,"vote_average":10},{"air_date":"2016-09-12","episode_count":8,"id":79220,"name":"Season 4","overview":"","poster_path":"/yg1mnqcPBtRloQDjlR4yt6q84BR.jpg","season_number":4,"vote_average":9.9}],"spoken_languages":[{"english_name":"French","iso_639_1":"fr","name":"Français"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.3,"vote_count":44,"season_data":{"1":{"_id":"5258e8bd760ee34661864848","air_date":"2009-10-12","episodes":[{"air_date":"2009-10-12","episode_number":1,"episode_type":"standard","id":844766,"name":"Max","overview":"Suspected of abusing a prisoner during an interrogation, Major Rossi Vogel is interviewed by the IGS. Placed in custody, he takes the only path that seems open to him.","production_code":"","runtime":50,"season_number":1,"show_id":37363,"still_path":"/x8XWUimjos2BzuA39HftlGWl95R.jpg","vote_average":8.9,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2009-10-12","episode_number":2,"episode_type":"standard","id":844767,"name":"The Yellow Line","overview":"To avenge the insult done to their leader, buried without honors, Eddy, Theo, Walter and Roxane cross the yellow line. They remove Benaissa for questioning, very muscular, and manage to snatch the name of his accomplice, but accidentally kills Theo. Despite the release of their alibis, the four colleagues find themselves in the crosshairs of the IGS and the prosecutor. They are constantly questioned by Vogel and his men.","production_code":"","runtime":50,"season_number":1,"show_id":37363,"still_path":"/hErUibfT2kYHBATYVKecMnL9BTa.jpg","vote_average":9,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2009-10-19","episode_number":3,"episode_type":"standard","id":844768,"name":"A Head in a Bag","overview":"Eddy, Theo, Walter and Roxane are sinking more and more done in a spiral of violence and resentment. Eddy and Walter have two mobsters who killed Walter owed money. The homicide squad is dispatched to the offices of the Judicial Police and the General Inspection Service is on a war footing. Caught by Lemoine, Theo had to give the name of his accuser, who is none other than his lawyer. Roxane's worried about his colleagues, made of a cycle in which the young woman does not want to set foot.","production_code":"","runtime":50,"season_number":1,"show_id":37363,"still_path":"/eTzN7o4UYeyS10i5Qrsi5TNIRL8.jpg","vote_average":9,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2009-10-19","episode_number":4,"episode_type":"standard","id":844769,"name":"The Other Side","overview":"After an explosive action, Eddy is hospitalized. The noose is tightening around the team after the formalization of the investigation by the IGS. The order comes from above: Vogel has carte blanche to bring down the group, provided conclusive evidence. Walter is kidnapped just outside his home. Her captors, all ready to torture, demanding a ransom of 200,000 euros and require that the case remains secret.","production_code":"","runtime":50,"season_number":1,"show_id":37363,"still_path":"/rgzoveYeGkLDeLvV87JG1KVb1Nk.jpg","vote_average":9.1,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2009-10-26","episode_number":5,"episode_type":"standard","id":844770,"name":"Behind the Night","overview":"Eddy and Theo joined in on a robbery Lemoine. Their goal is simple: they hope to gather the ransom to secure the release of Walter. But they realize too late that the bandit has deceived. Indeed, the judicial police is already there. Narrowly, they manage to escape by taking hostage Roxane. For his part, Bordier was able to identify the kidnapper of Walter. This is a bloodthirsty mercenary named Zoran. Meanwhile, Vogel steps up efforts to monitor the team that is becoming more likely.","production_code":"","runtime":50,"season_number":1,"show_id":37363,"still_path":"/fVZwtq9AajzDUAP3uX3OWEGwgyC.jpg","vote_average":9.1,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2009-10-26","episode_number":6,"episode_type":"standard","id":844771,"name":"Group Rate","overview":"Roxane's father died of a heart attack after a threatening visit to Vogel. Meanwhile, Eddy and Theo found Lemoine. At the police station, a compromising video of the robbery could allow identification of Eddy and Theo. Bordier was able to locate the place where Walter Zoran holds. Joined by Eddy, Bordier and his band of former police intervene, thwarting the spinning of the IGS. The means used by Vogel to drop the team are increasingly sadistic.","production_code":"","runtime":50,"season_number":1,"show_id":37363,"still_path":"/1uK0Qvfx2gQArdptcAHc81JK5r2.jpg","vote_average":9,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2009-11-02","episode_number":7,"episode_type":"standard","id":844772,"name":"Tangent","overview":"Lemoine's lawyer is found dead. The prosecutor says the investigation Vanderbeke to the Central Office for the Repression of Banditry, led by Commander Marceau. Eddy and his team must find the first mobster to avoid being compromised. During this hunt, the death of Rossi takes a new light when his wife, Helen, documents discovered in a secret safe. While Walter and Theo's friend questioned Lemoine, Eddy goes to one of his contacts to find it. But Commander Marceau managed to find Lemoine together the team of Eddy.","production_code":"","runtime":50,"season_number":1,"show_id":37363,"still_path":"/5Mnr8CkG9bGsg1hgTfQtq2J5Ar2.jpg","vote_average":8.8,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2009-11-02","episode_number":8,"episode_type":"finale","id":844773,"name":"Eddy","overview":"Lemoine is in police custody, he immediately asked to speak only with Caplan. Eddy talks with him and promises to get him out, on pain of being denounced by Lemoine and go to jail for 20 years. Lemoine was summoned to the courthouse. Eddy and his three companions are an escape plan in motion, with the aim of killing Lemoine once escaped. The latter managed to escape from the courthouse. Lemoine They bring in a forest, and kill him. Once Lemoine knee, it shows them that he had rolled: he wore a microphone and was able to forward the discussions with Eddy and other cops, the prosecutor Vanderbeke. Eddy and Theo, who braquaient Lemoine, release their gun.","production_code":"","runtime":50,"season_number":1,"show_id":37363,"still_path":"/uExSzrOCW6RaLZxc1oK1YoKAK3B.jpg","vote_average":8.5,"vote_count":4,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":48630,"poster_path":"/yHVVVGNqhnz2lSWZFm0cOswMDjO.jpg","season_number":1,"vote_average":8.9},"2":{"_id":"5258e8bd760ee34661864853","air_date":"2011-11-21","episodes":[{"air_date":"2011-11-21","episode_number":1,"episode_type":"standard","id":844775,"name":"The Damned","overview":"Parties on a crusade on behalf of the memory of their friend dirty, the group of SDPJ 92 are stopped in extremis by special forces police. The time for accountability has arrived. The disciplinary board convened an emergency room Caplan in custody awaiting trial, and then dismisses Morlighem Delgado and their officer rank and reassigned to lower positions. As for Theo Vachewski, it is canceled at the effective life of the policy. Each of them will now have to regain balance and meaning to his existence. In a luxurious housing estate on the edge of Paris, four men murdered twelve to get their hands on 400 pounds of gold ...","production_code":"","runtime":50,"season_number":2,"show_id":37363,"still_path":"/u1WzifeC8fCCEWh8zzNlS0aShHo.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-11-21","episode_number":2,"episode_type":"standard","id":844774,"name":"Alone Against All","overview":"Merks is incarcerated in the prison where Eddie Caplan is also held. This one is offered a dangerous mission: to escape with the criminal to infiltrate the robbers in the team of the Unseen.","production_code":"","runtime":50,"season_number":2,"show_id":37363,"still_path":"/jMiZC5lcFNLxKmuAQSWvET8AHnJ.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-11-28","episode_number":3,"episode_type":"standard","id":844776,"name":"All for One","overview":"After the death of Mercks, Caplan finds himself alone and desperately needs to find a way to get in touch with the Unseen, these former military personnel returning from Angola to take revenge. The only track remaining at his disposal is the Elmidoro Miriam, the sister of Mercks, who heads a circle game in Paris. For their part, the Invisible trying to find a buyer for their 400 kilos of gold. They finally meet Ms. Arifa Latif and his son and Daniel. Moreover, it is a race against the clock to the rest of the group Caplan, who is trying to retrieve Theo in danger since Lemoine is on his trail ...","production_code":"","runtime":50,"season_number":2,"show_id":37363,"still_path":"/rroVZV2Q0hBED3rdbwlg0QYpZFZ.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-11-28","episode_number":4,"episode_type":"standard","id":844778,"name":"Goats and Jackals","overview":"Caplan comes into contact with the Unseen, who tortured him to force him to admit his responsibility in the death of Mercks. For their part, Roxanne and Myriam Morlighem decide to remove and use them as bargaining chips. Impressed by the courage Caplan, and convinced by his reputation as a cop dirty cop who fears no one, Colonel Dantin, Head of the Unseen, he finally proposes to replace their dead comrade. Does he accept, against payment in cash, to take over the flow of cargo of gold and negotiate directly with Arifa? Meanwhile, the Flemish owners of this gold come to Paris to reclaim their property ....","production_code":"","runtime":50,"season_number":2,"show_id":37363,"still_path":"/oOk26aEpsYoys2Cb1SYrlTaTrzn.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-12-05","episode_number":5,"episode_type":"standard","id":844777,"name":"Infiltrated","overview":"Caplan must lead through the dangerous mission of negotiating with Ms. Arifa to. Dantin's confidence is the price and Caplan must move forward. Marceau was left out of the lead of the infiltration in favor of General Smith. A man who does not hide its goal: eliminate Dantin and his men, burying the secret that unites them from the battlefields in Africa. When the Unseen, they are supported financially by a certain Irene Bleuvenne, president of a company specializing in the defense industry. It seems to eliminate Fevre ...","production_code":"","runtime":50,"season_number":2,"show_id":37363,"still_path":"/fLvbEq1T5yLwq2Zjg2keK3dDXRx.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-12-05","episode_number":6,"episode_type":"standard","id":844779,"name":"Mother (and) Homeland","overview":"Caplan sells gold to Arifa without difficulty and, as he foresaw, Dantin offered him another mission, but far more dangerous paramount: shine the local Bleuvenne Industries and seize their latest prototype, a revolutionary named inessive rifle. Why load Bleuvenne Irene Does the Invisible to steal his own prototypes? Caplan pierces the issue and his group. They will enjoy the flight of inessive to neutralize the Unseen and deliver it to General Smith, and so force him to recognize the success of the infiltration ...","production_code":"","runtime":50,"season_number":2,"show_id":37363,"still_path":"/uUeneGUlSQ3oEalWzVzSqxAjJ0a.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-12-12","episode_number":7,"episode_type":"standard","id":844780,"name":"In the Name of the Worst","overview":"After the robbery and the arrest of inessive Invisibles, Caplan no longer able to reach anyone: General Smith, as Marceau and Roxane, are conspicuously absent. While waiting to understand the reasons for this general silence, Caplan brings the Invisible car scrapping Rocky. Meanwhile, Ms. Arifa and her son Daniel and Miriam Latif remove, with whom Caplan began an affair rather tumultuous. The Arifa, who no longer want to pay for the last delivery of gold, offered to exchange the release of Miriam ...","production_code":"","runtime":50,"season_number":2,"show_id":37363,"still_path":"/7LthhErZFIswGrInorLFPeAXBP2.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-12-12","episode_number":8,"episode_type":"finale","id":844781,"name":"4 Minus 1","overview":"Roxane can finally reconnect with Caplan. Before disappearing, Smith confided to her and told her the secrets of Angola in particular and French Africa in general. He also referred to a bank vault in which was deposited an explosive issue on the role of France in inglorious some missions on the continent. This information very interested Bleuvenne Irene. Caplan will try to get your hands on this document coveted ...","production_code":"","runtime":50,"season_number":2,"show_id":37363,"still_path":"/fiDBZzVXQWZzZDusigMNBsLTCeq.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":48631,"poster_path":"/p2I8cUGcqjbpjIAdm6wdjUMwuEC.jpg","season_number":2,"vote_average":10},"3":{"_id":"536221b4c3a368395d0012db","air_date":"2014-02-10","episodes":[{"air_date":"2014-02-10","episode_number":1,"episode_type":"standard","id":975617,"name":"Affliction","overview":"After his car blew up, Theo was taken to hospital in a critical state. Caplan and Morlighem go to Vogel's place, determined to avenge their companion. Vogel finds an ally in the shape of Orianne Beridzé, who also wants to eliminate Caplan. Her plan is to force her father, an ex-cop, to contact Caplan and put him on the tail of a trafficking network run by the Russian Mafia. Meanwhile, Roxane is deeply upset about Theo and watches over him day and night.","production_code":"","runtime":50,"season_number":3,"show_id":37363,"still_path":"/catw5xtkeYY3LJIgNY4OlUPYcZH.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-02-10","episode_number":2,"episode_type":"standard","id":975618,"name":"Our Funeral","overview":"Caplan and Morlighem have intercepted a truck from a company belonging to the Russians and uncover a major prostitution ring. They are aided by a cop from Georgia, Andreas Megrelishvili, who informs them that a war between clans of the Vor V Zakone Mafia from different post-Soviet states is about to break out in Paris. Meanwhile, Roxane, who wants revenge for Vogel, strikes a deal with the former prosecutor, Vanderbeke.","production_code":"","runtime":50,"season_number":3,"show_id":37363,"still_path":"/80eL9DCzmAfVYFRqohbrtn4m0ZZ.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-02-17","episode_number":3,"episode_type":"standard","id":975619,"name":"Odessa","overview":"With the death of Vissarionovitch – who ruled as 'boss of bosses' over several Russian-speaking mafia clans – a bloody war of succession is shaping up between the two pretenders: Jordania and Pavlovitch. Roxane continues to operate alone, tracking down Vogel’s sister thanks to information provided by Vanderbeke. In the meantime, Caplan, Morlighem and Megrelishvili stake out the funeral where Vissiniarovitch’s burial service is due to take place. Odessa, a female contract killer, sets up shop in a hotel opposite, ready to strike.","production_code":"","runtime":50,"season_number":3,"show_id":37363,"still_path":"/qdF3EuX3kLHSCcONMRhYzVswUiC.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-02-17","episode_number":4,"episode_type":"standard","id":975620,"name":"Stoukatch","overview":"After an assassination attempt, Jordania is placed under police surveillance in hospital. His adversary, Pavlovitch, teams up with Atom Parajdanov. They are trying to get to Jordania any way they can. Caplan offers him a deal: hand over information on his rivals (become a 'stoukatch' – a traitor) in exchange for police protection. Meanwhile, Vogel and Oriane take Hélène Rossi hostage to put pressure on Caplan.","production_code":"","runtime":50,"season_number":3,"show_id":37363,"still_path":"/iCISeOJL2twbqovYMhGIQxF9yal.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-02-24","episode_number":5,"episode_type":"standard","id":975621,"name":"Milk and Honey","overview":"The Pavlovitch clan organizes the kidnapping of Salomé and her son to force Jordania into the open. Jordania has no option but to accept Caplan’s deal and turn traitor to protect his family. Roxane meanwhile has tracked down Vogel again. He is at her mercy, but she can’t bring herself to pull the trigger. She rejoins her unit, assigned as bodyguard for Jordania, and they head to a safe house 30 miles outside of Paris.","production_code":"","runtime":50,"season_number":3,"show_id":37363,"still_path":"/AktDrfipPDpoSLbGJynZfDUCS6z.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-02-24","episode_number":6,"episode_type":"standard","id":975622,"name":"Prologue","overview":"Oriane has managed to work her way into Caplan’s group as an interpreter. She is bent on vengeance. Caplan has his gun in his hand when the Russians launch an assault on their stakeout. Flashback: five years earlier. A war within police ranks between Rossi/Caplan’s unit and Vibert’s. During an operation, Vibert shoots a suspect in cold blood. Turned in by Caplan, Vibert is sent to prison. Oriane, who is in fact Vibert’s daughter, has been seeking to avenge her father ever since.","production_code":"","runtime":50,"season_number":3,"show_id":37363,"still_path":"/qkyALqs6YPKjwEEj0UiDO7APwhv.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-03-03","episode_number":7,"episode_type":"standard","id":975623,"name":"Andreas","overview":"The Russians got the better of Jordania, who was killed in the course of the attack. But how did the maximum security safe house get located so quickly? Caplan’s suspicions fall on Andréas. Under questioning, Andréas explains that he is working to a plan drawn up by Georgian police in agreement with their French counterparts, the aim of which is to lure the top boss of the Vor V Zakone from Moscow and to arrest him in France. And Caplan’s unit had better keep out of their way.","production_code":"","runtime":50,"season_number":3,"show_id":37363,"still_path":"/jJGo7sE9hyioKPX8vKpiuboVTbM.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-03-03","episode_number":8,"episode_type":"finale","id":975624,"name":"Between Earth and Hell","overview":"A change of allegiance leads to the arrest of Andréas. Despite their orders, Caplan and Morlighem continue to investigate. They manage to dismantle a drug ring involving Russians and Turks. Roxane and Hélène have fallen into the hands of Vogel, who gives Caplan a grotesque choice: which one does he want him to kill? While the various Vor clans kill each other in Paris, the lives of Caplan, Morlighem and Roxane are about to take a dramatic new turn.","production_code":"","runtime":50,"season_number":3,"show_id":37363,"still_path":"/pr5XdKM68E3g7ldA5LCqPYm6JYm.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"Caplan and his team must end a war between two clans.","id":60359,"poster_path":"/3gwlTivLrEasuV6Y53i6sc2wYYE.jpg","season_number":3,"vote_average":10},"4":{"_id":"57acc9ac9251414736001e65","air_date":"2016-09-12","episodes":[{"air_date":"2016-09-12","episode_number":1,"episode_type":"standard","id":1214037,"name":"The Old Way","overview":"They've barely solved the Russian Mafia case when Caplan, Walter and Roxanne find themselves faced with \"Baba\" Aroudj, head of the Turkish Mafia. As for Vogel, he finds himself in a mess in prison. But that's not enough for Caplan, who wants to definitively put him out of harm's way. Only to get to him, Caplan is going to have to reconnect with the ghost of a very painful personal past.","production_code":"","runtime":50,"season_number":4,"show_id":37363,"still_path":"/9zTMTv737bDprE5UEQUZFLKfsgC.jpg","vote_average":9.3,"vote_count":3,"crew":[],"guest_stars":[]},{"air_date":"2016-09-12","episode_number":2,"episode_type":"standard","id":1214038,"name":"My Share of Hell","overview":"The police of police isn't done with the Departmental Service of the Judicial Police (SDPJ) group. The investigation into Caplan's group and Bernardi is led by a devious cop: Chief Superintendent Henri Brabant. For his part, Walter is still enraged about the violent aggression his children suffered. Behind Caplan's back, he enlists Wassim Alcala, an old friend from the army, to find Charlie (Caplan's mysterious friend who appeared in season 3) to equip him which what he needs to take down the Turks.","production_code":"","runtime":50,"season_number":4,"show_id":37363,"still_path":"/xjo2d0VisyaN6vSxrHBxcaHTtFM.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2016-09-19","episode_number":3,"episode_type":"standard","id":1214039,"name":"Nathan","overview":"The first commando operation that Caplan, Walter and Wassim lead against the Turks, puts Baba Aroudj under the fire within his organisation.","production_code":"","runtime":50,"season_number":4,"show_id":37363,"still_path":"/72UkazS6LcofXVcpggFsOViKGsb.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[{"character":"Le coursier Turc","credit_id":"63a8739891b53000c309334a","order":500,"adult":false,"gender":2,"id":1890071,"known_for_department":"Acting","name":"Murat Subaşı","original_name":"Murat Subaşı","popularity":0.694,"profile_path":"/rrCj01tmstp2bJ3o0qK4l1pdFMJ.jpg"}]},{"air_date":"2016-09-19","episode_number":4,"episode_type":"standard","id":1214041,"name":"Pharaohs","overview":"The great Manitou of the Turkish Mafia organisation has decided to let Baba Aroudj go. Fatih Imrali shall serve as an intermediary with Caplan and Walter.","production_code":"","runtime":50,"season_number":4,"show_id":37363,"still_path":"/6SELxUpSPRDHiUg76d39sREWF7t.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2016-09-26","episode_number":5,"episode_type":"standard","id":1214044,"name":"Eleven Millimeter","overview":"By intervening in Marseilles to capture \"Baba\" Aroudj, Caplan and Walter interfere in an investigation into a bloody heist, committed ten years earlier in Aubagne. Commander Guido Frankeur, who never dropped the case, intends to charge Caplan and Walter for their interference. Unless the two Parisian cops help him to ruin the Turkish Mafia case in league with the Marseilles mobsters.","production_code":"","runtime":50,"season_number":4,"show_id":37363,"still_path":"/909dMCtolMpnXJcLEk3QrnWiHbJ.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2016-09-26","episode_number":6,"episode_type":"standard","id":1214046,"name":"Bankster","overview":"Caplan and Walter are struggling in the Marseilles bouillabaisse while in Paris, Roxanne and Bernardi find themselves in the middle of a drug deal that leads directly to mobsters Caplan knows well, having used their \"services\".","production_code":"","runtime":50,"season_number":4,"show_id":37363,"still_path":"/thhI2xkCtfrepZLEsuY1BFRmi44.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2016-10-03","episode_number":7,"episode_type":"standard","id":1214049,"name":"A Neverending Game","overview":"Caplan and Walter return to Paris. A return motivated by a blackmail forcing Caplan to organise the escape of a mobster who could ruin him by reporting him to Brabant, the Superintendent of the police determined to dismantle the SDPJ group and disgrace Caplan. At the same time, Georges Mandeville is in Paris to find some cash. Lots of cash!","production_code":"","runtime":50,"season_number":4,"show_id":37363,"still_path":"/dPerg3xPcW3RmalBkZwApudGBmX.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2016-10-03","episode_number":8,"episode_type":"finale","id":1214050,"name":"All The Way And Until The End","overview":"It's the home stretch for Caplan, Walter and Roxanne. At the end of this path of extreme justice that they've carved themselves, with their noblest intentions, love, family and death await them. And they will all pay a heavy price.","production_code":"","runtime":50,"season_number":4,"show_id":37363,"still_path":"/jpViK1nPdXuyhub5vsfVKgaTA8z.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[{"character":"Eddy Caplan","credit_id":"5258e8bd760ee34661864a2c","order":0,"adult":false,"gender":2,"id":7037,"known_for_department":"Acting","name":"Jean-Hugues Anglade","original_name":"Jean-Hugues Anglade","popularity":11.3,"profile_path":"/vidk0fZfz56flOBuUzZHDkwsGdb.jpg"}]}],"name":"Season 4","overview":"","id":79220,"poster_path":"/yg1mnqcPBtRloQDjlR4yt6q84BR.jpg","season_number":4,"vote_average":9.9}}}