{"adult":false,"backdrop_path":"/aCfyCPPoVYQM1hdDUaLgPgHIb2u.jpg","created_by":[{"id":1254073,"credit_id":"5258e8ff760ee3466186ad1a","name":"Suu Minazuki","gender":0,"profile_path":null}],"episode_run_time":[25],"first_air_date":"2009-10-05","genres":[{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"},{"id":18,"name":"Drama"}],"homepage":"http://kadokawa-anime.jp/soraoto/index.html","id":37437,"in_production":false,"languages":["ja"],"last_air_date":"2010-12-18","last_episode_to_air":{"id":845771,"name":"The Ladies Flap Their Wings in the Morning Forte","overview":"Tomoki makes a splash with the girls in swim class when he transforms into pool water. Later, the whole gang heads to a wedding - but who will be walking down the aisle?","vote_average":8,"vote_count":2,"air_date":"2010-12-18","episode_number":12,"episode_type":"finale","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/fN86DbHUooE9J5ltrtPnF2MsNne.jpg"},"name":"Heaven's Lost Property","next_episode_to_air":null,"networks":[{"id":252,"logo_path":"/zFZ5KCuvx7K0vP9XgGcidfXjuUd.png","name":"TV Aichi","origin_country":"JP"}],"number_of_episodes":25,"number_of_seasons":2,"origin_country":["JP"],"original_language":"ja","original_name":"そらのおとしもの","overview":"Girl-crazy Tomoki’s quiet life gets turned upside down when beautiful, winged Ikaros falls from the sky – and starts calling him master! She seems a little bit lost on Earth, and her origins are shrouded in mystery. One thing’s for sure, though – she just might have the power to make Tomoki’s every dream come true!\n\nThe heavenly hijinks continue in Heaven’s Lost Property: Forte! Tomoki may long for peace and quiet, but with Ikaros and Nymph still adjusting to life on Earth, things aren’t likely to calm down anytime soon. Plus, there’s a new Angeloid on the scene – and she’s been sent to eliminate Tomoki!","popularity":34.202,"poster_path":"/8H4aVnkpueXv9EEZUI6G3thU9Lh.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"2010-09-09","episode_count":2,"id":48717,"name":"Specials","overview":"","poster_path":"/bhWIGmSG2HnhKL7NVA3yOmzj1W0.jpg","season_number":0,"vote_average":0},{"air_date":"2009-10-05","episode_count":13,"id":48718,"name":"Heaven's Lost Property","overview":"Tomoki Sakurai often encounters a strange girl in his dreams asking for his help, but he can't remember her face when he wakes up. When an Unidentified Mysterious Animal (U.M.A.) falls out of the sky, his life of pacifism suddenly becomes complicated. The animal turns out to be an angel, Ikaros.","poster_path":"/1zSCrOxGevXyMG0LPrUSSZhW5YM.jpg","season_number":1,"vote_average":7.7},{"air_date":"2010-10-02","episode_count":12,"id":48716,"name":"Heaven's Lost Property Forte","overview":"Tomoki Sakurai's peaceful life is now long in the past, because he has to deal with two angeloids, Ikaros and Nymph, as well as with his friends from school, all of whom are very special in their own ways. Tomoki's recurring dream about an angel warning him from the rage of heavens is becoming very common, until one day a new angel, who is as powerful as Ikaros, arrives Earth with the sole purpose of terminating Tomoki—his dream is starting to connect both realities, the Earth and the Synapses.","poster_path":"/ccWlEJbw8B6ZIPRcimyBYattrYM.jpg","season_number":2,"vote_average":8.3}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.9,"vote_count":121,"season_data":{"1":{"_id":"5258e8f8760ee3466186a968","air_date":"2009-10-05","episodes":[{"air_date":"2009-10-05","episode_number":1,"episode_type":"standard","id":845775,"name":"A 'Naked' Hero Arises!","overview":"\"Peace and quiet is the best!\" That's the motto of everyday high schooler, Tomoki Sakurai. But his peaceful life is being torn apart after the girl Ikaros suddenly fell from the sky one day. She calls herself a \"Pet-class Angeloid\", and Tomoki her \"Master\" because he's the first person on Earth she met. Also, she has the mysterious power to make all his wishes come true!","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/sMNXtQLgW43gXbNbyLH4ykYLSgN.jpg","vote_average":7.3,"vote_count":3,"crew":[],"guest_stars":[]},{"air_date":"2009-10-12","episode_number":2,"episode_type":"standard","id":845774,"name":"Heavenly Romance","overview":"Sohara is in a bad mood after seeing Sakurai on top of Ikaros and getting the wrong idea. Ikaros hastily chases after her and, as such, Ikaros follows him to school. A card that Sakurai receives from Ikaros glows, and in that instant, Sohara's panties come off and go flying into the sky. It doesn't take much time at all before all the girls in school's panties are flying off into the sky!","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/tXLyqSPoq1UnXkPHKYU5wjJbaXT.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-10-19","episode_number":3,"episode_type":"standard","id":845777,"name":"An Angeloid's First Order","overview":"Tomoki, suffering from a never-ending amount of math homework, decides to have Sugata-senpai help him out. President Satsukitane leads him to Sugata's home, only to find that it's a tent pitched next to a river! Tomoki and the gang have fun camping next to the river after finishing their homework. Ikaros is told to go shopping for ingredients when they all decide to make curry, but...","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/AgtK02NmClX2fq4pVKVHeS68755.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-10-26","episode_number":4,"episode_type":"standard","id":845776,"name":"Love and a Triangle — Again","overview":"The flock of panties that flew off into the sky in Episode 2 have returned to Tomoki! Tomoki is estatic, but Sohara uses one of Ikaros's cards to make it so that any panties Tomoki sees will explode. Tomoki decorates his house with all of the panties, without knowing what Sohara has done. Will Tomoki be able to escape from his home with panty explosions looming around every corner? It's the first real action in \"SoraOto\"!","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/qempW01Eer94tlJlGzK3yPQSht2.jpg","vote_average":6.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-11-02","episode_number":5,"episode_type":"standard","id":845778,"name":"A Steamy Night with a Big Shot","overview":"Long story short, Tomoki's house is destroyed. Wandering aimlessly, in search of a place to stay, Tomoki and Ikaros are lent a hand by the class president, Satsukitane. Sohara and Sugata join the mix as they are invited to the home of the town's #1 big shot. They are given a warm reception. But, when they wake up in the morning, there's an angry mob with them!","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/t031YyDPRB9DeoTwBkVvO2EfjeB.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-11-09","episode_number":6,"episode_type":"standard","id":845779,"name":"Swimsuit Troops Go! Go! Go!","overview":"Summer vacation. The entire New World Discovery Club heads to the beach. Tomoki is surrounded by attractive girls in their swimsuits, but ends up having to deal with Ikaros. Sohara explodes with jealousy as Tomoki has his full attention on Ikaros. Ikaros shows another frightening side of herself because of a small situation and the second Angeloid...","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/wagclxXcyj0F1Ug0kQMmzKT0nF1.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-11-16","episode_number":7,"episode_type":"standard","id":845780,"name":"The 'Cute' New Girls","overview":"Ikaros and Nymph also settle down in Sakurai's house. They get bored while Itsuki is at school, use a card, and transfer into his school! They instantly become popular as two new beautiful transfer students. But then what does Nymph do when she quickly gets bored at school...?","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/c64kKe8FDyjlwSYsy1JNlEwJnjE.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-11-23","episode_number":8,"episode_type":"standard","id":845783,"name":"For Whom is the Festival Thrown?","overview":"A fun festival in Sorami town. But, at the student body president's suggestion, the entire town is turned into a survival game! The winner gets $100,000! Gunfire and shrieks fill the air, and who is the mysterious old man who lurks at night? Admist the chaos, Nymph and Ikaros team up to battle for their lives!","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/45GctFVwlNjskhIauyhlUYA0CVr.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-11-30","episode_number":9,"episode_type":"standard","id":845784,"name":"A Story that Starts with a Lie","overview":"Tomoki and the gang go to an outdoor BBQ. Tomoki tries to open a stall to make some money, but no matter what he does it fails. Then he gets Nymph's help to open a host club! Meanwhile, Ikaros is trying to act like a human for Tomoki's sake when she hears the words \"It's human to lie.\"","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/gQNGeRjcZJirhGQpOTBVN9HheJX.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-12-07","episode_number":10,"episode_type":"standard","id":845781,"name":"Where the Words of Angels Go","overview":"It's a musical showdown at the Cultural Fair! Ikaros is the star of the show when Tomoki and the gang put a band together and take on the classical orchestra of the nearby private academy!","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/7GXiOxmpFqQpAo8e90WtXzhMl89.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-12-14","episode_number":11,"episode_type":"standard","id":845782,"name":"Let's Go! My Paradise","overview":"Tomoki's on a mission to sneak into the girls' bathing area. With Sugata's assistance (and one of Ikaros's cards) he devises the perfect disguise to accomplish his goal: he transforms into a cute girl!","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/cq8UguZ1kjZNIHErwOBiSgjsTnO.jpg","vote_average":8,"vote_count":2,"crew":[{"job":"Key Animation","department":"Visual Effects","credit_id":"62eebdc9140bad007a31c71e","adult":false,"gender":2,"id":1286723,"known_for_department":"Directing","name":"Tatsuya Yoshihara","original_name":"Tatsuya Yoshihara","popularity":4.269,"profile_path":null}],"guest_stars":[]},{"air_date":"2009-12-21","episode_number":12,"episode_type":"standard","id":845785,"name":"The Chain Which Doesn't Grant Escape","overview":"No matter how hard their friends try to help, Ikaros and Nymph just can't seem to crack a smile. After the Angeloids decide to work on the problem together, they take Tomoki out on the town for a three-way date!","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/qQIckB3O3Ww8JmuiKcw5FT4Is8M.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2009-12-28","episode_number":13,"episode_type":"finale","id":845786,"name":"Heaven's Lost Property","overview":"After surprising Tomoki with a sudden farewell, Ikaros endures a treacherous encounter with Harpy and Gamma. If Ikaros can find a way to defeat them, she may finally break her chains and find the happiness she desires.","production_code":"","runtime":25,"season_number":1,"show_id":37437,"still_path":"/iZhoPBZK1FeEsGoOwq8VgWStm9N.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]}],"name":"Heaven's Lost Property","overview":"Tomoki Sakurai often encounters a strange girl in his dreams asking for his help, but he can't remember her face when he wakes up. When an Unidentified Mysterious Animal (U.M.A.) falls out of the sky, his life of pacifism suddenly becomes complicated. The animal turns out to be an angel, Ikaros.","id":48718,"poster_path":"/1zSCrOxGevXyMG0LPrUSSZhW5YM.jpg","season_number":1,"vote_average":7.7},"2":{"_id":"5258e8f8760ee3466186a936","air_date":"2010-10-02","episodes":[{"air_date":"2010-10-02","episode_number":1,"episode_type":"standard","id":845760,"name":"You Strip, Too! The Return of the Full-frontal Hero","overview":"Tomoki has another dream where the mysterious angel warns him of another Angeloid and after revealing the information to his friends, Nymph suggests they visit his dream via Dive Game which enables them to visit humans' dreams. The group, consisting of Tomoki, Sugata, Mikako and Suhara, leave into the dream to find themselves confronted with each other's dreams and an embarrassing revelation for Suhara. Ultimately, they are unable to visit Tomoki's dream and instead land on a bizarre world with a pillar with illegible words and hibernating evergreen trees. They return with more questions than answers and Sugata finally remembers a forgotten memory a year past when Ikaros first fell onto the Earth and winesses Astraea's arrival.","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/5Mg8t1btlAm9GvzTua9jlsOT4MF.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-10-09","episode_number":2,"episode_type":"standard","id":845761,"name":"Bombshell! The Angel is a Big Boob","overview":"Tomoki, much to his irritation and confusion, finds himself aroused by the antics of Ikaros and Nymph. This disturbs him greatly so he leaves for the mountains to train in the Zen monastery. At the same time, Astraea, the new angeloid lands at the monastery to dispatch Tomoki while Sugata informs the rest about her. Nymph and Ikaros ignore the threat calling Astaea an 'idiot' and leave Tomoki alone who himself is finding trouble ridding himself of his 'earthly desires'. Later, Sugata discovers Astraea and learns of the threat to Tomoki's life and more information on Synapse, the world where Angeloids come from.","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/oalgkPDZCZxxcWNEtnuPcHBRVJQ.jpg","vote_average":8.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-10-16","episode_number":3,"episode_type":"standard","id":845762,"name":"A Proud-fought Battle!","overview":"After unexpectedly divulging information of her assignment, Astraea attempts to attack Sugata to keep her secret safe. Unfortunately, she falls into the hands of Mikako, who upon seeing the gullible nature of the new Angeloid, fools her into joining a wrestling match at the local festival. Much like last time, Mikako entices Tomoki to join by putting up a prize of ten million yen and a chance to bathe with her family's geisha. Nymph wrestles with her emotions after losing her wings and master and finds herself yearning for a new one, Tomoki being her new candidate.","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/xc9qOBEn4zTHRVstGwgETWQoCY5.jpg","vote_average":8.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-10-23","episode_number":4,"episode_type":"standard","id":845763,"name":"Mortal Combat! Hot Spring Snowball Fight at 1.4° Below","overview":"Winter comes to the city and Astraea is still far from completing her mission of eliminating Tomoki. Mikako reels her into another of her sadistic tantrums and stages a mock battle between the girls and boys of her school by appointing Tomoki as the general of the boys' group while acting as the general of the girls' group herself. This time, she entices Tomoki to fall into her trap by putting up the reward to be able to do anything to the losing team. Nymph still yearns for a new master and Astraea faces a dilemma when she is unable to dispatch Tomoki due to his question to her actions being her own choice or not.","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/dAwLRboKiV4adAFBO0F9baTVG6a.jpg","vote_average":8,"vote_count":2,"crew":[{"job":"Director","department":"Directing","credit_id":"627d8a08006eee150289788b","adult":false,"gender":0,"id":3547011,"known_for_department":"Directing","name":"Kiyotaka Isako","original_name":"Kiyotaka Isako","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2010-10-30","episode_number":5,"episode_type":"standard","id":845766,"name":"The Brother Who Came From Heaven","overview":"Sugata and Sohara travel to Synapse with the aid of Nymph. Sohara accidentally drops an object onto the world below which falls into the hands of Tomoki who fashions it into a pedal bike that transforms into a robot. At Synapse, the two humans learn new details about the New World while Tomoki relishes his time with his new toy to satisfy his perverse actions. Sohara later destroys the toy and a new Angeloid is revealed post credits.","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/nsJwMH0fw269425cpIyzZZmYbRN.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-11-06","episode_number":6,"episode_type":"standard","id":845764,"name":"Reach a Decision! The Up and Down of Heaven and Hell","overview":"Astraea gets enrolled at Tomoki's school and tries unsuccessfully to dispatch of him. Later on, Nymph, Mikako, Sohara, Tomoki and Astraea join in a quiz competition to determine that Tomoki himself is not an 'idiot' as labeled by his schoolmates. His attempt proves futile and the events leave him to be an 'idiot' to the whole city than just in the school before. Astraea finds herself spending time with the group and acceptance which adds onto her dilemma and Daedalus discovers that Chaos, the new second generation Angeloid has been sent to Earth.","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/jjVnd3ngBkDrDPSzvLAo1LoTmR7.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-11-13","episode_number":7,"episode_type":"standard","id":845765,"name":"Tomoki Devours Watermelons","overview":"Even though they know it's a risky move, Astraea and Nymph decide to raid Ikaros's watermelon patch. Meanwhile, Sugata and Nymph find themselves in serious danger after infiltrating Synapse.","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/cJ9WDtEjHOrvsx0JntZ6mKdpcbj.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-11-20","episode_number":8,"episode_type":"standard","id":845768,"name":"The Voices of the Songstresses and the Angels Echo Through the Sky","overview":"The time has arrived for Astraea to make a choice. Will she do the Sky Master's bidding and destroy Ikaros and Nymph once and for all? Or will she listen to Tomoki and find the strength to choose her own destiny?","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/c9hPTTPuh1fNN5azQ4kPq6QDpbd.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-11-27","episode_number":9,"episode_type":"standard","id":845770,"name":"A Fierce Fight! Fishing at a Carnival of Dreams...","overview":"During the Summer Festival, Mikako organizes a fishing contest at the swimming pool. There's only one way to win: reel in the curviest catch! Later, Ikaros tries to find the best way to spend her allowance.","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/fXdEBoYMAyEsGBULJ4DpPYbX4i9.jpg","vote_average":8.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-12-04","episode_number":10,"episode_type":"standard","id":845767,"name":"Looking Through the Keyhole to the Field of Fantasy","overview":"Sohara teaches Ikaros about the ins and outs of marriage. Meanwhile, Tomoki puts the final touches on his summer project: a massive network of periscope-like tubing that allows him to sneak a peek at girls all over town!","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/svZUxDxeZprUJQH4q02LlZlhBpb.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-12-11","episode_number":11,"episode_type":"standard","id":845769,"name":"After an Elegy of Illusions","overview":"Tomoki takes action when Ikaros, Nymph, and Astraea are overpowered in battle against Chaos! After the fight ends, it looks like peaceful days are ahead - until it becomes obvious that Ikaros still faces a serious crisis.","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/leIQLs4aAE5xg2TZSZ2EMqiyhaJ.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2010-12-18","episode_number":12,"episode_type":"finale","id":845771,"name":"The Ladies Flap Their Wings in the Morning Forte","overview":"Tomoki makes a splash with the girls in swim class when he transforms into pool water. Later, the whole gang heads to a wedding - but who will be walking down the aisle?","production_code":"","runtime":25,"season_number":2,"show_id":37437,"still_path":"/fN86DbHUooE9J5ltrtPnF2MsNne.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]}],"name":"Heaven's Lost Property Forte","overview":"Tomoki Sakurai's peaceful life is now long in the past, because he has to deal with two angeloids, Ikaros and Nymph, as well as with his friends from school, all of whom are very special in their own ways. Tomoki's recurring dream about an angel warning him from the rage of heavens is becoming very common, until one day a new angel, who is as powerful as Ikaros, arrives Earth with the sole purpose of terminating Tomoki—his dream is starting to connect both realities, the Earth and the Synapses.","id":48716,"poster_path":"/ccWlEJbw8B6ZIPRcimyBYattrYM.jpg","season_number":2,"vote_average":8.3}}}