{"adult":false,"backdrop_path":"/vPaYmlPCafKmjAqgAtKvyIozgyB.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"1999-10-02","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":3747,"in_production":false,"languages":["en"],"last_air_date":"2000-02-21","last_episode_to_air":{"id":263041,"name":"Little Chock'Lit Shoppe of Horrors","overview":"Wanting to keep up with the new restaurant, Pop Tate allows Dilton to automate the Chock'Lit Shoppe, but the main processor used takes over the place.","vote_average":0,"vote_count":0,"air_date":"2000-02-21","episode_number":39,"episode_type":"standard","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null},"name":"Archie's Weird Mysteries","next_episode_to_air":null,"networks":[{"id":83,"logo_path":"/mE2ElX5BSeUhiT3V8qUhLjd3Nbz.png","name":"Teletoon","origin_country":"CA"},{"id":599,"logo_path":"/tNnUEFZV7RmtUsHxVG3RmQn2WUn.png","name":"Pax TV","origin_country":"US"},{"id":184,"logo_path":null,"name":"Syndication","origin_country":"US"}],"number_of_episodes":40,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Archie's Weird Mysteries","overview":"Archie's Weird Mysteries is an American animated children's television program, based on the Archie comics. The series premise revolves around a Riverdale High physics lab gone awry, making the town of Riverdale a \"magnet\" for B-movie style monsters. The show is distributed as meeting the FCC's educational and informational children's programming requirements, and is used by commercial stations in the United States to meet this guideline. Produced by DIC Entertainment, the show was initially shown mornings on the PAX network, often with infomercials bookending the program. The following season, its repeats were syndicated to television stations throughout the US, as a way to comply with mandatory E/I regulations.","popularity":6.828,"poster_path":"/7zdiVD3tW8pQ3C3HieEvVOnWVmJ.jpg","production_companies":[{"id":20477,"logo_path":"/u0zjebYOFWdLcpR4hxE8o2zwHKQ.png","name":"DiC Entertainment","origin_country":"US"},{"id":171306,"logo_path":null,"name":"Les Studios Tex S.A.R.L.","origin_country":"FR"}],"production_countries":[],"seasons":[{"air_date":"1999-10-02","episode_count":40,"id":11228,"name":"Season 1","overview":"","poster_path":"/4t0lHGmXnNSQq5QwQ9EOakThH1g.jpg","season_number":1,"vote_average":6}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.4,"vote_count":10,"season_data":{"1":{"_id":"525755b8760ee36aaa22b3aa","air_date":"1999-10-02","episodes":[{"air_date":"1999-10-02","episode_number":1,"episode_type":"standard","id":263000,"name":"Attack of the Killer Spuds","overview":"Jughead, after watching an entire movie marathon on television, calls into the station as part of a contest, and wins the odd prize of a potato. The next day, something seems different about old Jug, and he gives everybody gifts...more potatos. Soon it's realized that the potatos are being controlled by a powerful spud out for control of earth, and all of Riverdale's residents are being replaced by potatos acting as their clones! All except for Archie and Dilton, who must figure out a way to destory the potatos before it's too late.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-09","episode_number":2,"episode_type":"standard","id":263004,"name":"Driven to Distraction","overview":"The gang is annoyed with Archie for devoting so much time to his car Betsy; it seems that he likes his car more than he likes his own friends. But Archie, in the interest of his car, buys a pair of fuzzy dice from a mysterious shop. Perfect for Betsy! The only problem? When he puts them on, the car comes to life...she's not too keen on Archie's friends, and will stop at nothing until she has Archie all to herself.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-16","episode_number":3,"episode_type":"standard","id":263003,"name":"Me! Me! Me!","overview":"Veronica doesn't think she's as whiny and bratty as everybody says, and in fact, believes that it would be a whole lot better if everybody else were exactly like her. While holding an ancient artifact said to grant wishes, she voices this desire, and slowly, everybody in town begins turning into Veronica...and it isn't exactly as Ronnie had hoped!","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-23","episode_number":4,"episode_type":"standard","id":263001,"name":"Invisible Archie","overview":"Archie and Reggie are unhappy with Betty and Veronica's new muscle-bound interest, who just so happens to have recently edged Reggie off of the track team. So Reggie suggests that they use Dilton's new physique inhancing formula on themselves, which thus far has been proven to work on lizards. Dispite Archie's disapproval, both he and Reggie end up doused in the formula -- but instead of the desired result, they both turn invisible! While Dilton tries to correct the situation so that the boys don't vanish for good, Archie must track down Reggie, who is gleefully attempting to use his new-found invisibility to exact revenge on the girls' new crush.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-30","episode_number":5,"episode_type":"standard","id":262997,"name":"Attack of the 50-ft Veronica","overview":"Veronica is less than kind to Jughead for being different. She couldn't stand if she were different; nobody would like her anymore. Upon going with Archie to visit Dilton, Veronica accidentally zaps herself with a recently invented growth ray, which so far seems to have had no positive results. And then, Veronica begins to grow -- and grow -- and grow, and suddenly she's more different from everybody else than even Jughead is.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-11-06","episode_number":6,"episode_type":"standard","id":262998,"name":"The Haunting of Riverdale","overview":"Something is haunting Riverdale, and it seems to be related to the public library. After a bit of research, it is discovered that the ghost belongs to the former librarian, who was very devoted during life to the good of the library. It seems that she is still there because she has some unfinished business...and Jughead holds the key that will let her move on.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-11-13","episode_number":7,"episode_type":"standard","id":263002,"name":"Curse of the Mummy","overview":"Archie procrastinates way too much, all to the point where he breaks into the Museum to get his report done, evoking a Pharaoh's curse.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-11-20","episode_number":8,"episode_type":"standard","id":262995,"name":"Fleas Release Me","overview":"On a date with both Betty and Veronica, Archie's car is attacked by a werewolf, and after the three retreat back to Pop Tate's, Reggie happily reveals that it was a joke, and that he had been dressed as the monster. He's quite proud of his prank, but the next day, the police come by Riverdale High. There have been some disturbances around town, and the culprit was a werewolf. Archie refuses to back up Reggie's alibi, and so the prankster is taken off to jail. And later, a werewolf attacks again, wearing Reggie's letter jacket. It seems that Reggie really is the culprit, after all...or is he?","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-11-27","episode_number":9,"episode_type":"standard","id":262999,"name":"The Jughead Incident","overview":"When a spaceship lands in Riverdale, two secret agents call upon Archie for help. They are on the look out for anybody who displays signs of being abnormal, different from everybody else. And suddenly the finger is pointed at Jughead, whose unique personality seems to make him the obvious choice.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-12-04","episode_number":10,"episode_type":"standard","id":263006,"name":"Virtually Evil","overview":"After a bragging session from Reggie, the gang discovers the newest arrival to Riverdale, a carnival with a slightly too addictive virtual reality game. After blasting the game's evil monsters and winning multiple times against Reggie, Archie's new boastful attitude does little to impress the others. Not to mention that a glitch in the game due to Archie's carelessness in blasting his friends has allowed its monsters to escape into Riverdale!","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-12-11","episode_number":11,"episode_type":"standard","id":263014,"name":"Zombies of Love","overview":"When Veronica buys a potion to make Archie love her, it accidently gets put on everybody! Now she must find a way to break the spell, or its everyone will love her forever!","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-12-18","episode_number":12,"episode_type":"standard","id":263013,"name":"Brain of Terror","overview":"Moose's trouble with school work leads him to employ the use of Dilton's new invention, a helmet which seems to make him miraculously smart. But Moose soon becomes addicted to his new brains and keeps secretly using the machine, which grants him telekenises along with a dangerous angry streak -- and he leaves behind friends, football, and a heart-broken Midge in the process.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-12-25","episode_number":13,"episode_type":"standard","id":263011,"name":"Twisted Youth","overview":"The Riverdale water supply is infused with an age-reversing chemical, and suddenly, all of the town's adults are turning into teenagers...including Mr. Lodge and Mr. Weatherbee, who are set to compete in a drag race, and Miss Grundy, who has an amorous eye for Reggie.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-12-31","episode_number":14,"episode_type":"standard","id":263015,"name":"Monster in the Night","overview":"A monstrous man of incredible strength is making evening appearances in Riverdale. Archie's investigation leads him to uncover the side effects of a new energy drink being tested on unsuspecting citizens of Riverdale.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-07","episode_number":15,"episode_type":"standard","id":263005,"name":"Mega-Mall of Horrors","overview":"When a new mall opens up in Riverdale, the town's teens couldn't be happier. The seemingly kind owner has given them each a card entitling them to buy whatever their hearts desire...all on credit. But what the shoppers don't know is that their greed is turning them into mannequins when it's time to pay up, and the town has been hypnotized to forget that the missing teens ever existed. And soon, the only teen left is Jughead, who must overcome temptation to save his friends.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-17","episode_number":16,"episode_type":"standard","id":263010,"name":"Compu-Terror","overview":"Dilton rescues a computer with a highly efficient AI from destruction and installs it in Pop Tate's shop. But when the machine decides that humans themselves are inefficient, Archie must stop it before it destroys his friends.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-19","episode_number":17,"episode_type":"standard","id":263008,"name":"Misfortune Hunters","overview":"Betty Cooper's the good girl in town, always helping people out and doing good deeds. However, a pair of treasure hunters trick her into releasing a monster in the town! Can the good-hearted girl lock the monster up again forever?","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-20","episode_number":18,"episode_type":"standard","id":263022,"name":"Ship of Ghouls","overview":"When a pirate ship sank, the ghosts of the greedy pirates were forced to spend their time guarding the priceless treasure and slaughtering any who steal it. Unfortunately, a medallion has possessed Reggie and made him treasure-hungry! Can Archie and the gang save him from the blades of the pirates?","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2000-01-21","episode_number":19,"episode_type":"standard","id":263021,"name":"Something Is Haunting Riverdale High","overview":"Midge, Dilton, and Ethel aren't exactly the most popular of kids, so no one thinks much of it when they go missing. However, when Archie is rendered invisible and untouchable by one of Dilton's inventions he finds that he must work with them to stop the haywire machine from turning Riverdale into a ghost    town!  Can Archie learn enough about the classmates he usually ignores to help them turn the machine off, especially when they can barely move a stack of papers?","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-24","episode_number":20,"episode_type":"standard","id":263019,"name":"Supreme Girl vs. Dr. Arachnid","overview":"Veronica's gossip column is mean, but harmless, until Supreme Girl comes to town trying to stop Dr. Arachnid and Veronica learns everything about her! After Veronica blows the whistle on the superhero's weakness, can Supreme Girl still save the town?","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-25","episode_number":21,"episode_type":"standard","id":263018,"name":"Reggie or Not","overview":"Two aliens come to earth looking for somebody with a head full of knowledge, to drain for their own uses in taking over the planet. Enter the unsuspecting Reggie, who winds up trapped on their ship. The aliens, convinced that Reggie's friends might start to worry about him, decide to make a clone and send it back in his place. The only problem? The clone is nice...really nice. Archie isn't fooled by the imitation Reggie for a minute, but the rest of the gang are pleased with his \"\"change of heart\"\"...until they discover the truth.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-26","episode_number":22,"episode_type":"standard","id":263024,"name":"It Lives in the Sewers","overview":"Yesterday, Jughead lost his pet baby alligator Peanuts when Veronica flushed the poor thing down into the sewers; Jughead has been in mourning ever since. Today, there is a mysterious monster in the sewers, grown abnormally large from a toxic waste spill. Coincidence...?","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-27","episode_number":23,"episode_type":"standard","id":263026,"name":"Dream Girl","overview":"A very attractive young woman starts taking over archies dreams","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-28","episode_number":24,"episode_type":"standard","id":263023,"name":"Green-Eyed Monster","overview":"A sea creature, disguised as a beautiful green-haired, green-eyed exchange student, has an affection for redheads, and plans on taking the unsuspecting Archie for her husband. It's up to Betty and Veronica to discover their new rival's secret, and save Archie from her grasps.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-01-31","episode_number":25,"episode_type":"standard","id":263025,"name":"Cinemadness","overview":"Owing Jughead a favor, Reggie accompanies Jug to view what he is sure will be a dull old horror flick. But when Reggie discovers and falls in love with the beautiful starlet of the film, Vanessa Blaze, he starts dreaming of having her for real. After viewing another of her films -- in which she plays a biker chick destined to fight off evil imps with a penchant for destruction -- Reggie decides to ask a woman gifted in the art of magic for help in bringing the character into the real world. And all seems well, until it's discovered that not only did the girl enter into Riverdale...so did the imps! And now, it's up to Reggie to clean up the mess he's created.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-01","episode_number":26,"episode_type":"standard","id":263016,"name":"Beware of the Glob!","overview":"When Miss Beazley discovers Dilton's newest formula in the school fridge, she accidentally mistakes it for the secret ingredient to her tapioca pudding -- and once it's a part of the recipe, the pudding grows, and grows, until it's large enough to devour everything in its way! With Miss Beazley, Miss Grundy, and Betty in the beast's belly, it's up to Archie and Reggie to set aside their rivalry in order to work together to stop the pudding's rampage.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-02","episode_number":27,"episode_type":"standard","id":263017,"name":"The Day the Earth Moved","overview":"Archie has to ring a bell, put on a kilt, dance a jig, and sing a poem as part of his family tradition, or at least he did until the bell was torn down.  But when a giant worm moves through the town destroying anything that makes noise, will Archie really be better off having not completed the Andrews family tradition?","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-03","episode_number":28,"episode_type":"standard","id":263027,"name":"Dance of the Killer Bees","overview":"Prom is coming up, and Betty and Veronica are running a tight race for prom queen, with Ethel as a distant trailing contestant. However, when killer bees try to take over the school, Archie and Jughead are out of commission and Ethel must save the day on her own.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-04","episode_number":29,"episode_type":"standard","id":263030,"name":"Extra Terror-estrial","overview":"A cute alien enlists the gang's help in building advanced machinery, but are the teens really helping the right creature?","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-08","episode_number":30,"episode_type":"standard","id":263033,"name":"The Christmas Phantom","overview":"Archie is trapped alone in a department store for Christmas with a monster while everyone else tries to remember the spirit of Christmas.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-09","episode_number":31,"episode_type":"standard","id":263031,"name":"Scarlet Night","overview":"Part 1 of 3.   Veronica has a strange dream in which she isn't afraid of a vampire, but she is terrified of a red-haired girl. She recieves playful teasing about this, but then, a new girl comes to Riverdale High...a redhead named Scarlet.    Scarlet instantly clings to Archie, claiming a like interest in the supernatural, and she tells him that in three weeks, evil will be coming to Riverdale in the form of \"\"the eternal night of the vampires\"\". She tells him that there will be an ender, the only one who can stop the reign of evil in Riverdale; the ender will have a special amulet to aid in this task. So far the only thing she is sure about is that the ender will be female...    Meanwhile, Veronica converses with a strange shopkeeper, who is in possession of an amulet which she recognizes as one she saw in her dream He tells her that SHE is the ender, and gives her the object.    Now it seems that it is up to Veronica to prevent the eternal night of the vampires! But within the shop she","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525755b9760ee36aaa22b5cc","order":500,"adult":false,"gender":2,"id":990369,"known_for_department":"Acting","name":"Andrew Rannells","original_name":"Andrew Rannells","popularity":8.868,"profile_path":"/wOXFZssfq3wymBwuiMNVNBpPENB.jpg"}]},{"air_date":"2000-02-10","episode_number":32,"episode_type":"standard","id":263039,"name":"I Was a Teenage Vampire","overview":"Seems the vampire threat isn't over for Riverdale as Scarlet's master, Count Morlock, is unearthed and seeking to complete a propcey that will bring the enternal night: befriending (a.k.a vamping) the day bringer (a.k.a Veronica).","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-11","episode_number":33,"episode_type":"standard","id":263040,"name":"Halloween of Horror","overview":"Some Vampire's attack Veronica's Halloween party and capture Archie.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-14","episode_number":34,"episode_type":"standard","id":263032,"name":"Archie's Date with Fate","overview":"Part 1 of 3.\n\nWhile Dilton is busy perfecting his newly invented time-travel device, Jughead and Archie find themselves discussing fate, in which Jughead is a firm believer; Archie is uninterested, even after reading a horoscope that seemingly predicts the bad day which follows. That evening, during Archie's date with Veronica, Dilton comes to tell Archie about his new, improved time-travel device. Veronica is sour about the intrusion, and Dilton leaves, but is followed by Riverdale High's oldest senior, who's only goal in life seems to be buying nachos at Pop Tate's...and he has big plans for Dilton's device.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-15","episode_number":35,"episode_type":"standard","id":263035,"name":"Alternate Riverdales","overview":"Part 2 of 3.\n\nArchie wants revenge on Reggie after the jerk embarrasses him in front of the whole school, makes the girls mad at him, and makes Jughead think that Archie bought him a veggie burger. Yet this pales in comparison to Vinnie's revenge! A future Vinnie springs the past one from jail, and they change the town with their time machine. Can Archie overcome a Dilton-smitten Ethel, hardworking Veronica, and Vinnie-loyal Jughead to save the town?","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-16","episode_number":36,"episode_type":"standard","id":263036,"name":"Teen Out of Time","overview":"Part 3 of 3.\n\nWith Betty and Veronica still mad at him over his inability to choose a girlfriend and Jughead mad at him over his accepting a solo scholarship to Italy, Archie just wants to get out of Riverdale. But when he's thrown hundreds of years back in time while Vinnie tries to destroy all of Riverdale, he finds out how important he was to the town's history -- and future.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-17","episode_number":37,"episode_type":"standard","id":263029,"name":"Invasion of the Cockroaches","overview":"Pop Tate revitalizes his restaurant to cater to adults, but when all of the adults in the town sprout antenna and talk like robots, he finds that he might need the help of his former customers to save the town.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-18","episode_number":38,"episode_type":"standard","id":263038,"name":"The Incredible Shrinking Teens","overview":"While visiting a mad scientist convention, Archie and Jughead are accidently zapped by a shrinking ray, and they have to struggle for survival while being two inches tall in Jughead's messy room.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-02-21","episode_number":39,"episode_type":"standard","id":263041,"name":"Little Chock'Lit Shoppe of Horrors","overview":"Wanting to keep up with the new restaurant, Pop Tate allows Dilton to automate the Chock'Lit Shoppe, but the main processor used takes over the place.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":40,"episode_type":"finale","id":263042,"name":"Big Monster on Campus","overview":"Moose tries to prove he's more than just muscle when a rival team's star player outshines him, only for Archie to discover he's a robot.","production_code":"","runtime":30,"season_number":1,"show_id":3747,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":11228,"poster_path":"/4t0lHGmXnNSQq5QwQ9EOakThH1g.jpg","season_number":1,"vote_average":6}}}