{
    "adult": false,
    "backdrop_path": "/vtfj0WUOnHusPtQaEp36CRJPHAQ.jpg",
    "created_by": [],
    "episode_run_time": [
        60
    ],
    "first_air_date": "2011-04-11",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "http://www.foodnetwork.ca/topchefcanada/",
    "id": 37649,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2024-10-16",
    "last_episode_to_air": {
        "id": 5726872,
        "name": "The Gala Fundraiser",
        "overview": "The Chefs explore their sweet and savory sides in the Quickfire Challenge, where they must create a dish that can pair with an espresso beverage served with either breakfast or dessert. Then, it’s time for the first ever Top Chef Canada Gala Fundraiser. The Chefs are challenged with preparing 225 servings of the perfect hors d’oeuvre for over 150 guests at this exciting event to support a not-for-profit that gives back to the hospitality and restaurant industry.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2024-11-04",
        "episode_number": 4,
        "episode_type": "standard",
        "production_code": "",
        "runtime": 44,
        "season_number": 11,
        "show_id": 37649,
        "still_path": null
    },
    "name": "Top Chef Canada",
    "next_episode_to_air": {
        "id": 5734231,
        "name": "The Gala Fundraiser",
        "overview": "The Chefs explore their sweet and savory sides in the Quickfire Challenge, where they must create a dish that can pair with an espresso beverage served with either breakfast or dessert. Then, it’s time for the first ever Top Chef Canada Gala Fundraiser. The Chefs are challenged with preparing 225 servings of the perfect hors d’oeuvre for over 150 guests at this exciting event to support a not-for-profit that gives back to the hospitality and restaurant industry",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2024-11-11",
        "episode_number": 5,
        "episode_type": "standard",
        "production_code": "",
        "runtime": null,
        "season_number": 11,
        "show_id": 37649,
        "still_path": null
    },
    "networks": [
        {
            "id": 143,
            "logo_path": "/tm2UclPxfamHyFuILLq4jNxsi8v.png",
            "name": "Food Network",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 100,
    "number_of_seasons": 11,
    "origin_country": [],
    "original_language": "en",
    "original_name": "Top Chef Canada",
    "overview": "Top Chef Canada is a reality competition show. The first season premiered on April 11, 2011 on Food Network Canada. The first season consisted of 13 episodes, with 16 contestants vying for a grand prize of $100,000 and a GE Monogram kitchen valued at $30,000. Contestants shopped at Loblaws in season one and McEwan in season two. Like the original American series, each week the chef contestants compete against each other in culinary challenges. Contestants are judged by a panel of professional chefs and other notables from the food and wine industry, with one or more contestants being eliminated each week. The Canadian edition uses the same graphics and music as the American version of the program.\n\nSeason one of Top Chef Canada was one of Food Network Canada's most highly-rated programs. The network renewed the program for a second season, which began to air on March 12, 2012.",
    "popularity": 33.975,
    "poster_path": "/aNQFlIPTGfMvgetUkhuyaiPYx3O.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2011-04-11",
            "episode_count": 13,
            "id": 191677,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2012-03-12",
            "episode_count": 13,
            "id": 49002,
            "name": "Season 2",
            "overview": "The second season of the Canadian reality competition show Top Chef Canada was broadcast on Food Network in Canada. It is a Canadian spin-off of Bravo's hit show Top Chef. In the first season, 16 chefs competed against each other in weekly challenges. The program took place in Toronto.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2013-03-18",
            "episode_count": 13,
            "id": 49003,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2014-03-09",
            "episode_count": 10,
            "id": 191679,
            "name": "Season 4",
            "overview": "In the fourth season of the hit series Top Chef Canada, 14 of Canada's best and brightest chefs face off in a series of adrenaline-pumping challenges that test them mentally, physically and emotionally.  For the first time ever, an equal number of men and women compete for the title of Canada's Top Chef and $100,000. At the centre of the grueling competition is critically acclaimed chef and restaurateur Mark McEwan who resumes the role of head judge. Joining Chef McEwan at the Judges' Table are internationally acclaimed actress and series host Lisa Ray and no-nonsense L.A. restaurateur Shereen Arazm, who returns as resident judge.",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2017-04-01",
            "episode_count": 10,
            "id": 191683,
            "name": "Season 5",
            "overview": "Canada's most prestigious and high-stakes culinary competition is back! For the first time in franchise history, Top Chef Canada is bringing back some of the most accomplished chefs from the past four seasons to battle it out for a chance to earn what has eluded them all: the title of Canada's Top Chef!",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2018-04-08",
            "episode_count": 8,
            "id": 103097,
            "name": "Season 6",
            "overview": "Canada’s most prestigious culinary competition is back. This season we’re going coast, to coast, to coast, to find the next generation of chefs competing for the title of Canada’s Top Chef.\n\nThe epic sixth season introduces an impressive new generation of professional chefs who will prove their masterful skills in grueling challenges. Fighting for Canada’s most prestigious culinary title, chefs are rewarded for their skill and creativity in each Quickfire round. They will cook for their lives and fight to stay in the competition in the high-stakes Elimination Challenges, where one chef will be told to “pack their knives and go.”  The competing chefs will be judged by a panel of Canada’s most refined palates led by returning head judge, superstar chef and restaurateur, Mark McEwan. Each week, Mark is joined by host Eden Grinshpan (Eden Eats, Chopped Canada) and resident judges: food blogger and adventurer Mijune Pak, acclaimed culinary journalist Chris Nuttall-Smith and powerhouse restaurateur Janet Zuccarini. Throughout the season, the judging panel is joined by a series of renowned culinary masters and experts from here at home and abroad, each weighing in on the search for Canada’s next Top Chef.",
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2019-03-31",
            "episode_count": 8,
            "id": 121553,
            "name": "Season 7",
            "overview": "Canada’s most prestigious culinary competition is back with the best and brightest professional chefs competing for the title of Canada’s Top Chef.  For six seasons, Food Network Canada’s Top Chef Canada has been a ratings mega-hit and the most distinguished culinary competition in the country, propelling winners Dale McKay, Carl Heinrich, Matt Stowe, Renee Rodriguez, Nicole Gomes, and Ross Larkin into Canadian culinary stars.",
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        {
            "air_date": "2020-04-12",
            "episode_count": 8,
            "id": 147903,
            "name": "Season 8",
            "overview": "The epic sixth season introduces an impressive new generation of professional chefs who will prove their masterful skills in grueling challenges. Fighting for Canada’s most prestigious culinary title, chefs are rewarded for their skill and creativity in each Quickfire round. They will cook for their lives and fight to stay in the competition in the high-stakes Elimination Challenges, where one chef will be told to “pack their knives and go.”",
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        },
        {
            "air_date": "2021-04-19",
            "episode_count": 8,
            "id": 191570,
            "name": "Season 9",
            "overview": "The events of the last year have transformed the culinary industry, but just like a phoenix rises, Canada’s chefs are emerging stronger than ever with fresh new perspectives and unique new voices. This competition will shine a light on Canada’s culinary future by assembling 11 of the best professional chefs from across Canada to compete in brand-new challenges and never before seen twists in a season like no other. Canada is ready for the future of food, but only one chef will emerge from the competition with the title of Canada’s Top Chef.",
            "poster_path": null,
            "season_number": 9,
            "vote_average": 0
        },
        {
            "air_date": "2022-09-26",
            "episode_count": 8,
            "id": 310580,
            "name": "Season 10",
            "overview": "",
            "poster_path": null,
            "season_number": 10,
            "vote_average": 0
        },
        {
            "air_date": "2024-10-14",
            "episode_count": 5,
            "id": 424062,
            "name": "Season 11",
            "overview": "The most prestigious and exciting culinary competition in the country returns with Canada’s best up and coming chefs fighting for the future of the culinary world, and the title of Canada’s Top Chef.",
            "poster_path": null,
            "season_number": 11,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 4.4,
    "vote_count": 5,
    "season_data": {
        "1": {
            "_id": "6080e786aa659e0057f248cc",
            "air_date": "2011-04-11",
            "episodes": [
                {
                    "air_date": "2011-04-11",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2893705,
                    "name": "Getting To Know You",
                    "overview": "In the series debut, viewers meet the 16 chefs who will compete for the title of Canada’s Top Chef. The first Quickfire Challenge of the season tests their kitchen prowess in a heated culinary skills tournament. In the Elimination Challenge, head judge Chef Mark McEwan challenges the competitors to create a dish that tells a story of who they are.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-18",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2893706,
                    "name": "Cheese, Glorious Cheese",
                    "overview": "In the high stakes Quickfire Challenge, the chefs must create an inspired breakfast dish using 100% cow’s milk cheese from the Dairy Farmers of Canada. For the Elimination Challenge, the chefs host an art gallery cocktail party where they serve hors d’oeuvres that use cheese to paint a picture of their teammate.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-04-25",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2893707,
                    "name": "From Russia with Vodka",
                    "overview": "The remaining chefs compete in the classic Top Chef Blindfold Taste Test for the Quickfire Challenge. Later, the chefs divide into teams to create a traditional Russian Zakusky – tapas style meal – using pure filtered vodka.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-02",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2893708,
                    "name": "Food From Around the World",
                    "overview": "With a focus on food from around the world, the chefs must create their own unique salad for the Quickfire Challenge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-09",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2893709,
                    "name": "Pork to the People",
                    "overview": "In this episode, the chefs go whole hog as they work with a favourite ingredient – PORK. For the Quickfire Challenge, the chefs must properly butcher a whole pig. In the Elimination Challenge, the chefs use the same pork they butchered to create dishes at George Brown Chef’s School for a cocktail party in support of Food Banks of Canada. Senior students from the Chef’s School at George Brown lend a helping hand.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-16",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2893710,
                    "name": "The French Feast",
                    "overview": "In this episode, the chefs recreate their version of the classic Canadian snack food poutine for the Quickfire Challenge. Later, they dive deep into the world of classic French cuisine. Each must prepare a ten-course menu that features classic French proteins for an internationally-acclaimed French chef and restaurateur.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-23",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2893711,
                    "name": "Life's Little Milestones",
                    "overview": "In the Quickfire Challenge, the chefs must create a dish using the secret ingredient, All Bran Cereal. During the Elimination Challenge, the chefs must create a special occasion menu for a group of couples celebrating a special anniversary. The chefs are split into three different groups and must create a selection of appetizers, mains and deserts that are described as “Familiar Food with a Twist.”",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-30",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2893712,
                    "name": "Restaurant Wars",
                    "overview": "In the signature Top Chef challenge, Restaurant Wars, the chefs are tasked with creating a restaurant concept, menu and performing a full service for a restaurant full of discerning diners. The remaining chefs are split into two teams of four and each given a section of Chef McEwan’s popular Toronto eatery Bymark to debut their menus. In the Quickfire Challenge, the chefs join forces to compete in the ever challenging Blind Fold Relay Race.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-06",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2893713,
                    "name": "The Numbers Game",
                    "overview": "In the Quickfire Challenge the chefs must create a dish using only a certain number of ingredients as determined by a knife pull. For the Elimination Challenge, the chefs must create an amazing dish that could easily be recreated by the everyday Loblaws customer using a specific number of President’s Choice™ signature products. The chefs serve their creations to a group of everyday Loblaws shoppers.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-13",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2893714,
                    "name": "A Day in the Life of Canadian Food",
                    "overview": "In this episode, the chefs draw inspiration from the Canadian landscape. For the Quickfire Challenge, the chefs create three distinctive Porter Airline snack boxes for the commuter airline’s consideration to serve in flight. For their Elimination Challenge, the chefs must choose a distinct region of Canada and create a day’s worth of meals from their chosen region. Regions featured include: BC Interior, Wild Rose Country, The Prairies, Ontario Greenbelt, La Belle Province, and the Maritimes.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-20",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2893715,
                    "name": "Surf and Turf",
                    "overview": "In this episode, the chefs are challenged to take haute cuisine to the street. For the Quickfire Challenge, the chefs create two distinctive dishes with international flair that can be served from a street cart in Toronto’s Nathan Phillips Square. In their Elimination Challenge, the chefs choose from a selection of seafood to create three distinct dishes in a very short period of time.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-27",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 2893716,
                    "name": "Chef McEwan's Favourite Things",
                    "overview": "In this episode, the chefs start off with a Quickfire that challenges them to create a dish inspired by popular Canadian movies (Porky’s, My Big Fat Greek Wedding, Naked Lunch, Bon Cop/Bad Cop). For their Elimination Challenge, the chefs are invited to have breakfast with Chef McEwan and discuss his favourite foods. Later, the chefs must use that information to create a special family style meal for Mark and some very close friends.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-04",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 2893717,
                    "name": "Finale",
                    "overview": "In the final episode, the remaining chefs are first challenged to create a BBQ beach picnic for a group of hungry volleyball players using Richard’s, Red, White and Dark Beers. In their final Elimination Challenge, the chefs must create a multi-course meal of their own design. The chefs are given a secret ingredient upon arrival at the restaurant. The winner of this very important meal is declared Canada’s Top Chef.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 191677,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5258ea74760ee34661887f5a",
            "air_date": "2012-03-12",
            "episodes": [
                {
                    "air_date": "2012-03-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 961947,
                    "name": "Getting To Know You",
                    "overview": "In the series debut, viewers meet the 16 chefs who will compete for the title of Canada’s Top Chef.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-19",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 961112,
                    "name": "Cheese, Glorious Cheese",
                    "overview": "In the high stakes Quickfire Challenge, the chefs must create an inspired breakfast dish using 100% cow’s milk cheese from the Dairy Farmers of Canada. For the Elimination Challenge, the chefs host an art gallery cocktail party where they serve hors d’oeuvres that use cheese to paint a picture of their teammate.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-26",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 961536,
                    "name": "From Russia with Vodka",
                    "overview": "The remaining chefs compete in the classic Top Chef Blindfold Taste Test for the Quickfire Challenge. Later, the chefs divide into teams to create a traditional Russian Zakusky – tapas style meal – using pure filtered vodka.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 961535,
                    "name": "Food From Around the World",
                    "overview": "With a focus on food from around the world, the chefs must create their own unique salad for the Quickfire Challenge this week. For their Elimination Challenge, the chefs are dispatched to different ethnic neighbourhoods to purchase their ingredients. Using those ingredients, they must create a hot and a cold dish that is inspired by different world cuisines.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-09",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 961108,
                    "name": "Pork to the People",
                    "overview": "For the Quickfire Challenge, the chefs must properly butcher a whole pig. In the Elimination Challenge, the chefs use the same pork they butchered to create dishes at George Brown Chef’s School for a cocktail party in support of Food Banks of Canada. Senior students from the Chef’s School at George Brown lend a helping hand.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-16",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 961109,
                    "name": "The French Feast",
                    "overview": "The contestants put their own spin on poutine. Later, they take on classic French cuisine.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-23",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 961945,
                    "name": "Life's Little Milestones",
                    "overview": "The chefs must use All-Bran cereal in dishes for the Quickfire Challenge. Then they prepare a romantic meal for couples celebrating a special anniversary.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-30",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 961111,
                    "name": "Restaurant Wars",
                    "overview": "In this episode, the competitors compete in the signature Top Chef challenge, Restaurant Wars. Special guest, David Adjey, sits at the judges' table.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-07",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 961537,
                    "name": "The Numbers Game",
                    "overview": "The chefs must create an amazing dish using a specific number of President's Choice™ signature products.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-14",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 961107,
                    "name": "A Day in the Life of Canadian Food",
                    "overview": "The chefs must choose a distinct region of Canada and create a day's worth of meals from their chosen region.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-21",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 961110,
                    "name": "Surf and Turf",
                    "overview": "In this episode, the chefs are challenged to take haute cuisine to the street. For the Quickfire Challenge, they create two distinctive dishes with international flair that can be served from a street cart in Toronto's Nathan Phillips Square. In their Elimination Challenge, they choose from a selection of seafood to create three distinct dishes in a very short period of time.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-28",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 961944,
                    "name": "Chef McEwan's Favourite Things",
                    "overview": "The chefs must create a special family style meal for Mark and some very close friends.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-06-04",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 961946,
                    "name": "Finale",
                    "overview": "The chefs are first challenged to create a BBQ-themed meal, followed by a 3-course menu of their own design.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "The second season of the Canadian reality competition show Top Chef Canada was broadcast on Food Network in Canada. It is a Canadian spin-off of Bravo's hit show Top Chef. In the first season, 16 chefs competed against each other in weekly challenges. The program took place in Toronto.",
            "id": 49002,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5258ea74760ee34661887f6d",
            "air_date": "2013-03-18",
            "episodes": [
                {
                    "air_date": "2013-03-18",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 850491,
                    "name": "My First Dish",
                    "overview": "In the season debut, the 16 chefs arrive in Toronto where they meet for the first time and size up the competition. For their first Quickfire Challenge, head judge Chef Mark McEwan puts the chefs’ skills to test in a culinary relay race. Later in the Elimination Challenge, the chefs must recreate the very first dish that inspired them to become a chef. Chef Chuck Hughes (Chuck’s Day Off) joins as guest judge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-25",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 850499,
                    "name": "Down on the Farm",
                    "overview": "In the Quickfire Challenge, the chefs must create a dish using the contents of an MRE (Meal Ready to Eat) for the star of the hit TV series Survivorman, Les Stroud. In the Elimination Challenge, the chefs divide into pairs and go on an old-fashioned scavenger hunt as they search for food to create a farm feast. Chef Robert Irvine from Food Network’s Restaurant: Impossible joins as guest judge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-01",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 850493,
                    "name": "The Category is Food",
                    "overview": "In the Quickfire Challenge, the chefs must create the ultimate Vegan dish for the host of George Stroumboulopoulos Tonight, George Stroumboulopoulos. In the Elimination Challenge, the chefs break into different groups and they must create dishes for different food service categories. The categories match the different operations of Senses Restaurant within their home at the SoHo Metropolitan Hotel. Guest judge for this challenge is internationally acclaimed chef and restaurateur Daniel Boulud.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-08",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 850492,
                    "name": "Roller Derby Smackdown",
                    "overview": "In the Quickfire Challenge, the chefs must create their own take on a coffee shop staple – the donut. For the Elimination Challenge, the chefs need to create a healthy and balanced meal for a local roller derby match. Joining at judges table is Chef Elizabeth Falkner (The Next Iron Chef: Redemption) and WWE superstar Trish Stratus.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-15",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 850496,
                    "name": "A Day at the Ballet",
                    "overview": "For the Quickfire Challenge, Chef McEwan puts on his chef whites and cooks up an amazing dish in record time. Then the chefs need to make a dish that rivals Chef McEwan’s creation in the same amount of time – it is the reverse quickfire. For their Elimination Challenge, the chefs create canapés for a cocktail party in support of Canada’s National Ballet School. Guest judge is Canadian ballet star Rex Harrington.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-22",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 850497,
                    "name": "Here Comes the Bride",
                    "overview": "In this Quickfire Challenge, resident judge Shereen Arazam tests the chefs on their ability to properly create and price a dish in the first ever Top Chef Canada auction. Later in the Elimination Challenge, Shereen gets the chefs to help her with the menu for a surprise wedding shower for Top Chef Canada host Lisa Ray. Season one Chef Andrea Nicholson is guest judge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-29",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 850489,
                    "name": "Our New National Dish",
                    "overview": "In the Quickfire Challenge, the chefs put their taste buds to the test in a head-to-head taste-off and in the Elimination Challenge, the chefs must come up with their take on what Canada’s New National Dish should be. Guest judging is David Rocco, host of David Rocco’s Amalfi Getaway.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-05-06",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 850500,
                    "name": "Restaurant Wars",
                    "overview": "In the Quickfire Challenge, the chefs need to create their take on a frozen pizza for noted Italian Chef Massimo Capra of Restaurant Takeover. Then it is time for the Top Chef classic challenge, Restaurant Wars. The chefs split into two teams and battle it out for the best restaurant concept and execution. Joining the judges at the table this week is celebrated Montreal Chef Normand Laprise.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-05-13",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 850495,
                    "name": "Chefs on Safari",
                    "overview": "In the Quickfire Challenge, the chefs must create a dish inspired by a classic cocktail. For their Elimination Challenge the chefs head to the Toronto Zoo where they work as a team to create a special tasting menu inspired by different regions and animals. The winner of Top Chef: Las Vegas, Chef Michael Voltaggio, joins as guest judge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-05-20",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 850490,
                    "name": "The Indian Feast",
                    "overview": "In the Quickfire Challenge, the chefs must create a dish based on a destination that Toronto Pearson Airport serves. The trick is they need to create this dish on the tarmac at Canada’s busiest airport with planes landing and taking off all around them. Later in the Elimination Challenge, the chefs must create an Indian feast for the judges and guests Chef Vikram Vij and international comedy superstar Russell Peters.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-05-27",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 850488,
                    "name": "Here Come the Wives",
                    "overview": "In the Quickfire Challenge, the chefs must make a decadent dessert for one of the stars of The Real Housewives of Vancouver, Jody Claman. In the Elimination Challenge, Jody asks the chefs to create luxurious and decadent party food for a garden party she is hosting for her friends from The Real Housewives of Vancouver.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-06-03",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 850498,
                    "name": "Up In The Air",
                    "overview": "For the Quickfire Challenge, the chefs battle it out in a burger war to create the ultimate Top Chef burger and in the Elimination Challenge, they take flight. Each chef must create a multi-course meal for Air Canada’s Executive First Service – and they need to serve it on board an Air Canada 767 aircraft. Joining the judges is James Beard Award winning Chef Charlie Palmer.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-06-10",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 850494,
                    "name": "Wild Rose Finale",
                    "overview": "In the final episode, the chefs head to Calgary, Alberta and face-off for the title of Canada’s Top Chef. Connie DeSousa and Jann Arden join the Judges' Table.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 49003,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "6080eb7e160e730029995a77",
            "air_date": "2014-03-09",
            "episodes": [
                {
                    "air_date": "2014-03-10",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2893718,
                    "name": "The Battle of the Sexes",
                    "overview": "In the season debut, 14 of the country’s best chefs arrive in Toronto to compete in Canada’s biggest and best culinary competition for the most extreme season yet. The culinary frenzy begins with the first QuickFire in which head judge Chef McEwan pairs the chefs up in a prep-and-cook relay race. Later, the Elimination Challenge marks the first Battle of the Sexes Challenge in which the men and women go head-to-head to create a five course tasting menu at the SoHo Met Hotel. Chef Susur Lee serves as guest judge and Chopped Canada host Dean McDermott and wife Tori Spelling join for this gender-themed cook off.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-17",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2893719,
                    "name": "The World According to Chang",
                    "overview": "The QuickFire Challenge gets slippery as the chefs dig deep into a giant bowl of noodles to find a specific ingredient they must use in a noodle-inspired dish. In the Elimination Challenge, the chefs pair off to create dishes for an Asian family style meal. In both challenges, the chefs compete to impress the legendary Chef David Chang of the Momofuku Restaurant Group who joins as guest judge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-24",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2893720,
                    "name": "Five-Alarm Fire",
                    "overview": "This episode’s hot and spicy QuickFire Challenge requires the chefs to showcase peppers that vary in intensity based on the Scoville Heat Scale. The competition gets even hotter in the Elimination Challenge as the chefs cook a buffet meal for Toronto’s Bravest at the Toronto Fire Academy – but they must first rescue their ingredients from a burning building. This action-packed challenge pits men against women to find out who can take the heat. Chef Roger Mooking joins as guest judge for both challenges.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-31",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2893721,
                    "name": "Chef's Start Your Engines",
                    "overview": "In the QuickFire Challenge, the chefs face off in a culinary skills tournament featuring the ever-versatile egg. Things speed up in the Elimination Challenge as the chefs head to the racetrack where they create southern style street food for a group of race fanatics. The chefs prove who can cut it in the fast lane in this daring, high-speed challenge. Joining the judges table is Zane Caplansky and Chef Pino Posteraro.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-07",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2893722,
                    "name": "Game, Set, Match",
                    "overview": "The chefs are in knots for the QuickFire Challenge with Top Chef Canada season three winner Matthew Stowe who returns to judge the first ever Top Chef three-legged cook-off. The Elimination Challenge takes the chefs to the big leagues to cook for Toronto Raptors forward Amir Johnson at Real Sports Bar and Grill. In this challenge, the chefs must create their take on fine dining using classic snacks found at sports venues.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-14",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2893724,
                    "name": "Restaurant Wars",
                    "overview": "In this QuickFire Challenge, Iron Chef superstar judge Chef Morimoto puts the remaining chefs to the test to see what they can whip up using Canadian lentils. For the Elimination Challenge the chefs face off in Restaurant Wars – the ultimate test for any chef.  In this full-throttle battle, only one team can prevail. Joining Lisa, Mark and Chef Morimoto is guest resident judge Chef Lynn Crawford.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-21",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2893725,
                    "name": "Lords and Ladies at the Castle",
                    "overview": "In the QuickFire Challenge, the chefs are tasked to create a delectable dish using extreme and weird ingredients such as crocodile, cactus, crickets, mealworms, corn smut, and bull testicles. Food adventurer Bob Blumer stops by to judge which chefs have the strongest dish – and stomach. Later, a medieval food battle takes place at Casa Loma for the Elimination Challenge in which the chefs must create food fit for a king at a castle garden party. Guest judge is Chef Hugh Acheson and guest resident judge is Chef Lynn Crawford.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-28",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2893726,
                    "name": "School's Out for the Chefs",
                    "overview": "In the QuickFire Challenge the chefs are “as cool as a cucumber” after they’re tasked with creating a dish based on a popular food idiom for guest judge Chef Wylie Dufresne.  In the Elimination Challenge, the chefs head back to school to create a healthy lunch buffet using only real wholesome foods.  Chef Chuck Hughes and Top Chef Canada season 3 runner-up Danny Smiles guest judge to determine who has an A+ dish.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-05-05",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2893727,
                    "name": "The Science of Food",
                    "overview": "In the QuickFire Challenge, the chefs must create the best cookies ever for Chef Duff Goldman from Food Network’s Ace of Cakes.  In the Elimination Challenge, the final five chefs head to the Ontario Science Centre in an experimental challenge that explores molecular gastronomy as they create one last dish before the finale. Chef Susur Lee returns as guest judge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-05-12",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 2893729,
                    "name": "The Finale's Taboo",
                    "overview": "The Top Chef Canada finale is here and the chefs make a Bond-style entrance as they drop into the final location to create the meal of a lifetime.  Only one will win it all and take home the title of Canada’s Top Chef.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "In the fourth season of the hit series Top Chef Canada, 14 of Canada's best and brightest chefs face off in a series of adrenaline-pumping challenges that test them mentally, physically and emotionally.  For the first time ever, an equal number of men and women compete for the title of Canada's Top Chef and $100,000. At the centre of the grueling competition is critically acclaimed chef and restaurateur Mark McEwan who resumes the role of head judge. Joining Chef McEwan at the Judges' Table are internationally acclaimed actress and series host Lisa Ray and no-nonsense L.A. restaurateur Shereen Arazm, who returns as resident judge.",
            "id": 191679,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "6080eec7160e7300771a268a",
            "air_date": "2017-04-01",
            "episodes": [
                {
                    "air_date": "2017-04-02",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2893733,
                    "name": "All-Stars Assemble",
                    "overview": "Top Chef Canada is back! In the season debut, Host Eden Grinshpan and Head Judge Mark McEwan welcome back 12 All-Star Chefs to compete in the most prestigious culinary competition in the country and battle it out for the title that has eluded them all: Canada’s Top Chef. For their first QuickFire in the brand-new Monogram kitchen, the chefs must create a dish that represents one of Canada’s four seasons. Later, in the Elimination Challenge, the chefs are challenged to take the ingredients from the dishes that sent them packing from their original seasons and use them to create an All-Star quality dish. At the table for this all-important first elimination are Eden, Chef McEwan, and a brand-new panel of expert resident judges, Chris Nuttall-Smith, Mijune Pak and Janet Zuccarini.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-09",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2893734,
                    "name": "Street Markets of the World ... Unite!",
                    "overview": "It’s a shuck off! In the QuickFire Challenge, the chefs face-off in a culinary skills tournament featuring fish filleting, shallot dicing, and oyster shucking. In the Elimination Challenge, the chefs set off on a round-the world culinary adventure to cook dishes inspired by some of the world’s most famous street food markets. Chef Susur Lee is guest judge and joins the resident judges and a crowd of 75 for a Top Chef Canada pop-up street market at Toronto’s Artscape Wychwood Barns.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-16",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2893737,
                    "name": "Feast from the Middle East",
                    "overview": "In the QuickFire challenge the chefs go back to their culinary roots to be tested by guest judge Chef John Higgins on the five French mother sauces. And later in the Elimination Challenge, the chefs are split into two teams to create three-course progressive menus showcasing the diverse and decadent flavours of Middle Eastern cuisine. Acclaimed cookbook author and master of middle-eastern cooking Sabrina Ghayour joins as guest judge at Diwan, Chef McEwan’s restaurant in the Aga Khan museum.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-23",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2893738,
                    "name": "Meals Made in Canada",
                    "overview": "In the QuickFire Challenge, the chefs must create their All-Star interpretation of what is becoming the most important meal of the day…brunch! For the Elimination Challenge, the chefs create All-Star quality dishes inspired by Canadian cities. Joining as guest judge is iconic Canadian Chef Lynn Crawford.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-30",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2893739,
                    "name": "Retail Wars!",
                    "overview": "In the QuickFire Challenge, culinary superstar Daniel Boulud asks the chefs to re-create some of his favourite dishes…but the All-Stars are in for a very unexpected twist. The Elimination Challenge features a Top Chef first as the chefs are split into two teams to create the ultimate menu on-the-go for Retail Wars! Joining as guest judge is world-famous chef and retail food maven Lidia Bastianich.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-07",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2893740,
                    "name": "Happy Birthday Canada!",
                    "overview": "In this QuickFire Challenge, YouTube sensation Josh Elkin stops by to challenge the remaining chefs to create All-Star dishes using Krave Jerky. For the Elimination Challenge, the chefs must take an important moment in Canadian history and make a dish worthy of Canada’s 150th birthday. Chef Jeremy Charles is guest judge as the All-Stars serve their historic meals at the Royal Ontario Museum.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2893741,
                    "name": "Ice Cream, You Scream, All-Aboard!",
                    "overview": "In the QuickFire Challenge, the chefs fly blind and pick ingredients without knowing that they will be using them to make….ice cream! Later, in the Elimination Challenge, the All-Stars go deep underground to serve decadent late night eats to a crowd of 100 on the platform of Toronto’s Lower Bay subway station. Guest Judge Chef Grant van Gameren is on hand to determine who’s aboard and who will get left behind.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-21",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2893743,
                    "name": "Pleased to Deceive You",
                    "overview": "After receiving heartfelt video messages from their mentors, the final five chefs are challenged to create a dish using ingredients packed for them by those same mentors. In their Elimination Challenge, the chefs must use the art of deception to create hors d'oeuvres that look like one dish but are actually something completely different. Guest judge Chef Derek Dammann joins Mijune, Janet, Mark and Eden at the table to taste these deceiving delicacies.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-28",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2893744,
                    "name": "Final Four Showdown",
                    "overview": "The QuickFire challenge is a high-speed cook-off where the final four chefs have 35 minutes to create as many dishes as possible with the help of some highly qualified sous-chefs – Top Chef Canada’s previous four champions. In their Elimination Challenge, the final four All-Stars head to the shores of Lake Ontario to grill Canadian game meat for an intimidating table of judges that includes James Beard award-winning Chef Normand Laprise and the winners of the first four seasons of Top Chef Canada.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-06-04",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 2893745,
                    "name": "Lock it Up! It's the Finale",
                    "overview": "The Top Chef Canada: All-Stars Finale is here and the final three chefs go head-to-head in a high-stakes QuickFire Challenge. Later in their final challenge of the season, the chefs head to the historic Royal York Hotel for a course-to-course battle as the chefs serve their meals of a lifetime. Only one All-Star will win it all and become Canada’s Top Chef.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 5,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "Canada's most prestigious and high-stakes culinary competition is back! For the first time in franchise history, Top Chef Canada is bringing back some of the most accomplished chefs from the past four seasons to battle it out for a chance to earn what has eluded them all: the title of Canada's Top Chef!",
            "id": 191683,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "5ae52bb0c3a3683486000ada",
            "air_date": "2018-04-08",
            "episodes": [
                {
                    "air_date": "2018-04-08",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1481959,
                    "name": "The Next Wave",
                    "overview": "In the season debut, Host Eden Grinshpan and Head Judge Mark McEwan welcome 11 chefs, representing the next generation of Canadian culinary stars, to compete in the most prestigious cooking competition in the country and to battle it out for the title of Canada’s Top Chef. For their first QuickFire Challenge, Chef McEwan sets the bar in a grueling, four-round, precision skills challenge. Later, in the Elimination Challenge, the chefs are asked to re-imagine a dish made famous by a Canadian culinary trailblazer. It’s a star-studded tasting table for the first elimination when Eden, Chef McEwan, and resident judges Chris Nuttall-Smith, Mijune Pak, and Janet Zuccarini are joined by culinary icons Susur Lee, Rob Feenie and Anne Yarymowich.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-04-15",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1481960,
                    "name": "What Came First…The Chicken or the Immunity?",
                    "overview": "Waste not, want not! In this high-stakes QuickFire challenge, a hot-button culinary issue is put to the test when the chefs are challenged to produce a Top Chef Canada quality dish while creating as little food waste as possible. Judged by James Beard award-winning chef Danny Bowien, the winning chef earns a special immunity that holds more power than ever seen before. Canadian culinary icon Lynn Crawford judges the ultimate farm-to-table Elimination Challenge where the chefs must feed the farmers, creating dishes that highlight Canadian vegetable, fruit, grain, dairy and egg farms.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-04-22",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1481962,
                    "name": "Qué Rico",
                    "overview": "It’s a mash-up of trends in this Quickfire Challenge where the nine remaining chefs must create dishes that combine up two of the hottest food crazes of the moment. Judging is food writer and culinary trend-setter Peter Meehan. Later in the Elimination Challenge, the chefs go on a culinary voyage creating an authentic fine-dining feast inspired by eight different regions in Mexico. Master of Mexican cuisine, Top Chef U.S. veteran and Michelin-starred chef Carlos Gaytan is on hand to offer expertise and joins the spicy tasting table.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-04-29",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1481961,
                    "name": "Resturant Wars!",
                    "overview": "In a QuickFire Challenge that tests vision and leadership, the chefs are paired with culinary students to teach them a dish...but are thrown one major curveball. With 16 cooks in the kitchen, mass chaos ensues. Later, the chefs are divided into two teams to conceptualize and create the ultimate menu in the marquee Elimination Challenge of the season, Restaurant Wars! The stakes are higher than ever as a massive twist threatens to alter the competition. Superstar food writer and critic, known for making and breaking restaurants, Ruth Reichl joins as guest judge.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-06",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1484120,
                    "name": "Double Overtime",
                    "overview": "Herbs and spice and everything nice. In this QuickFire Challenge, chefs randomly pick two herbs and spices to incorporate into a Top Chef Canada-quality dessert. Next, its game on in the Elimination Challenge as arena food gets a Top Chef Canada makeover. In teams of two, the chefs cater a rink-side post game party for a group of young hockey players and their parents and coaches. A double-elimination has everyone on edge as both chefs on the losing team are sent home.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-13",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1484119,
                    "name": "That's a Whole Lotta Dough!",
                    "overview": "Top Chef Canada All-Stars winner Nicole Gomes is back in the kitchen to judge the Quickfire Challenge where the chefs put a new spin on an old favourite, fried chicken. Later, in the Elimination Challenge, the chefs have to take the flatbread food revolution and give it international flair, creating pizzas inspired by countries as diverse as Korea and Turkey. From L.A.’s hottest new restaurant Felix, Chef Evan Funke is on hand to determine who gets the dough.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-23",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1495840,
                    "name": "Wine of the Tiger",
                    "overview": "At the heart of French cuisine are the decadent flavours of butter, cream and cheese, but in this final-five QuickFire Challenge, the chefs are challenged to recreate the richness of classic French dishes using only plant-based ingredients. Judging this French-Vegan challenge is acclaimed New York City chef Amanda Cohen. Later, it’s the guy with the smile! Top Chef Canada: All-Stars alumni Dustin Gallagher is back to judge the Elimination Challenge where chefs must create canapés that pair with California wines and serve them to an exclusive cocktail party of 65 guests.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-27",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1497575,
                    "name": "Finale Four Ways",
                    "overview": "It’s the Finale! First, the final four chefs go head-to-head-to-head in a high-stakes Quickfire Challenge which will determine who goes on to the finals. At the majestic Omni King Edward hotel, it’s a course to course Elimination Challenge as the chefs battle to serve meals of a lifetime to the table of Top Chef Canada resident judges. Only one chef will win it all and become Canada’s Top Chef.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 6,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 6",
            "overview": "Canada’s most prestigious culinary competition is back. This season we’re going coast, to coast, to coast, to find the next generation of chefs competing for the title of Canada’s Top Chef.\n\nThe epic sixth season introduces an impressive new generation of professional chefs who will prove their masterful skills in grueling challenges. Fighting for Canada’s most prestigious culinary title, chefs are rewarded for their skill and creativity in each Quickfire round. They will cook for their lives and fight to stay in the competition in the high-stakes Elimination Challenges, where one chef will be told to “pack their knives and go.”  The competing chefs will be judged by a panel of Canada’s most refined palates led by returning head judge, superstar chef and restaurateur, Mark McEwan. Each week, Mark is joined by host Eden Grinshpan (Eden Eats, Chopped Canada) and resident judges: food blogger and adventurer Mijune Pak, acclaimed culinary journalist Chris Nuttall-Smith and powerhouse restaurateur Janet Zuccarini. Throughout the season, the judging panel is joined by a series of renowned culinary masters and experts from here at home and abroad, each weighing in on the search for Canada’s next Top Chef.",
            "id": 103097,
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "_id": "5ca3d7af92514140c24a44dc",
            "air_date": "2019-03-31",
            "episodes": [
                {
                    "air_date": "2019-04-01",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1746772,
                    "name": "The Contenders",
                    "overview": "In the season debut, Host Eden Grinshpan and Head Judge Mark McEwan welcome 11 chefs, representing the coming of age of the Canadian culinary scene, to compete in the most prestigious cooking competition in the country and to battle it out for the title of Canada’s Top Chef. In a never-seen-before, high-stakes QuickFire, one dish will determine a chef’s destiny for the entire competition. Later, in the Elimination Challenge, the chefs are asked to take inspiration from a recipe handed down to them from a loved-one and reimagine it into a Top Chef Quality dish. In the first tasting of the season Eden and Chef McEwan, are joined by resident judges Chris Nuttall-Smith, Mijune Pak, and Janet Zuccarini.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-08",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1776043,
                    "name": "Bring on the Mimosas, Baby!",
                    "overview": "Bring on the mimosas baby, it’s the most important meal of the day! In the QuickFire Challenge, chefs make their ultimate breakfast and serve it to Eden and guest judge Suzanne Barr in bed…with the winning chef earning a $5,000 cash prize. In the elimination challenge, the chefs are asked to take their cooking to new heights by creating their ideal Air Transat in-flight meal and then reimagine it into an hors d'oeuvre. Celebrated Québecois chef Daniel Vezina joins 100 guests at Toronto’s Fermenting Cellar for this high-flying adventure.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1776045,
                    "name": "Restaurant Wars",
                    "overview": "It’s Restaurant Wars! For the first time in Top Chef Canada history, the entire episode is dedicated to this marquee challenge. In part one, two chefs put their finesse to the test in a head-to-head culinary skills test to pick the members of their restaurant wars teams. In part two, the chefs head to the top of the CN Tower, 1,100 ft. in the air, to create their ultimate restaurant concept. With a $10,000 prize on the line and veteran New York Magazine, James Beard award-winning restaurant critic Adam Platt on board as guest judge, stakes are at an all-time high.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-22",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1776046,
                    "name": "The Nordic Feast",
                    "overview": "Diving into their next QuickFire Challenge, the chefs challenge conventions by combining two unlikely ingredients: seafood and cheese. Top Canadian cheese purveyor and owner of Toronto’s famed Cheese Boutique, Afrim Pristine, joins to judge this ultimate grilled cheese challenge. Later, in the Elimination Challenge, chefs take inspiration from the land of forests and fjords to create an authentic Nordic feast. It’s a star-studded tasting table at the beautiful Toronto Islands as the chefs are judged by the owner of Red Rooster in Harlem, New York City, Swedish-raised culinary icon Marcus Samuelsson and Executive Chef at New York City’s Two Michelin-Starred Scandinavian restaurant Aquavit, Chef Emma Bengtsson.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-29",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1778726,
                    "name": "The Battle of Bao",
                    "overview": "In a very special QuickFire Challenge, Top Chef Canada pairs with the Boys and Girls Clubs of Canada’s Kid Food Nation to challenge the chefs to take an ingredient that kids normally hate and use it in a dish that any kid would love. The chefs must please some very particular palates including Top Chef U.S. All-Star winner, acclaimed chef/owner of Juniper & Ivy in San Diego, Calif. and father or two, Richard Blais. It’s a food hall takeover and in this Elimination Challenge, teams of two must take a restaurant concept and translate it into a high-quality, fast-casual dining experience for 150 patrons at Toronto’s Assembly Chef’s Hall. A double-elimination has everyone on edge as both chefs on the losing team are sent home.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-06",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1778729,
                    "name": "What Goes Up, Must Come Down",
                    "overview": "The power of an ingredient should never be underestimated and in this QuickFire Challenge, chefs work in teams of two to create a progressive tasting menu that highlights just one single ingredient. Judging is four-time James Beard Award-winner and the owner of Philadelphia’s Zahav, chef Michael Solomonov. In the Elimination Challenge, the chefs harness their wild side to create a dish that combines a luxury ingredient with a carnival classic and serve it to guests at the country’s largest theme park, Canada’s Wonderland. Joining our judges is Top Chef U.S. alumni and the owner of Fox & the Knife in Boston, Mass., chef Karen Akunowicz.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-13",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1778730,
                    "name": "It's a Family Affair",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-20",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1792247,
                    "name": "Winner Takes All",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 7,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 7",
            "overview": "Canada’s most prestigious culinary competition is back with the best and brightest professional chefs competing for the title of Canada’s Top Chef.  For six seasons, Food Network Canada’s Top Chef Canada has been a ratings mega-hit and the most distinguished culinary competition in the country, propelling winners Dale McKay, Carl Heinrich, Matt Stowe, Renee Rodriguez, Nicole Gomes, and Ross Larkin into Canadian culinary stars.",
            "id": 121553,
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        "8": {
            "_id": "5e9556a9db72c00014ad0bbf",
            "air_date": "2020-04-12",
            "episodes": [
                {
                    "air_date": "2020-04-13",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2224342,
                    "name": "A Dish for a New Decade",
                    "overview": "In the season debut, Host Eden Grinshpan and Head Judge Mark McEwan welcome 12 chefs from every corner of the country to compete in the most prestigious cooking competition in the country, battling it out for the biggest prize in Top Chef Canada history and the coveted title of Canada’s Top Chef. In the season’s first Quickfire Challenge the chefs must create their “Desert Island Dish” – the one dish they would want to eat every day if they were stranded on a desert island for the rest of their life. In a Top Chef Canada first, the chefs with the best four dishes will earn a game changing special advantage. Later in the Elimination Challenge, the chefs draw inspiration from the dawn of a new decade, tapping into the pulse of culinary trends to create dishes that speak to the future of food. At Judges Table, reality sinks in when the chefs face the first elimination of the season.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-20",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2235239,
                    "name": "It's a BBQ Party",
                    "overview": "The best part about classic food dishes is that they can be made to fit your own personality depending on your tastes, preferences, and flair.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-27",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2244796,
                    "name": "Grab and Go!",
                    "overview": "The chefs must perfectly peel as many apples as possible, expertly shuck 20 oysters, and race against the clock to extract as much lobster meat as possible under the watchful eye of Head Judge Mark McEwan.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-04",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2261439,
                    "name": "Drag Brunch",
                    "overview": "It’s Drag Brunch! The Top Chef Canada kitchen glitters like never before when two fabulous Drag Queens, Miss Moco and Baby Bel Bel, drop by to challenge the chefs to create an indulgent three course brunch tasting menu fit for a queen. The chefs work in teams to impress the queens and slay the most decadent meal of the day. Later in the Elimination Challenge, the chefs are tasked with taking the judges on a culinary trip across Europe for a European feast. Things get intense in the kitchen as the chefs each create a dish inspired by some of the most iconic cities across the continent.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-11",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2269366,
                    "name": "Castle Cook-Off",
                    "overview": "Jaws drop when culinary trailblazer, Daniel Boulud, walks into the Top Chef Canada kitchen to judge a Quickfire Challenge that tasks the chefs with highlighting high-quality European ingredients. In the Elimination Challenge, it’s time for Restaurant Wars! In this iconic Top Chef Canada challenge, the chefs battle it out in two teams to create an unforgettable restaurant experience at Toronto’s historic Casa Loma. The stakes are higher than ever as the final eight chefs face a double elimination that will see two chefs from the losing team pack their knives and go.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-18",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2276704,
                    "name": "Bring the Funk",
                    "overview": "In the Quickfire Challenge, the chefs come face-to-face with Noma's Director of Fermentation David Zilber and in the Elimination challenge the chefs highlight ingredients from PEI.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-25",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2284537,
                    "name": "Eat Your Veggies",
                    "overview": "In a special Quickfire Challenge the chefs get a helping hand from mini-sous chefs from The Boys and Girls Club of Canada; the chefs tackle the seemingly simple task of making fresh pasta, leading to an unexpected twist that rocks Judges Table.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-01",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 2295124,
                    "name": "Final Showdown",
                    "overview": "The battle is on for the last spot in the finale in an unprecedented sudden-death showdown.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 8,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 8",
            "overview": "The epic sixth season introduces an impressive new generation of professional chefs who will prove their masterful skills in grueling challenges. Fighting for Canada’s most prestigious culinary title, chefs are rewarded for their skill and creativity in each Quickfire round. They will cook for their lives and fight to stay in the competition in the high-stakes Elimination Challenges, where one chef will be told to “pack their knives and go.”",
            "id": 147903,
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        },
        "9": {
            "_id": "607f8e06e6d3cc00775e2971",
            "air_date": "2021-04-19",
            "episodes": [
                {
                    "air_date": "2021-04-19",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2891795,
                    "name": "Phoenix Rising",
                    "overview": "In the season premiere, host Eden Grinshpan and head judge Mark McEwan welcome 11 chefs from across Canada to compete in the most prestigious cooking competition in the country. In the season’s first Quickfire Challenge, the chefs must create a dish that highlights their brand and the style of food they are bringing to the table. Later, the chefs channel the energy of a phoenix rising from the ashes to create a dish inspired by an element found in fire.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-04-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2893750,
                    "name": "Harvest Picnic",
                    "overview": "The chefs are thrown for a loop in the Quickfire Challenge when they find out they must transform diner classics into plant-based plates. In the Elimination Challenge, the chefs compete in teams to create harvest-inspired baskets served to the judges at a Top Chef Canada picnic.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-03",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2893751,
                    "name": "Holiday Potluck",
                    "overview": "The chefs get creative as they bake, flip or fry a dish using oat flour in the Quickfire Challenge. In the Elimination Challenge, the competition gets festive as the chefs present dishes inspired by their favourite holiday meal for the Top Chef Canada Holiday Potluck.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-10",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2893752,
                    "name": "Takeout Wars",
                    "overview": "It’s time for Takeout Wars! In a twist on the classic Top Chef Canada challenge, the chefs battle it out in two teams to create an unforgettable takeout experience featuring contact-less pickup for the public and delivery direct to Janet Zuccarini’s home for the judges.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-17",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2961162,
                    "name": "Eat Local",
                    "overview": "It’s time for the chefs to show off their skills in the Top Chef Canada Culinary Skills Race, and the stakes are higher than ever. One eliminated chef will have a chance to cook their way back into the competition and replace a chef still in the running to be Canada’s Top Chef. In the Elimination Challenge, the chefs take inspiration from the “Eat Local” movement.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-24",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2977676,
                    "name": "Indigenous ingredients",
                    "overview": "In a very special Quickfire Challenge, the chefs get some virtual help from a group of mini-sous chefs from The Boys and Girls Club of Canada. In the Elimination Challenge, the competitors get an education in Indigenous ingredients and cooking before serving an unforgettable menu at a traditional Longhouse.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-31",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2996011,
                    "name": "Game, Set, Match",
                    "overview": "Head Judge Mark McEwan puts on an apron and shows the competitors how it’s done in a Quickfire Challenge that tasks them with creating a wine paired dish under serious time constraints. Later, in the penultimate challenge of the season, the final five chefs have one last chance to serve up a grand slam dish worthy of earning them a spot in the finale.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 9,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-06-07",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 3979869,
                    "name": "A Winner Rises",
                    "overview": "The season culminates with the final four chefs facing off by creating the most important meal of the competition: a progressive five-course tasting menu that they will serve in the epicenter of luxury at The Four Seasons Hotel in Toronto, Ontario. In a surprising twist, only two chefs will serve their full menu but one chef will win it all and become Canada’s Top Chef",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 9,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 9",
            "overview": "The events of the last year have transformed the culinary industry, but just like a phoenix rises, Canada’s chefs are emerging stronger than ever with fresh new perspectives and unique new voices. This competition will shine a light on Canada’s culinary future by assembling 11 of the best professional chefs from across Canada to compete in brand-new challenges and never before seen twists in a season like no other. Canada is ready for the future of food, but only one chef will emerge from the competition with the title of Canada’s Top Chef.",
            "id": 191570,
            "poster_path": null,
            "season_number": 9,
            "vote_average": 0
        },
        "10": {
            "_id": "6335cfe2a06645008b9168fa",
            "air_date": "2022-09-26",
            "episodes": [
                {
                    "air_date": "2022-09-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3979870,
                    "name": "Welcome to Season X",
                    "overview": "In the milestone tenth season premiere, host Eden Grinshpan and judge Janet Zuccarini welcome 11 Chefs from across Canada to compete in the most prestigious cooking competition in the country. In the season's first Quickfire Challenge, the Chefs will put their skills to the test in a skills race that takes us back to Season 1. A new twist is introduced that shakes up the competition. Later, the Chefs must impress new judge David Zilber and re-imagine a dish that has changed their life",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 10,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-03",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3979871,
                    "name": "Backstage Bites",
                    "overview": "The Chefs are thrown for a loop in the Quickfire Challenge when they find out they must work in teams to create a dish that incorporates three Classic Top Chef Canada Quickfires. In the Elimination Challenge, the Chefs cater a rehearsal for rock band The Beaches",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-10",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3979872,
                    "name": "Restaurant Wars",
                    "overview": "The Chefs' palates are put to the test at the Top Chef Canada Taste Test Tournament. Then, it's time for Restaurant Wars! The Chefs battle it out in two teams to create an unforgettable restaurant experience. The pressure is on to impress Top Chef U.S star Gail Simmons who joins the Judging panel",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 10,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-17",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4024572,
                    "name": "Soccer Fever",
                    "overview": "The Chefs get creative in the Top Chef Canada Kitchen during a very colourful Quickfire Challenge. Later, Soccer Fever is in the air as the competitors put their barbecue skills to the test and host a cookout for the next generation of soccer superstars.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 10,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-24",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4024574,
                    "name": "Vegan Feast",
                    "overview": "In the Quickfire Challenge, the Chefs are tasked with making as many dishes as possible in 30 minutes. In the Elimination Challenge, the competitors must push the boundaries of plant-based cuisine and impress the Judges at a Vegan Feast.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 10,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-31",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4024577,
                    "name": "Date Night",
                    "overview": "In the Quickfire Challenge, Chefs must balance contrasting flavour profiles. In the Elimination Challenge, competitors create date night dishes for the loved ones of the judges. The final 4 will head to a popular international food destination.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4044920,
                    "name": "Welcome to the Cayman Islands",
                    "overview": "The final 4 Chefs travel to The Cayman Islands to create the perfect happy hour dish in their first Quickfire Challenge. After a food tour of the Island, they must use local ingredients at an event that welcomes Cayman locals.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-14",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 4082866,
                    "name": "Canada's Top Chef is…",
                    "overview": "The season ends with a Quickfire Challenge determining the final 2 Chefs. They will cook a five-course tasting menu that they'll serve at Blue by Eric Ripert at The Ritz in The Cayman Islands. One chef will win it all and become Canada's Top Chef.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 10",
            "overview": "",
            "id": 310580,
            "poster_path": null,
            "season_number": 10,
            "vote_average": 0
        },
        "11": {
            "_id": "671139fc6bffa14cf4115cf7",
            "air_date": "2024-10-14",
            "episodes": [
                {
                    "air_date": "2024-10-14",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 5685034,
                    "name": "Chaos Menu",
                    "overview": "In the historic Season 11 premiere, Top Chef Canada celebrates the Canadian culinary scene taking its place on the world stage. Ten Chefs from across Canada are welcomed into the biggest culinary competition in the country. There’s no time for introductions as Host Eden Grinshpan reveals that the first challenge of the season will be Restaurant Wars! Immediately thrown into chaos, the Chefs are split into two teams, and must create a unique restaurant concept and cohesive menu that opens to the public in less than 24 hours. And judging this meal is a table of Canada’s first Michelin-starred chefs, bringing the competition to a whole new level.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 11,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-10-21",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 5698190,
                    "name": "Firsts",
                    "overview": "For the season’s first Quickfire Challenge, the Chefs go back to basics in this very special Skills Race, featuring Guinness World Record Holder and former Top Chef Canada finalist Wallace Wong. Later, while cooking at Judge Janet Zuccarini’s first restaurant Trattoria Nervosa, the Chefs showcase their unique culinary styles by creating a dish inspired by a major 'first' in their life.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 11,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-10-28",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 5726871,
                    "name": "The Feast of Toronto",
                    "overview": "Here comes the bride! In the Quickfire Challenge, the pressure is on to impress judge and soon-to-be bride Mijune Pak as the Chefs create a dish to be considered for her wedding menu. Later, the Chefs explore Market 707, an urban street-food destination, to experience and taste the thriving multicultural food scene in Toronto. For the Elimination Challenge, the Chefs must create a premium dish that takes inspiration from those street-food favorites, and deliver it to the Judges at The Bentway, a unique public space located under a highway.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 11,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-11-04",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 5726872,
                    "name": "The Gala Fundraiser",
                    "overview": "The Chefs explore their sweet and savory sides in the Quickfire Challenge, where they must create a dish that can pair with an espresso beverage served with either breakfast or dessert. Then, it’s time for the first ever Top Chef Canada Gala Fundraiser. The Chefs are challenged with preparing 225 servings of the perfect hors d’oeuvre for over 150 guests at this exciting event to support a not-for-profit that gives back to the hospitality and restaurant industry.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 11,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-11-11",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 5734231,
                    "name": "The Gala Fundraiser",
                    "overview": "The Chefs explore their sweet and savory sides in the Quickfire Challenge, where they must create a dish that can pair with an espresso beverage served with either breakfast or dessert. Then, it’s time for the first ever Top Chef Canada Gala Fundraiser. The Chefs are challenged with preparing 225 servings of the perfect hors d’oeuvre for over 150 guests at this exciting event to support a not-for-profit that gives back to the hospitality and restaurant industry",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 11,
                    "show_id": 37649,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 11",
            "overview": "The most prestigious and exciting culinary competition in the country returns with Canada’s best up and coming chefs fighting for the future of the culinary world, and the title of Canada’s Top Chef.",
            "id": 424062,
            "poster_path": null,
            "season_number": 11,
            "vote_average": 0
        }
    }
}