{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2011-01-19","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":37708,"in_production":false,"languages":["en"],"last_air_date":"2011-12-14","last_episode_to_air":{"id":850857,"name":"Episode 6","overview":"The team help a teen mum who has lost faith in contraception and a 19-year-old boy who's worried he's having too many one night stands.\n\nThey also meet a young man whose penis is so painful it prevents him from having penetrative sex. And Billie JD Porter looks at how today's teenagers value their virginity.","vote_average":0,"vote_count":0,"air_date":"2011-12-14","episode_number":6,"episode_type":"finale","production_code":"","runtime":60,"season_number":2,"show_id":37708,"still_path":null},"name":"The Joy of Teen Sex","next_episode_to_air":null,"networks":[{"id":26,"logo_path":"/hbifXPpM55B1fL5wPo7t72vzN78.png","name":"Channel 4","origin_country":"GB"}],"number_of_episodes":10,"number_of_seasons":2,"origin_country":["GB"],"original_language":"en","original_name":"The Joy of Teen Sex","overview":"The Joy of Teen Sex is a British television show on Channel 4 that delves into the world of teenagers and sex. This includes sexual experiences, sexual health, trends and relationship issues. The first series ran from 19 January - 9 February 2011, and aired four episodes. The second series comprises six episodes and began on 27 October 2011.","popularity":3.397,"poster_path":null,"production_companies":[],"production_countries":[],"seasons":[{"air_date":"2011-01-19","episode_count":4,"id":49038,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2011-10-27","episode_count":6,"id":49039,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":1,"vote_count":1,"season_data":{"1":{"_id":"5258eab8760ee3466188ba93","air_date":"2011-01-19","episodes":[{"air_date":"2011-01-19","episode_number":1,"episode_type":"standard","id":850851,"name":"Episode 1","overview":"A frank and sometimes shocking look at the real world of teenage sex, complete with fears, frights and fun. Ruth and Dr Rachael meet a mother and daughter at loggerheads because the daughter refuses to go on the pill. \n\nSeventeen-year-old Rachel fell pregnant by accident last year and her mum Michelle is at a loss trying to get her daughter to protect herself from another unwanted pregnancy. While Ruth helps the pair to communicate better, can Dr Rachael find a suitable method of contraception for the teenager? \n\nRuth also meets 20-year-old Calvin from Liverpool. Calvin is gay and works as a drag queen on the club scene, but he's yet to have a sexual partner and is scared to lose his virginity. Sex coach Joanna gives him some helpful advice on foreplay to get him more accustomed to the idea of anal sex. \n\nNext into the clinic is Holly, 20, who takes the contraceptive pill but rarely uses condoms because she doesn't think the kind of guy she sleeps with would carry sexually transmitted infections - even though the fastest growing STI, chlamydia, has no visible symptoms. But Holly is shocked when Dr Rachael presents her with some cold hard facts about STIs. \n\nAlso looking for sex advice are 17-year-old lesbian Kim, keen to learn some more tricks for girls; sportsman Genna, 18, who is worried his sperm isn't normal; and 20-year-old Robyn who asks Ruth for help to make her boyfriend's semen more palatable!","production_code":"","runtime":60,"season_number":1,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-26","episode_number":2,"episode_type":"standard","id":850850,"name":"Episode 2","overview":"Two teens who hate their boobs pay a visit to Dr Rachael. Ruth meets a young man with a phobia of vaginas. And Billie investigates the glamour industry.\n\nMelissa (20) has inverted nipples, while Jamie (16) worries that her nipples are too big. Rachael tries to allay their fears, and offer Melissa advice on how she can have her inverted nipples corrected.\n\nIn the Sex Advice Shop, Ruth meets Michaela (20) and her boyfriend Luke (22). The pair are engaged to be married, but there's one problem threatening to create a wedge in their relationship, Luke cannot bring himself to perform oral sex on his fiancée as he has a phobia of vaginas. Desperate to make Michaela happy, Lukes takes a masterclass in female anatomy from sex coach Joanna, and visits a sculptor who helps him get to grips with Michaela's vagina in a whole new way. \n\nChloe (19) and Louis (20) face an altogether different kind of obstacle. They've been together for three years and have an active sex life everywhere (including up trees!). But not at Louis' house - his parents can't come to terms with the fact that the couple are sexually active, and Chloe has to sleep on the sofa. They want to broach the subject with Louis' parents, but have no idea how to do so without upsetting them. Ruth is on hand to offer some practical advice on how to have a frank discussion with them. \n\nAlso in the programme, 19-year-old Luke gets some tips on bondage from Joanna to help spice up his sex life; Mo talks to Dr Rachael about premature ejaculation and how he can overcome it; and Harriet wants to know just how painful it's going to be when she loses her virginity. Finally, Billie JD Porter investigates the glamour industry to see why teenage girls are so ready to bare their assets, perhaps even to pay their way through higher education with a stint as a lap dancer.","production_code":"","runtime":60,"season_number":1,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-02","episode_number":3,"episode_type":"standard","id":850848,"name":"Episode 3","overview":"Sex is part of every teenager's life. They think about it, they worry about it and they do it. This new series offers a frank exploration of the love and sex lives of today's teenagers. In this episode 16-year-old Pixie takes the brave step of speaking to Dr Rachael about wanting an HIV test. Pixie has slept with over 20 people and thinks that a boy she slept with recently may have HIV. Ruth meets 17-year-old Charlie and his dad Barrie. Charlie would love to have more success with the ladies, but doesn't know how to ask his dad for advice. Ruth helps them talk openly about sex. Meanwhile, 18-year-old Ronnie thinks his penis is too small, and 19-year-old Sarah's concerns about how her vagina looks are ruining her sex life.","production_code":"","runtime":60,"season_number":1,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-02-09","episode_number":4,"episode_type":"finale","id":850849,"name":"Episode 4","overview":"Eighteen-year-old Sammy comes to see Dr Rachael because she is worried she may be allergic to sperm. She has been with her boyfriend for five years but her extreme physical reaction to his sperm makes her wonder if she will be able to conceive later in life. \n\nAlso in this show Georgina, 19, hates her boobs and it is ruining her sex life. Josh, also 19, is desperate to lose his virginity and 20-year-old Beth is suffering from severe cystitis when she has sex.\n\nCan the team help solve their problems?","production_code":"","runtime":60,"season_number":1,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":49038,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5258eab8760ee3466188ba9e","air_date":"2011-10-27","episodes":[{"air_date":"2011-10-27","episode_number":1,"episode_type":"standard","id":850852,"name":"Episode 1","overview":"The team offer advise to two girls who find going 'on top' hard, a lad with a phobia of oral sex and a girl with a broken heart. Billie learns more about extreme teen behaviour in Magaluf.","production_code":"","runtime":60,"season_number":2,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-17","episode_number":2,"episode_type":"standard","id":850853,"name":"Episode 2","overview":"This episode features a 21-year-old who's worried he has HIV, a girl whose pierced clitoris is a pain during sex, and a look at links between porn and the rise in anal sex.\n\nThe Sex Advice Shop meets a teenager who, at the ripe old age of 18, has lost his mojo.","production_code":"","runtime":60,"season_number":2,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-11-24","episode_number":3,"episode_type":"standard","id":850854,"name":"Episode 3","overview":"The show meets a 16-year-old virgin under pressure to have sex, a teen couple who want to spice up their sex life, and a club promoter who wants more than just one night stands.\n\nMeanwhile, 19-year-old Billie JD Porter continues to uncover teen sex trends, this week investigating the new craze for fetish.","production_code":"","runtime":60,"season_number":2,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-01","episode_number":4,"episode_type":"standard","id":850855,"name":"Episode 4","overview":"The team meet a girl who hates her body so much that she only has sex in the dark and Billie JD Porter investigates why so many girls hate their vaginas.\n\nThis episode also includes a 19-year-old who finishes too quickly, and a 17-year-old who is convinced he knows more about the facts of life than his mum.","production_code":"","runtime":60,"season_number":2,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-13","episode_number":5,"episode_type":"standard","id":850856,"name":"Episode 5","overview":"The team meet a young man petrified of losing his virginity, a teen having problems with contraception, and a 20-year-old who takes over an hour to orgasm.\n\nAnd Billie JD Porter asks if girls should be allowed to wear exactly what they want, however provocative, without being labelled `sluts'.","production_code":"","runtime":60,"season_number":2,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-12-14","episode_number":6,"episode_type":"finale","id":850857,"name":"Episode 6","overview":"The team help a teen mum who has lost faith in contraception and a 19-year-old boy who's worried he's having too many one night stands.\n\nThey also meet a young man whose penis is so painful it prevents him from having penetrative sex. And Billie JD Porter looks at how today's teenagers value their virginity.","production_code":"","runtime":60,"season_number":2,"show_id":37708,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":49039,"poster_path":null,"season_number":2,"vote_average":0}}}