{"adult":false,"backdrop_path":"/uRbRavVTO1FqwMSnJjTkS0kn1E5.jpg","created_by":[{"id":3896975,"credit_id":"63d694f312b10e00b57129ee","name":"Léo Matthès","gender":0,"profile_path":null}],"episode_run_time":[43],"first_air_date":"2007-06-17","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.history.com/shows/ice-road-truckers","id":3780,"in_production":false,"languages":["en"],"last_air_date":"2017-11-09","last_episode_to_air":{"id":1388405,"name":"One Last Lick","overview":"The spring thaw is in full melt mode as the drivers get one last lick before the ice roads close for the season. Steph Custance is the first to experience nature's wrath as she slips and slides deep into the trees off a slick road. Meanwhile Todd Dewey is struggling with a big load of construction material over a long and twisty trail. Art Burke is not a happy camper when he is pressed into service to retrieve a super heavy bulldozer over a rapidly melting ice crossing. Reno Ward takes a risky final run just to have his truck die on the ice. And Lisa Kelly is heading home when she gets an emergency call to come to the rescue before it's too late.","vote_average":0,"vote_count":0,"air_date":"2017-11-09","episode_number":10,"episode_type":"finale","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":null},"name":"Ice Road Truckers","next_episode_to_air":null,"networks":[{"id":65,"logo_path":"/9fGgdJz17aBX7dOyfHJtsozB7bf.png","name":"History","origin_country":"US"}],"number_of_episodes":138,"number_of_seasons":11,"origin_country":["US","CA"],"original_language":"en","original_name":"Ice Road Truckers","overview":"Take a trip to Yellowknife, Canada to experience one of the most dangerous careers around. In unfathomably cold conditions, truck drivers haul equipment and supplies to miners in the Canadian tundra in the dead of winter on a 350-mile highway of ice.","popularity":17.261,"poster_path":"/ygFkmE24eUb12zWQNiWb9efjBj9.jpg","production_companies":[{"id":24824,"logo_path":"/l9qV55gF4sVK6ZMitwH9csTSOgH.png","name":"Original Productions","origin_country":"US"},{"id":63576,"logo_path":"/4qMMMs4smEdD2fjoLLSSleRjG9J.png","name":"Eagle Vision","origin_country":"CA"}],"production_countries":[],"seasons":[{"air_date":"2007-08-26","episode_count":8,"id":11335,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2007-06-17","episode_count":10,"id":11331,"name":"Season 1","overview":"During the harsh winter of Canada’s Northwest Territory, remote villages and work camps are cut off from the world. To keep them supplied, a tenacious group of long-haul truckers drive their rigs over hundreds of miles on ice roads cut across the surface of frozen lakes. Sometimes the ice cannot support the heavy rig, and driver and cargo plunge through the ice and sink to the bottom. Hitch a risky ride along with the Ice Road Truckers as they drive headlong into bone-chilling danger.","poster_path":"/jXNBc5FgkAnGbsYy7K9WRnFQkpk.jpg","season_number":1,"vote_average":8},{"air_date":"2008-06-08","episode_count":13,"id":11332,"name":"Season 2","overview":"This season, Ice Road Truckers is in the remote communities of Inuvik and Tuktoyaktuk, over 100 north of the Arctic Circle. Two clients, the Mallik Gas Hydrate Research Project and MGM Energy, rely on the short ice road season as the sole supply for their energy ventures. In about two months, or until the ice roads melt, these clients collaborate with three competitive trucking companies who must work together to move hundreds of heavy and oversized loads over frozen river and ocean water through fatally cold and often dangerous storm conditions.","poster_path":"/5sLKz38Jr2Rk4bggrl3WXLCvDif.jpg","season_number":2,"vote_average":8},{"air_date":"2009-05-31","episode_count":13,"id":11333,"name":"Season 3","overview":"This season, Ice Road Truckers is headed to Alaska—250 miles north of the Arctic Circle. Trucker legends Hugh “Polar Bear” Rowland and Alex Debogorski return to take on the most death-defying road so far. Hundred-foot cliffs, hairpin curves, avalanches and -70 degree temperatures are just a few of the challenges that await them. And here in Alaska, Hugh and Alex are no longer considered the kings of the road. Their co-workers at Carlile Transportation, including veteran George Spears, the “King of the Haul Road,” and the fearless Jack Jesse, know what it’s like to haul everything from giant loads of construction materials to oversized drilling rigs across the deadliest ice passage in North America, and they’re looking to show Hugh and Alex a thing or two about driving in Alaska.","poster_path":"/8uvgqJOTmcfp5PNFMk6oOIWZcUZ.jpg","season_number":3,"vote_average":7.9},{"air_date":"2010-06-06","episode_count":16,"id":11334,"name":"Season 4","overview":"The Ice Road Truckers return to Alaska, hauling their biggest loads ever across the most dangerous terrain they’ve faced. But this year, trucking critically needed cargo north to the oil fields of Prudhoe Bay is just the beginning. The drivers will tackle frozen rivers and swamps out beyond the Dalton Highway, hauling supplies to some of the most remote towns of the Great White North. Reigning king Jack Jesse looks to defend his title, and Lisa Kelly, one of the only woman truckers on the haul road, fights to prove herself in the male-dominated profession. Rookie Ray Veilleux, who recently lost his business in the lower 48, has come north to run the road and keep his struggling family afloat. And, continuing their decades-long rivalry, veteran drivers Hugh Rowland and Alex Debogorski are back racing neck and neck. The stakes are high as the dash for cash is on again.","poster_path":"/ppSK1alahhVDsIB6X7aWdHaxSBt.jpg","season_number":4,"vote_average":8.1},{"air_date":"2011-06-05","episode_count":16,"id":11336,"name":"Season 5","overview":"This season, from Prudhoe Bay, Alaska, to northern Canada’s Manitoba Province, the ice road truckers will risk it all to deliver essential goods and supplies to the oil fields and villages that dot the planet’s harshest landscape. Along the way they will battle temperatures that plunge to -40 degrees, blinding snowstorms and thinning ice. Three new faces will take on veteran drivers Hugh Rowland, Alex Debogorski and Lisa Kelly to see if they have what it takes to win the dash for the cash.","poster_path":"/9MlvtDffYVVUPFaFW1NkW2zKNhm.jpg","season_number":5,"vote_average":0},{"air_date":"2012-06-03","episode_count":16,"id":11337,"name":"Season 6","overview":"This season, the Ice Road Truckers battle the farthest reaches of the North American continent. In Alaska, oil exploration is at an all-time high, and Carlile drivers are preparing for the busiest season in Dalton history. This year, they’ll push past Prudhoe Bay and head out onto the remote oil fields of the North Slope. In Manitoba, Canada, warm weather has made the normally rough winter roads barely passable, and every driver will be forced to battle the thinnest ice the winter roads have ever seen. In the Yukon, drivers take to Canada’s Dempster Highway, crossing rivers, lakes and even the Arctic Ocean to make deliveries to the northernmost settlements accessible by ice road.","poster_path":"/3vHf7qSTe67oBXYnwRitfTj5Vsz.jpg","season_number":6,"vote_average":0},{"air_date":"2013-06-09","episode_count":12,"id":11338,"name":"Season 7","overview":"The battle lines are drawn in Manitoba, Canada. Hugh “Polar Bear” Rowland returns after quitting his job at Polar Industries and sets up his own shop right down the street. Bound and determined to reclaim his crown as “King of the Road,” he poaches Polar’s dispatcher, intent on landing enough loads to force his old company into submission. Hugh rounds up the toughest truckers he can find and they hit the winter roads. However, Polar Industries and its owner, Mark Kohaykewych, aren’t about to take this challenge lying down. To counter this threat on their turf, they enlist some of Hugh’s biggest rivals. Ice road legend Alex Debogorski signs on with Polar as well as Alaskan trucking icon Lisa Kelly, after a year hiatus. Montana legend Darrell Ward is also enlisted by the crew at Polar. \n\nThis season also chronicles an eccentric mechanic way up north who dances to the beat of a completely different drum. Joey Barnes, nicknamed “The King of Obsolete,” fills his yard with trucks from decades past. Many of the vehicles are rarities, and some have been re-engineered as Joey’s own unique pieces of equipment. He’s taken it upon himself to use his fleet of trucks to rescue those stuck in the most remote corners of Manitoba.","poster_path":"/n1AvGdNaAhM1eUmKLJDBZ2ez417.jpg","season_number":7,"vote_average":0},{"air_date":"2014-07-07","episode_count":12,"id":69229,"name":"Season 8","overview":"This season, the toughest job in the world just got tougher. A polar vortex has descended onto the Canadian backcountry, creating the most severe winter in over a century. Freezing winds, towering snow and blinding whiteouts push the drivers to their emotional and physical breaking points. Despite the brutal conditions, Polar Industries and VP Express aren’t backing down from the war that started last year. VP boss Hugh Rowland has stolen ice road legend Alex Debogorski away from Polar. Although they’ve been rivals in the past, having the two titans together on the same team might just provide the edge VP needs to run Polar out of town.","poster_path":"/eeu0WZ6KxnaaItwdH6LQa9UXINY.jpg","season_number":8,"vote_average":0},{"air_date":"2015-08-02","episode_count":10,"id":69218,"name":"Season 9","overview":"The battle for supremacy on the winter roads begins a bold new chapter. After two seasons of domination, Polar Industries is back to defend its place as load count champs in Manitoba, but Darrell Ward is ready to take on his former employer with his upstart company. He’s also stealing one of Polar’s superstar drivers to help him try to win the fight–Lisa Kelly. After breaking through the ice at the end of last season, not only is Lisa joining forces with the Montana Legend, she’s even getting a percentage of the company.","poster_path":"/g0cZk7DCts5qXQ3yiLRyoow0rde.jpg","season_number":9,"vote_average":0},{"air_date":"2016-08-04","episode_count":10,"id":79026,"name":"Season 10","overview":"Polar Industries is back to defend its place as load count champs in Manitoba. But Darrell Ward and Lisa Kelly are not backing down. In fact, they are building a trucking empire of their own and won't let Polar stand in their way.","poster_path":"/b7zgoKxyDEIS8K8QGDhVIzyeJnc.jpg","season_number":10,"vote_average":0},{"air_date":"2017-08-24","episode_count":10,"id":91840,"name":"Season 11","overview":"As the Ice Road Truckers head into season 11, a tragedy has shaken them to the core—the loss of one of their brother in arms. Meanwhile, old rivalries are shattered when Lisa and Darrell’s son, Reno, join the Polar squad, uniting everyone onto one team. Together, they must haul a massive cargo load through yet another warm winter—a risk that could cost them everything.","poster_path":"/ygFkmE24eUb12zWQNiWb9efjBj9.jpg","season_number":11,"vote_average":5}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Reality","vote_average":6.611,"vote_count":63,"season_data":{"1":{"_id":"5257569819c29531db142cf5","air_date":"2007-06-17","episodes":[{"air_date":"2007-06-17","episode_number":1,"episode_type":"standard","id":265163,"name":"Ready to Roll","overview":"In one of the coldest frontiers on earth, road construction crews begin the process of creating the most unique passage in the world---a 350-mile highway of ice.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/8CE2sFkyPp1U84i9QtvWooyYHvJ.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-06-24","episode_number":2,"episode_type":"standard","id":265164,"name":"Destination Diamond Mine","overview":"The rivalry heats up between Ice Road Truckers veteran Hugh Rowland and his employee Rick Yemm as they compete for the highest load count.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/dg8JFm2hphyXZZ9w58hNaaNRSm6.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-07-01","episode_number":3,"episode_type":"standard","id":265167,"name":"Dash for the Cash","overview":"It's the second week of the ice road season and the brutal temperatures of -40 degrees are already taking their toll on the truckers.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/nnqdHL4QvbmzeWHSZHLwTCP5MMh.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-07-08","episode_number":4,"episode_type":"standard","id":265166,"name":"The Big Chill","overview":"It's the 18th day of the ice road season and truckers have delivered more than 3000 loads to the diamond mines, but they still have 7000 more to go. The temperatures are dropping, the loads are getting heavier and the ice is just three feet thick.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/a4z7vYkMt5x392djkz6qciM1Jdb.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-07-15","episode_number":5,"episode_type":"standard","id":265169,"name":"Midseason Mayhem","overview":"It's half way through the grueling ice road season. Six hundred truckers have ferried more than 4,000 loads to the northern mines. They still have 6,000 left to go, but everyday roadblocks threaten their progress.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/jzFlUAsbv9wnZhDMto2XLuf9R0z.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-07-22","episode_number":6,"episode_type":"standard","id":265168,"name":"Driving on Thin Ice","overview":"Jay Westgard embarks on a trip to the De Beers mine with the heaviest and most valuable piece of equipment this season.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/eQOr7RxMmBGH7VfdxIi2VldhnBL.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-07-29","episode_number":7,"episode_type":"standard","id":265174,"name":"The Rookie Challenge","overview":"Ice Road Truckers venture 200 miles north of the Arctic Circle, transporting 10,000 loads of vital materials, over a highway made entirely of ice onto the Arctic Ocean.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/2suRTciIbCbe71SW6u0SOOSMsKh.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-05","episode_number":8,"episode_type":"standard","id":265172,"name":"Into the Whiteout","overview":"It is a race against the elements, against time, and against each other as the Ice Road Truckers brace themselves for an approaching storm.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/qQQ8eG7b0iguCoVuBKP24ewwWfw.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-12","episode_number":9,"episode_type":"standard","id":265171,"name":"The Big Melt","overview":"The Ice Road Truckers push themselves and their trucks to the limits before the big melt.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/zNOtXH0NXD7xepAWHtdqdDpXlQr.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-19","episode_number":10,"episode_type":"finale","id":265173,"name":"The Final Run","overview":"The Ice Road Truckers race for the last of the cash as they travel across thinning ice.","production_code":"","runtime":43,"season_number":1,"show_id":3780,"still_path":"/okxJzxI2QDsfxDibPZJkgR89mHj.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"During the harsh winter of Canada’s Northwest Territory, remote villages and work camps are cut off from the world. To keep them supplied, a tenacious group of long-haul truckers drive their rigs over hundreds of miles on ice roads cut across the surface of frozen lakes. Sometimes the ice cannot support the heavy rig, and driver and cargo plunge through the ice and sink to the bottom. Hitch a risky ride along with the Ice Road Truckers as they drive headlong into bone-chilling danger.","id":11331,"poster_path":"/jXNBc5FgkAnGbsYy7K9WRnFQkpk.jpg","season_number":1,"vote_average":8},"2":{"_id":"5257569819c29531db142d03","air_date":"2008-06-08","episodes":[{"air_date":"2008-06-08","episode_number":1,"episode_type":"standard","id":265175,"name":"Edge of the Earth","overview":"This year, four ice road truckers return from last season to join Arctic veterans as they venture 200 miles north of the Arctic Circle to drive the most isolated and dangerous ice roads in North America.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/oIDh3zZmG1cJFOU2aUgRWb4Wjml.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-15","episode_number":2,"episode_type":"standard","id":265178,"name":"Mechanical Mayhem","overview":"After just two days in the Arctic, the critical demands of the oil exploration sites are testing the limits of the truckers and their machines.","production_code":"115","runtime":43,"season_number":2,"show_id":3780,"still_path":"/kqsOyHTQOHoArZ7CCd3FnyAw8Zx.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-22","episode_number":3,"episode_type":"standard","id":265179,"name":"The Big Blizzard","overview":"The Ice Road Truckers hit one of the most intense blizzards in recent years.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/2O3kTSJhJYrUwvtr1PBlGmm9jKN.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-06-29","episode_number":4,"episode_type":"standard","id":265177,"name":"Arctic Whiteout","overview":"The Ice Road Truckers face a blizzard while attempting to move seven million pounds of iron, cross an ocean, and transfer loads on time.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/gp9jZvTpuqT8Mh8DgmdkFqWjTzr.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-06","episode_number":5,"episode_type":"standard","id":265191,"name":"Lost on the Ice","overview":"The Ice Road Truckers race to move seven million pounds in 96-hours while one trucker loses his way.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/s6yljd5wZZ3w7cNQRrtZpgSMc6W.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-13","episode_number":6,"episode_type":"standard","id":265180,"name":"Hundred Ton Haul","overview":"The pressure of the ice builds as the Ice Road Truckers prepare to haul the heaviest load of the season.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/IHt3eELPSAIW0Y03ldkdB61frZ.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-20","episode_number":7,"episode_type":"standard","id":265183,"name":"Man Down","overview":"The Ice Road Truckers prepare themselves for dangerous territories as Alex's health continues to deteriorate.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/oA71VkzAawbkf9rf56LB3zB7SkD.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-07-27","episode_number":8,"episode_type":"standard","id":265189,"name":"A Trucker's Farewell","overview":"The race to dismantle the Mallik Research site before the ice road melts has the truckers hauling away equipment piece-by-piece.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/kt4JFukpwmPdHXqEAFDJao3Ebxj.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-08-03","episode_number":9,"episode_type":"standard","id":265187,"name":"A Rookie Fumbles","overview":"Medical issues threaten some of the Ice Road Truckers as the Arctic veterans take on the challenge of hauling the final loads.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/xL6h96gjtlT3vgTNkpxHxFzIWxE.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-08-10","episode_number":10,"episode_type":"standard","id":265184,"name":"Highway Maggots","overview":"Eric and Hugh continue to vie for the title of \"King of the Ice Road\" as Kurt escorts a convoy of \"highway maggots\" safely off the road.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/4SqRwKWRsSuBE18ppY901lv43GT.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-08-17","episode_number":11,"episode_type":"standard","id":265192,"name":"Man vs. Ice","overview":"One wrong move could spell disaster for Hugh, who is hauling a back-heavy rig, as Rookie Devon Neff makes his debut run.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/2mTcNrOfhitDcJtsOzrbPctNjjp.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-08-24","episode_number":12,"episode_type":"standard","id":265182,"name":"The Big Thaw","overview":"Jody and Brett take on the challenge of removing the 66-ton derrick from the Langley site, which has to be \"two trucked;\" one truck will make the entire journey traveling backwards on the disintegrating arctic ice.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/bCmsk5pEJCnODHF9njTNft4VnGN.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-09-07","episode_number":13,"episode_type":"finale","id":265190,"name":"The World Crumbles","overview":"Warm waters from the south and an arctic whiteout threaten the Ice Road Truckers' last day of the season.","production_code":"","runtime":43,"season_number":2,"show_id":3780,"still_path":"/tc1ydcKKMQM1BfZyZoBCzlooedM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"This season, Ice Road Truckers is in the remote communities of Inuvik and Tuktoyaktuk, over 100 north of the Arctic Circle. Two clients, the Mallik Gas Hydrate Research Project and MGM Energy, rely on the short ice road season as the sole supply for their energy ventures. In about two months, or until the ice roads melt, these clients collaborate with three competitive trucking companies who must work together to move hundreds of heavy and oversized loads over frozen river and ocean water through fatally cold and often dangerous storm conditions.","id":11332,"poster_path":"/5sLKz38Jr2Rk4bggrl3WXLCvDif.jpg","season_number":2,"vote_average":8},"3":{"_id":"5257569819c29531db142d14","air_date":"2009-05-31","episodes":[{"air_date":"2009-05-31","episode_number":1,"episode_type":"standard","id":265198,"name":"Deadliest Ice Road","overview":"Day 1 of the new Ice Road season brings 6,000 loads of freight to move in just 12 weeks to the oil camps of Alaska's North Slope. From unexpected weather and treacherous terrain, this is by far the most death defying route to date.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/f7lQI340dPyHokim78dQPcpfmZX.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-06-07","episode_number":2,"episode_type":"standard","id":265199,"name":"Rookie Run","overview":"Temperatures drop to 70 below as the race for big bucks heats up. Truckers Lisa Kelly faces hurdles, Jack Jesse deals with the perils of hauling a load of 130-foot pipe and rookie Tim Freeman struggles with challenging mechanical problems.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/dV39zkGmsqK9KQ0p5xfQ8uohk6U.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-06-14","episode_number":3,"episode_type":"standard","id":265200,"name":"Canadian Invasion","overview":"The clock is ticking and an arctic storm is brewing. Hugh and Alex embark on their first trip to Prudhoe Bay, Lisa Kelly requests her first ever \"heavy haul,\" and Tim Freeman makes his second attempt to navigate the ice road.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/f89yMsm8ZgmAE3KW1oQZmbXMS6W.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-06-21","episode_number":4,"episode_type":"standard","id":265201,"name":"Blinding Whiteout","overview":"A massive storm blows in and all traffic on the ice road comes to a standstill. George, Tim and Lisa take shelter at Coldfoot while Jack Jesse tries to outrun the storm.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/ekrDnbyIpY2tUfxcYGchdfEWu6b.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-06-28","episode_number":5,"episode_type":"standard","id":265202,"name":"Accident Alley","overview":"Another winter storm causes a major collision on \"Slope Mountain\" and tow truck driver Ben Krsykowski must carefully pull a truck cab and trailer back up on the road--knowing that the slightest spark could set off a massive explosion.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/6KLWj86muHdZFEjsaWGkygWMXIu.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-07-05","episode_number":6,"episode_type":"standard","id":265203,"name":"Arctic Ice","overview":"Lisa Kelly auditions to be the first woman to break into the elite Heavy Haul division while Hugh \"The Polar Bear\" Rowland aims for the title: master of the all the North American ice roads.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/1ONYZKOoDFtv86uzwqnuKIHoCtX.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-07-12","episode_number":7,"episode_type":"standard","id":265204,"name":"Wicked Weather","overview":"The race is on to make it to Prudhoe before a wicked storm turns fierce. Despite a cloud of ice fog, Hugh and Phil make it through the worst of the storm and celebrate at the top of Atigun Pass.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/5vtdP2eLYtBjPSEPfds25VEanlw.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-07-19","episode_number":8,"episode_type":"standard","id":265195,"name":"Killer Pass","overview":"Record snowfall mixed with now warmer temperatures has turned Atigun Pass into a devil's slide - slippery than ever and at an all time high for avalanche risk.","production_code":"308","runtime":43,"season_number":3,"show_id":3780,"still_path":"/slqeVgl1IcikGi51HNUiV38coIU.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-07-26","episode_number":9,"episode_type":"standard","id":265196,"name":"Turn and Burn","overview":"With just three weeks to go, everyone is pushing it to the limit to get the freight to Deadhorse before the season ends. Lisa convoys north with Jack Jesse while Tim and George are delayed in Fairbanks.","production_code":"309","runtime":43,"season_number":3,"show_id":3780,"still_path":"/Aam9Up1JWtOdUvZ4cGohWFMp068.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-08-02","episode_number":10,"episode_type":"standard","id":265197,"name":"Ocean Run","overview":"With only two weeks left Alex is determined to take the lead. He immediately takes a back haul assignment, but the load isn't strapped securely and threatens to fall off.","production_code":"310","runtime":43,"season_number":3,"show_id":3780,"still_path":"/sBhHuhw4n6PhPF6mdwLxjfaQX4f.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-08-09","episode_number":11,"episode_type":"standard","id":265205,"name":"Busted Parts and Breakdowns","overview":"A volcanic eruption in Southern Alaska sends Jack Jesse racing up to the North Slope with the first load of diesel reserves. Meanwhile, a major mechanical breakdown leaves Lisa stranded without heat in the frigid temperatures.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/l6rNFeKK9KkyiYeJVAPcZf415Uw.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-08-16","episode_number":12,"episode_type":"standard","id":265206,"name":"Race for the Finish","overview":"After several impressive runs this season, Lisa takes on a big haul of high explosives. Meanwhile, harsh icy conditions southbound on Atigun Pass cause Jack to spin out for the first time this season.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/xpON3RzbkUDeRxerzrQto8WdkgE.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-08-23","episode_number":13,"episode_type":"finale","id":265207,"name":"Arctic Thaw","overview":"As the \"Dash for the Cash\" comes down to the wire, legendary driver George Spears calls it a career, Lisa makes a harrowing 300-mile run with no brakes, and polar bears shut down the Ice Road.","production_code":"","runtime":43,"season_number":3,"show_id":3780,"still_path":"/lnlUTX4Yc42I8XVTx0h1c1cXH4T.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"This season, Ice Road Truckers is headed to Alaska—250 miles north of the Arctic Circle. Trucker legends Hugh “Polar Bear” Rowland and Alex Debogorski return to take on the most death-defying road so far. Hundred-foot cliffs, hairpin curves, avalanches and -70 degree temperatures are just a few of the challenges that await them. And here in Alaska, Hugh and Alex are no longer considered the kings of the road. Their co-workers at Carlile Transportation, including veteran George Spears, the “King of the Haul Road,” and the fearless Jack Jesse, know what it’s like to haul everything from giant loads of construction materials to oversized drilling rigs across the deadliest ice passage in North America, and they’re looking to show Hugh and Alex a thing or two about driving in Alaska.","id":11333,"poster_path":"/8uvgqJOTmcfp5PNFMk6oOIWZcUZ.jpg","season_number":3,"vote_average":7.9},"4":{"_id":"5257569819c29531db142d1f","air_date":"2010-06-06","episodes":[{"air_date":"2010-06-06","episode_number":1,"episode_type":"standard","id":265208,"name":"Breaking Through","overview":"As the season 4 kicks into gear, the truckers take off on a 500-mile-long ice-covered road called the Dalton, encountering dangerous obstacles along the way.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/xPjnxnc09qnSNQ1rbkfmUikc6RB.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-06-13","episode_number":2,"episode_type":"standard","id":265210,"name":"The Polar Bear Returns","overview":"Hugh \"the Polar Bear\" Rowland returns to Alaska at last and has to face down his haul road nemesis: chaining up. Meanwhile, failing trailer brakes and trash talk over the CB threaten to derail Lisa's comeback.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/wr0CxGdfwtrkGKiCAP0s2YLoYLZ.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-06-20","episode_number":3,"episode_type":"standard","id":265209,"name":"Facing Down the Blow","overview":"Jack, Hugh and Alex hit the haul road during a ruthless windstorm, with near-misses and disastrous engine trouble threatening to take them down. Meanwhile, Lisa, haunted by her recent missteps, sets out on the Dalton, determined to prove she is more than a pretty face.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/slIu04Qg35cebVBhsPIr6cbHvfM.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-06-27","episode_number":4,"episode_type":"standard","id":265212,"name":"Monster Storm Over Atigun","overview":"A monster storm is hammering Atigun Pass, and if they want to survive, the Ice Road Truckers will have to think fast. Ray and Lisa make plans to keep the loads moving, but rookie mistakes send both drivers rolling directly into the heart of the storm.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/z7rnmHD5cMmlHT6wyinwPfR9iWd.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-11","episode_number":5,"episode_type":"standard","id":265211,"name":"Trapped On Thin Ice","overview":"Jack Jesse rushes to save the town of Nuiqsut with an emergency fuel delivery, but a blinding storm stops him on the thin ice of the frozen river road. Meanwhile, Lisa Kelly gets her big chance to step up when she's given her first oversized load. As she battles both the elements and the law, however, she begins to wonder if her trucking skills are up to the test.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/hy8gH0sakW8B0VN684knLxuxJkl.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-18","episode_number":6,"episode_type":"standard","id":265213,"name":"Danger at 55 Below","overview":"As the temperature plunges, tempers flare after Hugh gets an earful from a driver who wants him off the Alaskan roads and back in Canada. Meanwhile, Alex takes a big risk by picking up a hitchhiker and Lisa struggles to get back on the road after a minor traffic safety setback.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/wBMoorp7hplp925rkVMKk1j6AHo.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-25","episode_number":7,"episode_type":"standard","id":265214,"name":"Avalanche!","overview":"When an avalanche strikes, Jack is left helpless as he watches the DOT clean up the carnage. Meanwhile, Ray faces the Dalton with a premonition of death hanging over him, and Hugh risks a head-on collision at 4,700 feet by driving on the wrong side of the road over Atigun Pass.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/4dxoPDfLiYVRtwnLcGuF6KZZt4d.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-08-01","episode_number":8,"episode_type":"standard","id":265215,"name":"Lisa's Monster Megahaul","overview":"Lisa tackles the most dangerous haul of the season, trucking a multi-million dollar, 100-ton load across the entire state of Alaska. Meanwhile, Alex races to keep pace and Ray faces the worst night of his career when a spin-out at Ice Cut sends him over the edge.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/yp6qL8B2sZJrSNGpJWTJTceRUhd.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-08-08","episode_number":9,"episode_type":"standard","id":265216,"name":"Blood on the Dalton","overview":"Alex is thrust into a tough situation when a flipped truck leaves two men injured and one missing. Meanwhile, a careless mistake may rob Lisa of the hard-earned respect she has worked for all season long. Also, Greg fights for his job as Hugh devises a plan to steal a load from his old pal.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/mnSF4qdEdZzLEwc2bTYKsVixnSO.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-08-15","episode_number":10,"episode_type":"standard","id":265217,"name":"The Ace vs The Ice","overview":"To reach the isolated town of Bettles, Jack Jesse must brave the arctic wilderness and cross a frozen river. Meanwhile, Greg takes on the biggest load of his career and Alex has a plan to one-up his rival Hugh. Will the Polar Bear go down without a fight?","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/9sC6SnFfKRzuLwTjNfiAZHE8o33.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-08-22","episode_number":11,"episode_type":"standard","id":265218,"name":"A Rookie's Nightmare","overview":"A minor distraction sends rookie Ray Veilleux plowing into a snow bank and leaves him at the mercy of his fellow truckers. Meanwhile, trouble heats up for Lisa and Hugh when their cargo just won't stay put.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/jgX26YAQHP605Dh0lbjmKrTJlYb.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-08-29","episode_number":12,"episode_type":"standard","id":265219,"name":"The Dalton Strikes Back","overview":"The Ice Road Truckers face one challenge after another when Ray spins out after pulling a risky maneuver, Alex ventures out onto the road with a burnt-out headlight and Greg experiences mechanical issues. Meanwhile, Jack lugs a 200-ton megahaul to Prudhoe and Lisa races to raise cash to buy back her horse.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/cce2aJQ4C5Sxp6FIr0UICyJzhWZ.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-09-12","episode_number":13,"episode_type":"standard","id":265222,"name":"Convoy to Hell","overview":"The Ice Road Truckers take on a dangerous mission: the largest convoy the Dalton has ever seen on the road to Nuiqsut. On the way, they must navigate softening ice so that rising temperatures don't send them all to a watery grave.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/DJUuNV6jYon1Sc3KZkG6TAwsfU.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-09-19","episode_number":14,"episode_type":"standard","id":265220,"name":"A Legend Meets His End","overview":"A haul road legend's son heads to Atigun to say his final goodbyes and scatter his father's ashes but the legend's final ride puts Ray at risk. Meanwhile, Lisa's assigned to push-truck a monster load to Prudhoe, which leaves her feeling accomplished.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/vImL5d23I0ox7M6g5ckSVuZXk0V.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-09-26","episode_number":15,"episode_type":"standard","id":265225,"name":"Deadly Melt","overview":"The Alaskan DOT races to stop potentially dangerous overflow from wiping out the Dalton and its truckers. Meanwhile, as the season nears its end, the truckers team up for safety, Hugh gets busted for speeding and Jack and Lisa come across an overturned rig.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/dNyQkZ9hi3CqtQ5EwBk4ZpCq5yu.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-10-03","episode_number":16,"episode_type":"finale","id":265223,"name":"New King of the Dalton","overview":"Co-leaders Ray and Greg come face to face in Atigun, while Lisa's hard work pays off with an unforgettable reunion, Alex pushes to finally beat his nemesis and Jack's hope to repeat as King is in jeopardy in the season finale of Ice Road Truckers.","production_code":"","runtime":43,"season_number":4,"show_id":3780,"still_path":"/tMHeNxUH0ojSrXEySAHHwZ7IRHS.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"The Ice Road Truckers return to Alaska, hauling their biggest loads ever across the most dangerous terrain they’ve faced. But this year, trucking critically needed cargo north to the oil fields of Prudhoe Bay is just the beginning. The drivers will tackle frozen rivers and swamps out beyond the Dalton Highway, hauling supplies to some of the most remote towns of the Great White North. Reigning king Jack Jesse looks to defend his title, and Lisa Kelly, one of the only woman truckers on the haul road, fights to prove herself in the male-dominated profession. Rookie Ray Veilleux, who recently lost his business in the lower 48, has come north to run the road and keep his struggling family afloat. And, continuing their decades-long rivalry, veteran drivers Hugh Rowland and Alex Debogorski are back racing neck and neck. The stakes are high as the dash for cash is on again.","id":11334,"poster_path":"/ppSK1alahhVDsIB6X7aWdHaxSBt.jpg","season_number":4,"vote_average":8.1},"5":{"_id":"5257569819c29531db142d35","air_date":"2011-06-05","episodes":[{"air_date":"2011-06-05","episode_number":1,"episode_type":"standard","id":265232,"name":"Pushing the Edge","overview":"The Ice Road Truckers are back in action, and the roads are more dangerous than ever. Lisa's first run of the season goes south in a hurry. Two rookie drivers raise the stakes in the \"Dash for the Cash.\" And old pros Hugh and Alex, along with wildcard Rick Yemm, leave Alaska behind to take on some of the most remote and deadliest roads on the planet.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/puGArhHQ4UWeiyfF2VxfI0qLO1U.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-05","episode_number":2,"episode_type":"standard","id":265231,"name":"Ice Road Rage","overview":"Hugh and Rick roll deeper into the Canadian outback, while a dangerous overflow may leave Alex stranded in the wilderness. Dave's training run with Tony reaches the boiling point. Lisa Kelly goes on a rescue mission. And Maya's first look at the Haul Road may be enough to send this rookie back to the big city.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/c18xxlaDvtyRTcwnJW2pcrqDbme.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-12","episode_number":3,"episode_type":"standard","id":265233,"name":"Wrong Turn & Burned","overview":"Lisa gets a chance to redeem herself after last year's failure when Maya lands in hot water. Meanwhile, Dave's temper may cost him his chance to be an ice road trucker, and a wrong turn sends Rick in reverse.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/nJqF7t1LnkIWHAivELmGOPXrhAw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-19","episode_number":4,"episode_type":"standard","id":265235,"name":"Fire on Ice","overview":"Hugh and Rick play with fire when a bent rim throws them off their schedule. Meanwhile, Maya takes the wheel for the first time and Dave sets out on a haul to Prudhoe under the watchful eyes of his Carlile bosses.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/h8709pKrdDrWN1FZtCH5fLgSVFc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-26","episode_number":5,"episode_type":"standard","id":265234,"name":"Under the Hammer","overview":"Ice road veterans are put to the test when sparks fly during a massive haul, leaving one trucker in a dangerous situation. Meanwhile, Lisa helps out a fellow trucker in need of roadside assistance. Will she keep up her reputation as a push-truck pro?","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/xkb3Q8TlvElAnsOCTN6DpQxHlPx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-10","episode_number":6,"episode_type":"standard","id":265236,"name":"The Braking Point","overview":"Rick and Hugh continue their marathon run, but the Winter Roads wreak havoc on the trucks leaving Hugh stuck on the side of the road.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/1gkRIOSOXGQgcOHgwS5wZALmX83.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-17","episode_number":7,"episode_type":"standard","id":265237,"name":"A Banged-Up Job","overview":"The Canadian roads show no mercy for Hugh when a blow-out leaves him stuck on the side of the road. Meanwhile, Alex rescues a local family stranded in the wilderness and Lisa's dream job turns into a nightmare as she struggles to handle a massive load.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/5rhi4MOJLsw304RzHFLkBgh4Cep.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-24","episode_number":8,"episode_type":"standard","id":265239,"name":"Meltdown!","overview":"Halfway through the season, the biggest storm yet descends on the Dalton. Facing more than just a whiteout, the truckers must overcome a series of snags and find themselves in need of rescue. Meanwhile, Lisa faces the consequences of her last load ending in the ditch.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/kfTC8I3sD3jITS1iAGqkvR9xEjB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-31","episode_number":9,"episode_type":"standard","id":265158,"name":"Road to Nowhere","overview":"A whiteout paralyzes the Dalton as the truckers struggle to stay on the road. Meanwhile in Canada, Hugh and Rick end up lost when they take a dangerous haul into some of Ontario's most remote terrain.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/pQ6AueBMsTVOWgfQoPzRtHKPVH6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-07","episode_number":10,"episode_type":"standard","id":265240,"name":"Rookie Rebellion","overview":"Harsh winter weather has left Lisa stranded in Prudhoe Bay. Dave is in a convoy with Maya and Tony, he tests their patience before leaving them behind. In Canada, Rick's frustration reaches a boiling point and he snaps, while Hugh rescue's Rick's truck, again.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/gIOXJdK3Lmbuzs0K54zxcOMwtao.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-14","episode_number":11,"episode_type":"standard","id":265242,"name":"Hittin' the Skids","overview":"Hugh and Rick face an obstacle that has the ice road blocked, until Hugh decides to clear a path, while Alex gets too close for comfort with a parked car.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/fBgmbDpf1RcUoVOBgnb08FGcT6X.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-21","episode_number":12,"episode_type":"standard","id":265243,"name":"No More Mr. Nice Guy","overview":"Hugh, Rick and Alex meet up at a fuel stop and decide to convoy north together. Back in Alaska, Lisa gets the break she's been waiting for when she convoys with Tony on the widest load yet, while things start to heat up for Maya.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/937vUmq8sMC4xavIyYsjd8xbhiW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-28","episode_number":13,"episode_type":"standard","id":265160,"name":"Ice Rogue Trucker","overview":"Lisa and Tony honor a fallen trucker by spreading his ashes off of the Dalton, and Alex presses on despite feeling ill. Meanwhile, Hugh hauls a 30-ton load of boulders down the thawing surface of Lake Winnipeg while Rick is stuck waiting for repairs.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/u1VFx7sq22T1ud342Yiy2n2oIWF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-04","episode_number":14,"episode_type":"standard","id":265244,"name":"The Heat is On","overview":"In Alaska, Lisa and Maya help a stranded driver get back on the road. Tony gets a surprise from Carlile while Dave continues his descent into isolation. In Canada, Hugh and Rick keep up their load count with backhauls. Alex has to deal with unstable freight but also scores a backhaul, keeping the race with his rival close.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/sznF1HJbc0ayFP05PlTyOj2VBP6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-18","episode_number":15,"episode_type":"standard","id":265246,"name":"Judgement Day","overview":"With the end of the ice road fast approaching, the Ice Road Truckers are sprinting to the finish. But they've got obstacles. A polar bear standoff at Prudhoe Bay tables the plans for oil production and ties up Carlile's loads at the most crucial time of the season. A veteran trucker's calculated risk puts his life and livelihood in jeopardy. One rookie's sent packing as the other picks up the slack. And the Dalton's favorite daughter gets her groove back.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/bOFMhikzMGWemWSqlx4RYV9hcnL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-25","episode_number":16,"episode_type":"finale","id":265245,"name":"The Last Dash","overview":"The season end is approaching and so is the load count in the Dash for the Cash. Hugh and Rick has trouble in Canada, will Alex take over the lead? Maya the Dalton-rookie convoys with Lisa to the remote and isolated Nuiqsut village. Tony deals with deteriorating road conditions and Dave leaves Alaska for Alabama.","production_code":"","runtime":43,"season_number":5,"show_id":3780,"still_path":"/8IIqwhlr0zKS2O4wbSKZpnGwcoT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"This season, from Prudhoe Bay, Alaska, to northern Canada’s Manitoba Province, the ice road truckers will risk it all to deliver essential goods and supplies to the oil fields and villages that dot the planet’s harshest landscape. Along the way they will battle temperatures that plunge to -40 degrees, blinding snowstorms and thinning ice. Three new faces will take on veteran drivers Hugh Rowland, Alex Debogorski and Lisa Kelly to see if they have what it takes to win the dash for the cash.","id":11336,"poster_path":"/9MlvtDffYVVUPFaFW1NkW2zKNhm.jpg","season_number":5,"vote_average":0},"6":{"_id":"5257569819c29531db142d40","air_date":"2012-06-03","episodes":[{"air_date":"2012-06-03","episode_number":1,"episode_type":"standard","id":265248,"name":"Aces and Jokers","overview":"The Ice Road Truckers battle across the continent over frozen lakes, rivers, and ocean. Alex heads farther north than ever before on the deadly Dempster. Hugh and Rick face an impossible task on the thin ice of Manitoba's Winter Roads. In Alaska, veteran Jack Jessee returns to lead a pack of hungry new drivers on Carlile's biggest mission in history.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/7k3QSerRpyuRWTzRa5AVjkgcCCf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-10","episode_number":2,"episode_type":"standard","id":265249,"name":"Sink or Swim","overview":"Alex drives on the Arctic Ocean, to the northernmost Canadian village accessible by ice road. Hugh and Rick face melting ice in a desperate search for missing trailers. In Alaska, a massive oil rig move continues as Jack struggles to mentor impatient young driver, Austin Wheeler. And, it's judgment day for the Dalton rookies as both Darrell and Porkchop meet with the boss to see if they pass their training runs.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/nPLMJYZPSMb9on6Cf2ZoGWjQ7X5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-17","episode_number":3,"episode_type":"standard","id":265250,"name":"Hammer Down","overview":"In Alaska, the clock is ticking on the Dalton as the deadline to deliver a massive oil rig pushes every driver to step it up to get the job done. Will the pressure of his first ice crossing cause one rookie to crack? Plus, Alex races to deliver a load to a village across an icy river delta, but a looming storm threatens to trap him just inches above the rushing current. And, Hugh and Rick fight the melting winter roads to deliver their first load of the season to Winnipeg, when a rookie mistake leaves Rick in the line of fire.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/altXgSkvluS5mGOAMCusrgDHHOB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-24","episode_number":4,"episode_type":"standard","id":265251,"name":"No Way Out","overview":"A trailer malfunction threatens to strand Jack Jessee in inclement weather; Darrell struggles through a whiteout; and Hugh and Rick are forced to cross untested ice in order to transport water tanks to a remote community.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/jH5rJXloBTUHixJE1aM6h8jAji4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-01","episode_number":5,"episode_type":"standard","id":265252,"name":"Desperate Measures","overview":"Austin spends a night in a ditch; Jack is forced to remove two wheels from his trailer; Porkchop is pulled off the road by Lane; and Hugh and Rick brave melting roads with a heavy load of two cement trucks.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/jnyQyj4ONbek1c3sBPWxubHue5z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-08","episode_number":6,"episode_type":"standard","id":265253,"name":"Blood, Sweat, and Gears","overview":"Austin is tasked with transporting an entire cabin; Jack struggles to navigate a dangerously slick section of road; Lane teams Porkchop with Darrell; Hugh and Rick get into trouble with the law.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/cTPm6fpmhcug7ipPy034SjyJH37.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-15","episode_number":7,"episode_type":"standard","id":265161,"name":"Hard Road Ahead","overview":"Rick makes an unpleasant discovery about his truck; Alex hauls a dangerously heavy excavator; Lane gets out on the road.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/4Ofoab3VfYwc855buHe9F1vnjL7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-22","episode_number":8,"episode_type":"standard","id":265255,"name":"Proving Ground","overview":"A huge wreck affects Darrell's aspirations to be king of the haul road; Porkchop tangles with precarious sheer cliffs on an access road; Austin joins the heavy-haul team; and Alex faces obstacles on the ice.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/3MCc6ikkm6a3J7F1Z0QBGULBsEL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-29","episode_number":9,"episode_type":"standard","id":265256,"name":"Braking Bad","overview":"Austin's heavy haul through snow leads to a rookie mistake; Darrell  is sorely tested by an infamous pass; Porkchop is assigned an unexpected load; Hugh enlists a motley crew to drive across ice; and a one-lane mine road pushes Alex to the limit.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/5zOSVxGekd8IcxvaF42dAaRyRCQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-05","episode_number":10,"episode_type":"standard","id":265257,"name":"Stacking the Deck","overview":"Alex hauls a high-priced load down a dangerous one-lane road; Austin struggles with heavy cargo; Hugh helps a rookie driver who runs into trouble on the ice.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/9R6fO5sjboj5chkBhK8ChtV2HUW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-12","episode_number":11,"episode_type":"standard","id":265162,"name":"Hurricane Alley","overview":"Alex gets caught in a whiteout; frost heaves cause trouble for Darrell; Austin is forced to load oversize cargo by himself.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/a8EK4nwmhMUTlKkt9x7OC2IGJKJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-19","episode_number":12,"episode_type":"standard","id":265259,"name":"Battle Lines","overview":"Rick gets into an accident; Austin struggles to haul 85 foot sections of pipe; Porkchop helps Jack with his delivery; Darrell fights to stay warm after his truck dies on the road.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/vVZ1hZPcmF4lmHM4r49fALiuOq8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-26","episode_number":13,"episode_type":"standard","id":265260,"name":"Cold-Blooded","overview":"Jack scrambles to leave town; Alex braves brutal weather conditions to deliver machinery needed to reopen a critical road; Hugh jeopardizes his friendship with Rick.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/wMUfZz4CL2SE1YU7K3qnqGqs0sv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-09","episode_number":14,"episode_type":"standard","id":265261,"name":"Chopping Block","overview":"Alex encounters high winds as he hauls a dangerous load of compressed gases; Austin helps a stuck trucker; and Rick puts his cargo in jeopardy while trying to get payback on Hugh.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/heC90eppf0EozfXtsrT4CkIuJFe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-16","episode_number":15,"episode_type":"standard","id":265262,"name":"Race the Melt","overview":"Jack and Darrell rush to make a delivery before their road shuts down; Ray is hampered by a breakdown; Alex takes a risk with an extra large trailer; and Hugh and Rick are forced to put their differences aside.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/3BjPb48eTfiAILT7caiYEw1s9pd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-23","episode_number":16,"episode_type":"finale","id":265263,"name":"The Final Showdown","overview":"Austin hauls a huge modular building;,Alex runs into trouble while transporting supplies across a section of frozen ocean; and Hugh and Rick get into a heated argument.","production_code":"","runtime":43,"season_number":6,"show_id":3780,"still_path":"/zfGuEhaF8FIPJsyr7v37R9WAo7x.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"This season, the Ice Road Truckers battle the farthest reaches of the North American continent. In Alaska, oil exploration is at an all-time high, and Carlile drivers are preparing for the busiest season in Dalton history. This year, they’ll push past Prudhoe Bay and head out onto the remote oil fields of the North Slope. In Manitoba, Canada, warm weather has made the normally rough winter roads barely passable, and every driver will be forced to battle the thinnest ice the winter roads have ever seen. In the Yukon, drivers take to Canada’s Dempster Highway, crossing rivers, lakes and even the Arctic Ocean to make deliveries to the northernmost settlements accessible by ice road.","id":11337,"poster_path":"/3vHf7qSTe67oBXYnwRitfTj5Vsz.jpg","season_number":6,"vote_average":0},"7":{"_id":"5257569819c29531db142d4b","air_date":"2013-06-09","episodes":[{"air_date":"2013-06-09","episode_number":1,"episode_type":"standard","id":982381,"name":"Collision Course","overview":"Hugh Rowland returns to the winter roads with a grudge and a goal; Mark Kohaykewych enlists some of Hugh's biggest rivals.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/bg4MTQX6JCc8iiqGzVHSYcEzTwQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-16","episode_number":2,"episode_type":"standard","id":265272,"name":"Art Attack","overview":"VP Express finally delivers their first loads of the season, but after a heated confrontation with owners Hugh Rowland and Vlad Pleskot, new hire Art Burke falls behind the bosses on the way back home. When his truck breaks down hundreds of miles from Winnipeg, Art suddenly finds himself stranded and alone. Polar snags a lucrative new contract, but it's over one of the most dangerous roads in Manitoba. Darrell Ward is the first to blaze the trail, but when he fails to conquer a mammoth incline, he's sent rolling backwards onto the ice. Fellow Polar drivers Lisa Kelly and Alex Debogorski follow close behind, but Lisa's broken wrist threatens to shut her down in the remote Canadian wilderness.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/81Esfg0hctfqUZBwO3Sa99UUNjv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-23","episode_number":3,"episode_type":"standard","id":265265,"name":"Fear the Crack","overview":"With loads needed to be hauled for their half million dollar contract, VP bosses Hugh Rowland and Vlad \"The Mad Russian\" Pleskot agree to keep struggling new hire Art Burke aboard. But they bring in new ice road hopeful Todd Dewey to keep freight moving and put pressure on Art to perform. In a convoy with Hugh and Art, Todd is put to the ultimate test as he faces the first ice crossing of his career. After rival Polar Industries snags a deal to haul loads over a newly opened road, Darrell Ward is sent out to test it, but his truck has a problem that could prove to be deadly. Lisa races to get off the winter roads and back into the load count battle with rival VP Express. While Alex Debogorski retraces his steps over the deadly Shamattawa trail with a giant forklift, knowing a successful delivery will help Polar hold off his old rival Hugh.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/hg9IhNiZhCQpMg5eJKDwMIMnShz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-30","episode_number":4,"episode_type":"standard","id":265264,"name":"Ice Rodeo","overview":"Hugh's new company is in trouble. Mechanical trouble and angry employees cause him grief. Meanwhile, Lisa gets a chance to prove herself with her heaviest load of the season. Darrel faces a new problems.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/2WjbrF3aBq8aOKZBWrzEOLj3k6R.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-07","episode_number":5,"episode_type":"standard","id":265267,"name":"World War Hugh","overview":"Polar Industries has pulled ahead of rival VP Express, and VP boss Hugh Rowland decides to hit the road on his own. Polar scores a lucrative contract hauling million dollar parts for a water treatment plant, but both Darrell Ward and Alex Debogorski face major delays.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/oNTLo4pGKxq4u04ozBZoUTjtKYV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-14","episode_number":6,"episode_type":"standard","id":265269,"name":"Hail to the King","overview":"Things get ugly when VP Express boss Hugh Rowland steals a driver from Polar Industries and convinces the new hire to use his truck to block his former employer's front gate. Polar boss Mark Kohaykewych shows his faith in Lisa Kelly by sending her on a challenging, one-day round trip mission.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/qinKYan8ipnQHxX6wFZhSkJEC2j.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-21","episode_number":7,"episode_type":"standard","id":265268,"name":"Load Rules","overview":"Alex Debogorski races to complete one of Polar's most critical hauls of the season after a dashboard fire nearly costs him more than just a paycheck. Lisa's forced to stop in the middle of a frozen lake when she loses sight of the road. Darrell Ward's patience with Polar reaches its limit after he fails to receive a promised load. At VP Express, Art Burke and Todd Dewey run into trouble when they find their high priced hauls frozen in the snow. And the King of Obsolete's convoy breaks through the ice on one of the most remote trails in Manitoba.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/pC2SS9cXsswqKGf2JCQ4PGo4MKB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-28","episode_number":8,"episode_type":"standard","id":265270,"name":"Art of War","overview":"The landscape in the battle for winter roads supremacy is shaken to the core as Art Burke locks horns with VP Express bosses Hugh Rowland and Vlad Plescott while at Polar, Darrell Ward confronts owner Mark Kohaykewych. Alex Debogorski gets stuck on a pressure ridge hauling a $100K load on the ice. And Lisa Kelly encounters her most treacherous ice crossing of her young winter roads career.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/oV8eKgRV1H9xfkhHB9meCPF5skw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-04","episode_number":9,"episode_type":"standard","id":265273,"name":"Haul of the Wild","overview":"Drivers Lisa Kelly, Alex Debogorski, Art Burke and Darrel Ward all attempt to conquer a remote, unmonitored trail, as the battle for Ice Road supremacy presses on. From lake crossings on thinning ice to wrong turns in the wilderness, the crew from Polar is put to the test. Meanwhile, rival VP Express' run over the melting roads leads to trouble when boss Hugh Rowland crashes into the ditch. Plus, Hugh shakes up the winter roads war when he makes Lisa an offer she might not be able to refuse.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/vv2FPRy2nGHs5tsgKCTjEtAIA4r.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-11","episode_number":10,"episode_type":"standard","id":265274,"name":"Jagged Little Hill","overview":"As the end of the season nears, Polar tries to fulfill their contract over the unregulated road to Utik Lake. But when a jackknifed truck blocks the remote trail, it's up to Darrell Ward to move the wrecked rig all by himself. Lisa Kelly also braves the path to Utik with her heaviest haul of the season, and the melting roads give her a ride she'll never forget. New Polar hire Art Burke struggles on his first solo run as engine problems threaten to shut him down. At VP, rookie Todd Dewey's excavator haul causes multiple tires to blow out from under the massive weight. And The King of Obsolete's crew breaks through the ice at one of the northernmost destinations on the winter roads.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/g0Ptwo7L5olGBpDhN0YzmVurTzt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-18","episode_number":11,"episode_type":"standard","id":265275,"name":"The Wrecking Crew","overview":"With only days remaining in the season to determine the load count winner, Polar and VP Express race to deliver hauls over the rapidly melting roads. At VP, boss Hugh Rowland drives a fire truck up the rugged route to Wasagamack. But before hitting the trail, he makes an unwelcome surprise visit at the Polar yard. Rookie Todd Dewey tries to make it back to Winnipeg with a load so light, he struggles to gain any traction. Polar driver Alex Debogorski is unable to manage the slick roads and crashes grill first into the ditch. Polar convoy Darrell Ward and Lisa Kelly hit the road with the widest haul of the season. But when Darrell's truck is unable to pull the monster load any further, it's up to Lisa to take it the final stretch.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/mEHeETxxj3BP555aQSKQGp66Z3H.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-25","episode_number":12,"episode_type":"finale","id":265276,"name":"Winter Takes All","overview":"As the ice roads melt away, Polar and VP Express are neck and neck in the load count. Racing to come out on top this season, both Polar and VP take on a late season mission to the remote village of God's Lake. Every driver joins the massive race, hoping their company comes out on top. But with the roads melting, getting in is only half the battle. Every driver must make it off the roads before they melt away or risk losing their truck and cargo to the Manitoba backwoods. It's the final dash for the cash, and only one company can win the load count.","production_code":"","runtime":43,"season_number":7,"show_id":3780,"still_path":"/sXLjTILdFO7zpKpihodyicc2Alu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"The battle lines are drawn in Manitoba, Canada. Hugh “Polar Bear” Rowland returns after quitting his job at Polar Industries and sets up his own shop right down the street. Bound and determined to reclaim his crown as “King of the Road,” he poaches Polar’s dispatcher, intent on landing enough loads to force his old company into submission. Hugh rounds up the toughest truckers he can find and they hit the winter roads. However, Polar Industries and its owner, Mark Kohaykewych, aren’t about to take this challenge lying down. To counter this threat on their turf, they enlist some of Hugh’s biggest rivals. Ice road legend Alex Debogorski signs on with Polar as well as Alaskan trucking icon Lisa Kelly, after a year hiatus. Montana legend Darrell Ward is also enlisted by the crew at Polar. \n\nThis season also chronicles an eccentric mechanic way up north who dances to the beat of a completely different drum. Joey Barnes, nicknamed “The King of Obsolete,” fills his yard with trucks from decades past. Many of the vehicles are rarities, and some have been re-engineered as Joey’s own unique pieces of equipment. He’s taken it upon himself to use his fleet of trucks to rescue those stuck in the most remote corners of Manitoba.","id":11338,"poster_path":"/n1AvGdNaAhM1eUmKLJDBZ2ez417.jpg","season_number":7,"vote_average":0},"8":{"_id":"55beb5a5c3a3686959005eff","air_date":"2014-07-07","episodes":[{"air_date":"2014-07-07","episode_number":1,"episode_type":"standard","id":1093754,"name":"The Gathering Storm","overview":"As the season opens, the race begins for VP Express and Polar Industries. This year both companies face a much bigger adversary, the Polar Vortex, bringing with it the worst winter conditions in a century. With the storm only days away, it's a race for loads. Lisa Kelly and Darrell Ward return to lead team Polar to victory, while Art Burke and Todd Dewey both set out to prove to the boss that they can deliver with the best of them. Meanwhile, at VP Express, seasoned pros and former rivals Alex Debogorski and Hugh Rowland join forces and head out into the frozen frontier.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/oIsAk5mIXOjqX4R955aoRjcP17Y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-14","episode_number":2,"episode_type":"standard","id":1093755,"name":"Rushin' Roulette","overview":"The truckers attempt to deliver their loads as a huge storm approaches. Lisa and Art have to deal with a deadly shutdown. Darrell and Todd don't get along and Alex is searching for divine assistance on thin ice.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/wMOXWLjYv7Xx8iHClRvTRNJFWst.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-21","episode_number":3,"episode_type":"standard","id":1093756,"name":"Into the Vortex","overview":"A brutal storm descends on the winter roads, and frozen hell comes with it. Blinding winds, driving snow, and bone-chilling cold assault the ice road truckers as they fight their way through the storm of the century to deliver their critical cargo. But even the toughest truckers on the planet are no match for Mother Nature, and losing this battle might cost them their lives.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/yKcPD9rlzjN5SstKqEMLW8nVsSs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-28","episode_number":4,"episode_type":"standard","id":1093757,"name":"Snow Bound","overview":"A monster storm brings record breaking snowfall onto the winter roads. Polar drivers Darrell and Todd try to muscle through, while the rest of the team fights to survive, stranded in the wild with no help in sight and no hope on the horizon. Meanwhile, despite frigid temperatures the war between VP Express and Polar reaches a boiling point.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/9T7PJCVlL2kZWSegJvBarGtPzY9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-03","episode_number":5,"episode_type":"standard","id":1093758,"name":"The Storm Troopers","overview":"The battle royal with Mother Nature continues as the Ice Road Truckers fight through the storm of the century. Art, Todd, and Lisa press their luck on ice that is buckling under the weight of heavy snow. As conditions deteriorate, Alex is left running on fumes and in desperate need of a lifeline. Darrell goes toe-to-toe with his boss in a fight that'll be a game changer on the winter roads.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/7yOVTseUq8imjtGyG7PkEJQ0une.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-10","episode_number":6,"episode_type":"standard","id":1093759,"name":"The Lone Wolf","overview":"A defection in the ranks takes the battle for the winter roads to a whole new level. Hugh hatches a plan for VP Express to crush the competition, hauling the most lucrative load to date across treacherous terrain. The pressure is on Todd and Lisa to up their game and push further out into the frozen frontier.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/92HbjxZWNU8Cb4QFYF8xlx8Wz2f.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-17","episode_number":7,"episode_type":"standard","id":1093760,"name":"Blazing the Trail","overview":"With temperatures on the rise, conditions on the ice roads quickly deteriorate. The truckers from Polar and VP Express are pushed to the brink, crossing thin ice on their way to deliver critical loads. Lisa and Todd go where no other trucker this season has gone before, tackling a remote road that's completely untouched. After cutting ties with Polar, Darrell races to deliver loads to make up for lost time. Art's mishaps on the ice roads could cost him his job.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/lYkBzAmznEpk0TKbb5HZctEe4kv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-24","episode_number":8,"episode_type":"standard","id":1093761,"name":"Highway to Hell","overview":"Lisa and Todd embark on one of the toughest missions of the season, tackling an untamed trail dubbed the `Highway to Hell'. Darrell Ward steals business out from under his former boss at Polar Industries. A crash could mean the end of Alex's trucking season.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/r5Vk3BDqchmn5Om7PPcLv8QotUd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-07","episode_number":9,"episode_type":"standard","id":1093762,"name":"Flirtin' with Disaster","overview":"With Darrell's new company on a roll, he calls in a surprising reinforcement, but can this new team member hack the treacherous ice roads. A brush with near disaster could cut Hugh's season short. And, Lisa and Todd convoy into unchartered territory on a privately built, unmaintained road through the frozen frontier.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/pikp3VTAo5bFnL1n7C9dBBEGoMH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-14","episode_number":10,"episode_type":"standard","id":1093763,"name":"Icing on the Lake","overview":"Darrell continues teaching Reno how to drive the ice roads, but Dad's overprotective ways may be too much; Art gets some royal help on a trip far north; faulty wiring could sink Alex's cement load; Lisa and Todd hit a road block in their race to keep Polar in the load count competition.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/484be72YtMVtL3rDmTNryBwW8ps.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-21","episode_number":11,"episode_type":"standard","id":1093764,"name":"Journey to the End of the Earth","overview":"With temperatures rising and the winter roads quickly melting away, it's a mad dash to the finish line. VP Express and Polar are neck and neck in a race to end the season on top. Polar drivers Lisa, Art and Todd embark on an epic journey up the longest seasonal winter road in the world. VP stays closer to home, traveling treacherous roads in a late attempt to boost their load count.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/urwBFC3sXBRJLkrEDdxtoUJlFfS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-28","episode_number":12,"episode_type":"finale","id":1093765,"name":"World's End","overview":"The end of the line is here. The Polar drivers face the long, difficult journey back down the world's longest seasonal winter road. Lisa has to make a game-changing decision...help a competitor push further into the arctic unknown or stick with her teammates and convoy back to Polar headquarters. Her decision could be costly as conditions quickly deteriorate.","production_code":"","runtime":43,"season_number":8,"show_id":3780,"still_path":"/x7Y2K1fHFz6yn67eecFQAqDx3FA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"This season, the toughest job in the world just got tougher. A polar vortex has descended onto the Canadian backcountry, creating the most severe winter in over a century. Freezing winds, towering snow and blinding whiteouts push the drivers to their emotional and physical breaking points. Despite the brutal conditions, Polar Industries and VP Express aren’t backing down from the war that started last year. VP boss Hugh Rowland has stolen ice road legend Alex Debogorski away from Polar. Although they’ve been rivals in the past, having the two titans together on the same team might just provide the edge VP needs to run Polar out of town.","id":69229,"poster_path":"/eeu0WZ6KxnaaItwdH6LQa9UXINY.jpg","season_number":8,"vote_average":0},"9":{"_id":"55be7f9ec3a3686539004ef8","air_date":"2015-08-02","episodes":[{"air_date":"2015-08-02","episode_number":1,"episode_type":"standard","id":1093693,"name":"Crossing Enemy Lines","overview":"In the Season 9 premiere, Darrell Ward attempts to poach a legendary rival driver from Polar Industries, which could spark an all-out war.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/vVfiGl91ziatvHUdePfaksKBPn2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-09","episode_number":2,"episode_type":"standard","id":1093750,"name":"Icy Grave","overview":"The war for ice road supremacy is heating up and Polar Industries is pushing their drivers to the absolute limit. Art Burke must cross one of the longest winter roads in the world. Polar's top driver, Todd Dewey, is forced to dig himself out of mountains of fresh snow or risk a dangerous night in freezing temperatures. Rival, Darrell Ward, takes a load over a newly opened road littered with abandoned trucks frozen in time.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/x2Jcj2h5zNkWFMUCPvpABN3nlLH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-16","episode_number":3,"episode_type":"standard","id":1093753,"name":"Trail Blazers","overview":"Polar Industries goes for the record books, sending driver Todd on a risky run to deliver the heaviest load in company history. But will the weight prove to be too much on a tenuous ice crossing? Art is sent on a high stakes rescue mission and finds the job more than he bargained for. Lisa lands an exclusive contract over one of the wildest trails in Canada. Darrell steals a load from Polar, leading to a clash between him and Mark.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/noMjZYIv7cie4bfh4TZi7HMDAl7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-23","episode_number":4,"episode_type":"standard","id":1093752,"name":"New Cold Blood","overview":"Polar boss Mark Kohaykewych shakes things up when he brings new soldier Mike Simmons into the winter roads battle. But when the rookie's paired with company wildcard Art Burke, it makes for a rocky trip. Top dog Todd Dewey and rival Darrell Ward both hit a newly opened trail, but when Todd breaks down in the middle of nowhere, he might be out of luck and out of time. Polar veteran Alex Debogorski gets lost and must rely on pure instinct to find his way out. And new business owner Lisa Kelly faces an ice road trucker's nightmare on a dangerous crossing.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/jGzk7Ef9iaDjCf0zimwnp9NzqyA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-30","episode_number":5,"episode_type":"standard","id":1093751,"name":"Power Trip","overview":"New business owners Darrell and Lisa get the jolt they need with a high stakes mission of transformers desperately needed for a distant town's electrical supply. Polar's top dog Todd Dewey runs into trouble with a government contract. Truck problems have Polar driver Art Burke's season headed for the gutter. Ice road rookie Mike Simmons tries to get over the hump on his first solo delivery.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/rKJ34CBBA4z0FGrMqtbYJPnzDAs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-13","episode_number":6,"episode_type":"standard","id":1213802,"name":"Break On Through","overview":"Darrell Ward and Lisa Kelly try to make good on a power play for their young company but could lose everything when Darrell's truck breaks down. Polar driver Todd Dewey must backtrack hundreds of miles to recover lost freight or risk losing a vital contract. Rookie Mike Simmons' inexperience costs him on one of Canada's toughest winter roads. And as trails and crossings continue to melt, Art Burke finds himself fighting for his life on the ice.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/ojitmwgLKcn2LKlFwPimAiNDAwV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-20","episode_number":7,"episode_type":"standard","id":1108951,"name":"The Art of Survival","overview":"The battle gets down and dirty as the roads melt beneath the drivers' wheels. Art Burke fights to keep his rig above ground on a melting ice crossing, while fellow Polar driver Alex Debogorski fights his way up a mud covered mountain. Renegade rivals Lisa Kelly and Darrell Ward struggle on a trail at ground zero of the thaw, where getting stuck could sink their company for good.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/pdnSsy4iTobRmWdY0pwpY9CZ6ef.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-04","episode_number":8,"episode_type":"standard","id":1213804,"name":"Mother Nature Scorned","overview":"In the midst of the early thaw, Darrell and Lisa struggle to make it home over the hardest hit trail on the winter roads system. Art and the King of Obsolete reunite to haul a giant double trailer over over a slick path. Veteran Alex Debogorski races against the clock to deliver to a town in need before the road closes, while fellow Polar driver Todd Burke finds a unique way to conquer a melted ice crossing.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/9wflVhd90skfzjHqRoF9f1zl1Uw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-11","episode_number":9,"episode_type":"standard","id":1213805,"name":"Hell Freezes Over","overview":"The two rival companies join to take on the biggest challenge in Ice Road Truckers history--pulling a cat train across the Hudson Bay. But when the untested ice shatters under the the weight of the heavy haul, it becomes a desperate fight for survival.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/zEbTX9du47P3VQEmajLqS82nYF4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-18","episode_number":10,"episode_type":"finale","id":1130997,"name":"Icy Alliance","overview":"In the season's dramatic finale, Lisa and Todd struggle to complete their daring joint venture across the frozen Hudson Bay. Darrell braves the most torn up trail remaining on the winter roads. Art must face the last open ice crossing and his first since his near fatal trip weeks earlier. Deep in the thawing wilderness, a tanker sideswipes Alex.","production_code":"","runtime":43,"season_number":9,"show_id":3780,"still_path":"/ioOkJTCTGAPy9gGnB8LwDYuqcoz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"The battle for supremacy on the winter roads begins a bold new chapter. After two seasons of domination, Polar Industries is back to defend its place as load count champs in Manitoba, but Darrell Ward is ready to take on his former employer with his upstart company. He’s also stealing one of Polar’s superstar drivers to help him try to win the fight–Lisa Kelly. After breaking through the ice at the end of last season, not only is Lisa joining forces with the Montana Legend, she’s even getting a percentage of the company.","id":69218,"poster_path":"/g0cZk7DCts5qXQ3yiLRyoow0rde.jpg","season_number":9,"vote_average":0},"10":{"_id":"57a35e9ec3a3686c4a005f29","air_date":"2016-08-04","episodes":[{"air_date":"2016-08-04","episode_number":1,"episode_type":"standard","id":1211965,"name":"Against All Odds","overview":"Experts predict a small window of opportunity, so truckers must defy the odds to get their loads delivered or risk financial ruin that will also impact their communities.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/z16C1nDmcRhrplVLl7qLWlLb1GY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-08-11","episode_number":2,"episode_type":"standard","id":1211966,"name":"Feeling the Heat","overview":"At Polar, a truck crashes into a snowbank. Legendary Alex Debogorski makes his return by taking on an untested crossing. The Polar boss tests a new driver. Lisa Kelly encounters a monster incline. Two long-time rivals meet deep in the wilderness.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/qW48VK1RL70yQY474Yha31ioxYQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-08-18","episode_number":3,"episode_type":"standard","id":1213793,"name":"Breakdown","overview":"Lisa Kelly becomes stranded hundreds of miles from the nearest town. Darrell Ward takes a risky off-road short cut that's untested by any other truck. Art Burke comes upon a melting ice crossing and a load that's right at the weight limit. 22-year-old Steph Custance learns whether she'll be driving for Polar.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/iHs9g6PC9jPeml3W3SFaHTO2iiT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-08-25","episode_number":4,"episode_type":"standard","id":1213794,"name":"Trial By Ice","overview":"Darrell Ward and Lisa Kelly head into Alberta looking to expand their company, and encounter a trail called \"the Death Road\"; Art Burke takes on the ice crossing where he nearly lost his life; Polar's top dog Todd Dewey takes rookie Steph Custance under wing, as she embarks on her first ice-roads journey.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/ndcIlv3MS482YBcSiB7etvJyqmt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-01","episode_number":5,"episode_type":"standard","id":1217039,"name":"The Rookie","overview":"22 year old Steph Custance tries to conquer the first ice roads of her career, but an ice crossing pushes her to the limit. As temperatures rise, Alex Debogorski runs into a road block. Art Burke is acting as a diplomat for Polar by delivering to a new remote community. Darrell Ward braves an unregulated winter road.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/ilGxiDDU8feSxBLM4znpCSZ8gNn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-08","episode_number":6,"episode_type":"standard","id":1221258,"name":"Bridge to Nowhere","overview":"Darrell Ward faces off with a trail named \"The Obstacle Course\". Todd Dewey struggles to clear a melting ice bridge. Veteran Alex Debogorski is pushed to his limits hauling an oversized fuel tank and Art Burke finds an ice crossing in the middle of the night.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/qsuhSUo6R8ENIQp8uwpx6SP7kyM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-15","episode_number":7,"episode_type":"standard","id":1224459,"name":"Into the Fire","overview":"Polar driver Steph Custance braves one of the longest ice crossings on the winter roads map and to make things worse, she is all alone. Darrell Ward attempts a triple delivery in a single day, meanwhile Lisa Kelly is stopped dead in her tracks by an engine fire. Todd Dewey celebrates his birthday stuck on the edge of a closed road.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/v2hOS88GeQkHRDGPZX0MxLycMBj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-22","episode_number":8,"episode_type":"standard","id":1224460,"name":"Hell Nino","overview":"Todd must fix his truck or risk being stranded 100 miles form the nearest town. Alex Debogorski has to cross a creek that has thawed in the middle of the road. On an important run for Polar Industries, Art Burke receives some news that could be devastating. Lisa Kelly  battles an ice crossing unlike any she has seen before.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/8TwLKqNuhGDFl8ckX0Q4QJi9ETQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-29","episode_number":9,"episode_type":"standard","id":1224461,"name":"The Convoy","overview":"As the end of the season nears, Polar Boss Mark Kohaykewych makes a historic deal with Darrell Ward and Lisa Kelly to team up for a four truck convoy over a closed road. Alex Debogorski must complete one of the longest trails in the final hours to make a delivery and Art Burke's truck breakdowns on the ice.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/aRIRiUBElZT042esMkUuFJAzsZP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-06","episode_number":10,"episode_type":"finale","id":1229386,"name":"The Final Ride","overview":"The four truck convoy faces fire and an ice crossing so thin, they must test the thickness themselves. After Art Burke's engine dies, he must ride back with Alex Debogorski to Winnipeg over a trail that destroys the old pro's truck.","production_code":"","runtime":43,"season_number":10,"show_id":3780,"still_path":"/3m7l11OgcZjt3TY2jfjMWSlii7H.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"Polar Industries is back to defend its place as load count champs in Manitoba. But Darrell Ward and Lisa Kelly are not backing down. In fact, they are building a trucking empire of their own and won't let Polar stand in their way.","id":79026,"poster_path":"/b7zgoKxyDEIS8K8QGDhVIzyeJnc.jpg","season_number":10,"vote_average":0},"11":{"_id":"599fef03925141779300e527","air_date":"2017-08-24","episodes":[{"air_date":"2017-08-24","episode_number":1,"episode_type":"standard","id":1355214,"name":"The Ice is Right","overview":"The ice is right? After two short seasons, the drivers are ready for what is forecast to be a cold and busy winter. But the tragic passing of legendary driver Darrell Ward leaves the community of drivers wondering who can take his place.","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":"/lFWeR2gGqYGhq2aLXzh6uaJpJwA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-08-31","episode_number":2,"episode_type":"standard","id":1355379,"name":"Jackknife Jeopardy","overview":"The ice road season is off to a bad start. Lisa Kelly finds herself in a real jam after jackknifing her truck deep in the backcountry. Then legendary trucker Alex Debogorski gets more than he bargained for when he falls through a patch of thin ice. But Todd Dewey is able to step it up when he comes to the aid of a stranded trucker.","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":"/ylziqoZrrexpS6ts5SLnB9c3dK4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-07","episode_number":3,"episode_type":"standard","id":1355380,"name":"Helter Melter","overview":"A sudden warm up threatens to derail the ice road season just as it kicks into high gear. Art Burke finds himself battling some of the scariest and slickest roads of his life. Meanwhile, Lisa Kelly is forced to ask her former boss, Mark Kohaykewych, for financial help after her truck sustains severe damage. And Alex Debogorski encounters a mystery man walking alone on an isolated winter road.","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":"/czF7JDWB3lzcJaeMeaI5tqiL7MH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-14","episode_number":4,"episode_type":"standard","id":1355384,"name":"Meltdown Blues","overview":"After rising temperatures close the ice roads the drivers are stranded and praying for a freeze. But once a blast of arctic air reopens the ice roads it’s time to put the pedal to the metal. But be careful what you wish for because newbie Steph Custance falls victim to severe icing and winds up in a ditch. Meanwhile a trio of truckers, Lisa Kelly, Art Burke and Todd Dewey are about to see if newly reopened ice crossings are really ready for their big rigs.","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":"/bNrcd9StiIRU53kFFfM3FOFrikC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-05","episode_number":5,"episode_type":"standard","id":1355385,"name":"The Son Rises","overview":"Polar Industries is in for a big payday if they can deliver a huge oversized load hundreds of miles north on the winter roads. Polar owner Mark Koyhaykewych recruits Lisa Kelly to help with this unprecedented load, but they still need another trucker to join their convoy. That’s when Mark and Lisa call in Reno Ward, the 23 year-old son of the late Darrell Ward, hoping his father’s tutelage–and DNA–will help them meet this unprecedented challenge. But nature has other ideas as a sudden blizzard adds a new layer of danger across the frozen north. Meanwhile rookie Steph Custance has a heavy load that won’t sit still and veteran Art Burke cusses his way through the entire ordeal.","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":"/3chPQ598yywzi41TDnJWNrVx9jr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-12","episode_number":6,"episode_type":"standard","id":1376577,"name":"A Bridge Too Far","overview":"A small convoy heads out on the winter roads with a giant oversized load. The treacherous journey over nearly impossible terrain will be the ultimate test of skill for Lisa Kelly and Reno Ward. Meanwhile Art Burke attempts to cross a grueling 25 mile Ice Road over a frozen lake. Veteran trucker Alex Debogorski tries to make up lost time but sticks by the code of the road as he stops to help a stranded fellow trucker. And Todd Dewey tackles a snowy road that just might get the better of him.","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":"/oXLSEYlUDSHpsQseyLWB5sa5aR7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-19","episode_number":7,"episode_type":"standard","id":1376578,"name":"Of Ice and Men","overview":"The ice roads are at their meanest and slickest when Reno Ward has a disastrous encounter with a speeding pick-up. Then as Lisa Kelly attempts to rescue him her truck is pushed to the breaking point forcing her to leave Reno to fend for himself. Alex Debogorski finds out the hard way that small roads and oversized loads are a bad combination. Meanwhile Art Burke is a man on a mission as he attempts to deliver a Zamboni to save an isolated community's hockey season.","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":"/8gzXR772JZsXsRJLBBSNwxfsO6a.jpg","vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2017-10-26","episode_number":8,"episode_type":"standard","id":1376579,"name":"The Big Skid","overview":"After nonstop wild weather it appears the winter roads want revenge. A big bump in the road takes out Art Burke's radiator and causes a coolant crisis, while a tight turn snags Todd Dewey's rig in a deep snow bank. Steph Custance's foray onto a wet ice crossing - becomes a true regret. Meanwhile, Alex Debogorski is moving a construction shack that might be too heavy for the ice - so the veteran trucker uses a steel sled to drag the huge haul across a frozen lake.","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":"/lLdJktYsYEY6GLD6O3BvL9AeLMp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-02","episode_number":9,"episode_type":"standard","id":1385213,"name":"Double Trouble","overview":"A volatile season is winding down and it seems like trouble comes in doubles. Lisa Kelly and Steph Custance barely get by when they team up for safe passage on the icy terrain. Art Burke takes on a two-fer, bringing a split load into the North Country, hoping this will be his last load of the year. And Polar owner Mark Kohaykewych gives Todd Dewey a job that might just be impossible: hauling a double oversized camp shack up the twisty, narrow road to the village of Big Trout. Can it be done? Todd doesn't think so!","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":"/7PyafmP5tLYTpoHwvyy3vzR5E90.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-09","episode_number":10,"episode_type":"finale","id":1388405,"name":"One Last Lick","overview":"The spring thaw is in full melt mode as the drivers get one last lick before the ice roads close for the season. Steph Custance is the first to experience nature's wrath as she slips and slides deep into the trees off a slick road. Meanwhile Todd Dewey is struggling with a big load of construction material over a long and twisty trail. Art Burke is not a happy camper when he is pressed into service to retrieve a super heavy bulldozer over a rapidly melting ice crossing. Reno Ward takes a risky final run just to have his truck die on the ice. And Lisa Kelly is heading home when she gets an emergency call to come to the rescue before it's too late.","production_code":"","runtime":43,"season_number":11,"show_id":3780,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 11","overview":"As the Ice Road Truckers head into season 11, a tragedy has shaken them to the core—the loss of one of their brother in arms. Meanwhile, old rivalries are shattered when Lisa and Darrell’s son, Reno, join the Polar squad, uniting everyone onto one team. Together, they must haul a massive cargo load through yet another warm winter—a risk that could cost them everything.","id":91840,"poster_path":"/ygFkmE24eUb12zWQNiWb9efjBj9.jpg","season_number":11,"vote_average":5}}}