{"adult":false,"backdrop_path":"/y69mF3ZEdulAUDvCfl0IoNyRw6W.jpg","created_by":[],"episode_run_time":[50],"first_air_date":"2010-10-21","genres":[{"id":99,"name":"Documentary"}],"homepage":"https://lifestyle.com.au/tv/grand-designs-australia/","id":38245,"in_production":false,"languages":["en"],"last_air_date":"2023-03-09","last_episode_to_air":{"id":4443339,"name":"Coober Pedy 'Dug Out', SA","overview":"","vote_average":0,"vote_count":0,"air_date":"2023-03-09","episode_number":16,"episode_type":"finale","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null},"name":"Grand Designs Australia","next_episode_to_air":null,"networks":[{"id":683,"logo_path":"/9MBltiYrqFNgMSecwmFPrf1UAfS.png","name":"LifeStyle","origin_country":"AU"}],"number_of_episodes":108,"number_of_seasons":10,"origin_country":["AU"],"original_language":"en","original_name":"Grand Designs Australia","overview":"Follows intrepid individuals as they try to design and construct the home of their dreams.","popularity":7.685,"poster_path":"/pVjMUDVELlekVX4uMlz6lgmoXrw.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2010-10-21","episode_count":9,"id":49727,"name":"Season 1","overview":"","poster_path":"/zAL2lVlpON0senLq4VYR38upLCf.jpg","season_number":1,"vote_average":0},{"air_date":"2012-04-05","episode_count":10,"id":49728,"name":"Season 2","overview":"","poster_path":"/dzWjMbDABp3MlyvYRj19dgEBdkc.jpg","season_number":2,"vote_average":0},{"air_date":"2012-10-18","episode_count":10,"id":49729,"name":"Season 3","overview":"","poster_path":"/kIkog0dYebKxwPVcyV0KaQC5N88.jpg","season_number":3,"vote_average":0},{"air_date":"2013-10-10","episode_count":10,"id":49730,"name":"Season 4","overview":"","poster_path":"/tJwS5jplz8A8iROODXbCGOVuQUv.jpg","season_number":4,"vote_average":0},{"air_date":"2014-10-09","episode_count":10,"id":84149,"name":"Season 5","overview":"","poster_path":"/1v6BCeJ36fm6Gm6iNmuQzXBYbPk.jpg","season_number":5,"vote_average":0},{"air_date":"2015-06-04","episode_count":11,"id":84150,"name":"Season 6","overview":"","poster_path":"/3GWcp7lkg0l8PtmplZhXmDI6OAd.jpg","season_number":6,"vote_average":0},{"air_date":"2017-04-27","episode_count":14,"id":87932,"name":"Season 7","overview":"","poster_path":"/aeQzg4GCWZDu4lcTeilRXMc6qm0.jpg","season_number":7,"vote_average":0},{"air_date":"2019-07-17","episode_count":10,"id":128983,"name":"Season 8","overview":"","poster_path":"/7Ey7ZyzP56zmL0mP0WEEfQtQztb.jpg","season_number":8,"vote_average":0},{"air_date":"2021-03-31","episode_count":8,"id":188766,"name":"Season 9","overview":"","poster_path":"/rnxMX6D2Hk5APxvMw2NLqBC686T.jpg","season_number":9,"vote_average":0},{"air_date":"2022-05-05","episode_count":16,"id":287089,"name":"Season 10","overview":"","poster_path":"/3EJ0K5HVPpXX35nscvvJblJ7M7U.jpg","season_number":10,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":6.7,"vote_count":9,"season_data":{"1":{"_id":"5258ecd5760ee346618bbad5","air_date":"2010-10-21","episodes":[{"air_date":"2010-10-21","episode_number":1,"episode_type":"standard","id":858080,"name":"Bushfire House","overview":"February 2009. Chris Clarke had just spent two years building his minimalist timber and steel dream home at Callignee in Gippsland when, less than a week after completion, it was burnt to the ground in the devastating Black Saturday bushfires. With nothing remaining but a concrete slab and a burnt out shell Chris was left shattered and numb.\n\nAfter recovering from the initial grief he was determined to re-build and re-use every last salvageable element of the original house. What he creates in the year or so following is simply remarkable. By adding sturdy recycled elements with the latest fire resistant materials, Chris sets out to produce a tough, resilient version of the original home (now dubbed Callignee One). Wearing its embattled past as a badge of honour, will Callignee Two not only face up to the Aussie bush?","production_code":"","runtime":50,"season_number":1,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-28","episode_number":2,"episode_type":"standard","id":858081,"name":"Very Small House","overview":"Architect Domenic Alvaro and his partner Sue Bassett are urban animals who love the inner city suburb of Surry Hills in Sydney. However their dream location comes with a nightmare price tag. So, they come up with a unique way of keeping costs down and do this by buying very small and building very tall.\n\nAfter buying a tiny corner car park measuring 7m x 6m they set out to create 220 square metres of light filled living space. Their vertical build comes together quickly thanks to pre-fab concrete panels which fit together like Lego. Construction itself is fast and efficient but there are interesting challenges on site. A miniscule block and two narrow cross streets won’t submit to the needs of a gigantic crane in a hurry – and the crane is essential as it hauls the huge panels and windows into position. Basically something’s gotta give – and it does. Will the result be worth the hassle?","production_code":"","runtime":50,"season_number":1,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-04","episode_number":3,"episode_type":"standard","id":858082,"name":"Southport Heritage House","overview":"When Jan and Ed Gillman bought a tumble-down weatherboard in Southport, their first intention was to demolish and start again. But on learning its unique history as the 1880’s summer house of Sir Augustus Gregory (one of the oldest houses in Southport), they decide to restore instead and plan to lift the original house and move it forward two metres on the block.\n\nWhat follows is a painstaking restoration process – and with no official heritage guidelines in place Jan and Ed are faced with a difficult choice: take the laborious path of restoring the house to its former glory or opt for the easier path and lose the history of the house.","production_code":"","runtime":50,"season_number":1,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-11","episode_number":4,"episode_type":"standard","id":858083,"name":"Clovelly House","overview":"Julie and Patrick Eltridge bought in Sydney’s beachside Clovelly three years ago, paying $1.6 million for an old house on a sloping block. It was the land and its sea views they wanted, not the asbestos-riddled house. With time a concern, they have to find a way to fast track a slick, uber modern, two-story residence in a matter of months. The solution comes from Melbourne and a firm of pre-fab builders, who custom build them four top end, architect designed modules in a highly efficient, regulated environment. On completion, the pods will be trucked to Sydney in a dramatic, oversized convoy and then crane lifted into position. Another challenging element of the build centres around the demolition and site preparation in Sydney. One of the site issues has more twists and plot turns than an Agatha Christie novel making the new modules look like a breeze.","production_code":"","runtime":50,"season_number":1,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-18","episode_number":5,"episode_type":"standard","id":858084,"name":"Lake Bennett House","overview":"For 17 years Trevor and Francoise Sullivan have lived with their two kids and numerous animals in an open sided shed on 33 bushy acres at Lake Bennett south of Darwin. With money tight they were sustained by thoughts of the beautiful home they’d one day enjoy – so they both nutted out a unique design. A cyclone proof, tropical tree house that is windowless and based on the shape of a 50 cent piece. With little or no funds, Trevor (a wood carver) is building it all himself (including furniture) with the help of generous mates. The going is slow but one of the first things finished is the magnificent central staircase, carved from a fallen Paperbark Tree. Will they get the roof on before the wet season? That is the question.","production_code":"","runtime":50,"season_number":1,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-25","episode_number":6,"episode_type":"standard","id":858085,"name":"Hamptons House","overview":"If ever there was an ideal place for a Hamptons house outside the Hamptons, the Gold Coast hinterland would be it – wide open spaces, balmy sea-kissed air and a sense of prosperity. For Steve and Lisa Morley it’s the American dream or nothing for their 4,000 square metre block.\n\nThey love everything about the Hamptons style, from the warm timbers, to the many windows, pavilion style design, parquetry flooring and classic, soft interior furnishings. Lisa has done her research, designing many elements herself and will stop at nothing to fulfill her dream.","production_code":"","runtime":50,"season_number":1,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-02","episode_number":7,"episode_type":"standard","id":858086,"name":"Fish Creek Church House","overview":"Nothing like an impulsive act to take you down a path you hadn’t expected in life. For engineer Peter Riedel and his interior designer wife Mary, their sudden whim was to purchase an 1870’s church for $20,000. It wasn’t even upright at the time and all they got was a pile of boards. Still, it captured their imagination and a plan took shape to re-build the church on their property, overlooking Wilsons Promontory and convert it into a house. Like putting together a giant jigsaw puzzle, their biggest challenge is the number of pieces missing.","production_code":"","runtime":50,"season_number":1,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-09","episode_number":8,"episode_type":"standard","id":858087,"name":"Cottage Point House","overview":"Drew Muirhead is a self employed entrepreneur and man about town. He’s building a Balinese resort style mansion in leafy Cottage Point. Not one to do things by halves, Drew’s mansion will have Balinese Pavilions, an infinity pool, its own nightclub, five bedrooms, four bathrooms and a steam room. It all faces a private beach with boatshed and speedboat.\n\nThe biggest battle for Drew, who is project managing the build – is the steep sloping block and access.","production_code":"","runtime":50,"season_number":1,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-16","episode_number":9,"episode_type":"finale","id":858088,"name":"Indented Head House","overview":"Ian McDonald and Rob Wilhelm are not building an understated new home. Theirs is a Grand Design in its most literal sense. A glass box with a roof like floating wings overlooking Port Phillip Bay on the Bellarine Peninsula – seven bedrooms, seven bathrooms, cinema, games room, glass lift, glass panelled pool, rooftop garden – all the bells and whistles, all the boy’s toys. With a construction budget of $1.8 million, the question is will they burst the budget banks and by how much?","production_code":"","runtime":50,"season_number":1,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":49727,"poster_path":"/zAL2lVlpON0senLq4VYR38upLCf.jpg","season_number":1,"vote_average":0},"2":{"_id":"5258ecd5760ee346618bbae0","air_date":"2012-04-05","episodes":[{"air_date":"2012-04-05","episode_number":1,"episode_type":"standard","id":858089,"name":"Brighton Sixties","overview":"Over the years, Nick and Anna McKimm have almost made a hobby of renovating, selling and moving on. But with three young children, they’re ready to lay down permanent roots and build their dream home. A sleek, modernist, 60’s inspired family residence on a large, half acre block in Melbourne’s bayside suburb, Brighton. Nick heads up a successful building company and knows a lot about quality period reproductions - particularly classical architectural styles - and Anna has a flair for beautiful fit-outs. But as they’re about to learn, mid-century building is very different to other architectural styles and comes with its own challenges.","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-12","episode_number":2,"episode_type":"standard","id":858090,"name":"Paynesville Industrial","overview":"Ten years ago retired Civil Engineer Bernie Ryan and his wife Ruth, packed up their three kids and moved to Paynesville, a charming seaside town in Victoria's popular Gippsland Lakes region. Bernie’s a tinkerer with a huge shed filled with crazy projects started in a flurry, but left unfinished. Needing a new house and unwilling to pay a builder, Bernie takes on the construction himself, armed with an eccentric, industrial design, a minimal budget and a cowboy attitude. Bernie wheels out his old crane and ropes in a bunch of retired mates to lend a hand. He’s built bridges and industrial constructions before, but this is Bernie’s first ever house - and his ‘she’ll be right’ attitude lands him in hot water when the building inspector turns up unannounced. Bernie tries to do as much as he can on the cheap, with supportive Ruth ever hopeful he’ll pull it off, so the family can move from their rough old shed into a real home. This is a makeshift, do-it-yourself construction that could easily end up a shambles. Will this be the one project Bernie manages to finish, or a blight on Paynesville’s picturesque skyline?","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-19","episode_number":3,"episode_type":"standard","id":858091,"name":"Five Dock Retro","overview":"Anne Potter loves all things retro - the fashion, the cars... even the hairstyles. So ten years ago, it was no surprise that she and husband Michael snapped up a modest 60’s bungalow overlooking the harbour in Sydney’s Five Dock. Since then their family has expanded and with three very active boys, they are really feeling the squeeze so they’re tearing down the old house to build their own modern version of a retro home, with curved steel and walls of glass with a hint of Mondrian inspired colour - a complete contrast to the well-kept, more conservative homes that surround them. This is Anne’s dream opportunity. As an interior designer by trade, she’s keen to be actively involved in creating their special home. But she’s been a stay-at-home mum, out of the industry for ten years, and overseeing a house construction is a whole new challenge. Can she keep across the intricacies of the job in between school drop offs, supermarket runs and cooking the dinner?","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-26","episode_number":4,"episode_type":"standard","id":858092,"name":"Kyneton Flat Pack","overview":"Kyneton, a country town in Victoria’s Macedon Ranges, is known for historic architecture and bustling farmers markets. It’s the perfect place for foodies Rod Moore and Di Foggo – who are embarking on a huge life change. They’re farewelling a classic Victorian home with traditional furnishings and building a brand new, cutting edge flat pack house on a rugged escarpment overlooking the racecourse. Di is a keen gardener and wants to create a lofty paradise with a wide, rolling view. They’ve been burnt before with budgets spiralling out of control and schedules doubling, so they have chosen a high end, quality flat pack home knowing there’s a fixed price and a speedy schedule. Trouble is, the land isn’t complying and from almost day one generates unexpected problems. Seems even the most regulated grand designs are at nature’s mercy.","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-03","episode_number":5,"episode_type":"standard","id":858093,"name":"Trinity Beach Pole House","overview":"Daniel Leipnik and Andrew Preston have long cherished the dream of a laid-back, barefoot life in the tropics. And they have found the ideal location at Trinity Beach near Cairns in Far North Queensland. Their ambitious new home will grace a hillside block bordering a World Heritage rainforest and overlooking the Coral Sea. After years planning this grand sea-change, they are ready at last to manage its construction. Their vision is for a classic pavilion-style pole home, nestled in the tree tops. But project managing is tough enough if you’re on site… and they’re attempting the job from 4,000 kilometres away in Melbourne, plus this is a first time experience for them both. While they believe they’ve left no stone unturned designing their South Pacific inspired hideaway, they can’t escape the challenges of the location. A precarious driveway, tropical downpours and expensive local trades are all threatening to send their budget and schedule spiralling out of control. Between pressing work commitments and the tyranny of distance, these idealists still believe they can pull off the house of their dreams. The question is, can they?","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-10","episode_number":6,"episode_type":"standard","id":858094,"name":"Gladysdale Dry Stone House","overview":"For nine years, Michael and Sandy Rutledge have been making the weekend pilgrimage to their lush 20 acre property in Gladysdale, an hour east of Melbourne. Now they’re leaving the city for a permanent tree change and building a new family home on their acreage. But first they have to agree on a design. Sandy has a passion for Old World European, inspired by her travels overseas, whereas Michael’s a techno whiz who likes sleek, contemporary homes. Can their architect marry their differing tastes with definite ideas of his own? One thing everyone agrees is that this should be a house with a sense of permanence, a house that will stand the test of time thanks to thick walls encased in dry stone. But seems it can’t even manage a first season as continual wet weather causes delays and flooding. Before work is even finished, they have to face the unthinkable – the house isn’t waterproof! Despite their best efforts it’s an ongoing battle against the elements. Can they curb the leaks and deliver Sandy the stone fortress she’s been dreaming of?","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-17","episode_number":7,"episode_type":"standard","id":858095,"name":"Stonyfell Watertank","overview":"Life in Adelaide, the driest capital city in Australia, has made Mike Dare and wife Lowen Partridge passionate about conserving water. Like many people, they decided to put a couple of water tanks in their new house. But these are tanks with a difference. Massive, custom designed steel anchors that support the house above the ground. With the roof acting like a giant funnel, 100,000 litres of water can be caught and stored in the tanks which are hidden behind internal walls. It’s out of the box thinking and what Mike does best. With 40 years of design and engineering work on some of Adelaide’s most prominent buildings, he’s developed a reputation as a lateral thinker. But Mike is now responsible for creating something that looks great too and preferably in the colour he’s most comfortable with – grey. Mike likes total control so he’s acting as architect, engineer and project manager. Working with logical systems on a house built largely offsite in factories, what could possibly go wrong? Just all the things he can’t control: the weather, the schedule, his walling company going broke and most importantly – his wife’s opinion of the colour grey.","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-24","episode_number":8,"episode_type":"standard","id":858096,"name":"Yellingbo Artist's House","overview":"Art teacher and sculptor Laurie Smith and his wife Renee Hoareau, a trained artist turned web designer, are both zealous art lovers; so joy of joys when, after years of searching they found the ideal block to create their ‘sculpture in space’. It’s almost as if this picturesque piece of Victoria, with its red alluvial soil, was designed especially for their new dream home. Their vision is to create a sort of domestic gallery that will inspire both inside and out. A modernist cube shaped construction of steel, stone and glass that celebrates and pays tribute to some identifiable artistic references. This will be a place to live, work, create and display their extensive art collection in equal measure. Inspiration comes from many sources – for example the 25 metre long stone facade with its tricky curved window is reminiscent of a well known state gallery. But handing over artistic license to a construction team is a big ask especially after an oversight at one of the first jobs on site, the concrete pour. It’s an early reality check that tests their ability to let go and trust. Will they manage to go with the flow and end up with the art house they so desperately crave?","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-31","episode_number":9,"episode_type":"standard","id":858097,"name":"Battery Point Glass House","overview":"Adventurous, outdoorsy types, Greg Kay and Trish Knight, live in the ideal spot to enjoy nature - right on the waterfront in Hobart’s exclusive Battery Point. The view is dazzling and the aspect fabulous so when the time comes to downsize, they don’t want to go far – and end up buying the block next door. The plan is to subdivide, sell the heritage cottage at the front of the block and build a new house at the back, facing the water. But councils have a way of altering even the best laid plans – and after several set backs and a re-think, Greg and Trish find themselves embarking on an epic upsizing adventure. The old cottage must be integrated into a massive new house with two distinct zones – historical cottage at the front, ultra modern glass, timber and exposed concrete extension at the back. But it’s not easy. Stubborn blue stone bedrock, steep, narrow, restricted access, and a rogue sewage line indicate trouble ahead. Add to that an architect given free reign, contracts done on a handshake, and Greg’s insistence on quality, and you have a schedule blow out with a budget spinning out of control. The big question is – can they afford to live there?","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-07","episode_number":10,"episode_type":"finale","id":858098,"name":"Steels Creek Earth House","overview":"Edd and Amanda lost everything when bushfires swept through Steels Creek. Determined to stay with the land they love, they're building a concrete bunker embedded in the landscape with one side facing the outside world.","production_code":"","runtime":50,"season_number":2,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":49728,"poster_path":"/dzWjMbDABp3MlyvYRj19dgEBdkc.jpg","season_number":2,"vote_average":0},"3":{"_id":"5258ecd5760ee346618bbaeb","air_date":"2012-10-18","episodes":[{"air_date":"2012-10-18","episode_number":1,"episode_type":"standard","id":858100,"name":"Mansfield Indoor/Outdoor","overview":"Victoria's high country is the idyllic location of Pamela & Stuart's quaint little weekender but with a permanent move here looming, it's time to upsize.","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-25","episode_number":2,"episode_type":"standard","id":858099,"name":"Hampton Timber","overview":"Jenny & Brett are replacing their loved Californian Bungalow with a sculptural, Japanese style all timber house with wrap-around pool. Pure dedication ensures this uniquely challenging build triumphs despite the challenges.","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-01","episode_number":3,"episode_type":"standard","id":858103,"name":"Balnarring Rammed Earth","overview":"Eco conscious entertainers Claire and Lisa adore their hobby farming lifestyle on Victoria's Mornington peninsula, but the cute 1930's beach shack they've long shared with two pugs has lost its once savoured charm. They're upgrading and building a sustainable, modernist, entertainers' home that blends sophisticated design elements with rammed earth, recycled materials and raw finishes. It all sounds glamorous and straightforward but with a zero contingency budget what happens when a wet winter meets an insidious clay soil?","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-08","episode_number":4,"episode_type":"standard","id":858102,"name":"Warburton Arch House","overview":"Tyrone & Hailey follow the advice of a feng shui expert or 'energy ecologist' throughout construction of their new house. An owner-built labour of love, their passive solar building has a curved living roof planted with native grasses.","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-15","episode_number":5,"episode_type":"standard","id":858101,"name":"Byron Bay Beach House","overview":"Max and Mariella have been planning to relocate to Bryon Bay since the birth of their daughter Ruby. As successful property developers, an ambitious build shouldn't be a problem - but handing over control to a local building team is harder than they thought. From the outset they make fundamental changes to the design making it a headache for the builder and for Max. Something has to give - especially when the bank learns the house they're loaning money on isn't quite the house being built.","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-22","episode_number":6,"episode_type":"standard","id":858106,"name":"Annandale Urban House","overview":"Brett and Rees are the proud parents of three young boys and desperately need more space. They love their inner west community in Sydney's Annandale, so the plan is to build on the small empty allotment behind their apartment. The first sod has barely been turned when one of the heritage buildings on their boundary is in danger of collapsing. Exhausted by ongoing battles and a build that's months behind schedule - will Brett & Rees have enough grit and determination to see their project through to completion?","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-29","episode_number":7,"episode_type":"standard","id":858104,"name":"Barossa Valley Glass House","overview":"James & Helen plan to capture breathtaking Barossa views in their elegant new home. 60 metres long, 1 room wide and virtually all glass, it looks straightforward on paper. The complicated part is building it.","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-06","episode_number":8,"episode_type":"standard","id":858105,"name":"Ocean View House","overview":"There's nothing flimsy about Brunella & Carlo's contemporary home in QLD's Ocean View. It's 'semi brutalist' architecture designed to last and driven by Brunella's passion for concrete.","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-15","episode_number":9,"episode_type":"standard","id":858108,"name":"Surry Hills Small House Revisited","overview":"Domenic and partner Sue bought small and built big.","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-22","episode_number":10,"episode_type":"finale","id":858107,"name":"Clovelly House Revisited","overview":"Julie and Patrick fast tracked the construction of their modern beachside home, thanks to a firm of pre-fab builders in Victoria. Peter re-visits them to learn how they have settled in.","production_code":"","runtime":50,"season_number":3,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":49729,"poster_path":"/kIkog0dYebKxwPVcyV0KaQC5N88.jpg","season_number":3,"vote_average":0},"4":{"_id":"5258ecd5760ee346618bbaf6","air_date":"2013-10-10","episodes":[{"air_date":"2013-10-10","episode_number":1,"episode_type":"standard","id":858111,"name":"Inverloch Sand Dune House","overview":"After eight years of planning, Melbourne couple Glenn and Kate Morris are finally making a start on their striking, sustainable ‘sand dune’ house near Inverloch on Victoria’s Gippsland coastline. For them, this crescent shaped, spaceship-like design is the ultimate response to a wind swept location. Once building gets underway, the couple need even more patience as attention to detail is paramount in this curvaceous new building. Lets hope it lives up to their high expectations.","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-17","episode_number":2,"episode_type":"standard","id":858112,"name":"South Melbourne Brick","overview":"Greg, a former bricklayer is passionate about two things – his family (partner Emma & their 4 yr old son Archie), and...bricks. As a testament to his love for both, he’s building (literally with his own hands) a tri-level, solid brick contemporary terrace house with a cantilevered pool on the top floor. He’s creating it from the rubble of their well loved old house located on a narrow corner block in Sth Melbourne – all that will remain of the original building is its classic Victorian facade. Greg has dreamt of building this home for years and is certain the time is right, even though it means sharing the place with the in-laws.","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-24","episode_number":3,"episode_type":"standard","id":858109,"name":"Torrens Park Modern Mansion","overview":"Hoteliers Richard and Denise have knocked down the family home in the Adelaide Hills and are re-building an even bigger version, despite the fact their kids are grown. This modern mansion will have all the bells and whistles, amid resort like luxury on 3 tiered acres overlooking Adelaide. But is this unpretentious, likeable couple creating a home or a hotel for themselves? Money may be no object but have they taken on too much?","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-31","episode_number":4,"episode_type":"standard","id":858110,"name":"Hornsby Heights Adobe","overview":"Ardent collectors Kerry and Judy have a passion for Sante-fe style, mud houses even though they live on a sloping bush block on Sydney’s north shore. Inspired by an unconventional builder who changes his mind (and their design) on a regular basis, they set out to create a home out of recycled timber and corrugated iron, rendered in clay dug up from the side of the road. It may be straight out of the American mid west but this hybrid home will have a distinctly Australian flavour and provide an earthy backdrop for their many artistic objects, artifacts and collectables.","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-07","episode_number":5,"episode_type":"standard","id":967555,"name":"Richmond Inner City","overview":"Darren and Ruth Rogers have almost polar opposite views about what their new house should be. Darren wants all the bells and whistles – home cinema, wine cellar, even a lift. Ruth wants chickens, a vegetable garden and a hills hoist. Finding a design that will satisfy both of them and their young son Raymond, is their shared aim.","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-14","episode_number":6,"episode_type":"standard","id":967556,"name":"Forest Lodge Eco House","overview":"Chris and wife Belinda bought the small ‘car park’ of land next door to their existing house, just 3.9 metres wide: literally a tiny gap in a long row of heritage listed cottages in Sydney’s inner west Forest Lodge. Their plan is to squeeze every centimeter of land into a uniquely sustainable house.","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-21","episode_number":7,"episode_type":"standard","id":967557,"name":"Ilford Sheep Station","overview":"Thirteen years ago Meredith and Matt Bayfield needed an escape from their busy lives as doctors in Sydney so they purchased a working sheep property at Ilford in the central table lands of NSW.","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-28","episode_number":8,"episode_type":"standard","id":967558,"name":"Hunters Hill Textural","overview":"Daniela Turrin, Niran Peiris and their son Calum are doing something no-one in their historic street in the prestigious Sydney suburb of Hunters Hill has done before. They’re knocking down their old house to build a smaller one. But these are people who believe that the family that spends time together stays together – a premise that forms the core of the design of their new home.","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-05","episode_number":9,"episode_type":"standard","id":969279,"name":"King Island Whale Tail","overview":"Anchored in the middle of Bass Strait and subject to the ferocious winds of the Roaring Forties, King Island is about as far from the tropics as you can get in Australia. Yet artists Di and Andrew Blake have decided to build a house there after almost twenty years of living in far East Arnhem Land….2 locations literally at either end of the country.","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-12","episode_number":10,"episode_type":"finale","id":969280,"name":"Dynyrnne Curved","overview":"Self confessed hippies Cole and Jane Bradshaw bought a thin sliver of land on an exceptionally steep site only a landscaper could love, in the hilly suburb of Dynnyrne in Hobart... a place they chose as much for the tight knit community it sits in, as for the location itself.","production_code":"","runtime":50,"season_number":4,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":49730,"poster_path":"/tJwS5jplz8A8iROODXbCGOVuQUv.jpg","season_number":4,"vote_average":0},"5":{"_id":"5881bf1992514130310092c5","air_date":"2014-10-09","episodes":[{"air_date":"2014-10-09","episode_number":1,"episode_type":"standard","id":1258594,"name":"The Graceville Container House","overview":"An experimental three storey house made entirely from 31 new shipping containers.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-16","episode_number":2,"episode_type":"standard","id":1287949,"name":"Mt. Eliza Modern","overview":"The single longest build in Grand Designs Australia's history. This 6 year build was all about getting their dream house absolutely perfect.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-23","episode_number":3,"episode_type":"standard","id":1287950,"name":"Claremont Origami","overview":"An architect, Ariane Prevost, at the peak of her career, puts it aside to design and build a house for herself and her husband Neil.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-30","episode_number":4,"episode_type":"standard","id":1287951,"name":"Foxground Pavilion","overview":"After 30 years as a civil engineer, Joe Cato sells his building business to spend more time with his kids and build a new house. This house will be completed entirely by rammed earth construction.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-06","episode_number":5,"episode_type":"standard","id":1287952,"name":"Port Melbourne Urban Green","overview":"Some people have the ability to see beyond the function of an object - to see it as a work of art……and it’s that premise that’s driven Melbourne doctors, Ian and Ann Howard, to create a home like no other. Their plan is to build a 3 storey house clad entirely with water tanks – massive 2 metre high ‘H’ shaped black plastic beasts that will form the skin of their new house.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-13","episode_number":6,"episode_type":"standard","id":1287953,"name":"Toowoomba English Farmhouse","overview":"After years working abroad, Sarah and English born husband Alistair Brodie-Fraser decided to relocate back to Sarah’s home town of Toowoomba in Queensland. This time the move will be permanent – close to Sarah’s extended family. But with Sarah’s father being German, her mother Scottish and Alistair’s connection with the UK, memories of Europe were bound to have some influence in the design of their new house.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-20","episode_number":7,"episode_type":"standard","id":1287954,"name":"Williamstown Bluestone","overview":"When Jason Bretell and Jennifer Pancari first set eyes on a dilapidated old bluestone cottage in the Melbourne bayside suburb of Williamstown, it was love at first sight. The 150-year-old derelict structure was left almost frozen in time with decaying tools, utensils, and other remnants amongst the ruins – bits and pieces Jason and Jen hope to salvage as they bring the cottage back to life.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-27","episode_number":8,"episode_type":"standard","id":1287955,"name":"Brookfield Spotted Gum","overview":"The brief to their architect was simple. A home that not only makes the very best of its location, but is truly unique. In short, as different as possible from the traditional ranch style and Queenslander neighbours.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-04","episode_number":9,"episode_type":"standard","id":1287957,"name":"Pipers Creek Strawbale House","overview":"Like many people, Dean and Sherril Lamb yearn for a simpler existence, for them and their three children. But unlike most people, they’re actually going to try to make it happen. They’ve sold their successful fruit shop and home in Warragul and bought 40 acres in Pipers Creek in country Victoria; all in the pursuit of total self sufficiency.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-11","episode_number":10,"episode_type":"finale","id":1287958,"name":"Faraday Aussie Bush House","overview":"Before Matt McLelland’s wife Anne died six years ago, they’d been looking for a rural property to build on - a place to call home for them and for their four adult children to come to visit. So when Matt stumbled across 40 acres in central Victoria with spectacular views to Mt Alexander’s granite hill side, he knew he’d found the spot.","production_code":"","runtime":50,"season_number":5,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":84149,"poster_path":"/1v6BCeJ36fm6Gm6iNmuQzXBYbPk.jpg","season_number":5,"vote_average":0},"6":{"_id":"5881bf1c925141302e00968b","air_date":"2015-06-04","episodes":[{"air_date":"2015-06-04","episode_number":1,"episode_type":"standard","id":1258595,"name":"Yackandandah","overview":"A sculptor and his architect brother are building a contemporary home on the edge of an escarpment using handcrafted materials inspired by their adjacent historic sawmill studio.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-11","episode_number":2,"episode_type":"standard","id":1287959,"name":"Harcourt","overview":"Art and Troy are swapping out their life running a grand old Bendigo bed and breakfast for a bold new and dramatically modern enterprise.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-18","episode_number":3,"episode_type":"standard","id":1287960,"name":"Kinglake","overview":"A couple who are building a fire proof, sustainable, non toxic house at Kinglake, an hour out of Melbourne.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-05","episode_number":4,"episode_type":"standard","id":1287961,"name":"East Melbourne, VIC","overview":"Ralph Alphonso has grand plans for his 5mx4m inner city design. It will be a massive challenge on a small scale, and Ralph is adamant this eco-friendly build will not sacrifice style or luxury at the cost of the world around him.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-12","episode_number":5,"episode_type":"standard","id":1287962,"name":"Launceston, TAS","overview":"Seasoned renovators Mark and Karen are taking on the challenge of converting a derelict 1920's electricity substation into a cutting edge home - while preserving its history and integrity.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-19","episode_number":6,"episode_type":"standard","id":1287963,"name":"Kuitpo, SA","overview":"Nick and Kate take inspiration from their vineyard location for the first build. Their architect designed home in the shape of a leaf, with a spine stone wall running through the middle and comes with a singing studio.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-26","episode_number":7,"episode_type":"standard","id":1287964,"name":"North Balgowlah, NSW","overview":"An abiding love of all things 1950’s, especially American design, architecture and art has been a life-long pursuit for dedicated collectors Warwick Noble and Melanie Hughes. If it’s from the 50’s, they collect it, they wear it…… or they dance to it! They live in an old fibro house built in the 50’s by Mel’s grandfather. But its boxy design has become too tight for them and their two daughters Evie 7 and Lola aged 9, so they’ve made the decision to build from scratch, and fast track to 50’s modern.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-03","episode_number":8,"episode_type":"standard","id":1310806,"name":"Turners Beach Eucalyptus House","overview":"Photographer Nigel is building his first house with wife Nina on a site steeped in bushland that will form his inspiration. He's designing the house around a large Eucalyptus tree that will be the focal point.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-10","episode_number":9,"episode_type":"standard","id":1310807,"name":"Deakin Retro '70s House","overview":"Barbara and Bill love modernist design so they've sought an architect designed 70s style home. Bill has been diagnosed with Parkinson's disease so the home's curved roof line and glass entrance is designed for the future.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-17","episode_number":10,"episode_type":"standard","id":1310809,"name":"Northcote Vinegar Factory","overview":"Owner/Architect Adrian is passionate about sustainable building. He has grand plans for turning his Vinegar Factory inside out by creating a four storey eco-friendly house complete with a series of walled rainforest.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-04-20","episode_number":11,"episode_type":"finale","id":1534470,"name":"Kevin McCloud's Top 10 Grand Designs Australia","overview":"Set in historic Homewood House in Surrey, England, Grand Designs Australia host Peter Maddison and Grand Designs host Kevin McCloud sit down with a cup of tea and an old fashioned slide slow to reminisce about the design features of each of the ten homes, selected from the past six seasons. The design gurus talk cladding, tiles and form, and with whiskey in hand, engage in some gentle banter over each other’s take on the architecture of their favourite builds. While the special looks over the past, it also serves as a teaser for the upcoming seventh season.","production_code":"","runtime":50,"season_number":6,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":84150,"poster_path":"/3GWcp7lkg0l8PtmplZhXmDI6OAd.jpg","season_number":6,"vote_average":0},"7":{"_id":"5906f72f92514169e102ccda","air_date":"2017-04-27","episodes":[{"air_date":"2017-04-27","episode_number":1,"episode_type":"standard","id":1310812,"name":"North Bondi Urban Cliff, NSW","overview":"Brendan and Penelope dream of a multi-tiered, multi-million dollar home, complete with infinity pool on the side of a cliff in Bondi. But when they constantly change plans, will it ever be finished?","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-05-04","episode_number":2,"episode_type":"standard","id":1310814,"name":"Maianbar Cross Laminated Timber, NSW","overview":"Sydney couple Phil and Ariana want an adventurous house, something cutting edge that hasn't been done before. This special house will cantilever out from their block and overlook the water at Maianbar.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-05-11","episode_number":3,"episode_type":"standard","id":1310815,"name":"Verrierdale Tent House, QLD","overview":"Inland from Noosa in a lush tropical landscape sits Nick and Nicole's sail house. They have a daring design which they hope will look like a yacht moored on dry land and provide them with a true adventure in paradise.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-05-18","episode_number":4,"episode_type":"standard","id":1310816,"name":"Hillbank Medieval, SA","overview":"Anglican Reverends Neil and Ruth have long harboured a desire to build their own home in the style of a Tudor farm house featuring timber boards and a church-like interior of hand-crafted exposed structural beams.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-05-25","episode_number":5,"episode_type":"standard","id":1310817,"name":"Ocean Shores Chipboard, NSW","overview":"GP Zewlan and her electrician husband Tom, want an architect designed home in a great location on shoestring budget. Working within a tenuous loan framework, what they create is inspiring.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-01","episode_number":6,"episode_type":"standard","id":1310818,"name":"Kensington Curvy, VIC","overview":"Architect Tim Hill has made his name designing small, radically shaped, timber houses. Now it's time for Tim's family to up-size to a new house that will be curvaceously shaped like a foot.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-08","episode_number":7,"episode_type":"standard","id":1370227,"name":"Aldinga Beach Dune, SA","overview":"Set on a small block overlooking the Southern Ocean, this three-pod home straddles a pair of four-meter high sand dunes on the protected Aldinga Scrub conservation area on the South Australian coast.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-15","episode_number":8,"episode_type":"standard","id":1370228,"name":"Stirling Glass Stone House, SA","overview":"Six years ago Louise and Steve bought two acres of a rambling English garden in the Adelaide hills. Using the local stone their dream home will be a rustic two storey stone farm house with a modern twist.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-22","episode_number":9,"episode_type":"standard","id":1370229,"name":"Hamilton Japanese Queenslander, QLD","overview":"Steve Minon has a fascination for things Japanese. He fell in love with the work of an iconic Japanese architect Yo Shimada, who he contacted to design a house for him.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-11","episode_number":10,"episode_type":"standard","id":2756524,"name":"Daylesford Long House, VIC","overview":"Brisbane based architects Donovan Hill, helped Trace and Ronnen create the most original grand design, incorporating a giant greenhouse that encloses a house, garden, stables and animal pens.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-18","episode_number":11,"episode_type":"standard","id":2756525,"name":"Tallebudgera Valley Queenslander, QLD","overview":"Doug and Yvette have lived on their idyllic 10 acre property in the Gold Coast for the last two years. On a whim they bought a 100 year old house, that will now make the 130km journey to its new home on the back of a truck.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-25","episode_number":12,"episode_type":"standard","id":2756526,"name":"French Island Barge, VIC","overview":"With his own machinery and help from family and friends, Mike plans to build a large spotted gum clad home, in an off grid, koala filled paradise. However, he faces the challenge of transporting the materials via barge.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-02-01","episode_number":13,"episode_type":"standard","id":2756527,"name":"Stanley Windmill, TAS","overview":"Phillip lives in a quirky cluster of buildings -a shed and a heritage listed windmill. With the help of his architect friend Greg, they will link the historic structures into a contemporary, cohesive whole.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-02-08","episode_number":14,"episode_type":"finale","id":2756528,"name":"Coombs Curtain Wall House, ACT","overview":"When it comes to his family home, IT engineer Damien wants it filled with every hi tech feature. Computer controlled blinds, a two storey spiral glass staircase, and a custom air powered laundry chute.","production_code":"","runtime":50,"season_number":7,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":87932,"poster_path":"/aeQzg4GCWZDu4lcTeilRXMc6qm0.jpg","season_number":7,"vote_average":0},"8":{"_id":"5d481250a0be28081ea33697","air_date":"2019-07-17","episodes":[{"air_date":"2019-07-17","episode_number":1,"episode_type":"standard","id":1873745,"name":"Euroa, VIC","overview":"In the bush ranger territory of the Strathbogie Ranges, Eddie and Dot dream of a home with a magnificent 360 degree view. Can they work around the huge granite boulders to achieve their dream?","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/xBEkhnU8h1e7aHVzdl56WYXA6tZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-07-24","episode_number":2,"episode_type":"standard","id":1873746,"name":"Elsternwick, VIC","overview":"Lori and Morgan are building a funky modern house on a tight suburban site. This family home will have a lot of fun elements including a trapeze net, car parking stacker and a paper plane garden sculpture.","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/oKAx3bNcx8o4lvuEUHtQLdXqNrw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-07-31","episode_number":3,"episode_type":"standard","id":1873747,"name":"Curl Curl, NSW","overview":"Stephen has spent the last15 years at the helm of his own construction company building homes for other people. Now with his first child on the way, he's finally building his own, and the plan is to make it grand.","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/ad1pzWRbsVvSG4JHwKQ34wB2KzI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-07","episode_number":4,"episode_type":"standard","id":1873748,"name":"Lockleys, SA","overview":"Tony and Tania want a million dollar house on a $400,000 budget. Working off handshake deals with the architect and builder, will their dream home be finished?","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/9QmZt6gn697HsPUxQQOVuJ8Nxaq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-14","episode_number":5,"episode_type":"standard","id":1873749,"name":"Lewisham, TAS","overview":"Alice is a long term fan of the small house movement and on a sloping site facing the Southern Ocean. She's creating a petite 40 square metre pod, offering all she needs and nothing more.","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/mvgAXNSnZ2rg0epgNmzEkFiNYBd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-21","episode_number":6,"episode_type":"standard","id":1873750,"name":"Toolangi, VIC","overview":"Tabitha and Chris always dreamt of living in the forest. They bought 120 acres of rainforest in Toolangi and are building a farmhouse that will be a sustainable, economical, fire-proof and completely off grid.","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/g7ZraU7yydLIqLgVvvhV9B6UXh6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-28","episode_number":7,"episode_type":"standard","id":1873757,"name":"Rivett, ACT","overview":"Peter is building an underground eco bunker that's self-sufficient, sleek and completely one of a kind. From the outside it will eventually look like a bush garden, but below ground, a man cave.","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/8yo5yhXzCQOXGo1eeK2atB277Xo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-04","episode_number":8,"episode_type":"standard","id":1920663,"name":"Suffolk Park, NSW","overview":"Mike and Megan, a passionate pair of creatives are attempting to build a modernist house on a modest footprint. Mike designed the house himself to include only what they need, and only what they use.","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/tOnqgZ15YKXZtSNAMQgjTd3cPsm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-11","episode_number":9,"episode_type":"standard","id":1920664,"name":"Mt Tamborine, QLD","overview":"David and Sarah are in love with Mt Tamborine, the place they were married 22 years ago. They're now about to build a long-awaited home-away-from-home there, on lush mountain acreage boasting a rainforest and creek.","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/fVMKY5pKsdOkO8X5JaymUPPKB6C.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-18","episode_number":10,"episode_type":"finale","id":1920665,"name":"Dee Why, NSW","overview":"Barbara and Craig have built two companies from the ground up, so when they decided to embark on their dream home, it wasn't surprising they threw out the rule book and decided to do it their way, with a building system that's untested.","production_code":"","runtime":50,"season_number":8,"show_id":38245,"still_path":"/kSHBYtlUvm43lhcz42TXuPDkWIT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"","id":128983,"poster_path":"/7Ey7ZyzP56zmL0mP0WEEfQtQztb.jpg","season_number":8,"vote_average":0},"9":{"_id":"6065a7b1d13324006d3809f1","air_date":"2021-03-31","episodes":[{"air_date":"2021-03-31","episode_number":1,"episode_type":"standard","id":2843484,"name":"Mystery Bay, NSW","overview":"When Rob and Sally buy land for their new home, they are faced with endless challenges. The build must withstand the elements, celebrate the amazing views and blend effortlessly into the surroundings. Is it possible?","production_code":"","runtime":50,"season_number":9,"show_id":38245,"still_path":"/xhNPOKKQJfFxKSbDsyzXceKF4gI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-07","episode_number":2,"episode_type":"standard","id":2843485,"name":"Hawthorn, VIC","overview":"David and Jenny have a dream to live in a super-modern terrace house in a traditional suburb. But their daring plan to create a three-storey home really pushes stress levels and finances to the limit.","production_code":"","runtime":50,"season_number":9,"show_id":38245,"still_path":"/3aj30GtdhwcFRnTvvNtd5Qugu2z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-14","episode_number":3,"episode_type":"standard","id":2843486,"name":"Tamar, TAS","overview":"Matt and Eloise leave Melbourne for Tasmania. But the budget for their build means Matt has to do most of the work himself. An injury, pregnancy and a giant Great Dane puppy all add to the chaos!","production_code":"","runtime":50,"season_number":9,"show_id":38245,"still_path":"/4dn7jnjm79gx1B41b4ksi38sXlO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-21","episode_number":4,"episode_type":"standard","id":2843487,"name":"North Perth, WA","overview":"Perth couple Angelo and Kasi love the bulky concrete buildings from the 1950s. But when they see the plans for their new family home, there are a few surprises. Will they embrace the unique design?","production_code":"","runtime":50,"season_number":9,"show_id":38245,"still_path":"/euDQ6L8nkSBJtb0Uik96C8dIiMT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-28","episode_number":5,"episode_type":"standard","id":2843488,"name":"Hawkesbury, NSW","overview":"Simon and Lauren want to convert a tiny 150-year-old church into their family home. This means honouring the history of the church while creating a modern house – will they succeed?","production_code":"","runtime":50,"season_number":9,"show_id":38245,"still_path":"/t9yiSwA8iKgyCMR7FmEIGWkhoKp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-05","episode_number":6,"episode_type":"standard","id":2843493,"name":"Greenwich, NSW","overview":"Dion and Turi have big plans but a limited budget when they build a new, harbourside home. As the daring build, with a lap pool running through it, becomes all-consuming, there are doubts they will finish.","production_code":"","runtime":50,"season_number":9,"show_id":38245,"still_path":"/i0zBsqTUVWehaKLasYms9wnvGOF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-12","episode_number":7,"episode_type":"standard","id":2843497,"name":"Ascot, QLD","overview":"Joe and Hayley design high-end homes for others, but this is their chance to build their own. The curved, bold design includes a monumental staircase and a full-sized tennis court – but is it too ambitious?","production_code":"","runtime":50,"season_number":9,"show_id":38245,"still_path":"/1Mc83nbl4rA42EXAKNd1ti6uTla.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-19","episode_number":8,"episode_type":"finale","id":2843499,"name":"Coburg, VIC","overview":"Marc and Felicity have dreams of building a non-toxic, passive home and after years of work, the unthinkable happens – a fire sweeps through their beloved home just as they are about to move in. Will their dreams be shattered forever?","production_code":"","runtime":50,"season_number":9,"show_id":38245,"still_path":"/VOmSLAfcseQ7GD6jyr2kf3GVas.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"","id":188766,"poster_path":"/rnxMX6D2Hk5APxvMw2NLqBC686T.jpg","season_number":9,"vote_average":0},"10":{"_id":"62525b1b5a07f50f49dddd26","air_date":"2022-05-05","episodes":[{"air_date":"2022-05-05","episode_number":1,"episode_type":"standard","id":3655999,"name":"Goobarragandra, NSW","overview":"Trevor and Jeanette are looking to build a very special home close to nature in which Trevor can move about easily in his wheelchair. When a 15 acre block with river frontage comes on the market, they pounce.","production_code":"","runtime":50,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-12","episode_number":2,"episode_type":"standard","id":3692200,"name":"Inverloch, VIC","overview":"After a fire destroyed the much-loved homestead on Alistair and Belinda's dairy farm, they embark on a bold new project to create a comfortable home that looks like a dairy shed, complete with silos for bedrooms.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-19","episode_number":3,"episode_type":"standard","id":3712710,"name":"Carlton, VIC","overview":"Building a big house in inner-city Melbourne is a tricky business. But architect Annalise and project manager Kim have a plan to turn their 1850s terrace into a multi-storied modern home with a triple car-stacker.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-05-26","episode_number":4,"episode_type":"standard","id":3719142,"name":"Coffee Camp, NSW","overview":"Gary and Clare left the hustle and bustle of Sydney for a more peaceful pace with plans of building a spaceship-like domed house, reminiscent of the beautiful vaulted structures seen in Europe.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-02","episode_number":5,"episode_type":"standard","id":3730678,"name":"Chain of Lagoons, TAS","overview":"Lynne and Paul have found a beautiful stretch of coastal wilderness with panoramic views over the Tasman Sea. With plans to build a huge modern home, Paul will project manage while living on site.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":"/okV2BYu4VV2ifAdMXM95SDvzEqB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-09","episode_number":6,"episode_type":"standard","id":3744129,"name":"Clunes, NSW","overview":"Retirees and childhood sweethearts Liz and Warren have taken on a hundred-acre Macadamia farm in the Byron Bay hinterland, with grand plans to build an epic five-bedroom, Mediterranean-style villa-cum-castle.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":"/lSzKbEc9lijIvMJ0DOzYj14xC03.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-16","episode_number":7,"episode_type":"standard","id":3758399,"name":"Bullsbrook, WA","overview":"Tani and Tim have plans to build a medieval 'earth castle' on their 60 acre property. Built into the sides of a man-made dam, there are plans for a drawbridge, turret, underground tunnels and even a moat.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":"/mNTXq6Z6sD0rSjk9vByV8NiriEB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-06-23","episode_number":8,"episode_type":"standard","id":3771849,"name":"North Melbourne, VIC","overview":"Architect Ben and artist Tania decide to get creative with a tiny discarded scrap of land in one of North Melbourne's grittier back lanes. Can their grand dreams materialise from their not-so-grand budget?","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":"/aS6p82z60rerEVlltuBRNkbtqhY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-01-25","episode_number":9,"episode_type":"standard","id":4238841,"name":"Whittlesea 'Earth', VIC","overview":"Bel and John are building an underground house on 25 acres at Whittlesea, Victoria. An area known for bushfires, Bel and John want to ensure their property is fire proof.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-02-01","episode_number":10,"episode_type":"standard","id":4238849,"name":"Torquay 'Raw Concrete', VIC","overview":"Fiona and Sal attempt to find a middle ground with their build, with Sal deciding the location and Fiona choosing the design.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-02-08","episode_number":11,"episode_type":"standard","id":4238850,"name":"Newtown 'Hat Factory', NSW","overview":"Anita and Kris Martincic dreamt of living in the city, so when a 100 year old derelict building came on the market, they jumped at the chance.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-02-15","episode_number":12,"episode_type":"standard","id":4238851,"name":"Clarence 'Container House', NSW","overview":"After buying a block of land in Clarence, Dennis and Karen try to build a house that can withstand bushfires out of seven shipping containers.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-02-22","episode_number":13,"episode_type":"standard","id":4238853,"name":"Carrickalinga 'Shed', SA","overview":"Catherine and Mick purchase 50 acres in the rolling hills of South Australia's Fleurieu Peninsula and begin building a remarkable structure that looks more like a corrugated iron shed than a house.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-01","episode_number":14,"episode_type":"standard","id":4241455,"name":"Norwood 'Gold', SA","overview":"For Dr Shiva Gunapu and his psychologist wife Rima, incorporating the rich colours of their Indian heritage is an essential element for their new home.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-08","episode_number":15,"episode_type":"standard","id":4251652,"name":"Dooralong 'Elemental', NSW","overview":"Electrician Mick takes on the challenge of a lifetime when he and artist wife Belynda decide to build their dream modernist home in the bucolic Dooralong Valley, on the NSW Central Coast.","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2023-03-09","episode_number":16,"episode_type":"finale","id":4443339,"name":"Coober Pedy 'Dug Out', SA","overview":"","production_code":"","runtime":null,"season_number":10,"show_id":38245,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"","id":287089,"poster_path":"/3EJ0K5HVPpXX35nscvvJblJ7M7U.jpg","season_number":10,"vote_average":0}}}