{"adult":false,"backdrop_path":null,"created_by":[{"id":1736978,"credit_id":"5b11791d9251415ef80140d2","name":"Angela Clarke","gender":1,"profile_path":"/uQcNi2ib2IOvEjaQ41WzTdjLPQM.jpg"}],"episode_run_time":[30],"first_air_date":"2003-08-15","genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":3834,"in_production":false,"languages":["en"],"last_air_date":"2004-12-27","last_episode_to_air":{"id":267751,"name":"Christmas","overview":"Ray's scrooge-like approach to Christmas changes dramatically when he receives a bit of good news, but the staff have their own problems to deal with.    Martin's mother, Sandy's pen-pal and Mary's family all put obstacles in the way of a happy festive season, while Ray has to make a life-changing decision.","vote_average":0,"vote_count":0,"air_date":"2004-12-27","episode_number":7,"episode_type":"finale","production_code":"","runtime":30,"season_number":2,"show_id":3834,"still_path":null},"name":"Eyes Down","next_episode_to_air":null,"networks":[{"id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","name":"BBC One","origin_country":"GB"}],"number_of_episodes":15,"number_of_seasons":2,"origin_country":["GB"],"original_language":"en","original_name":"Eyes Down","overview":"Eyes Down is a comedy starring Paul O'Grady as Ray Temple, the manager of a bingo hall in Liverpool, England called The Rio, although the series was filmed in Rayners Lane in London. Although it had moderate ratings, the programme only lasted for two series until it was cancelled by the BBC in 2004. The show was written by Angela Clarke and directed by Christine Gernon.","popularity":1.338,"poster_path":"/zqpgtbHA6GGL2XJOjeYZG7ajnZn.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2003-08-15","episode_count":8,"id":11477,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2004-09-03","episode_count":7,"id":11478,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5.8,"vote_count":4,"season_data":{"1":{"_id":"5257578819c29531db14fe29","air_date":"2003-08-15","episodes":[{"air_date":"2003-08-15","episode_number":1,"episode_type":"standard","id":267736,"name":"Holiday Rota","overview":"Ray is trying to sort out the holiday rota. You'd think it would be easy, but not with this staff.\n\nSandy is in the middle of a crisis: she and boyfriend Terry have just been to the hospital for her first scan, but there was one thing she'd overlooked - she hadn't told Terry she was actually pregnant. And now he's having serious doubts.\n\nMeanwhile Martin is trying to pluck up the courage to tell Christine his feelings for her. If only he could go on holiday with her to Rhyl.\n\nAnd Bobby could be in big trouble: Pamela's been doing wheelies with him all night. Her husband knows she's been entertaining someone from the Bingo Hall, and he wants to know who.","production_code":"","runtime":30,"season_number":1,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2003-08-22","episode_number":2,"episode_type":"standard","id":267738,"name":"Indecency","overview":"Ray will not tolerate his staff consorting with the punters so he's determined to photograph Bobby at it with Pamela.\n\nUnfortunately he photographs the wrong person, is accused of indecency and has to ask the staff to be character witnesses for him. If only someone actually liked him.\n\nMartin decides to impress Christine by trying to look like her favourite pop star and Sandy enlists Mary's help in practising for a water birth.\n\nMary's knows all about these things. Her eldest, Bridie, had a water birth - on the log flume at Chessington World of Adventures.","production_code":"","runtime":30,"season_number":1,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-29","episode_number":3,"episode_type":"standard","id":267741,"name":"Stars In Their Eyes","overview":"Ray has to give the punters his \"\"Tony Christie\"\" during the interval when the PA system breaks down. A talent scout for Stars in Their Eyes hears him and offers him a spot. Could this be Ray's chance to escape?\n\nBobby sets Martin up with a date in order to make Christine jealous. Unfortunately, the date, Jean, turns out to be in her early sixties, with a face like a prune. She also thinks \"\"I've got no knickers on\"\" is an attractive chat-up line.\n\nSandy is thinking of becoming Catholic so her unborn baby will be able to go to the local Catholic school - \"\"it's slap bang in the middle of the Tanning shop and the bookies, so it's dead handy for Terry and me.\"\"","production_code":"","runtime":30,"season_number":1,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2003-09-05","episode_number":4,"episode_type":"standard","id":267737,"name":"First Aid","overview":"An elderly punter dies while Ray is calling the numbers. The other punters are upset, especially when he suggests a halt in play while the body is removed.\n\nRay is now worried that the staff know nothing about first aid.\n\nAnd he's even more worried when the local Mr Big brings his dear old mum to Bingo and says if anything happens to her Ray will be taking a ferry across the Mersey but only making it half way before he's dropped off.\n\nMeanwhile, tragedy hits Bobby - he can't get a woman to sleep with him and goes an entire night without sex. Has he lost it? He goes into a serious depression.\n\nMartin takes up magic in his latest bid to impress Christine.","production_code":"","runtime":30,"season_number":1,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2003-09-12","episode_number":5,"episode_type":"standard","id":267735,"name":"Face Peel","overview":"Ray meets a contemporary from school who looks much younger than him - \"\"I've had a face peel. You can get some great bargains. My wife's just had her tits done half price. Buy one, get one free\"\".\n\nRay decides to have a face peel with disastrous results - \"\"I've just paid a fortune on me face for it to pass for Phil Mitchell's arse. Collette Smith's just said I put her in mind of her sister. The one who's allergic to the 21st century. She's in a bubble. They have to roll her to the shops.\"\"\n\nEventually he is unable to call the numbers, so Bobby steps into the breach and becomes an overnight hit.\n\nChristine is burgled and decides to go and live with her sister in Clacton. Has Martin left it too late to proclaim his love?\n\nSandy and Terry go and see an actual birth and come back shell-shocked. The only births they'd ever seen were on EastEnders and they were over in a matter of minutes! Can Mary reassure them that all will be well?","production_code":"","runtime":30,"season_number":1,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2003-09-19","episode_number":6,"episode_type":"standard","id":267734,"name":"The Clairvoyant","overview":"Ray hires a clairvoyant to provide the interval entertainment and she then predicts their futures.\n\nShe tells Bobby his one true love will return - and lo and behold he gets a phone call from \"\"the girl that got away\"\", the girl who left him when he was 17.\n\nThis clairvoyant knows what she's talking about. She also tells Christine she will fall in love with another dog owner. So Martin buys a dog.\n\nFinally she has a prediction for Ray - \"\"Mmm. I don't really like to say things like this Ray, but I can't see a future past seven o'clock tomorrow night. Now, where's me handbag? I've got a train to catch.\"\"\n\nAnd she goes, leaving Ray in a total state, convinced he's going to die the following evening.\n\nMeanwhile, Sandy is also depressed. She and Terry haven't made love for over five months because she's worried it might upset baby - \"\"I don't want Terry going near the baby chute\"\".\n\nOnce Mary reassures her that making love is okay when you're pregnant she and Terry are at it like rabbits.\n\nWill Bobby's","production_code":"","runtime":30,"season_number":1,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2003-09-26","episode_number":7,"episode_type":"standard","id":267743,"name":"Christine's Birthday","overview":"Ray has applied for the Regional Manager's job. But the boss of the Rio chain is very keen on family values and wants to meet Ray and his wife.\n\nCan Ray find a wife? And can he possibly ensure that it isn't Mary?\n\nMeanwhile it is Christine's birthday. At her party she confesses to Bobby that she's feeling sad and lonely and that life has passed her by.\n\nBobby tells her how Martin feels about her, but she says she doesn't want Martin, she wants excitement. So Bobby gives her some excitement in the gents, where Martin discovers them.\n\nBobby has also provided some entertainment for the party: Darth Vader, the worst strippogram in the world. And there's a shock for someone when Darth is unmasked.","production_code":"","runtime":30,"season_number":1,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2003-10-03","episode_number":8,"episode_type":"finale","id":267739,"name":"Charity","overview":"Ray is determined to get himself some good publicity as a charitable do-gooder.\n\nSo he makes out that Mary is ill and then raises funds to send her to Lourdes so she can come back cured. Unfortunately, she comes back with a criminal record.\n\nMartin is still smarting over Christine and Bobby. And now Christine thinks she might be pregnant. Will Bobby stand by her? Or will Martin?\n\nRelationships are at breaking point. And then something else breaks - Sandy's waters.","production_code":"","runtime":30,"season_number":1,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":11477,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5257578819c29531db14fe34","air_date":"2004-09-03","episodes":[{"air_date":"2004-09-03","episode_number":1,"episode_type":"standard","id":267746,"name":"Next Big Thing","overview":"Ray's excited about his latest money making scheme, a guess the balls competition, but he's convinced none of the punters will guess correctly. However Mary see's it to go differently.\n\nMeanwhile, Sandy believes she's the next big thing when a shopping precinct photographer convinces her she has \"\"it\"\". Though Ray has his doubts about the photographers credibility.","production_code":"","runtime":30,"season_number":2,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5257578919c29531db14ff20","adult":false,"gender":2,"id":110367,"known_for_department":"Acting","name":"Neil Fitzmaurice","original_name":"Neil Fitzmaurice","popularity":2.017,"profile_path":"/rbRgevu1cMOihbm1jsbbIDsvEy9.jpg"},{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2004-09-10","episode_number":2,"episode_type":"standard","id":267744,"name":"Baby","overview":"Sandy's having problems as a first time mother, resorting to  sleeping in her locker due to late nights with the baby. A trip to the doctors office helps ease her worries, but further problems arise when Mary discovers it's a different baby.\n\nRay's over the moon when he finds out he's been left £5,000 from a deceased punter, but with one simple clause; the deceased man's widow requests him to give it to a local charity. But Ray doesn't agree for it to go that way. A little word from Christine shows him the error of his ways, until he discovers the money is counterfeit.","production_code":"","runtime":30,"season_number":2,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2004-09-17","episode_number":3,"episode_type":"standard","id":267747,"name":"Thief","overview":"Following a memo from headquarters, Ray implements a new security regime after a spate of recent robberies. A further robbery leads to Ray giving chase down the back alley to stop the thief, which leaves him to fend him off with a Barbie doll. Ray thinks it's lights out for him, until out of nowhere Mary knocks the thief to the ground. Once the police arrive, Ray takes all the credit. After the press get a hold of the story, Ray is to receive an award for Citizen Of The Year, but Mary refuses to keep quiet.\n\nMeanwhile, Martin asks Christine out on a date, though not a fancy restaurant but the bingo's diner. But Christine's faced with a problem; on the same night, her ex-husband returns and wants her back. Who will she choose?","production_code":"","runtime":30,"season_number":2,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2004-09-24","episode_number":4,"episode_type":"standard","id":267749,"name":"Ambition","overview":"The staff are cautioned to be on their best behaviour for the visit of regional manager, Miss Grimes - an extremely large formidable woman, who's stopping by to inspect the latest developments at the Rio. Ray spots this as his opportunity to get the manager's position at a new London bingo hall, so he's determined things will run smoothly.   Following a mix-up with paperwork, Miss Grimes gets the impression Ray is lusting after her and wants to meet in the cellar! Ray is left with a dilemma: should he meet his match made in hell or tell the truth and loose his chance at the new job?\n\nMartin has tried everything to get over Christine, so he thinks visiting a therapist will help to overcome his feelings. But her ways are a little eccentric, specially since she's a therapist-cum-florist.","production_code":"","runtime":30,"season_number":2,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2004-10-01","episode_number":5,"episode_type":"standard","id":267748,"name":"Adopted","overview":"Ray's devastated following a family funeral, though it's not \"\"the old stiff\"\" he's sad about, but the news that he's adopted. To discover his roots he turns to a little detective work, but his digging around reveals Mary could actually be his Mother - news he is not at all happy about.    However, Mary's motherly love is something he can't resist and she wins him over. But things take an unexpected turn when Christine intercepts a further call from the orphanage - it seems the baby Mary actually gave birth to was a girl. How will Mary break the news to Ray that they're not actually related?\n\nSandy's elated to discover she's won a competition to appear on a couples game show, but the only problem is that she's now single. Bobby saves the day and stands in as her boyfriend, so they prepare each other for the typically expected couple type questions. Luck is on their side, but with a little magic they both didn't expect.","production_code":"","runtime":30,"season_number":2,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2004-10-08","episode_number":6,"episode_type":"standard","id":267750,"name":"Wedding","overview":"It's the big day: Christine is set to re-marry her ex-husband, but she's completely oblivious to it. After a botched proposal from Philip, she's overjoyed to accept his hand in marriage, but she finds Ray's \"\"nice gesture\"\" to hold it in the Bingo Hall a little strange.\n\nIt's full steam ahead with the planning and everyone is happy to help out with the preparations. However Martin's not too keen, he's at a loss as it seems his dreams of true love will be dashed forever.  But a missing dog, a smurf and everyone's hatred of Philip combine to make it a day to remember.","production_code":"","runtime":30,"season_number":2,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5257578819c29531db14fe50","adult":false,"gender":1,"id":1224743,"known_for_department":"Directing","name":"Christine Gernon","original_name":"Christine Gernon","popularity":1.793,"profile_path":"/vfDCWgvPg2U4zHzqlGgeuxkGpiC.jpg"}],"guest_stars":[]},{"air_date":"2004-12-27","episode_number":7,"episode_type":"finale","id":267751,"name":"Christmas","overview":"Ray's scrooge-like approach to Christmas changes dramatically when he receives a bit of good news, but the staff have their own problems to deal with.    Martin's mother, Sandy's pen-pal and Mary's family all put obstacles in the way of a happy festive season, while Ray has to make a life-changing decision.","production_code":"","runtime":30,"season_number":2,"show_id":3834,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":11478,"poster_path":null,"season_number":2,"vote_average":0}}}