{"adult":false,"backdrop_path":"/xqfacS8cSBy0upWiC9uunfnDAxc.jpg","created_by":[{"id":3157386,"credit_id":"64600f07ef8b320138866dd8","name":"Kim Yi-young","gender":1,"profile_path":null}],"episode_run_time":[65],"first_air_date":"2010-03-22","genres":[{"id":18,"name":"Drama"}],"homepage":"http://www.imbc.com/broad/tv/drama/dongyi/","id":38852,"in_production":false,"languages":["ko"],"last_air_date":"2010-10-12","last_episode_to_air":{"id":863459,"name":"A Happy Ending","overview":"Dong Yi leaves the palace and set up her own citizen's advice bureau to help lowborn who have problems with corrupt nobleman. Then, she discovers that the Finance Minister and Police Chief are involved in corruption and they also frame a lowborn for the murder of an official. But, thanks to her investigation, the framed lowborn are released and the corrupt officials are caught. A few years later, the King and Dong Yi are both dead. Dong Yi's son, who becomes the new King of Joseon, visits his mother's grave with Cheon Soo and promises to be a good King.","vote_average":0,"vote_count":0,"air_date":"2010-10-12","episode_number":60,"episode_type":"finale","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/bj7VhBrxxClBlNzuBSjy5jXAhOi.jpg"},"name":"Dong Yi","next_episode_to_air":null,"networks":[{"id":97,"logo_path":"/pOSCKaZhndUFYtxHXjQOV6xJi1s.png","name":"MBC","origin_country":"KR"}],"number_of_episodes":60,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"동이","overview":"Set during the reign of King Sukjong in the Joseon dynasty, the story focuses on Dong Yi, a water maid who gains the trust of Queen Inhyeon and later the favour of the king when he is moved by her prayers for the health of the Queen during the court disputes caused by Jang Hee Bin. Dong Yi becomes a concubine with the rank of sook-bin and bears a son who will later become the 21st king of Joseon, Yeongjo.","popularity":18.012,"poster_path":"/1eqbigfVbbQbjMxfC6CX1OeMxV4.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":null,"episode_count":0,"id":50449,"name":"Specials","overview":"","poster_path":"/sY2dJ1WJ9Vn3F9fRp54kn2yaznS.jpg","season_number":0,"vote_average":0},{"air_date":"2010-03-22","episode_count":60,"id":50448,"name":"Season 1","overview":"","poster_path":"/p2fAMjMXIpTVRyWePLKVYZrBi7A.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.4,"vote_count":27,"season_data":{"1":{"_id":"5258ee0c760ee346618da6d4","air_date":"2010-03-22","episodes":[{"air_date":"2010-03-22","episode_number":1,"episode_type":"standard","id":863400,"name":"The Start of a Tragedy","overview":"The story begins in 1681, 7th year of King Sukjong. Dong Yi lives with her father and brother in a slave village. They are the members of Sword Fraternity, which is the organisation made up of the lowest class people. Then, a high ranking government officer from Southern Faction was assassinated. After that, Dong Yi finds the assassin ID and hand it to the police. But, it belongs to a corrupt policeman who worked for Oh Tae Seok. He is arrested, but gets killed in his prison cell. Dong Yi's father has the information, so Oh Tae Seok's masked man try to kill him but he gets saved by his friend, Cheon Soo. When they get home, Dong Yi is not there.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/PpsMH6M3Kbs7yvPEzPLOZQo5rs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-23","episode_number":2,"episode_type":"standard","id":863401,"name":"The Framing of Sword Fraternity","overview":"Oh Tae Seok wants to frame Sword Fraternity for the murders of Southern Faction and the police officer. Chief Seo asks his father to speak to the king about opening the investigation again. But, King Sukjong is at his father's grave. So, Chief Seo's father goes to visit him there. The Sword Fraternity realise that Oh Tae Seok is planning something. They rush to stop it, but all of them are dead. The corrupt police tries to frame them, but they manage to escape. Meanwhile, Dong Yi finds herself in a noble lady's house. Dong Yi prepares to do the greeting, but her father refuses to let her go. But Dong Yi sneaks away. She has to greet Oh Tae Seok. He then realises who she is and ask his men to kill her. But, Cheun Soo saves her. Then, a member of Sword Fraternity betrays them and leads to the arrest of Dong Yi's father and brother.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/u3MJzhiA0Y5AvkGyiSoRBkVlWgF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-29","episode_number":3,"episode_type":"standard","id":863403,"name":"The Rescue Mission","overview":"Dong Yi's father and brother are taken into custody. Dong Yi is taken to a fortune teller's place. He predicts she will be the leader of Sword Fraternity. Oh Tae Seok announces that Dong Yi's father and brother will be executed the next day. Some evidence has been found in the Sword Fraternity headquarters to prove that they are guilty. Cheun Soo and members of Sword Fraternity make plans to free Dong Yi's father and brother. Dong Yi sees a young aristocrat lady do the same hand signal that the dying official has showed at the riverside. The escape plan works, but they get chased and killed. Dong Yi hears that her father has escaped and runs to find her. But, she only sees corpses and the embroidered purse she has given to her father.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/1lqoMSmN9hagUG6zQl0J93RhO9O.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-03-30","episode_number":4,"episode_type":"standard","id":863402,"name":"The Search for the Truth","overview":"Chief Seo orders the city to be searched for members of Sword Fraternity. Dong Yi is still on the wanted list. So, when she takes her friend, Gae Doo La to the hospital, she is arrested by Chief Seo. Luckily, he lets her go and tells her about the hand signals. Dong Yi asks her brother's friend, Seol Hee to get her into the palace as a servant because she wants to find out what happened to her father. Meanwhile, a girl's body is found and Chief Seo confirms it although it is not her. Dong Yi enters the palace and starts working in the music department. She starts to play a sorrowful tune using a daegeum, which reminds her of her brother and father. Many years later and it's now the 19th year of King Sukjong and Dong Yi is now a young woman.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/pxtFyCOzke1z2wxDQyF0xAN7mEg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-05","episode_number":5,"episode_type":"standard","id":863404,"name":"A Bad Omen","overview":"Six years have gone by and Dong Yi is now a young woman. Then, a meteorite is landed in the palace, a bad omen. Jang Ok Jeong's protesters blame this on her. Furthermore, the Western Faction is stronger than the Southern. Jang Ok Jeong is supported by Southern Faction, but the Western Faction is supported by the Queen Dowager and Oh Tae Seok. They do not like her and plan a 'bad omen'. Later at the banquet, the orchestra can't play in tune and says that it is a bad omen. Dong Yi tries to find the lady with the butterfly accessory. But, she is found loitering around and she is arrested and tied up in a barn with a dead man with the chimes earlier.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/dfdQD4yorrqVRrzwk9EtkhsBerV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-06","episode_number":6,"episode_type":"standard","id":863405,"name":"The Investigation","overview":"Dong Yi manages to escape before she is killed by the bad guy. She finds a policeman but when they go back to the barn, the body is gone. The capital is in turmoil because of the bad omen. The King is determined to find out who is responsible for the musical disaster. But the police and tribunal have come up with nothing. Dong Yi decides to do the investigating herself. She takes evidence dropped by the bad guy and then goes back to the barn, where the King turns up. Then, there's an argument outside the barn and the King bumps into Dong Yi when he hides. They escape together and as the collect more evidence, they get cornered by armed men.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/2cvzhe3GfPnhsqnpACJAqG6Ore6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-12","episode_number":7,"episode_type":"standard","id":863406,"name":"The Plan That Backfired","overview":"The King keeps saying who he is. Luckily, Chief Seo and his men arrive and save the day. The Queen Dowager devastated to know that her plan has been foiled and the King's life is in danger. And he now knows that someone has changed the music chimes with rock salt. Jang Ok Jeong hands the ID of the corrupt policeman to the Queen Dowager. The Queen Dowager is furious and sees this as a threat. Oh Tae Seok's brother, Oh Tae Poong, who is a new director, comes to the music department and his son takes interest in Dong Yi. He wants her to be beaten up when she refuses him. Luckily, Dong Yi is called by Jang Ok Jeong, who wants to meet her.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/mNykWtrxJQvcs9oqm4L9tlFOvBL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-13","episode_number":8,"episode_type":"standard","id":863407,"name":"The Medicine","overview":"Dong Yi wants to take a look at Jang Ok Jeong's personal hanbok accessory as a reward for helping to prove that she is not the cause of the bad omen. Dong Yi is sent to bring medicine into the palace by Jang Ok Jeong's mother. Dong Yi gets back to the palace late and can't sneak in and she is helped to get back into the palace by the King. Jang Ok Jeong refuses to drink the medicine. Then, the word spreads that poisonous herbs have been found in Queen Inhyeon's medicine. Dong Yi goes to pay her respect on the 6th anniversary of her father's and brother's death. On her way back, she gets arrested on suspicion of trying to poison the Queen.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/y9xgxc72wgCmN317UXTcXrIN5ft.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-19","episode_number":9,"episode_type":"standard","id":863408,"name":"The Confession By Jang Ok Jeong","overview":"The pharmacist who gave Dong Yi the herbs has been murdered. Police interviews Dong Yi, but she says that she gets the medicine for a musician and not Jang Ok Jeong. Chief Seo turns up and when he hears her name, he asks if she is Dong Yi that he knew. But, she says no. The ladies who investigate crimes that are committed by the women are very strict. And they have been ordered to investigate Dong Yi for buying the herbs and illegally bringing it into the palace. Torture tools are being prepared because Dong Yi still refuses to say who sent her to buy the herbs. Then, Jang Ok Jeong arrives just in time to confess that she is the one who ordered the herbs.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/veT7jFz0ygN8NVMg9ubSWgeKpqb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-20","episode_number":10,"episode_type":"standard","id":863409,"name":"The Evidence","overview":"Jang Ok Jeong has voluntarily agrees to be investigated. The herbs are found in the Jang Ok Jeong's quarter and she is charged with trying to kill the Queen. But, Dong Yi convinces that Jang Ok Jeong is innocent because the herbs in question are different from the one that she has bought. Then, Oh Tae Seok tries to find a scapegoat to put the blame on and he picks Dong Yi. Meanwhile, Cheun Soo is alive and he gets a job at the city morgue. One night, Dong Yi sneaks into the morgue to check the pharmacist's body for evidence. She finds her evidence and as she sneaks out of the morgue, Chief Seo catches her. So, she tells him about the evidence. On her the way home, she is cornered by assassins but the King turns up.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/qg3TP2I4hiQJBOUD3L3P3WXPdXt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-26","episode_number":11,"episode_type":"standard","id":863410,"name":"The Truth Revealed","overview":"Dong Yi is saved by the King's guard. She tells him that she has evidence to prove Jang Ok Jeong is innocent. The King and Chief Seo gather in the morgue to watch the procedure again. Unaware of the new development, Queen Dowager and the Investigation Bureau are happy on the downfall of Jang Ok Jeong. Jang Ok Jeong's brother, Jang Hee Jae who is a criminal, arrives from Qing. Then, because of her help, Dong Yi finally gets her reward. She is going to be promoted to court lady in the inner palace and will work in the Investigation Bureau.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/h0ddHZAq7nWnRpQuyHC3hYB8hnU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-04-27","episode_number":12,"episode_type":"standard","id":863411,"name":"Dong Yi Becomes a Court Lady","overview":"The court lady investigators don't want to accept Dong Yi because of her low class origin. But, the Queen who is the head of the inner court refuses to change her decision. Dong Yi arrives at the bureau and gets her new uniform. But, other court ladies are angry with her because they have studied for 10 years to get where they are now and she gets in because of the recommendation from Jang Ok Jeong. Then, she finds out that the investigators are studying for their midterm tests. An evil Investigator Yoo doesn't want Dong Yi in her department. So she tells Dong Yi that she must take the test and not to worry about not knowing anything. But, she does not explain to Dong Yi that she will be expelled from the bureau if she fails the test.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/AjzxRule04k8eempvCDGyF3Fgex.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-03","episode_number":13,"episode_type":"standard","id":863412,"name":"The Sword Fraternity Headband","overview":"Dong Yi fails the test. So, she begs her superior for another chance. The Queen is angry when she heard about it and scolds Investigator Yoo because of her behaviour. Then, Dong Yi is given 3 days to prepare for the test and it will be invigilated by Lady Jeong. While she studies for her test, the King turns up to help her. And this time, she passes the test. Meanwhile, the King decides to put Namin instead of the Seoin in power and Jang Ok Jeong will be made concubine. Then, Cheon Soo arrives at the palace as Chief Seo's helper. Even though they work in the palace, they keep missing each other. Young Dal who worries about Cheon Soo, searches his room and finds his Sword Fraternity headband. He takes it to Dong Yi in order to investigate who he is. She is shocked and then rushes to find Cheon Soo.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/7TVTfpuonoyfUtwK0B1AQljRqeN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-04","episode_number":14,"episode_type":"standard","id":863413,"name":"Dong Yi and Chun Soo Reunited","overview":"Jang Hee Jae agrees to help Cheon Soo to find Dong Yi if he works for him. Jang Hee Jae is spooked when he hears that investigators are looking for Cheon Soo. Cheon Soo and Dong Yi run around looking for each other and they finally met. Then, the delegates from Qing have arrived but it's revealed that there are Joseon smugglers in the party. The smugglers are working with Jang Hee Jae and they are prepared to financially support Namin if they can smuggle freely into Joseon. Oh Tae Seok agrees to their demands and he needs to stop the investigations into the smugglers. Dong Yi meanwhile keeps thinking about the paper with Chinese characters on it which is later discovered as a code. Then, she sneaks into the guest house to take the things that she needs and runs away while chasing by the Qing guards. She then rushes over to a man. Then she realizes that the man is the King.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/dDhVLNKxjlSVhP3m9kA4mzQ9M79.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-10","episode_number":15,"episode_type":"standard","id":863414,"name":"Dong Yi Turn Herself In","overview":"The Qing guards want to arrest Dong Yi for trespassing but the King insists that it will be investigated by the Joseon police. Then, they find out that the code is a name for a place near the river. It is then searched by the police and Chief Seo, who finds the smuggled weapons that belongs to Jang Hee Jae. He is very angry at Dong Yi for finding him out. The King has to talk to Dong Yi now that she knows who he is. Dong Yi begs for forgiveness from the King, who in turns asks her to stay informal like before. Then, Qing wants Dong Yi to be handed to them because of the international incident that she committed before. She then decides to turn herself in.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/tzXi2A1E4D1D9uoz4Mc4yuYrq0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-11","episode_number":16,"episode_type":"standard","id":863415,"name":"The Truth About Joseon Smuggler","overview":"Dong Yi is given three days to find the truth about the Joseon smuggler. She discovers that he staged his own death and the suicide note is not written by him. Then, Chief Seo heads to the nearest port to stop the smuggler from leaving Joseon. Cheon Soo who is given the task of taking smuggler, Kim Yoon Dal to the port, drops him there and watches the police arrest him. Oh Tae Seok is in charge of the investigation decides that smuggler Kim must be punished by death. Jang Ok Jeong sees the King chatting with Dong Yi and she asks him if he has feelings for Dong Yi. He denies it and plans a surprise banquet in Jang Ok Jeong's garden to announce that he will make Jang Ok Jeong his concubine.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/nCHyCEAkkx1Xd7rvnqyVgO54EjO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-17","episode_number":17,"episode_type":"standard","id":863417,"name":"Jang Ok Jeong Pregnancy","overview":"The palace is in confusion with the announcement that Jang Ok Jeong will become a concubine. Western factions are concerned that it will give Namin more power. Then, Jang Ok Jeong becomes pregnant. One year later, Jang Ok Jeong has been promoted to the highest ranking concubine and Southern Faction wants her son to be named Crown Prince. But, Queen Dowager disagrees with the idea. Suddenly, Queen Dowager is seriously ill. Cheon Soo says that if her tonics are mixed with unprescribed herbs, there can be a toxic reaction. Then Dong Yi remembers that she found an unprescribed herb in Jang Ok Jeong's ladies' quarters.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/kbwnNt0HxMusoKtJZF0sgLQV3gT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-18","episode_number":18,"episode_type":"standard","id":863416,"name":"The Queen Dowager Poisoning Scandal","overview":"Jang Ok Jeong notices that it is her brother who plotted the plan to poison the Queen Dowager. She is furious but he says that they have to do this if she wants to be the Queen. This make her realize that she has to change from a kind hearted person into a bad person. Then, Dong Yi also notices that it is Jang Ok Jeong who is behind the poisoning of the Queen Dowager. After that, the King hears that the official who has involved in the poisoning scandal has been arrested. They are all waiting for the confession from the official and it is a shocking confession. The official lies to them and says it is the Queen who asked her to poison the Queen Dowager.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/iNxBUJt5sanRNeIT9yqwbI58RBG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-24","episode_number":19,"episode_type":"standard","id":863418,"name":"The Conspiracy","overview":"Jang Ok Jeong and her family will be in trouble if they are found guilty of poisoning the Queen Dowager. She then realizes that it is an opportunity to frame the Queen and takes her title. But, both of them are suspects and because the King doesn't know who to believe, he orders Chief Seo to investigate. Jang Ok Jeong's brother wants to kill Dong Yi, in which she refuses at first. But then, when she sees Dong Yi is talking with the King, she accepts her brother's proposal. Then, police finds all the evidence that connect the official who poisons the Queen Dowager to the Queen. Although it is all a set up, the Queen's family and court ladies are arrested and questioned. Meanwhile, Dong Yi and Cheon Soo go out to investigate the matter more thoroughly.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/kmXPL8i3wnAU8BXy6vKC1CFK9fh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-25","episode_number":20,"episode_type":"standard","id":863419,"name":"The Death of Queen Dowager","overview":"Dong Yi and Cheon Soo go into town to investigate. But, when Dong Yi is alone for a moment, she is captured by Jang Hee Jae's men. They tie her and later throw her into the river. But, Cheon Soo follows them and manages to save Dong Yi. Although she is still shaken from the incident, she wants to continue the investigation. Unfortunately, Jang Hee Jae has been busy killing all the witnesses. Furthermore, to complicate things, the Queen Dowager dies and Southern Faction pushing hard for the Queen to be removed. Then, by the order of the King, the Queen will be dethroned.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/uqIm8CnATCJr3vzPUBU9BE9FMGf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-31","episode_number":21,"episode_type":"standard","id":863421,"name":"The Queen's Dethronement","overview":"A ceremony for the Queen's dethronement is held. She wears all white and her accessories which symbolize her status, are removed. The Joseon citizens are not happy about the dethronement. Meanwhile, Dong Yi is assigned to work in the treasury with the eunuchs. Although it is a difficult job, she keeps working hard. Then, she investigates an issue about the copper shortage and she also notices some mismatch in the book-keeping. This leads her to the money trail that has found its way from the treasury to the team Jang Ok Jeong. She notifies Chief Seo to investigate the matter.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/t8YfFQPJDcnDBFUMxxFuEUb7H4v.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-01","episode_number":22,"episode_type":"standard","id":863420,"name":"The Audit","overview":"The eunuchs refuse to let the lady investigators do the audit. Then, the King decides that they shouldn't continue with the audit because he wants to investigate the copper shortage secretly. Dong Yi visits the Queen to assure her that they can find the proof of her innocence soon. When the King goes to visit his parent's grave, he brings most of the guards with him. Because of that, the palace is quite and Jang Ok Jeong with her brother decides to set the treasury on fire. They also send assassins to kill Dong Yi, but she is not in her bed. Dong Yi is in the treasury looking for the record books when the fire starts. She run away and chased by the assassins.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/j5lBcK6iV31FphaicGoEt72Aev9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-07","episode_number":23,"episode_type":"standard","id":863422,"name":"The Assassination Attempt on Dong Yi's Life","overview":"Dong Yi runs to the home of Chief Seo's colleague with the proof that Jang Ok Jeong and Jang Hee Jae are behind the bribe. But, the assassins arrive and kill everyone. Dong Yi manages to run away but a dart is shot into her shoulder. Because she is very injured, she staggers across the mountains in order to reach the King who is on his way back to the palace. But, because she is too weak, she collapses and lies motionless in the grass. Then, the King discovers that Dong Yi and Chief Seo secretly investigates Jang Ok Jeong role in the Queen's dethronement and also the poisoning of his mother. Furthermore, he is also worried about the disappearances of Dong Yi.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/4z6Wm9ye6LCHob0V7PWxuqVNDAn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-08","episode_number":24,"episode_type":"standard","id":863423,"name":"The Disappearances of Dong Yi","overview":"Jang Ok Jeong is now the Queen and although she believes that Dong Yi is dead, she also has nightmares about Dong Yi. Furthermore, Jang Ok Jeong is furious because she is not respected as the Queen by the Joseon citizens. Meanwhile, Dong Yi is being nursed back to health by a merchant in the north and because the merchant hasn't been sending her letters, she carves a message on a rock and passes it to another merchant. Chief Seo and Cheon Soo also have been fired and sent by the King on a mission to find Dong Yi. When on their way, they find the messages and now they finally know where Dong Yi is. But, because Dong Yi is worried that they haven't received the message, she tries to sneak into the capital when she sees Jang Hee Jae.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/aLwvC2GPXytn8nTZOiBL0t51jrM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-14","episode_number":25,"episode_type":"standard","id":863424,"name":"The Exiled Nobleman","overview":"Jang Hee Jae arrives at the city to bribe the delegates from Qing. Sir Shim, an exiled nobleman who stays with the merchant is suspicious about Jang Hee Jae. So, he becomes the interpreter at the meeting and soon discovers that Jang Hee Jae intends to give the records of Joseon's national security to the delegates from Qing. Then, Jang Hee Jae orders the killing of Sir Shim, but he is saved by the Seol Hee men. Meanwhile, Jang Hee Jae knows that Dong Yi is alive and sends his assassins to kill her. As Dong Yi tries to sneak away again, Jang Hee Jae turns up at her location.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/vgkB4OWPW2aJkGRpMblpPQpveWe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-15","episode_number":26,"episode_type":"standard","id":863425,"name":"National Security Records","overview":"Dong Yi is tied up and about to be killed by Jang Hee Jae. But Sir Shim saves her by saying that he has the security records. He tells him to release Dong Yi and he will reveal where the records are. Dong Yi is released and Shi Shim reveal where the records are. Then, he is locked up in a barn as Jang Hee Jae men search for the records. After that, Jang Hee Jae men come back to kill Sir Shim, but Dong Yi has already helped him to escape. Chief Seo and Cheon Soo finally arrive in town. But, Dong Yi is on her way to the capital with Seol Hee. Before they left, it is revealed that the records that Jang Hee Jae has found are fake. He gives Dong Yi the original records and to be taken back to the capital.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/lXI2ZL08Zb2dzkoESgQSeFSGCCW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-21","episode_number":27,"episode_type":"standard","id":863426,"name":"The Dangerous Plan","overview":"Jang Ok Jeong is worried because the King doesn't trust her anymore. So, she decides to poison herself at her own coronation and blame it on the dethroned Queen. She orders her court ladies to poison her. After that, she becomes seriously ill but she later recovers. Dong Yi meanwhile has return to the capital but the guards are on a lookout for her. Dress as a boy, she manages to sneak into the capital and takes a job as a water maid in order to see the King. She sees the King but as soon as she calls him out, she gets caught and dragged away","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/1yfNzbKinoODvOI5GzBSeilO7yH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-22","episode_number":28,"episode_type":"standard","id":863427,"name":"The Melody","overview":"The King doesn't recognise Dong Yi as he is dragged away by guards. He then turns his attention to Jang Ok Jeong when he hears that she is conscious. Jang Ok Jeong is happy because her plan works out as the King ponders that she might be innocent after all. Then, the investigators come to inspect the water maid's residence. There, Lady Jeong finds the message that has been hidden by Dong Yi. But, before she is able to tell the King, she is arrested on the charges of conspiring to kill Jang Ok Jeong. Meanwhile, Dong Yi manages to run away from the palace by outsmarting Jang Hee Jae's men who wants to catch her. The King is very concerned about Dong Yi and goes to their old haunts outside the palace. He then hears a familiar melody that eventually leads him to Dong Yi.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/tQsXlxKOIDmR0uEJeEhQSK8cnQ4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-28","episode_number":29,"episode_type":"standard","id":863428,"name":"The King and Dong Yi Are Reunited","overview":"Finally, the King and Dong Yi are reunited. He then hides her at a royal place outside the palace. Then, Dong Yi gives the evidence that proves Jang Ok Jeong and her accomplices are involved in the Queen's dethronement to the King. Now, he knows who is guilty and when he returns to the palace, he ignores Jang Ok Jeong. She is very surprised of the King's behaviour and she then realises that Dong Yi is alive. The case against the Queen is reopened and Chief Seo is being promoted to Head of the King's Royal Guards. The Tribunal and the Head of Treasury is investigated. Finally, the King has all the proof all the guilty parties including Jang Hee Jae are arrested.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/zJlvXhwG04fGV3o8Fi4eO5ZuVKb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-29","episode_number":30,"episode_type":"standard","id":863429,"name":"A Special Court Lady","overview":"In order to make Jang Hee Jae and his accomplices to confess their crime, they are being tortured. But, Jang Ok Jeong still refuses to admit the charges and blames the King for her actions. Then, she orders Oh Tae Seok to kill Dong Yi. So, Southern Faction refuses to accept Dong Yi's evidence because she is a servant and ask her to be handed to them. The King however makes her a special court lady so that everyone will treat her with respect.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/y1Bu2FcDjPh8frkg46Ll7p6ktJW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-05","episode_number":31,"episode_type":"standard","id":863430,"name":"The King Confess His Love","overview":"Dong Yi's life changes instantly. But, she thinks that she has no right to be a Special Court Lady. Furthermore, she also worried that the King find out about her past. Then, the King visits her and confesses that he loved her. He also gives her a ring. But, Dong Yi's promotion is not being taken kindly by some. One of them, Jang Ok Jeong sees an opportunity to negotiate her brother's release in exchange for the Southern Faction to accept Dong Yi as Special Court Lady. The King accepts the offer. Later on, Dong Yi sneaks out from the palace. The King thinks that she has run away but she has gone to pay respect to her late father. The King finds her and assures her that her past is not important to him.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/gNS9icbtL4bbgTEdcI3yNLRx5X.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-06","episode_number":32,"episode_type":"standard","id":863431,"name":"The Plague","overview":"The King is in love, but Dong Yi is having trouble in her new role. This is because the court lady doesn't want to work for her. But things get from bad to worse when Dong Yi's maid starts to get sick. The King then takes Dong Yi to their favourite tavern and when they get back to the palace, a strange plague has spread. Strangely, only the court maids are infected. Then, Dong Yi is under suspicion of trying to kill the Crown Prince. Unfortunately for Dong Yi, Jang Ok Jeong is in charge of the investigation and she is only being given three days to find the cause of the plague. She will be killed if she fails.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/h0QBlmWL16EGBa5ZsBNuyOoqVrf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-12","episode_number":33,"episode_type":"standard","id":863432,"name":"Dong Yi Discovers The Cause of the Plague","overview":"Jang Ok Jeong finds out that it is her mother who causes the plague. She however ignores it because of her hate towards Dong Yi. In the meantime, Southern Faction finds no early records about Dong Yi and Cheon Soo. So, they try to get the information from Dong Yi's friends. Dong Yi meanwhile discovers that the plague is caused by the poison in the cosmetics that are linked to Jang Ok Jeong's mother. But, she is arrested because her three days limit is over. The King has been informed about the investigation and when he goes to question Jang Ok Jeong, she says that she and her mother know nothing about it. Then, delegates from Qing are coming to acknowledge the Crown Prince.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/qKfMxlzR95eDqvV3r5XrEVEpUUf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-13","episode_number":34,"episode_type":"standard","id":863433,"name":"Dong Yi's Secret","overview":"Jang Hee Jae is summoned to meet Qing delegates who are angry about the fake security records. They warn him that the Crown Prince position can be reversed and if they don't get the book before they leave, the King will be informed. Jang Ok Jeong in the meantime wants to make Dong Yi an official concubine. The real reason is, Jang Ok Jeong wants to know about Dong Yi's past because the candidate's background will have to be thoroughly checked. Then, the King also asks Chief Seo to check Dong Yi's past. He also tells Chief Seo about the cliff and when he heard about it, he is very shocked.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/5yEGWNa5Qj7eiZk7mJPi0j8TJPZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-19","episode_number":35,"episode_type":"standard","id":863434,"name":"The Plan to Search For Security Records","overview":"Chief Seo has all the records of the Sword Fraternity. He still blames Dong Yi's father for his father's death. But then, Cheon Soo tells him the truth. Chief Soo then stops Dong Yi from telling the truth and gives the King fake papers about her past. While Jang Hee Jae is trying to find the security records, his sister tries to convince Oh Tae Seok to give the records to the Qing. The plan is not a success. Then, they decide to have a banquet for the Qing delegates so that they can search the palace and Dong Yi's residence for the security records. While she is at the banquet, Dong Yi is suspicious about something.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/1WphTdPAqQwwt3NHoxAPW6EjV84.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-20","episode_number":36,"episode_type":"standard","id":863435,"name":"Dong Yi's Trap","overview":"Dong Yi decides to go back to her residence, but Jang Ok Jeong does not let her. She knows that when all the guards and police are in one place, Jang Ok Jeong accomplices can search for the records freely. They do find the records in Dong Yi's room. However, Dong Yi wants them to find the records so that the police can catch Jang Ok Jeong's brother when he is in the act of handing it over to the Qing delegates. So, when Jang Hee Jae realises that he is surrounded, he tries to burn the records but get caught in the act. He and his accomplices get caught and tortured. Jang Ok Jeong proclaims that she is innocent and supported by the Southern Faction.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/qYWFNjijHYhAX67VECCWcskgKBS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-26","episode_number":37,"episode_type":"standard","id":863437,"name":"Jang Ok Jeong's Dethronement","overview":"All the criminal are being arrested. Meanwhile, Dong Yi goes to see Jang Ok Jeong and reveals her plan on how to prove that she is guilty of stealing the records. Jang Ok Jeong is very angry and says that she and the Queen will suffer. As the King walks in, she pleads to the King that she is innocent but the King has listened to their conversation earlier. Then, Oh Tae Seok orders Lady Yu to tell Chief Seo that it is Jang Ok Jeong who has ordered them to search for the records. Jang Ok Jeong finally confesses to the King and he decides to dethrone her. All the lower ranking Namin is arrested and their leaders are stripped of their titles. Some are executed and others, including Jang Hee Jae are exiled.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/gCLFsa0vIjMvbcivZfR6GjxRdJr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-27","episode_number":38,"episode_type":"standard","id":863436,"name":"The King's Dream","overview":"Queen Inhyeon returns to the palace and greeted by the King who feels guilty on how she was treated before. Jang Ok Jeong goes back to her old residence and determines to take her revenge. Dong Yi meanwhile is put in charge of the Investigation Bureau. She forgives Lady Yun and her accomplices and as their punishment for helping Jang Ok Jeong, they are demoted to the lower ranks. The King has a dream about having a baby but disappointed when Dong Yi says she is feeling fine. But then, the ceremony to make Dong Yi a level 4 concubine is delayed when the doctor announces that she is pregnant.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/7eBCy9M1RjXygNHPUdvL02DlsCV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-02","episode_number":39,"episode_type":"standard","id":863438,"name":"A Year Later","overview":"One year later, Dong Yi now has a son and the Queen thinks that the Crown Prince should be changed to Dong Yi's son. Then, Dong Yi and the King decide to open a welfare office to help the poor. She goes out in disguise and help to distribute the food. When the head of welfare office is found murdered, the Southern Faction are being blamed. Then, Jang Moo Yeol, who is an Inspector General arrives to investigate the murder. He then visits Jang Ok Jeong to reveal that her father is killed by the Southern Faction and not the Sword Fraternity.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/ldpCaQDVsIUy6ezLAGWCdCJ0xuR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-03","episode_number":40,"episode_type":"standard","id":863439,"name":"Sword Fraternity Regrouped","overview":"Dong Yi goes out of the palace to investigate the hand signals that being showed to her when she was a child. She and Sir Shim go to the gambling house to ask about it, but no one knows the answer. In the meantime, Cheon Soo goes back to slave village and discovers that Sword Fraternity have regrouped. The new leader of Sword Fraternity is Dong Yi's friend, Gae Doo La. The new Sword Fraternity have been targeting noblemen. But now, they are targeting King's concubine and Gae Doo La doesn't know that she is targeting Dong Yi.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/v4nzIVKwFNyqwURLkiWGEusEqGW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-09","episode_number":41,"episode_type":"standard","id":863440,"name":"The Hand Signals","overview":"Sword Fraternity assassins nearly kill Dong Yi but then stop when she says that she is the daughter of the original Sword Fraternity leader. Dong Yi later meets Gae Doo La who refuses to stop what he's been doing. Jang Moo Yeol meanwhile informs the King that the exiled Namin leaders have given their wealth to the poor in order to atone for their mistakes. They are all invited back by the King. Jang Moo Yeol then realises that something is not right because Sword Fraternity assassins kill the guards but not Dong Yi. In the meantime, Dong Yi who has been working hard to investigate the hand signal finally gets her breakthrough. She realises that the signal uses music notes and it spells out Oh Tae Seok's name.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/sE8u4BJrpJghK0tcUn8VQ7eX4WP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-10","episode_number":42,"episode_type":"standard","id":863441,"name":"Oh Tae Seok's Murder","overview":"Dong Yi, Sir Shim and Chief Seo now realises that Oh Tae Seok and Jang Ok Jeong is behind the Namin official murder, framing of Sword Fraternity and the death of her father. When Oh Tae Seok knows about it, he is supposed to be taken to a safe house with Jang Moo Yeol's men but they kill him. Gae Doo La and his men who are following them are shocked when they see him killed. They end up fighting Jang Moo Yeol's men and are now being blamed for Oh Tae Seok's murder. When Jang Moo Yeol looks at the Swordsmen Society records, he notices that the leader has a daughter named Dong Yi. Then, Dong Yi sneaks out to help injured Gae Doo La to escape. But then, the King and his men turn up on only to see Dong Yi is helping a traitor.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/nq1MhV18ZLPQIQLSmBMzzlAV5Ts.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-16","episode_number":43,"episode_type":"standard","id":863442,"name":"King's Cover Up","overview":"Dong Yi finally tells the truth about her past. But, the King tries to help Dong Yi by seeing Gae Doo La who explains that her father doesn't kill Chief Seo's father. The King then announces that Dong Yi is innocent and knows nothing about the Swordsmen Society. But, she then hands herself to the police because she doesn't want to ruin the King's reputation. The King tries to stop her but to no avail. Chun Soo is also get arrested.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/gZD9HlaOkoo4Wp5Q5Eh426eNVFo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-17","episode_number":44,"episode_type":"standard","id":863443,"name":"Dong Yi's New Son","overview":"Dong Yi confess to everything. The scholars want the King to punish Dong Yi by execution, but he refuses. Then, Dong Yi's son is dead because he has measles. Soon after, the King decides on the punishment. Cheon Soo is exiled and Dong Yi is sent out of the palace. The King vow to never meet her again. One night, the drunken King arrives at Dong Yi's new home. He then vows to never go back but then hears that she is pregnant. Later, Dong Yi has a son and the King named him Geum. Six years later, Dong Yi and Geum live with the commoners.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/cQr36qNpssluUz7vkC1eUfMADbM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-23","episode_number":45,"episode_type":"standard","id":863444,"name":"King Sukjong Meets His Son","overview":"Dong Yi and Geum live outside of the palace with the commoners but Geum is desperate to find out who his father is. So, he sneaks into the palace but bumps into Jang Ok Jeong's son, the Crown Prince. Then, Jang Ok Jeong turns up and wants Geum to be beaten because he dares to come near the Crown Prince. But the Crown Prince saves him and he is allowed to leave unharmed. Geum then meets a nobleman and talks to him without realising that the nobleman is his father, the King.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/vXGwhEEVDYi6Bl9dqpNRulIifo8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-24","episode_number":46,"episode_type":"standard","id":863445,"name":"Dong Yi and Her Son Come Back to The Palace","overview":"The King takes his son to a Korean sumo game and ends up participating in it to impress his son. Later, Dong Yi takes Geum to a scholar so that he can learn better and also to keep his identity as a child prodigy a secret. Jang Ok Jeong's mother hears that the King has seen Dong Yi and orders her men to burn Dong Yi's house. But, the King's guards are on watch and manage to save Dong Yi and her son. The incident helps the King to bring them back to the palace. Furthermore, since his son is now 7 years old, he must come back to the palace and have the education befitting his status. Jang Ok Jeong is furious when she sees Dong Yi and her son stroll into the palace.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/4tiEQFCtroqoebphyEXz7oTbKBT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-30","episode_number":47,"episode_type":"standard","id":863446,"name":"Child Prodigy","overview":"Geum, or now known as Prince Yeoning is shocked when he realises that the nobleman is his father. He starts to get used to the life as a prince and Dong Yi is made a level 2 concubine. Dong Yi wants her son to act stupid when in school. Jang Ok Jeong hears this and asks him to sit in on the prince's exams. But it is backfired when the prince shows his knowledge and this impress the King who wants him to study with the Crown Prince. In the meantime, the Queen who is ill knows about the Crown Prince sickness and informs Dong Yi that she wants her son to study with the Crown Prince so that he can replace the King when the time comes.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/fgoBAUKYRqsJwdgWEwgaiUBlzg5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-31","episode_number":48,"episode_type":"standard","id":863447,"name":"The Plot to Kill The Queen","overview":"But then, it's decided that Prince Yeoning will be studying with a famous scholar and not with the Crown Prince. Furiously, Jang Ok Jeong's mother goes to see a shaman and wants to know the fortune of Dong Yi's son, but she is told that her family will have a bloody end. He then tries to frame Oh Ho Yang for the burning of Dong Yi's house by asking her assassin to hang him with a suicide not. But, the exiled Cheon Soo saves him. Jang Ok Jeong meanwhile knows that her son's condition is no longer a secret and she is ordered by the Queen to tell the King the truth. But the next day, the Queen collapses and Jang Ok Jeong is plotting to get rid of her.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/pxnUdhswR40eqE6DNbjI3UFf8wt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-06","episode_number":49,"episode_type":"standard","id":863448,"name":"The Death of The Queen","overview":"Since the Queen is sick, Jang Ok Jeong thinks that luck is on her side. She then orders a shaman to do some black magic near the Queen's residence because she wants her to die. But Jang Moo Yeol, who is suspicious about Jang Ok Jeong behaviour has discovered the secret about Crown Prince health. Back at the palace, Prince Yeoning finds the doll used by the shaman. But then, the Queen dies. As her last word, she wants the King to protect Prince Yeoning.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/ArsVNMHhnngmF2ZO557c64rR8Sh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-07","episode_number":50,"episode_type":"standard","id":863449,"name":"Dong Yi Promotion to Bin Level 1 Concubine","overview":"The Queen also asks the King to make Dong Yi a Queen, but Southern and Disciples' factions want Jang Ok Jeong to be the Queen. Now, Prince Yeoning and Crown Prince are becoming friends. The Crown Prince wants to know what is his illness is. So, they sneak into the pharmacy and they finally know what his illness is. Meanwhile, Dong Yi goes to see Jang Ok Jeong and wants a truce with her. Then, as the King announces that Dong Yi will be promoted to a Bin level 1 concubine, Jang Ok Jeong tells Dong Yi that she will accept her offer on the truce. But then, Prince Yeoning finds a strange book in his school bag.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/nXRD1YKgENIsXXbsGb2VAS1cNKg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-13","episode_number":51,"episode_type":"standard","id":863450,"name":"The Crown Prince is Missing","overview":"Jang Ok Jeong confirms to Dong Yi that she is not going to accept her truce as they are enemies. Then, guards storm the Crown Prince's palace because someone has stolen the Crown Prince books. But, the Crown Prince saves the prince by telling the King that he has give it to him. Jang Moo Yeol goes to see Dong Yi and to convince her to reveal the truth about the Crown Prince, but she rejects it. The Crown Prince and Prince Yeoning meanwhile sneak out of the palace to go to a festival. But the Crown Prince get arrested and dragged away to a police station. The palace is in chaos when they find out that the Crown Prince is missing but he is about to be punished for stealing.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/aCvk96orYFqnmZGxVEZROJEAyx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-14","episode_number":52,"episode_type":"standard","id":863451,"name":"The Truth About Crown Prince Illnes","overview":"Everyone searches for the Crown Prince. He doesn't tell the police who he is because he is worried something bad will happen to him. Cheon Soo finally finds him and brings him back to the palace. He is very weak and ill. Jang Ok Jeong is furious and blames Prince Yeoning. Because of that, Southern and Disciples' faction want Dong Yi and her son to be exiled from the palace because they put Crown Prince's life in danger. When Crown Prince gets healthier, he tells his mother that he knows what his illness is and doesn't feel he is worthy of his position as Crown Prince. He then goes to meet the King and tells him the truth.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/vQH6q7h2eKRavEI97oRLl3TjQtv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-20","episode_number":53,"episode_type":"standard","id":863452,"name":"The Attempt to Kill Prince Yeoning","overview":"When the King knows about Crown Prince's illness, he is furious. Jang Moo Yeol also spread the news so that officials will stop supporting Jang Ok Jeong. So, they all stop supporting her. Furthermore, she is arrested for attempting to kill Dong Yi and the prince. She wanted revenge and ask her brother to start a fire at the palace so that the assassins can sneak in to kill Dong Yi and the prince during the chaos. During the fire, the assassin sneaks in and tries to kill the prince but Dong Yi throws herself in front of her son and gets slash by the sword.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/xbAFZZfPf26RwhDj0nDkyzo8Ro.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-21","episode_number":54,"episode_type":"standard","id":863453,"name":"Jang Ok Jeong's Family Sentences to Death","overview":"Dong Yi is seriously injured by the attack. The assassin tries to get out of the palace but they get caught by the soldiers. Then, it is revealed that the attack was ordered by Jang Hee Jae. He and Lady Yoo get arrested and tortured but they refuse to say that Jang Ok Jeong was involved in it. But later she is also arrested. The King takes his time to decide what the suitable punishment for Jang Ok Jeong is. The King tries to get Jang Ok Jeong to commit suicide because she is the Crown Prince mother and it is a sensitive issue to sentence her to death but she refuses to do it. Without a choice, the King sentences her, her mother and brother to death.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/iA3Vw9lrQ09HPeRxlPcbCuOK3yp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-27","episode_number":55,"episode_type":"standard","id":863455,"name":"Jang Ok Jeong's Execution","overview":"The Crown Prince is devastated that his mother is going to die and begs the King to change his mind. But the King doesn't change his mind. On the day of her execution, Jang Ok Jeong wants the King to watch her die. The King cries as he watches Jang Ok Jeong drinks the poison. After that, Patriachs' Faction wants Dong Yi to be the Queen and her son to be the Crown Prince but Dong Yi ignores their request. Then, the King makes a new law that forbids concubine from becoming a Queen because of the chaos caused by Jang Ok Jeong. Later, the new Queen arrives and she wants Prince Yeoning to get married.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/kPQBLQCj8qM0kPB3MExjG5tsbeu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-28","episode_number":56,"episode_type":"standard","id":863454,"name":"Prince Yeoning's Marriage","overview":"Dong Yi is shocked to hear that but manages to get the permission to choose her son's bride. She refuses all the candidates from Disciples' Faction family. In the end, she chooses a scholar that has no power in politics. But, the home of the scholar has 'wang gi' royal energy, in which previous Kings have stayed or live there. It also means that the prince will get some support from the public that he should also become a king. In the meantime, Cheon Soo find out that Jang Moo Yeol have been doing some illegal things. Then, the wedding of Prince Yeoning and his bride goes ahead as planned.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/pagINJCa8xsDJDjI9XeFcxJRrfs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-04","episode_number":57,"episode_type":"standard","id":863457,"name":"The King Contemplates to Abdicate","overview":"The King then announces that Dong Yi is to live outside of the palace. But, the reason for this is, he wants to abdicate and live with Dong Yi. Then, the Crown Prince can become King and Prince Yeoning will replace him as the Crown Prince. But, Jang Moo Yeol discovers the King's plan and he asks the Disciples' Faction leader to help him stop it. Furthermore, He is also desperate to get rid of Dong Yi and her son. So, when the King is away, he prepares a plan to frame Dong Yi. The first step of the plan is, he gets himself put it charge of the army.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/Hdy4fbgfFZZiUXzcoGmrZQirYn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-05","episode_number":58,"episode_type":"standard","id":863456,"name":"Jang Moo Yeol's Plan to Frame Dong Yi and The Prince","overview":"Jang Moo Yeol is now in charge of the army and he also has the Queen under his influence. He then persuades the Queen to move Dong Yi to her new residence while the King is away. Jang Moo Yeol's plan is to frame Dong Yi for the murder of the Crown Prince. The Crown Prince entourage are attacked but he is not harmed. Cheon Soo and his men, who are at the scene are arrested. Since the King is away, the Queen is in charge and she issues an emergency decree to get all of those who have involved in the conspiracy arrested. The guards surround Dong Yi's residence and but they are there not to arrest Dong Yi. They are there to arrest Jang Moo Yeol instead. This is because the Queen has discoverd what Jang Moo Yeol's plan is.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/ffixQfD5By8C03aUFinKWbIZzLN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-11","episode_number":59,"episode_type":"standard","id":863458,"name":"Jang Moo Yeol Executed for Treason","overview":"Then, Dong Yi decides to tell the Queen about the King's plan to abdicate. She also manages to send word to the King about Jang Moo Yeol's plan to frame her and Prince Yeoning. Then, the King's army decide to follow Jang Moo Yeol's men and catch them trying to pay off merchants who involved in the Crown Prince assassination attempt. As his punishment for treason, Jang Moo Yeol is beheaded and his accomplices are exiled and executed. The King cancels his plan to abdicate because everyone is against it. Then, the Queen decides to adopt Prince Yeoning so that he will be a legitimate heir to the throne. In the meantime, Dong Yi decides to leave the palace.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/b6okT5ka6PgmQ6FzeZyKUOIn53F.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-12","episode_number":60,"episode_type":"finale","id":863459,"name":"A Happy Ending","overview":"Dong Yi leaves the palace and set up her own citizen's advice bureau to help lowborn who have problems with corrupt nobleman. Then, she discovers that the Finance Minister and Police Chief are involved in corruption and they also frame a lowborn for the murder of an official. But, thanks to her investigation, the framed lowborn are released and the corrupt officials are caught. A few years later, the King and Dong Yi are both dead. Dong Yi's son, who becomes the new King of Joseon, visits his mother's grave with Cheon Soo and promises to be a good King.","production_code":"","runtime":65,"season_number":1,"show_id":38852,"still_path":"/bj7VhBrxxClBlNzuBSjy5jXAhOi.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Production Controller","department":"Crew","credit_id":"62a99e1c22af3e5212f2f41b","adult":false,"gender":0,"id":1765434,"known_for_department":"Directing","name":"Kim Sang-hyub","original_name":"Kim Sang-hyub","popularity":2.121,"profile_path":null},{"job":"Scenario Writer","department":"Writing","credit_id":"62a99e915541fa2f2a2b359c","adult":false,"gender":0,"id":2756625,"known_for_department":"Creator","name":"Kim Yi-young","original_name":"Kim Yi-young","popularity":0.98,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57eb6603c3a3683941002265","adult":false,"gender":2,"id":1659343,"known_for_department":"Directing","name":"Lee Byeong-hoon","original_name":"Lee Byeong-hoon","popularity":1.565,"profile_path":null}],"guest_stars":[]}],"name":"Season 1","overview":"","id":50448,"poster_path":"/p2fAMjMXIpTVRyWePLKVYZrBi7A.jpg","season_number":1,"vote_average":0}}}