{
    "adult": false,
    "backdrop_path": "/2A7CI8yWWRmFLVeHhE9BJMRBM8o.jpg",
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2011-05-07",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "https://www.bbc.co.uk/programmes/b01l3bhv",
    "id": 38877,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2013-08-28",
    "last_episode_to_air": {
        "id": 863626,
        "name": "Barnhill",
        "overview": "Geri and her husband Kevin bought an 18th-century property in Devon after falling for its gothic arches, quirky architectural features and a glass lantern-like cupola, but discovered it was in a critical condition. The expected budget for repairs quickly doubles and Geri has to take over management of the build herself - but then the true impact of trying to undo more than 200 years of amateur construction hits home.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2013-08-28",
        "episode_number": 8,
        "episode_type": "finale",
        "production_code": "",
        "runtime": null,
        "season_number": 3,
        "show_id": 38877,
        "still_path": null
    },
    "name": "Restoration Home",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 332,
            "logo_path": "/7HVPn1p2w1nC5oRKBehXVHpss7e.png",
            "name": "BBC Two",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 20,
    "number_of_seasons": 3,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Restoration Home",
    "overview": "Following owners of crumbling historic buildings as they save them from ruin by restoring them into 21st-century dream houses.",
    "popularity": 4.013,
    "poster_path": "/nLnm5ciI8qhli1AGS5Q6VKKdJTs.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2012-08-29",
            "episode_count": 3,
            "id": 50469,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2011-07-05",
            "episode_count": 6,
            "id": 50467,
            "name": "Season 1",
            "overview": "",
            "poster_path": "/nLnm5ciI8qhli1AGS5Q6VKKdJTs.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2012-07-18",
            "episode_count": 6,
            "id": 50466,
            "name": "Season 2",
            "overview": "",
            "poster_path": "/wc3nBdCGz6EAa4kOqy4BDxCUrKE.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2013-07-10",
            "episode_count": 8,
            "id": 50468,
            "name": "Season 3",
            "overview": "",
            "poster_path": "/l0aWvwYbaoQ3NjuL28vLCxDrzfZ.jpg",
            "season_number": 3,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "5258ee35760ee346618dbec1",
            "air_date": "2011-07-05",
            "episodes": [
                {
                    "air_date": "2011-07-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 863614,
                    "name": "St Thomas a Beckett Church",
                    "overview": "St Thomas a Becket church in Somerset is on the heritage critical list and badly in need of rescue. A flood in 1968 led to the church's eventual deconsecration and it is just one of many churches in Britain that has been declared redundant. Decline in church-going and amalgamation of parishes have put a huge swathe of our architectural heritage in peril. Working their way up the property ladder, newly-weds Paul and Laura spotted the church in 2007 and decided this was the family home for them. They purchased the listed church with plans to turn it into a three-bedroom home. As the church is transformed, its past emerges - the dark times which marked its end and its links to an architectural movement that would change style forever, connecting it to the design of some of the greatest buildings in the country.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 863613,
                    "name": "Nutbourne Pumping Station",
                    "overview": "Nutbourne pumping station in West Sussex is a wreck. It closed in the 1970s and is now an industrial-size bunker full of rusting, redundant, heavy duty machinery. But this ruin was at the heart of a revolution that saved our grandparents' generation and changed society forever. Its remarkable past doesn't stop there, it was slap bang in the heyday of architectural design and played a crucial role in the dark, dismal years of the 1930s depression. For new owners Nick and Brigitte, the rotting bunker offered the ideal space for them and their five-year-old twins. Their plan is ambitious - turn the concrete carcass into a carbon efficient home for life. When the couple first bought the pumping station, they had no sentimental attachment to its former life. But as they learn about its past, their feelings towards the building begin to change.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 863615,
                    "name": "Stoke Hall",
                    "overview": "Stoke Hall is a 30-room Georgian mansion whose future has been far from certain for decades. The leaking roof and widespread rot makes securing the building difficult and expensive. At risk of being lost forever is the Hall's 250-year-old Georgian décor which miraculously has survived. Local, childhood sweethearts, Steve and Natalie, started married life in a 3-bed semi. Now he is a self-made millionaire with a successful business supplying high-tech products to the energy business. As the restoration starts, the past life of the house begins to emerge revealing architectural and social connections to the highest and most influential people in the land.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 863617,
                    "name": "Stanwick Hall",
                    "overview": "Years of neglect have left fungus growing on walls running wet with damp and timbers so rotten that one good storm might bring down the roof. Stanwick Hall is in appalling condition and faces an incredible battle for survival, which City high-flyers Gina and Simon have taken on. The Hall is on the buildings-at-risk register which means it is one of the most endangered structures in the country. As the restoration throws up more and more serious problems, long forgotten evidence comes to light showing it was built on the biggest financial scandal of the early 18th century and was emblematic of the huge upheaval in the early 19th century that changed the landscape of Britain forever.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-08-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 863616,
                    "name": "Calverton Manor",
                    "overview": "Calverton Manor is a collage of different architectural styles with parts thought to date back as far as the 14th century. And it comes with its very own legend involving a rich widow, the local butcher, pots of gold and murder. As the building's architectural and historical secrets begin to emerge - including high treason and arranged marriages - owners David and Jeanette are faced with a renovation that is causing problems. A main beam holding up the house has been destroyed by woodworm - it's a miracle the building hasn't collapsed. Whilst the building's past secrets are a constant fascination for the history-loving owners, the restoration process is proving to be much more testing than anyone predicted.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-08-09",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 863618,
                    "name": "Big House",
                    "overview": "Once a building of grandeur and influence, Big House is now a carcass. But digging deep into the archives, the property's historical and architectural roots, gives an insight into the wealth and power of an empire built on one of the country's most precious commodities - coal. And it provides an intriguing tale about the dirty tricks of political corruption. Why did this house fall into rack and ruin? Can it ever be returned to its former glory and who can tell what it looked like in its heyday? Owner, Alun, has lived in this part of the world all his life and dreamed of owning Big House ever since he was a small boy. Almost 10 years ago, he bought it. He's got a big job on his hands. Progress has been painfully slow but his aim it to turn Big House into a home.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 50467,
            "poster_path": "/nLnm5ciI8qhli1AGS5Q6VKKdJTs.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5258ee35760ee346618dbeb6",
            "air_date": "2012-07-18",
            "episodes": [
                {
                    "air_date": "2012-07-18",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 863610,
                    "name": "Coldbrook Farm",
                    "overview": "Coldbrook Farm is a 17th century Grade II listed Welsh farmhouse. Run-down, off the beaten track surrounded by working farm buildings in a muddy yard, its lavish carved Tudor timberwork is a clue that there is more to this farmhouse than meets the eye. As owners Bill and Kim grapple with the challenges of mixing old and modern, architectural expert Kieran Long and historian Kate Williams dig deep into the archives uncovering evidence that points towards Coldbrook's possible links with one of the most powerful lords in Britain.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-25",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 863607,
                    "name": "Sandford House",
                    "overview": "Sandford House is one of only two houses north of the border designed by arts and crafts architect Baillie Scott. It's a rare survivor, but how did such a building representing an important moment in British architecture end up in the lowlands of Scotland? Built as a famiy home in 1902, it spent half of its life as a 3-star hotel. Now abandoned, it fell into serious disrepair. Classed as a Category B property, the second highest listing for buildings in Scotland, it was in desperate need of help. Local couple Ralph and Evelyn had known the building for years. It used to be their local pub. As they watched it go downhill, their determination grew to save it. As the restoration starts to eat money, an intriguing tale of who built Sandford starts to emerge, linking it to Queen Victoria and an international business that operated across the world.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-01",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 863611,
                    "name": "The Elms",
                    "overview": "An imposing, three-storey Georgian house towers incongruously above the low-rise, modern housing development that surrounds it. The Elms, a Grade II listed building in Derbyshire, is in a dreadful condition - it has no stairs or floors. It's defied a string of developer attempts to turn it into a money-spinning property. Empty for eight years, it's slipping into a state of ruin and will soon be beyond help. Enter three generations of the same family who live just 200 metres away and had been thinking about the Elms for years. They fell in love with it and bought it. As the restoration gets underway, it emerges that one of the most influential past owners of the house turned accepted convention on its head that would have sent shock waves through the society of the day. Meanwhile, finances have become stretched to the point where the builders have been laid off.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-08",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 863612,
                    "name": "Old Manor",
                    "overview": "The 16th-century Old Manor in Norfolk is a hotchpotch of architectural styles. The Grade II listed property is full of history, but beset by damp, woodworm and death watch beetle. It is an overwhelming project to take on and yet new owners, Polly and Erich, are determined to turn this crumbling property into their dream home. As work gets under way, expensive and unforeseen structural problems are uncovered. Meanwhile, the historical and architectural investigations start to yield results. A leading expert thinks he has identified the original church location of the stained glass windows which firmly dates them to Henry VIII's Reformation. As Polly and Erich think they have sorted out the major problems, disaster strikes again. The Old Manor is broken into and badly vandalised.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-15",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 863609,
                    "name": "Abbey Lane",
                    "overview": "A couple want to turn the 16th century Abbey Lane in Warwickshire into a family home.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-22",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 863608,
                    "name": "Coulton Mill",
                    "overview": "Converting a disused farm building into a dream home is a challenge but taking on a whole set of them including a decaying mill, a waterlogged house and centuries-old outbuildings, is another challenge altogether.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 50466,
            "poster_path": "/wc3nBdCGz6EAa4kOqy4BDxCUrKE.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5258ee35760ee346618dbecc",
            "air_date": "2013-07-10",
            "episodes": [
                {
                    "air_date": "2013-07-10",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 863622,
                    "name": "Rock Farm",
                    "overview": "Caroline meets with Alex and her partner Martin who have purchased Rock Farm, which was once a perfectly proportioned Georgian house but is now a crumbling shell, cracked and contorted out of symmetry.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-17",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 863619,
                    "name": "Little Naish",
                    "overview": "Little Naish sits in the corner of a six acre Victorian walled garden and looks like a gothic tower directly from the pages of a fairy tale, but it's currently heading towards a tragic ending. Peter and Anne Hills have deiced to sink their life savings into trying to save it.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-24",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 863620,
                    "name": "Pitkennedy School",
                    "overview": "Charlotte and Helen have purchased Pitkennedy School in Angus which was once the cornerstone of a community until it closed in 2006. They hope to create a beautiful home from a neglected old Victorian school.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-31",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 863621,
                    "name": "Nebo Chapel",
                    "overview": "Hayley and Alan are not your typical restoration heroes. Struggling to find a decent sized family home, they decided to put in a bid for a Victorian chapel in the Welsh valleys. It was derelict and in need of a saviour - they bought the lot for just £25,000. With only £20,000 of their own money left to restore it, they begin a struggle of almost impossible scale. They start in the vestry to the rear, which they hope to transform into a spacious three double bedroom modern home. The plan was to then get a mortgage to complete the whole chapel, but the enormity of the task and the consequence of their tiny budget soon hits home. Simply digging foundations is a gruelling task as, rather than hiring a digger, they opt for doing it by hand to save their tiny budget. As Alun and Hayley struggle to save the centre-piece to the village, the historical investigation gains pace.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-08-07",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 863623,
                    "name": "Cassillis House",
                    "overview": "Six centuries of history drew Kate Armstrong to Cassillis House in Ayrshire. Originally from Australia, Kate has always had the dream of owning a castle and she picked one that was in a desperate condition. A four-year struggle began to restore 110 rooms - but not only was Kate attempting to save the fabric of the building, she took on the responsibility of preserving the story of the Kennedy Clan who called Cassillis their home for 21 generations. While the new owner discovers waterlogged kitchens and hidden rooms, the historical investigation reveals the building's transition from defensive fort to pleasure palace.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-08-14",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 863624,
                    "name": "Coltman Street",
                    "overview": "Simon Kelsey had known and loved one particular house on Coltman Street in Hull since he was ten years old. The once grand Victorian townhouse was already in decline but now it's in critical condition - ignored for years, carved up by modern conversions and on one of the most deprived streets in the town. Simon took a massive gamble and decided to try to save it.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-08-21",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 863625,
                    "name": "St Peter's Barn",
                    "overview": "A last remnant of a once grand and wealthy estate, St Peter's Barn had been overlooked for generations and carved up by modern farming practices. The moment Graham and Nicola walked into it, they knew it was the family home they had been searching for. At 35 meters long and 20 meters high, the crumbing cathedral-like interior would appear an impossible dream to most, but roofer and builder Graham saw its potential and decided to pour their life savings into buying it.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-08-28",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 863626,
                    "name": "Barnhill",
                    "overview": "Geri and her husband Kevin bought an 18th-century property in Devon after falling for its gothic arches, quirky architectural features and a glass lantern-like cupola, but discovered it was in a critical condition. The expected budget for repairs quickly doubles and Geri has to take over management of the build herself - but then the true impact of trying to undo more than 200 years of amateur construction hits home.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 38877,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 50468,
            "poster_path": "/l0aWvwYbaoQ3NjuL28vLCxDrzfZ.jpg",
            "season_number": 3,
            "vote_average": 0
        }
    }
}