{"adult":false,"backdrop_path":"/piv2HBZcwgQzw9O13ScVeZwELP7.jpg","created_by":[{"id":231039,"credit_id":"55b46f4b9251411e18013498","name":"April Blair","gender":1,"profile_path":"/qLh9SX8NDb48YeBorlIYaEf1gyY.jpg"}],"episode_run_time":[44],"first_air_date":"2012-01-03","genres":[{"id":35,"name":"Comedy"},{"id":18,"name":"Drama"}],"homepage":"https://freeform.go.com/shows/jane-by-design","id":39048,"in_production":false,"languages":["en"],"last_air_date":"2012-07-31","last_episode_to_air":{"id":865181,"name":"The Bonus Check","overview":"With the school play's future in the lurch because of her, Jane decides to do something very unselfish - giving the play her well earned bonus check from Donovan Decker so the show can go on. But with the play back on, and getting some much needed help from the Donovan and Decker crew on the costumes, Jane feels like she may have given up more than just some money for this play.","vote_average":0,"vote_count":0,"air_date":"2012-07-31","episode_number":18,"episode_type":"finale","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null},"name":"Jane by Design","next_episode_to_air":null,"networks":[{"id":75,"logo_path":"/p57JGkSUBdXbOtqkEKeTnfHn7kd.png","name":"ABC Family","origin_country":"US"}],"number_of_episodes":18,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Jane by Design","overview":"Teenage Jane lands a job at Donovan Decker, a hip fashion house, when they mistake her for an adult. Jane soon finds herself juggling life both as a regular high school student and as an assistant to a high powered executive in the cutthroat world of fashion... all while trying to keep her true identity a secret.","popularity":9.197,"poster_path":"/v0t6EzLG2p0u1ugxYmZ9YMsxbNW.jpg","production_companies":[{"id":59325,"logo_path":null,"name":"ABC Family Worldwide","origin_country":""}],"production_countries":[],"seasons":[{"air_date":"2012-01-03","episode_count":18,"id":50571,"name":"Season 1","overview":"","poster_path":"/v0t6EzLG2p0u1ugxYmZ9YMsxbNW.jpg","season_number":1,"vote_average":5}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"From high school to high fashion.","type":"Scripted","vote_average":7.333,"vote_count":27,"season_data":{"1":{"_id":"5258eed9760ee346618e6288","air_date":"2012-01-03","episodes":[{"air_date":"2012-01-03","episode_number":1,"episode_type":"standard","id":865165,"name":"The Pilot","overview":"Jane Quimby is juggling life as a high school student and as an assistant.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-01-10","episode_number":2,"episode_type":"standard","id":865166,"name":"The Runway","overview":"Jane is thrown for a loop when Gray assigns her the last-minute task of getting the new accessories line ready for the Spring Preview Party. Jane is pretty sure she has bit off more than she can chew, but with Jeremy looking to make amends, the two team-up to guarantee the line is one that critics and buyers won’t soon forget.\n\nMeanwhile, Nick leverages his knowledge of Billy’s secret relationship with Lulu to get advice on approaching Jane. When Nick asks her to the Winter Formal, Jane thinks life couldn’t get any better. But when she realizes the Winter Formal is the same night as the Spring Preview Party, her two perfect nights become her worst nightmare.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-01-17","episode_number":3,"episode_type":"standard","id":865167,"name":"The Birkin","overview":"Jane is feeling on top of the world when Gray gifts her with the use of a real Birkin bag to commend her for a job well done. Jane thinks she finally has this job under control when Gray gives her the task of running the private trunk show at Gray’s house. But with India feeling the pains of jealousy of Gray’s new \"favorite” stealing the preview party spotlight, she is determined to show Gray and the company what a failure Jane can really be.\n\nMeanwhile, competition heats up between Jane and Lulu at school when they are told that they’re tied for first place in class.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Brad","credit_id":"5efc9a5877c01f00350e18d5","order":502,"adult":false,"gender":2,"id":508357,"known_for_department":"Acting","name":"Hartley Sawyer","original_name":"Hartley Sawyer","popularity":5.019,"profile_path":"/gcPjPG8AIPnzX6B0Q9kXq3KTfHv.jpg"}]},{"air_date":"2012-01-24","episode_number":4,"episode_type":"standard","id":865168,"name":"The Finger Bowl","overview":"Now that Billy and Lulu have decided to take their relationship public, Billy must tell Jane. Feeling betrayed and lied to, Jane doesn’t take the news of the high school’s new “It” couple well. But now with the news out there and neither group of friends seeming very supportive of it, can Billy and Lulu withstand the peer pressure? And has Jane truly lost her one true ally in the social shark tank that is high school?\n\nMeanwhile, Jeremy and Jane are given the impossible task to present the new fashion line to top fashion magazine editor Miyoko Sato and make a good impression when she visits the Donovan Decker offices.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-31","episode_number":5,"episode_type":"standard","id":865169,"name":"The Look Book","overview":"Jane is over-the-moon with anticipation when Gray tells her she will be boarding a flight to Paris the following night to bring her the coveted Donovan Decker Lookbook, which holds all the secrets, inspirations and ideas for the fashion company. When Jane is tasked with secretly securing the Lookbook until she leaves, she will do anything to hold onto it and make the flight to Paris, even if that means she has to turn to her nemesis and best friend’s girlfriend, Lulu for help.\n\nMeanwhile, Billy’s brother Tommy, has a new criminal scheme that he wants Billy to help him with.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-07","episode_number":6,"episode_type":"standard","id":865171,"name":"The Image Issue","overview":"When she questions India’s presentation in front of Gray, Jane is tasked to do her own research to find out what high school students are really looking for in the fashion world. Determined to prove that teenagers are about finding out who they are and not changing just to fit some mold, Jane hits the hallways of her school to prove her point. But when her classmates are less then helpful, Jane starts to worry that she won’t be able to pull the presentation off.\n\nMeanwhile, Billy tries a new look to gain a little bit more respect, much to Jane’s chagrin.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-14","episode_number":7,"episode_type":"standard","id":865170,"name":"The Teen Model","overview":"When Donovan Decker lands unpredictable teen supermodel Piper Grace as the face of their new line, Jane is the one tasked to keep her under control until the photo shoot. What first seemed like an easy job quickly becomes Jane’s nightmare when Piper lives up to all of the hype.\n\nMeanwhile, Ben gets tired of Jane’s behavior and decides to lay down the law and ground her.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-21","episode_number":8,"episode_type":"standard","id":865172,"name":"The Wedding Dress","overview":"The Donovan Decker crew is under pressure to come up with the perfect wedding dress for socialite Charlotte Whitmore after her rejection of the original dress. With all hands on deck pulling an all nighter and Jeremy’s job on the line, tensions are high in the office. Wanting to impress Jeremy and save-the-day, India takes credit for Jane’s wedding dress design. But with the design holding special meaning to Jane, she isn’t going to let the betrayal go idly by. Can Jane prove that the design is hers, and better yet – will Donovan Decker be able to pull off the perfect wedding dress?\n\nMeanwhile, Jane sets up a night out with Billy and Nick so the two guys can get to know each other better.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5258eeda760ee346618e6317","order":500,"adult":false,"gender":1,"id":74607,"known_for_department":"Acting","name":"Autumn Reeser","original_name":"Autumn Reeser","popularity":10.471,"profile_path":"/ftDOWocmtT9YSZhV6bVrbsywIad.jpg"}]},{"air_date":"2012-02-28","episode_number":9,"episode_type":"standard","id":865173,"name":"The Getaway","overview":"Jane is looking forward to the school camping trip as a way to finally get some quality time with Nick. But now with Ben acting as chaperone, her weekend may be a little less perfect. Then, her weekend gets totally uprooted when India requests that Jane go with her to Los Angeles to help pick the new Donovan Decker store location. So instead of spending time with Nick, Jane is now stuck with India – leaving Nick in the lurch, yet again.\n\nMeanwhile, the school camping trip is anything but fun for Ben, Billy, Lulu and Nick.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-06","episode_number":10,"episode_type":"standard","id":865174,"name":"The End of the Line","overview":"The aftermath of what Billy did with his brother has legal consequences that lead him to get called before a judge... Lulu's father. Ben knows Jane's secret and Jane might stop everything.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-05","episode_number":11,"episode_type":"standard","id":865175,"name":"The Replacement","overview":"Jane is scrambling to get a handle on both her personal and professional life. With Billy returning from juvie, Jane is nervous about how things were left and what that means now for the two best friends. But, she doesn’t have too much time to think about it because with India now gone from Donovan Decker, Gray is leaning on Jane more than ever. Jane starts to wonder if she may have a shot at the job, with a little encouragement from Jeremy, but some stiff competition might be standing in her way. Interior designer Martyn Lawrence-Bullard (from Bravo’s “Million Dollar Decorators”) stops by the Donavan Decker offices to spruce up Gray’s office.\n\nMeanwhile, Ben tries his best to keep Jane’s secret safe even though it is affecting his new relationship with Rita.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-12","episode_number":12,"episode_type":"standard","id":865177,"name":"The Celebrity","overview":"It’s bad enough that the Donovan Decker team has to win the approval of India to clinch the coveted new Harrod’s fashion line, but now they have to also dazzle movie star Aiden Redmond – the new celebrity face of the retail chain. With his Hollywood looks and charm, it is only a matter of time before the whole team is smitten. Now with access to one of Hollywood’s top leading men, will all the fame and celebrity get the best of Jane?\n\nMeanwhile, Billy is still struggling to fit back into daily life of high school and his new reputation.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-19","episode_number":13,"episode_type":"standard","id":865176,"name":"The Surprise","overview":"It’s Jane’s big day – her birthday, but everyone seems to have forgotten – or so she thinks. Unbeknownst to her, Ben and Billy have grand plans to surprise Jane with a surprise birthday party. But their party plans start to unravel as Jane’s hurt feelings and a work situation get in the way. In the end, it isn’t a birthday party that gives Jane the surprise of her life.\n\nMeanwhile, India puts the pressure on Jeremy to get information on Gray.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Amanda Clark","credit_id":"577f49a4c3a3681b0e001076","order":501,"adult":false,"gender":1,"id":1003082,"known_for_department":"Acting","name":"Briga Heelan","original_name":"Briga Heelan","popularity":4.392,"profile_path":"/5GSPFGxMLLrClqvWog6DnTh2J6y.jpg"}]},{"air_date":"2012-06-26","episode_number":14,"episode_type":"standard","id":865180,"name":"The Second Chance","overview":"Jane's mother, Kate, is back and full of wild stories but no real answers of why she left and hasn't been in touch. Jane is excited for her to be there, seeing it as a chance to finally get to know the mother she only dreamed about. Ben, on the other hand, sees Kate's arrival as nothing but trouble and ultimately only disappointment for Jane when Kate disappears again.\n\nMeanwhile, Billy starts to wonder about Zoe when things start to seem off about her.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Amanda Clark","credit_id":"577f49a4c3a3681b0e001076","order":501,"adult":false,"gender":1,"id":1003082,"known_for_department":"Acting","name":"Briga Heelan","original_name":"Briga Heelan","popularity":4.392,"profile_path":"/5GSPFGxMLLrClqvWog6DnTh2J6y.jpg"}]},{"air_date":"2012-07-10","episode_number":15,"episode_type":"standard","id":865179,"name":"The Online Date","overview":"Love is in the air, but needs a little help to get going and Jane is determined to help her friends out. Billy is caught off guard when Zoe invites him to meet her parents and he isn’t so sure he is ready to take that step. Kate, on the other hand, decides to help Gray take the next step with her love life by setting up an online dating profile for her. Mortified by her mother’s actions, Jane must now try to put a stop to the online dating scheme before Gray finds out and fires her for sure.\n\nMeanwhile, Rita decides to finally fight for Ben - but is she up for taking on life-long mean girl Amanda?","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Amanda Clark","credit_id":"577f49a4c3a3681b0e001076","order":501,"adult":false,"gender":1,"id":1003082,"known_for_department":"Acting","name":"Briga Heelan","original_name":"Briga Heelan","popularity":4.392,"profile_path":"/5GSPFGxMLLrClqvWog6DnTh2J6y.jpg"}]},{"air_date":"2012-07-17","episode_number":16,"episode_type":"standard","id":865178,"name":"The Backup Dress","overview":"Jane and Billy volunteer in backstage work for the Cinderella play, starring Zoe and Nick. Kate gives away the dress that Jane made to Zoe, leaving Jane without a dress to wear for her first official date with Eli. Ben gets a chance to play a minor league baseball in Ohio. Jane and Eli's date gets a complicated, with the buyer of the dress made by Donovan Decker appearing in the same restaurant as Jane, with Jane wearing the same exact dress previously labeled as the \"backup dress\". Kate accepts Dakota's proposal and heads out to Colorado. Jane is left alone in the house since Ben and Kate went on their own journeys.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Amanda Clark","credit_id":"577f49a4c3a3681b0e001076","order":501,"adult":false,"gender":1,"id":1003082,"known_for_department":"Acting","name":"Briga Heelan","original_name":"Briga Heelan","popularity":4.392,"profile_path":"/5GSPFGxMLLrClqvWog6DnTh2J6y.jpg"}]},{"air_date":"2012-07-24","episode_number":17,"episode_type":"standard","id":865182,"name":"The Sleepover","overview":"The Harrods and Donovan Decker deal looks bleak when the Harrods team demands to get Jeremy's designs. With little to go on, Gray gives Jane the task of going to London to find Jeremy and persuade him to come back. Now all alone in London, Jane heads out to find Jeremy and save the day. Meanwhile Billy tries to repair things with Zoe, only to have his relationship with Jane get in the way - again.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-31","episode_number":18,"episode_type":"finale","id":865181,"name":"The Bonus Check","overview":"With the school play's future in the lurch because of her, Jane decides to do something very unselfish - giving the play her well earned bonus check from Donovan Decker so the show can go on. But with the play back on, and getting some much needed help from the Donovan and Decker crew on the costumes, Jane feels like she may have given up more than just some money for this play.","production_code":"","runtime":44,"season_number":1,"show_id":39048,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Amanda Clark","credit_id":"577f49a4c3a3681b0e001076","order":501,"adult":false,"gender":1,"id":1003082,"known_for_department":"Acting","name":"Briga Heelan","original_name":"Briga Heelan","popularity":4.392,"profile_path":"/5GSPFGxMLLrClqvWog6DnTh2J6y.jpg"}]}],"name":"Season 1","overview":"","id":50571,"poster_path":"/v0t6EzLG2p0u1ugxYmZ9YMsxbNW.jpg","season_number":1,"vote_average":5}}}