{"adult":false,"backdrop_path":"/2LEWLQ61ERXRffIhFrWfOxFFyil.jpg","created_by":[],"episode_run_time":[42],"first_air_date":"2016-04-11","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.bravotv.com/the-real-housewives-of-dallas","id":39283,"in_production":false,"languages":["en"],"last_air_date":"2021-05-11","last_episode_to_air":{"id":2922551,"name":"Reunion (2)","overview":"In the conclusion of The Real Housewives of Dallas season 5 reunion, Tiffany and Kameron spar over chicken feet, cultural stereotyping, and their social media war. D’Andra defends her name change and reveals shocking new facts about the battle over her inheritance. Brandi talks candidly about her unexpected pregnancy, her missteps with Tiffany, and her husband’s recently surfaced betrayal.","vote_average":0,"vote_count":0,"air_date":"2021-05-11","episode_number":18,"episode_type":"finale","production_code":"","runtime":44,"season_number":5,"show_id":39283,"still_path":"/SHqLNP5tQh8Qh9vnUzt6icwCrH.jpg"},"name":"The Real Housewives of Dallas","next_episode_to_air":null,"networks":[{"id":74,"logo_path":"/wX5HsfS47u6UUCSpYXqaQ1x2qdu.png","name":"Bravo","origin_country":"US"}],"number_of_episodes":78,"number_of_seasons":5,"origin_country":["US"],"original_language":"en","original_name":"The Real Housewives of Dallas","overview":"An exclusive look into the glamorous galas, scintillating scandals and enormous egos of a group of women as they navigate the social scene of Dallas’ elite, all while juggling their husbands, boyfriends and families.","popularity":17.611,"poster_path":"/9QDd7EZgr5cWfyEirSYxVBIjDkS.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2016-04-11","episode_count":11,"id":76298,"name":"Season 1","overview":"","poster_path":"/sLOFmAVDDRDlBRM4VD83x36RUqn.jpg","season_number":1,"vote_average":0},{"air_date":"2017-08-14","episode_count":14,"id":90397,"name":"Season 2","overview":"","poster_path":"/60FLYOKPPXzudNXnWWkaGKnPQPT.jpg","season_number":2,"vote_average":0},{"air_date":"2018-08-15","episode_count":18,"id":107934,"name":"Season 3","overview":"","poster_path":"/o3no4ub6UANJN79p6Lf2zCHlmM9.jpg","season_number":3,"vote_average":0},{"air_date":"2019-09-04","episode_count":17,"id":131218,"name":"Season 4","overview":"","poster_path":"/vyzLarAGtgqfojTqynZT52DSwlD.jpg","season_number":4,"vote_average":0},{"air_date":"2021-01-05","episode_count":18,"id":172010,"name":"Season 5","overview":"","poster_path":"/3sbT7nty9mwgzLPFU5jrtr0uofV.jpg","season_number":5,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Reality","vote_average":7.1,"vote_count":14,"season_data":{"1":{"_id":"570ae7d992514111f2000140","air_date":"2016-04-11","episodes":[{"air_date":"2016-04-11","episode_number":1,"episode_type":"standard","id":1185559,"name":"Everything's Bigger in Dallas","overview":"Everything’s bigger in Dallas - the egos, the attitudes, and the bank accounts. Cary hosts a benefit at her home where inappropriate behavior by best friends Brandi and Stephanie raises the ire of social maven, LeeAnne. Later, tensions boil over at a prestigious charity event as Stephanie is dragged into a feud between Brandi and LeeAnne. Meanwhile, Leanne’s best friend, Tiffany, questions whether her recent move back to Dallas from Los Angeles was the right decision for her and her rocker husband, Aaron.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/imk142ASKMoiPAVllfH8HAceAp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-04-18","episode_number":2,"episode_type":"standard","id":1187162,"name":"Mad as a Hatter","overview":"LeeAnne enlists the help of a Dallas designer to create an extravagant hat for Mad Hatter’s Tea Party, one of the most coveted events on the Dallas social calendar. Brandi struggles with her husband Bryan’s constant business travel as she hosts a birthday party for her mother. Elsewhere, Tiffany and Aaron go house hunting, despite Aaron’s reservations about setting down roots in Dallas. Later, Stephanie and Cary are dragged deeper into Brandi’s conflict with LeeAnne when Brandi arrives to the Mad Hatter’s Tea Party donning a hat decorated with a special surprise.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/gfu4w0CsLQ4LmQT9w23wZYoPEqD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-04-25","episode_number":3,"episode_type":"standard","id":1188776,"name":"Making Frenemies","overview":"Tiffany features Cary’s couture closet in her web series, Sanctuary of Style, and discovers a shocking revelation about Mark. Meanwhile, Brandi deals with fallout from Bryan after her alcohol-infused episode at a male strip club and LeeAnne invites Stephanie and Cary to lunch to address Brandi’s behavior at the Mad Hatter’s Tea Party. Later, Brandi’s mother shares a family secret causing Brandi to question everything she thought she knew about her grandfather.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/9kg3Fyvopu51dxT8sVObedu9hdf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-02","episode_number":4,"episode_type":"standard","id":1190092,"name":"Mouth of the South","overview":"Stephanie and Brandi hit the road for a family trip to visit Stephanie’s parents in Coweta, Oklahoma. Back in Dallas, Cary takes another step toward building a friendship with Tiffany and extends an invite to join her for yoga. Later, Marie hosts a lavish cocktail party where an embarrassing revelation about LeeAnne comes to light. Tiffany’s effort to broker peace between Brandi and LeeAnne backfires with disastrous results.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/2WtfdQmle39kNdR5Rx5unJKYOXH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-09","episode_number":5,"episode_type":"standard","id":1190093,"name":"Guess Who's Coming To Dinner?","overview":"Tiffany’s effort to play peacemaker with LeeAnne and Brandi fails in mighty fashion, causing Tiffany and LeeAnne to clash in a big way. Meanwhile, Travis buys Stephanie’s affection with major bling to commemorate their seventh wedding anniversary. After receiving a champagne shower from LeeAnne, Cary receives a fabulous surprise gift from Mark. Brandi is devastated when Bryan bails on a barbeque she hosts for her estranged grandfather.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/2Yyd7WTfutzp17T1KSzkmA2cv5t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-16","episode_number":6,"episode_type":"standard","id":1192507,"name":"Locken Loaded","overview":"LeeAnne and Tiffany confront Marie after Tiffany reveals that Marie has been spreading gossip behind LeeAnne’s back. Travis tries to micromanage Stephanie’s plans to redecorate four-year-old Cruz’s bedroom, while Mark captures risqué photos of Cary for their website in a bid to attract more business. Tensions rise between Brandi and Bryan when she confronts him about blowing off the barbecue she hosted for her estranged grandfather.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/q8nYI6afkA1YU95oY2hIzdnAme.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-23","episode_number":7,"episode_type":"standard","id":1195677,"name":"Black and Blues","overview":"Tiffany attempts to solidify her standing in Dallas by throwing a charity concert with her rocker husband Aaron at the House of Blues. Brandi is shaken by traumatic news about her younger brother Michael. LeeAnne and Stephanie meet in an attempt to reconcile differences. Cary’s apprehensions about LeeAnne grow at a gothic-themed party.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/kNj7lMxJWd7s8DsP4kD5n64Kjdc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-30","episode_number":8,"episode_type":"standard","id":1196310,"name":"Hollman Holiday","overview":"Stephanie struggles when Travis tries to hijack the planning of his own birthday party. Brandi and LeeAnne break bread to see if they can find common ground. Cary chastises Mark for overspending on extravagant gifts for three-year-old Zuri’s birthday. Tiffany and Stephanie watch LeeAnne take center stage as the keynote speaker for a charity event supporting women with HIV. And at Travis’ birthday, a drunken Brandi raises eyebrows by extending an invitation to everyone for a weekend getaway.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/ybes6Ux2BNGQW3bverlYOyERYWi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-06","episode_number":9,"episode_type":"standard","id":1198071,"name":"Killing Time in Austin","overview":"The ladies head to Brandi and Stephanie’s lake house in Austin for a fun getaway weekend. On the trip down, LeeAnne is shocked to learn that everyone is “in” on the details of an embarrassing secret from her past. Later, the drinks flow freely at dinner as a drunken Brandi puts her acrobatic skills on display. The next morning, Cary and Stephanie engage in a heated confrontation with LeeAnne, in the aftermath of a horrific late night fight they overheard.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/tJelgvddPBaEnp9PC850bN9ifkZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-13","episode_number":10,"episode_type":"standard","id":1199180,"name":"The Full Nelson","overview":"Stephanie hosts her annual Byron Nelson party, an all-day drinking extravaganza celebrating a golf tournament held in her backyard at the Four Seasons Resort. Tiffany gets a lead on a hot new home and tries to convince Aaron to settle down in Dallas. Meanwhile, Cary and Mark make their summer plans for Switzerland and LeeAnne explores the possibility of pursuing a career as a public speaker. Stephanie’s party isn’t safe from drama as Cary and LeeAnne clash, leaving a fractured group of friends in their wake.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/cmvPCrfOBm73lgn2T4O5zsh8Gpa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-19","episode_number":11,"episode_type":"finale","id":1200706,"name":"Reunion","overview":"Bravo Media’s The Real Housewives of Dallas brings big drama from the big D on a supersized reunion. For their first rodeo, Andy Cohen sits down with Cary Deuber, Tiffany Hendra, Stephanie Hollman, LeeAnne Locken, Brandi Redmond, their friend Marie Reyes and Cary’s husband Mark Deuber, to rehash the season’s most memorable and difficult moments. In the supersized reunion, Brandi divulges a painful secret about her marriage to Bryan, while Stephanie sets the record straight on Travis’s to-do list. Cary and Mark confront LeeAnne about the scandalous rumor she spread about them, and Tiffany responds to allegations about her racy acting past. Marie also joins the ladies on the couch to share new details about that heated night in Austin.","production_code":"","runtime":null,"season_number":1,"show_id":39283,"still_path":"/86FZgJBH1oYvX6PEAWPWHOOF0BA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":76298,"poster_path":"/sLOFmAVDDRDlBRM4VD83x36RUqn.jpg","season_number":1,"vote_average":0},"2":{"_id":"5965da0c92514121f01062de","air_date":"2017-08-14","episodes":[{"air_date":"2017-08-14","episode_number":1,"episode_type":"standard","id":1337106,"name":"Look Who's Not Talking","overview":"The Housewives take sides as Brandi and Stephanie reveal that a summer-long feud has ended their friendship. And who of all people has become Brandi’s friend and confidante, but LeeAnne Locken. Meanwhile, an old police report about LeeAnne’s past resurfaces, threatening to derail her new goal of controlling her anger. And everything comes to a head at Cary’s birthday party for Mark, where Brandi and Stephanie come face to face as two new housewives join the cast in the Season Two premiere.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/fDfYJtsTN02z0YNtWRxfzPwEjDK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-08-21","episode_number":2,"episode_type":"standard","id":1347819,"name":"Haute Dogs of Dallas","overview":"Stephanie makes a play to put a crack in Brandi’s newfound friendship with LeeAnne, but it backfires turning Cary and LeeAnne against her. Meanwhile, Travis drops millions on a house in the city, but Stephanie is the last to know. D’Andra makes moves towards taking over her mother’s cosmetics business, but it won’t be easy. And fur flies when Brandi and Stephanie meet again at the Howl-O-Ween dog costume contest.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/joyaVtX1vSEiL6YeG94ZkondnZz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-08-28","episode_number":3,"episode_type":"standard","id":1356698,"name":"Face to Two Face","overview":"Brandi and Stephanie make an attempt to repair their broken friendship, but after so much damage, it may be too late. With no experience parenting, D’Andra tries her best not to be an evil stepmother when Jeremy’s 20-year-old son moves in. And LeeAnne's latest anger management session doesn’t prevent her from showing up at Stephanie’s Halloween party dressed to kill.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/mXoRV8X5l1m0ZmiKw6kxosVqXwB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-04","episode_number":4,"episode_type":"standard","id":1357451,"name":"By Invitation Only","overview":"Stephanie draws a line in the sand with Travis about the expensive renovations they need to make to their new home. LeeAnne shows potential as a role model for women until Brandi overhears her gossiping about Stephanie. Meanwhile, D’Andra demands to know when her mother will finally turn over the family business and is surprised when she hears the real reason. And when Brandi invites Cary and Stephanie to Memphis right in front of Kameron, it sparks a fight about etiquette and manners.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/lbWoXl2KkUkoyWwCoDaFsjC7XEz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-11","episode_number":5,"episode_type":"standard","id":1357452,"name":"Walking in Memphis","overview":"Kameron presents a bright pink business idea to her very skeptical husband, while Cary and Stephanie embark on Brandi’s family trip to Memphis. LeeAnne is left behind and crushed to find she’s not as close to Brandi as she thought. Unexpected news from D’Andra’s stepson Keatin leaves her angry and confused. And Brandi begins to feel she’s taking a daring emotional chance, hoping Grandma will open the door after being estranged for so long.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/6Lljzrs1wwi6xmCupr4SsraWX6r.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-18","episode_number":6,"episode_type":"standard","id":1367114,"name":"Don't Cry Over Spilled Tea","overview":"LeeAnne gets a stunning surprise from Rich at the Texas State Fair. D’Andra decides to call an \"Honestea\" at her house where she’ll use a teapot, some notes, and a gavel to coerce her beloved back-talking b* to get their issues out on the table and move on. But a little too much honesty threatens to send the teacakes flying.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/hRh3xMarj91SmnN3PyfGGMNbmle.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-25","episode_number":7,"episode_type":"standard","id":1367115,"name":"Viva La Mexico","overview":"The women prepare for their getaway to Mexico; Kameron wins Court over, and he agrees to invest in her business idea; moments before LeeAnne goes under the knife for breast improvement, she threatens Cary's life and confides information about Mark.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/pi7J440LPB8xe4Iy0xXEsJjiWHX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-02","episode_number":8,"episode_type":"standard","id":1373608,"name":"A Mouthful in Mexico","overview":"The forecast for Playa Del Carmen, Mexico says plenty of sun and tequila, until Brandi pushes Kameron overboard with an “impressive” novelty.  LeeAnne shares exhilarating news about her relationship with Rich.  And at an exotic underground cave dinner, Cary confronts LeeAnne about her dangerous threat, unleashing crossfire of accusations and denials between the wives.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/sJ6hCfVrLB6DxS5hx7HowehqYGS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-09","episode_number":9,"episode_type":"standard","id":1375107,"name":"You've Yacht To Be Kidding Me","overview":"More sun and tequila as the housewives keep the party going in the Mayan Riviera, Mexico.  Brand and Stephanie go undercover disguised as LeeAnne and D’Andra to swindle their room key in search of the “toy” that Kameron just loves to hate.  And it’s anchors away when their grand finale yacht trip sails into stormy waters as the truth comes out about vicious rumors LeeAnne and Cary have leveled at each other’s husbands.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/qyK1bW6sMX7zPN4eEY1DEhxRMZl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-16","episode_number":10,"episode_type":"standard","id":1380652,"name":"Don't Cry Over Shattered Glass","overview":"It's Brandi's annual holiday party and she finds herself center of the drama when LeeAnne reveals that Cary can't be friends with her and Stephanie anymore because of their behavior in Mexico. And when Brandi challenges her for an explanation, Cary sides with Kameron, infuriating Brandi so much, she blurts out a humiliating secret about Cary and Mark.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/kewNJM5vogELqt08eAtdah60ETG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-23","episode_number":11,"episode_type":"standard","id":1380982,"name":"Ladies Who Launch","overview":"It’s almost time for Kameron’s Sparkle Dog Launch Party and Dallas’ who’s who and best in show are dressed to the canines to step and repeat, get their first taste of the bright pink kibble, and even stop at the Pet Psychic for a quick read. But before we get there, D’Andra has a meeting at the cosmetics lab only to find out the main ingredient for her new snow algae skin care product won’t make the launch deadline, which will jeopardize Dee’s final decision to hand over the company. Meanwhile, LeeAnne has a meeting with Brandi, urging her to make Stephanie choose Brandi and loose Cary. And at the party, while Mark confronts LeeAnne about saying he frequents the gay bars, Cary confronts Brandi about telling everyone she was Mark’s nanny. Why is Brandi behaving more and more like LeeAnne?","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/eOHKuGK5whGloP1XtRZ1Iief7x3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-30","episode_number":12,"episode_type":"standard","id":1384145,"name":"The Beginning of the End","overview":"It’s LeeAnne and Rich’s engagement party and everyone is coming, even LeeAnne’s mother, just in time to try and resolve a lifelong misunderstanding. D’Andra must face Dee and accept the consequences of failing to complete her new product on time. Cary and Stephanie try to make Brandi see the negative effect LeeAnne is having on her—the way LeeAnne has pitted all of them against each other. As Brandi begins to see the light, it sets the stage for a truly shocking turn of events that might spell destruction for this group of friends.","production_code":"","runtime":null,"season_number":2,"show_id":39283,"still_path":"/cue13DeVDB5a4Ji2lNTEgDkrpkN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-06","episode_number":13,"episode_type":"standard","id":1391366,"name":"Reunion Part One","overview":"The Real Housewives of Dallas reunite for a dramatic two-part reunion. As D’Andra dances a fine line between loyalty and accountability, Stephanie gives her two cents on Two-Face, and Kameron’s bitter taste for raunchy humor resurfaces. Cary and Brandi lock horns over plastic surgery allegations while a mystery guest causes LeeAnne to be anything but quiet on the set.","production_code":"","runtime":44,"season_number":2,"show_id":39283,"still_path":"/A98ESI6mKGnbim8tvkATt0IFXTm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-13","episode_number":14,"episode_type":"finale","id":1391367,"name":"Reunion (2)","overview":"Cary and Mark addresses the rumors about their marriage; D'Andra and Kameron share their biggest regrets about the season; Stephanie shares her concerns regarding a future with Brandi; LeeAnne reveals who will be invited to her wedding.","production_code":"","runtime":44,"season_number":2,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":90397,"poster_path":"/60FLYOKPPXzudNXnWWkaGKnPQPT.jpg","season_number":2,"vote_average":0},"3":{"_id":"5b74f2a0c3a3687545008193","air_date":"2018-08-15","episodes":[{"air_date":"2018-08-15","episode_number":1,"episode_type":"standard","id":1550419,"name":"Your Amygdala Is Showing","overview":"Brandi adopts a baby boy. LeeAnne blames her enlarged amygdala as the source of her sour disposition. Kameron's husband, Court, gives her an ultimatum. Cary and LeeAnne arrange a summit. D'Andra throws an anniversary party.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/vnRSs5hDaRYSOLwDQotL4GdM0tk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-08-22","episode_number":2,"episode_type":"standard","id":1556878,"name":"Bubbles and Brooding","overview":"Stephanie and LeeAnne make a connection at D'Andra's anniversary party. Cary is plagued by unpleasant childhood memories while living in her parent's house. Stephanie hosts a Bubbles & Bru party for Brandi revealing her adopted baby.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/knby7IQlCCgxw50K9conZHMYSQj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-08-29","episode_number":3,"episode_type":"standard","id":1560745,"name":"The Badger of Beaver Creek","overview":"Kameron invites everyone to fly to Colorado on the Wescott's private jet to stay at their luxury home. D'Andra and Brandi put their squabble on ice for the weekend. Kameron shames Stephanie for the white lies she told at Brandi's baby reveal.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/uSwvf6IQ6qDs8nuERxo1F1T8zOd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-05","episode_number":4,"episode_type":"standard","id":1564704,"name":"God Save the Queen, Bitch","overview":"The Beaver Creek trip continues, as Kameron and Stephanie feud over a miscommunication regarding Brandi's adopted baby. Cary tries to calm Kameron down but it's no use. Brandi pits D'Andra against LeeAnne in a pageant for the title of \"Queen.\"","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/pStMyTRGrPqcXM3UMybb6poFGbO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-12","episode_number":5,"episode_type":"standard","id":1570239,"name":"Rodeo Barbie","overview":"LeeAnne and Rich settle their marriage woes and vow to start the wedding planning process. Kameron prepares for the Global Pet Expo, despite her children's disapproval. Brandi plans a rodeo adventure for new bestie.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/Aafa4BJncVRTbiSkSXkTeQnrmg3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-19","episode_number":6,"episode_type":"standard","id":1574512,"name":"Smashing Friendships","overview":"Brandi gets a stressful visit from the social worker. Kameron leaves for the pet expo in Orlando. D'Andra gets closer to breaking away from her mother's company. LeeAnne dispenses a dose of tough love about how to downsize her fancy Dallas lifestyle.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/1UldoprZ6GXN3f6yV6qHdfI8bkl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-26","episode_number":7,"episode_type":"standard","id":1580656,"name":"Babes in Brandiland","overview":"Brandi invites all of the ladies to sip and spend at her Brandiland pop-up shop. Stephanie encourages the women to focus on self-care and hosts an epic spa day at her newly remodeled home. LeeAnne takes L'Infinite dress to the next level.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/acSpILJ2oY8bz8CybTEdkVbfG8h.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-03","episode_number":8,"episode_type":"standard","id":1585356,"name":"Off the Leash","overview":"LeeAnne tries to move forward with her wedding plans, but struggles without D'Andra by her side. D'Andra gets some startling news when she finally meets with Mama Dee to discuss the future of their company. Brandi gets a nanny.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/vUOD42jqTeuncfCZnyEhC7jgbYE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-10","episode_number":9,"episode_type":"standard","id":1592300,"name":"'80s Ladies","overview":"D'Andra and Brandi crash LeeAnne's charity event. Brandi learns that Cary betrayed her trust. Stephanie reaps the benefits of vaginal rejuvenation. LeeAnne questions Brandi's motives for adopting Bruin. D'Andra confronts LeeAnne about her wedding.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/7DRyREKACd4snzyMBeredFxesmZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-17","episode_number":10,"episode_type":"standard","id":1596676,"name":"Are You Saying I'm An Alcoholic?","overview":"LeeAnne tells Rich about her heated conversation with D'Andra. Mama Dee tells D'Andra to stop worrying about LeeAnne's wedding and pay more attention to the skin care empire. Brandi and Bryan share an intimate moment with their new baby boy.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/jOCnl0FWt5F1a8NTW12JcHct2Ec.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-10-24","episode_number":11,"episode_type":"standard","id":1596683,"name":"A Recipe for Disaster","overview":"D'Andra models in her “Hard Night Good Morning” photoshoot for photographer and hubby Jeremy. Cary plans a trip for the ladies to visit her family in Denmark. Stephanie prepares for Travis' trip to Harvard and their vow renewal, while bestie Brandi helps Travis shop for the ring. Mama Dee invites Kameron, LeeAnne and D'Andra for a day of Southern cooking at the lake. Kameron's mother-in-law offers D'Andra some hard-to-stomach advice that leads to an ugly showdown between the housewives.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":"/ogcuS99E3WDgJScD370r7EXJYf.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Assistant Camera","department":"Camera","credit_id":"61a5c9eebe4b360029b12595","adult":false,"gender":0,"id":2621359,"known_for_department":"Camera","name":"Peter J. Calvin","original_name":"Peter J. Calvin","popularity":0.84,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-10-31","episode_number":12,"episode_type":"standard","id":1602582,"name":"Where's Copenhagen?","overview":"Cary invites all the ladies to join her for a trip to Denmark; LeeAnne goes wedding dress shopping; Stephanie and Travis renew their vows; D'Andra hosts a pop-up event for her company, during which Brandi finds out what LeeAnne called her.","production_code":"","runtime":44,"season_number":3,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-07","episode_number":13,"episode_type":"standard","id":1614318,"name":"Something is Rotten in Denmark","overview":"Cary takes all the ladies to Copenhagen, Denmark to visit her relatives; D'Andra gets into heated arguments with Kameron and LeeAnne; Brandi's plan to get LeeAnne to admit she called her an alcoholic goes terribly wrong.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-14","episode_number":14,"episode_type":"standard","id":1620804,"name":"Growers and Show-ers","overview":"The trip to Copenhagen, Denmark, continues; Brandi confronts LeeAnne about the alcoholic accusations; D'Andra apologizes to Kameron; the ladies hit the town by land and by sea; Stephanie brokers a truce between D'Andra and LeeAnne.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-21","episode_number":15,"episode_type":"standard","id":1625474,"name":"Game of Phones","overview":"In Denmark, Brandi storms off during the final dinner, and D'Andra follows close behind; LeeAnne gets ready to unveil her \"L'Infinity\" dress; LeeAnne claims Brandi stole her phone on their last night in Denmark and that she cloned Brandi's phone.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-28","episode_number":16,"episode_type":"standard","id":1630340,"name":"Party Fouls","overview":"On the season finale of The Real Housewives of Dallas, LeeAnne picks a church and a date for her wedding, while Mama Dee officially signs over her company to D’Andra. Stephanie throws a college kegger for her husband Travis who is about to leave for Business school. There’s plenty of fun to be had playing beer pong, doing keg stands, and playing in a giant foam pit, but this kegger takes a turn when a conflict between LeeAnne and Brandi escalates.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-05","episode_number":17,"episode_type":"standard","id":1636201,"name":"Reunion (Part 1)","overview":"D’Andra drops a bombshell on Cary about an alleged plot to fat-shame her; Cary fires back by revealing a disparaging text D’Andra sent to Kameron; Stephanie talks about her struggles with depression; Kameron defends her behavior in Beaver Creek.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-12","episode_number":18,"episode_type":"finale","id":1640524,"name":"Reunion Part 2","overview":"Mama Dee Simmons joins the ladies in an attempt to help D'Andra and LeeAnne mend their friendship; Brandi accuses Kameron of being a liar; Kameron accuses D'Andra of being her mother's puppet; D'Andra reveals a previous stint in rehab.","production_code":"","runtime":null,"season_number":3,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":107934,"poster_path":"/o3no4ub6UANJN79p6Lf2zCHlmM9.jpg","season_number":3,"vote_average":0},"4":{"_id":"5d681551b7fbbd00121253c6","air_date":"2019-09-04","episodes":[{"air_date":"2019-09-04","episode_number":1,"episode_type":"standard","id":1906660,"name":"Of Friends and Frenemies","overview":"LeeAnne is overwhelmed by the planning of her wedding; D'Andra inherits the family business which isn't doing as well as she thought. Stephanie hosts a “Friendtervention” in an attempt to help mend fences between former besties LeeAnne and D'Andra.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-11","episode_number":2,"episode_type":"standard","id":1906661,"name":"Roasted and Toasted","overview":"In the aftermath of the Friendtervention, LeeAnne and D’Andra meet up to discuss their differences one-on-one; Brandi continues to struggle with her brooding daughter. D’Andra turns 50 and throws herself a rip-roaring roast party.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-18","episode_number":3,"episode_type":"standard","id":1933861,"name":"Donde Esta Margarita","overview":"D’Andra blows off a big business meeting with Travis because of a “hair emergency.” LeeAnne gets creative in order to afford her uber expensive couture wedding gown. The women all travel to Careyes, Mexico for some fun in the sun at Kary’s resort-like villa but things quickly take a turn when tensions rise between Kary and LeeAnne.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-25","episode_number":4,"episode_type":"standard","id":1938914,"name":"Trash Talk","overview":"Day two of the girls trip in Mexico kicks off with a polo match, a talking horse, cartwheels, and a lot of tequila, but Stephanie finds herself having a hard time finding the fun. Kameron and Brandi find themselves at odds over LeeAnne’s behavior. An explosive argument erupts when names are called and napkins are thrown.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-10-02","episode_number":5,"episode_type":"standard","id":1944754,"name":"Worst Vacation Ever","overview":"On the third day of the girls trip to Mexico, Stephanie confides in Kary about feeling overwhelmed by Kameron’s harsh comment to Brandi. Brandi and Kameron meet up beachside to discuss their issues. All the women get covered in mud and bond during a ceremonial sweat lodge experience. On their last night together, an unexpected argument breaks out between Brandi and LeeAnne.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":"/dsARVTPnt2eI02zL6vU0sL9qiW6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-10-09","episode_number":6,"episode_type":"standard","id":1949709,"name":"Cirque d' Lingerie","overview":"Upon returning back from their trip to Mexico, D’Andra seeks business advice from Travis. Kameron feels like a third wheel when it comes to the bond between her husband and daughter. LeeAnne kicks off the first of several pre-wedding celebrations with a lingerie shower, where Stephanie confronts Kameron about their issues in Mexico.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-10-16","episode_number":7,"episode_type":"standard","id":1954629,"name":"Ghost Busted","overview":"Brandi continues to attempt to bond with her daughter Brooklyn, while Stephanie and Kameron try to work things out after their dust-up at LeeAnne’s lingerie shower. Kary confronts LeeAnne about D’Andra, and all the girls go ghost hunting at a real haunted house, but find themselves haunted by ghosts of the past.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-10-23","episode_number":8,"episode_type":"standard","id":1962299,"name":"Guess Who's Coming to Happy Hour?","overview":"A death in the family has Brandi hosting a funeral for a beloved Redmond, while Mama Dee refuses to help D’Andra with the failing family business. Kameron spins in circles when two of the ladies back out of her couples shower for LeeAnne. But Kameron sends everyone spinning, when she crashes Kary's girls night with other uninvited guests in tow.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-10-30","episode_number":9,"episode_type":"standard","id":1971702,"name":"A Mother of a Day","overview":"Kary decides to attend LeeAnne’s wedding, despite their fractured friendship. While Brandi continues to clash with her daughter Brooklyn, she receives shocking news about another baby up for adoption. D’Andra joins forces with husband Jeremy to confront Mama Dee about her failing company, while LeeAnne worries her mother might make a scene at her wedding.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-11-06","episode_number":10,"episode_type":"standard","id":1977710,"name":"My Big Fat Dallas Wedding","overview":"LeeAnne and Rich finally tie the knot, and her wedding reception leaves everyone hungry for more. Brandi tries to convince Bryan to say “I do” to adopting Bruin’s sibling. Kary and Eduardo engage in a power struggle over dinner, and Stephanie invites all the women to accompany her to Thailand.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-11-13","episode_number":11,"episode_type":"standard","id":1983338,"name":"My Life on the Dee List","overview":"Kameron tries to impress her daughter with a bow and arrow, while Kary has her first photoshoot for her jewelry line. Stephanie throws husband Travis a mid-life crisis themed 50th birthday party. Things get crazy when Mama Dee appears to crash the party and one of the ladies refuses to attend. The ladies leave for Thailand, with LeeAnne hoping this trip will finally be a positive one for her.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-11-20","episode_number":12,"episode_type":"standard","id":1990878,"name":"Babes in Thailand","overview":"The Dallas ladies’ first day of the trip is jam-packed as they explore all Thailand has to offer. But it’s not all fun and leisure, LeeAnne and Kary remain at odds, and when D’Andra shows up to dinner wearing LeeAnne’s L’Infinity Dress as a joke, LeeAnne thinks it’s no laughing matter.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-04","episode_number":13,"episode_type":"standard","id":2006402,"name":"One Fight in Bangkok","overview":"A close encounter with rescued elephants is a uniquely bonding experience for everyone. An exotic outdoor market proves to be a nose-holding experience, while a condom-themed restaurant is an eye-opening one. A trip to the infamous “Red Light District” shocks and surprises, leaving LeeAnne and Kameron at odds.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-11","episode_number":14,"episode_type":"standard","id":2012743,"name":"Triggered in Thailand","overview":"In the aftermath of their trip to the Red Light district, LeeAnne turns on Kameron, making her wonder if her reputation in Dallas will be tarnished. Travis arrives to find Stephanie romancing someone else, and conflict between LeeAnne and Kary, leaves everyone shocked and stunned.","production_code":"","runtime":null,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-18","episode_number":15,"episode_type":"standard","id":2022190,"name":"Remember The Alamo","overview":"Upon returning from their turbulent trip to Thailand, Brandi throws a party to celebrate the one-year anniversary of Bruin's adoption; Kary confronts LeeAnne after learning about the ugly things she said about her.","production_code":"","runtime":44,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-25","episode_number":16,"episode_type":"standard","id":2034302,"name":"Reunion (1)","overview":"The ladies rehash their wild trip to Mexico; tensions run high as Kameron and Stephanie discuss their complicated relationship; the drama continues as LeeAnne tries to answer burning questions about her unconventional wedding.","production_code":"","runtime":44,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-01-08","episode_number":17,"episode_type":"finale","id":2043333,"name":"Reunion (2)","overview":"In the supersized second part of the reunion, the women discuss the highs and lows of their trip to Thailand, including LeeAnne's L'Infinity dress debacle and the controversial visit to the Red-Light District. Emotions run high when questions about LeeAnne's shocking remarks towards Kary turn into a heated argument between LeeAnne and the whole group.","production_code":"","runtime":44,"season_number":4,"show_id":39283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":131218,"poster_path":"/vyzLarAGtgqfojTqynZT52DSwlD.jpg","season_number":4,"vote_average":0},"5":{"_id":"5fd5f663c8a5ac0041f97cb7","air_date":"2021-01-05","episodes":[{"air_date":"2021-01-05","episode_number":1,"episode_type":"standard","id":2556361,"name":"Bursting the Quarantine Bubble","overview":"With the stay-at-home order finally lifted, the divas of Dallas are ready to make the most of their quarantine bubble, as safely as possible. Kameron gets a new dog and hosts a socially distanced garage sale. Brandi looks for ways to make amends after a controversial video resurfaces on social media, and D’Andra introduces everyone to her friend, Dr. Tiffany Moon.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/1EdPEciSWUzbB7I0cgZwLUaKxdb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-12","episode_number":2,"episode_type":"standard","id":2622716,"name":"You Dim Sum, You Lose Some","overview":"Kameron spars with a controlling Court, who refused to keep her informed about their house-selling process. D’Andra sees her Shaman and reveals that her step mother, whom she hasn’t spoken to in 16 years, has recently reached out to her. Kary’s daughter Olivia comes home from college in Los Angeles suffering from stress and anxiety. Tiffany throws a Dim Sum brunch and finds herself going head to head with Kameron.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/eeMX0HhntVv8R1A0c4VsHsCUStr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-19","episode_number":3,"episode_type":"standard","id":2646735,"name":"Kary'd Away","overview":"Stephanie starts a charitable foundation and encounters nothing but resistance from Travis, while Tiffany’s demanding mother makes her feel like nothing she does is ever good enough. Kameron hosts an outrageous party for Kary’s 50th birthday, where Tiffany and Kameron spar over chicken feet and things get out of hand after a night of drinking.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/AmReL4jdrk6g9cjl5HmOrAzvjs4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-26","episode_number":4,"episode_type":"standard","id":2670459,"name":"Whine Connoisseurs","overview":"D'Andra plans a day trip to a winery to celebrate Brandi's birthday, but when Kary criticizes her planning skills, the two of them nearly come to blows. Tiffany gives her daughters a glimpse into her life as a doctor, Kary checks in with Olivia about her depression, and Stephanie bonds with her mom after making a surprising bet with Travis.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/riuPBPbUVcwm4JP5Ki9wRtbbX6i.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-02","episode_number":5,"episode_type":"standard","id":2694474,"name":"Sour Grapes","overview":"Brandi’s birthday trip to Grapevine continues as D’Andra and Kary spar over their fractured friendship, while Kary accuses Tiffany of being a hypocrite. “Pickle shots” flow at a local bar where Brandi teaches the ladies some signature dance moves, and a souvenir store inspires Stephanie to go on a spanking spree.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/m7Gku0I0f9XZDWJHT6U1IQHat43.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-09","episode_number":6,"episode_type":"standard","id":2709634,"name":"Another One Bites the Crust","overview":"Tiffany throws an intimate pizza party in an attempt to get closer to the other women, but her obsession with rules and an ill-timed prank only push them further away. Stephanie goes over-budget on her first charity project, Kameron's dog trainer stops by for an \"accountability meeting,\" and D'Andra consults her shaman about the best way to deal with Kary.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/nujOaysTUXBxkmu8lTSKBnBmDsF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-02-16","episode_number":7,"episode_type":"standard","id":2727556,"name":"Getting Weird in Austin","overview":"Tiffany finds out that her pizza party left a bad taste in everyone’s mouth, and worries about her upcoming meeting to reduce her work hours. The ladies hit the road on a rock & roll tour bus to spend the weekend at a fabulous estate in Austin. It’s all fun and games until Kary eavesdrops on D’Andra bad mouthing her behind her back.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/ph9AVaGcHEpwGuJE7GEtt1vHgSk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-02","episode_number":8,"episode_type":"standard","id":2760837,"name":"Austin, We Have a Problem","overview":"In part two of the trip to Austin, D’Andra and Kary finally find common ground – even if it is on the water. Tiffany bonds with Stephanie and Kameron, while Brandi finds herself walking on eggshells around Tiffany and confronts her about feeling like she can’t be herself around her.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/zv6Ro6tRWiYwR03KP88JwJJV5Vi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-09","episode_number":9,"episode_type":"standard","id":2777712,"name":"The Doctor Is Out","overview":"Tiffany leaves Austin without telling anyone after an altercation with Brandi. Stephanie shares her own mental health journey with Kary's daughter Olivia, Momma Dee weighs in on the shenanigans in Austin, and D'Andra invites the women to an evening of meditation and spiritual healing with her shaman, Darrin.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/b9ANKbRyjlmcpep4dAsfLOG8hM0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-16","episode_number":10,"episode_type":"standard","id":2792987,"name":"A Simmons by Any Other Name","overview":"D’Andra’s Medicine Monday leaves Brandi feeling like she betrayed her religious beliefs. Tiffany has a big meeting with her boss to reduce her work hours, while Kameron lays down the law with Court about their house hunting. At Tiffany’s birthday party, Brandi challenges D’Andra’s commitment to Christianity and Mama Dee reveals the reason why D’Andra changed her last name to Simmons.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/78yPT3gn5aPj4Bi2k1gxCGgGqyT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-23","episode_number":11,"episode_type":"standard","id":2809298,"name":"Mommy Dearests","overview":"D'Andra makes amends to Momma Dee on the heels of their epic fight, while Kary bonds with her daughters on a hike and Stephanie unveils her first locker room project for charity. When Tiffany hosts an elegant luau to make up for her disastrous pizza party, Brandi and D'Andra clash over what it means to be a \"real\" Christian.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/pQEUTAa8lwXbsGYc3vqcjJKuS8L.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-03-30","episode_number":12,"episode_type":"standard","id":2833998,"name":"RV Having Fun Yet?","overview":"Tiffany seeks guidance from Momma Dee after a stilted encounter with her own mother, while Court gives Kameron the surprise of a lifetime. Stephanie plans a trip to Oklahoma, but her efforts are in jeopardy when a surprise article in the press causes Brandi and D’Andra to be at odds.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/9A6Kjl36JSHkDlaYejVDclFUT0l.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-06","episode_number":13,"episode_type":"standard","id":2851020,"name":"Bigfoot, Bigger Drama","overview":"Brandi reluctantly forgives D’Andra and the ladies head to Oklahoma for a weekend of camping. With the help of Charles, a local hunter, they set out on a mission to find Bigfoot, but things quickly heat up when Kary starts insulting their host, putting her and Stephanie at odds.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/81X4xFNrbPIgRhgFRIt1nENmeT1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-13","episode_number":14,"episode_type":"standard","id":2862416,"name":"A Doggone Mess","overview":"Stephanie plans a series of childhood games for the ladies to partake in but an unforeseen visitor catches Kary off guard. D’Andra receives a shocking letter from her estranged stepmother, while Kameron hosts a séance to communicate with her dog Louis. Tiffany finally confronts her mother about her feelings and is brought to tears by her unexpected response.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/8BzpM7LyMrE3sa3IImdYH1eqBTr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-20","episode_number":15,"episode_type":"standard","id":2886782,"name":"Straight Outta the 80s","overview":"Tiffany finally finds the balance she’s been searching for, while Kary continues to work through her own family issues. With help from her shaman, D’Andra meets up with her stepmother, but Momma Dee has few choice words about this family reunion. The ladies visit the legendary Southfork Ranch, home of the hit TV series Dallas, but their night of 80s fun mysteriously turns upside down.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/kYOY2LLBQbbJWZr1Gicea9sLHQY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-27","episode_number":16,"episode_type":"standard","id":2900994,"name":"Southfork Goes South","overview":"Recreating the infamous “Who Shot J.R.?” moment from the hit series Dallas, the ladies try to solve the mystery of \"Who Shot Brandi?\" The husbands join their wives for a day of fun and armadillo racing, but the absence of Eduardo proves too much for Kary to handle. A night of partying turns destructive when Kary and Brandi break into the iconic J.R. Room, causing the other ladies to confront them about their behavior.","production_code":"","runtime":null,"season_number":5,"show_id":39283,"still_path":"/712G3EkfZ630lcxGtGYbP5b9Waj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-04","episode_number":17,"episode_type":"standard","id":2900995,"name":"Reunion (1)","overview":"A COVID scare keeps two of the housewives from appearing in-person; Kary drops a bomb about her marriage; Kameron brings a suitcase of evidence to try to prove that Tiffany is three-faced after going to war with her on social media.","production_code":"","runtime":44,"season_number":5,"show_id":39283,"still_path":"/nZ3zRC5vCsI9bdmXUTUnAx03Knw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-11","episode_number":18,"episode_type":"finale","id":2922551,"name":"Reunion (2)","overview":"In the conclusion of The Real Housewives of Dallas season 5 reunion, Tiffany and Kameron spar over chicken feet, cultural stereotyping, and their social media war. D’Andra defends her name change and reveals shocking new facts about the battle over her inheritance. Brandi talks candidly about her unexpected pregnancy, her missteps with Tiffany, and her husband’s recently surfaced betrayal.","production_code":"","runtime":44,"season_number":5,"show_id":39283,"still_path":"/SHqLNP5tQh8Qh9vnUzt6icwCrH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":172010,"poster_path":"/3sbT7nty9mwgzLPFU5jrtr0uofV.jpg","season_number":5,"vote_average":0}}}