{
    "adult": false,
    "backdrop_path": "/oG4K2smrj7ZBK6MdXCCZogsXKGM.jpg",
    "created_by": [],
    "episode_run_time": [
        43
    ],
    "first_air_date": "2011-05-24",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        },
        {
            "id": 18,
            "name": "Drama"
        }
    ],
    "homepage": "http://www.mtv.co.uk/shows/geordie-shore",
    "id": 39416,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2024-03-12",
    "last_episode_to_air": {
        "id": 5097037,
        "name": "Episode 10",
        "overview": "",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2024-03-12",
        "episode_number": 10,
        "episode_type": "standard",
        "production_code": "",
        "runtime": null,
        "season_number": 24,
        "show_id": 39416,
        "still_path": null
    },
    "name": "Geordie Shore",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 488,
            "logo_path": "/w4qtv7xBkSVsbOQdSzjUjlyOuSr.png",
            "name": "MTV",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 222,
    "number_of_seasons": 24,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Geordie Shore",
    "overview": "Geordie Shore is a British reality television series broadcast on MTV. Based in Newcastle upon Tyne, it premiered on 24 May 2011, and is the British spin-off of the American show Jersey Shore. \"Geordie\" is the regional nickname and dialect given to the people of the Tyneside area of North East England, and is closely associated with the city of Newcastle upon Tyne and its environs where the show is set. However the show includes cast members from various parts of North East England.",
    "popularity": 37.552,
    "poster_path": "/7lmy3PUQ030u6PvIFdScXy5p6hI.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "CH",
            "name": "Switzerland"
        },
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        },
        {
            "iso_3166_1": "US",
            "name": "United States of America"
        }
    ],
    "seasons": [
        {
            "air_date": "2011-08-23",
            "episode_count": 8,
            "id": 50824,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2011-05-24",
            "episode_count": 10,
            "id": 50825,
            "name": "Season 1",
            "overview": "The first series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 24 May 2011 on MTV. The series concluded on 12 July 2011 after 6 episodes and 2 specials including a reunion show hosted by Russell Kane and an episode counting down the best bits of the series. From 23 August 2011 until 30 August 2011, 2 Magaluf specials aired on MTV, however these episodes are featured on the series 2 DVD. The series included Holly's turbulent relationship with Dan coming to an end, the beginning of Gaz and Charlotte's ongoing love/hate relationship, and Jay and Vicky's rocky relationship. This was the only series to feature Greg Lake.",
            "poster_path": "/iXYsS6H5JKSN8EFiW7n6hfXWEWQ.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2012-01-31",
            "episode_count": 10,
            "id": 50826,
            "name": "Season 2",
            "overview": "The second series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 31 January 2012 on MTV. The series concluded on 3 April 2012 after 8 episodes and 2 specials including a reunion show presented by Russell Kane and an episode counting down the best bits of the series. This was the first series to feature Rebecca Walker and Ricci Guarnaccio. The series featured Sophie and Joel's rocky relationship coming to an end, Vicky being torn between her boyfriend Dan and new cast member Ricci, Charlotte admitting she's finally had enough of seeing Gaz with other girls, and the beginning of Holly and James.",
            "poster_path": "/caJ86GRV3unr7XrZq9C39AI0NEF.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2012-06-26",
            "episode_count": 8,
            "id": 50827,
            "name": "Season 3",
            "overview": "The third series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 26 June 2012 on MTV. The series concluded on 28 August 2012 after 8 episodes and 2 specials including a best bits episode and an episode counting down the top 10 moments from the series. This series is also known as Chaos in Cancun as it is the only series to be filmed in Cancún, Mexico, and it is the last series to feature Jay Walker until his return in series 6 and Rebecca Walker. This series featured Vicky and Ricci's relationship on the rocks before they finally got engaged, Holly and James growing closer when James breaks his leg, and more bickering and flirting between Gaz and Charlotte.",
            "poster_path": "/kUMXAYQ5PLXnMqRpf3isttSVSC.jpg",
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2012-11-06",
            "episode_count": 8,
            "id": 50828,
            "name": "Season 4",
            "overview": "The fourth series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 6 November 2012 on MTV. The series concluded on 18 December 2012 with a double bill after 8 episodes, the series ended on a double bill to avoid the final episode airing on Christmas Day. This was the first series to feature Daniel Thomas-Tuck and Scott Timlin and is the highest rated series to date with 4 episodes receiving over 1,000,000 viewers. The series includes Vicky and Ricci's ongoing arguments continue to the point of the engagement being temporarily called off, James leaving Holly distraught by the announcement of him having a girlfriend, and a huge bust-up between Vicky and Sophie which has the whole house divided.",
            "poster_path": "/7GVqu2kwpRDUo6wW3QQpXP4vBNV.jpg",
            "season_number": 4,
            "vote_average": 10
        },
        {
            "air_date": "2013-02-19",
            "episode_count": 9,
            "id": 50829,
            "name": "Season 5",
            "overview": "The fifth series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 19 February 2013 on MTV. The series concluded on 16 April 2013 after 8 episodes and a special episode counting down the best bits from the series. This series was filmed in Newcastle upon Tyne with the cast visiting various locations around Europe, including Amsterdam, Barcelona, Prague and Tignes.",
            "poster_path": "/vyCaRPPh2VNPAEOmDJSTTCUIiXu.jpg",
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2013-07-09",
            "episode_count": 8,
            "id": 50830,
            "name": "Season 6",
            "overview": "The sixth series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 9 July 2013. Filming began for this series in April 2013 and concluded in May. This is the only series to be filmed in Australia and saw the return of former cast member Jay Gardner who had originally appeared in the show from series 1–3.The series began with the most viewed episode ever attracting 1,108,000, but was then beaten by the second episode with 1,133,000 viewers in total, however both figures were beaten later in the show's future, by many of the series 8 figures.",
            "poster_path": "/lvXOjExXjFvcRusCGrlua6gS24H.jpg",
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2013-09-17",
            "episode_count": 6,
            "id": 50831,
            "name": "Season 7",
            "overview": "The seventh series of Geordie Shore, a British television programme based in Newcastle upon Tyne, was announced on 5 July 2013 after cast members Holly Hagan and Vicky Pattison had been arrested for assault on a night out during filming. The series began on 17 September 2013, just three weeks after Series 6 had concluded. It was reported that filming for the series began on 26 June 2013 as the cast members had all been absent from Twitter since then. This was the last series to feature Sophie Kasaei after she was axed from the series following a racial slur. It was also the first series to feature Sophie's cousin, Marnie Simpson and included the brief return of Jay Gardner, who had previously featured in series one to three, and again during the sixth series for two episodes.",
            "poster_path": "/uh6ejv9sGrvPWDg0ZlUJfidwLjg.jpg",
            "season_number": 7,
            "vote_average": 0
        },
        {
            "air_date": "2014-07-22",
            "episode_count": 8,
            "id": 71511,
            "name": "Season 8",
            "overview": "The eighth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed in October 2013 after cast member Holly Hagan announced it on Twitter and is expected to air 22 July 2014.Filming began for this series on 25 March 2014. This series will be the first not to feature former cast member Sophie Kasaei after she was axed during the seventh series following a racial slur. All other cast members from the previous series return with the addition of new cast member Aaron Chalmers who had briefly appeared during series two of the show as a one-night stand of Holly's. In May 2014, Gaz announced that the series would begin in July.An exclusive first trailer for the series was released during an episode of Ex On The Beach on 3 June 2014. It was revealed on 10 June 2014 that another new cast member had joined, 21-year-old Kyle Christie.",
            "poster_path": "/lZ30EQ79CbuRU7zpl3g9Mv0Oalm.jpg",
            "season_number": 8,
            "vote_average": 0
        },
        {
            "air_date": "2014-10-28",
            "episode_count": 8,
            "id": 63214,
            "name": "Season 9",
            "overview": "The ninth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 12 July 2014, and began airing 28 October 2014. It was also announced that the cast would be travelling to Paris and Somerset. All cast members from the previous series returned. Ahead of the series launch, cast member Vicky Pattison announced that this would be her final series. She has featured in the show since the first series.",
            "poster_path": "/utqb8Dh8Y4wKQ3boyK99ZSu2zK1.jpg",
            "season_number": 9,
            "vote_average": 0
        },
        {
            "air_date": "2015-04-07",
            "episode_count": 8,
            "id": 65910,
            "name": "Season 10",
            "overview": "The tenth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 1 November 2014, and began airing on 7 April 2015. This will be the first series not to include original cast member Vicky Pattison after she departed at the end of the previous series. Ahead of the series it was confirmed that new cast members Chloe Etherington and Nathan Henry had joined the show.",
            "poster_path": "/f4KCrSajxVncj6Y8HoqzXPEjths.jpg",
            "season_number": 10,
            "vote_average": 0
        },
        {
            "air_date": "2015-10-20",
            "episode_count": 10,
            "id": 71476,
            "name": "Season 11",
            "overview": "The eleventh series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 23 May 2015 when it was confirmed that MTV had renewed the series for a further three series. The show began on 20 October 2015. This is the first series not to include original cast member James Tindale after he departed at the end of the previous series. Ahead of the series it was confirmed that the series would be filmed in Greece. In September 2015 when the series premiere was announced, it was confirmed that the cast members would air for 10 episodes, making it the longest series to date. It was also confirmed that the cast had travelled to Zante, Malia, Mykonos as well as Athens for the series.",
            "poster_path": "/cNWiNZhYK4Q7ifmx9EeitNXTCOG.jpg",
            "season_number": 11,
            "vote_average": 0
        },
        {
            "air_date": "2016-03-15",
            "episode_count": 8,
            "id": 75343,
            "name": "Season 12",
            "overview": "The twelfth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 23 May 2015 when it was confirmed that MTV had renewed the series for a further three series taking it up to the thirteenth series. The series was filmed in October and November 2015 and began airing on 15 March 2016. This will be the first series not to include Kyle Christie since he made his exit during the previous series, and will be the first to feature new cast members Chantelle Connelly and Marty McKenna, who had previously appeared during the third series of Ex on the Beach.",
            "poster_path": "/h7ZLdWT8Xbj6ae2UcmBst3cM1jW.jpg",
            "season_number": 12,
            "vote_average": 1
        },
        {
            "air_date": "2016-10-25",
            "episode_count": 10,
            "id": 76986,
            "name": "Season 13",
            "overview": "The thirteenth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 23 May 2015 when it was confirmed that MTV had renewed the series for a further three series, the eleventh, twelfth and thirteenth. The series was filmed in June and July 2016 and began airing on 25 October 2016. This will be the first series not to include Charlotte Crosby since she made her exit during the previous series. It also features the full-time return of former cast members Sophie Kasaei and Kyle Christie, who previously made a brief return during the Big Birthday Battle anniversary series. This series was filmed in various party islands including Kavos, Ibiza and Magaluf. On 24 June 2016, it was reported that Chantelle Connelly had quit the show halfway through filming, resulting in this series being her final one. On 27 September 2016, the previous reports were were confirmed with the announcement that Chantelle Connelly had quit the show mid-series.",
            "poster_path": "/b9gUzamrSHbUQ06851ZA4Ez38aZ.jpg",
            "season_number": 13,
            "vote_average": 0
        },
        {
            "air_date": "2017-03-28",
            "episode_count": 12,
            "id": 86426,
            "name": "Season 14",
            "overview": "Why-Aye! The Geordies are back home in Newcastle. It's gonna be another jaw-dropping season with new faces and new drama. Buzzin'!",
            "poster_path": "/2cDnsp1ePiHsh1xt1mPrNi2MAi0.jpg",
            "season_number": 14,
            "vote_average": 0
        },
        {
            "air_date": "2017-08-29",
            "episode_count": 9,
            "id": 91465,
            "name": "Season 15",
            "overview": "It's BAAAACK\n\nAfter putting eight wanna be radgies through their paces in season 14, Geordie Shore is returning for its 15th series - and only one lucky newbie has made the cut.\n\nAbbie Holborn joins original cast members Gary Beadle and Sophie Kasaei, as well as ol' favourites Marnie Simpson, Chloe Ferry, Aaron Chalmers, Nathan Henry, Marty McKenna and Scotty T for the latest round of trouble making in the toon.",
            "poster_path": "/fSBA8JZZxKdVsyLB0RmZ3FSsJLl.jpg",
            "season_number": 15,
            "vote_average": 0
        },
        {
            "air_date": "2018-01-09",
            "episode_count": 10,
            "id": 97696,
            "name": "Season 16",
            "overview": "The Geordies are back, and with two new members. Steph annoys Marnie as she has \"unfinished business\" with old flame Aaron. And Chloe and Abbie compete for the new boy's affections.",
            "poster_path": "/xglgI6f2CCApdWGVtwM12sq6CFa.jpg",
            "season_number": 16,
            "vote_average": 0
        },
        {
            "air_date": "2018-05-15",
            "episode_count": 12,
            "id": 103884,
            "name": "Season 17",
            "overview": "Geordie Shore has gone Down Under and we’ll soon get to see the results as the show returns to our screen with six new cast members and a shock return.\n\nIt’s been seven years since the much talked about programme made its debut on MTV and for its SEVENTEENTH series, the lads and lasses have swapped the banks of the Tyne for Australia’s Gold Coast.\n\nA pampered and preened bunch of Aussies are on hand to show them how to party across the other side of the world.",
            "poster_path": "/zYfTcHl0ZnFGB44FXTqCAljhspz.jpg",
            "season_number": 17,
            "vote_average": 0
        },
        {
            "air_date": "2018-10-16",
            "episode_count": 10,
            "id": 111166,
            "name": "Season 18",
            "overview": "",
            "poster_path": "/8CwgXBqQcb6R2s0Mrxd6xVZ6MpO.jpg",
            "season_number": 18,
            "vote_average": 0
        },
        {
            "air_date": "2019-04-09",
            "episode_count": 10,
            "id": 121599,
            "name": "Season 19",
            "overview": "",
            "poster_path": "/nPHHLqPUNIIIm1TCPRvGCABFZYH.jpg",
            "season_number": 19,
            "vote_average": 0
        },
        {
            "air_date": "2019-10-29",
            "episode_count": 10,
            "id": 134954,
            "name": "Season 20",
            "overview": "",
            "poster_path": "/zGQi9yZtJ6iK59YYnhjDtkzEAfm.jpg",
            "season_number": 20,
            "vote_average": 0
        },
        {
            "air_date": "2020-07-28",
            "episode_count": 8,
            "id": 157641,
            "name": "Season 21",
            "overview": "",
            "poster_path": "/lSQOq6nDkJd9wNh19zLuevNE155.jpg",
            "season_number": 21,
            "vote_average": 0
        },
        {
            "air_date": "2021-10-04",
            "episode_count": 10,
            "id": 218516,
            "name": "Hot Single Summer",
            "overview": "",
            "poster_path": "/bG3EudErhY4FmIu9uV8u0R2h2Xu.jpg",
            "season_number": 22,
            "vote_average": 0
        },
        {
            "air_date": "2022-09-20",
            "episode_count": 10,
            "id": 315555,
            "name": "The Reunion Series",
            "overview": "The twenty-third' season of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 15 February 2022, when Paramount+ introduced their new lineup of unscripted series and renewals for MTV Entertainment Studios, including the show's new spin-off, although they were scheduled to start in late 2020 and 2021 but have been postponed several times due to UK COVID-19 restrictions. Filming locations include a trip to the Algarve in Portugal, Ibiza and Newcastle upon Tyne. The first trailer for the season was released in late August 2022 and premiered later that year on September 20. This series appears as \"Geordie Shore: The Reunion Series\" and not as a spin off of the show. This series brings together the cast members to celebrate Geordie Shore's 10th anniversary.",
            "poster_path": "/7iYqRrmU9bkhrgxzWfSev9O7XVe.jpg",
            "season_number": 23,
            "vote_average": 0
        },
        {
            "air_date": "2024-01-09",
            "episode_count": 10,
            "id": 368804,
            "name": "Season 24",
            "overview": "",
            "poster_path": "/7lmy3PUQ030u6PvIFdScXy5p6hI.jpg",
            "season_number": 24,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "Drinking, clubbing, pulling, and tanning.",
    "type": "Reality",
    "vote_average": 6,
    "vote_count": 45,
    "season_data": {
        "1": {
            "_id": "5258f07e760ee346618fdf8b",
            "air_date": "2011-05-24",
            "episodes": [
                {
                    "air_date": "2011-05-24",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 867905,
                    "name": "Episode 1",
                    "overview": "It all kicks off when eight Geordies become housemates. Vicky can't decide if she prefers Jay or Greg, Charlotte tries her hardest to avoid Gaz's advances, Greg wants to leave and Holly, the only housemate in a relationship, is unfaithful within a few hours. But that, she'd argue, depends on your definition of the term unfaithful...",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": "/axrEOgKZilsiyQG7s4CeIWIWQSj.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-05-31",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 867906,
                    "name": "Episode 2",
                    "overview": "With Greg back on side, the Geordie Shore housemates are finally getting on... but how long can it last? Jay's aware that he's bitten off more than he can chew with Vicky, Holly tests her relationship boundaries even further, Charlotte fights off the continuing advances of Gaz, and Sophie gets the shock of her life when her parents turn up unannounced. All before last night's special friend has had time to leave...",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": "/tOeWJoyUCNbeNB6xAPImM2QKAfu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-07",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 867907,
                    "name": "Episode 3",
                    "overview": "It's Jay's birthday in Geordie Shore: Vicky plays the dutiful \"girlfriend\", Holly's boyfriend Dan makes a surprise visit and Charlotte loses her battle to fight off Gaz. But eight become seven as the house is rocked by a shock departure.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": "/eOzCknowCo3xid21czQrYCxw9JP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-14",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 867908,
                    "name": "Episode 4",
                    "overview": "When everyone realises that Holly's gone, the atmosphere in the house takes a turn for the worse. Vicky and Jay fall out as the \"no tashing elsewhere\" rule fails and Charlotte gives Gaz all the ammo he needs to play away from home. But how long can they all live apart? Especially when one more tries to leave Geordie Shore...",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": "/p0j5jPSfAt7bxovBVi2792u0B0L.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-21",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 867909,
                    "name": "Episode 5",
                    "overview": "There is a shock for the cast as Holly makes a surprise return to the Geordie Shore house, but not before Jay and Gaz face their toughest work assignment at a working man's club. Anna pushes Vicky too far with some salsa dancing and Holly's happiness is short lived as a late night phone call ends in heartbreak.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": "/5cKaFn1TCdYyVzQXZ0kIIxpCda8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-06-28",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 867910,
                    "name": "Episode 6",
                    "overview": "It's the final episode of Geordie Shore but there is certainly no fairy tale ending. Can Holly and her boyfriend Dan's 10 month relationship survive an altercation in the car park of an out of town shopping centre, Gaz gives Charlotte some serious news but is it what she was hoping for and for Jay and Vicky their relationship erupts in the most shocking way imaginable.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": "/vJlDacBtxSzj54cNEwxJau01P4W.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-05",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 867911,
                    "name": "The Reunion",
                    "overview": "The Geordie Shore cast are reunited along with friends, family, fans, and a few surprises to unravel the truths of those involved and hear the opinions of those who loved and loathed the show.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": "/glNyFHZEmBHCIYyRpHrpEZP7w8e.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-07-12",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 867912,
                    "name": "Best Bits",
                    "overview": "When girls and guys have 6 weeks to get on it in Newcastle, it's all about fit bodies, belting nights, and going out on the pull; and once you've gone Geordie, there's no going back.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-08-23",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1476006,
                    "name": "Magaluf Madness 1",
                    "overview": "The Geordie Shore cast are heading to Magaluf for their summer holidays where Jay and Gaz quickly make up for lost time with the ladies, and tensions explode with Char and Gaz resulting in a huge Geordie bust-up.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-08-30",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1476021,
                    "name": "Magaluf Madness 2",
                    "overview": "",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "The first series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 24 May 2011 on MTV. The series concluded on 12 July 2011 after 6 episodes and 2 specials including a reunion show hosted by Russell Kane and an episode counting down the best bits of the series. From 23 August 2011 until 30 August 2011, 2 Magaluf specials aired on MTV, however these episodes are featured on the series 2 DVD. The series included Holly's turbulent relationship with Dan coming to an end, the beginning of Gaz and Charlotte's ongoing love/hate relationship, and Jay and Vicky's rocky relationship. This was the only series to feature Greg Lake.",
            "id": 50825,
            "poster_path": "/iXYsS6H5JKSN8EFiW7n6hfXWEWQ.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5258f07e760ee346618fdf99",
            "air_date": "2012-01-31",
            "episodes": [
                {
                    "air_date": "2012-01-31",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 867913,
                    "name": "Episode 1",
                    "overview": "They may be back in Newcastle, but it's all change for Geordie Shore; Greg has left to find true love, Vicky and Sophie have pledged chastity to their new boyfriends, Gary promises Charlotte's Mum that he won't, Charlotte promises to do the ironing for a year if she does and James is nurturing a worldie-magnet comb-over. But with two new housemates ready to join the family, peace isn't set to last.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": "/a9mKHxozWhth24OZkYOfiWAJqM2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-07",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 867914,
                    "name": "Episode 2",
                    "overview": "Vicky and Ricci fall for each other, James struggles to neck on and Jay and Gary fight over Rebecca. But that's nothing when the house is rocked as Gary's nocturnal habits push Charlotte over the edge.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": "/aWCl93PgYJyVHL0jfVTfzCLKZ13.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-14",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 867915,
                    "name": "Episode 3",
                    "overview": "There's no time for the house to mourn Charlotte's departure as Vicky and Ricci's nocturnal spooning is interrupted by an unexpected visitor. Rebecca and Jay are still flirting outrageously whilst Gary and James are quick to get their kit off. Sophie has her heart broken and Holly is left reeling as James has the night of his life.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": "/y7YH3101Y36iHMOYhJiFEFkT4Xc.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-21",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 867916,
                    "name": "Episode 4",
                    "overview": "James continues his lucky streak with the ladies unlike unlucky in love Sophie who is played for a mug. Gary persuades Charlotte to return... but has she managed to get over him as she hoped? Rebecca lays her cards on the table with Jay, and Ricci and Vicky take things to the next level. After a big night out, Holly finally summons the courage to make a play for her man - but does she get what she wants?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": "/xPPt8od4o4g8C9DvkDdA4391WIw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-02-28",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 867918,
                    "name": "Episode 5",
                    "overview": "Tears consume Sophie after a surprise visit from her very own six-packed Adonis, but Charlotte and Vicky aren't going to let her steal the limelight and swiftly join her in heartbreak. The 'cheer us all up', party ends in carnage as Charlotte tries to move on, Vicky cements her future and the boys exchange blows.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": "/g7n5pick1Vf1SVnCf5mafBXOloQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-06",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 867917,
                    "name": "Episode 6",
                    "overview": "Disastrous consequences for Ricci and Gary rock the Geordie Shore house leaving Vicky and Charlotte stunned. Picking up the pieces, Sophie has a difficult decision to make whilst Charlotte learns Gaz's true feelings for her. With Jay and James about to have the night of their lives, the girls set off on a road trip tackling a colonic, Geordie Style, with it all ending in tears before bedtime. But Jay and James have other plans for bedtime.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": "/5uHOTR6fMCAIcrm7jQeMnFhKMQl.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-13",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 867919,
                    "name": "Episode 7",
                    "overview": "The honeymoon period is over as Vicky and Ricci split. Rebecca reveals her secret party trick, much to Jay's delight whilst Gary comes clean with Charlotte. Holly's Mum and Gaz' Dad make an appearance and the whole house falls out when the girl's jealous rage causes the boys to react. The house is at war once more.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": "/hZ02OvkaHU9PYis81EsmXixSHYM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-20",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 867920,
                    "name": "Episode 8",
                    "overview": "With only days to go until the end of the present series, hardly any relationships are left intact. Vicky and Ricci doggedly move on, Sophie gets dumped and Jay leaves an unpleasant taste in Rebeccas mouth. But its not long before most of them have made up as only they know how.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": "/gcS8y7S8zm1EMfzFk6JTdsAuIuW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-03-27",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 867922,
                    "name": "The Reunion",
                    "overview": "",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-04-03",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 867921,
                    "name": "Best Bits",
                    "overview": "",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "The second series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 31 January 2012 on MTV. The series concluded on 3 April 2012 after 8 episodes and 2 specials including a reunion show presented by Russell Kane and an episode counting down the best bits of the series. This was the first series to feature Rebecca Walker and Ricci Guarnaccio. The series featured Sophie and Joel's rocky relationship coming to an end, Vicky being torn between her boyfriend Dan and new cast member Ricci, Charlotte admitting she's finally had enough of seeing Gaz with other girls, and the beginning of Holly and James.",
            "id": 50826,
            "poster_path": "/caJ86GRV3unr7XrZq9C39AI0NEF.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5258f07e760ee346618fdfa7",
            "air_date": "2012-06-26",
            "episodes": [
                {
                    "air_date": "2012-06-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 867923,
                    "name": "Episode 1",
                    "overview": "It's time to swap the grey river Tyne for the crystal blue waters of Cancun, Mexico for the carnage of Spring break. Vicky and Ricci are loved up, Jay is missing the love of his life, Chloe and with Charlotte vowing to go nowhere near the parsnip and James refusing a repeat performance with Holly this is going to be one vacation they'll never forget.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 39416,
                    "still_path": "/p6JFQgRQiGjwDZ7Mal7nFH0pnqC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-03",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 867924,
                    "name": "Episode 2",
                    "overview": "With the house reduced to carnage and Sophie losing even more faith in back-at-home boyfriend Joel, there are still plenty of beaches to party on. Holly ups her game in the pursuit of James and shows that she can take rejection very badly. Charlotte and Gaz come to a major decision, and for Vicky and Ricci, the perfect relationship bubble, explodes. It all ends in tears.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 39416,
                    "still_path": "/fCJioplNVqqZegoxUCBd7WeXEbj.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-10",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 867925,
                    "name": "Episode 3",
                    "overview": "Sophie is elated as Joel surprises her with a visit. But will he be able to behave himself in paradise? The boys try out Mexican Wrestling but it all ends very badly for James who leaves in an ambulance. And with everyone fearing that his worldie mission may now be over, Holly moves in on her incapacitated prey.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 39416,
                    "still_path": "/7JCpLnW47RLruWB4ce19ZGcT1FU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-17",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 867926,
                    "name": "Episode 4",
                    "overview": "The chaos in Cancun continues as Gaz celebrates his birthday in true Geordie style with Charlotte taking her holiday romance to the next level and Volcano Vicky erupting as Cancun Chris gets sweet revenge sending her and Holly on a road trip from hell.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 39416,
                    "still_path": "/7In50K39E6yK0KY19xs7adlgbO9.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-24",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 867928,
                    "name": "Episode 5",
                    "overview": "Vicky and Ricci return to the house in time for Becca's birthday, which goes off in usual Geordie style. Cancun Chris penalises everyone for drinking his Tequila and Gary and Charlotte are sent off into deepest darkest Mexico to replace his valued drink. But with scorpions galore, will it turn out to be the sexy time Charlotte wants?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 39416,
                    "still_path": "/3pdy3uRt9iTrlfsIpiyd0Cdwx9P.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-31",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 867927,
                    "name": "Episode 6",
                    "overview": "Gary, jumps into yet another threesome and an unexpected phone call means James has to choose between his best mates and Holly.... For Charlotte, a night out trying to forget about Gary ends with disastrous results. The housemates are devastated as Sophie reveals that she wants to leave Mexico to return to boyfriend Joel in the UK.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 867930,
                    "name": "Episode 7",
                    "overview": "The boy, girl divide returns once more: Charlotte and Gaz aren't speaking, Becca and Jay are continually arguing and Holly and James' nurse patient relationship is back to a strictly professional level. But will Gaz's plans to cleanse the bad energy in the house really sort matters out? Meanwhile, Ricci and Gaz go shopping for an engagement ring for Vicky as the house finds out his plans.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-14",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 867929,
                    "name": "Episode 8",
                    "overview": "It's the final few days of Spring Break and the house is rocked by the loss of yet another member. In the last hours, to the disbelief of everyone, Ricci plans his proposal to Vicky, James and nurse Holly try out the suspension on the wheelchair and Charlotte clambers into bed with Gary. Down to the final five, Cancun has changed the Geordie Shore house forever.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "The third series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 26 June 2012 on MTV. The series concluded on 28 August 2012 after 8 episodes and 2 specials including a best bits episode and an episode counting down the top 10 moments from the series. This series is also known as Chaos in Cancun as it is the only series to be filmed in Cancún, Mexico, and it is the last series to feature Jay Walker until his return in series 6 and Rebecca Walker. This series featured Vicky and Ricci's relationship on the rocks before they finally got engaged, Holly and James growing closer when James breaks his leg, and more bickering and flirting between Gaz and Charlotte.",
            "id": 50827,
            "poster_path": "/kUMXAYQ5PLXnMqRpf3isttSVSC.jpg",
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "5258f07e760ee346618fdfb5",
            "air_date": "2012-11-06",
            "episodes": [
                {
                    "air_date": "2012-11-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 867931,
                    "name": "Episode 1",
                    "overview": "After a fun filled summer in Cancun the Geordie Shore gang are back in their playground and they are back with a bang. With two new spaces in the house it can only mean one thing, fresh meet for the family . They are all back for more obscene nights out as they are ready to take Newcastle by storm.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 10,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-11-13",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 867933,
                    "name": "Episode 2",
                    "overview": "It's time to get mortal as the Geordie Shore gang throw Ricci & Vicki an engagement party to remember. There'll be booze, banter & bucking aplenty as the Geordies party like only they know how, but when Charlotte decides it's the perfect opportunity to introduce her new boyfriend to the family, it turns into a night that everyone will remember for all the wrong reasons.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-11-20",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 867932,
                    "name": "Episode 3",
                    "overview": "With Ricci & Sophie having been asked to leave the house, the rest of the Geordie Shore gang decide a road trip to Liverpool is in order to check out the clubs and talent, but when James reveals a secret he's been keeping from the house and mortal Charlotte climbs into Gary's bed, it seems like everything is heading further south than they'd planned.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-11-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 867934,
                    "name": "Episode 4",
                    "overview": "The Geordie Shore house is a far from happy place with Vicky & Sophie still not talking and the rest of the house caught in the divide and whilst James can't wait to bring new girlfriend Kate into the family, its stormy seas ahead at the Shore when Charlotte confesses to her boyfriend about her late night visit to Gary's bed.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-12-04",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 867935,
                    "name": "Episode 5",
                    "overview": "Peace has finally been restored in the Geordie Shore house now that Vicky and Sophie have made up but, nothing lasts forever and when Ricci's green eyed monster sees red on a family night out, its disaster, not love, that's in the air.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-12-11",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 867936,
                    "name": "Episode 6",
                    "overview": "It's James' birthday and the Geordie Shore gang plan a surprise trip to Dublin to celebrate with an extra special secret guest, but on their return their Irish high is quickly brought down by Ricci's return with some devastating news.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-12-18",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 867937,
                    "name": "Episode 7",
                    "overview": "With Ricci gone from the Geordie Shore house, the rest of the gang are determined to keep Vicky's spirits up and the boys decide that what better way than a walk on the wild side and camping, but while the boys mock the girls in their far from natural habitat, they aren't laughing for long as on their return to civilisation, they find themselves at the mercy of a wild pack of women.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-12-18",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 867938,
                    "name": "Episode 8",
                    "overview": "It's all coming to an end in the Geordie Shore house with some keener to leave than others, but before they pack their bags, there's still time for a big blow out bash Geordie style and it seems like love is all around as those warm and fuzzy familiar feelings resurface once again.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "The fourth series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 6 November 2012 on MTV. The series concluded on 18 December 2012 with a double bill after 8 episodes, the series ended on a double bill to avoid the final episode airing on Christmas Day. This was the first series to feature Daniel Thomas-Tuck and Scott Timlin and is the highest rated series to date with 4 episodes receiving over 1,000,000 viewers. The series includes Vicky and Ricci's ongoing arguments continue to the point of the engagement being temporarily called off, James leaving Holly distraught by the announcement of him having a girlfriend, and a huge bust-up between Vicky and Sophie which has the whole house divided.",
            "id": 50828,
            "poster_path": "/7GVqu2kwpRDUo6wW3QQpXP4vBNV.jpg",
            "season_number": 4,
            "vote_average": 10
        },
        "5": {
            "_id": "5258f07e760ee346618fdfc0",
            "air_date": "2013-02-19",
            "episodes": [
                {
                    "air_date": "2013-02-19",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 867939,
                    "name": "Episode 1",
                    "overview": "The Geordie Shore gang are back in a pimped-up pad and ready to cause chaos once again. Its boys against girls as Charlotte and Holly form an alliance to take on the Buck Squad, while Boss Anna has a surprise in store for the family as she sends them on a European adventure that some of them may want to forget.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 867941,
                    "name": "Episode 2",
                    "overview": "The gang return from Amsterdam and it's time to tear Newcastle a new one. Vicky and Ricci celebrate breaking the Geordie Shore relationship curse at their one year anniversary dinner, but it's not all smiles as Holly and James still can't stand the sight of one another.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-05",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 867942,
                    "name": "Episode 3",
                    "overview": "There's tension in the Toon, as James brings girlfriend Kate on a night out with the gang, leaving Holly unimpressed. The Geordie Shore house explodes as Vicky and Ricci have a row to remember, Scott flips out, and Holly has to find a novel way to calm him down. And with all the chaos going on around them, Gary and Charlotte seem to think they're back in Amsterdam...",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-12",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 867943,
                    "name": "Episode 4",
                    "overview": "The gang are back on their Geordie Tour of Europe, and this time they're off to Prague for banter, birds, and booze galore. Chaos reigns as Gaz gets mortal and kicks off at Charlotte while booze also gets the better of Dan, who upsets Vicky and Ricci in the process. And as the boys get stuck into the local strip clubs, it's the girls getting their guns out for a change at the shooting range.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-19",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 867944,
                    "name": "Episode 5",
                    "overview": "The chaos continues as the gang return from Prague to a turbulent Toon. Holly and Kate come face to face on a night out, while Dan comes face to face with a ham sandwich and gets in a pickle with Scott. And the house is in total meltdown as Charlotte and Gary finally come to blows over their on/off relationship, and it looks like it could be the end for Vicky and Ricci.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-03-26",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 867945,
                    "name": "Episode 6",
                    "overview": "Charlotte returns to the Geordie Shore house just in time to join the rest of the gang on a Geordie Tour of Barcelona. There's booze and banter aplenty as Dan leads the lads on a night out, and with Ricci out of the picture, single Vicky leads a stag do on a sightseeing tour. And as our favourite Geordies bathe in the Spanish sun, sea, sex and sangria - Charlotte has a bombshell to drop on Gary...",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-02",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 867946,
                    "name": "Episode 7",
                    "overview": "The gang return from Barcelona with Charlotte's declaration of love for Gary still hanging in the air and Vicky set for a final showdown with Ricci. While James organises a day at a military boot camp, the girls decide to throw an American-themed house party, but it's anything but united as Charlotte gets into a state over Gary resulting in the biggest fight in Geordie Shore history...",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-09",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 867947,
                    "name": "Episode 8",
                    "overview": "Will the gang cool off after the biggest fight in Geordie Shore history, Charlotte finds herself in hot water with boss Anna, and there's a distinctly icy atmosphere between the boys and the girls as they all head off to the French Alps for their final Geordie Tour of the series.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-04-16",
                    "episode_number": 9,
                    "episode_type": "finale",
                    "id": 867940,
                    "name": "Best of Geordie Tours",
                    "overview": "A look back at the latest series of Geordie Shore with your favorite dysfunctional family. The gang also reveal what it was like to go through all the boozing and banter from their turbulant European tour.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "The fifth series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 19 February 2013 on MTV. The series concluded on 16 April 2013 after 8 episodes and a special episode counting down the best bits from the series. This series was filmed in Newcastle upon Tyne with the cast visiting various locations around Europe, including Amsterdam, Barcelona, Prague and Tignes.",
            "id": 50829,
            "poster_path": "/vyCaRPPh2VNPAEOmDJSTTCUIiXu.jpg",
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "5258f07e760ee346618fdfcb",
            "air_date": "2013-07-09",
            "episodes": [
                {
                    "air_date": "2013-07-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 867948,
                    "name": "Episode 1",
                    "overview": "They're back and this time the Geordies are heading down under and deep into the Bush! Sydney may be over 10,000 miles from Newcastle but nothing is going to stop the tashin' and partying and everything in between. Holly and James still haven't put their differences behind them and are a war zone waiting to happen, Gary and Scott are on a mission to pull every girl in Sydney, Vicky is newly single and is looking to leave Ricci firmly in the past, and Sophie's stuck in the middle as Charlotte's nowhere to be seen! Just another day for Geordie Shore!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Himself",
                            "credit_id": "565466079251417010003c98",
                            "order": 9,
                            "adult": false,
                            "gender": 2,
                            "id": 1540315,
                            "known_for_department": "Acting",
                            "name": "Jay Gardner",
                            "original_name": "Jay Gardner",
                            "popularity": 0.176,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2013-07-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 867949,
                    "name": "Episode 2",
                    "overview": "The group are in high spirits as a surprise visit from Jay means a few days of non-stop partying. Charlotte is still coming to terms with her feelings for Gaz, Vicky starts dating whilst James’ battle with Holly is set to continue. The competition for the title of ‘top shagger’ shows no sign of letting up as every girl in Sydney is on Scotty and Gaz’s radar and it looks like Gaz may have taken pulling to a whole new level!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Himself",
                            "credit_id": "565466079251417010003c98",
                            "order": 9,
                            "adult": false,
                            "gender": 2,
                            "id": 1540315,
                            "known_for_department": "Acting",
                            "name": "Jay Gardner",
                            "original_name": "Jay Gardner",
                            "popularity": 0.176,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2013-07-23",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 867950,
                    "name": "Episode 3",
                    "overview": "James and Gaz come to blows and the following explosive argument sees Gaz forced to leave the house. But is being banished such a bad thing? Gaz and Scotty avoid the punishment handed out to James and discover what’s really in the Australian bush. With the house to themselves Charlotte struggles, Sophie provides an intriguing revelation, Vicky tashes on and Holly gets up close and personal with the one and only Scotty T.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-30",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 867951,
                    "name": "Episode 4",
                    "overview": "Whilst the fittest guy in Australia sends the girls into a spin, Scotty and Gaz square up as nightclubbing gets nasty. House destruction sees Gary head into the bush, Charlotte have an epiphany, Vicky swoons and Scotty T enjoy his punishment just a little too much.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-08-06",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 867952,
                    "name": "Episode 5",
                    "overview": "Charlotte returns from the Bush a new woman. The housemates lay down the law for Scotty; slapping him with a drinking ban in the hope that he will stop smashing up the house. But with an upcoming house party and his birthday to celebrate, can he hold it together? Meanwhile, Fit Dan turns up to the house party and Vicky is not going to waste this opportunity. Holly gets cock fright, Sophie's perfect relationship reveals a crack and Charlotte and Gary experience the ultimate test.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-08-13",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 867953,
                    "name": "Episode 6",
                    "overview": "The Geordie Shore house is descending into chaos causing Sheep Steve to take drastic action. Charlotte turns psycho and wrecks the house whilst Holly strongly voices her opinion on Scotty T's latest conquest as the girls turn on him. With Sheep Steve having three housemates removed from the house, Scotty and Holly get much closer than Scotty thought they would as they head deep into the bush… And this time it's Vicky who gets it in the neck for her naughty behavior.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-08-20",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 867954,
                    "name": "Episode 7",
                    "overview": "James and Gary come to blows, sending shockwaves through the house. Charlotte's heart strings are pulled as she offers Gary support. A secret singles trip to the Whitsundays ends in disaster for the boys.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-08-27",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 867955,
                    "name": "Episode 8",
                    "overview": "As their time in Sydney comes to an end, the singles make it their mission to have a wild night out in the Whitsundays. Vicky and Fit Dan have a never ending date, Scotty sets out to find some company and an indiscretion from Gary sees him joining James in the Prison Hotel. And will Charlotte get closure once and for all?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 6,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 6",
            "overview": "The sixth series of Geordie Shore, a British television programme based in Newcastle upon Tyne, began airing on 9 July 2013. Filming began for this series in April 2013 and concluded in May. This is the only series to be filmed in Australia and saw the return of former cast member Jay Gardner who had originally appeared in the show from series 1–3.The series began with the most viewed episode ever attracting 1,108,000, but was then beaten by the second episode with 1,133,000 viewers in total, however both figures were beaten later in the show's future, by many of the series 8 figures.",
            "id": 50830,
            "poster_path": "/lvXOjExXjFvcRusCGrlua6gS24H.jpg",
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "_id": "5258f07e760ee346618fdfd6",
            "air_date": "2013-09-17",
            "episodes": [
                {
                    "air_date": "2013-09-17",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 867956,
                    "name": "Episode 1",
                    "overview": "Buzzing! The Geordies are back where they belong, in Newcastle, for a jaw-dropping summer season of partying, pulling, bucking, necking on and getting mortal. But just as they're settling back in to the house, there's a shock as stunning new girl Marnie arrives, determined to have fun, flirt with the boys and not care what the others think. She's Sophie's little cousin, but Charlotte, Holly and Vicky find it hard to welcome Marnie as she starts to break girl-codes and house rules. James keeps his distance while Scott and Gary need to decide if it's worth going there with their hot new housemate Marnie.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-09-24",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 867957,
                    "name": "Episode 2",
                    "overview": "The Geordies are back partying, pulling and tashing on in Newcastle, but they're still reeling from the explosive fallout following new girl Marnie's arrival. She's Sophie's little cousin, she doesn't care what anyone thinks, and she can't keep her hands off Scott. A big night out getting mortal brings the dream team of Gary and Scott back together, necking on and bucking as only they can, but it ends with Scott completely losing his cool and trying to smash the house up. Meanwhile Charlotte is devastated, cracking under the pressure of having a boyfriend in London while trying to party in the Toon with her Geordie mates. Vicky tries to help Holly get over her cock fright with a girls night out to see some male strippers, but there's more drama as Sophie tries to stop cousin Marnie upsetting the other girls.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-10-01",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 867958,
                    "name": "Episode 3",
                    "overview": "Buzzin'! It's Holly's 21st birthday, and the Geordies celebrate as only they know how - with a mint house party, getting mortal, and tashing on. Can Holly overcome her cock fright and get a birthday buck? Will James risk Holly's fury by bringing his girlfriend Kate to the party? How many girls can Gary bed at once? And why is Charlotte weeing in the boys' bin? Marnie necks on with a handsome partygoer, only to find out that it was one of Scott's best mates, and when Scott finds out, he goes on the rampage. Will things between Scott and Marnie ever recover? Meanwhile there's a tiny tragedy in the house, leading to an unexpected funeral on the beach.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-10-08",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 867959,
                    "name": "Episode 4",
                    "overview": "The Geordie Shore house is rocked to the core as Charlotte and Holly have an explosive falling out with new girl Marnie in a nightclub argument that gets way out of hand. There's more drama as Scott and Gary's friendship is pushed to the absolute limit when Scott discovers that Gary has taken flirting with Marnie to the next level. Jay makes a morale-boosting return, but can even the daddy of the group bring the house back together?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-10-15",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 867960,
                    "name": "Episode 5",
                    "overview": "There's an explosive situation to deal with as Marnie returns to the house following her nightclub fall-out with Holly and Charlotte. The girls can't deal with Marnie coming back, and the boys are left in shock as a fierce slanging match erupts. Is there any hope that the girls will ever make up? The Geordies head to London to get mortal in the capital, and everyone's wondering if Charlotte's London-based boyfriend Mitch will make a surprise appearance on their big night out. But the partying is destined to end in tears for Charlotte, as events take an unexpected turn and Charlotte and Holly's friendship is left hanging by a thread.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-10-22",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 867961,
                    "name": "Episode 6",
                    "overview": "The Geordies' raucous summer comes to a climax, with more getting mortal and necking on, and a final piece of high drama which leaves the house in a state of shock.   Gary and Holly are still furious at the way Charlotte's boyfriend treated her during their night out in London. But Charlotte doesn't want to hear anyone talking bad about her boyfriend, and things soon come to a head in dramatic fashion.   For the last night, Marnie shaves her fairy for Scott, after she decides she's going to put out if he behaves himself. But will they finally get together.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 7",
            "overview": "The seventh series of Geordie Shore, a British television programme based in Newcastle upon Tyne, was announced on 5 July 2013 after cast members Holly Hagan and Vicky Pattison had been arrested for assault on a night out during filming. The series began on 17 September 2013, just three weeks after Series 6 had concluded. It was reported that filming for the series began on 26 June 2013 as the cast members had all been absent from Twitter since then. This was the last series to feature Sophie Kasaei after she was axed from the series following a racial slur. It was also the first series to feature Sophie's cousin, Marnie Simpson and included the brief return of Jay Gardner, who had previously featured in series one to three, and again during the sixth series for two episodes.",
            "id": 50831,
            "poster_path": "/uh6ejv9sGrvPWDg0ZlUJfidwLjg.jpg",
            "season_number": 7,
            "vote_average": 0
        },
        "8": {
            "_id": "56279428c3a368278f0025a2",
            "air_date": "2014-07-22",
            "episodes": [
                {
                    "air_date": "2014-07-22",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1148938,
                    "name": "Episode 1",
                    "overview": "The Geordies are back and during their first night on the Toon getting mortal, Gaz arrives with a surprise: his name is Aaron, he's Gaz's mate, and he's the new lad in the Geordie Shore house. The house have a wild party to celebrate Gary's birthday with a good helping of tequila, mayhem and a couple of threesomes. Holly is missing Charlotte. She decides to get some animals in the house so that Charlotte will come back. So she gets some tortoises.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-07-29",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1177029,
                    "name": "Episode 2",
                    "overview": "Shirts are off and fists are about to fly after Gaz gets jealous when Marnie flirts with new boy Aaron. Everyone’s buzzin’ as Vicky returns to the house, and there’s the first ever Tash-On Tours as the Geordies put their own tequila-fuelled spin on singles nights.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-08-05",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1177030,
                    "name": "Episode 3",
                    "overview": "Charlotte is back! And her arrival couldn’t have come at a worse time, as she walks in on a double date and finds out all about Gaz getting with Marnie. New lad Aaron wins a date with Holly after completing her challenge but he reveals that he’s actually got a thing for Vicky.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-08-12",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1177031,
                    "name": "Episode 4",
                    "overview": "With Charlotte back in the house, all eyes are on Gaz and Marnie and whether they’ll decide to continue sleeping together. Charlotte is in tears after Gaz and Aaron blame her for creating a boy-girl divide, and the crew take Tash-On Tours to Manchester to share the Geordie approach to singles nights, getting mortal and necking on!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-08-19",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1177032,
                    "name": "Episode 5",
                    "overview": "Things kick off in the house as Aaron hears Vicky and the girls slagging him off on the eve of his third date with Vicky. And while the lads are out at work the girls get a massive surprise as new boy Kyle arrives to join the family.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-08-26",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1177033,
                    "name": "Episode 6",
                    "overview": "As the lads and lasses wake up and reflect on Kyle’s sudden arrival last night, the girls are hoping he won’t be sucked into being Gaz’s lapdog and Vicky regrets her cheeky tash on with Kyle.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-09-02",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1177034,
                    "name": "Episode 7",
                    "overview": "The group wake up in Iceland with mixed feelings. The girls are angry with the lads for ‘pie-ing’ them last night and pulling girls. Kyle and Holly get very flirty on a trip to the ‘Penis Museum’ and the Geordie Tours next stop is to an impressive geyser (that “smells like one of James’ protein farts!”)",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-09-09",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1177035,
                    "name": "Episode 8",
                    "overview": "Will Aaron and Marnie finally get together and will Gaz and Scott make up after Gaz broke his own Lad Code? Meanwhile Charlotte and Holly announce Geordie Shore’s first-ever wedding!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 8",
            "overview": "The eighth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed in October 2013 after cast member Holly Hagan announced it on Twitter and is expected to air 22 July 2014.Filming began for this series on 25 March 2014. This series will be the first not to feature former cast member Sophie Kasaei after she was axed during the seventh series following a racial slur. All other cast members from the previous series return with the addition of new cast member Aaron Chalmers who had briefly appeared during series two of the show as a one-night stand of Holly's. In May 2014, Gaz announced that the series would begin in July.An exclusive first trailer for the series was released during an episode of Ex On The Beach on 3 June 2014. It was revealed on 10 June 2014 that another new cast member had joined, 21-year-old Kyle Christie.",
            "id": 71511,
            "poster_path": "/lZ30EQ79CbuRU7zpl3g9Mv0Oalm.jpg",
            "season_number": 8,
            "vote_average": 0
        },
        "9": {
            "_id": "544d2f940e0a2608bb002a4e",
            "air_date": "2014-10-28",
            "episodes": [
                {
                    "air_date": "2014-10-28",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1013215,
                    "name": "Episode 1",
                    "overview": "There's a shock for the others when Vicky gets a promotion to team leader, or 'Boss Vicky' as she soon becomes known. She gets to choose who goes to work, but will she be able to keep everyone in check, and will she punish anyone who steps out of line?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1015059,
                    "name": "Episode 2",
                    "overview": "Boss Vicky takes the team to run their first Gay 'Tash-on Tours' job, with great success. But everyone is concerned about Charlotte when she reveals she isn't happy and that all is not well in her relationship with Mitch.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1017258,
                    "name": "Episode 3",
                    "overview": "They all head off to France without Marnie who hasn't returned to the house after kissing Kyle at Holly's house party. Kyle is left to bear the brunt of the anger from the lads in Paris.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1018673,
                    "name": "Episode 4",
                    "overview": "Vicky is in trouble with Boss Anna after making a mess of the Tash on Tours job in Paris. As a punishment Anna asks Vicky to make 200 origami swans for a Japanese-themed event. It's up to Vicky to get everyone to work together to make them, but Marnie decides she can't be bothered and sets herself on a collision course with Vicky.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1019781,
                    "name": "Episode 5",
                    "overview": "Marnie and Vicky's reconciliation is short lived when Vicky discovers Marnie's been lying to her all along. A tash on tours night in Charlotte's home town of Sunderland ends in disaster when Aaron sees Marnie and Scott getting way too close for his liking.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-02",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1021791,
                    "name": "Episode 6",
                    "overview": "The Geordies are heading out of the Toon and into the country to host a Tash on Tours night at Lakefest in Gloucestershire. Charlotte and Gaz have their first real test when Charlotte spots Gaz flirting with a girl at the hoedown...will she be able to hold back from turning into 'Psycho Charlotte' and will Gaz be able to prove to her that he really has changed?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-09",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1023407,
                    "name": "Episode 7",
                    "overview": "The ‘boyfriend club’ is well and truly up and running with Charlotte, Holly and Marnie all waking up in the boys' bedroom. Vicky’s feeling left out and missing her boyfriend James so the gang arrange a surprise visit for her...but will this make Vicky feel happier in the house or remind her of what she’s missing even more?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-16",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1025371,
                    "name": "Episode 8",
                    "overview": "Tis’ the season to get Mortal! It’s Christmas time in the Geordie Shore house and like every other family Christmas it’s not without its festive finger-blasting, tantrums round the tree and mayhem under the mistletoe. It’s James' birthday and the last Geordie Shore house party and in true style they certainly go out with a ‘bang’!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 9,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 9",
            "overview": "The ninth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 12 July 2014, and began airing 28 October 2014. It was also announced that the cast would be travelling to Paris and Somerset. All cast members from the previous series returned. Ahead of the series launch, cast member Vicky Pattison announced that this would be her final series. She has featured in the show since the first series.",
            "id": 63214,
            "poster_path": "/utqb8Dh8Y4wKQ3boyK99ZSu2zK1.jpg",
            "season_number": 9,
            "vote_average": 0
        },
        "10": {
            "_id": "552c7622c3a368619e001f65",
            "air_date": "2015-04-07",
            "episodes": [
                {
                    "air_date": "2015-04-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1053971,
                    "name": "Episode 1",
                    "overview": "Buzzin'! Our favourite party animals are back! When Charlotte finds out about a pact between Gary and Aaron she hatches a plan - but will she end up with egg on her face? Meanwhile James is having doubts about his future in the house.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-04-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1053957,
                    "name": "Episode 2",
                    "overview": "It's all change in the house as James makes a shock announcement and two new housemates come through the door. But the newbies' first night out is ruined when a huge fight breaks out between Charlotte, Marnie and Holly.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-04-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1053852,
                    "name": "Episode 3",
                    "overview": "It's the Newbies first morning in the house but with Holly, Kyle and Charlotte gone how will the family get back together? Holly opens her heart to Kyle but does he feel the same? And a shock revelation from Gary leaves Charlotte heartbroken.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-04-28",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1055359,
                    "name": "Episode 4",
                    "overview": "It's the day that Charlotte's been dreading, Gary introdices his new girlfriend to the family but will Psycho Charlotte put in an appearance? Meanwhile Marnie and Aaron get very flirty!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 39416,
                    "still_path": "/fzIZvk7XMjhn3krjEcesNfjxaI3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-05-05",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1057517,
                    "name": "Episode 5",
                    "overview": "Anna tells the Geordies she's got a job for them in another country leaving them all buzzing! That is until they turn up to a caravan site in Wales where Marnie decides to give Aaron some home truths.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-05-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1060786,
                    "name": "Episode 6",
                    "overview": "Hamburg is about to feel the full force of Tash on Tours, but are they ready for Marnie kicking off at Aaron?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-05-19",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1063300,
                    "name": "Episode 7",
                    "overview": "Newbie Chloe meets 'psycho Charlotte' after a night out goes sour, and Holly's return to the house is ruined when she's confronted with the true reason Kyle doesn't want to make their relationship official ... is it all over for them?!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 39416,
                    "still_path": "/ai9Q7mZrA7xZQmUlIvSnMaXtEOu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-05-26",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1067294,
                    "name": "Episode 8",
                    "overview": "Scotty T is back to 'jump start' the final episode with a dare-devil activity for his Geordie crew. Meanwhile, tensions run high as Holly waits to hear Kyle's decision.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 10,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 10",
            "overview": "The tenth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 1 November 2014, and began airing on 7 April 2015. This will be the first series not to include original cast member Vicky Pattison after she departed at the end of the previous series. Ahead of the series it was confirmed that new cast members Chloe Etherington and Nathan Henry had joined the show.",
            "id": 65910,
            "poster_path": "/f4KCrSajxVncj6Y8HoqzXPEjths.jpg",
            "season_number": 10,
            "vote_average": 0
        },
        "11": {
            "_id": "56241fd29251416b300020ae",
            "air_date": "2015-10-20",
            "episodes": [
                {
                    "air_date": "2015-10-20",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1147798,
                    "name": "Episode 1",
                    "overview": "The Geordies are back and buzzin' as big boss Anna sends them off to the home of kebab...Greece. Holly and Kyle kick off while Gaz and Charlotte find themselves in a very awkward situation.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-27",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1147805,
                    "name": "Episode 2",
                    "overview": "Big boss Anna sends the guys to their new home in Crete. Chloe wants to know where she stands with Scott. Charlotte and Marnie have some explaining to do after their first night in Malia.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-03",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1147793,
                    "name": "Episode 3",
                    "overview": "Gaz's pulling competition causes a bust up for Aaron and Scott. Charlotte tells Holly some home truths about Kyle while the toga party sees Chloe and Scott get closer than ever.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-10",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1135927,
                    "name": "Episode 4",
                    "overview": "The squad head back to Zante. Chloe causes carnage at the boat party while Kyle comes to a big decision over Holly. And when Marnie sees Kyle at the club, the simmering tensions boil over and it all kicks off.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-17",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1136170,
                    "name": "Episode 5",
                    "overview": "Gaz gives newly dumped Holly some tough love. Kyle enjoys his first lads' night until the girls turn up unannounced. Charlotte kicks off leaving the boys and girls torn apart.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-11-24",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1140132,
                    "name": "Episode 6",
                    "overview": "Kyle and Holly's split continues to divide the boys and girls. Scott upsets Chloe, Holly confronts Kyle while Charlotte goes to extraordinary lengths in search of a kebab.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-01",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1142176,
                    "name": "Episode 7",
                    "overview": "Chloe's attempt to get Scott's attention goes badly while the Holly and Kyle situation comes to a head as the boys come to blows with huge consequences for Holly and Kyle.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-08",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1144475,
                    "name": "Episode 8",
                    "overview": "After his dramatic exit, the Geordies come to terms with life after Kyle. Chloe's plan to make Scott jealous backfires and Charlotte gives Holly some very tough love.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-15",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1147308,
                    "name": "Episode 9",
                    "overview": "Zante. Chloe and Holly kick off before Chloe confronts Scott and lets slip how she truly feels. Meanwhile, Marnie gets an unexpected call while Nathan has some big news for the family.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-22",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1148085,
                    "name": "Episode 10",
                    "overview": "The Geordie Squad's big Greek adventure comes to a dramatic end. After Chloe dropped the L-bomb, Scott wants a word. There's a surprise arrival for one of the family and Marnie has some massive news.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 11,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 11",
            "overview": "The eleventh series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 23 May 2015 when it was confirmed that MTV had renewed the series for a further three series. The show began on 20 October 2015. This is the first series not to include original cast member James Tindale after he departed at the end of the previous series. Ahead of the series it was confirmed that the series would be filmed in Greece. In September 2015 when the series premiere was announced, it was confirmed that the cast members would air for 10 episodes, making it the longest series to date. It was also confirmed that the cast had travelled to Zante, Malia, Mykonos as well as Athens for the series.",
            "id": 71476,
            "poster_path": "/cNWiNZhYK4Q7ifmx9EeitNXTCOG.jpg",
            "season_number": 11,
            "vote_average": 0
        },
        "12": {
            "_id": "56e7e04192514109170021a5",
            "air_date": "2016-03-15",
            "episodes": [
                {
                    "air_date": "2016-03-15",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1175795,
                    "name": "Episode 1",
                    "overview": "The Geordies are back! Chloe turns on her charm to try to get with Scott. Holly has a huge secret but will she tell anyone? A shock new arrival sees the lads buzzin' and Chloe stressing.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 1,
                    "vote_count": 4,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-22",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1177038,
                    "name": "Episode 2",
                    "overview": "Charlotte finally turns up with some bunnies and some bigger news for Gaz. Will Holly share her secret? Aaron and Scott's dates with Chantelle end badly as the lads and Chloe all kick off.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-29",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1177039,
                    "name": "Episode 3",
                    "overview": "Charlotte gets the girls to go hard on Gaz, Scott drops the girlfriend bomb on Chantelle and Holly has a big bust up with Charlotte when she sees her kissing Chloe.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-05",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1177040,
                    "name": "Episode 4",
                    "overview": "With Holly away, Chloe and Charlotte's friendship goes next level. Chantelle's plan to test Scott goes badly wrong and Chloe is quick to take advantage.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-12",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1177041,
                    "name": "Episode 5",
                    "overview": "Boss Anna treats the Geordies with a trip to Hull.Gaz and Charlotte spend the night together, Chloe finally comes clean to Chantelle over what she gave Scott and it all Kicks off.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-19",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1177042,
                    "name": "Episode 6",
                    "overview": "Chloe is buzzin' when a new lad arrives. Marnie goes mental when a girl of Aaron's turns up and it kicks off again when the newbie drops Scott right in it with Chantelle.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-26",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1188932,
                    "name": "Episode 7",
                    "overview": "Marnie necks on with new lad Marty to teach Aaron a lesson. Charlotte's got Chloe's back when it all kicks off between the girls. Gary and Charlotte end up in bed causing ripples.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-05-03",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1190118,
                    "name": "Episode 8",
                    "overview": "It's the final episode. Gary returns and drops a bombshell. New boy Marty cant' get a stiffy with Chloe. Holly needs to make an all important decision and there's a shock exit!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 12,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 12",
            "overview": "The twelfth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 23 May 2015 when it was confirmed that MTV had renewed the series for a further three series taking it up to the thirteenth series. The series was filmed in October and November 2015 and began airing on 15 March 2016. This will be the first series not to include Kyle Christie since he made his exit during the previous series, and will be the first to feature new cast members Chantelle Connelly and Marty McKenna, who had previously appeared during the third series of Ex on the Beach.",
            "id": 75343,
            "poster_path": "/h7ZLdWT8Xbj6ae2UcmBst3cM1jW.jpg",
            "season_number": 12,
            "vote_average": 1
        },
        "13": {
            "_id": "5734904a92514140f0000001",
            "air_date": "2016-10-25",
            "episodes": [
                {
                    "air_date": "2016-10-25",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1192450,
                    "name": "Episode 1",
                    "overview": "The Geordies are back! After jetting off to Magaluf, Marnie and Holly are having issues while Marty opens up to Chloe. Things are going well until Chloe gets jealous and it all kicks off.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/olwhHtPXS9lMovvVrS1rrAydEiq.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-01",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1193812,
                    "name": "Episode 2",
                    "overview": "At a boat party in Ibiza, Aaron drop the G-bomb on Marnie, and single Gaz is back when he pulls Chantelle. But how will Holly react when she finds out?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/eE5KomfESbHfjM6TZSdsaMdjRuF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1195653,
                    "name": "Episode 3",
                    "overview": "Big boss Anna is fuming when the squad finally return from Ibiza. Marnie's plan to get Aaron's attention backfires and the couple reach crisis point when Nathan gets involved.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/tnDjF76iSnB0WEPu26j2hoAZVEC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-15",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1196556,
                    "name": "Episode 4",
                    "overview": "Chloe gets jealous of Holly and Marty and kicks off. Scott receives some big news and there's a shock arrival which has huge consequences for Gaz and Chantelle.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/biGhYfTaHi2o68uqdXMjM3baX5e.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-22",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1198273,
                    "name": "Episode 5",
                    "overview": "It's seriously awkward between Sophie, Gaz and Chantelle. Aaron finally returns but Marnie isn't happy. Chantelle and Marty clash over Chloe. Nathan takes getting mortal to the next level.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/2akG6NfgK00eDTswpyHjnwpp0Tw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-29",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1199426,
                    "name": "Episode 6",
                    "overview": "It's the morning after Chantelle's departure... Sophie gets some big news from boss Anna, Aaron ends up in an ambulance and Chloe goes all out to get over Marty at the pool party.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/5d6XODjl8G9ArWUd06UvVfHA5VH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-06",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1245402,
                    "name": "Episode 7",
                    "overview": "Marty ends up in hospital after the beach party. Meanwhile Boss Anna has some big news for Sophie, Nathan has an unusual plan to help Chloe, and Gaz comes to a decision over Charlotte.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/kNmnLr0rxUbzaKIcQ4x9yxXTcFa.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-13",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1246557,
                    "name": "Episode 8",
                    "overview": "It's Holly's birthday and she gets a massive surprise when Kyle shows up. Marty goes in on Chloe but takes it too far. Meanwhile, Aaron and Marnie's relationship reaches breaking point.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/fhgFowOTurUpqAs4ozAMGq4Zf7V.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-20",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1247652,
                    "name": "Episode 9",
                    "overview": "The Geordies reach boiling point...Marty tries to make it up to Chloe, but will she forgive him? And is there any way back for Aaron and Marnie after the previous night's break up?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/tqoB2cym9dlEKv5wORrDZ3OgLSs.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-27",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1249084,
                    "name": "Episode 10",
                    "overview": "In the series finale Chloe and Marty get flirty again, but can they really stay just good friends? Kyle gets some big news from Boss Anna, but the fallout will change the family forever.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 13,
                    "show_id": 39416,
                    "still_path": "/wDhQnWLv1cweMisjO9oig5mF79P.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 13",
            "overview": "The thirteenth series of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 23 May 2015 when it was confirmed that MTV had renewed the series for a further three series, the eleventh, twelfth and thirteenth. The series was filmed in June and July 2016 and began airing on 25 October 2016. This will be the first series not to include Charlotte Crosby since she made her exit during the previous series. It also features the full-time return of former cast members Sophie Kasaei and Kyle Christie, who previously made a brief return during the Big Birthday Battle anniversary series. This series was filmed in various party islands including Kavos, Ibiza and Magaluf. On 24 June 2016, it was reported that Chantelle Connelly had quit the show halfway through filming, resulting in this series being her final one. On 27 September 2016, the previous reports were were confirmed with the announcement that Chantelle Connelly had quit the show mid-series.",
            "id": 76986,
            "poster_path": "/b9gUzamrSHbUQ06851ZA4Ez38aZ.jpg",
            "season_number": 13,
            "vote_average": 0
        },
        "14": {
            "_id": "58d1b7939251411af40115de",
            "air_date": "2017-03-28",
            "episodes": [
                {
                    "air_date": "2017-03-28",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1290504,
                    "name": "Episode 1",
                    "overview": "The Geordies are back! Big Boss Anna shocks the Squad when she sends in some new workers to join them. The lads are excited but Sophie and Chloe aren’t so sure and things quickly go west.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/t7pmBtlvGUNNheO4pu7QcIrfU0k.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1299434,
                    "name": "Episode 2",
                    "overview": "Boss Anna's plan to find the best new Geordies continues. Aaron and Marty decide to get close to the newbies Sarah and Abbie. After her kick-off with Zahida, Chloe gets some big news. And the family is stunned when two more new workers arrive.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/tCidDSZO8wxKbpeJzHDhd0tKiIC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1302292,
                    "name": "Episode 3",
                    "overview": "Nathan's got a plan to test how radge the new workers are. Chloe returns, Marnie and Marty kick off over Aaron and there's a huge shock when the next newby arrives. Marty reaches out to Chloe who's having none of it.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/yhUNrThEfmrLNdPa2DFOmfVTUGL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1304467,
                    "name": "Episode 4",
                    "overview": "Marty's plan to win Elettra over with a new hair colour goes west. Marnie's worried she's sending out mixed signals to Aaron. And when a new radgie arrives Chloe is all over him.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/jLAreSf2xdQfQXGLKPCUbRdViOf.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1304534,
                    "name": "Episode 5",
                    "overview": "Marnie's excited when the next arrival turns up, until Aaron gets stuck in and leaves her with a big decision. Marty's desperate to step it up with Elettra but Chloe has other ideas.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/ilzP6GRAl4vzKMRFBbXU0UpcRlW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-02",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1308376,
                    "name": "Episode 6",
                    "overview": "The house is stunned to discover that Marnie left after Aaron and Chelsea got together. Elettra and Marty boot off over their hot tub frisk and Chloe pushes Marty to breaking point.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/2TTbPnq3shkEtOlsJB7AMcHnTuk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-09",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1308377,
                    "name": "Episode 7",
                    "overview": "Boss Anna sends the squad to the French Alps. Scotty T's back and immediately gets stuck into the newbies, and when Anna reveals her latest decision for the new workers Marty isn't happy.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/lu4gkcGMXDj6W8gp2TSzRfV7Mpp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-16",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1308378,
                    "name": "Episode 8",
                    "overview": "It's proper awks between the newbies, while Scotty T and Abbie begin to get closer. Zahida goes mental at Marty and Gaz gets his revenge on Sam. Marnie's back and gets properly mortal.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/sRgyvQiQLYVmhXkYtqKq8hDI9nb.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-23",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1308379,
                    "name": "Episode 9",
                    "overview": "It's the Squad's last days on the piste. After getting swilled by Marnie, Aaron is straight on the pull with wingman Gaz. It's pure awks between the newbies Abbie and Sarah over Scotty T and things get worse when he tries to crack on with Zahida.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/75I6OZMBjKGgBZXY0zdU81GPrYS.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-30",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1308380,
                    "name": "Episode 10",
                    "overview": "The Squad head back to the toon and give the newbies their most brutal initiation yet! Zahida and Scotty get closer but will they be able to keep it a secret? Boss Anna has some big news.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/o0jgExAxURD2HJkCxWmdzugwmPW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-06-06",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1308381,
                    "name": "Episode 11",
                    "overview": "Marty gets mortal and fancies a blast from the past... Sarah. But will Chloe be cool? Zahida tries to clear the air with Sarah and Abbie, but things quickly go west and it all kicks off!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/qxnNMTviXcf8A3xer2aDd6xO4br.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-06-13",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 1308382,
                    "name": "Welcome To The Family",
                    "overview": "The Geordies throw a huge house party for Nathan with an extra special cake. And it’s decision time for Boss Anna as she reveals whether Abbie, Sarah or Zahida joins the Geordie family for good.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 14,
                    "show_id": 39416,
                    "still_path": "/4k53rkODSw3pAaO3znFvypEcJ0r.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 14",
            "overview": "Why-Aye! The Geordies are back home in Newcastle. It's gonna be another jaw-dropping season with new faces and new drama. Buzzin'!",
            "id": 86426,
            "poster_path": "/2cDnsp1ePiHsh1xt1mPrNi2MAi0.jpg",
            "season_number": 14,
            "vote_average": 0
        },
        "15": {
            "_id": "599364fb925141542300481b",
            "air_date": "2017-08-29",
            "episodes": [
                {
                    "air_date": "2017-08-29",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1350150,
                    "name": "A Wasted Night In",
                    "overview": "The lads and lasses are back for an explosive new series and there is an old friend joining the family. It’s not long before the gang hit the toon and cracks start to show between old friends. Aaron has to choose between Marnie and his dream and Nathan and Chloe fall out over Marty. Scotty T is up to his old tricks of breaking hearts and Marty’s wild night out ends in tears… for Chloe.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 15,
                    "show_id": 39416,
                    "still_path": "/t8v2mg0UEuOspYlroy5f0HhlCr5.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-05",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1357320,
                    "name": "Dropping Like Flies",
                    "overview": "The house wakes up to Chloe and Nathan’s friendship in tatters, but Sophie thinks she has the answer to a happy family and brings in two new pets. The good times turn bad when the Chloe, Nathan and Marty triangle explodes into a fight and ends with someone deciding enough is enough.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 15,
                    "show_id": 39416,
                    "still_path": "/1Vs3ZHs2enB4Ote0T1f2EArhF2X.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-12",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1357321,
                    "name": "Gary's News",
                    "overview": "Marnie catches up with Aaron as his fight night gets closer. Marty decides it’s time for him and Chloe to be truthful and stay just friends. A night out ends in tears when Scotty’s attentions move from Abbie to Marnie, and the family are over the moon when Gaz returns single and ready to mingle.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 15,
                    "show_id": 39416,
                    "still_path": "/dDO412nbWt6GtVmkpTjqWfTFEAk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-19",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1357322,
                    "name": "Fight Night",
                    "overview": "It’s Aaron’s fight! Marnie gets emotional. Scott & Marty are nowhere to be seen when it’s time to get back to the Toon. A naked hot tub party, a food fight and some shag pad action- Just another belter night in the Geordie Shore house!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 15,
                    "show_id": 39416,
                    "still_path": "/vttD9GmYiXXVoaABWDE57S2wPts.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-26",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1357323,
                    "name": "Arrivederci Newcastle",
                    "overview": "Anna announces that Scotty and Marty won’t be coming back, but there's no time to stay down as Anna wants the gang to head to Rome to show the Italians how to party Geordie style! Gaz and Abbie are getting close, but the arrival of an old friend has Abbie feeling jealous and Gaz facing a choice.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 15,
                    "show_id": 39416,
                    "still_path": "/qmPbKJdH9sIgP80ero9p3ZihNpK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-03",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1357324,
                    "name": "Chloe's Challenge",
                    "overview": "The Radgies are in Rome and Boss Anna has work for them: Show the Italians how to party Geordie style! Nathan is annoyed with Chloe, Gaz and Abbie get closer and Aaron tells Gaz he wants to give it a go with Marnie... But will she feel the same?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 15,
                    "show_id": 39416,
                    "still_path": "/x3L2pdMEeYZw2DJ3Yf5XUGzD8hu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-10",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1357325,
                    "name": "The Triple Date",
                    "overview": "Abbie wakes up feeling in control of her and Gaz. While Nathan and chloe make up the rest of the gang head out to Laser tag where the only thing in Gary’s sights is Abbie. Marnie and Aaron are not on the same page and a slip of the tongue ends up in a massive argument and a trip to A&E.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 15,
                    "show_id": 39416,
                    "still_path": "/pRnWdXytE2bVUxNgvdjTKN2EXnd.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-17",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1357326,
                    "name": "Has Gary Met His Match?",
                    "overview": "Aaron wakes up to his birthday, hung over and in Marnie’s seriously bad books. At Aaron’s party both Gary and Abbie have their eyes on the other people and Marnie gives Aaron a present he won’t forget. The gang sack off work for a day at the pub and someone utters those three little words, “I love you”.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 15,
                    "show_id": 39416,
                    "still_path": "/xTiNRNIiNuZqDPmQiNVoNCTAJf9.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-17",
                    "episode_number": 9,
                    "episode_type": "finale",
                    "id": 1381033,
                    "name": "Couples Counselling",
                    "overview": "As the gang get ready to leave the house Marnie has to make a decision about her and Aaron. Gary and Abbie are both happy with their open relationship but when Marnie talks ato Aaron, it looks like Maaron might be over for good. Will every one leave the Shore together or apart?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 15,
                    "show_id": 39416,
                    "still_path": "/p3AjKeWc3RkWEUN5DUu1eFVXudq.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 15",
            "overview": "It's BAAAACK\n\nAfter putting eight wanna be radgies through their paces in season 14, Geordie Shore is returning for its 15th series - and only one lucky newbie has made the cut.\n\nAbbie Holborn joins original cast members Gary Beadle and Sophie Kasaei, as well as ol' favourites Marnie Simpson, Chloe Ferry, Aaron Chalmers, Nathan Henry, Marty McKenna and Scotty T for the latest round of trouble making in the toon.",
            "id": 91465,
            "poster_path": "/fSBA8JZZxKdVsyLB0RmZ3FSsJLl.jpg",
            "season_number": 15,
            "vote_average": 0
        },
        "16": {
            "_id": "5a5583c2c3a3685ecd01c066",
            "air_date": "2018-01-09",
            "episodes": [
                {
                    "air_date": "2018-01-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1417421,
                    "name": "Parsnip Party",
                    "overview": "The Geordies are back, and two new family members join the family. Steph annoys Marnie straight away as she has \"unfinished business\" with old flame Aaron. And Chloe and Abbie compete for new boy Sam's affections - but who will Sam choose?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/iWioNVfpokjAynoZTZpO5ZdBvD0.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1417423,
                    "name": "Chloe Confronts Abbie",
                    "overview": "The Geordies are back and newbie Sam is already creating havoc between the girls. And despite ex-flames Marnie and Aaron both having partners, their relationship is as close as ever – but will sharing a bed prove too much temptation?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/rcKLvKLYLb0TwGLYBMu7g2pBabi.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-23",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1423144,
                    "name": "The Mams Come To Party",
                    "overview": "It’s Marnie’s birthday, which means house party time! However, an appearance from her boyfriend sends tensions soaring, with Aaron and Nathan coming to blows! And Anna sends the family to work in Tenerife – but will all the family be going?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/gWIsQ4LHAFtU7FtnxtYTs6q46Qs.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-30",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1426149,
                    "name": "Chloe's First Date",
                    "overview": "The Geordies are back and going radge in Tenerife, and it’s not only the weather that’s heating up! Steph’s on the pull, and after being torn between Chloe and Abbie, Sam continues to play with fire, leading to ‘smashing’ consequences.​",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/SCJEI1ESQR390sI4njYrQ9UrQB.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-06",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1429325,
                    "name": "Tenerife Was A 10",
                    "overview": "The Geordies are back and going radge in Tenerife, and it’s not only the weather that’s heating up! After finally deciding that he prefers Chloe, Sam takes her on a parascending date – but is their relationship about to hit new heights?​",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/a63h5U2Sculmzm0GXDBC6N72gT0.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-13",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1432787,
                    "name": "Chicken Shop Date",
                    "overview": "The lads and lasses are back in Newcastle after their trip to Tenerife and a lack of action sends Sophie and Nathan to horny new levels! Sam’s out to impress Chloe, but it’s not long before there’s tears, and cracks start to show within the family.​",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/upV8WSMu9Pj2m5hIVCHlBHByVtW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-20",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1437441,
                    "name": "The Girls Get Spiritual",
                    "overview": "The Geordies are back, and whilst Nathan puts the newbies through their paces, fighting friends make amends. Sophie has a surprise guest, Sam’s in the bad books, and a missing member of the family re-joins the house.​",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/cyzaa7mfxynIYPtKlSb1vdPegP3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-27",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1444899,
                    "name": "The L Bomb",
                    "overview": "The Geordie’s are back, and the whole family are finally reunited. A trip to Edinburgh brings old flames Marnie and Aaron closer again, and Sam is left grovelling to Chloe. Cracks start to show between old friends when Nathan and Marnie come to blows.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/xHoT93QBFr3Y185zRhop5Oec7fh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-06",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1448625,
                    "name": "Chloe's Barbers",
                    "overview": "The Geordies are back, and it’s not long before the gang hit the toon. Marnie and Nathan clear the air, Abbie’s on the pull, and Sam and Chloe work through their issues. And on a night out, things get heated between best friends Steph and Abbie.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/3ZJdAebRYkQ56qivO1awfC3r5ek.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-13",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1454293,
                    "name": "The Toilet Trip",
                    "overview": "It’s the last couple of days in the house for the Geordies, and they’re going out with bang! Steph and Abbie make up, and suspicions arise over how close Marnie and Aaron are. Sam asks Chloe on a date, but will she be leaving the house as his girlfriend?​",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 16,
                    "show_id": 39416,
                    "still_path": "/o0q3agtg06DVHxXE3W7PXw4zgVW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 16",
            "overview": "The Geordies are back, and with two new members. Steph annoys Marnie as she has \"unfinished business\" with old flame Aaron. And Chloe and Abbie compete for the new boy's affections.",
            "id": 97696,
            "poster_path": "/xglgI6f2CCApdWGVtwM12sq6CFa.jpg",
            "season_number": 16,
            "vote_average": 0
        },
        "17": {
            "_id": "5afcded60e0a262ca2001a39",
            "air_date": "2018-05-15",
            "episodes": [
                {
                    "air_date": "2018-05-15",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1490674,
                    "name": "Australian Additions",
                    "overview": "The gang arrive on the Gold Coast to find they are being joined by a couple new Geordie house mates and some hot locals to live and party with too. It’s Geordie Shore as we know and love, but this time played by Aussie Rules!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/yowWTL4vJga6Dm2q4Vn254yPwfX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-22",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1490673,
                    "name": "On The Pull",
                    "overview": "The Geordies are back. Get ready for even more partying, pulling, necking on and getting mortal. Abbie says soz to Dee after her savage club swill, Sam and Nathan almost kick off over Chloe, and Nathan packs his bags after a spider attack.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/iUbh3KrzMqzx0wiHSeH96JZ7Hc7.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-05-29",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1497981,
                    "name": "Sneaking Off To Byron Bay",
                    "overview": "The Geordies take radge to new heights when they go skydiving, Nathan calls Chloe a stalker causing her to go crackers at Chrysten, and the gang head to Byron Bay for a night out.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/eLvrp0KQ30N9GBjyRIiL9dhxnU7.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-05",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1501609,
                    "name": "Family Reunion",
                    "overview": "Half the gang head to Byron Bay leaving Chloe And Nathan at home and still not speaking. Sophie is still on the hunt for love, but as Abbie and Grant get closer, will Sam and Chloe’s love survive him leaving her behind?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/ffK3PwUNbzbZfFefcgucs5kzGRx.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-12",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1501608,
                    "name": "The Next Step",
                    "overview": "Making up is a bridge too far for someone and they pack their bags. Chloe puts on a show that Sam will never forget. Grant finds himself cosy in the girl’s bedroom and Sophie’s search for a boy brings her a lot closer to home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/7H9osXIC6x1ety5LgJwI3TvRYNM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-19",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1509389,
                    "name": "The Shag Pad Invasion",
                    "overview": "Geordie House Parties are a thing of legend – getting mortal, tashing on, and a few home truths, but will it be the end of the party for Grant and Abbie? Sam sees red when Chloe gets up close with Alex however, Nathan has the last laugh.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/bLtClyvUcWvenqEWErqREfy1VA.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-06-26",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1513154,
                    "name": "Look Who's Back",
                    "overview": "Geordie House Parties are a thing of legend – getting mortal, tashing on, and a few home truths, but will it be the end of the party for Grant and Abbie? Sam sees red when Chloe gets up close with Alex however, Nathan has the last laugh.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/uopkUpcnfQNKKIIPKMydcfAqEKS.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-07-03",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1515495,
                    "name": "Queen Nathan's Birthday",
                    "overview": "Holly’s is concerned for Chloe but Chloe just wants to teach Sam a lesson. Nathan’s birthday calls for a trip to the outback, but what will the locals make of four men in drag? Sophie has no concerns as she brings her drag queen to bed.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/yTA2XMwfJHno6aU9tambycSFb1g.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-07-10",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1518810,
                    "name": "The New Geordie",
                    "overview": "The gang wake up in the outback and fully immerse themselves in the local ways - Sheep shearing and bush tucker. A night at the local strip joint brings tips for Abbie and Sophie goes all out to get her man. Back at the GC there's a new Geordie waiting!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/brMRkCqI0RqMcAU5zeo8HoSDa62.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-07-17",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1525933,
                    "name": "Sam Busts His Hand",
                    "overview": "Sophie and Alex wake up after sealing the deal. Sophie is delighted but Alex has his doubts. Nathan sees red after Alex makes a decision and it all kicks off. Sam’s hand gets busted and sends him to the hospital so Chloe drowns her sorrows, big time!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/iBSutoCc7blkg4jH2wEWCtNkVMa.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-07-24",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1530087,
                    "name": "Pride Party",
                    "overview": "The gang celebrate Pride as only the Geordies can with the mother of all house party, with a surprise guest! Sophie ends up in tears and Chloe is unimpressed with Alex so swills him with potato salad! Sam returns and Abbie and the new boy Adam get closer.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/ac44hs5J3OmoaBYfv805wQa3Y5h.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-07-31",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 1534450,
                    "name": "The Ultimate Food Fight",
                    "overview": "​It’s almost time for the Geordies to head back to the Toon but not before a farewell Booze Cruise! Sam and Chloe make things permanent and it’s painful! There’s tears all round when it’s time to say goodbye, especially from Sophie and Alex. Awwwwww!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 17,
                    "show_id": 39416,
                    "still_path": "/c0NFcMiMwTW5YkqKS1689KHs9yt.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 17",
            "overview": "Geordie Shore has gone Down Under and we’ll soon get to see the results as the show returns to our screen with six new cast members and a shock return.\n\nIt’s been seven years since the much talked about programme made its debut on MTV and for its SEVENTEENTH series, the lads and lasses have swapped the banks of the Tyne for Australia’s Gold Coast.\n\nA pampered and preened bunch of Aussies are on hand to show them how to party across the other side of the world.",
            "id": 103884,
            "poster_path": "/zYfTcHl0ZnFGB44FXTqCAljhspz.jpg",
            "season_number": 17,
            "vote_average": 0
        },
        "18": {
            "_id": "5bca8c2c9251416c130033e4",
            "air_date": "2018-10-16",
            "episodes": [
                {
                    "air_date": "2018-10-16",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1599396,
                    "name": "Gotta Have Faith",
                    "overview": "The Geordies are back on home turf and ready to cause more mayhem than ever. This time, they'll be joined by some old faces, new faces, friends and family as they prepare to tear up the Toon once again.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/wjZhwicnik3wlmT3e4md863o9Kh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-23",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1603424,
                    "name": "Geordie Dinner Party",
                    "overview": "Chloe and Sam show off their brand new home when they invite the gang round for a housewarming party. Nathan's bouncing when he realises he has to work on Scott's first job. Faith soon discovers that it's not all one big party when she clashes with Chloe.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/xQ6yeAp20XaXT1bWFGzsF8PQYjA.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-30",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1609752,
                    "name": "Girls Trip",
                    "overview": "Sophie decides the girls need a holiday to Blackpool whilst relationships between the boys hits an all time low. Faith makes up with Chloe, although she might not remember in the morning!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/8tk5SBDRRPmCcgMqcA4e1DGOKQW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1614476,
                    "name": "Sophie And Sam Fall Out",
                    "overview": "After their trip to Blackpool the gang couldn't be better, but that changes when they get back to the Toon. Tensions in Sam and Chloe's relationship spill over and send them packing.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/ubZHGROfB7m8gN2lZFSJgVrjkHP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-13",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1620789,
                    "name": "It's Snowing In Newcastle",
                    "overview": "Abbie and Adam are struggling with their friendship and Nathan feels let down by Chloe who puts Sam, first. Faith finally feels like she's one of the gang and Scott takes the crew Tank driving!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/lZZz465iUrXlHSXU92Xei15LOc6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-20",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1626502,
                    "name": "Benidorm Bound",
                    "overview": "The Geordies try Burlesque dancing and invite their friends over for a games night. Anna sends them to Benidorm and the squad tear up the Strip. Sophie hits Sam after he calls her jealous.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/oMaxMWBk8LgtmftOdLivaD48NFU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-27",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1629881,
                    "name": "Nana Joins The Gang",
                    "overview": "Sophie apologises for hitting Sam and the Geordies have a hilarious day out at a water park. The crew go clubbing with Abbie's Nana - exactly what they need to bring the family together.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/pcfWK2Wkt88yie7Bcnf3P8AKFSr.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-04",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1635756,
                    "name": "A Double Return",
                    "overview": "Sophie is lost for words when Aussie Alex makes a surprise visit. The house is proper buzzing when Holly returns and takes them to Newcastle Pride for much needed fun, drinking & dancing!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/43l0cDBTYJQOaC9BcwLmTzuINjr.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-11",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1643105,
                    "name": "Holly Gets A Shock",
                    "overview": "Chloe takes Sam on a secret date that leaves a chill up his spine. Alex has to do some serious grovelling with Sophie. Scotty T makes life awkward for Holly when he brings her ex on a job.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/wjbMLfHeXEDj92pRASp4b0822Dd.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-18",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1647214,
                    "name": "Geordie Fest",
                    "overview": "The family celebrate Abbie's 21st birthday with the ultimate house party, of course Abbie's Nana is invited! The family share an emotional farewell as their time together comes to an end.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 18,
                    "show_id": 39416,
                    "still_path": "/8yC6faDTSSMqZ6KihWbnJcaBIuU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 18",
            "overview": "",
            "id": 111166,
            "poster_path": "/8CwgXBqQcb6R2s0Mrxd6xVZ6MpO.jpg",
            "season_number": 18,
            "vote_average": 0
        },
        "19": {
            "_id": "5ca490050e0a260158a870f5",
            "air_date": "2019-04-09",
            "episodes": [
                {
                    "air_date": "2019-04-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1747122,
                    "name": "All Change In The House",
                    "overview": "The Geordies are back! Anna and Scotty-T are shaking things up and throwing 4 Newbies in the mix. But the Oldies are always on hand to show them how to party hard!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/mBHnbqcRKs2EzdigUw3OxDblS8F.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1755855,
                    "name": "Nathan Needs A House Party",
                    "overview": "As Nathan hits rock bottom the family decide to throw a house party to lift his spirits. Sophie's missing her boyfriend whilst the newbies settle into the Geordie family.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/rc8BEeDRFJyAx333rkltnvx8iFG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-23",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1762335,
                    "name": "Beau & Bethan Get It On!",
                    "overview": "Nathan and Chloe aren't in a great place. Despite not looking to get into a relationship, Beau's naturally attracted to Bethan and they get it on.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/srS7OPqcsHxJ923G4QThmaGC1pl.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-30",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1770512,
                    "name": "Buckle Up! The Geordies Hit Belfast!",
                    "overview": "Anna tells the squad they're going to Belfast. The Geordie's go hard in Northern Ireland and enjoy what the city has to offer - Tahlia even pulls a waiter! But things go west when Chloe and Sam's relationship hits rock bottom and puts them on a break.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/319Q2rCXAZFN9kCd7MppftCswSi.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-07",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1777356,
                    "name": "The Family Is Rocked!",
                    "overview": "The Geordie's return to the toon and are in for a shock when a familiar face returns. Bethan and Beau are tested whilst Chloe and Sam's relationship starts to get back on track. Sophie has to make a difficult decision.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/dfJZkqbPsjEn5kb1jE2Y2HWCBqk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-14",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1786550,
                    "name": "Trouble In Paradise!",
                    "overview": "Nathan visits Sophie to understand why she left. Scott tells the Crew Anna's throwing a Singles Night. Bethan doesn't consider herself single but Beau does - Awks!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/cVbwyGltasaHmFbXxGwY1FOX6aE.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-21",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1792463,
                    "name": "Beau & Bethan Back On!",
                    "overview": "The newbies get annoyed by Nat's constant 'mothering'. Nathan forms a friendship group with the other singletons, Tahlia & Alex. After an awkward day, Beau makes things right with Bethan.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/uJWY7gNWY5R3aT7y8pa5sqG2ztR.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-28",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1795451,
                    "name": "Cardiff Carnage",
                    "overview": "Anna tells the squad they're off to Cardiff. Beau's buzzing because everyone will get to meet his brother, Harvey, who lives there. But it makes Bethan feels nervous.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/gqplDK3mPnk9zIxXz9eBQzMnv2t.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-04",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1800923,
                    "name": "Dizzy Heights!",
                    "overview": "The Geordie's throw a house party! There's plenty of fun and necking on. Beau chooses Bethan over Abbie, which leads to Chloe and Nathan falling out - Again! Scott decides team bonding's needed so sends them both abseiling.​",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/dUeZMV7AGsPs0iKvtdVC20wQXYP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-06-11",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1810159,
                    "name": "Fight Night!",
                    "overview": "Nathan throws a surprise for Tahlia, his single Bestie. Aaron calls the house and invites the family to support him at his first MMA fight in Newcastle.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 19,
                    "show_id": 39416,
                    "still_path": "/4HZsoZnBDkljYoKJO9F46B17uln.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 19",
            "overview": "",
            "id": 121599,
            "poster_path": "/nPHHLqPUNIIIm1TCPRvGCABFZYH.jpg",
            "season_number": 19,
            "vote_average": 0
        },
        "20": {
            "_id": "5db8e5bfd2c0c1001b199d92",
            "air_date": "2019-10-29",
            "episodes": [
                {
                    "air_date": "2019-10-29",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1970864,
                    "name": "Shake Ups & Break Ups!",
                    "overview": "Chloe and Sam have split and the squad are worried how it's going to impact the family. James and Abbie return but their first night out ends in disaster when Beau tells Bethan it's over!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/wwXzNrW3kSJI54JAAXejeX5jrKG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-05",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1977176,
                    "name": "Give It Another Go!",
                    "overview": "Sam realises he has to sit down with Chloe so they leave the house for an honest chat. They decide to give things another go but the news doesn't go down well with the rest of the house!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/xHwamViExKHgkjmrBof3PBdnIfr.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-12",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1980942,
                    "name": "Tensions Keep Rising",
                    "overview": "Chloe confronts the girls about not supporting her. Sam's behaviour on a lads night out leads to them splitting up, again! Abbie tells James she saw Chloe get with a lad in Ibiza.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/r5NuBriJTn7VBpSg8hXCqADgLX0.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-19",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1996008,
                    "name": "Party in Portugal!",
                    "overview": "Sam makes a big decision when the squad are told they are off to Portugal. The family have fun on the Algarve, but tension between Bethan, Beau and Abbie threatens to boil over.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/xKy8rSUXxdjSZJc3UUEux6ftaSV.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-26",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1998159,
                    "name": "Agg on the Algarve",
                    "overview": "Bethan and Abbie's row impacts on the house, and it all kicks off when Nat calls Bethan and Beau's relationship 'toxic'. The Geordie's get stuck into the Sangria and tear up the strip!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/4sBOQiNeDZOATOjyCqAGDgMy4iA.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-03",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2004396,
                    "name": "Fun at the Fair!",
                    "overview": "The squad return from Portugal but Sam has left the house which leaves Chloe thinking it's over. The family go radge at Newcastle's biggest funfair. Beau and Bethan make it official.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/hJ2WL5MCvf0J3gdAEkBc5lwJxer.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-10",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2011351,
                    "name": "Geordies Do the Great Outdoors!",
                    "overview": "Chloe visits Sam and they make progress in their relationship. The squad go camping, and get attacked by midges. James decides to tell Sam about Chloe's kiss in Ibiza.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/vXpd7YmeK8LM94EMDArDl7DDdkx.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-17",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2021735,
                    "name": "Breaking Point",
                    "overview": "James tells Sam about Chloe's kiss in Ibiza, and Sam confronts her. Chloe can't believe Abbie let the secret slip. Sam decides to leave the house for good!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/AoO8UNkQWv7Z4G7mrhfeOyAQowK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-24",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2027736,
                    "name": "Beau's Birthday!",
                    "overview": "With Chloe and Sam out of the house, the squad throw Beau a house party. James and Beau surprise Nathan by inviting his online dating interest, Tommy from Amsterdam, over to Newcastle.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/tLZ61xE4pCbfySLxWFZs52frsGL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-24",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 2348533,
                    "name": "Serious Send Off!",
                    "overview": "It's the last full day in the house and the squad prepare for a big one! Nat cooks the family a farewell dinner and Chloe joins everyone for their final night on the Toon.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 20,
                    "show_id": 39416,
                    "still_path": "/8bGReVaCnKCvhFVp6EThowYgbsx.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 20",
            "overview": "",
            "id": 134954,
            "poster_path": "/zGQi9yZtJ6iK59YYnhjDtkzEAfm.jpg",
            "season_number": 20,
            "vote_average": 0
        },
        "21": {
            "_id": "5f21bc6317c44300389ace7a",
            "air_date": "2020-07-28",
            "episodes": [
                {
                    "air_date": "2020-07-28",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2370608,
                    "name": "Get This Party Started!",
                    "overview": "The Geordie's are buzzing to be back in the house and most of them are single. Two newbies, Amelia & Ant, are shown how to tear up the Toon. Nathan & Beau get close, too close for Bethan.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 21,
                    "show_id": 39416,
                    "still_path": "/m2x1Tc581H7JzIlleNkmlTRuyHc.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2370609,
                    "name": "Family Friction!",
                    "overview": "The squad are in a good place, tearing up the Toon and having fun welcoming the newbies. But, it all kicks off when Chloe ignores Nathan's advice about getting too close to new boy, Ant.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 21,
                    "show_id": 39416,
                    "still_path": "/4OLQacpHaFvp1IRXEZOha8XxpFG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2387441,
                    "name": "It's Fright Night!",
                    "overview": "Chloe's feelings start to drift, but Ant thinks there's a chance when she lets him stay in her bed. The squad go on a forest Fright Night walk where Abbie and Chloe are forced to talk.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 21,
                    "show_id": 39416,
                    "still_path": "/3nZC4Oef6M7y5klg1JT5btu6e1W.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2396362,
                    "name": "Hello New Lad!",
                    "overview": "New boy Louis joins the squad and makes a sudden impact. Chloe falls for his charm which puts Ant's nose out of joint. Bethan tells Beau she needs more of his time.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 21,
                    "show_id": 39416,
                    "still_path": "/zEAv0JFywibtZG7I2XojdzWxvjV.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2396363,
                    "name": "Big Mistake!",
                    "overview": "Chloe necks on with Ant to teach Louis a lesson. Beau and Bethan have a heart to heart, they agree the day is for friends and the night is for them. Beau gets drunk and messes things up!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 21,
                    "show_id": 39416,
                    "still_path": "/rOQjskqF3ITO6lG5rWdqj4RxPZJ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-01",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2411114,
                    "name": "See Ya, Nat!",
                    "overview": "Nat's not feeling herself and after a lot of soul searching, she decides to leave for good. Beau and Bethan are at breaking point and have a tense conversation about their future.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 21,
                    "show_id": 39416,
                    "still_path": "/tNgen78cPuQNIYP7BdwX2oTp7es.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-08",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2421147,
                    "name": "Chloe Changes Her Ways",
                    "overview": "Bethan decides she needs to leave but Beau stays behind with the family. At a house party, Ant stirs up some trouble between Louis and Chloe, which causes beef among the lads.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 21,
                    "show_id": 39416,
                    "still_path": "/uGl4ukKsVAgOpwQVUB0Qn5BgUBI.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-15",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 2428877,
                    "name": "Geordie-licious!",
                    "overview": "It's the final night and the squad host an event. The pressure is on to deliver a party to remember - Amelia sings, Nathan rocks the frock and the lads do a strip. Louis and Chloe open up.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 21,
                    "show_id": 39416,
                    "still_path": "/6m5zg8pwnIs3DNRq1uvlAQQ1cem.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 21",
            "overview": "",
            "id": 157641,
            "poster_path": "/lSQOq6nDkJd9wNh19zLuevNE155.jpg",
            "season_number": 21,
            "vote_average": 0
        },
        "22": {
            "_id": "61870e543e2ec8006372c96e",
            "air_date": "2021-10-04",
            "episodes": [
                {
                    "air_date": "2021-10-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3325169,
                    "name": "The Singles Have Landed",
                    "overview": "After living the lockdown life for far too long, the Geordies are back! But this time theyre sharing the house with a whole host of sexy singles who theyll be dating.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": "/ji1LuVbn7LTt1gLTmC23dGJdiqp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-10-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3325170,
                    "name": "Someone's Getting Dumped",
                    "overview": "Amelia makes her return to the house, James and Louis fight for Roxys affections and theres shocking news for the singles.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": "/mz4JJPtbZavHe1mDXoASirq7Js1.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-10-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3325171,
                    "name": "Chloe Shoots Her Shot",
                    "overview": "Abbie is at the centre of a big bust up, Nathan gets mugged off and Chloe makes her move on Louis.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": "/7Nm2y2LuV6LPWUgPcZCXWvQ96RF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-10-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3325172,
                    "name": "Return of the Mac",
                    "overview": "Nathan confronts Nathaniel, James is stuck in a Scottish Sandwich and a shock return threatens to derail Chloe and Louis budding romance.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": "/26hj4NZM9oe6eLzaSscvLPr3T3n.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3325173,
                    "name": "Kiss Louis Goodbye",
                    "overview": "Louis lays it all on the line, but Chloe is having second thoughts. Marty is about to relive his past and a shock eviction divides the house.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": "/pZBC8UB0LzbioTUqGLz8QHxnN7f.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-09",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3325174,
                    "name": "Just A Kiss?",
                    "overview": "Ant has some bad news for Louis. Chloe goes on a date with a model and the house is faced with its toughest dumping yet.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-16",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3433187,
                    "name": "Unfinished Business",
                    "overview": "Marty and Chloe go on a date, Louis cant keep his mouth shut and there is a shock announcement before the big night out.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-23",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3433197,
                    "name": "Out Out",
                    "overview": "Four new arrivals change everything. James has big plans for Roxys birthday. But will Marty and Louis ruin the big night out?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-30",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3433198,
                    "name": "Make Or Break",
                    "overview": "Marty drops a bomb on Chloe, Ant pushes Molly to breaking point and the Geordies are faced with a tough decision.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-12-07",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 3433199,
                    "name": "End Of The Road",
                    "overview": "As the hot single summer comes to an end, will the Geordies say goodbye to the Singles? Or are their relationships just getting started?",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 22,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Hot Single Summer",
            "overview": "",
            "id": 218516,
            "poster_path": "/bG3EudErhY4FmIu9uV8u0R2h2Xu.jpg",
            "season_number": 22,
            "vote_average": 0
        },
        "23": {
            "_id": "6368d27aea84c7007d4d0d76",
            "air_date": "2022-09-20",
            "episodes": [
                {
                    "air_date": "2022-09-20",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4043824,
                    "name": "\"Let's Get Together!",
                    "overview": "To celebrate over 10 years of Geordie Shore, Charlotte, Holly and Sophie hold a baby shower for Marnie, where they plan a reunion party. But is arranging a party really a good idea?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-09-27",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4043825,
                    "name": "The Reunion Begins",
                    "overview": "Charlotte, Holly, Sophie and Marnie's plan of a big Geordie Reunion comes together! Cast past and present descend on the Toon for the big night but, does everyone turn up?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-04",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4043826,
                    "name": "The Reunion Continues",
                    "overview": "The Geordie Shore Reunion continues with more shock arrivals bouncing through the door. Some Geordies will meet for the first time in years, some will make up, some will be able to move on and some will never speak again.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-11",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4043827,
                    "name": "The Geordies Invade Portugal!",
                    "overview": "The Reunion and Chloe and Bethan's argument reaches a climactic end. The gang land in Portugal for a family holiday! What blasts from the past are jumping on the next flight to the Algarve?.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-18",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4043828,
                    "name": "Trouble On The Horizon!",
                    "overview": "Chloe Ferrys shock arrival causes a massive ripple affect across the whole group! Nathan tries to smooth over tensions by taking the girls off to a spiritual retreat.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-25",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4043829,
                    "name": "Holly's Hen Do",
                    "overview": "Louis' arrival causes drama for the Geordies. Charlotte and Sophie throw Holly a surprise Hen Do on a boat! Someone else unexpectedly turns up at the villa, which will cause shockwaves throughout the Algarve!.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-01",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4043830,
                    "name": "The Answer to the Big Question",
                    "overview": "As the trip to the Algarve comes to an end. Louis action’s continue to cause drama amongst the Geordie’s and Holly finally gets some answers to the question everyone has been wondering!",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-08",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4043831,
                    "name": "The Pitter Patter Of Wedding Bells!",
                    "overview": "Marnie and Casey welcome a new arrival to their family! Elswhere, another monumental day looms and the Geordies are in Ibiza gearing up for Hollys wedding day!",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-15",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4043832,
                    "name": "Back On The Toon",
                    "overview": "The Geordies are back in Newcastle for a night on the Toon! Who will show up and after all the recent drama will it be a Night to remember for all the right or wrong reasons?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-22",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 4043833,
                    "name": "The Reunion Finale",
                    "overview": "It's time for one final house party at the Geordie Shore House to bring the Reunion to a close. As the group prepare to say goodbye, will it all be on good terms or is there still issues from the past that need to be faced?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 23,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "The Reunion Series",
            "overview": "The twenty-third' season of Geordie Shore, a British television programme based in Newcastle upon Tyne was confirmed on 15 February 2022, when Paramount+ introduced their new lineup of unscripted series and renewals for MTV Entertainment Studios, including the show's new spin-off, although they were scheduled to start in late 2020 and 2021 but have been postponed several times due to UK COVID-19 restrictions. Filming locations include a trip to the Algarve in Portugal, Ibiza and Newcastle upon Tyne. The first trailer for the season was released in late August 2022 and premiered later that year on September 20. This series appears as \"Geordie Shore: The Reunion Series\" and not as a spin off of the show. This series brings together the cast members to celebrate Geordie Shore's 10th anniversary.",
            "id": 315555,
            "poster_path": "/7iYqRrmU9bkhrgxzWfSev9O7XVe.jpg",
            "season_number": 23,
            "vote_average": 0
        },
        "24": {
            "_id": "657129b97eb5f200c943df2e",
            "air_date": "2024-01-09",
            "episodes": [
                {
                    "air_date": "2024-01-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4979946,
                    "name": "Episode 1",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 5065706,
                    "name": "Episode 2",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-23",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 5072254,
                    "name": "Episode 3",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-30",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 5074418,
                    "name": "Episode 4",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-02-06",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 5077661,
                    "name": "Episode 5",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-02-13",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 5078789,
                    "name": "Episode 6",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-02-20",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 5086671,
                    "name": "Episode 7",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-02-27",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 5088566,
                    "name": "Episode 8",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-05",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 5092782,
                    "name": "Episode 9",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-12",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 5097037,
                    "name": "Episode 10",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 24,
                    "show_id": 39416,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 24",
            "overview": "",
            "id": 368804,
            "poster_path": "/7lmy3PUQ030u6PvIFdScXy5p6hI.jpg",
            "season_number": 24,
            "vote_average": 0
        }
    }
}