{"adult":false,"backdrop_path":null,"created_by":[{"id":185773,"credit_id":"52595a14760ee3466190a33a","name":"H. Jon Benjamin","gender":2,"profile_path":"/yZgBHrH8D9Jjo15fuQKnWV3U2OC.jpg"}],"episode_run_time":[],"first_air_date":"2011-06-14","genres":[{"id":35,"name":"Comedy"}],"homepage":"http://www.comedycentral.com/shows/jon-benjamin-has-a-van/index.jhtml","id":39522,"in_production":false,"languages":["en"],"last_air_date":"2011-08-10","last_episode_to_air":{"id":868511,"name":"Smoking","overview":"After visiting a church that believes Jesus Christ smoked a pipe (and Metallica's guitarist owns one of them) Jon takes up smoking. He joins in with a gang of smokers which leads him to fall in love with a woman who speaks only french (and he likes the sound of it). Sadly she is in love with another man and leaves him after a scene in black and white. Also includes: Jon visits a cult leader that has predicted the end of the world as TODAY, even though he has falsely predicted the end of the world 17 times AND new segment: YOU GOT BURNED.","vote_average":0,"vote_count":0,"air_date":"2011-08-10","episode_number":10,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null},"name":"Jon Benjamin Has a Van","next_episode_to_air":null,"networks":[{"id":47,"logo_path":"/6ooPjtXufjsoskdJqj6pxuvHEno.png","name":"Comedy Central","origin_country":"US"}],"number_of_episodes":10,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Jon Benjamin Has a Van","overview":"Jon Benjamin Has a Van is a live-action television comedy series that aired in the summer of 2011 on Comedy Central. The series stars Jon Benjamin as a reporter who tours around in a van to deliver uninteresting news to the viewers and to unsuspecting people while utilizing scripted scenes for narrative reasons. The series' cancellation was announced in April 2012.\n\nSpecial guests include Patton Oswalt, David Cross, Jon Glaser, Eric Wareheim, Tim Heidecker, Matt Walsh, Ian Roberts, Jay Johnston, Bob Odenkirk, Chloé Dumas, Jerry Minor, Andy Richter, Larry Murphy, Rich Fulcher, Chris Parnell, Brendon Small, and Metallica guitarist Kirk Hammett.","popularity":4.701,"poster_path":"/3epRDwLQZxF2CB8PTRuTaprtTZx.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2011-06-14","episode_count":10,"id":50893,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Scripted","vote_average":7.2,"vote_count":8,"season_data":{"1":{"_id":"52595a13760ee3466190a265","air_date":"2011-06-14","episodes":[{"air_date":"2011-06-14","episode_number":1,"episode_type":"standard","id":868502,"name":"Border","overview":"After pushing his producer (Matt Walsh) over the border of Mexico a year ago without his passport to get back in America, Jon visits him and manages to push the man over the border of Guatemala. Some time after, arriving to interview an infamous drug cartel leader, Jon learns his producer became the cartel leader prior to the Guatemalan government storming the complex. In a heated chase, it ended with the producer pushed over the border of El Salvador and having Jon's passport on him as Jon is taken away to experience Guatemala's justice system. Also included is \"You Can't Shoot Here\", in which Jon gets a glimpse of some of New York's most elusive filming locations.","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-15","episode_number":2,"episode_type":"standard","id":868503,"name":"Little Italy","overview":"During an investigative report on Italian communities in New York, Jon finds himself in a feud between Little Italy and Little Little Italy, a tiny town in the back room of a Little Italy establishment full of Italians only inches tall. Complicating things, Jon strikes up a romantic relationship with the daughter of the Don in Little Little Italy. Also includes \"Jon Takes On Gay Marriage,\" in which Jon half-heartedly attempts to find what people really think of the hot button issue, and an interview with an interviewer who survived interviewing a hideously mangled man.","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-22","episode_number":3,"episode_type":"standard","id":868504,"name":"Star Door","overview":"While doing a report on Area 54, a secret area inside of Area 51, Jon and his Crew are sent through a van-shaped dimensional gateway by a scientist (Chris Parnell) who notes that their van is the perfect vessel for the portal. When he accidentally kills two alien children upon exiting the gateway, Jon finds himself in court and facing a possible death sentence. Now Jon only his lawyer (Tim Heidecker) to help save his life as the bereaved father (Eric Wareheim) calls for blood. Also included is \"Shame on Me\" with Edward Sheath (Rich Fulcher).","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Mosham the Alien Lawyer","credit_id":"5f9a0ed16f8d95003573675e","order":500,"adult":false,"gender":2,"id":132856,"known_for_department":"Writing","name":"Tim Heidecker","original_name":"Tim Heidecker","popularity":9.664,"profile_path":"/nHY5HYxVnS6KmPGZTcGKeakQGmc.jpg"}]},{"air_date":"2011-06-29","episode_number":4,"episode_type":"standard","id":868505,"name":"Breakdown","overview":"Jon's van breaks down while looking for a \"Poor Farm,\" where rich people go to pretend to be poor for a week each year. While looking for help, Jon's sound guy Nathan is kidnapped. Jon has an hour to raise $10,000 to save Nathan, now without audio to go with the footage. Also includes \"Do You Have a Minute?\", which features exactly 60 seconds between Jon, New York pedestrians and a microphone, and an interview with a crippled man whose wheelchair guns were taken away after a child stole them and went on a homicidal rampage.","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-06","episode_number":5,"episode_type":"standard","id":868506,"name":"Road Rage","overview":"Jon has a violent physical encounter with Jewish motorist on the road that ends with him bitten and becoming an Orthodox \"Were-Jew,\" resulting in Jon waking up confused with a Jewish wife and a new home. Things get worse when, just as he is learning to accept his new life, he is bitten by a homosexual motorist. Also features another \"Shame on Me\" segment and interview with the founder of a father/baby half Ironman triathlon, and \"Switch-A-Roo\", in which a rich country child switches places with a rich city child.","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-13","episode_number":6,"episode_type":"standard","id":868508,"name":"Suicide","overview":"While interviewing the mayor of a town famous as a final retreat for those who are considering taking their own lives, Leo is found dead at the bottom of a bridge. Initially assumed just another suicide, a knife in Leo's back indicates foul play. As Jon and the others are suspected of murder they quickly turn on each other, revealing their darkest secrets and attacking each other's character to avoid suspicion. Also includes another \"Shame on Me\" and a sketch in which Jon helps people more closely resemble their pets.","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-20","episode_number":7,"episode_type":"standard","id":868507,"name":"Van Scheme","overview":"After ditching work to go on a bender, Jon and the crew claim black Satanists stole the van threw acid on Jon's face. Though Jon's missing van garners sympathy and support from the van loving community as well as taking his fame to new heights, things get complicated when real black Satanists begin to target Jon. Also includes \"Consensual,\" in which Jon attempts to find in various relationships are consensual, and Jon Benjamin's new 911, in which people call Jon so he can call 911 for them.","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-27","episode_number":8,"episode_type":"standard","id":868510,"name":"The Curse","overview":"While doing a story on the dangers of driving while receiving oral sex, Jon runs over an old gypsy woman. Her angry husband bestows the \"Curse of the Terrible Episode\". Initially incredulous, when he awakes to find he has a wife and young child and soon even switches bodies with him, Jon realizes the curse is real and he must endure every cliche in the book. Also includes Jon's attempt to shoplift from a surveillance shop, and a segment in which Jon examines how families are effected by having babies in comas, \"Hang Up on Them!\", in which Jon talks to cell phone users in New York and \"Reaction Jackson,\" Jon's escapades with an over-the-top friend.","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-03","episode_number":9,"episode_type":"standard","id":868509,"name":"House on the Lake","overview":"While interviewing a Broadway producer (Patton Oswalt), whom pioneered the new hit play \"House on the Lake,\" in which cell phone use by the audience is not only not banned but encouraged, Jon finds that his van has been repossessed while in the care of Jon's own producer, Dave. What the rest of the crew don't know is that Dave has been embezzling money to fund his own Broadway show called \"Secrets! Do Not Enter\". Now \"Secrets\" needs to be a hit or Jon's own show will be over. Also includes a tragic look at the life of a prominent phrase-maker who created and crumbled under a legacy, as well as \"Jew Them Up!\" in which two Orthodox Jews (Jon and David Cross) attempt to dispel Jewish stereotypes.","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-10","episode_number":10,"episode_type":"finale","id":868511,"name":"Smoking","overview":"After visiting a church that believes Jesus Christ smoked a pipe (and Metallica's guitarist owns one of them) Jon takes up smoking. He joins in with a gang of smokers which leads him to fall in love with a woman who speaks only french (and he likes the sound of it). Sadly she is in love with another man and leaves him after a scene in black and white. Also includes: Jon visits a cult leader that has predicted the end of the world as TODAY, even though he has falsely predicted the end of the world 17 times AND new segment: YOU GOT BURNED.","production_code":"","runtime":null,"season_number":1,"show_id":39522,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":50893,"poster_path":null,"season_number":1,"vote_average":0}}}