{"adult":false,"backdrop_path":null,"created_by":[{"id":15783,"credit_id":"5d87cd16336e01001117deb7","name":"Harlan Ellison","gender":2,"profile_path":"/7Y3x4iBiI0a10o7Jzc9lwC4cjX9.jpg"}],"episode_run_time":[60,50],"first_air_date":"1973-09-22","genres":[{"id":18,"name":"Drama"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"","id":3996,"in_production":false,"languages":["en"],"last_air_date":"1974-02-08","last_episode_to_air":{"id":278015,"name":"Space Precinct","overview":"Garth plays detective when some visiting space cops stop by.","vote_average":0,"vote_count":0,"air_date":"1974-02-08","episode_number":16,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null},"name":"The Starlost","next_episode_to_air":null,"networks":[{"id":110,"logo_path":"/uPoKSf3GtME7IZz4alnoWvc0nWx.png","name":"CTV","origin_country":"CA"}],"number_of_episodes":16,"number_of_seasons":1,"origin_country":["CA"],"original_language":"en","original_name":"The Starlost","overview":"A huge generational colony spacecraft called The Ark has gone off-course. Many of the descendants from the original crew and colonists are unaware that they are aboard a ship.","popularity":3.374,"poster_path":"/nBOH0b1KhF0KTAZL4ST7pXcU1cI.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"CA","name":"Canada"}],"seasons":[{"air_date":null,"episode_count":1,"id":11834,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"1973-09-14","episode_count":16,"id":11833,"name":"Season 1","overview":"","poster_path":"/kIyozVRklbQrUVmlTX0PBF6eSNA.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8,"vote_count":6,"season_data":{"1":{"_id":"525759d719c29531db16dab5","air_date":"1973-09-14","episodes":[{"air_date":"1973-09-14","episode_number":1,"episode_type":"standard","id":278004,"name":"Voyage of Discovery","overview":"In Cypress Corners Devon is desperate to marry Rachel, but the people are against the union because Rachel is promised to Garth.\n\nDevon is forced to flee, and finds himself on the other side of the iris door of the dome.  Here a screen explains to him that Cypress Corners is one of 53 similar biosphere domes aboard the Ark. \"\"In the year AD 2285, a series of atomic explosions threatened all earth life with extinction. The committee of scientists and philosophers selected segments of earth life to seed other worlds. Then they set about to build the Ark, the most monumental construction undertaken by humans, and when it was complete, it was launched on a centuries-long journey to the planets of Alpha Centauri.\"\" The screen added that during the journey an accident occurred in the Ark's vast controls and the only way to prevent its drifting off course and ultimate collision is to inform the bridge.\n\nDevon finds himself back in Cypress Corners where he is taken prisoner.  Garth releases him an","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":"/fZrmF7cC0pvommEdUIhF3mGHwua.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525759d719c29531db16db1d","adult":false,"gender":2,"id":15783,"known_for_department":"Writing","name":"Harlan Ellison","original_name":"Harlan Ellison","popularity":1.892,"profile_path":"/7Y3x4iBiI0a10o7Jzc9lwC4cjX9.jpg"},{"department":"Directing","job":"Director","credit_id":"525759d719c29531db16daf9","adult":false,"gender":2,"id":151399,"known_for_department":"Directing","name":"Harvey Hart","original_name":"Harvey Hart","popularity":1.306,"profile_path":"/30F5RFoDhduvxJmNnllM9D7S9eQ.jpg"}],"guest_stars":[]},{"air_date":"1973-09-21","episode_number":2,"episode_type":"standard","id":278005,"name":"Lazarus from the Mist","overview":"The segment begins with Devon, Rachel and Garth at the ARK's communications board trying in vain to contact other parts of the earthship. A sudden \"\"Emergency\"\" signal flashing from the Medical Center sends the trio In search of the trouble.\n\nJust as they reach their destination, they are ambushed by a club-wielding mob of raged-looking tube-dwellers who scream threats of death to the \"\"thieves\"\" who dare to invade the forbidden \"\"Dome of the Dead.\"\" Devon and Rachel narrowly escape by barricading themselves in the Medical Center, but Garth, arriving too late, is forced to flee into the darkness.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":"/rj24c3rxZVTHlzPCoZWidDkPyGE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-09-28","episode_number":3,"episode_type":"standard","id":278003,"name":"The Goddess Calabra","overview":"Devon, Rachel and Garth are exploring one of earthship Ark's huge freight chambers. Pushing past loud radiation warnings, they are suddenly lifted to the surface of the dome Omicron and find themselves in a strange city of geodisic domes and angular buildings.\n\nA siren sounds as the trio is bathed in a hot, blinding light and surrounded by soldiers demanding identification. But the moment they see Rachel, they drop reverently to their knees and hail her as the goddess Calabra.\n\nThe dumbfounded visitors are escorted to a palatial building where the Governor interrogates them as an awed court watches. Rachel's attempts to explain her origin are in vain, for the Governor indicates a portrait of the goddess Calabra who bears an extraordinary resemblance to Rachel and orders that arrangements be made at once for their wedding.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"525759d719c29531db16daf9","adult":false,"gender":2,"id":151399,"known_for_department":"Directing","name":"Harvey Hart","original_name":"Harvey Hart","popularity":1.306,"profile_path":"/30F5RFoDhduvxJmNnllM9D7S9eQ.jpg"}],"guest_stars":[]},{"air_date":"1973-10-05","episode_number":4,"episode_type":"standard","id":278006,"name":"The Pisces","overview":"Devon Rachel and Garth are awakened by a voice announcing the arrival of the \"\"Pisces.\"\" As the craft's crew complete their linkup, a man and two women emerge and identify themselves as Commander Garroway, Captain Janice and Navigator Teale. They explain that they were launched from the ARK ten years ago to search for settling places for the ARK's population. They are shocked to return to find the ARK off-course, her crew vanished.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-10-12","episode_number":5,"episode_type":"standard","id":278002,"name":"Children of Methuselah","overview":"Devon reports back to Rachel and Garth that he's found the ARK's backup bridge. The trio attempt to enter the restricted computer area, but are temporarily thwarted by an electronic security system.\n\nWhen they do get through, they are shocked to see a group of children efficiently operating the complex navigational consoles. The youngsters also demonstrate the ability to \"\"think pain\"\" upon others and use this device on Devon and Garth. Rachel and the two men are taken to their commander, a fourteen-year-old boy who immediately orders that the intruders be placed under arrest.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-10-26","episode_number":6,"episode_type":"standard","id":278007,"name":"And Only Man is Vile","overview":"This episode is set in a lavishly appointed spa in a dome called New Eden Leisure Village. At first it seems completely deserted, but Garth hears someone moaning. He finds a young girl seemingly in a state of shock and attempts to find out what's happened. The girl will not speak. However, Rachel is able to gain her confidence and determines that something horrible frightened everyone else away, and she was left behind in the confusion. The trio decide to stay and try to solve the mysterious evacuation.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525759d819c29531db16db6b","adult":false,"gender":0,"id":1211922,"known_for_department":"Writing","name":"Shimon Wincelberg","original_name":"Shimon Wincelberg","popularity":1.27,"profile_path":null}],"guest_stars":[]},{"air_date":"1973-11-02","episode_number":7,"episode_type":"standard","id":278008,"name":"Circuit of Death...","overview":"An electronics engineer, Sakharov, despairing of the slow death which he believes in store for all inhabitants of the Ark, bypasses the fail-safe mechanisms in order to activate the Ark's self-destruct system. In doing so, he inadvertently trips the fail-safe alarms, alerting Devon, Rachel and Garth.  Sakharov, with his daughter Valarie (who opposes his plan) intends to escape the Ark at the last moment aboard the rocket designed to jettison the Ark's logs and cassette recordings of Earth history prepared, 'for the benefit of other life in the universe'. But when the rocket fails to leave, Sakharov, with Devon and Garth's help, undertakes to rewire the fail-safe and stop the self-destruct. Since all the mechanisms are in micro circuits, they must be projected miniaturized into the circuits through an astounding electronic procedure. It is a race against time to re-connect the minute circuits before the whole Ark blows.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-11-09","episode_number":8,"episode_type":"standard","id":278010,"name":"Gallery of Fear","overview":"In one of the service modules of the Ark, Devon, Rachel and Garth come upon a bizarre pop-art museum. of the future where circuit-breakers, plastic cubes and the common incunabulia of the future is preserved in silent, empty grandeur stretching as far as the eye can see. Without warning, \"\"people\"\" begin to appear; but special people -- friends and relatives of Garth and Rachel with whom they enjoy emotional reunions. The final person to appear is a beautiful girl, the \"\"curator,\"\" Doris, in whom Devon is instantly attracted. But the girl reveals that all the \"\"people\"\" were recreations of Magnus, the most talented and sophisticated computer ever made. Doris assists Devon In his desire to recreate,through Magnus, the original Captain of the Ark in order to learn its secrets. But the recreation of the captain warns Devon that Doris is a creation of Magnus, too, and that she is part of Magnus' plan to get himself re-programmed for totally independent existence.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-11-16","episode_number":9,"episode_type":"standard","id":278009,"name":"Mr. Smith of Manchester","overview":"Devon, Rachel, and Garth are lured into a dome where the inhabitants are trapped in a highly industriaiized, hell-bent-for-leather society which is choking itself to death on its own noxious effluents; the purification and filtering system of the dome simply cannot keep up with the mad pace these people have set for themselves. The leader of the Liverpudlians is Mr. Smith, an absolute ruler who knows his people would displace him if he took the hard but necessary decision to simplify their lifestyle. Smith is finally overthrown and the poliutive machines stilled as our three push onward.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525759d819c29531db16dbb1","adult":false,"gender":2,"id":1214933,"known_for_department":"Writing","name":"Arthur Heinemann","original_name":"Arthur Heinemann","popularity":1.099,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"525759d819c29531db16db9d","order":500,"adult":false,"gender":2,"id":1232403,"known_for_department":"Acting","name":"Ed Ames","original_name":"Ed Ames","popularity":5.599,"profile_path":"/9EqiBVqjtlzIVdJdpHBY0wBBsED.jpg"}]},{"air_date":"1973-11-23","episode_number":10,"episode_type":"standard","id":278011,"name":"The Alien Oro","overview":"Rachel, Devon and Garth come to an uninhabited dome where they find Oro (Walter Koenig), an alien from the planet Xar who has been living a Robinson Crusoe style existence on the Ark for several years. Oro,has acquired the services of Ydana as his' girl Friday. Ydana is an inteligent but fickle woman, a wanderer from another dome. She has been helping Oro repair his space ship in the hope that she might find a \"paradise\" on Xar. By trickery, Oro commnands the services of Devon, Rachel and Garth to aid him in repairing his ship.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1973-11-30","episode_number":11,"episode_type":"standard","id":278014,"name":"The Astro Medics","overview":"Devon, venturing unknowingly into a quarantine area, is stricken by radiation sickness and is near death when a father-son medical team from a nearby shuttle clinic -- Isolated since the Ark's disaster -- rescue him. They literally bring him back from the dead -- but tell Rachel and Garth that sensitive, sophisticated neuro surgery will be necessary to restore Devon as a reasoning human being. And there is no time or this surgery: the shuttle clinic is about to cast off from the Ark, to answer a distress signal from a nearby planet threatened by a plague. The doctors are persuaded to stay long enough to try the operation -- and while the window for their escape is still open, leave the Ark having restored Devon to life and health.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"525759d819c29531db16dc3c","adult":false,"gender":2,"id":178275,"known_for_department":"Writing","name":"Paul Schneider","original_name":"Paul Schneider","popularity":1.152,"profile_path":null},{"department":"Directing","job":"Director","credit_id":"525759d819c29531db16dc50","adult":false,"gender":2,"id":40378,"known_for_department":"Directing","name":"George McCowan","original_name":"George McCowan","popularity":2.259,"profile_path":"/AtRuEzEFPyuDHHDIouKIW4T0VzK.jpg"}],"guest_stars":[]},{"air_date":"1973-12-07","episode_number":12,"episode_type":"standard","id":278013,"name":"The Implant People","overview":"The trio happen on a dome (after Garths crossbow is stolen) inhabited by people ruled by fear via electronic brain implants.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"525759d819c29531db16dc1b","adult":false,"gender":2,"id":534222,"known_for_department":"Directing","name":"Joseph L. Scanlan","original_name":"Joseph L. Scanlan","popularity":2.997,"profile_path":null},{"department":"Writing","job":"Writer","credit_id":"525759d819c29531db16dc07","adult":false,"gender":2,"id":15922,"known_for_department":"Writing","name":"John Meredyth Lucas","original_name":"John Meredyth Lucas","popularity":2.228,"profile_path":null}],"guest_stars":[]},{"air_date":"1974-01-11","episode_number":13,"episode_type":"standard","id":278012,"name":"The Return of Oro","overview":"Oro (Walter Koenig) returns to the Ark to pilot the ship to his home planet of Xar. Granted special Gold Security Clearance and summoned peremptorily to Master Control Devon is surprised to find all the Ark systems monitored by mobile robots commanded by Tau Zeta, a \"female\" holding flag command rank. But the real power is exercised by Oro, (of \"The Alien Oro\" episode) who has been sent back to the drifting space vessel to seize it as \"salvage\" for the planet Xar. To our 4rloD however, Oro represents this trip to landfall a~ a generous act to solve the Ark's problems. To get back to their own lives quickly, Rachel and Garth welcome Oro's leadership and support him. But Devon, who learns from the computers that life on Xar, for humans, would be at the level of vegetables, resists. Oro challenges Devon to a \"debate to the death\", to be scored objectively by the computers on a game-show type of scoreboard. Though Oro is a superior being, Devon defeats him because the computers, built by humans","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1974-01-25","episode_number":14,"episode_type":"standard","id":278017,"name":"Farthing's Comet","overview":"A spacewalk is undertaken when a comet threatens the ark.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1974-02-01","episode_number":15,"episode_type":"standard","id":278016,"name":"Beehive","overview":"Rachel, Garth and Devon are trapped inside a giant food production center for the ark. It is a giant beehive where some sonic experiments are causing the natives to become restless.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"525759d819c29531db16dc50","adult":false,"gender":2,"id":40378,"known_for_department":"Directing","name":"George McCowan","original_name":"George McCowan","popularity":2.259,"profile_path":"/AtRuEzEFPyuDHHDIouKIW4T0VzK.jpg"}],"guest_stars":[]},{"air_date":"1974-02-08","episode_number":16,"episode_type":"finale","id":278015,"name":"Space Precinct","overview":"Garth plays detective when some visiting space cops stop by.","production_code":"","runtime":null,"season_number":1,"show_id":3996,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":11833,"poster_path":"/kIyozVRklbQrUVmlTX0PBF6eSNA.jpg","season_number":1,"vote_average":0}}}