{"adult":false,"backdrop_path":"/140VyEfHlMTqRMkODF1oWw37eDH.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2012-01-14","genres":[{"id":10759,"name":"Action & Adventure"}],"homepage":"http://www.conspiracy365.com/","id":40392,"in_production":false,"languages":["en"],"last_air_date":"2012-12-01","last_episode_to_air":{"id":872714,"name":"December","overview":"With only days left before the Singularity runs out, Cal, Boges, Winter and Nelson fly to Ireland. Can they crack the code and find the treasure? Will Cal complete his father's legacy before the clock strikes 12? Professor Brinsley helps Cal and the team uncover the last two lines of the Riddle. This is it. They know what the next step is — and hopefully it will lead them to the Singularity! Sligo, Bruno and Rafe have also hit Irish soil. The clock is ticking. Will they catch up with Cal? Will Cal claim the Singularity in time? As true intentions and buried secrets rise to the surface, Cal, Boges and Winter will soon discover what they're made of. Who will be the last one standing?","vote_average":0,"vote_count":0,"air_date":"2012-12-01","episode_number":12,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null},"name":"Conspiracy 365","next_episode_to_air":null,"networks":[{"id":6122,"logo_path":null,"name":"TVS Sydney","origin_country":"AU"}],"number_of_episodes":12,"number_of_seasons":1,"origin_country":["AU"],"original_language":"en","original_name":"Conspiracy 365","overview":"Conspiracy 365 is a 12-part Australian television miniseries based on the novels written by Gabrielle Lord. It follows the adventures of Callum Ormond, a 15 year old who is forced to become a fugitive as he searches for the truth behind the death of a family member.","popularity":1.481,"poster_path":"/viRhPiaNmrlehrGrX7wQqe1k1ji.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2012-01-14","episode_count":12,"id":51316,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5,"vote_count":1,"season_data":{"1":{"_id":"52595cfe760ee3466192e57e","air_date":"2012-01-14","episodes":[{"air_date":"2012-01-14","episode_number":1,"episode_type":"standard","id":872703,"name":"January","overview":"At his father's funeral, 15-year-old Cal Ormond is warned about the Ormond Singularity, a deadly family mystery that kills those who seek it. Can Cal survive the next 365 days and solve the mystery? After returning from Tom's funeral, the Ormond family discovers their home has been burgled. Is it simply bad luck or something more? Cal soon realises nothing is coincidental after his uncle Rafe is shot and his younger sister Gabbi is knocked unconscious in a home attack. What is the Ormond Singularity? Why is it worth killing for? With the police believing Cal assaulted his uncle and sister, he has no choice but to run. He needs to clear his name and find out what the Singularity is. 334 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-04","episode_number":2,"episode_type":"standard","id":872704,"name":"February","overview":"Cal Ormond is living on the streets, wanted for a crime he didn't commit. As he continues to work on the clues to the Ormond Singularity, a mysterious girl, Winter, saves him from certain death. But can Cal really trust her? Boges warns Cal to stay away from Winter. Her guardian is Vulkan Sligo, after all. But when Winter recognises the Angel from one of Tom's cryptic drawings, Cal is forced to take a chance and follow her lead. After catching sight of a boy who looks exactly like him, Cal starts to wonder if being on the run is making him lose the plot. But what if it's not? Could Cal have a double out there? 306 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Doctor Van dooren","credit_id":"607ac284ea89f500773b2f6f","order":503,"adult":false,"gender":2,"id":1934510,"known_for_department":"Acting","name":"Jeffery Richards","original_name":"Jeffery Richards","popularity":0.625,"profile_path":"/fMkHWLSb2AyB8czYoE86wCV3Ovp.jpg"}]},{"air_date":"2012-03-03","episode_number":3,"episode_type":"standard","id":872705,"name":"March","overview":"Cal enlists the help of safe-cracking recluse, Repro, to break into Oriana's house and steal the Ormond Riddle. But his moment of glory is short-lived when he realises a key piece of the Riddle is missing. Sligo and Oriana aren't the only people on Cal's trail. Detective McGrath is using all his resources to catch the 'psycho kid'. When one of McGrath's men stumbles upon Cal's hideout, Cal resorts to desperate measures to escape. Boges's suspicion of Winter increases, and Cal is forced to try and ease the tension between them. But Cal knows Boges has a point: how do Oriana and Sligoseem to find Cal at every turn? Could Winter be a double agent? 275 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Madeleine","credit_id":"5eaf3e4523be46001b217b16","order":500,"adult":false,"gender":1,"id":2359882,"known_for_department":"Acting","name":"Ruby Duncan","original_name":"Ruby Duncan","popularity":1.776,"profile_path":"/7DAeB4DAsbaCD7SNUkdVpneU6jf.jpg"}]},{"air_date":"2012-04-07","episode_number":4,"episode_type":"standard","id":872706,"name":"April","overview":"Cal battles to outrun Jake and Kelvin as they pursue him over rough terrain. Cal's mission to get to Uncle Bart's is sidelined after he discovers Gabbi's life support is about to be switched off. Cal needs to get back to the city and fast. An unusual opportunity presents itself when retiree Melba Snipe spies Cal and offers him a lift in her boot. Will Cal take the risk and trust her? Desperate not to lose his sister, Cal sneaks into the hospital and pleads with Gabbi to wake up. But McGrath is on the move and Cal doesn't have much time before he catches up with him. 245 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Madeleine","credit_id":"5eaf3e4523be46001b217b16","order":500,"adult":false,"gender":1,"id":2359882,"known_for_department":"Acting","name":"Ruby Duncan","original_name":"Ruby Duncan","popularity":1.776,"profile_path":"/7DAeB4DAsbaCD7SNUkdVpneU6jf.jpg"},{"character":"Country Cop","credit_id":"5eb2c449edeb43001ccb27aa","order":502,"adult":false,"gender":2,"id":1903216,"known_for_department":"Acting","name":"Shane Lee","original_name":"Shane Lee","popularity":1.62,"profile_path":"/w8OGKKrvMOMefgSIGjFoSqGqEBT.jpg"}]},{"air_date":"2012-05-05","episode_number":5,"episode_type":"standard","id":872707,"name":"May","overview":"Cal wakes up imprisoned in a psychiatric hospital. Boges and Winter put their differences aside in a bid to bust Cal out and get him to his great-uncle Bart's. Does Bart hold the key to the Singularity? In the mental institution, Cal is told his name is Ben Galloway. Cal is disorientated and confused-maybe he isn't who he thinks he is. If Winter and Boges are going to get Cal out, they'll have to snap him out of his medicated haze. Cal finds his great-uncle Bart, an old timer who is sceptical about the Singularity and Cal. However, when Cal and Bart discover a shared passion for planes, Cal warms to a man he barely knows and Bart reveals key information to solving the Singularity. But with Oriana's and Sligo's men in pursuit, these Ormonds may not have as much time as they think. 214 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Doctor Van dooren","credit_id":"607ac284ea89f500773b2f6f","order":503,"adult":false,"gender":2,"id":1934510,"known_for_department":"Acting","name":"Jeffery Richards","original_name":"Jeffery Richards","popularity":0.625,"profile_path":"/fMkHWLSb2AyB8czYoE86wCV3Ovp.jpg"}]},{"air_date":"2012-06-02","episode_number":6,"episode_type":"standard","id":872708,"name":"June","overview":"The stakes are raised when small-town cops hunt down Cal after his narrow escape in Uncle Bart's plane. Cracks start to appear in Cal and Boges's friendship as Cal pushes on with a plan to steal the Ormond Jewel. Every cop within a 50 km radius is looking for Cal. Can he get back to the city undetected? A look at a picture of the Ormond Jewel delivers a surprising revelation for Winter-she's seen it before and she knows who has it. Boges continues to struggle with Cal's risk-taking, especially after Cal contacts a fellow street kid, Griff, in a bid to get fast cash. Meanwhile, Winter reveals the tragic truth behind why her birthday will never be a celebration. 184 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Doctor Van dooren","credit_id":"607ac284ea89f500773b2f6f","order":503,"adult":false,"gender":2,"id":1934510,"known_for_department":"Acting","name":"Jeffery Richards","original_name":"Jeffery Richards","popularity":0.625,"profile_path":"/fMkHWLSb2AyB8czYoE86wCV3Ovp.jpg"}]},{"air_date":"2012-07-07","episode_number":7,"episode_type":"standard","id":872709,"name":"July","overview":"The double key code still stumps Cal. He travels to a secluded convent to ask his great-aunt Millicent what she knows about the mystery. Can Cal get a woman who hasn't spoken in 13 years to reveal her secrets? Cal looks through Millicent's belongings and discovers letters from Piers Ormond, his great-great-grandfather. The letters reveal what Cal suspected: the two missing lines of the Riddle are the key to the Singularity. Cal chases down the Ormond family solicitor, Sheldrake Rathbone, in a bid to get Piers Ormond's will. But not all legal eagles are honest and upstanding. Cal's desperation for answers may be his undoing. Is this the end for the 'psycho kid'? 153 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-04","episode_number":8,"episode_type":"standard","id":872710,"name":"August","overview":"Cal, in police custody, is confronted by an unforgiving McGrath. Gabbi wakes from her coma and Oriana uses her as leverage to get Cal and his resources. But even the best laid plans can go wrong. Cal, no longer a naive teen, gets past the police and breaks out of hospital. He's helped by a stranger, Nelson Sharkey, a private investigator in the right place at the right time. Cal is given a dream 16th birthday present: he learns that Gabbi has woken up from her coma. But just as he gets his sister back, she is taken away again, this time by Oriana. Cal loves Gabbi and will do anything to get her back, even sacrifice himself. 122 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Doctor Van dooren","credit_id":"607ac284ea89f500773b2f6f","order":503,"adult":false,"gender":2,"id":1934510,"known_for_department":"Acting","name":"Jeffery Richards","original_name":"Jeffery Richards","popularity":0.625,"profile_path":"/fMkHWLSb2AyB8czYoE86wCV3Ovp.jpg"}]},{"air_date":"2012-09-01","episode_number":9,"episode_type":"standard","id":872711,"name":"September","overview":"Boges, struggling with Gabbi's near-death at the river, pulls out of the game. Gabbi notices Emily is acting strangely. Cal pushes to steal back what Oriana took from him. Is his lucky streak about to end? After Gabbi's kidnapping and near drowning, Boges decides he's had enough. Cal is dismayed, but is sidetracked by seeing the boy who looks exactly like him. Cal follows him home with startling results. Cal and Winter unlock the mystery behind the Singularity. This is bigger than Cal could have ever imagined. They need Bogess help to bug Orianas house and find where shes keeping the clues. But Cal gets caught and Oriana orders her boys to dispose of Cal permanently. 92 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-06","episode_number":10,"episode_type":"standard","id":872713,"name":"October","overview":"Cal wakes in the forest very much alive. Why did Kelvin spare his life? And what are the numbers written on Cal's arm? Cal, Boges and Winter hatch a plan to get rid of one of their foes for good. Cal makes his way back to Winter's place. With Boges back on board, they now have a chance to get back everything Oriana took. Meanwhile, Sligo gets in touch with Oriana and asks her join him in going after Cal. But they have no idea that a little birdy is listening to their conversation. Will Oriana's ego be her undoing? Cal, Winter and Boges are on a mission to expose their enemies. But sometimes the truth can be as unfavourable as a lie. When Winter finds her father's will, she gets closer to uncovering what happened between Sligo and her parents. And it isn't what she expects. 61 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Logger","credit_id":"5eb090f7edeb430023c92968","order":501,"adult":false,"gender":2,"id":2625847,"known_for_department":"Acting","name":"Chris Bidlo","original_name":"Chris Bidlo","popularity":0.98,"profile_path":"/eD7q7dwAOFT4ohEKb56jSU7b6rc.jpg"},{"character":"Doctor Van dooren","credit_id":"607ac284ea89f500773b2f6f","order":503,"adult":false,"gender":2,"id":1934510,"known_for_department":"Acting","name":"Jeffery Richards","original_name":"Jeffery Richards","popularity":0.625,"profile_path":"/fMkHWLSb2AyB8czYoE86wCV3Ovp.jpg"}]},{"air_date":"2012-11-03","episode_number":11,"episode_type":"standard","id":872712,"name":"November","overview":"A dying man confesses he kidnapped Cal and his twin Ryan 15 years ago and Cal finally gets Ryan to accept the difficult truth. Winter confronts Sligo and discovers what really happened to her parents. After narrowly evading the police yet again, Cal asks Nelson for help. He wants a meeting with Murray Toe Cutter Durham, a hardened criminal who he suspects knows something about the Ormond Singularity. But Toe Cutters connection to Cal is more personal than he can possibly imagine. Ryan finally accepts that he and Cal are brothers. And while Rafe confesses the reason behind his rift with Tom, Winter shows Sligo her true colours. What will a hard man like Vulkan Sligo do after his heart has been broken? 31 days to go.","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Doctor Van dooren","credit_id":"607ac284ea89f500773b2f6f","order":503,"adult":false,"gender":2,"id":1934510,"known_for_department":"Acting","name":"Jeffery Richards","original_name":"Jeffery Richards","popularity":0.625,"profile_path":"/fMkHWLSb2AyB8czYoE86wCV3Ovp.jpg"}]},{"air_date":"2012-12-01","episode_number":12,"episode_type":"finale","id":872714,"name":"December","overview":"With only days left before the Singularity runs out, Cal, Boges, Winter and Nelson fly to Ireland. Can they crack the code and find the treasure? Will Cal complete his father's legacy before the clock strikes 12? Professor Brinsley helps Cal and the team uncover the last two lines of the Riddle. This is it. They know what the next step is — and hopefully it will lead them to the Singularity! Sligo, Bruno and Rafe have also hit Irish soil. The clock is ticking. Will they catch up with Cal? Will Cal claim the Singularity in time? As true intentions and buried secrets rise to the surface, Cal, Boges and Winter will soon discover what they're made of. Who will be the last one standing?","production_code":"","runtime":60,"season_number":1,"show_id":40392,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":51316,"poster_path":null,"season_number":1,"vote_average":0}}}