{"adult":false,"backdrop_path":"/eW2fBeGQgSc28zQfuhQ89G2xQPI.jpg","created_by":[{"id":28249,"credit_id":"525354c819c295794013c2f1","name":"Peter Chung","gender":2,"profile_path":"/r0WWewfDVpsVpnby26BI0nB1gx3.jpg"}],"episode_run_time":[30],"first_air_date":"1991-09-01","genres":[{"id":16,"name":"Animation"},{"id":10765,"name":"Sci-Fi & Fantasy"},{"id":10759,"name":"Action & Adventure"}],"homepage":"http://www.mtv.com/shows/aeon_flux/series.jhtml","id":406,"in_production":false,"languages":["en"],"last_air_date":"1995-10-10","last_episode_to_air":{"id":21138,"name":"End Sinister","overview":"Trevor has designed a satellite, Aldis B  which will help speed up the evolution of humanity but could also kill off half the living population of the Earth. Æon, determined to stop Trevor from using the satellite, steals and buries the remote. Æon, avoiding the search parties, finds a hibernation pod holding a strange alien with removable eyes, psionic abilities. The alien does not  breathe, eat or have genitals. The Alien is captured by one of the search parties but saves Æon when one of its captor throws a fire bomb. Trevor examines the Alien and sees signs of exposure to Aldis B.\n\nTrevor heads off to find the alien's ship. The Alien escapes and follows him, finding both Trevor and Æon at the ship. Aldis B has killed off everyone on the ship leaving only the alien who had been awaiting rescue in its pod. Æon and Trevor make love in the ship while the Alien watches. The next day, the Alien finds Æon and offers her one of its own eyes but Æon refuses.  Æon offers to show the Alien human sexual pleasure ...","vote_average":5.5,"vote_count":2,"air_date":"1995-10-10","episode_number":10,"episode_type":"finale","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/3moVcAwPumbkRyySCKUYm2kIxFx.jpg"},"name":"Ӕon Flux","next_episode_to_air":null,"networks":[{"id":33,"logo_path":"/w4qtv7xBkSVsbOQdSzjUjlyOuSr.png","name":"MTV","origin_country":"US"}],"number_of_episodes":16,"number_of_seasons":3,"origin_country":["US"],"original_language":"en","original_name":"Ӕon Flux","overview":"Æon Flux is set in a bizarre, dystopian future world. The title character is a tall, leather-clad secret agent from the nation of Monica, skilled in assassination and acrobatics. Her mission is to infiltrate the strongholds of the neighboring country of Bregna, which is led by her sometimes-nemesis and sometimes-lover Trevor Goodchild. Monica represents a dynamic anarchist society, while Bregna embodies a police state.","popularity":21.386,"poster_path":"/3745n05zXNMfWwkXMcCiF64838s.jpg","production_companies":[{"id":6041,"logo_path":null,"name":"Colossal Pictures","origin_country":""},{"id":6042,"logo_path":null,"name":"MTV Animation","origin_country":"US"},{"id":8136,"logo_path":"/1JrepkIG6EsdklWZ9tZbE0uRHvj.png","name":"MTV","origin_country":""}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"1991-08-31","episode_count":6,"id":1204,"name":"Specials","overview":"Review of the way they do the series and a review of the weapons and artifacts.","poster_path":"/zIy9W5hCPnvoQUkkjqwG1VPmdQ6.jpg","season_number":0,"vote_average":0},{"air_date":"1991-09-01","episode_count":1,"id":1207,"name":"Season 1","overview":"Stand alone single short episode.","poster_path":"/6g7PxNn2JpAHiBZ61PHLmlgBe3r.jpg","season_number":1,"vote_average":7.8},{"air_date":"1992-09-22","episode_count":5,"id":1206,"name":"Season 2","overview":"Stand alone short episodes with no coherent story line connecting them.","poster_path":"/q076ptZSEwPKvsLZ52xS7SThHYg.jpg","season_number":2,"vote_average":6.4},{"air_date":"1995-08-08","episode_count":10,"id":1205,"name":"Season 3","overview":"Full length episodes with a continuing story.","poster_path":"/usU9wuvMqKiWon3qEx0i23lUJYR.jpg","season_number":3,"vote_average":5.7}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.576,"vote_count":119,"season_data":{"1":{"_id":"525354c219c295794013c04f","air_date":"1991-09-01","episodes":[{"air_date":"1991-09-01","episode_number":1,"episode_type":"finale","id":21137,"name":"Pilot","overview":"The episode starts with Æon catching a fly with her eyelashes. We then cut to an apparent battle between Monican agents and Breen forces, with Æon liberally mowing down dozens of soldiers on her quest to apparently assassinate a Breen Official, though most of them are already sick and dying from a strange disease carried by an azure beetle. As hundreds of soldiers die in the sewers, Trevor Goodchild finds and takes in one of the beetles, hiding it in his finger and carrying it with his lover to the top of the building where Æon's target is sleeping. While Æon has traveled up onto the roof she unwittingly picked up a tack from a loose cable fastening on the sole of her boot.","production_code":"","runtime":30,"season_number":1,"show_id":406,"still_path":"/6RQuIRfB9GtutQoiPaYtzvPehBA.jpg","vote_average":7.8,"vote_count":18,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Stand alone single short episode.","id":1207,"poster_path":"/6g7PxNn2JpAHiBZ61PHLmlgBe3r.jpg","season_number":1,"vote_average":7.8},"2":{"_id":"525354c119c295794013c041","air_date":"1992-09-22","episodes":[{"air_date":"1992-09-22","episode_number":1,"episode_type":"standard","id":21132,"name":"Gravity","overview":"As the episode opens, Æon and Trevor are kissing through the windows of their transports, with the former being in a plane and the latter being in a train. As they do, Trevor uses his tongue to open up Æon's fake tooth and place a rolled up picture inside. After the two of them part, Æon spies an industrial vehicle driving past. Æon then retrieves the picture from her tooth to find it is a photo of a fellow passenger, and a suitcase. She climbs out and moves along the side of the plane to spy on the man, who is reading documents from the same suitcase. Æon must jump mid-air to the back of the plane to get inside, but she misses and falls ...","production_code":"","runtime":3,"season_number":2,"show_id":406,"still_path":"/lljspQWRuVJHYNTyDNmsp8Xkgjz.jpg","vote_average":6.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1992-11-03","episode_number":2,"episode_type":"standard","id":21135,"name":"Night","overview":"In this episode, Æon is on an assassination mission. She infiltrates her target's home via a maintenance ladder. On her entry she falls from the ladder, and notices she is spied on by a security camera. While walking down a hallway she notices a room where the security camera recorder is being kept, and enters. She goes to destroy the tape but at the last minute decides to review the footage. The picture is faulty because of a loose video jack shorting against an air vent. Æon goes to fix the connection but spills coffee on her gloved arm. Unnoticed by the departing Æon, footage of another intruder previously entering the building plays on the monitor. While washing her arm, Æon accidentally sprays water on herself in the bathroom's shower and spoils her signature hairstyle ...","production_code":"","runtime":4,"season_number":2,"show_id":406,"still_path":"/7Nt27AhZbBvwCBpHwOaIpRsKFks.jpg","vote_average":6.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1992-11-10","episode_number":3,"episode_type":"standard","id":21136,"name":"Leisure","overview":"Æon enters her living quarters to find a container of eggs she was keeping in her refrigerator but she finds that Trevor, who is in a cupboard, has had them all. Angry, Æon leaves her apartment but before venturing outside the Monican base she witnesses another agent fail to successfully complete jumping through a complex climbing frame. Æon steps up to practice jumping through, just as the other female agent walks away, and flawlessly executes the complex routine. Later, she enters a strange base and collects some of the same eggs seen earlier in her apartment. Resisting the urge to leave, Æon breaks one of the eggs and analyses the broken contents under a portable microscope ...","production_code":"","runtime":3,"season_number":2,"show_id":406,"still_path":"/lRUIL1KoB6I9UVfx29Dj0nMogxM.jpg","vote_average":6,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1992-11-17","episode_number":4,"episode_type":"standard","id":21133,"name":"Tide","overview":"In the episode, Æon and her red-clad companion are descending from the high floor of a sea base carrying a key. As the two enter a lift, they are attacked by Trevor who is easily knocked out by Æon but not before he pushes all the lift's buttons at once sending the lift down through all the levels. She handcuffs him but drops the floor number attached to the key leaving her no choice but to go down level by level searching for the locker that the key opens. On each floor, Æon shoots up the stairwell to keep a pursuing Breen soldier at bay then tests the key on that floor's locker and finally shoots a distant sky hook that is attempting to latch on to the railing of a small, distant, water level platform. Each time Æon exits the lift, Trevor and the red-clothed agent make love with the agent springing back to either guard Trevor or try to retrieve the number. Æon begins to suspect ...","production_code":"","runtime":4,"season_number":2,"show_id":406,"still_path":"/rzdqudWjrJtvSdYrgLtH32mqBli.jpg","vote_average":6.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1992-11-24","episode_number":5,"episode_type":"finale","id":21134,"name":"War","overview":"This episode focuses on a massive battle between the leather-clad, dark-haired Monicans and the Aryan soldiers of Bregna with Æon Flux in the thick of battle. During the course of the battle, Æon cuts down dozens of guards before she is knocked down by a Breen guard who had been playing dead. Æon sees another Monican agent creeping up on the guard and keeps him distracted with alluring tongue movements but the Breen sees the Monican agent and ...","production_code":"","runtime":5,"season_number":2,"show_id":406,"still_path":"/vdjBl1rq2pdPHXEiR9BV3Go5sXv.jpg","vote_average":6.5,"vote_count":2,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"Stand alone short episodes with no coherent story line connecting them.","id":1206,"poster_path":"/q076ptZSEwPKvsLZ52xS7SThHYg.jpg","season_number":2,"vote_average":6.4},"3":{"_id":"525354c119c295794013c033","air_date":"1995-08-08","episodes":[{"air_date":"1995-08-08","episode_number":1,"episode_type":"standard","id":21145,"name":"Utopia or Deutoronopia","overview":"In the episode, Æon has infiltrated Bregna at a time when Trevor Goodchild has accepted power 'temporarily' from the kidnapped chairman Clavius. Trevor quickly enacts a policy of 'complete openness', installing cameras all across Bregna which gives him ultimate control over the people. Gildemere, a Breen soldier loyal to Clavius, is plotting against the new Chairman guessing rightly that Trevor was the mastermind behind the kidnapping. Trevor's reasons for the coup are two-fold; he gains ultimate power in Bregna, and uses Clavius' body to create an isolated place locked with a strange ornate key ...","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/498UFCtLPuqZWmtJoU1YclPfryv.jpg","vote_average":5.5,"vote_count":2,"crew":[{"department":"Directing","job":"Director","credit_id":"525354c419c295794013c1a9","adult":false,"gender":2,"id":28249,"known_for_department":"Visual Effects","name":"Peter Chung","original_name":"Peter Chung","popularity":2.834,"profile_path":"/r0WWewfDVpsVpnby26BI0nB1gx3.jpg"}],"guest_stars":[]},{"air_date":"1995-08-15","episode_number":2,"episode_type":"standard","id":21130,"name":"Isthmus Crypticus","overview":"Trevor has a pair of humanoid birds called Seraph-Trevs held captive, a Male and Female. Trevor is attempting to seduce the Female. Meanwhile, another scientist named Ilbren is planning to have his way with the Female even going as far as trying to employ Æon to capture the Female offering the Male in return. Their meeting is interrupted by a mechanical tentacle which Ilbren fends off with a swarm of robot wasps. The Male Seraph-Trev is securely held in a separate cell and reduced to a state of abject misery by the separation from his mate. Æon plans to free them from Ilbren and Trevor's designs and to do so she employs an old friend of hers, Una, to translate directions to the Birds' chambers. Una is a social misfit like Æon and has apparently fallen in love with the Male Bird ...","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/a3ydKwN5U4r1zdDZXOKz44lmtYb.jpg","vote_average":6,"vote_count":2,"crew":[],"guest_stars":[{"character":"","credit_id":"525354c219c295794013c073","order":502,"adult":false,"gender":2,"id":1215850,"known_for_department":"Acting","name":"Matt K. Miller","original_name":"Matt K. Miller","popularity":2.415,"profile_path":null}]},{"air_date":"1995-08-22","episode_number":3,"episode_type":"standard","id":21144,"name":"Thanatophobia","overview":"The episode starts with a pair of boys play-fighting while another claps to mimic the sound of heavy punches. That boy later flicks a pebble into the path of one of the border turrets activating it and watching the resulting spectacle. Trevor Goodchild is being pressured by the government into making the border more intimidating, despite his desire to make people stay in Bregna through the 'power of ideas'. To this end, he secretly allows Æon to come in and bomb the factory where the parts for the wall are being made. In a parallel and intertwined storyline, two Breen lovers, Onan and Sybil, seek to escape from Bregna into Monica through a gap in the frontier ...","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/u5wNZCWjS1NSSdbHtdRmAVo5ZuV.jpg","vote_average":5.5,"vote_count":2,"crew":[{"department":"Directing","job":"Director","credit_id":"525354c419c295794013c1a9","adult":false,"gender":2,"id":28249,"known_for_department":"Visual Effects","name":"Peter Chung","original_name":"Peter Chung","popularity":2.834,"profile_path":"/r0WWewfDVpsVpnby26BI0nB1gx3.jpg"}],"guest_stars":[{"character":"","credit_id":"525354c519c295794013c1dd","order":501,"adult":false,"gender":0,"id":51958,"known_for_department":"Acting","name":"Julia Fletcher","original_name":"Julia Fletcher","popularity":0.84,"profile_path":null},{"character":"","credit_id":"525354c219c295794013c0c3","order":505,"adult":false,"gender":2,"id":21694,"known_for_department":"Acting","name":"Jack Fletcher","original_name":"Jack Fletcher","popularity":1.96,"profile_path":"/wO1L8gexVH3xj6oI2yhM546G8pP.jpg"}]},{"air_date":"1995-08-29","episode_number":4,"episode_type":"standard","id":21142,"name":"A Last Time For Everything","overview":"As the episode starts, Goodchild has perfected a method of copying humans. Determined to put an end to the operation, Æon and a fellow agent, Scaphandra who is a double-agent for Bregna,  cross the border into Bregna. Scaphandra has lost parts of her feet during a previous crossing  and has had hands transplanted to replace the missing parts of her feet. As Æon rushes towards Trevor's base of operations, Scaphandra is captured and taken to Trevor Goodchild who takes a sample of her for copying. Æon comes in, frees Scaphandra and tackles Trevor about the ethics and inner purposes of his operation. Deliberately presenting an opportunity for Trevor,  Æon allows him to take a sample of her though Æon smashes Scaphandra's sample. After Æon leaves, Trevor copies Æon for himself.\n\nIt is revealed to be a complex plot by Æon to ...","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/1TYRoB28OgiFEpG16Qfs7IsIU5A.jpg","vote_average":6.5,"vote_count":2,"crew":[{"department":"Directing","job":"Director","credit_id":"525354c419c295794013c1a9","adult":false,"gender":2,"id":28249,"known_for_department":"Visual Effects","name":"Peter Chung","original_name":"Peter Chung","popularity":2.834,"profile_path":"/r0WWewfDVpsVpnby26BI0nB1gx3.jpg"}],"guest_stars":[{"character":"","credit_id":"525354c419c295794013c14f","order":500,"adult":false,"gender":2,"id":1216195,"known_for_department":"Acting","name":"Paul Raci","original_name":"Paul Raci","popularity":4.921,"profile_path":"/1Vcfo559FK4JmleDbkaaGzGPJks.jpg"}]},{"air_date":"1995-09-05","episode_number":5,"episode_type":"standard","id":21140,"name":"The Demiurge","overview":"The story starts with a battle between Monican agents and Breen forces. Æon and the Monicans had captured an astral being called the Demiurge  which is threatening to dangerously warp people's view of the world and are preparing to launch it into space aboard a rocket. Trevor is determined to stop them believing that the Demiurge will ensure a lasting peace for humanity. The Demiurge instills parts of itself in earthly Avatars: a cat, a bird and a resurrected Monican agent named Nader before the rocket launch is attempted ....","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/vTM0ZjwZ0KMVMQeW3owdK1qXkjP.jpg","vote_average":5.5,"vote_count":2,"crew":[],"guest_stars":[{"character":"","credit_id":"525354c519c295794013c1dd","order":501,"adult":false,"gender":0,"id":51958,"known_for_department":"Acting","name":"Julia Fletcher","original_name":"Julia Fletcher","popularity":0.84,"profile_path":null}]},{"air_date":"1995-09-12","episode_number":6,"episode_type":"standard","id":21131,"name":"Reraizure","overview":"At the start of the episode Æon is preparing to penetrate a Breen prison disguised as a guard. In the prison, Trevor is keeping compromising photographs of himself and Æon having sex with the price of their return being a Narghile. Narghiles are a mysterious controlled species, apparently immortal, that produce a memory-wiping drug called 'Bliss'. During her escape, Æon runs into a female prisoner called Muriel killing her in self defense after mistaking her for a guard. As Æon escapes, she encounters and leaves with a Monican called Rordy ...","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/rdN4lA4YM7ixiFZmlm2yHxzDkEH.jpg","vote_average":5.5,"vote_count":2,"crew":[],"guest_stars":[{"character":"","credit_id":"525354c219c295794013c09d","order":503,"adult":false,"gender":2,"id":79054,"known_for_department":"Acting","name":"Alex Fernandez","original_name":"Alex Fernandez","popularity":2.704,"profile_path":"/viex7DzblV3vWKqmkjHO8sN3vIv.jpg"},{"character":"","credit_id":"525354c219c295794013c0c3","order":505,"adult":false,"gender":2,"id":21694,"known_for_department":"Acting","name":"Jack Fletcher","original_name":"Jack Fletcher","popularity":1.96,"profile_path":"/wO1L8gexVH3xj6oI2yhM546G8pP.jpg"}]},{"air_date":"1995-09-19","episode_number":7,"episode_type":"standard","id":21141,"name":"Chronophasia","overview":"This episode begins with Æon lying on a stone slab, waking from a dream where she was screaming. We then flash back to earlier where Æon and Trevor are making their individual ways to a Breen research base researching an ancient virus that apparently causes insanity and formed a basic part of early humanity until humans developed an immunity. Æon is cornered by the Breen soldiers near the base but is sucked down and finds that  although the base has been there for under a month, it looks like it has been derelict for centuries. There, Æon finds a young boy who guides her through the base and eventually shows her a vial of virus, the only intact vial out of a set of five. There is also a giant fanged baby, apparently the first test subject for the virus, stalking the caves ....","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/1XBQ8KROLDSKzn5VY28dqifGPU5.jpg","vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1995-09-26","episode_number":8,"episode_type":"standard","id":21143,"name":"Ether Drift Theory","overview":"Æon and fellow agent and friend Lindze infiltrate a secret base called the Habitat, a place where mutants and artificial lifeforms live in a stable environment surrounded by a sea of liquid which induces paralysis in any lifeform exposed to it. Lindze and Æon are there both to rescue Lindze's boyfriend and to destroy the facility. Soon after they arrive, Trevor and one of his human experiments arrive, destroying Æon's ship in the process though the experiment is quickly subdued by a swarm of metal-sensitive wasps. It turns out that Lindze's lover, a scientist named Bargeld, is sick from an artificial disease and may have developed a way of changing the composition of the paralyzing fluid around the base ...","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/6hSfiZkjfSHzgtRZREb0yRwtnWA.jpg","vote_average":5.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"1995-10-03","episode_number":9,"episode_type":"standard","id":21139,"name":"The Purge","overview":"The episode opens with Æon chasing Bambara, a vicious man who frequently causes injury or death to those he encounters. Æon, ignoring his victims, pursues him through a train and onto a building site. Bambara escapes Æon killing a construction worker in the process but is captured by Trevor Goodchild. He inserts a strange robot into Bambara through the man's navel and he suddenly loses his darker side, becoming friendly to those around him and quickly befriending an orphan. Trevor says the robot is a 'Custodian', an artificial conscience of his creation which he hopes to implant in all citizens. Æon then meets up with an organization of women who are opposed to Trevor's project who are planning to remove the implanted Custodians and bring the operation to an end. Æon goes after Bambara's Custodian ....","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/4jOt3YixysOJel6wCI2LrmrEi0V.jpg","vote_average":6.5,"vote_count":2,"crew":[{"department":"Directing","job":"Director","credit_id":"525354c419c295794013c1a9","adult":false,"gender":2,"id":28249,"known_for_department":"Visual Effects","name":"Peter Chung","original_name":"Peter Chung","popularity":2.834,"profile_path":"/r0WWewfDVpsVpnby26BI0nB1gx3.jpg"}],"guest_stars":[{"character":"","credit_id":"525354c419c295794013c17b","order":504,"adult":false,"gender":2,"id":1038546,"known_for_department":"Acting","name":"Eric Singer","original_name":"Eric Singer","popularity":1.168,"profile_path":"/qYpCrJqkfI4cLxOg9MzHstPSlK2.jpg"}]},{"air_date":"1995-10-10","episode_number":10,"episode_type":"finale","id":21138,"name":"End Sinister","overview":"Trevor has designed a satellite, Aldis B  which will help speed up the evolution of humanity but could also kill off half the living population of the Earth. Æon, determined to stop Trevor from using the satellite, steals and buries the remote. Æon, avoiding the search parties, finds a hibernation pod holding a strange alien with removable eyes, psionic abilities. The alien does not  breathe, eat or have genitals. The Alien is captured by one of the search parties but saves Æon when one of its captor throws a fire bomb. Trevor examines the Alien and sees signs of exposure to Aldis B.\n\nTrevor heads off to find the alien's ship. The Alien escapes and follows him, finding both Trevor and Æon at the ship. Aldis B has killed off everyone on the ship leaving only the alien who had been awaiting rescue in its pod. Æon and Trevor make love in the ship while the Alien watches. The next day, the Alien finds Æon and offers her one of its own eyes but Æon refuses.  Æon offers to show the Alien human sexual pleasure ...","production_code":"","runtime":30,"season_number":3,"show_id":406,"still_path":"/3moVcAwPumbkRyySCKUYm2kIxFx.jpg","vote_average":5.5,"vote_count":2,"crew":[],"guest_stars":[{"character":"","credit_id":"525354c419c295794013c14f","order":500,"adult":false,"gender":2,"id":1216195,"known_for_department":"Acting","name":"Paul Raci","original_name":"Paul Raci","popularity":4.921,"profile_path":"/1Vcfo559FK4JmleDbkaaGzGPJks.jpg"}]}],"name":"Season 3","overview":"Full length episodes with a continuing story.","id":1205,"poster_path":"/usU9wuvMqKiWon3qEx0i23lUJYR.jpg","season_number":3,"vote_average":5.7}}}