{"adult":false,"backdrop_path":"/88Rd5sdhAVJuG9H7eTA4nqddz4t.jpg","created_by":[{"id":1255673,"credit_id":"525961bd760ee3466196dc5b","name":"Masami Kurumada","gender":0,"profile_path":null}],"episode_run_time":[24],"first_air_date":"1986-10-11","genres":[{"id":16,"name":"Animation"},{"id":18,"name":"Drama"},{"id":10759,"name":"Action & Adventure"}],"homepage":"","id":42444,"in_production":false,"languages":["ja"],"last_air_date":"1989-04-01","last_episode_to_air":{"id":1531211,"name":"Shine, Stars of Friendship! Legend of Youth","overview":"Seiya, Hyoga and Shiryu combine their techniques and Cosmo, knocking down Poseidon. Shiryu tries to destroy the Main Breadwinner with the Golden Shield, but it flies back to him, with the pillar unscathed. Meanwhile, Ikki is mercilessly attacked by Kanon, angry that his ambitions are crushed. Sorrento tries to kill Kanon with his melody, but Ikki asks to talk to Kanon, about the one thing used to seal Poseidon's soul: Athena's urn. Seiya and his friends are unable to destroy the pillar with Libra's weapons. Seiya asks his friends to launch his body with their ...","vote_average":0,"vote_count":0,"air_date":"1989-04-01","episode_number":114,"episode_type":"finale","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/twXR5htF9n8Z8eskIJlK9xsR7Wx.jpg"},"name":"Saint Seiya","next_episode_to_air":null,"networks":[{"id":103,"logo_path":"/j3xAzk1SYQQwrQOD7acdSz675Wa.png","name":"tv asahi","origin_country":"JP"}],"number_of_episodes":114,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"聖闘士星矢","overview":"Ages ago, the goddess Athena was served by fighters called Saints who channeled the power of the Cosmos within them. Now a youth named Seiya has trained to become a Saint himself by earning the mystical Cloth of Pegasus. He is joined by other Saints with Cloths of their own to fight for Athena.","popularity":119.086,"poster_path":"/dhtiYYbob8saEUFWle3aWgVY28M.jpg","production_companies":[{"id":5542,"logo_path":"/ayE4LIqoAWotavo7xdvYngwqGML.png","name":"Toei Animation","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"1986-10-11","episode_count":114,"id":65042,"name":"Season 1","overview":"","poster_path":"/dnwkiZIKhAjDTMBi2tv10cmACX3.jpg","season_number":1,"vote_average":8.4}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.515,"vote_count":1126,"season_data":{"1":{"_id":"54e4a4049251417add002ef5","air_date":"1986-10-11","episodes":[{"air_date":"1986-10-11","episode_number":1,"episode_type":"standard","id":1042615,"name":"Revive! Legendary Hero","overview":"Legends tell of young men who wear armor known as Cloths and fight using energy known as Cosmos, in service of the goddess Athena. They are known as Saints. In Japan, two Saints fight in a colosseum for an audience, with the host, Saori Kido, waiting for the Pegasus Saint. In Athens, Greece, a Japanese young man known as Seiya fights his rival Cassios, cuts off his ear and defeats him with his Meteor of Pegasus to earn the Pegasus Bronze Cloth. Later that night, before Seiya can return home, Cassios' master Shaina tries to kill him for revenge. Seiya wears the Pegasus Cloth and actually injures Shaina, but for a moment, he is unable to master the Cloth and his Cosmos. Shaina's men arrive to finish Seiya off, but thanks to his teacher Marin's advice, he turns the table and defeats her men with his Meteor of Pegasus technique. He also is able to break Shaina's mask to reveal her face. The next day, Seiya heads back to Japan.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/zjpuy5ccYX5cUuMh6LpeqTxdzCD.jpg","vote_average":6.7,"vote_count":3,"crew":[{"job":"Writer","department":"Writing","credit_id":"6393d304d05a0300cf2934ee","adult":false,"gender":2,"id":1060541,"known_for_department":"Writing","name":"Takao Koyama","original_name":"Takao Koyama","popularity":3.842,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"6393d315d05a0300f858a431","adult":false,"gender":2,"id":1060543,"known_for_department":"Directing","name":"Kouzou Morishita","original_name":"Kouzou Morishita","popularity":2.913,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"6393d31a9f5dfb0089a1386f","adult":false,"gender":2,"id":1060543,"known_for_department":"Directing","name":"Kouzou Morishita","original_name":"Kouzou Morishita","popularity":2.913,"profile_path":null},{"job":"Animation Director","department":"Visual Effects","credit_id":"6393d3232cefc2008ca62a2a","adult":false,"gender":2,"id":1036791,"known_for_department":"Visual Effects","name":"Shingo Araki","original_name":"Shingo Araki","popularity":0.84,"profile_path":"/m8tCOv7yY6VTr4MSRystpCk2OOL.jpg"},{"job":"Key Animation","department":"Visual Effects","credit_id":"6393d34ad05a03007d580e8c","adult":false,"gender":2,"id":1845143,"known_for_department":"Visual Effects","name":"Jouji Yanase","original_name":"Jouji Yanase","popularity":1.684,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"6393d3516e938a007f4baad4","adult":false,"gender":1,"id":2352483,"known_for_department":"Visual Effects","name":"Michi Himeno","original_name":"Michi Himeno","popularity":0.98,"profile_path":null}],"guest_stars":[]},{"air_date":"1986-10-18","episode_number":2,"episode_type":"standard","id":1042616,"name":"Burn! Meteor Punch of Pegasus!","overview":"The Bronze Saints in the colosseum, Lionet Ban and Unicorn Jabu, continue their tournament match, with Jabu emerging as the victor. Seiya returns and demands to see his long-lost sister Seika after training for six years in Greece. Saori's grandfather promised him that he would see her if he retrieved the Cloth. Saori Kido, granddaughter of the late Mitsumasa Kido, leader of the Graude Foundation, and host of the Galaxian Wars tournament, offers Seiya a deal: if he wins the tournament, the Foundation will find his sister. With words of encouragement from his childhood friend Miho, Seiya decides to participate in the tournament, since it is broadcast worldwide and his sister might be able to see him on television. Seiya's first opponent is Bear Geki, and because of his arms, Seiya seemed like he would die from strangulation. But thanks to his master Marin's teachings of defeating an opponent by crushing their greatest weapon, Seiya breaks Geki's arms, the source of his strength, launches hundreds of kicks and comes out victorious.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/l98p3w1BzpxHCrS1N01qSXqWF5I.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"6393d304d05a0300cf2934ee","adult":false,"gender":2,"id":1060541,"known_for_department":"Writing","name":"Takao Koyama","original_name":"Takao Koyama","popularity":3.842,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"6393d35ea0f1a200c87ff495","adult":false,"gender":2,"id":1848254,"known_for_department":"Visual Effects","name":"Satoshi Shigeta","original_name":"Satoshi Shigeta","popularity":1.22,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"6393d377a1a9ba00a0fe3e1e","adult":false,"gender":0,"id":3823880,"known_for_department":"Visual Effects","name":"Takahiro Iida","original_name":"Takahiro Iida","popularity":0.6,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"6393d3902cefc200d1720abc","adult":false,"gender":2,"id":142714,"known_for_department":"Directing","name":"Tomoharu Katsumata","original_name":"Tomoharu Katsumata","popularity":1.202,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"6393d395a0f1a200e2a9409c","adult":false,"gender":2,"id":142714,"known_for_department":"Directing","name":"Tomoharu Katsumata","original_name":"Tomoharu Katsumata","popularity":1.202,"profile_path":null}],"guest_stars":[]},{"air_date":"1986-10-25","episode_number":3,"episode_type":"standard","id":1042617,"name":"Cygnus! Warrior of the Ice Field","overview":"In Siberia, a young man named Hyoga is visiting his deceased mother in a sunken ship at the bottom of a frozen sea. Then, after destroying an eternal ice wall, he earns the Bronze Cygnus Cloth. Hyoga heads to Japan to participate in the tournament, with the grand prize: the Gold Cloth for the winner. After Saori gives a presentation about the significance of the tournament, Cygnus Hyoga finally arrives. Hyoga's opponent, Hydra Ichi, seems to have an advantage with his poisonous horns, coming from his fists and even knees, which keep regenerating like the Hydra's heads, but they are useless. Thanks to Hyoga's Cloth, the poison never penetrated his body. Ichi is defeated by Hyoga's Diamond Dust. Who will be Hyoga's next opponent, Pegasus Seiya or Dragon Shiryu?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/tLOUoUkR7KSt1qtGKWaM0KqfAy7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-01","episode_number":4,"episode_type":"standard","id":1042618,"name":"Dragon! Unrivaled Fist and Shield","overview":"The match between Pegasus Seiya and Dragon Shiryu begins. Shunrei, a close friend of Shiryu's, arrives and tells him that his master, Roshi, is dying and needs to come back to the Five Ancient Peaks of Lushan. Shiryu's Rozan Rising Dragon and his diamond hard shield make him unstoppable, and it seems he is on his way to victory after knocking Seiya down multiple times. But Seiya isn't willing to give up and risks his life to have Shiryu destroy both his fist and shield. With his weapons destroyed, and having been witness to Seiya's determination. Shiryu removes his Cloth and is eager to finish the match. Seiya removes his Cloth as well to have a fair fight, both ready to risk their lives to fight for what they believe in and the people they love.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/mxZldkUwrbl1XvlAzGQPBube3BB.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1986-11-15","episode_number":5,"episode_type":"standard","id":1042619,"name":"Miracle of Rebirth! Friendship of the Cosmos","overview":"Seiya and Shiryu's match continues. Even though Shiryu is able to block most of Seiya's Meteors, Seiya is not only able to land a few blows, but also discovers Shiryu's weak point, the right fist of the dragon on his back, which is the spot where his heart is located. If the Rising Dragon is unleashed and Shiryu, who unconsciously lowers his left hand and exposes his weak point, is attacked in that spot, he will die. Both strike each other, with Seiya hitting the weak spot, and winning the match. However, Shiryu's heart has stopped beating. With only four minutes before he succumbs, Seiya, with encouragement from his friends and the audience, attacks Shiryu in the same spot from the back, and restarts his heart, saving him. Meanwhile, Andromeda Shun's chain senses an enemy in the colosseum.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/k6xdJeQ392xiIVvsOGCGkl1K3w9.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Screenplay","department":"Writing","credit_id":"5f12948dd46537003661b6c6","adult":false,"gender":2,"id":1060541,"known_for_department":"Writing","name":"Takao Koyama","original_name":"Takao Koyama","popularity":3.842,"profile_path":null}],"guest_stars":[]},{"air_date":"1986-11-22","episode_number":6,"episode_type":"standard","id":1042620,"name":"Phoenix! The Warrior Who has been Through Hell!","overview":"Andromeda battles against Unicorn Andromeda uses his chains to form a nebula chain (Andromeda Galaxy). Unicorn runs directly to Andromeda but his chains attacks Unicorn, thus impoosible for Unicorn to attack. He tried to attack Andromeda from the air but the chains still attack him in the air. Suddenly, the chains set a reaction and form a code for Andromeda. He wonders what is could be until at the end, his brother appears.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/9gxNf5drgUWYev9aAB1rPcFTV1o.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-11-29","episode_number":7,"episode_type":"standard","id":1042621,"name":"Stolen! Golden Cloth","overview":"Phoenix Ikki attacks his brother, Andromeda, without mercy. He's full of hate against all Saints and Saori Kido, whose grandfather had sent him to Death Queen Island. Jabu tries to stop Ikki but he's defeated with one single punch. Then, the official battle begins, between Ikki and Nachi, Bronze Saint of Wolf, who has his mind completely destroyed by Phoenix's attack. Then, Ikki bids farewell to all and, along with his henchmen, the Black Saints, steals the Gold Cloth.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/5s9rUMwRl5uePwiG6AmM1CaoxP5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-13","episode_number":8,"episode_type":"standard","id":1042622,"name":"Destroy! The Dark Phoenix Army!","overview":"Seiya, Hyoga, Shiryu and Shun chases Ikki and his Black Saints through the city as they run away with the Gold Cloth. Kido's Foundation sends an helicopter after the enemies, but Ikki destroys it with a single strike. They hide in the harbor and Ikki finally wears the Gold Cloth, but Seiya finds and hits him, making the Gold Cloth fly away from Ikki's body and split up. The black saints get the cloth's parts and runs again. One by one, they're defeated by the Bronze Saints, but they only manage to recover both arms and both legs of the cloth. One of the defeated Black Saints reveals that they follow Ikki because four stronger Black Saints support Ikki, and that Ikki's real intent is to take over the world. The next morning, Shiryu returns to the Five Peaks of Rozan, taking the destroyed cloths of Pegasus and Dragon with him, in order to repair them. But a black shadow watches them carefully...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/rylrgj25x7MWl42Vm7AIqLkPOB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-20","episode_number":9,"episode_type":"standard","id":1042623,"name":"Strong Enemy! The Four Dark Saint Kings Appear","overview":"Seiya is searching for Ikki with the aid of a police dog. Shun is in the forest remembering of the past and wondering what had made his brother change, when a new enemy arrives: one of the black saints, Black Swan. He attacks Shun, but Hyoga arrives and challenges him to a freezing duel: Swan vs. Black Swan. The other three black saints (Black Pegasus, Black Dragon and Black Andromeda) eventually show up too.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/1QYWUHfyXoLseBnJ6BgynAGks87.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-12-27","episode_number":10,"episode_type":"standard","id":1042624,"name":"Beware Shiryu! The Grave of the Saint Cloths","overview":"Shiryu goes to Jamil's Mountains in order to find Mu, the only one who can repair the clothes of Pegasus and Dragon. However, getting there will not be easy as he thinks. The Cloth Graveyard lies on his way, where many undead saints are waiting for him. When he finally arrives at Mu's Tower, Mu gives him some bad news about the clothes.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/q3f3CMn4SZj1Pr1aEreYsaTDdfn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-01-03","episode_number":11,"episode_type":"standard","id":1042625,"name":"Duel! The Terrifying Black Fist of Death","overview":"The battle of the Bronze Saints against Ikki and his Black Saints begins. Seiya, already wearing his Pegasus cloth (brought by Kiki), faces the Black Pegasus, whose meteors hide a terrible curse and might lead Seiya to an horrible death. Hyoga has no difficulties in defeating Black Swan, who alerts Ikki about Hyoga's attacks before dying. Finally, Hyoga finds the Phoenix Saint and challenges him to a duel. The battle is starting to heat up!","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/pEYpOCfWGwPfFGWUUy5JcEf9SVz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-01-10","episode_number":12,"episode_type":"standard","id":1042626,"name":"Grab On! The Nebula Chain of Friendship","overview":"Seiya is suffering from Black Death's curse and is on the verge of death, while Hyoga tries (in vain) to defeat Ikki. Shun finds Seiya and tries to help him, but Black Andromeda and Black Dragon show up and Seiya makes a last sacrifice so Shun won't get killed. Shun manages to kill his black shadow and Shiryu appears and challenges Black Dragon. The combat between the Dragons is about to begin!","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/oWgfR65MToueoLCEFHRNJiFe7rk.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1987-01-17","episode_number":13,"episode_type":"standard","id":1042627,"name":"Burn! Flaming Attack!","overview":"In this episode, Shiryu challenges the Black Dragon, while Shun tries to save Seiya, who is slowly dying because of Black Pegasus' Black Death Horror. Shiryu, still weak because of his blood loss, almost sacrifices his life for friendship (which Black Dragon can't understand why, since he doesn't believe in such thing as friendship).","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/uWA8KeFL5scSPrTQFFjt2jfqkF2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-01-24","episode_number":14,"episode_type":"standard","id":1042628,"name":"Defeated! Genma Ken!","overview":"The four Saints prepare to face Ikki (Hyoga wasn't dead after all), but they are no match for the mighty cosmo of Ikki. He knocks them out with one single strike, except for Seiya, who was protected by the Gold Cloth. Aided by the cosmo of his friends, Seiya finally manages to defeat Ikki after a deadly battle.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/hSdMJ8UfErWIjOeYf38YMRnIth8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-01-31","episode_number":15,"episode_type":"standard","id":1042629,"name":"Revealed! Ikki's Secret!","overview":"Ikki reveals what happened to him in the Death Queen Island. Since the beginning of his training, his master (Guilty) has taught him to hate everyone, as a way to gain strength and kill his enemies. The only person in the whole island who cared about Ikki was Esmeralda, Guilty's daughter. She used to take care of Ikki's wounds and both of them were real friends. Ikki's last day on Death Queen Island has come. Unless he killed his master, he wouldn't get the Phoenix Bronze Cloth. In the middle of the battle, Guilty killed his own daughter, Esmeralda. That transformed Ikki in a demon of rage, and he murdered his master with all his power, becoming the demoniac Bronze Saint of Phoenix. Back to the present, Ikki tells Seiya and the others the battle wasn't over because he was defeated. Suddenly, the black saints show up and steal the Gold Cloth. A new enemy has come: Docrates, the most powerful man in the Sanctuary. He shows his tremendous power (Hercules' Tornado Punch)","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/3HNFNl0f9dIMMQulayy4t5vr0IG.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1987-02-07","episode_number":16,"episode_type":"standard","id":1042630,"name":"Gigantic! Docrates Fierce Attack","overview":"At many places round the world, tragedies are happening because of the Sanctuary's agents. In Greece, the Sanctuary's Pope is furious because Docrates hasn't returned yet with the Gold Cloth. Marin is about to be killed by Shina, but Aiolia stops her, saving Marin. According to Marin, the former Pope of the Sanctuary has suddenly died and his younger brother, Ares, is the new Pope, bringing a dark time for the Sanctuary. Back to Japan, Saori is in the planetarium dome when her grandfather, Mitsumasa Kido, appears to her. He tells her that the Gold Cloth always shows up when a new crisis is about to happen in the world and that she must be like Athena and guide the Bronze Saints to the victory. Meanwhile, Docrates's henchmen search for their boss under the rocks, when he shows up and they march for the Kido Mansion. Next morning, Docrates attacks the mansion. Shiryu, Hyoga and Shun defeats his henchmen but can do nothing against the mighty power of Docrates's Hercules Tornado Punch.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/fzMK2KXdtlIkwvFkaPnd26s1csa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-02-14","episode_number":17,"episode_type":"standard","id":1042631,"name":"Rescue! Saori's Crisis","overview":"Docrates is in the Colosseum and will free Saori and Tatsumi if Seiya gives him the Gold Cloth's helm. Seiya and Shun goes to the Colosseum while Shiryu and Kiki (who saw telephatically where the other missing pieces of the Gold Cloth were hidden) goes to the island where Ikki's challenge took place. Docrates' henchmen deceived the Bronze Saints and stole the helm without setting Saori free. His henchmen leave the Colosseum but Hyoga was waiting for them and he recovers the Helm. Seiya learns that Docrates is the older brother of Cassios, who was defeated by Seiya in Greece, and seeks revenge. Seiya and Shun are no match to Docrates's \"\"Hercules Tornado Punch\"\", but Hyoga arrives and, with a dangerous technique that he learned from his master, the Crystal Saint, freezes Docrates' legs, paralyzing the giant enemy. Then, Seiya and Shun attack and finally kill Docrates. Meanwhile, Shiryu and Kiki arrive at the place, but the Sanctuary's soldiers had already flown away with the Gold Cloth.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/iEqhEpKg7mVZktodDozV5s7XqZ7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-02-21","episode_number":18,"episode_type":"standard","id":1042632,"name":"Great Rage! The Ghost Saints of Carribean","overview":"The Pope is furious with Docrates' failure, and Shina advises Gigars to send the amazon Jeist (Shina's disciple, who was banned from the Sanctuary by the former Pope) to recover the Gold helmet. In an castle on an island at the Carribean Sea, Jeist receives a letter from the Sanctuary and summons her disciples, the Ghost Saints: Serpent, Dolphin and Medusa. They take over a big nuclear energy-powered oil ship that belongs to Kido Foundation and threaten to destroy it unless the Bronze Saints give the helm to them. Seiya and the others go to the ship and Seiya is forced to fight alone against the Serpent and the Dolphin. Otherwise, Medusa will destroy the ship. However, Shun immobilizes Medusa with his chains and the Bronze Saints go to help Seiya but, all of a sudden, the ocean is filled by ghost pirate ships, and thousands of ghost pirates invade the oil ship and distract the saints. The Ghost Saints seize the opportunity, steal the helm and jump to the ocean.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/ePENrvdLYNk68hHeSnPtL1exxX6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-02-28","episode_number":19,"episode_type":"standard","id":1042633,"name":"Life or Death! Bloody Battle at the Makaito","overview":"The four bronze saints embark on a dangerous mission to retrieve the gold cloths mask from the ghost saints of the Caribbean...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/vC1SgyQMEWAdduDwcfSKeTd2nFB.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1987-03-07","episode_number":20,"episode_type":"standard","id":1042634,"name":"Serious Battle! Shaina's Counter Attack","overview":"The saints split up in the hopes of avoiding ambushes and gathering information. Seiya returns to Sanctuary to see Marin while Hyoga goes to Siberia...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/eiw6tOH4fQUf2VJoS0fndEgVpB6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-03-14","episode_number":21,"episode_type":"standard","id":1059010,"name":"Heartless! Clash of Aurora","overview":"Hyoga must fights with your master, Crystal.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/iuqh3qmkGq7dWLnCZwvCkB0VXXi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-03-21","episode_number":22,"episode_type":"standard","id":1059017,"name":"Rebirth from the Flames! Indestructible Ikki","overview":"Crystal is dead. Shriyu stay in Rozan. The knight of Fire attacks the Kido Mansion. Alone, Shun suffer to protect Saori, but is helped by a powerful knight ressurrected of flames.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/bUeFr5YrgQz9GrBVONbujk82wJm.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1987-03-28","episode_number":23,"episode_type":"standard","id":1059019,"name":"Silver Saint! The Proud Assassin","overview":"The Master of Sanctuary sends Marin and the Silver Saint Misty to Japan to kill Seya and the others.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/3hlibCmChdH9N3mube2YnWFfgnm.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1987-04-11","episode_number":24,"episode_type":"standard","id":1059021,"name":"Fly Pegasus! Like a Comet","overview":"The other silver saints have revenge in their hearts. Marin is used as bait and her secret is revealed. Just who is she?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/xIrpKc611FvJKcZ7OEWbVw4pv86.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-04-18","episode_number":25,"episode_type":"standard","id":1059071,"name":"Fight! The Rise of Athena!","overview":"After finding out Marin is indeed his long lost sister. Seiya must fight off yet another Silver saint in Asterion to save Marin. Will Seiya be able to both defeat Asterion and save Marin in time?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/5rtgdgZ0Yi6cu1AzGCjDdjjtNFD.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1987-04-25","episode_number":26,"episode_type":"standard","id":1059072,"name":"Are They Friends or Enemies?","overview":"Just as the battle intensifies with Babel the silver night, three new saints enter the fray. Are they friend or foe? Meet the steel saints.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/2fptc19nnuPTNCqBE7m9aHcfYC1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-05-02","episode_number":27,"episode_type":"standard","id":1059073,"name":"Seiya Becomes Stone!","overview":"The saints are under attack from Shaina, Babel and the Spartan. Will they be able to overcome their biggest challenge to date? Or will they be turned to stone?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/AcUj7hGUf2rdLmN7PgFZuD9jhMA.jpg","vote_average":9,"vote_count":1,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"60aa5c57d8cc4a0040104984","adult":false,"gender":2,"id":1062368,"known_for_department":"Visual Effects","name":"Tetsuro Aoki","original_name":"Tetsuro Aoki","popularity":1.96,"profile_path":null}],"guest_stars":[]},{"air_date":"1987-05-09","episode_number":28,"episode_type":"standard","id":1059074,"name":"Shiryu Fights Back!","overview":"Know what this is about?  Be the first one to add a plot.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/9cx6ljY3iHIyMO6mQS2IKp6Tgub.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-05-16","episode_number":29,"episode_type":"standard","id":1059075,"name":"Kidnap! Crows Legion Seize Saori","overview":"Division in the camp as Shiryu heads back home after being declared blind. Will the Bronze saints rally together or fall apart?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/sSxTJcVegJ5qOz7F4dJSUOkEURY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-05-23","episode_number":30,"episode_type":"standard","id":1059076,"name":"Burn! Cosmo of Love","overview":"Seiya and Saori are in a dangerous predicament. Literally trapped between a rock and a hard place. What will become of them?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/hMQZ3bORwJWCexc0320okJxPoXA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-05-30","episode_number":31,"episode_type":"standard","id":1059077,"name":"Magic Prodigy! The Boundary of Life and Death","overview":"After barely surviving the onslaught of Shaina and the Crow Saint. A severely injured Seiya, Soari who has revealed her true power as Athena, Shin and Hyoga must face two new mysterious Saints sent by the holy father. Will they survive their greatest test to date? How strong are they without the Dragon and Phoenix saints by their side?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/7q0UxquLPVnmDuicgGl9WYSHWty.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-06-06","episode_number":32,"episode_type":"standard","id":1059078,"name":"Great Bomb in Death Queen Island!","overview":"Ikki returns to death queen island and is lured into a challenge which not even the Phoenix can be sure of surviving. Will help arrive in time or will the Phoenix be lost forever?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/hDugaSFPFECbX0hnaHfSQgjEvS2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-06-13","episode_number":33,"episode_type":"standard","id":1059079,"name":"The Fight Between Dragon and Tiger! The Tears without Light of Dragon","overview":"The four bronze saints barely survive without Saori's intervention. Meanwhile Shiryu is having great difficulty coming to terms with his new circumstances. Can he continue as a bronze saint without his sight?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/epyI2Ki39ozy4Y04fqJ7KXnDCpj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-06-20","episode_number":34,"episode_type":"standard","id":1059080,"name":"Farewell, my Friend! Peace to Your Ashes!","overview":"The dragon saint vs the tiger. The inevitable challenge of rivals draws closer. Will Seiya's plan to restore Shiryu's sight succeed?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/kfQsu2Qs8S93aXqpGL2rSYHymde.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"60aa5c57d8cc4a0040104984","adult":false,"gender":2,"id":1062368,"known_for_department":"Visual Effects","name":"Tetsuro Aoki","original_name":"Tetsuro Aoki","popularity":1.96,"profile_path":null}],"guest_stars":[]},{"air_date":"1987-06-27","episode_number":35,"episode_type":"standard","id":1059081,"name":"The Travel of Death! Dragon sees the Light Again","overview":"The gold cloth has come together autonomously. What could this mean? The dragon saint has surpassed his limits and risen to new heights. The fight for the fate of the world has just gotten more mysterious...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/okwOI4O40okMaHwA87J9WNhVcrs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-07-04","episode_number":36,"episode_type":"standard","id":1059082,"name":"Amazing! Against Twelve Gold Clothes","overview":"When Seiya mysteriously falls ill he must do something he has always resisted, let his colleagues take the lead in the search for the gold cloth. Hyoga and Shun have work to do before The Holy Father secures the cloth for his own nefarious plans...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/kEWm0Hu7uIdTnDO9Bs6oyXJOMkb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-07-11","episode_number":37,"episode_type":"standard","id":1059083,"name":"The Mask Screams! Either Love or Death?","overview":"Shaina reveals the intent behind her grudge with Seiya. Even so he refuses to engage in battle with her. A strange new Cosmo interrupts their intimate struggle. Who might this powerful new foe be?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/uv4l06JWOwzioLYlxXsF1ij3jc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-07-18","episode_number":38,"episode_type":"standard","id":1059084,"name":"Fight Violently! Gold Stole","overview":"In a strange turn of events, Seiya has been chosen by the Gold armour of Sagittarius. This isn't any Gold armour, it's the strongest of the 12. What does this now mean for the foes of Athena? The battle between Gold saints begins...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/nnEXIaFjOLNuRphXOHZPJIdAjqX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-07-25","episode_number":39,"episode_type":"standard","id":1059086,"name":"Velocity of Light! The Powerful Beyond Mach","overview":"The Mystery of Athena's rebirth has been solved. Now also armed with Gold cloth it points to the sanctuary in Athens. The saints prepare to embark on the ultimate quest of justice...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/k65i6baVA4yk3pCfwPsf8kj9ttW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-08-01","episode_number":40,"episode_type":"standard","id":1059087,"name":"Go! Our New Trip","overview":"The journey to the sanctuary begins. Meanwhile Shiryu attempts to return to the group having recently learned his Master Roshi is also a Golden Saint and friend in the battle against Arles. Mu has also shown his support vs the Golden Saint Death Mask, forcing him to retreat. Lines are being drawn ahead of the ultimate battle. This may be the last time the group has together heading into the battle...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/1XipSzqUSxNosIeIFwviz9ave4Q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-08-08","episode_number":41,"episode_type":"standard","id":1059088,"name":"The Battle Starts in Sanctuary! Athena's Biggest Crisis","overview":"The journey towards the ultimate battle has been delayed following Shun being ambushed by others from Andromeda island. Saori/Athena pleads with her loyal saints to allow Shun to come through this test unaided in the hopes of trusting each other when the real battle begins. We also await the return of Ikki and Shiryu to complete Athena's ranks. Will they come in time or even at all?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/oGjihmmH0b5e7DCh9kMpALTpB1r.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-08-15","episode_number":42,"episode_type":"standard","id":1059089,"name":"The Ultimate Cosmo! Seven Senses","overview":"Shiryu has joined the saints who are still without Ikki at the sanctuary. There are 12 temples with guardians for them to get past before they can be granted an audience with the holy father. Saori however, may not live to see this completed as she has been gravely wounded by a golden arrow. Is all hope now lost on this noble quest for justice?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/AqY9494Y2AbJFcYfdOvv9D4cx3l.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"60aa5c57d8cc4a0040104984","adult":false,"gender":2,"id":1062368,"known_for_department":"Visual Effects","name":"Tetsuro Aoki","original_name":"Tetsuro Aoki","popularity":1.96,"profile_path":null}],"guest_stars":[]},{"air_date":"1987-08-22","episode_number":43,"episode_type":"standard","id":1059090,"name":"Big Bang! The Battle of the Gold Bull Temple","overview":"Armed with their newly improved and repaired cloths the bronze saints set their sights on the Taurus temple. They must learn the seventh sense which ignites ones Cosmo to the point of explosion. This is the only way they can overcome these golden clad masters. Is there enough time to accomplish both that and save Saori?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/3Wt9YQxY7S0xQ2uZneVgZv6Jkz4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-09-05","episode_number":44,"episode_type":"standard","id":1059091,"name":"Gemini Temple! Labyrinth of Light and Darkness","overview":"The Gold saint of the Taurus constellation proves a worthy challenge for the Bronze saints. Will the others follow Seiya in also awakening their seventh sense?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/z4xUDQu1B2JVr1aE3qjEOnubeWo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-09-12","episode_number":45,"episode_type":"standard","id":1059092,"name":"Fear! Adrift in Another Dimension","overview":"With time running out the Saints must take on Gemini's Gold Saint who's reputation is as the scariest of them all. Can they break the mirage of Gemini or will it break them?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/kQHmCR33dA99PrEoSVlGq4OlFbl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-09-19","episode_number":46,"episode_type":"standard","id":1059093,"name":"Call Out! Nebula Chain of Attack and Defense in One","overview":"The Gemini Saint literally has Shun hanging in by a thread. A shocking revelation in the fight against The Holy Father is about to take place...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/b2TcKfl49cgOUj8NBzQyIWdTkTF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-09-26","episode_number":47,"episode_type":"standard","id":1059094,"name":"Farewell, Hyoga! Sleep, Oh Noble Warrior","overview":"Camus of Aquarius challenges the cygnet Saint Hyoga. He seeks to stop Hyoga's progress despite not being in charge of the temple they are set to do battle in. They share a connection with Hyoga's master who was Camus' student.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/pYAxSyxyvZjCGX6UYC1GjrQbhwy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-10-03","episode_number":48,"episode_type":"standard","id":1059095,"name":"Dragon! Rebirth from the Land of Death","overview":"With Hyoga literally on ice and Ikki in a deep slumber. The other bronze saints have their work cut out for them. Should they fail to awaken their seventh sense they stand no chance against even the most merciful of the gold saints. Time is running out and there is still a far way to go. The group really needs a positive omen to add new vigour to their quest...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/3z7mfI7FqgOgdk0ecczsOaT5z6R.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-10-10","episode_number":49,"episode_type":"standard","id":1059096,"name":"Love! Shunrei's Prayer","overview":"Things continue to get more precarious for the Bronze saints as the dragon Shiryu is added to the list of fallen warriors. With just under 9 hours to go and a fair amount of temples left to overcome has the task finally become too heavy a burden for our young heroes?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/1WdjDbXMJ8pExc8pqNBn6Hd4NGN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-10-17","episode_number":50,"episode_type":"standard","id":1059097,"name":"Rise, Dragon! Shiryu's Raging Cosmo","overview":"Shiryu has awakened his cosmo and is ready to do battle with Deathmask. Can he harness this new ability to its full potential in time to help Seiya progress through the challenges?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/4MobswHPFM7C0XWgSbTDAb5oXtY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-10-24","episode_number":51,"episode_type":"standard","id":1059098,"name":"Why! The Golden Lion Bared His Fangs","overview":"Seiya must take on the honourable Aiolia. Something seems different can this be the very same warrior? Will Seiya be able to put his admiration for his foe aside and fight full force? Or is the result a foregone conclusion?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/uFvffM67MibAJKSVYADaYCEFhME.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-10-31","episode_number":52,"episode_type":"standard","id":1059099,"name":"Ares! Legend of the Demon Fist","overview":"Seiya's 7th sense puts him on par with Aiolia. He is able to dodge his lightning bolt and turn the tables. Seiya must find out what has caused the change in Aiolia's personality before it's too late to save him or indeed himself...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/9neHVpqfbRBpBtdJk97VOSnBIpP.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1987-11-07","episode_number":53,"episode_type":"standard","id":1059100,"name":"What a Man! Cassios Dies For Love","overview":"Seiya is in trouble. Aiolia's mind controlled by Arles the holy father is intent on obliterating him. Can Shun and Shiryu reach Seiya in time to offer their combined strength in the battle?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/6l4bC8CedZqagc8sFUy9WhoRAQC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-11-14","episode_number":54,"episode_type":"standard","id":1059101,"name":"Ikki! The Phoenix's Blazing Wings","overview":"Following on from the tragic death of Kasius, Seiya's former foe turned ally, Aiolia has awakened from his mind control at the hands of the holy father. He warns Seiya, Shun and Shiryu of the task ahead. They must face the gold saint of Virgo their most formidable foe ever and the closest to the level of God. Meanwhile Ikki has arisen from his restorative sleep. His cloth a new he is ready to be a symbol to his people on death island...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/2JoWtyS3vmzOzqs9NXgXs3cswV5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-11-21","episode_number":55,"episode_type":"standard","id":1059102,"name":"Ties of Friendship! Athena's Call","overview":"Ikki is being tested to the limit. Will he have enough Cosmo to soar to new heights of power as the Phoenix Saint?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/oJhoxexyNh67xpOSF3SXFOBVxOE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-11-28","episode_number":56,"episode_type":"standard","id":1059103,"name":"Shaka! The Man Closest to a God","overview":"The Bronze Saints arrive at the Virgo Temple. There, they meet Shaka, the man whose power is the closest to God's power. Yet, he doesn't seem to notice the saints in front of him. Seiya tries to attack him, but Shaka hits him hard and Seiya goes to the ground. The same happens with Shiryu and Shun, and finally Shaka defeats all of them with his technique: TenMaKou Fuku (Devil Lord's Blessing). When Shaka is about to kill Shun, a Phoenix Feather cuts his hand. Phoenix Ikki has arrived. Since Ikki hurt Shaka's hand, the Gold Saint creates a river of blood, where Ikki ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/sqOLtOg5Zrbq8EXRBwJRvG8oplX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-12-05","episode_number":57,"episode_type":"standard","id":1059104,"name":"Fear of the Void! Shaka Opened His Eyes","overview":"Know what this is about?  Be the first one to add a plot.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/rBGqBcEPfAOXmVbtQsZGyy09F8R.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637e61fffa404600afd5652d","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"1987-12-12","episode_number":58,"episode_type":"standard","id":1059105,"name":"Hero! Ikki Dissolved Because of Friendship","overview":"In sadistic fashion, Shaka tortures Phoenix with his incredible gold saint powers, but even after ridding Phoenix of his senses and leaving him physically destroyed, Shaka cannot seem to finish off the strong-willed bronze saint. Shun comes-to and tries to help his ailing brother, but through communicative thoughts, Phoenix tells him to back off; 'this is his fight.' Shaka continues his attack on a defenseless Phoenix, but now he seems unable to do any damage to him, like he's protected by an unknown force field. Shaka has never seen anything like this before. Who is ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/562f55ou4AqltHmrvzw3BORvwi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-12-19","episode_number":59,"episode_type":"standard","id":1059106,"name":"Revive, Swan! Life, Death and Love","overview":"The stakes are very much heightened. Defeating the remaining Gold Saints requires more than strength as demonstrated by the noble sacrifice of Ikki the Phoenix Saint. The remaining three of Seiya, Shiryu and Shun race bravely towards the Libra temple...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/o8poKV84QpK9rEBf5rbSuDgy74Q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1987-12-26","episode_number":60,"episode_type":"standard","id":1059107,"name":"Hyoga Revived! At Risk of Life!","overview":"Hyoga has been freed from his ice coffin and Shun has volunteered to speed up his recovery by providing the much needed warmth of mankind. The weapons encased in the Virgo Cloth provided by Shiryu's master Roshi may just be the tools needed to balance the campaign against the gold saints of the sanctuary.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/kwXIezypBtAnVfUzvndlfw8misR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-01-09","episode_number":61,"episode_type":"standard","id":1059108,"name":"Surrender or Die! These Wings are at Their Limit","overview":"Hyoga has returned filled with purpose. Will his new resolve be enough to turn the tide?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/oICqvMRHqQRpBESiFesc3wImelX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-01-16","episode_number":62,"episode_type":"standard","id":1059109,"name":"Make Way, Hyoga! Proud Warrior","overview":"Hyoga is taught a valuable and yet painful lesson about preparing for the 7th sense to awaken.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/kFXtr0qnPi79PTN2NLjnKHUZV8A.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637e61fffa404600afd5652d","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"1988-01-23","episode_number":63,"episode_type":"standard","id":1059110,"name":"Resound! Sanctuary's Gold Armors","overview":"The most powerful gold saints armour turns up unexplained. What could this mean for the battle against the sanctuary?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/qw7O7X0DvebAw6RqVkBI9LQRcRS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-01-30","episode_number":64,"episode_type":"standard","id":1059111,"name":"Young Men! I Entrust Athena to You","overview":"The arrow barely misses Seiya's heart and lands in the wall behind him. After a confused Seiya ponders the significance of it all, he realizes that where arrow has penetrated the wall leads to a secret passageway. Shun comes to, and Cygnus arrives, reuniting the four bronze saints together for the first time in a while. They all decide to enter the passageway to see where it leads. Once inside, the entrance disappears behind them and the ceiling begins to press down upon them like a vice. Shiryu yells for the others to run ahead to the tunnel while he tries to hold up...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/qwY2q1QhUWoC3kwY1tGfZoiH8Dc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-02-06","episode_number":65,"episode_type":"standard","id":1059112,"name":"Roar, Holy Sword! Shura vs Shiryu","overview":"The fight continues as the foursome of Hyoga, Shiryu, Shun and Seiya enter the unguarded 10th temple. Surely it can't be this simple?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/awELOSGdMLpOkLUjKQf1nmbalKF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-02-13","episode_number":66,"episode_type":"standard","id":1059113,"name":"Shiryu! Become a Shooting Star","overview":"Shiryu the bronze dragon saint vs Shuya the gold said by and wielder of the holy sword Excalibur. The unbreakable dragon shield vs the sword of legend. Wich will outlast the other?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/36qMK4jKtuZ53kRDyAMdfz6aA4K.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-02-20","episode_number":67,"episode_type":"standard","id":1059114,"name":"Farewell! My Teacher, my Friends","overview":"Although upset, the remaining bronze saints realize they don't have the time to grieve for their brave friend Shiryu, and they hurry off to the next house, the house of Aquarius. Inside, they encounter the gold saint of Aquarius, Camus. To prove his great mentor wrong (for freezing him in the large block of ice, because he felt Cygnus could never achieve his seventh sense) Cygnus Hyoga wants to fight Camus alone. So, he tells Shun and Seiya to go on ahead to defeat Arles without him. Camus's powers are great; he is far superior to Cygnus and easily defeats him. But ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/3HEIIUC1ZQf9kHXJa9fUrfb3nJm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-02-27","episode_number":68,"episode_type":"standard","id":1059115,"name":"Fighter of Beauty! Aphrodite","overview":"After Camus's defeat, and with Seiya and Shun closing in, Arles is getting a little jumpy. And with only one-hour left to save Athena, Seiya and Shun must move fast. To save time, they agree to let Shun fight Aphrodite in the house of Pisces, while Seiya runs ahead to face Arles. Shun successfully holds Aphrodite at bay while Seiya runs through the house of Pisces, but once he reaches the path to Arles's house, Seiya discovers it to be covered with Aphrodite's magical roses. Seiya must step on the roses to advance to Arles's house, but as he does, he falls unconscious...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/JGspfTMqPlydnooClCuLl2hsjv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-03-12","episode_number":69,"episode_type":"standard","id":1059116,"name":"Demon Roses! Sweet Smell of Death","overview":"The fight for Athena's life intensifies with the bronze saints having to make the greatest of sacrifices to see their mission through. Will they all make it to face the Holy Father in time? Life or death hangs in the balance...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/mesOLMSRDJHblCXhXnhAYtOIDVM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-03-19","episode_number":70,"episode_type":"standard","id":1059117,"name":"Rest in Peace! Shun, the Last Smile","overview":"Seiya finally faces the Holy Father thanks to the sacrifice of Shaina. However, Seiya must confront a force unlike any he has ever encountered. Pegasus vs The Lord of The Saints...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/duSZ74oXYpIOMVnjI3M0ZjobVUl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-03-26","episode_number":71,"episode_type":"standard","id":1059118,"name":"The Fire Bell is Off! The Real Face of Holy Father","overview":"Seiya is up against a force unlike any other in the All Father. The internal struggle of the Gemini Gold Saint rages within the All Father. Will Seiya be able to count on a miracle to save him and in turn Athena?","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/grGoQM2tdzFQomMtRHHYv38C8Ww.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-04-09","episode_number":72,"episode_type":"standard","id":1059119,"name":"Go, Seiya! Forget All the Sorrow","overview":"Gemini gets certain of his victory, beating Seiya and his 5 senses. At the same time, Mu of Aries helps Shaka of Virgo and Phoenix Ikki from another dimension. Shaka repaired Ikki's Phoenix Cloth. On the other hand, losing 5senses, Seiya still continues to fight against the Gold Saint of Gemini, Saga. Suddenly, the Justice Face on the mask of Gold Cloth of Gemini sheds tears. Ikki comes into the Pope's room and lets Seiya go to the Athena's Shrine. Defeating Ikki, Saga of Gemini follows Seiya. In the Athena's Shrine, Seiya finds the Sheild of the Athena Statue, and ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/z4uskyv7ZY8alIliOYbt9NgnoPj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-04-16","episode_number":73,"episode_type":"standard","id":1059120,"name":"Good Friends! Come to Be with Athena","overview":"Eventually, Athena Saori is revived. The light from the Athena's Sheild reaches to her. The Gold Saint of Libra, the mentor of Dragon Shiryu tells the truth to the other Gold Saints what happened 13 years ago, and that Saori is the reincarnation of Athena. Saori moves to the Athena's Shrine from the foot of the Sanctuary through the 12 rooms of the Gold Saints, saving other Bronze Saints, Shiryu, Hyoga and Shun by the miracle power of Cosmo. In Athena's Shrine, Seiya is about to death, beaten by Saga of Gemini, Seiya helped by Ikki. And other friends, Shiryu, Hyoga ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/vVIEWhpyoSR6oW4tICiv7MokkOP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-04-23","episode_number":74,"episode_type":"standard","id":1531171,"name":"Enemies of the Northern Frontier! The Legendary God Warriors","overview":"In Asgard, a land filled with snow in Northern Europe, a woman known as Polaris Hilda, representative of the Norse God Odin, prays to preserve the peace in her land. Suddenly, a mysterious force speaks to her, urging her to destroy the Sanctuary. Hilda refuses, so she is swept away by the force. When she recovers, a strange ring is on her finger, and she calls upon the God Robes of the Asgard God Warriors. Seven warriors are granted these sacred Robes: Siegfried is granted the Dubhe God Robe Robe of the Alpha star, Hägen is granted the Merak God Robe of the Beta star,...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/txXneBB1JHbqY74DzXFvW5FFyuD.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1988-04-30","episode_number":75,"episode_type":"standard","id":1531172,"name":"Hilda! Goddess Imprisoned by Evil","overview":"In Asgard, Hyoga is escaping with a young girl named Freya, Hilda's younger sister. Asgard soldiers trap Hyoga and try to convince Freya to come back to her sister, but she refuses, hoping that Athena will save her sister. Hyoga defeats the soldiers. Then, Saori appears before Hyoga and Freya. Seiya, Shun and Kiki arrive, and Freya explains that Hilda is not acting like herself. The worst part is, the world is now in danger. Hilda was praying to stop the Polar ice caps from melting, but since Hilda stopped praying, the ice caps are melting and will flood the Earth. ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/dxgwLJFVM0A38TxCdoXdGN2Dt3H.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-05-07","episode_number":76,"episode_type":"standard","id":1531173,"name":"Giant Thor! Cosmo of Hatred","overview":"Seiya, Hyoga and Shun rush to find the Valhalla Palace, which is farther away, but the giant God Warrior Thor stands in their way. Shun and Hyoga attack, but are useless against him as he easily breaks free from Hyoga's ice and knocks down Shun with his Cosmo. Seiya decides to distract Thor, allowing Shun and Hyoga to move forward. Seiya stops Thor's Mjolnir Hammer technique with his Meteor of Pegasus, but Thor simply changed their direction towards Shun and Hyoga, knocking them out cold. Seiya, now alone, manages to evade Thor's Mjolnir Hammer, but before he is able ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/e7qB038AGUNrwPQ85X04rcOsOA3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-05-14","episode_number":77,"episode_type":"standard","id":1531174,"name":"Tears of the Giant! Die for Hilda","overview":"Thor strikes, with Seiya falling down an icy cliff, and even then, the attacks against Seiya continue. However, he is rescued by Shiryu, who has come from the Five Ancient Peaks of Lushan and brought information from Roshi. The master reveals that to remove the Nibelung Ring, one must have the legendary sword Balmung. To retrieve the sword, the seven Odin Sapphires, the seven God Warriors' guardian stones, must be gathered after defeating them. Shiryu goes to wake up Hyoga and Shun while Seiya distracts Thor, but Seiya is knocked down again. Saori's Cosmos burns ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/dCqPSSSkajvqmOa4XZcOJbpnamb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-05-21","episode_number":78,"episode_type":"standard","id":1531175,"name":"Bare the Teeth! Northern Wolf Fenrir","overview":"While Saori tries to keep the polar caps from melting, Kiki and Freya stayed behind to look after her. The Bronze Saints head for different paths. While Shiryu looks for his next opponent, Capricorn Shura's spirit reminds him to protect Athena. It is revealed that when Shiryu used his Final Dragon, Shura loaned his Gold Cloth to him and pushed him back to Earth, with his last words telling him to live on and to protect Athena. At the Valhalla Palace, Siegfried tells Hilda he is confident about his strategy to defeat the Bronze Saints. At a frozen waterfall, Shiryu is ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/o3ixw7XR8pfn3WAmEvsLc9u2fUK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-05-28","episode_number":79,"episode_type":"standard","id":1531176,"name":"Sorrow! Fate of the Northern Wolves Pack","overview":"Shiryu seems to be no match against Fenrir's ruthless attacks. His friends sense he is in danger, but are confident they will make it to the Valhalla Palace. Meanwhile, Hyoga is followed by another God Warrior. Remembering Shura's sacrifice, Shiryu gets up again, and tries to convince Fenrir that Hilda is possessed, needing the Odin Sapphire to save her and to trust him. Fenrir, however, doesn't believe in people and only trusts his wolves. He then tells Shiryu the reason of his mistrust. Years ago, when Fenrir was six years old, he was part of a distinguished family....","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/5fmIlTdAYve43PVMpiS7edPTxEo.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637e61fffa404600afd5652d","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"1988-06-04","episode_number":80,"episode_type":"standard","id":1531177,"name":"Vanished on the Ice Field! Howling Grief","overview":"Shiryu fights back, stating that he believes in his friends and will fight for his beliefs as both warriors clash again. Fenrir keeps fighting for Hilda's sake and backs Shiryu into a corner. The Rising Dragon is useless to Fenrir and Shiryu has seen through his techniques as well. Shiryu gets an idea and uses the Rising Dragon against the frozen waterfall, causing a massive avalanche, with both him and Fenrir caught up in it. The avalanche ends, and the wolves desperately look for Fenrir while Shiryu emerges from the debris. The wolves find Fenrir, but he has died, ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/35Rd1A2JtO5b7jJ6tsIRIimoR7n.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-06-11","episode_number":81,"episode_type":"standard","id":1531178,"name":"Freya! Death Battle due to Love","overview":"Hägen unleashes the mighty technique Universe Freezing against Hyoga, but it is useless against him as he easily breaks free. Hyoga then tells Hägen that he let himself be captured by Asgard soldiers to discover what happened to Hilda. He was even severely beaten by Thor. But Freya came to Hyoga's cell and freed him, hoping that Athena and her Saints would help save her sister and Asgard. Hägen refuses to listen and attacks Hyoga with vicious assaults. Hägen remembers being Freya's closest friend during their childhood and one of Hilda's most loyal warriors. Hyoga ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/qY1BL3jYRfQupapd9HguvDm7b7p.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-06-18","episode_number":82,"episode_type":"standard","id":1531179,"name":"Dancing Swan! Burning Hell Inside the Ice","overview":"Hyoga is confused as to why Hägen can withstand the heat. Hägen received his God Robe in that place and has trained there since childhood, mastering both ice and fire techniques. As Hyoga tried to see through Hägen's technique, he is continuously overpowered and knocked down, but still manage to stand up and asks for the Odin Sapphire. Both attack each other again, but Hyoga falls unconscious. Just as Hägen is about to throw Hyoga into the lava, Freya arrives and tries to tell him about Hilda and the Nibelung Ring. However, Hägen still believes Freya is being ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/7ilENkMQjCifpLY1mAniU0eeEhF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-06-25","episode_number":83,"episode_type":"standard","id":1531180,"name":"The Bewitching Harp! A Musical Prelude of Death Tempts Shun","overview":"After making a grave for Hägen, Hyoga has Kiki take care of Freya and heads for the Valhalla Palace. Hilda, angered that three of her God Warriors have died, is confident she can still win since most of the Bronze Saints are injured. After Seiya falls off a cliff, he remembers how the Gold Saints Aiolia, Milo, Aldebaran, Shaka and Mu gave up a portion of their blood in order to revive their five Bronze Cloths, which explains their new appearances. The Gold Saints made this sacrifice as a sign of gratitude to the Bronze Saints for rescuing Athena. Seiya climbs back up ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/DXDoALqegjmucnUXQKMjKjyj2M.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-07-02","episode_number":84,"episode_type":"standard","id":1531181,"name":"Decree of Death! String Requiem","overview":"Shun still struggles against Mime's abilities and illusions. He then removes his Cloth and chains. While talking to Mime, Shun realizes he's not fighting for Hilda and also dislikes fighting. Shun awakens the Seventh Sense and uses the Nebula Stream to immobilize Mime. Finally, he unleashes the Nebula Storm in order to defeat him. Unfortunately, Mime survives thanks to his harp. He then envelopes Shun with the strings on his harp, preparing for his final attack, Stringer Requiem. As Mime plays his music preparing to kill Shun, the chains still cannot sense any hatred....","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/dA5wfTLueUwp1qI6DhoLy3CdZhY.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637e61fffa404600afd5652d","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"1988-07-09","episode_number":85,"episode_type":"standard","id":1531182,"name":"Hero of Grief! Frozen Hatred","overview":"Ikki is able to miraculously dodge Mime's light-speed attack due to his battle against Saga, and also manages to see through his illusion technique. While Ikki is fighting, he senses something in Mime's mind. Ikki tells Mime that he used to hate his destiny and it was because of his friendship with Seiya and the Saints that he found a reason for fighting. Even though Mime gains the upper hand, Ikki cannot sense any hatred within him either. Mime reveals his childhood past. He was trained by his father Folker, a mighty warrior of Asgard, respected by all, who forced ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/mSzLYBXcgUhyom0t81T5RhNYtK2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-07-16","episode_number":86,"episode_type":"standard","id":1531183,"name":"Phoenix! Crimson Wings Ablaze","overview":"Ikki tells Mime that he hates himself for killing his father and should make up for his crime by saving Asgard from Hilda's wrath. Mime then remembers how Folker trained him, because he knew that he would be chosen as a God Warrior to protect Asgard. As Mime attacks, Ikki is able to counter, but both seem evenly matched. Suddenly, Mime uses his Stringer Requiem and Ikki is trapped while Mime plays his music, preparing to kill him. Shun tries to stop him, but Ikki tells him to pull back, saying he will defeat Mime. Ikki burns his Cosmos to the Seventh Sense and frees ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/biZbJlXwJdSUDsX6wiaY6OyQq9L.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-07-23","episode_number":87,"episode_type":"standard","id":1531184,"name":"Demon's Amethyst! Saint's Cemetery","overview":"Alberich leaves to defeat the Saints. As the Saints get closer to the Valhalla Palace, Shiryu finally recovers from the fall. Alberich has always hated Hilda for not appreciating his intelligence, and he secretly plans to recover the Odin Sapphires for himself. Just then, a Saint attacks him and tries to escape. The Saint is revealed to be Eagle Marin. Alberich reveals to Marin that they are in the area of his \"collection\" of victims, skeletal warriors trapped in an amethyst casing. Marin knocks down Alberich, but he cheats by spraying acid in her face. Seiya senses ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/dx6JbYQ8TBvkzH0lH2hklXCgpJd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-07-30","episode_number":88,"episode_type":"standard","id":1531185,"name":"Sword of Flame! Dreadful Ambition","overview":"Seiya remembers how Marin was a good influence on him, but he knows he has to save Athena and Asgard, so he decides to defeat Alberich. However, Alberich reveals his Sword of Flame, which came with his Megrez God Robe and tries to slash Seiya with it, while at the same time, tricking Seiya about Marin. Alberich is willing to win no matter what it takes. Although Seiya barely manages to disarm Alberich, he is caught in the Amethyst Shield. Alberich then recover Thor's Odin Sapphire. Hyoga senses Seiya's Cosmo disappearing and rushes to find him. It is revealed that ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/rbZnfxh25vvKWQ7gBSRrukEOihy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-08-13","episode_number":89,"episode_type":"standard","id":1531186,"name":"Victims of Evil! Forest of Spirits","overview":"Hyoga saves himself and strikes with all of his techniques, but they seem to be ineffective against Alberich. Meanwhile, Shiryu is able to climb up the ice cavern and return to the battlefield, thanks to his master's advice. Alberich leads Hyoga deeper into the forest where he unveils a secret technique handed down from his ancestors, Nature Unity, where the spirits of the forest come alive and attack the enemy. Shiryu senses Hyoga is in danger and tries to find him. As Hyoga struggles to get up and fight, Alberich uses the Amethyst Shield, but is saved by Shiryu in ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/2fF0goAVjuL44UxCtUinhmB4oJR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-08-20","episode_number":90,"episode_type":"standard","id":1531187,"name":"Don't Look Back, Seiya! Cosmo of the Rising Dragon","overview":"As Shiryu struggles with the Nature Unity, Roshi speaks to him, telling him to remain motionless and become one with nature. The spirits then release Shiryu. Unfortunately, since Shiryu starts moving again after being provoked by Alberich, the spirits attack him again, so he becomes one with nature again. However, Alberich does whatever he can to distract Shiryu's concentration. Alberich remembers that his family was left with the task of protecting the Odin representative on Earth, but since Hilda uncovered the God Robes, the Odin Sapphires were uncovered as well. He...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/kxZSnfNfUvBcv06RwLTPSvqjXB8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-08-27","episode_number":91,"episode_type":"standard","id":1531188,"name":"Burn, Shun! Hidden Mystery of the Black Fangs","overview":"Hilda is very confident is Syd's victory, and while Shun enters the palace, Syd appears before him, remembering their last encounter. Seiya and Hyoga arrive, but just as Seiya challenges Syd again, Shun has him and Hyoga go forward while he fights the God Warrior by himself, promising to catch up later. While both of them run past Syd, a mysterious figure sees them. Shun attacks with his Nebula Chain, but is useless against Syd's cold air. Outside, Shaina arrives and finds Marin. She then tells Shaina about how Aldebaran was defeated. He survived, but revealed to ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/ojEQFm7v0PGJscTrdqepPsFeBAN.jpg","vote_average":5,"vote_count":3,"crew":[{"job":"Director","department":"Directing","credit_id":"637e61fffa404600afd5652d","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"1988-09-03","episode_number":92,"episode_type":"standard","id":1531189,"name":"Swirl! Ultimate Shun's Nebula Storm","overview":"As Shun gets up, Syd reveals Seiya and Hyoga will die soon due to the cold air in the palace. Shun struggles to defeat Syd in order to rescue his friends, but his chains are ineffective. Syd unleashes his ultimate technique, Blue Impulse, against Shun, tossing him in the air and crashing to the ground. Meanwhile, Shaina is on her way to the Valhalla Palace. As Shun is out cold, Ikki speaks to him, urging him not to abandon his friends or Athena and reminding him of when he unleashed his true power in the Battle of the 12 Houses. Shun also remembers the Gold Saints' ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/6LbpZimsOpm6jOhDy7yOkXYaZas.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-09-10","episode_number":93,"episode_type":"standard","id":1531190,"name":"Bud! The Fateful Twin Stars","overview":"Ikki arrives after his battle with Mime, determined not to abandon his brother. Bud, angered at the fraternal bond between Shun and Ikki, begins to attack, saying that compassion is useless. Ikki miraculously blocks Bud's light speed attack before they clash, whereupon Bud's helmet is knocked off, and his face is exactly like Syd's. Bud reveals that Syd is his younger twin brother. Ikki confronts him about not helping his brother, and Bud responds that if Syd dies, he will become the true God Warrior of Zeta, and no longer be a shadow. Ikki attacks, but Bud easily ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/1AQrNaTaf8DEnJxuqBXcje7ut2C.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-09-17","episode_number":94,"episode_type":"standard","id":1531191,"name":"Bonding Brotherhood! Syd, Rest in Your Native Land","overview":"It seems Ikki is no match for Bud. Shun and Ikki try to attack together, but are both knocked down by Bud. Ikki then uses his Phoenix Illusion against Bud. In his mind, Bud defeats Syd, but for some reason, he can't give him the death blow. Ikki confronts Bud about trying to help out Syd during his battle with Shun, even though he claimed he wanted Syd dead. Ikki and Bud clash again, with Ikki coming out on top after awakening his Seventh Sense. Suddenly, Syd sneaks up on Ikki and holds him so that Bud can defeat him. Even though Bud is concerned, Syd tells him he's ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/uUhoE7OPmZ3EXzzPdKaDy9hudSr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-10-15","episode_number":95,"episode_type":"standard","id":1531192,"name":"Hero with the Noble Spirit! Rebirth of the Legendary Knight","overview":"Kiki tries to stop Freya from going to Saori's side, who is getting weaker by the minute. She realizes that even though Siegfried is the last God Warrior, Siegfried is reincarnated from a warrior with the same name, who became immortal after defeating a dragon and bathing in its blood. Shun and Ikki take Hyoga with them further into the palace. Seiya reaches the Odin statue, but Dubhe Siegfried stands in his way, not willing to show any mercy. Siegfried easily dodges Seiya's attacks and defeats him with his Odin Sword technique. Hyoga, Shun and Ikki arrive while Kiki ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/slXMlOvfbuqEJ2IrL3fmzziYRyr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-10-22","episode_number":96,"episode_type":"standard","id":1531193,"name":"Dragon vs Dragon! Chance of Victory is One in a Hundred Thousand","overview":"Shiryu faces Siegfried on his own, despite not wearing his Dragon Cloth. No matter what technique Shiryu uses, Siegfried is unscathed, making him wonder if he's really immortal, just like the legend. Back at the caps, Saori can't hold on anymore. Shiryu is struck by the Odin Sword technique and thinks about using the Final Dragon, like he did on Shura. He holds on to Siegfried and prepares the forbidden technique. Just then, Shura's spirit talks to Shiryu and tells him not to do it, otherwise not only will he not protect Athena, the Odin Sapphire would be destroyed as...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/o6SyDzbpMoBox7cHMw0GeVW1xck.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637e61fffa404600afd5652d","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"1988-10-29","episode_number":97,"episode_type":"standard","id":1531194,"name":"Siren! Beautiful Melody of Death","overview":"Both warriors use their techniques, but Seiya is overpowered and falls to the ground, yet he was able to land several hits on Siegfried's heart. Saori, Shiryu and his friends deposit their Cosmo into Seiya, making Siegfried doubt is Hilda is right, or if Athena is true justice. Hilda suddenly arrives and attempts to finish off Seiya, but Siegfried stops her to confirm his doubts. They attack again, with Seiya's Meteors pushing back Siegfried's Dragon Bravest Blizzard and attacking his heart. Seiya has finally won and goes to retrieve the Sapphire. But a man, playing a...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/dx6JbYQ8TBvkzH0lH2hklXCgpJd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-11-05","episode_number":98,"episode_type":"standard","id":1531195,"name":"Appearance of a Miracle! The Odin Robe","overview":"With her evil power, Hilda tries to kill Seiya. Shiryu, Hyoga, Shun and Ikki struggle to help their friend. Saori's Cosmos won't last much longer. Seiya fights back, but can't kill Hilda, otherwise Asgard and the world would be lost. Hilda attacks and Seiya falls down a cliff. As Seiya is about to give up, Saga's spirit calls out to him, reminding him of their battle and how he awakened the Seventh Sense to defeat him and save Athena. Saga also reminds Seiya that he will win as long as he has hope, entrusting him with Athena. Seiya climbs back up and heads for Odin's ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/6bpLLzzh3uIBNuOMBmTmvBEmkdd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-11-12","episode_number":99,"episode_type":"standard","id":1531196,"name":"Athena! Eternal Prayers of Noble Spirits","overview":"Seiya is victorious and the Nibelung Ring is finally destroyed. The Odin Robe removes itself from Seiya's body, completing its mission. However, Hilda is down, and bleeding. Seiya fears he has killed her, and Saori is down as well, exhausted from using all of her Cosmo. Asgard begins to crumble and the flood seems imminent. As the flood continues, the corpses of the God Warriors (including Bud, who succumbed to his wounds) are shown. Seiya's friends regain consciousness and so does Hilda. She then takes the Balmung sword and prays for everything to be returned to ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/xP16bBouhe5gT8ysTmJbXkz6RPz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-11-19","episode_number":100,"episode_type":"standard","id":1531197,"name":"The Ocean Emperor Poseidon! Holy War once Again","overview":"There is pouring rain and floods in all parts of the globe. Tatsumi, Jabu and the other Saints are aware of the panic around the world and wonder what is happening. In Asgard, Seiya and Shun return to Hilda and Freya, with no trace of Saori's whereabouts, but they do believe Poseidon has taken her to the underwater Sanctuary. Saori awakens and encounters Poseidon, but she recognizes him as Julian Solo. She first met him during his 16th birthday party. Julian Solo's family is one of the wealthiest sea merchants in the world and he is the heir. When he met Saori, he ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/2X6fuvlfOX48JFSRktEOMY06RRJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-11-26","episode_number":101,"episode_type":"standard","id":1531198,"name":"Smash! Mammoth Pillars of the Seven Oceans","overview":"Seiya and Shun recover and defeat the Mariners who have arrived. Meanwhile, Poseidon takes Saori to a place where she will give humanity a chance to live, by sacrificing her life. He explains that the underwater Sanctuary has Mammoth Pillars that hold up the seven seas: the North Pacific, South Pacific, North Atlantic, South Atlantic, Indian, Arctic, and Antarctic Oceans. The Mammoth Pillar holding up the sea in its entirety is the Main breadwinner. If it is destroyed, the underwater Sanctuary will be no more. The water that is raining down on the Earth, now falls ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/4eQTo4ycabW2rmsHdgSrOp9jCqz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-12-03","episode_number":102,"episode_type":"standard","id":1531199,"name":"Mysterious Shine! Golden Bronze Clothes","overview":"Seiya was attacked twice by Baian's God Breath, and is still able to stand. Baian uses his most powerful attack, Rising Billows, which sends Seiya all the way to the surface of the Pacific Ocean. Shiryu and Kiki arrive in Asgard and dive into the whirlpool. Seiya was able to return to the battlefield, determined to win. As he attacks with his Meteors again, Seiya is able to break through Baian's defensive wall. Shun arrives at the South Pacific Mammoth Pillar and sees a mysterious woman, but she transforms into a demon. It attacks, but Shun is able to defend himself ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/2Q7p32R5D4iBzoNmUpVhMfeobQp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-12-10","episode_number":103,"episode_type":"standard","id":1531200,"name":"Dangerous Shun! Dreadful Fangs of the Demon Beast","overview":"With his dying breath, Baian tells Seiya he will never be able to destroy the pillar. Seiya's Comet and Meteor of Pegasus are useless and fail to even make a scratch. Meanwhile, Kiki is saved by Ophiucius Shaina who brought the Libra Gold Cloth with her, under Roshi's orders. Seiya plans on destroying the pillar using his own body, but Kiki stops him and brings the Gold Cloth to him. Meanwhile, Shaina stayed behind to fight Thetis. The Golden Shield flies to Seiya's hands, and he uses it to finally destroy the North Pacific Mammoth Pillar with a mighty throw. As the ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/5vODDFhzSrzqgkXapLBCoXpfASD.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637e61fffa404600afd5652d","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"1988-12-17","episode_number":104,"episode_type":"standard","id":1531201,"name":"Death of the Demon Beast! Indestructible Golden Chains","overview":"Io attacks with Eagle Clutch, but Shun counters with a Casting Net and destroys the eagle. Shun doesn't want to fight, but Io continues with Serpent Strangler. Shun finishes it off with Spiral Duct. Poseidon talks to Saori about the night they met. Julian went to Cape Sounion and found Poseidon's Trident. Thetis appeared and told him Poseidon reincarnated in him and took him to Poseidon's Sanctuary to rule. Poseidon's Scales covered Julian and has ruled the oceans since that day, willing to destroy humanity for contaminating the planet the gods bestowed upon them. ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/6tA1xbEsAfQJB2vyGSroEWoAvpX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1988-12-24","episode_number":105,"episode_type":"standard","id":1531202,"name":"Excalibur! Shura's Soul Resides in the Right Wrist","overview":"Shun realizes the Gold Saints' blood caused the miracle, but Io assures the pillar will never be destroyed, not even the Gold Saints can do it. Shun decides to sacrifice his life to try to destroy the pillar. While Seiya and Hyoga try to find the next pillars, Kiki gets to Shun in time and Libra's Twin Rod flies to Shun's hand. Shun destroys the Mammoth Pillar, but Io sacrifices himself to save it, but to no avail. The South Pacific Mammoth Pillar is destroyed. As Io dies, he tells Shun that he must not have compassion for the enemy, or he will lose his life as well. ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/zdbvVaVjG0jtWwDXXqKcU3KyXh7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-01-14","episode_number":106,"episode_type":"standard","id":1531203,"name":"The Dream Left Nothing Behind! The Reunion has the Scent of Death","overview":"Krishna's Cosmo is keeping Shiryu from reaching the pillar. Not even the Rising Dragon can break through it. Krishna explains that his Cosmo, known as Chakra, is formed by seven vital points. Unless Shiryu destroys those points, the barrier won't be broken. Krishna then uses his Maha Roshini, which leaves Shiryu blind. Shiryu burns his Cosmo to the Seventh Sense and sees the seven vital points. He then uses Excalibur to destroy the points, along with Krishna. Hyoga reaches the Antarctic Ocean Mammoth Pillar, but surprisingly, Aquarius Camus is waiting for him. Hyoga ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/cpr96e7XctRaRHwPvVFcLx5AHaH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-01-28","episode_number":107,"episode_type":"standard","id":1531204,"name":"Hunter of Hearts! Heartless Lymnades","overview":"Shun counters Ikki and wonders why he's attacking him. Ikki suddenly transforms and reveals his true identity, the Mariner General, Lymnades Caça. His ability is to read his enemies' minds and transform into someone they care about in order to kill them. Camus and Seika were also Caça's disguises and defeated Hyoga and Seiya with one blow after deceiving them. Shun attacks Caça for hurting his friends and deceiving their hearts. Caça is captured by the Nebula Chain, but he then transforms into Ikki again, since he knows Shun won't attack him. His theory is proven ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/fAre0TvBvohMTEcMQnXhlmwOuDo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-02-11","episode_number":108,"episode_type":"standard","id":1531205,"name":"Issac! A Cold Hearted Man","overview":"Hyoga comes to, tells Ikki he was weak because of his emotions and tells him to continue. Hyoga must control his emotions and be strong during battle, like Camus taught him. He then goes to the Arctic Ocean Mammoth Pillar. Ikki heads to Poseidon's Temple, hoping his friends will remain strong and focus on saving Athena. Hyoga arrives at the pillar and senses a familiar cold air. A Mariner General greets him, and he is revealed to be Issac, Hyoga's training partner when he trained with the Crystal Saint. Now the Mariner General Kraken Issac, he attacks Hyoga, leaving ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/6Zbq7N99yChXK7GK1NDw86nrs4G.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-02-18","episode_number":109,"episode_type":"standard","id":1531206,"name":"Hang in there Kiki! A Sorrowful Death Battle","overview":"Shun recovers and tells Kiki to find Hyoga while he goes to the next pillar. Hyoga gets up and tries to tell Issac he's wrong, but Issac insults his former masters, that they weren't strong enough to protect the world. He then attacks Hyoga again, knocking him out. Just then, Kiki arrives, and Issac attacks him to take the Libra Cloth and stop the pillars' destruction. Kiki refuses to let the box go while Issac stomps him mercilessly. Kiki is risking himself, just like his friends are, so he can be a Saint one day. Hyoga gets up and lets Kiki rest until Issac is ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/y5v8nFQteb1hZC1aJjcaWBYjAgi.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637e61fffa404600afd5652d","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"1989-02-25","episode_number":110,"episode_type":"standard","id":1531207,"name":"Listen! The Beautiful Singing of Athena","overview":"Sea Dragon approaches Ikki, but he has sensed this Cosmos before. He then attacks Ikki with a Galaxian Explosion, destroying his helmet. Ikki demands Sea Dragon to reveal who he is. He removes his helmet, and he reveals himself to be Gemini Saga's twin brother, Gemini Kanon, who is pure evil. Kanon sends Ikki to another dimension, using his Golden Triangle, which resembles the Bermuda Triangle. He then claims he will rule both the Earth and the sea. Seiya recovers, sensing Saori's weakened Cosmos. Shaina is still fighting Thetis and is able to defeat her with her ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/lfDyAeCKMAYRI5KJS6BhaOw8SKH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-03-11","episode_number":111,"episode_type":"standard","id":1531208,"name":"Friends! Together at the Time of Death","overview":"Saori's singing is heard throughout the underwater Sanctuary. Seiya arrives at the Temple and sees Shaina unconscious. He then encounters Poseidon and finds out that the Main Breadwinner is almost full of water. Seiya attacks, but his attacks come back to him. Poseidon then destroys the Pegasus Cloth and is about to finish off Seiya, but Shiryu arrives in time to protect him. At the Sanctuary, Milo, Shaka, and Aldebaran gather around Mu and Aiolia, with Milo wanting to help the Bronze Saints. Shiryu attacks Poseidon, but to no avail. Hyoga also arrives, saying if they...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/cwexOxUOix270h2poSschYvAo8u.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-03-18","episode_number":112,"episode_type":"standard","id":1531209,"name":"Two Souls! Mystery of Poseidon's Resurrection","overview":"Kanon reveal's his evil plot, while Seya dresses in golden armor, fights against Poseidon.","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/xNyt7gxex6Tb0u05un38MY8jNBh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1989-03-25","episode_number":113,"episode_type":"standard","id":1531210,"name":"Shoot Poseidon! The Golden Arrow","overview":"Seiya fires the arrow, but Poseidon controls it, firing it at Seiya's heart. Miraculously, he survives, thanks to the Gold Cloth. Seiya fires again, and Poseidon controls the arrow, but Shaina protects Seiya, and the arrow hits her back. She tells Seiya he is their last hope and that he must not die. At the Sanctuary, a beam of light shoots from the House of Aquarius, heading for Poseidon's temple. Shaina extracts the arrow from her back and hands it to Seiya, saying she will protect him, no matter what, and to fire as many times as necessary. Poseidon controls the ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/v6xQKhApjwYoWWszLgooM6zDN6c.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637e61fffa404600afd5652d","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"1989-04-01","episode_number":114,"episode_type":"finale","id":1531211,"name":"Shine, Stars of Friendship! Legend of Youth","overview":"Seiya, Hyoga and Shiryu combine their techniques and Cosmo, knocking down Poseidon. Shiryu tries to destroy the Main Breadwinner with the Golden Shield, but it flies back to him, with the pillar unscathed. Meanwhile, Ikki is mercilessly attacked by Kanon, angry that his ambitions are crushed. Sorrento tries to kill Kanon with his melody, but Ikki asks to talk to Kanon, about the one thing used to seal Poseidon's soul: Athena's urn. Seiya and his friends are unable to destroy the pillar with Libra's weapons. Seiya asks his friends to launch his body with their ...","production_code":"","runtime":24,"season_number":1,"show_id":42444,"still_path":"/twXR5htF9n8Z8eskIJlK9xsR7Wx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":65042,"poster_path":"/dnwkiZIKhAjDTMBi2tv10cmACX3.jpg","season_number":1,"vote_average":8.4}}}