{"adult":false,"backdrop_path":null,"created_by":[{"id":1236130,"credit_id":"5257605b760ee36aaa2f2e19","name":"Elise Doganieri","profile_path":null}],"episode_run_time":[60],"first_air_date":"2006-11-09","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.axn-asia.com/tara/","id":4256,"in_production":false,"languages":["en"],"last_air_date":"2016-12-15","last_episode_to_air":{"id":2746088,"name":"Leg 10","overview":"","vote_average":0,"vote_count":0,"air_date":"2016-12-15","episode_number":10,"episode_type":"finale","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null},"name":"The Amazing Race Asia","next_episode_to_air":null,"networks":[],"number_of_episodes":59,"number_of_seasons":5,"origin_country":["AU","SG"],"original_language":"en","original_name":"The Amazing Race Asia","overview":"The Amazing Race Asia is a reality game show based on the American series The Amazing Race.\n\nOn 17 October 2005, CBS gave other countries the chance to franchise The Amazing Race. The Asian cable TV network AXN Asia was among the first to acquire the rights to produce a version for its territories. The show is produced by Australian television production company ActiveTV, for AXN, in association with Buena Vista International Television-Asia Pacific. The host for the show is Singapore based Chinese-American actor Allan Wu.\n\nThe ultimate prize is US$100,000, whilst the American show gives away US$1,000,000. The general manager of SPE Networks-Asia which runs AXN, Ricky Ow explained the smaller prize, saying, \"It is not really about the money but the adventure and opportunity to be in one of the world's greatest reality shows\".","popularity":4.693,"poster_path":"/z4Ou3cXvRZMAzAXsSiifi3TuJCq.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2006-11-07","episode_count":8,"id":12508,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2006-11-09","episode_count":13,"id":12507,"name":"Season 1","overview":"The Amazing Race Asia 1 is the first season of the reality television game show The Amazing Race Asia. The show features ten teams of two, with a pre-existing relationship, in a race around Asia and Pacific Rim to win US$100,000. Applications were accepted through 31 March 2006. The season began on 9 November 2006 and the season finale aired on 1 February 2007.\n\nMalaysian workers Zabrina Fernandez & Joe Jer Tee are the winners of the race. They were the first all female team to win in the \"The Amazing Race\" franchise and at the time were the first team to win without relying on a Fast Forward or a Yield and also the first winners to win only the final leg of the race.","poster_path":"/k5o8CIfVvGiwflaCVVaXoWcqTmI.jpg","season_number":1,"vote_average":0},{"air_date":"2007-11-22","episode_count":13,"id":12506,"name":"Season 2","overview":"The Amazing Race Asia 2 is the second season of the reality television game show The Amazing Race Asia. The show features ten teams of two, with a pre-existing relationship, in a race around the world to win US$100,000.\n\nThis season premiered on 22 November 2007 at 9PM and ended on 14 February 2008 at 9PM.\n\nSingaporean gym buddies Adrian Yap & Collin Low were the winners of this race.","poster_path":"/v2Be0bKddXpGUx3g6GjZ8LBk86U.jpg","season_number":2,"vote_average":0},{"air_date":"2008-09-13","episode_count":11,"id":12505,"name":"Season 3","overview":"The Amazing Race Asia 3 is the third installment of the reality television game show The Amazing Race Asia. The show features ten teams of two, with a pre-existing relationship, in a race around Asia to win US$100,000. The season premiered on 11 September 2008 and consists of 11 episodes, two episodes fewer than the first and second seasons. The season finale aired on 20 November 2008.\n\nIn 2009, the series was nominated for an International Emmy Award for Best Non-Scripted Entertainment, losing to the Dutch reality series The Phone.\n\nHong Kong friends Vince Chung & Sam Wu are the winners of the race, they are the first team with a non-Asian in the Asian Version to win the race.","poster_path":"/aGNChZHErgUYVMAzBEltMuIdFpl.jpg","season_number":3,"vote_average":0},{"air_date":"2010-09-23","episode_count":12,"id":12509,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2016-10-13","episode_count":10,"id":81054,"name":"Season 5","overview":"","poster_path":"/xx26rEsHRsYNPPKcapKQ4xJRJvf.jpg","season_number":5,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8,"vote_count":3,"season_data":{"1":{"_id":"52576057760ee36aaa2f27cf","air_date":"2006-11-09","episodes":[{"air_date":"2006-11-09","episode_number":1,"episode_type":"standard","id":290611,"name":"I Don't Think I Can Do This","overview":"The first leg of The Amazing Race Asia started off in Kuala Lumpur, Malaysia, The two Malaysian Teams took home ground advantage although Andrew & Syeon made a last-minute blunder that let Mardy & Marsio take first place. Francesca & Sandy, nearly made an early departure from the race, but fortunately for them, this was a non-elimination round.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/dQ90yuhEqo1y7HvksJRV0C5AU2G.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-16","episode_number":2,"episode_type":"standard","id":290613,"name":"They're Speedy, They're Fast and They're First","overview":"From Kuala Lumpur, the Teams headed off to Jakarta, Indonesia, where they faced giant snakes and pushcarts. Mardy & Marsio slipped to second place, while the Indian Team took first place after winning the Fast Forward. We also say goodbye to the first team eliminated from The Amazing Race Asia.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/zxmHgVmqhTl3g4UHeA6F1VWULPD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-23","episode_number":3,"episode_type":"standard","id":290614,"name":"Its on now!","overview":"The next stop on The Amazing Race Asia was beautiful Bali, Indonesia. A routine Roadblock on Kuta Beach turned into a monumental task that made some of the teams quit ... and led to the elimination of the second team from the Philippines.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/nq9wBWhAC5PuKx4PWHsCwJTv5t3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-30","episode_number":4,"episode_type":"standard","id":290612,"name":"Just Shut Up and Do It","overview":"Once again, after a mandated rest period, the Teams set off to the destination for the next leg of the race, Sydney, Australia.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/yq8HVRVERBuOXHWI6BCGvMiGeB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-07","episode_number":5,"episode_type":"standard","id":290615,"name":"It's Blowing Like Your Mum's Pants on a Windy Day","overview":"From Sydney its a short hop to Auckland, New Zealand. A new city, with new challenges, and a simple task turns into a real complication for the teams. One team finds out how easilly winning can turn into losing as they unknowingly break the rules that could cost them the race.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/d8etTUmEif12mZ7dXjf5TV0vCmP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-14","episode_number":6,"episode_type":"standard","id":290621,"name":"What Have You Been Eating!","overview":"The seven remaining teams started the next leg at the Auckland Museum in the centre of Auckland, New Zealand. To the South Island they go, arriving in Queenstown the extreme sport capital of the world. Teams face heights and extreme challenges in this leg.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/tx6VqpAbveqzU10YUwk9Mh8EoC1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-21","episode_number":7,"episode_type":"standard","id":290617,"name":"Don't Stand There Doing Nothing!","overview":"The six remaining Teams set out from Chard Farm Winery, the Pitstop from the previous leg of The Amazing Race Asia. The Teams left in the order that they arrived at the Pitstop, with the exception of Andy & Laura, who had to wait an extra 92 minutes as a penalty for Andy's speeding ticket in the last leg. Through Singapore and then to Bangkok, Thailand even Thailand residents Andy and Laura face language barriers on this leg.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/oYZ6bhZdnjt8rWhdFmNIcA8mDKU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-12-28","episode_number":8,"episode_type":"standard","id":290619,"name":"My Legs Are Shaking Like Jelly","overview":"The remaining six Teams departed from Wat Pho, the temple of the Reclining Buddha, which was the Pit Stop from the previous leg of The Amazing Race Asia. The Teams were to travel to Krabi in Southern Thailand to find their next clue. Joe Jer & Zabrina were the last team to depart and had the additional penalty of not having any money because they finished last in the previous leg. Fortunately, the other teams had left them enough money to get to the bus terminal and buy bus tickets - and once they got there, Joe Jer & Zabrina begged some kind strangers for financial help. In southern Thailand the teams hit the beach, but not in a fun way, as physical challenges from coconut smashing to rock climbing stood in their way.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/nEFHkDDKM1G3fken0PmW3SgNSGR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-04","episode_number":9,"episode_type":"standard","id":290616,"name":"This is Totally, Totally Out of This World!","overview":"The five teams left are off again, minus Howard & Sahran who were eliminated in the last round, to Kolkata, India. The Teams were in for even more challenges this time,\n\nas they shone shoes, lighted a candle for the dearly\n\ndeparted, and squeezed in a giant meal. As tension between Andy and Laura and the rest of the teams emerge, the racers are greeted by a surprise from Allan as they near the end of the leg.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/nGDpXgjGJAnNCmmUoQlgag6K5et.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-11","episode_number":10,"episode_type":"standard","id":290618,"name":"War Has Begun!","overview":"No mandatory rest period this time, as the leg continues to Delhi, India. Five teams remain, with three teams still on the way to check in with host Allan Wu, at the Kolay Market. This leg the teams face dungcakes, donkeys and sacks full of chillies on The Amazing Race Asia. Tension between everyone and Andy and Laura build on the race to a yield marker. When the extended leg ends, one team will go home.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/b6X7GGeKBtmFQdEtO41yJ6Ul8GN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-18","episode_number":11,"episode_type":"standard","id":290620,"name":"This is Going to be Embarrassing!","overview":"There are only four Teams left, and they seem to be equally matched, judging from how closely spaced their timing is. As the Race beings its end, the teams depart for Dubai, in the United Arab Emirates. The instructions also include a significant warning: caution, yield ahead. A new destination presents a new set of challenges, and with some teams the cracks are beginning to show.","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/j2QoMensaj7MqFwAk8GItv5lnfU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-25","episode_number":12,"episode_type":"standard","id":290622,"name":"Oh My Goodness, I Have to Eat a Brain!","overview":"Mardy & Marsio, having finished last in the previous non-elimination round found themselves stripped of their money. This time, the Teams were all business as they battled to make it into the top three. The Teams began from the Margham Desert Camp, after a rest period, and as usual, left in the order that they'd arrived the previous leg. Sandy & Francesca were the first to leave, having come in first place, but were very conscious that the gap between them and the next team was only a few minutes. No new destination this time – the game was going to be played in Dubai, with new challenges. The mix of challenges included camel-riding, treasure-hunting, and an eating challenge that pushed a couple of contestants to the limit. One team said goodbye, but which one? With only three teams left, who will win the Amazing Race Asia?","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/4xgP8PZdcpQOrIRz0DIOI98f8us.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-02-01","episode_number":13,"episode_type":"finale","id":290623,"name":"24 Days, 15 Cities, 39,000 Kilometers and it Comes Down to This","overview":"The pulse pounding race to the final pit stop and US$100,000 begins with the three final teams: Sandy & Francesca, Andrew & Syeon and Joe Jer & Zabrina. Starting from the Mina A' Salam Beach in Dubai, the teams quickly learn that they will return to where it all started to get to where it all ends: Malaysia. From Kuala Lumpur, its an exciting and suspensful ride through the final detour and road block to the final pit stop in Kuching, Malaysia. There Amazing Race history is made and the winners crowned!","production_code":"","runtime":60,"season_number":1,"show_id":4256,"still_path":"/mesl9AwwD9mYwccuRJVzEQPAOci.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"The Amazing Race Asia 1 is the first season of the reality television game show The Amazing Race Asia. The show features ten teams of two, with a pre-existing relationship, in a race around Asia and Pacific Rim to win US$100,000. Applications were accepted through 31 March 2006. The season began on 9 November 2006 and the season finale aired on 1 February 2007.\n\nMalaysian workers Zabrina Fernandez & Joe Jer Tee are the winners of the race. They were the first all female team to win in the \"The Amazing Race\" franchise and at the time were the first team to win without relying on a Fast Forward or a Yield and also the first winners to win only the final leg of the race.","id":12507,"poster_path":"/k5o8CIfVvGiwflaCVVaXoWcqTmI.jpg","season_number":1,"vote_average":0},"2":{"_id":"52576057760ee36aaa2f27c1","air_date":"2007-11-22","episodes":[{"air_date":"2007-11-22","episode_number":1,"episode_type":"standard","id":290600,"name":"The Race Begins","overview":"The second group of Amazing Race contestants set out on a race around the world for one hundred thousand dollars. The ten teams left the Asian Civilisations Museum near the Singapore river where they faced gruelling challenges such as a high physical task in a Detour. Teams then made their way to Manila in the Philippines where teams were required to use GPS systems to guide their Taxi drivers to the next location. Later, at the Plaza Miranda, teams had to eat eight baluts from an egg-seller's store before receiving their next clue from the egg seller. Teams then made their way to the Pit Stop located at Fort Santiago. Two teams raced each other to reach the mat first as another team was too late to catch up and stepped onto the mat last. They were relieved to know that had not been eliminated but were instead given a penalty.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/lsMZUkcwgoENWzihmi6LQ3APFo6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-29","episode_number":2,"episode_type":"standard","id":290597,"name":"Leg 2","overview":"All of the ten remaining teams continued racing in the Philippines where they eventually encountered their first Roadblock. To complete the task, one member had to get down and dirty by leading a carabao around a muddy field through a marked course. Teams then made their way back to Manila where they had to complete an additional task of loading and delivering food. Later, teams faced a Detour in which teams were given the choices of \"Heel\" or \"Wheel\". \"Heel\" required careful matching while \"Wheel\" is more of a puzzle task of assembling a bicycle. Lastly, teams had to make their way to Paco Park and Cemetery, the Pit Stop for this leg of the race. The clue stated that this was an elimination round so teams tried to gain higher positions as much as they could. Ultimately, a true photo finish resulted in the elimination of one team.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/q9O1ZitUBgRTc0azniRXUoduUiN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-06","episode_number":3,"episode_type":"standard","id":290603,"name":"Leg 3","overview":"The nine teams continued on to Hong Kong before heading directly to New Zealand where teams faced a Roadblock involving a bungee jump off the Auckland Harbour Bridge. Teams also experienced Rock climbing or a wet and wild task in a tiresome Detour. After a close foot race, one team was unable to catch up and were the last to arrive at the Pit Stop. This lead to their elimination.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/2XYPO3UQX15L7hETSH951DX9l7H.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-13","episode_number":4,"episode_type":"standard","id":290598,"name":"Leg 4","overview":"Eight teams leave Auckland and continued their adventures in New Zealand as they drove to Rotorua. At the Okere Falls Scenic Reserve, teams experienced white water sledging followed by riding on a Agrojet craft through Blue Lake. A Roadblock forced team members to search the hot mud baths of Hell's Gate for their next clue. For the Detour at a Maori village in Te Puia, teams must choose between Flax (weaving a traditional Maori headband) and Sticks (tossing training sticks to the beat of drum music). One team failed to recover after starting the leg nearly six hours behind and was eliminated.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/9B7JuHX9Xdz8t7WNX9TA66kCBKR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-20","episode_number":5,"episode_type":"standard","id":290602,"name":"Leg 5","overview":"In this leg's first Detour, teams had to choose between You Catch It or You Cart It. In You Catch It, teams had to participate in the traditional game of goldfish scooping, using paddles made of rice paper (which disintegrates very easily when immersed in water) to scoop up 40 goldfish with paddles. In You Cart It, teams had to locate a dry cleaner's store and collect a yukata which they had to deliver to a certain address. In the first Roadblock, one team member had to decipher an ice block puzzle. The answer would be the name of one of the biggest cities in Japan. Once the team member has figured out the answer, the personnel will hand them their next clue.\n\nIn the leg's second Detour, teams had to choose between Slither or Deliver. In Slither, teams had to proceed to the Jagalchi Fish Market where they will have to find a marked fish tank filled with octopus. Each team member must retrieve one 100-year old Korean coin (token) from the bottom of the tank before receiving their next clue. In Deliver, teams had to deliver six meals to three different addresses, some of the deliveries in which might have an ambiguous location. In the second Roadblock, teams proceeded to Yongdusan Park and look for a gatekeeper. The team member must then use the key given to search and open one of the locks before the gatekeeper will hand them their next clue. Teams will have to start over if they break their key.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/94ANXatQKCCYs3pdRoRZCDkNnWt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-27","episode_number":6,"episode_type":"standard","id":290601,"name":"Leg 6","overview":"In this Roadblock, one team member had to search under the lids of 1,500 soybean jars until they find one which contains their next clue. One of the jars will contain the clue plus a US$50 bonus from Standard Chartered, which Adrian and Collin won. In this Detour, teams had to choose between Too Ho and Too Heavy. In Too Ho, teams had to play a traditional Korean game where they have to throw three bamboo stickets into a cylinder 4.5 metres (15 ft) away. In Too Heavy, teams had to deliver 30 logs in a traditional carrying device and deliver it to a woman somewhere inside the village before receiving their next clue.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/dMDrxjsOLLUcgGE0IgdRvrG4lhz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-03","episode_number":7,"episode_type":"standard","id":290599,"name":"Leg 7","overview":"In this Roadblock, one team member had to don a full suit of knight armour and then walk around to look for a \"damsel in distress\", who is standing on a balcony facing the Prince's Hotel. Once teams find her, they have to tie the key to a rope which the \"damsel\" would exchange for their next clue. In this Detour, located in Nižbor (Czech), teams had to choose between Bow or Blow. In Bow, each team member had to hit a coloured red-and-yellow target using a traditional crossbow. In Blow, teams had to travel to Rückl Crystal and use mechanical tools to cut a star-design on a number of glass bottoms","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/roAxSAUCxdnJ86IVQyMHUPWu98t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-10","episode_number":8,"episode_type":"standard","id":290608,"name":"Leg 8","overview":"In this Detour, intersected teams had to choose between Snap or Roll. In Snap, teams had to take photos of three historic monuments (Statue of St. Wenceslas in Wenceslas Square, Lenin Statue in Museum of Communism, and Estates Theatre) in Prague and submit the photographs as evidence before the personnel positioned in front of the Statue of Josef Mánes would hand them their next clue. In Roll, teams had to locate Hostinec U Váhy and collect two 50-litre (13 gallons) beer kegs and roll it to the Admiral Botel. After the Detour, they are no longer intersected. In this Roadblock, one team member had to climb up to a ten-meter high diving board and jump off it into the pool below to receive their next clue.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/aTAYu2Ei8tefPog7BWb6DwVb078.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-17","episode_number":9,"episode_type":"standard","id":290607,"name":"Leg 9","overview":"In this Detour, teams had to choose between Pitch or Pull. In Pitch, teams had to load a large pile of hay into a donkey cart and then go for a ride as a local drives the cart to a nearby farm. In Pull, teams had to milk a goat and obtain 200ml (7 oz) of milk. Then, they had to place the goat in a pen and secure it before receiving their next clue. In this Roadblock, one team member had to experience several legs of flying fox obstacles while adding up several numbers found around the course which would add up to 1,000. Team members that do not get the correct number will have to restart the task and if there are other teams present, will be sent to the back of the line and have to wait their turn till the other teams in front of them are done or have to restart as well.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/5G65qtzhUsKeXIWRztJkeUArFi8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-24","episode_number":10,"episode_type":"standard","id":290605,"name":"Leg 10","overview":"In this Fast Forward, teams had to count the number of fence posts on Erzsébet Bridge and then with the number obtained, use it to open a safe with the 4-digit figure of fence posts (the correct digit was 2-3-7-7). The first team to open the safe won the Fast Forward award. In this Roadblock, one team member had to take a lantern and search through the dark and confusing labyrinth of tunnels in Buda Castle to search for several chests. However, only one of these contained the team's next clue. In this Detour, teams had to choose between Say It or Play It. In Say It, teams had to correctly pronounce (in full local accent) the names of 14 prominent Hungarian rulers, a potential tongue twister. In Play It, teams had to solve a Rubik's Cube (a Hungarian invention) but were given the option to solve one side by one side (to get the same colour on each side) for all six sides, alternating between team members.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/iTHLojrY5JvRy9i1TLRTgEFrRt9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-31","episode_number":11,"episode_type":"standard","id":290604,"name":"Leg 11","overview":"In this Roadblock, one team member must race eight laps around the Killarney racing circuit on a 450 horsepower (340 kW) open-wheel race car. After four laps, they must enter the pit area for a mandatory tune-up. If the team members entered it within seven minutes he/she could immediately exit and complete the task; otherwise, a five-minute time penalty would be incurred. In this Detour, teams had to choose between In One End or Out The Other. For In One End, teams must prepare 100 kg (220 lbs) of food and feed them to the elephants. Only after the elephants finish the entire meal could teams collect their next clue. In Out The Other, teams must clear the elephant stalls of dung onto a marked area, using only the tools provided.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/l6siWAZhya821zZeBs851a52FHf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-07","episode_number":12,"episode_type":"standard","id":290609,"name":"Leg 12","overview":"In the final Detour, teams travelled to Victoria & Alfred Waterfront and had to choose between Search or Assemble (This option was presented as \"Sound\" in the teams' clue). In Search, teams had to go The Scratch Patch and search amongst thousands of semi-precious gemstones for the three race stones which were yellow in colour and marked with a red dot. They will trade these three stones for their next clue. In Assemble, teams had to go to Waterfront Craft Market and watch a demonstration on how to assemble a wire-frame radio. Once teams had successfully put together a working radio using the tools provided, they would receive their next clue. In this Roadblock, one team member had to grab flags from the ten different countries they visited on the Race and arrange them in the order that they visited them. Once teams got the correct order of correct flags, they may retrieve the final clue.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/xHEje7Hd1s9hV6UL0MRjWnSzAw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-14","episode_number":13,"episode_type":"finale","id":290606,"name":"Finish","overview":"The final race to the finish line.","production_code":"","runtime":60,"season_number":2,"show_id":4256,"still_path":"/6lJdBVyqVjEGs656ixvWc5T64gz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"The Amazing Race Asia 2 is the second season of the reality television game show The Amazing Race Asia. The show features ten teams of two, with a pre-existing relationship, in a race around the world to win US$100,000.\n\nThis season premiered on 22 November 2007 at 9PM and ended on 14 February 2008 at 9PM.\n\nSingaporean gym buddies Adrian Yap & Collin Low were the winners of this race.","id":12506,"poster_path":"/v2Be0bKddXpGUx3g6GjZ8LBk86U.jpg","season_number":2,"vote_average":0},"3":{"_id":"52576057760ee36aaa2f27b3","air_date":"2008-09-13","episodes":[{"air_date":"2008-09-13","episode_number":1,"episode_type":"standard","id":290587,"name":"Thailand Kickstarts The Amazing Race Asia 3","overview":"Kicking off the race from a brand new location, 10 teams start off in Bangkok, the capital of Thailand, gunning for the top prize of US$100,000. The first Detour of the race was a choice between Race or Rice. In Race, teams had to proceed to the Chiang Mai X-Centre and drive an off-road buggy over an 8 km track to receive their next clue. In Rice, teams must work together to pound rice into paste and make two rice balls using a traditional method, subjected to approval.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/5j7SzF3H373LjeYvFSmqRtKtupk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-20","episode_number":2,"episode_type":"standard","id":290589,"name":"Flying High","overview":"After an arduous first leg that saw teams indulge in some bugs and insects, wash a two storey bus and pound some rice, the remaining 9 teams are kicking off their second day. In the first Roadblock of this season, one team member had to cross the plantation and retrieve a clue from a hanging backpack. The catch was that along the way, snipers brandishing paintball guns would fire at the team member; once shot, the team member must return to the starting point and perform the task again until successful. In this leg's Detour, the choice was between Sampan and Some Walk. In Sampan, teams must transport fruits on a sampan and row across the river to a designated fruit stall along the river. In Some Walk, teams must gather twenty live chickens and bring them to a designated retailer in the nearby market.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/t5NSOKQIMt9Qlb9DZK5JhpxW1PV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-27","episode_number":3,"episode_type":"standard","id":290585,"name":"25 Hour Rest-Less Journey","overview":"From the Museum of Vietnamese History in Ho Chi Minh, 8 teams remain in the race towards US$100.000. \n\nSiblings Bernie and Henry take the lead in this leg, and teams must now travel by bus, to the city of Hue in central Vietnam. The catch is, Hue is over 1,000kn away and the bus journey takes slightly over 25 hours.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/kfsiDLTQKczUUjX7qxY1x9T5C9W.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-04","episode_number":4,"episode_type":"standard","id":290586,"name":"New Destination","overview":"In this leg's Detour, teams had to choose between Shoot It or Shape It. In Shoot It, teams drive themselves to the Miniatures Museum of Taiwan and are told to use a Sony Cybershot camera to shoot a very miniature model of a yellow-race envelope hidden inside one of the dioramas. After the photo was printed, the next clue could be found behind their new photo. In Shape It, teams drive themselves to Raohe Street Night Market where they will have to solve four sets of figures using a large tangram set. In this leg's Roadblock, one team member had to completely consume an entire bowl of a Taiwanese/Chinese delicacy: stinky tofu.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/AqubjBcnQCHt88Lb9M6Cok9ZZOD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-11","episode_number":5,"episode_type":"standard","id":290590,"name":"Episode 5","overview":"As it stands, two teams have decided to bail out of the race by taking the four hour penalty for not completing a challenge. Can the other teams muster enough strength to continue with the race, or will more choose to take the easy way out?  After the task at the Sony Style Store, teams received a Fast Forward option. The Fast Forward was to travel to a certain street, where there will find a clue box. The clue would then instruct them to get a permanent tattoo at Kevin's Tattoo. The Roadblock was to find a souvenir, which would later be revealed to be a small silver token that had the AXN logo on one side and The Amazing Race Asia logo on the other side in a cart of coal. In this leg's Detour the choice was between Pick or Pail. In Pick, teams had to drive themselves to a local mall and retrieve three soft toys from a game machine. In Pail, teams had to go to the Grand Tong Temple and must fill a bucket full of water and carry it to the top of the mountain where a monk will check to see if they had enough water. If they have enough they will receive their next clue.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/An6hObepijsDx0Z7MqTjtZQUf0c.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-18","episode_number":6,"episode_type":"standard","id":290588,"name":"Episode 6","overview":"It is the halfway point in the race, and only half of the original 10 teams remain to claim the prize of US$100,000.   In this Detour, teams had to choose between Get Fishy or Get Lucky. In Get Fishy, teams had to find a seafood store in Graham Street to scale and gut 12 fishes to the satisfaction of a fishmonger, before they would receive their next clue. In Get Lucky, teams had to head to one of the designated tables at Mee Lun St. and bite into hundreds of fortune cookies in a marked jar and only when they find the one cookie which contains a fortune regarding their next clue can they proceed. In this Roadblock, one team member had to choose one of the provided handbags and search through the crowded market for the lady who is carrying the same handbag as the one the team member has chosen. This lady will hand them their final clue for the leg.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/j3Bdi07em8LfVzwCY5OEDrRUXQv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-25","episode_number":7,"episode_type":"standard","id":290593,"name":"What The Fish?","overview":"From one of the world's leading financial capitals, team Hong Kong, buddies Sam and Vince have a lot to celebrate. Not only are they home, but they have also emerged top in the previous leg of the race.  In this leg's Roadblock, the chosen team member must climb to the top of the Macau Tower, obtain their next clue there, and go down back to their partner before reading their next clue. However, due to the storm, not all the teams who were still performing the Roadblock at the time were allowed to climb to the top as a precaution. In this leg's Detour, the choice was between Dance or Chance. In Dance, the team members must correctly perform a lion dance routine to the satisfaction of the performance troupe. In Chance, teams must don formal attire and play a game of blackjack in the casino of Hotel Royal Macau; they must beat the dealer nine times (as denoted by the letters of the word COMPLETED) before receiving their next clue.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/2q4t70bqv2KH2N1SN5mUeysWUVo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-01","episode_number":8,"episode_type":"standard","id":290592,"name":"Episode 8","overview":"Luck seems to be smiling on Malaysian mothers Ida and Tania. Despite coming in last in the last two legs, both have proven to be non-elimination rounds. However, this could be their last chance as they are now faced with a 30 minute penalty if they are not the first team to the pit stop in this leg.  In this leg's Roadblock, the chosen team member must perform a bungee jump from the top of the Macau Tower to receive their next clue. The first team to complete the task will receive a helicopter ride from Macau to Hong Kong instead of the TurboJET ferry ride. In this leg's Detour, the choice was between Fish or Fill. In Fish, the team members must carry six large swordfish to a nearby restaurant before receiving their next clue. In Fill, teams must fill an intricate floor pattern using colored rice before receiving their next clue.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/mrbmFm7s3zs9kVAyu7YI8FJ25Ws.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-08","episode_number":9,"episode_type":"standard","id":290595,"name":"Episode 9","overview":"This is the penultimate stretch – with four teams remaining, one has to go home as only three teams will take part in the final race towards being champions on The Amazing Race Asia.  In this leg's roadblock, one team member had to find the correct pheta from 50 men who were walking around the castle. If that person found the pheta with the word \"Correct\" inside, they received the next clue. In this leg's detour, teams had to choose between Push and Crush. In Push, teams had to go to Datta Shinde Pottery Shop and push the cart with 75 pots one kilometer to Rajkumar Provision Stores in Mahatma Phule Market with 70 or more pots unbroken at the destination before receiving the next clue. In Crush teams had to go to the market, make 40 glasses of sugar cane juice and sell them to earn INR200 or more to receive the next clue.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/uVm036eVqRtJMnEDjy5M3ESvOBm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-15","episode_number":10,"episode_type":"standard","id":290596,"name":"Episode 10","overview":"Four teams remain in India and luckily for Singaporeans A.D. and Fuzzie, the previous leg was a non elimination round. This means there is still a chance to be in the final three teams in the last leg of The Amazing Race Asia. However, team Singapore must come in first in this leg, or face a 30 minute penalty.  In this leg's Detour, teams had to choose between Carpet and Count It. In Carpet, team had to walk to the carpet shop and find two exact carpets, using the images in the Sony Cybershot as references. In Count It team had to walk to a shop and count the dry lime and will only receive their clue once they state the correct amount to the shop owner (correct numbers were 1601, 1595, 1598 and 1577). This leg's Roadblock, one team member must zip across the canyon to the other side to receive the next clue.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/f95MdGhfkUlZesidr97AfiuFLd3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-22","episode_number":11,"episode_type":"finale","id":290594,"name":"Episode 11","overview":"After 10 weeks of washing buses and elephants, numerous vehicular problems, dealings with chickens and fish, getting tattoos, taxi drivers who did not know the way, Yields and U-turns executed by one team… it has boiled down to the three teams, of which one who will be crowned champion.  In this leg's Roadblock, one team member must locate one of seven special keys out of seventy keys buried in the sand using the metal detector to unlock the clue box. In this leg's Detour, teams have to choose between Pull or Plunge. In Pull, teams must kayak to a nearby oyster farm and find the marked shell by pulling the oyster lines, then the teams must bring the marked shell back to the beach to exchange it with their next clue. In Plunge, teams must snorkel and search for a giant clam shell with a pearl inside; the pearl should be exchanged with their next clue.","production_code":"","runtime":60,"season_number":3,"show_id":4256,"still_path":"/tnvxIW9dMEYOWWgNj7VfR7QSUuq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"The Amazing Race Asia 3 is the third installment of the reality television game show The Amazing Race Asia. The show features ten teams of two, with a pre-existing relationship, in a race around Asia to win US$100,000. The season premiered on 11 September 2008 and consists of 11 episodes, two episodes fewer than the first and second seasons. The season finale aired on 20 November 2008.\n\nIn 2009, the series was nominated for an International Emmy Award for Best Non-Scripted Entertainment, losing to the Dutch reality series The Phone.\n\nHong Kong friends Vince Chung & Sam Wu are the winners of the race, they are the first team with a non-Asian in the Asian Version to win the race.","id":12505,"poster_path":"/aGNChZHErgUYVMAzBEltMuIdFpl.jpg","season_number":3,"vote_average":0},"4":{"_id":"52576057760ee36aaa2f27e8","air_date":"2010-09-23","episodes":[{"air_date":"2010-09-23","episode_number":1,"episode_type":"standard","id":290643,"name":"The Race Begins","overview":"Teams begin the 4th season from Thean Hou Buddhist Temple, Kuala Lumpur, Malaysia.  The Roadblock required one team member to ascend the stairs at the Batu Caves complex while carrying an offering and counting the number of steps. Once at the top, they had to exchange their offering and the correct answer of 272 steps to receive their next clue. The Detour was Flags or Rags. In Flags, teams must search five flags around the ship using ship lingo. In Rags, one team member must lower themselves down to clean windows of the ship, while the other must search for and take a photo of their partner to receive their next clue.","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/hkGcoJSc1n4YjiNolXA0xknL6Kq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-30","episode_number":2,"episode_type":"standard","id":290633,"name":"Leg 2","overview":"The Roadblock required one team member to guide a ring through an underwater rope maze whilst using diving equiptment. If the team member did not finish the puzzle in time (which is when the diver instructor told them the time is up), the team would incur a four-hour penalty for not completing the Roadblock (which would be assessed at the pit-stop). In this leg's Detour, teams chose between Rapid Water or Rapid Fire. In both detours, teams had to first drive themselves to Kiulu River White Water Rafting. In Rapid Water, teams had to sail a bamboo raft down river rapids and across the river to retrieve their next clue. In Rapid Fire, both teammates had to shoot Malaysian slingshots at two targets to receive their next clue.","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/AgzRP0R7zlIudf1zimKjYiKCuQ5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-07","episode_number":3,"episode_type":"standard","id":290632,"name":"Leg 3","overview":"In this leg's Detour, teams have to choose between Carry It or Count It. In both detours teams had to first travel to Pettah by public transport. In Carry It, teams had to carry 12 blocks of ice to a market vendor across the fish market. In Count It, teams had to count fish and give the correct amount of 1100 fish to receive their next clue. In this leg's Roadblock, teams traveled to Trendy Connection and one team member to sew a shirt to receive their next clue","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/3uisCuRMCJ19PCS5W37VZ9WaucG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-14","episode_number":4,"episode_type":"standard","id":290634,"name":"Leg 4","overview":"In the first Fast Forward of the race, a team had to proceed to the Galle Bus Station and have their heads shaved at a nearby street barber. Once completed, the team had to bring a Hilton Duck and proceed using a marked taxi to the pit stop. In this leg's Roadblock, one team member has to know the year when Sri Lanka became a sovereign state and changed its name from Ceylon to its present name. The team member had to use this year to unlock a treasure chest located along a beach outside the Galle Lighthouse. (The Answer needed to unlock the chest is 1-9-7-2.) In this leg's Detour, teams had to choose between Coconut Course and Language Course. In Coconut Course, teams had climb up a laddered coconut tree and traverse on a hanging rope between two coconut trees. Once done, they will each receive a coconut which they have to give to the chieftain to get their next clue. In Language Course, teams had to go to school and learn from a student ten Sinhalese words. Once they think they have mastered all ten words, they must recite it to a teacher. If they get all ten correct, the teacher will hand them their next clue.","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/5Pd3L4OmwxRQ8gCC0FDqohLHn3H.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-21","episode_number":5,"episode_type":"standard","id":290635,"name":"Leg 5","overview":"This Leg's Detour was a choice between Jig and Pig. In Jig, teams would do traditional costumes and dance to the satisfaction of two judges. In Pig, teams would compete in a game of catching an oiled pig. They would have to collect two pigs to receive their next clue. At this leg's Roadblock, one team member must kayak to the flagged fish farm and find one of the hundreds of clues as only ten hold the next clue (the one that says \"Correct!\").","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/x8b4XkghlRPzcDDGbC9q058662d.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-10-28","episode_number":6,"episode_type":"standard","id":290636,"name":"Leg 6","overview":"In this leg's Detour, teams had to choose between Plunge or Swing. Both detours are located at Nevis Highwire Platform in Nevis River. In Plunge, each team member must make a bungee jump from a height of 134 metres (440 ft) above the Nevis River to receive their next clue. In Swing, both team members will be seated side by side and swing from a platform 300 metres (980 ft) above the Nevis Canyon to receive their next clue. In this leg's Roadblock, teams travel to Coronet Peak and one team member to find a clue buried in the snow hill using their avalanche rescue transceiver.","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/7rFPnrZx5KrKbY4U5rBjA6bn3F2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-04","episode_number":7,"episode_type":"standard","id":290637,"name":"Leg 7","overview":"In this leg's first Detour, teams had to choose between Pen or Pinot. In Pen, teams must separate three marked sheep from a flock to another pen to receive their next clue. In Pinot, teams must carry and fill a wine barrow with wine to receive their next clue. For the leg's first Roadblock, teams took a taxi to Circus Art School on Sydney Olympic Park, one team member must perform flying trapeze routine to receive their next clue.\n\nIn this leg's second Roadblock, teams drive themselves to WRX Rally Experience Circuit race and one team member must take a Subaru Impreza WRX and make a lap within 1:42 (one minute and forty-two seconds) to get their next clue. If they did not made the lap after the correct time, they would do it again. In this leg's second Detour, teams must first participate in an Aborigine tradition of face-painting before doing one of the Detours, Bush Chucker and Bush Hunter. Both Detours located at a farm in Coombabah. In Bush Chucker, teams must throw a boomerang and have it land within a marked circular area. In Bush Hunter, teams must throw a hunting spear to a hay bale. After doing their Detour, one team member must eat a live witchetty grub, an Aborigine delicacy, to receive their next clue.","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/lAOurgBRQxgYIUeD456PeIGPf9P.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-11","episode_number":8,"episode_type":"standard","id":290638,"name":"Leg 8","overview":"In this leg's Detour, teams chose between Above or Beyond. In Above, teams travelled to Mandalika Market and had to carry a basket of vegetables above their heads without their hands touching the basket, for a distance of 50 meters. In Beyond, teams had to search Kuburan Cina (Chinese Cemetery) for the tomb of Fam Sam Moy. In this leg's Roadblock, teams rode an outrigger to Gili Trawangan, where one team member took scuba diving lessons at the Blue Marlin Dive Resort before diving into Halik Reef to retrieve a briefcase. They then returned to Gili Trawangan Island and rode a cidomo, a local horse carriage to the aforementioned resort. There, both team members had to count the money in the briefcase totaling (Rp 3,804,000) and use this as the combination to retrieve the next clue from their Sony VAIO laptop. If they did not enter the correct combination within three attempts, they had to wait for 10 minutes before they can enter another combination.","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/aASw1iF9XIr51kMAzgEqzbObaZ3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-18","episode_number":9,"episode_type":"standard","id":290639,"name":"Leg 9","overview":"In this leg's Detour, teams must drive to Hwarang Educational Institute and choose between Bow N' Arrow or Rock N' Roll. In Bow N' Arrow, they must choose another team's photograph as target and hit the target three times with a traditional arrow to receive their next clue. In Rock N' Roll, teams must build a ceremonial pagoda to a certain height using rocks to receive their next clue. In this leg's Roadblock, teams must drive to Daereungwon Tomb Complex and one team member must figure out the correct set of three gates to receive their next clue. If the team member incorrectly chooses a gate, s/he will be blocked by warriors. Each team member will be given three attempts to correctly decode the warrior's code or else they have to go back to the starting line.","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/z1iWqDuWqjHIFHc0WVV8fK0wO7R.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-11-25","episode_number":10,"episode_type":"standard","id":290641,"name":"Leg 10","overview":"In this leg's Detour, teams must choose between Stay Up and Add Up. In Stay Up, teams must successfully ride a wave for an accumulated time of two minutes at the Wave House in Sentosa Island. In Add Up, teams must head to the Gmax Reverse Bungee and add up three numbers called out by the host and get the sum correctly to receive their next clue. In this leg's Roadblock, one team member must make a tightrope walk from tower 1 to tower 2 of the Marina Bay Sands Resort to get their clue. They must then make their way back to tower 1 to finish the task.","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/clUtn4CkC6yk5X2xRKjw5paqqQ1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-01","episode_number":11,"episode_type":"standard","id":290640,"name":"Best Moments","overview":"Recap of events leading up to the final leg of The Amazing Race Asia","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/jNuaL2uOTG8G99nujrYvPJ9X105.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-12-08","episode_number":12,"episode_type":"finale","id":290642,"name":"Leg 11","overview":"The final race to the finish line of The Amazing Race Asia","production_code":"","runtime":60,"season_number":4,"show_id":4256,"still_path":"/6Ns1xS6ZxARmv0AkgV5Ax9eGUwB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":12509,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"57ff7ee39251410629002393","air_date":"2016-10-13","episodes":[{"air_date":"2016-10-13","episode_number":1,"episode_type":"standard","id":1231186,"name":"Leg 1","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-20","episode_number":2,"episode_type":"standard","id":1233046,"name":"Leg 2","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-27","episode_number":3,"episode_type":"standard","id":2746081,"name":"Leg 3","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-03","episode_number":4,"episode_type":"standard","id":2746082,"name":"Leg 4","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-10","episode_number":5,"episode_type":"standard","id":2746083,"name":"Leg 5","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-17","episode_number":6,"episode_type":"standard","id":2746084,"name":"Leg 6","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-24","episode_number":7,"episode_type":"standard","id":2746085,"name":"Leg 7","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-01","episode_number":8,"episode_type":"standard","id":2746086,"name":"Leg 8","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-08","episode_number":9,"episode_type":"standard","id":2746087,"name":"Leg 9","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-15","episode_number":10,"episode_type":"finale","id":2746088,"name":"Leg 10","overview":"","production_code":"","runtime":60,"season_number":5,"show_id":4256,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":81054,"poster_path":"/xx26rEsHRsYNPPKcapKQ4xJRJvf.jpg","season_number":5,"vote_average":0}}}