{"adult":false,"backdrop_path":"/iPrDdmnMJmcAOBpyN4t2CKypbVV.jpg","created_by":[],"episode_run_time":[64],"first_air_date":"2012-03-21","genres":[{"id":35,"name":"Comedy"},{"id":18,"name":"Drama"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"http://tv.sbs.co.kr/okprince/","id":43152,"in_production":false,"languages":["ko"],"last_air_date":"2012-05-24","last_episode_to_air":{"id":885752,"name":"Episode 20","overview":"Crown Prince Lee Gak and the trio meet safely in Joseon Dynasty, and once again return to the imperial palace. In order to ascertain the homicide case of Crown Princess, Crown Prince Lee Gak sets up a special investigation headquarter at Uigeumbu, and summons the family of Crown Princess.","vote_average":0,"vote_count":0,"air_date":"2012-05-24","episode_number":20,"episode_type":"finale","production_code":"","runtime":63,"season_number":1,"show_id":43152,"still_path":"/4CtOouIYct2JDZx1xbPPzZaZPrY.jpg"},"name":"Rooftop Prince","next_episode_to_air":null,"networks":[{"id":156,"logo_path":"/uHQFPvRTlpgaIFQVN8eKWEnFOll.png","name":"SBS","origin_country":"KR"}],"number_of_episodes":20,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"옥탑방 왕세자","overview":"Crown Prince Yi Gak finds that he has been transported from the Chosun Dynasty to modern-day Seoul. He meets Hong Se Na, who bears a striking resemblance to his dead wife, and is determined to solve the 300-year-old mystery of her death. With his own resemblance to the CEO’s grandson at the company where Se Na works, Gak assumes the identity of the young man to stay close to her. Can the Crown Prince navigate a modern corporation to find clues to his own time period?","popularity":9.016,"poster_path":"/7hkHlbdEaFCohCe3KQ8lrL9gAUU.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":null,"episode_count":0,"id":52624,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2012-03-21","episode_count":20,"id":52623,"name":"Season 1","overview":"","poster_path":"/bLdV7z1lmMPVp9LaevN9Hh124VJ.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.5,"vote_count":29,"season_data":{"1":{"_id":"52596413760ee3466199495f","air_date":"2012-03-21","episodes":[{"air_date":"2012-03-21","episode_number":1,"episode_type":"standard","id":885734,"name":"Episode 1","overview":"Crown prince Lee Gak is furious after discovering crown princess was drowned. Lee Gak believes that crown princess was murdered, and determines to find out the real criminal. But his other subjects allege that this is not a case of homicide, but rather it’s caused by crown princess lost her footing and fell into water. In order to find out the truth, crown prince Lee Gak gathers Song Man Bo, Do Chi San and Woo Yong Sul. After finding out that there was eye-witness on the day the crown princess died, Lee Gak and his three entourages rush to the home of the man, but are chased by assassins to the cliff. On the other hand, Park Ha meets crown prince and his three entourages at the rooftop room.","production_code":"","runtime":62,"season_number":1,"show_id":43152,"still_path":"/yJgxAkRWIRThUC7n4MTlIk6BweR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-22","episode_number":2,"episode_type":"standard","id":885733,"name":"Episode 2","overview":"Park Ha leaves after sending Lee Gak and the trio to the door of Changdeokgung Palace. Lee Gak and the trio try to enter Changdeokgung Palace, but are chased away by Seoul police. Crown prince who is hungry goes into a convenience store, asking the staff for noodle to allay the hunger, but what’s grossly exaggerated is that the staff calls 112 to report to police. In the end, Lee Gak and the trio are trapped in the police station. When asked by police the contact of the guardian, Lee Gak tells the police the truck number of Park Ha. As the result, Park Ha is called to police station.","production_code":"","runtime":65,"season_number":1,"show_id":43152,"still_path":"/uBrXjX4dPaVNkKm1InCULAQCcmf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-28","episode_number":3,"episode_type":"standard","id":885735,"name":"Episode 3","overview":"President Yeo who found the crown prince mistakenly thought that she has finally found that Tae Yong who gone missing in the United States, and is very happy. But Lee Gak refuses the president. In order to find Park Ha, Tae Moo begins to secretly inquire about whereabout of her. Crown prince and Park Ha go to Chungcheongnam-do to pick strawberries in order to purchase strawberries at half price. Looking at crown prince who does not budge and does not pick strawberries, the furious Park Ha shouts loudly that once they return to Seoul, and she wants him to gets out immediately from the rooftop apartment.","production_code":"","runtime":64,"season_number":1,"show_id":43152,"still_path":"/exQ5qahWJr4dn0uLnCNiMRxFJ7B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-29","episode_number":4,"episode_type":"standard","id":885737,"name":"Episode 4","overview":"Park Ha lost the check of 40 million South Korean won withdrew from the bank, causing the contract for the lease to lapse, and she is also facing the crisis of having to clear out from the store. Se Na tells Park Ha that she can helps to raise the money, but wants her to return to United States after settling the matter. Meanwhile, Song Man Bo, Woo Yong Sul and Do Chi San who learned that Park In is under crisis, and with the help of Becky, they begin to take up part time jobs.","production_code":"","runtime":62,"season_number":1,"show_id":43152,"still_path":"/53VwRnA9rmvCmuRolgerdrTfWbc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-04","episode_number":5,"episode_type":"standard","id":885736,"name":"Episode 5","overview":"Crown prince returns to the home of president Yeo, and requests president Yeo to buy over the rooftop apartment of Park where he used to stay. But president Yeo wants Lee Gak to cut short his hair as the condition to buy the rooftop apartment. Although his three confidants have been repeatedly trying to dissuade him, the crown prince still determine to cut the hair. However, Park Ha decides to return to United States, and is clearing up the rooftop apartment. On the other hand, Yong Tae Moo convinces that the newly emerged Yong Tae Yong is not the real Yong Tae Yong, and he summons family members to gather.","production_code":"","runtime":65,"season_number":1,"show_id":43152,"still_path":"/iuum0R1agnLrPzocyB178yiAUxb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-06","episode_number":6,"episode_type":"standard","id":885738,"name":"Episode 6","overview":"Park Ha is giving the training lesson on the necessary basic social life education to Lee Gak and the trio who are about to start working at Home & Shopping. In order to understand the ecosystem of the company, Lee Gak is arranged to station aside Se Na, and spend some time with her. On the one hand, Park Ha saw the mother of Se Na been hit by Tae Moo’s car, and Se Na who escapes fearing that her lie been exposed, and Park Ha gets furious when she recalled the memory that Se Na pretended to have no knowledge of her been ferried away by truck.","production_code":"","runtime":64,"season_number":1,"show_id":43152,"still_path":"/kspm4QAxTaLnD7nC85qAnvk0tfl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-12","episode_number":7,"episode_type":"standard","id":885739,"name":"Episode 7","overview":"Tae Mu tells Man Ok that she could tell him anytime if she needs anything as a response for causing hurt to her due to his negligence. As the result, Man Ok asks to allow Park Ha to work in Home & Shopping. Park Ha and crown prince Lee Gak located the photography studio which her family took their family group photo (which is the one her mother’s face was torn off) 25 years ago. On the other hand, President Jang asks Tae Mu to look for her long lost daughter.","production_code":"","runtime":63,"season_number":1,"show_id":43152,"still_path":"/5tZ3YbKG3zNXqnv1xpxwfzEOdHu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-18","episode_number":8,"episode_type":"standard","id":885740,"name":"Episode 8","overview":"Visiting the family gathering of President Yeo, Park Ha discovers that Crown Prince Lee Gak is not Yong Tae Yong. The father of Tae Mu, Yong Dong Man, forces Tae Mu to go for a blind date. President Yeo tells Se Na that she offers full support if she is together with Tae Yong (Lee Gak). On the other hand, Park Ha also prepares to go on blind date, and goes to shopping with Crown Prince and the trio.","production_code":"","runtime":63,"season_number":1,"show_id":43152,"still_path":"/kcmueuPF9JbcysMkkFf5L0FZKwu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-19","episode_number":9,"episode_type":"standard","id":885741,"name":"Episode 9","overview":"Crown Prince Lee Gak passed the butterfly handkerchief Park Ha for cleaning, but Park Ha mistakenly lost the handkerchief. The furious Lee Gak shouts at Park Ha. In order to recover the butterfly handkerchief, Park Ha even rushes to a clothing recycling warehouse late at night to search for it. On the other hand, the confidant trio is making preparation for the birthday of Park Ha.","production_code":"","runtime":62,"season_number":1,"show_id":43152,"still_path":"/3vIB8yTkxF3tEFuyRjHRQKXKVF9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-19","episode_number":10,"episode_type":"standard","id":885742,"name":"Episode 10","overview":"Se Na lied that Park Ha couldn’t keep an appointment, and she confesses to Lee Gak that she loves him. Park Ha saw the scene that Lee Gak and Se Na hugging, and leaves sadly. Park Ha hits a punch on Lee Gak through a basketball game. Lee Gak gets angry and doesn’t take out the birthday gift prepared to give to Park Ha. Man Bo and others buy the gift for the families after getting the wages, and tells Park Ha about their families in Joseon Dynasty. Park Ha learned from Man Bo that the purpose of their trip is to see the Se Na who is the reincarnation of the Crown Princess, Park Ha is shocked. Park Ha accidentally sent the SMS text message that contains her inner heart to Lee Gak. The regretful Park Ha tries in every possible way to disrupt Lee Gak from seeing the message.","production_code":"","runtime":61,"season_number":1,"show_id":43152,"still_path":"/1HtxR9Rg0WSV7GWRsRH4oMgyrue.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-25","episode_number":11,"episode_type":"standard","id":885743,"name":"Episode 11","overview":"Crown Prince Lee Gak receives the mobile phone of Yong Tae Yong once again. He brings the phone to service center to inquire for the PIN code. Chi San suddenly has stomachache and lost his consciousness, Man Bo and Yong Sul are panic-stricken till don’t know what to do. With the help of Se Na who came to help on the BBQ party, Chi San is admitted to hospital. After the incidents, the trio starts to miss the homeland.","production_code":"","runtime":64,"season_number":1,"show_id":43152,"still_path":"/jb4SWHyUEs2YUBrhya8ulDf7ED5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-26","episode_number":12,"episode_type":"standard","id":885744,"name":"Episode 12","overview":"President Yeo is upset with Lee Gak who ran out in the middle of signing purchase agreement after receiving the call from Park Ha. She finally comes to the rooftop apartment, and orders Park Ha to leave. Although the purchase contract failed to be signed, Tae Mu asks President Yeo to give Lee Gak a second chance. On the other hand, Se Na and Lee Gak go to select gown for the engagement ceremony, and she admits to Lee Gak she’s very much disturbed by Park Ha.","production_code":"","runtime":63,"season_number":1,"show_id":43152,"still_path":"/mTnC80lDs3D3qftDwg7YEEn160w.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-02","episode_number":13,"episode_type":"standard","id":885745,"name":"Episode 13","overview":"The henchmen trio experiences the phenomenon of passing through the mug. After knowing the heart of Lee Gak, Park Ha hopes that he doesn’t return to Joseon Dynasty. Meanwhile, the mask planned Lee Gak and the trio achieves very good sales after broadcasted on TV shopping channel, hitting the jackpot.","production_code":"","runtime":64,"season_number":1,"show_id":43152,"still_path":"/qfxFKzhEdnndeR0zCaboVWqtW5p.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-03","episode_number":14,"episode_type":"standard","id":885746,"name":"Episode 14","overview":"After Se Na was caught lying, she goes to appeal tearfully to President Yeo about her emotional pain. After Crown Prince is suspicious of Se Na, he tails after her from behind. Man Bo, Yong Sul and Chi San who found out that the marriage of Se Na and Crown Prince is in crisis, are feeling depressed because of unable to go back to Joseon Dynasty. On the other hand, Tae Mu continues to grab the heart of Se Na.","production_code":"","runtime":63,"season_number":1,"show_id":43152,"still_path":"/6WCE5UMcYjXVLRFr8TLH0E6EsxY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-09","episode_number":15,"episode_type":"standard","id":885747,"name":"Episode 15","overview":"Crown Prince Lee Gak and Park Ha are dating by watching fireworks at riverside levee of Han River, but they’re discovered by Young Sul, Chi San and Man Bo. Se Na and Tae Mu begins to act to convince President Jang to believe that Se Na is her real daughter. Meanwhile, Lee Gak begins to unravel the incredible mystery.","production_code":"","runtime":63,"season_number":1,"show_id":43152,"still_path":"/1JHdonEqftL3u8MNd1ijIlfhOnY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-10","episode_number":16,"episode_type":"standard","id":885748,"name":"Episode 16","overview":"Crown prince Lee Gak saw the sight of his reincarnation Yong Tae Yong fell into state of coma, and fells hurt in the heart. He decides to redress the injustice he suffered. Park Ha thought that the quartet has suddenly disappeared to return to Joseon Dynasty, and is shedding tears of sadness. On the other hand, President Jang meets with Man Ok, and receives the permission to bring the daughter to Hong Kong.","production_code":"","runtime":63,"season_number":1,"show_id":43152,"still_path":"/bFeJjImi6z05WcsGwG5sJ8oOX8Z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-16","episode_number":17,"episode_type":"standard","id":885751,"name":"Episode 17","overview":"In order to rescue Park Ha, eventually crown prince Lee Gak rushes to Tae Mu, and surrenders the mobile phone of Tae Yong to Tae Mu. Tae Mu destroys the phone once again. President Jang calls on Se Na and tells Se Na that she is looking for her daughter. On the other hand, Lee Gak is pondering over the fact that crown princess and Bu Yong are biological sisters in Joseon Dynasty, and speculates that Park Ha and Se Na are possibly biological sisters.","production_code":"","runtime":63,"season_number":1,"show_id":43152,"still_path":"/lJIbriNd1MjZvpi1Lfo6hIIRmDi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-17","episode_number":18,"episode_type":"standard","id":885749,"name":"Episode 18","overview":"Crown Prince Lee Gak saw his own body slowly disappeared and then returned back to normal. Lee Gak realizes that the reason for him to time travel to Seoul is to meet Park Ha. On the other hand, Lee Gak and the trio convince that one of the criminal causing the death of grandmother is associated with Yong Tae Mu, and are searching for evidence in full force.","production_code":"","runtime":61,"season_number":1,"show_id":43152,"still_path":"/hkQ3E0PbhH0ZyDeRlBLxJavpH71.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-23","episode_number":19,"episode_type":"standard","id":885750,"name":"Episode 19","overview":"Crown Prince sends the injured Park Ha to the hospital, but because her liver suffered serious impact when she was hit, Park Ha falls into the danger of requiring liver transplantation immediately. Lee Gak tries to persuade Se Na, as apart from her, no one else could save Park Ha. On the other hand, Tae Moo tells Se Na to leave and go abroad to live a good life for them.","production_code":"","runtime":64,"season_number":1,"show_id":43152,"still_path":"/gRLJ8a19wtYlMx1Gm5jg3CB6LF8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-24","episode_number":20,"episode_type":"finale","id":885752,"name":"Episode 20","overview":"Crown Prince Lee Gak and the trio meet safely in Joseon Dynasty, and once again return to the imperial palace. In order to ascertain the homicide case of Crown Princess, Crown Prince Lee Gak sets up a special investigation headquarter at Uigeumbu, and summons the family of Crown Princess.","production_code":"","runtime":63,"season_number":1,"show_id":43152,"still_path":"/4CtOouIYct2JDZx1xbPPzZaZPrY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":52623,"poster_path":"/bLdV7z1lmMPVp9LaevN9Hh124VJ.jpg","season_number":1,"vote_average":0}}}