{
    "adult": false,
    "backdrop_path": null,
    "created_by": [
        {
            "id": 52763,
            "credit_id": "52596488760ee3466199d93e",
            "name": "Aamir Khan",
            "original_name": "Aamir Khan",
            "gender": 2,
            "profile_path": "/bI3yxh4FzKL2hHYS4nbzcDMWtZs.jpg"
        }
    ],
    "episode_run_time": [
        65
    ],
    "first_air_date": "2012-05-06",
    "genres": [],
    "homepage": "http://satyamevjayate.in",
    "id": 43261,
    "in_production": false,
    "languages": [
        "en",
        "hi"
    ],
    "last_air_date": "2014-11-09",
    "last_episode_to_air": {
        "id": 2049979,
        "name": "When Masculinity Harms Men",
        "overview": "",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2014-11-09",
        "episode_number": 6,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 92,
        "season_number": 3,
        "show_id": 43261,
        "still_path": null
    },
    "name": "Satyamev Jayate",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 159,
            "logo_path": "/9cEITzi1VyVkre3Fom57vJBOEW3.png",
            "name": "StarPlus",
            "origin_country": "IN"
        }
    ],
    "number_of_episodes": 27,
    "number_of_seasons": 3,
    "origin_country": [
        "IN"
    ],
    "original_language": "hi",
    "original_name": "Satyamev Jayate",
    "overview": "Satyamev Jayate is an Indian television talk show that aired on various channels within Star Network along with Doordarshan's DD National. The first season of the show premiered on 6 May 2012 and marked the television debut of popular Bollywood actor and filmmaker Aamir Khan.\n\nThe show highlights sensitive social issues prevalent in India such as female foeticides, child sexual abuse, dowry, medical malpractice, honor killings, insensitivity towards the physically disabled, domestic violence, overuse of pesticides leading to pesticide poisoning, alcoholism, untouchability, plight of senior citizens and water crisis.\n\nSatyamev Jayate received an overwhelming positive response and feedback from both the critics as well as the public. The show was widely appreciated by several film and television personalities, politicians and social activists for its research, format, presentation and content.",
    "popularity": 19.87,
    "poster_path": "/eJGst5nJO9tGzWZeq8D1xAaI5Bl.jpg",
    "production_companies": [
        {
            "id": 2140,
            "logo_path": "/yJIGEhIk3yAWAIiZ4p3xEV1dzwR.png",
            "name": "Aamir Khan Productions",
            "origin_country": "IN"
        }
    ],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2012-08-15",
            "episode_count": 1,
            "id": 52744,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2012-05-06",
            "episode_count": 14,
            "id": 52743,
            "name": "Season 1",
            "overview": "The first season of Satyamev Jayate was premiered from 6 May 2012 on various channels within Star Network along with Doordarshan's DD National. It marked the television debut of Indian Bollywood actor and filmmaker Aamir Khan. While Hindi is the primary language of the show, it is also dubbed and simulcast in several other Indian languages such as Bengali, Malayalam, Marathi, Tamil and Telugu.",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2014-03-05",
            "episode_count": 7,
            "id": 126412,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2014-10-05",
            "episode_count": 6,
            "id": 140923,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        },
        {
            "english_name": "Hindi",
            "iso_639_1": "hi",
            "name": "हिन्दी"
        }
    ],
    "status": "Ended",
    "tagline": "",
    "type": "Talk Show",
    "vote_average": 7,
    "vote_count": 16,
    "season_data": {
        "1": {
            "_id": "52596487760ee3466199d7af",
            "air_date": "2012-05-06",
            "episodes": [
                {
                    "air_date": "2012-05-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 887173,
                    "name": "Daughters Are Precious",
                    "overview": "In this episode Aamir talks about the killing of unborn girls, or female foeticide, an alarming and frightening reality. It involves the collusion of families, doctors and a social structure that encourages the desire for a boy child - at any cost. The result has been the death of over 3 crore unborn girls since independence and a generation of young men, many amongst whom will find it very tough to get a life partner.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self",
                            "credit_id": "5d0e09dfc3a36816822295dd",
                            "order": 500,
                            "adult": false,
                            "gender": 0,
                            "id": 2344819,
                            "known_for_department": "Acting",
                            "name": "Devendra Singh Gaur",
                            "original_name": "Devendra Singh Gaur",
                            "popularity": 0.001,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2012-05-13",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 887174,
                    "name": "Break The Silence",
                    "overview": "The sexual abuse of children is a horrible reality, and many are unaware of its extent. Research has shown that as many as 53 per cent, or one in every two children, are victims of child sexual abuse. Contrary to belief, the home is not the safest place for a child, as many abusers are trusted by the family. In addition to educating children and encouraging them to be brave enough to say No to abuse, parents themselves need to be sensitive to their children’s signals. Moreover, a robust and specific law against child sexual abuse must be put in place to protect the child and vigorously punish the abuser.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self",
                            "credit_id": "5d0e09f30e0a263dddce452e",
                            "order": 501,
                            "adult": false,
                            "gender": 1,
                            "id": 109549,
                            "known_for_department": "Acting",
                            "name": "Sridevi",
                            "original_name": "Sridevi",
                            "popularity": 8.007,
                            "profile_path": "/6wxquADm0CMYMon04uEI48ZiBBf.jpg"
                        }
                    ]
                },
                {
                    "air_date": "2012-05-20",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 887175,
                    "name": "Marriage or Marketplace",
                    "overview": "Most people dream of a lavish wedding but the reality in India is that expensive wedding celebrations and heavy dowry demands end up making brides’ lives miserable and ruining their families. The very concept of marriage has been turned into a transaction, with no value placed on the people or the relationship. But this can change, and it is up to girls and their families to say NO to dowry, to insist on simple ceremonies and restore the sanctity of the wedding bond.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-05-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 887176,
                    "name": "Every Life is Precious",
                    "overview": "People trust medical practitioners, believing that they are equipped with the knowledge and skills to safeguard their health. But when this knowledge is misused to exploit this trust, medical care becomes a nightmare. The profession is riddled with unscrupulous doctors and hospitals out to make big bucks at the cost of patients, but there are still medical practitioners who stand up for the Hippocratic Oath, and those who want to clean up the profession.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-06-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 887177,
                    "name": "Intolerance To Love",
                    "overview": "The simple act of falling in love opens up a world of emotions and reactions which sometimes culminate in crime – the death of the couple. Even if they escape death, lovers who go against religious and community barriers still have to face harassment and censure from society and, due to this pressure, rejection from their families. But the law is clear, that consenting adults are free to marry. And there is an organization which protects couples, helps them fight harassment and gives them shelter so they can marry freely.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-06-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 887178,
                    "name": "We Can Fly",
                    "overview": "People with disabilities have the same zeal and appreciation for life as the rest of us do. They can, and want to, participate in all aspects of life along with the mainstream. But people with disabilities get shunned, doubted, mocked and insulted. Access to public places and buildings is restricted and often impossible. Doors are closed for schooling and employment. India does not appear to be mature enough and understanding enough to recognise people with disabilities for what they are – people.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-06-17",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 887179,
                    "name": "Danger At Home",
                    "overview": "For countless women, entering married life often means the beginning of a stressful, violent existence. Beating one’s wife seems to be ingrained in many men’s mindsets as the appropriate behaviour for a strong male, but the consequences are misery for the wife and children, and often a broken, unhappy home. The concept of domestic violence is based on the notion of patriarchy, which needs to be converted into equality.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-06-24",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 887180,
                    "name": "Poison On Our Plate?",
                    "overview": "Every morsel of food and sip of water we take is important for our health and well-being, right from the time we are newborn infants. Yet, for decades our food and water have been contaminated by powerful, harmful pesticides which have been promoted as necessary for better agricultural output. But the reality is that we don’t need pesticides for better yield, and the use of these pesticides is not only deadly for health but results in expensive farming methods. The solution is to adopt organic farming, which is possible and profitable, as the state of Sikkim has shown.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-01",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 887181,
                    "name": "Think Before You Drink",
                    "overview": "Alcohol consumption is associated with having fun and enjoying life. But excessive, irresponsible drinking takes away that very life itself. Many alcohol addicts have climbed back to normal life, proving that it is possible to live happily without alcohol. Help for alcoholics is available, free, at Alcoholics Anonymous. Even the occasional drinker must never drink with the aim of becoming drunk. And under no circumstances must you drink and drive – that is the road to disaster, literally.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-08",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 887182,
                    "name": "Untouchability",
                    "overview": "For a country which has been independent for 65 years, it is a matter of shame that we have not yet shaken off the tyranny of caste-based discrimination. Countless people have to live in degrading conditions, children are unable to go to school, employment avenues are closed, and even education does not open bigoted minds. No measure of progress can be true unless the question of people’s equality is factored into it. And we can only be considered a progressive nation when we refuse to accept caste differences.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-15",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 887183,
                    "name": "Old Age",
                    "overview": "Our parents are the ones who have brought us up and made us what we are. At least out of consideration for that much, we should be good and kind towards them. But countless people all over India don’t think so, going by the numbers of abandoned old people taken in at old age homes. Then there are some older people who take matters into their own hands – be it romance or adventure sport.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-22",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 887184,
                    "name": "Every Drop Counts",
                    "overview": "After air, the next most vital thing for our survival is water. While at the moment we have enough water for our needs, a time is likely to come when our water supply runs out and we have to buy water at a price similar to fuel. This is a situation which already exists in some parts of the country, and ‘water wars’ are a common occurrence. The solution, which some people have implemented, is to save and store rainwater.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-07-29",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 887185,
                    "name": "We The People",
                    "overview": "When India’s leaders envisaged building a new nation after Independence, the Constitution was the foundation stone of this endeavour. We had resolved to establish a sovereign, secular, democratic republic with justice, liberty, equality and fraternity for all. Enough Indians have been putting these principles into action, that the country can find hope to awaken into a ‘heaven of freedom’.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2012-08-15",
                    "episode_number": 14,
                    "episode_type": "finale",
                    "id": 887186,
                    "name": "Towards Change",
                    "overview": "The journey which began some four months ago has been one that resulted in crores of people joining hands and coming together via the Satyamev Jayate platform. Via social media, including Facebook and Twitter, Satyamev Jayate has made over a billion impressions.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "The first season of Satyamev Jayate was premiered from 6 May 2012 on various channels within Star Network along with Doordarshan's DD National. It marked the television debut of Indian Bollywood actor and filmmaker Aamir Khan. While Hindi is the primary language of the show, it is also dubbed and simulcast in several other Indian languages such as Bengali, Malayalam, Marathi, Tamil and Telugu.",
            "id": 52743,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5d0e0a6bc3a3682f68211f37",
            "air_date": "2014-03-05",
            "episodes": [
                {
                    "air_date": "2014-03-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1832070,
                    "name": "Fighting Rapes",
                    "overview": "",
                    "production_code": "",
                    "runtime": 91,
                    "season_number": 2,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1832072,
                    "name": "Episode 2",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1832073,
                    "name": "Episode 3",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-03-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1832074,
                    "name": "Episode 4",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1832075,
                    "name": "Episode 5",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-09",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1832080,
                    "name": "Episode 6",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self",
                            "credit_id": "5d0e0ad60e0a2627fecbf02f",
                            "order": 502,
                            "adult": false,
                            "gender": 2,
                            "id": 35780,
                            "known_for_department": "Acting",
                            "name": "Amitabh Bachchan",
                            "original_name": "Amitabh Bachchan",
                            "popularity": 25.962,
                            "profile_path": "/lTvmUB50xu0MTaQvq51bdmyffUA.jpg"
                        },
                        {
                            "character": "Self",
                            "credit_id": "5d0e0adb0e0a263dddce4779",
                            "order": 503,
                            "adult": false,
                            "gender": 1,
                            "id": 1034471,
                            "known_for_department": "Acting",
                            "name": "Parineeti Chopra",
                            "original_name": "Parineeti Chopra",
                            "popularity": 9.089,
                            "profile_path": "/w2WTsdqs9t0OzQ9sxkntXKf5NAN.jpg"
                        },
                        {
                            "character": "Self",
                            "credit_id": "5d0e0ae20e0a26378dca416c",
                            "order": 504,
                            "adult": false,
                            "gender": 1,
                            "id": 53975,
                            "known_for_department": "Acting",
                            "name": "Deepika Padukone",
                            "original_name": "Deepika Padukone",
                            "popularity": 32.612,
                            "profile_path": "/sXgEh0z6NzyvmEeBeLPK1ON7NBY.jpg"
                        },
                        {
                            "character": "Self",
                            "credit_id": "5d0e0ae8c3a36850551fba39",
                            "order": 505,
                            "adult": false,
                            "gender": 1,
                            "id": 85470,
                            "known_for_department": "Acting",
                            "name": "Kangana Ranaut",
                            "original_name": "Kangana Ranaut",
                            "popularity": 10.568,
                            "profile_path": "/lHT1pojfQdDpAxPZYx0js2eo5KI.jpg"
                        }
                    ]
                },
                {
                    "air_date": "2014-04-16",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 1832090,
                    "name": "Episode 7",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 126412,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5e1ec604d9f4a600139ada92",
            "air_date": "2014-10-05",
            "episodes": [
                {
                    "air_date": "2014-10-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2049974,
                    "name": "A Ball Can Change the World",
                    "overview": "It's not about how to win medals, but something a million times more ambitious - unleashing the power of sports to change our country.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2049975,
                    "name": "Road Accidents or Murders?",
                    "overview": "India is the road accidents capital of the world where every year an average of 1,40,000 people lose their lives and many more are fatally injured. It is wrong to call them accidents as most of them are murders waiting to happen and are entirely preventable.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2049976,
                    "name": "Accepting Alternative Sexualities",
                    "overview": "It is more than six decades since our country gained independence and yet there is one important minority that still continues to live in constant fear and daily humiliation. It's a minority whose very existence is treated as a crime. To this minority belong all those with alternative sexualities-lesbians, gays, bisexuals and transgenders (LGBT).",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2049977,
                    "name": "TB - The Ticking Time Bomb",
                    "overview": "India is the TB capital of the world. Every year, a staggering 18 lakh people contract the disease, of which 8 lakh are infectious and about 3.7 lakh people die annually. It is a shame that this disease has not been fought on a war footing. Previously known as a poor man's disease, TB affects all classes of society today with its deadlier form-multidrug-resistant TB (MDR TB). This bacteria has become resistant to the first line drugs-especially Rifampicin and Isoniazid-which can otherwise cure the disease in six months. MDR TB is a monster; it takes more than two ...",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2049978,
                    "name": "Nurturing Mental Health",
                    "overview": "In the last few years, around 1,35,000 Indians have committed suicide every year. Mental illnesses, especially depression, is one of the leading causes. The segment most affected is the young-those who belong to the 15 to 30 years age group. Modern society's attempt to compress a 100 years of living within 10 years is affecting mental harmony. Hence, it is important to be clued to the signs of depression, when there is no joy in living and even the smallest of tasks seem very difficult.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-09",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 2049979,
                    "name": "When Masculinity Harms Men",
                    "overview": "",
                    "production_code": "",
                    "runtime": 92,
                    "season_number": 3,
                    "show_id": 43261,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Self",
                            "credit_id": "5e1ec68166751d0015bf1c50",
                            "order": 506,
                            "adult": false,
                            "gender": 0,
                            "id": 1363692,
                            "known_for_department": "Acting",
                            "name": "Laxmi Agarwal",
                            "original_name": "Laxmi Agarwal",
                            "popularity": 0.75,
                            "profile_path": null
                        }
                    ]
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 140923,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    }
}