{"adult":false,"backdrop_path":"/8bSextpHZh51LWtRXWJWpsZzVU7.jpg","created_by":[{"id":1255962,"credit_id":"5259650e760ee346619a4b21","name":"Dimitar Mitovski","gender":2,"profile_path":null}],"episode_run_time":[54,60,55],"first_air_date":"2011-04-17","genres":[{"id":80,"name":"Crime"},{"id":18,"name":"Drama"},{"id":10759,"name":"Action & Adventure"}],"homepage":"http://www.podprikritie.bg/","id":43424,"in_production":false,"languages":["bg"],"last_air_date":"2016-06-04","last_episode_to_air":{"id":1175547,"name":"Episode 12","overview":"","vote_average":7,"vote_count":1,"air_date":"2016-06-04","episode_number":12,"episode_type":"finale","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/9ejRRgElWHTlIkBy3F160N44ZOd.jpg"},"name":"Undercover","next_episode_to_air":null,"networks":[{"id":991,"logo_path":"/a9q2OojPEATsh4PpBO9yOw5sUD6.png","name":"BNT 1","origin_country":"BG"}],"number_of_episodes":60,"number_of_seasons":5,"origin_country":["BG"],"original_language":"bg","original_name":"Под прикритие","overview":"Just an ordinary boy from the Sofia suburbs becomes the first bulgarian undercover cop. Forced by his father when he was young to lie and cheat, Martin becomes the perfect liar. That skill, and also the hatred of the 'underworld' makes him the perfect match for a dangerous mission - to infiltrate the crime organisation of a rich and powerful businessman. While infiltrating and living in fear of being uncovered, Martin falls in love with the most inappropriate woman - Djaro's girlfriend, Suni. Just when he gains the trust of the mobsters, it appears that the real enemy is in the police. Martin is alone against all, facing difficult decisions.","popularity":23.528,"poster_path":"/9JV2Xtalb11DfkHxvF7z2oO8gvW.jpg","production_companies":[{"id":19381,"logo_path":null,"name":"SIA Advertising","origin_country":"BG"}],"production_countries":[{"iso_3166_1":"BG","name":"Bulgaria"}],"seasons":[{"air_date":"2011-04-17","episode_count":12,"id":52838,"name":"Season 1","overview":"An ordinary boy from a suburb of Sofia became the first undercover police officer in Bulgaria. Forced as a child by his father to steal and cheat, Martin becomes the perfect liar. This skill of his, as well as his hatred for the underworld, make him the most suitable person for a dangerous mission - to be implemented in the criminal organization of a large and influential businessman. While delving into the group's secrets and living in constant fear of being discovered, Martin falls in love with the most inappropriate of women - Djaro's friend Sunny. Just as he gains the trust of the mobsters, it turns out that the real enemies are in the police. Martin is left alone against everyone, facing difficult decisions.","poster_path":"/yXhHoDnltCqWuVlqStXwahixcEZ.jpg","season_number":1,"vote_average":0},{"air_date":"2011-11-20","episode_count":12,"id":52840,"name":"Season 2","overview":"After the beating of Emil Popov, Petar Tudzharov - Djaro found out that the commissar had survived. In order to save his life and business, the mob boss must look for new solutions. Undercover agent Martin is faced with a choice of whose side to go on. A new strong player will make him an unexpected offer. A scandalous explosion is followed by a brutal political assassination that will mess up everyone's plans.","poster_path":"/gR6JGVYF36T6LiyN74STGsxQ2V8.jpg","season_number":2,"vote_average":0},{"air_date":"2012-11-25","episode_count":12,"id":52839,"name":"Season 3","overview":"After the arrest of Djaro and a serious shake-up of his position, Martin remains in the underworld as an undercover cop. This time his enemies are more and stronger. His new enemy is Ivo Andonov. After the death of his father and Sunny, he has nothing left to lose but to continue fighting crime to the end and at any cost. In order to prevent the acquittal of Petar Tudzharov, he must remain loyal as his right-hand man, but in the meantime enters into an alliance with the Kukata to fight against Ivo. The journalist Elitsa Vladeva also joins the actions against the underworld. Martin now knows that only by legal means is the fight doomed.","poster_path":"/vzumc9423Ug1L9cPxmeCf2Xh7Il.jpg","season_number":3,"vote_average":0},{"air_date":"2014-01-19","episode_count":12,"id":59823,"name":"Season 4","overview":"Six months after the recent events, Martin Hristov is officially a police officer in the GDBOP, in the department of Commissioner Emil Popov. Ivo rules the street, disguised behind a legal business. Next to him is Nia Tujarova, who has returned from New Zealand in an attempt to reconcile with her father Djaro. Djaro is in Turkey to make contact with the Turkish mafia and is involved in the restoration of an international drug channel through Bulgaria. Tragedy overtakes Kukata in his Spanish exile – he returns to Bulgaria with a plan for revenge. Martin took advantage of his desire for revenge. The two make a deal that affects the interests of Ivo, Jaro and the Turks in life and death.","poster_path":"/pg7qBQQEcMHk7sFGIwiCNQM1G6f.jpg","season_number":4,"vote_average":0},{"air_date":"2016-03-20","episode_count":12,"id":70999,"name":"Season 5","overview":"Djaro is killed by Popov and someone will have to take his place. It is most natural that it should be Ivo. Undercover cop Martin is exposed and takes over Popov's old team. Now Errol - the new undercover cop - will try to take his place.","poster_path":"/4jXhoFg9n153pNTZuhnIGq5u3HZ.jpg","season_number":5,"vote_average":7.5}],"spoken_languages":[{"english_name":"Bulgarian","iso_639_1":"bg","name":"български език"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.6,"vote_count":30,"season_data":{"1":{"_id":"525964fa760ee346619a46cb","air_date":"2011-04-17","episodes":[{"air_date":"2011-04-17","episode_number":1,"episode_type":"standard","id":888059,"name":"Episode 1","overview":"Син на престъпник, малкият Мартин се озовава в сиропиталище. Полицейският инспектор Попов дава шанс на момчето от Люлин. Мартин завършва висшето полицейско училище във Франция и завърнал се в България, става ченге под прикритие.","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/mxHal9KCLoN9bF90vXE8vpSTu2t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-04-24","episode_number":2,"episode_type":"standard","id":957765,"name":"Episode 2","overview":"Полицаят под прикритие Мартин Христов вече е част от групировката на Петър Туджаров - Джаро. Мафиотският бос обаче е мнителен, недоверчив и рядко общува с подчинените си. Задачата на Мартин е с времето да спечели доверието му. Един ден кола на Джаро, превозваща голяма пратка наркотици е отвлечена от автокрадци. Това е реален шанс за внедреното ченге да се намеси и да помогне на мафиота. За да върне колата обратно Мартин трябва да влезе в кoжата си на хладнокръвен лъжец и измамник. Ако се справи го очаква лична среща с Туджаров и ... Съни - любовницата на боса, с която по случайност вече е имал нещо общо...","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/3ZHLzuCUYvdDQBeLegG27LC8opd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-01","episode_number":3,"episode_type":"standard","id":957764,"name":"Episode 3","overview":"След кражбата на колата от полицията в Драгоман, на Мартин е направен фоторобот от ГДБОП. Последствията за него ще бъдат фатални, ако издирването му застраши сигурността на Джаро. Внедреният агент няма време за губене - той спешно трябва да се добере до компрометиращи данни за мафиотския бос. Мартин трябва да предаде на Попов флашка с информация за Джаро. Съдържанието й е толкова опасно, че е привлечен и отрядът на баретите. Какво ще направи Попов, за да спаси Мартин? Как агентът под прикритие се е добрал до компрометиращата информация и каква е тя? Джаро ли е най-голямата заплаха за Мартин?...","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-08","episode_number":4,"episode_type":"standard","id":957766,"name":"Episode 4","overview":"Не само в полицията, но и в групировката на Джаро вече витае подозрението, че има предател. Лошо стечение на обстоятелствата поставя лоялността на Здравко - Косъма под въпрос. Хората на Джаро  мислят, че Здравко е \"къртицата\", която ги издава на полицията. Мартин не може да позволи нито Здравко да бъде убит заради него, нито пък да бъде застрашена мисията – какво ще направи агентът под прикритие и дали това няма да доведе до по-голяма опасност за самия него...","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/wos3cpwKKy3s8vn0MSdy8dV3fP3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-15","episode_number":5,"episode_type":"standard","id":957767,"name":"Episode 5","overview":"Марто в капан! Адвокатът на мафията е... жена, добре позната на Джаро от години. Адвокат Бояна Василева е умна, хладнокръвна, амбициозна, добър манипулатор и много предпазлива, обвита в загадъчност и мистерия. Мрази публичността. Компенсира външния вид с интелект. Няма изгубено дело. Умее да предизвиква безусловно доверие, включително и това на Джаро. Василева е единствената, пред която той си позволява да се разкрива, повече от допустимото. Бояна е влюбена в Туджаров от години, но той не вижда в нея друго, освен верен съюзник в игрите си. Василева презира съдебната система, защото познава добре корупцията, която властва там. Няма скрупули да подкупва, да се пазари, да преговаря. Не гледа сериозно на Съни - държи се с нея пренебрежително. Счита я за поредното \"захарно петле\" в устата на Туджаров. Ревнува от нейната младост и жизненост. Василева може да бъде жестоко язвителна, когато я засегнат. Заобикалящата среда я е направила циник с черно чувство за хумор. Злопаметна е. Обича да си връща, отвори ли и се възможност. Мартин е в капан след хитрия план на Джаро да залови къртицата в редиците си. Часовете му са преброени, ако не предупреди инспектор Попов, че сделката е постановка. Младият агент ще рискува всичко, за да се спаси от създалата се ситуация, но дали това ще е достатъчно. Изпитанието за психиката на Мартин става още по-тежко, когато босът му заповядва да убие нелоялен дилър. Докъде може да стигне един агент под прикритие? Готов ли е на всичко в името на мисията си?","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/9IVaLpJR0zNnVlbsTICC6PvfwRN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-22","episode_number":6,"episode_type":"standard","id":957768,"name":"Episode 6","overview":"Обирът! Възстановка на действителен грабеж на популярна банка, случил се в София преди време. Мартин е натоварен от Джаро да ръководи обир на банков трезор, в който ливански бизнесмен държи извънредно ценна вещ. В това време Попов разследва фирма, свързана с бизнеса на Джаро по доказателства, събрани от Мартин. Докато агентът под прикритие и останалите от групировката извършват обира в трезора, алармата се задейства и те попадат в капана на полицията. Как ще се измъкнат от ситуацията, какво ще открие Попов и ще успее ли Мартин да запази прикритието си.....тази неделя от 20.45 ч. по БНТ. NB/За сцената с обира на банка в София е построено точно копие на печално известния банков трезор","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/nxVKgEgIxe3w6oqz1rR3bPe0KTg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-05-29","episode_number":7,"episode_type":"standard","id":957770,"name":"Episode 7","overview":"Откуп! Депутат, изнудван за скандално секс-видео. След банковия обир в ръцете на Джаро попада запис на скандална секс-сцена с Ана Неделчева (Йоана Буковска) - политик, борещ се с корупцията в държавата. Засягаща престъпната дейност на Туджаров, тя се превръща в идеална жертва за изнудване. Цената, с която видеото може да се \"покрие\" е 250 хил.лева, а с \"мисията\" е натоварен Мартин. Неделчева се обръща към полицията за помощ. Случаят е деликатен и поверен на Попов.","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/3ZHLzuCUYvdDQBeLegG27LC8opd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-05","episode_number":8,"episode_type":"standard","id":957769,"name":"Episode 8","overview":"За да преразпредели пазара на наркотици в града,  Джаро поръчва убийството на известен софийски наркобос. Останалите  наркобосове са свикани на тайна среща. Мартин е натоварен да отговаря за телефонния заглушител, което е добра възможност за него да запише разговора им.  Попов смята, че Мартин поема твърде голям риск, но се съгласява да му помогне. Срещата се провежда по време на ММА-свободни боеве и всичко върви по план до момента, в който става ясно, че човекът на Джаро не може да се бие. На ринга трябва да излезе  Мартин и да го замести. Залогът е голям, на везните са: репутацията на Джаро срещу прикритието на Мартин.","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/wos3cpwKKy3s8vn0MSdy8dV3fP3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-12","episode_number":9,"episode_type":"standard","id":957771,"name":"Episode 9","overview":"Атентат Възможности: спасението на Джаро и бягството на Мартин... Мартин успява да запише срещата между Джаро и наркобосовете, но записът е изтрит от \"къртицата\" в ГДБОП. Това предизвиква огромен скандал, след който всички полицаи са заплашени от вътрешно разследване. При преразпределението на наркопазара в София, Джаро е засегнал доста интереси и се е превърнал в още по-неудобна фигура за хората от подземния свят. Поръчан е атентат срещу него. Попов е информиран. След последната провалена акция Мартин е отчаян, но има нова задача - да спаси Джаро. Решението му е това да бъде последното му действие на полицай под прикритие, след което да се оттегли. Бягството му няма да е толкова лесно, след като хората на Джаро претърсват апартамента му и го изправят пред детектора на лъжата... NB/ Покушението срещу Джаро пресъздава напълно реална случка от криминалните хроники преди години.","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/9IVaLpJR0zNnVlbsTICC6PvfwRN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-19","episode_number":10,"episode_type":"standard","id":957773,"name":"Episode 10","overview":"Разкрития! Кой кой е без прикритие? Доносникът в ГДБОП е заловен. Мартин се съгласява да продължи мисията си като полицай под прикритие при условие, че след ареста на Джаро, властите ще се погрижат той и Съни да бъдат защитени. Попов е шокиран от новината, че Мартин има връзка с любовницата на най-големия си враг. Той е сигурен, че това ще провали цялата му мисия, но се съгласява да съдейства. За да не загуби случая \"Туджаров\", Попов е принуден да проведе показна полицейска акция. Мартин отново му помага с информация за предстояща крупна контрабанда на цигари през канал на Джаро. Но преди това Попов ще се срещне с най-големия си враг - очи в очи... Развръзката предстои след въпросите: Защо залавянето на Джаро е толкова важно за Попов? Каква е тяхната обща история от миналото? Ще успее ли акцията на полицията или пак някой ще предупреди хората на Джаро? Какво ще се случи с Мартин и Съни....","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/mxHal9KCLoN9bF90vXE8vpSTu2t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironv","credit_id":"5772e1e1c3a368315100042e","order":500,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":1.553,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2011-06-26","episode_number":11,"episode_type":"standard","id":957772,"name":"Episode 11","overview":"Христо Мутафчиев влиза в \"Под прикритие\" Жива ли е Съни? Как Мартин ще се спаси от къртицата? Ще успее ли Попов да арестува Джаро навреме и каква е връзката между Джаро, Попов и героя на Христо Мутафчиев... Съни бе разкрита от Джаро и сега е в неизвестност. Мартин следи Иво, за да разбере дали Съни е жива и така вижда Васил в компанията на мафиота. Двамата не се разпознават. Мартин разбира, че Попов е преместен в друг отдел и това поставя мисията му пред нова опасност. Въпреки това се съгласява да му предаде още информация. Това води до удар на полицията срещу цеха на Джаро за производство на амфетамин. Заловено е голямо количество наркотик и са направени арести. Попов се приближава до целта си – да намери свидетел, който да уличи Джаро в престъпна дейност. Това е последната операция на Попов и той е длъжен да предаде цялата секретна информация по случая Джаро на своя заместник Васил. В действието се включва героят на Христо Мутафчиев – едно неочаквано завръщане, което ще промени всичко !","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/3ZHLzuCUYvdDQBeLegG27LC8opd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":1.553,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2011-07-03","episode_number":12,"episode_type":"finale","id":959648,"name":"Episode 12","overview":"Попов и агентът от ДАНС - Бенишев правят съвместен удар и арестуват дипломат, който изнася зад граница \"мръсни пари\" на Джаро. По същото време, в ареста химикът признава, че разбитата лаборатория за амфетамини е свързана с мафиота. Това дава повод на Попов да арестува Джаро и да се изправи срещу него в дългоочакван двубой. Доказателствата се оказват недостатъчни и Джаро е освободен от ареста, заклевайки се, че лично ще си разчисти сметките с Попов.","production_code":"","runtime":null,"season_number":1,"show_id":43424,"still_path":"/wos3cpwKKy3s8vn0MSdy8dV3fP3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":1.553,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]}],"name":"Season 1","overview":"An ordinary boy from a suburb of Sofia became the first undercover police officer in Bulgaria. Forced as a child by his father to steal and cheat, Martin becomes the perfect liar. This skill of his, as well as his hatred for the underworld, make him the most suitable person for a dangerous mission - to be implemented in the criminal organization of a large and influential businessman. While delving into the group's secrets and living in constant fear of being discovered, Martin falls in love with the most inappropriate of women - Djaro's friend Sunny. Just as he gains the trust of the mobsters, it turns out that the real enemies are in the police. Martin is left alone against everyone, facing difficult decisions.","id":52838,"poster_path":"/yXhHoDnltCqWuVlqStXwahixcEZ.jpg","season_number":1,"vote_average":0},"2":{"_id":"525964fa760ee346619a46e1","air_date":"2011-11-20","episodes":[{"air_date":"2011-11-20","episode_number":1,"episode_type":"standard","id":888047,"name":"A choice in a new scheme!","overview":"Martin wakes up with Mironov after a doctor cleans his wound. Mironov tells him how during an operation they shot all the criminals and Jaro offered to steal the money, but Mironov refused and was shot. He later woke up and set fire to everything around him, faking his death. After leaving for Russia, he married, but Jaro discovered him and killed his wife. Now he's back for revenge and wants Martin's help. He, in turn, returns to Jaro and continues his work undercover. Popov asks Martin at the hospital to stop everything, and at the same time Nikolov comes to question him, but Popov says he doesn't remember anything and reminds him that he knows who he is. Ivo lies to Jaro that he killed Sunny. Meanwhile, Jaro decides to change tactics and build a good image among the public, and Martin manages to get more information from a politician close to Jaro and passes it on to Mironov. When Mironov uses the information against Jaro, he suspects a politician and kills him.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2011-11-27","episode_number":2,"episode_type":"standard","id":888048,"name":"Double game","overview":"One of Djaro's bodyguards, Geletto, is caught selling drugs behind his back, but his friend breaks him out of jail right away. Meanwhile, Ivo helps Jaro by exposing some of his colleagues to the police to make him look good. Later, Ivo and Djaro catch Geletto in a lie about the cocaine theft. Martin follows Ivo, but he catches him and then asks Sunny about everything that happened and if Martin is a police officer, but she doesn't answer. Popov decides to go back to work, but Martin doesn't seem particularly interested, because of Mironov's help and protection. Jaro becomes suspicious of both Martin and Geletto because of his quick escape from prison, and puts them to the test. Geletto, frightened, decides to escape, but ends up being killed by the twins on Djaro's orders.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2011-12-04","episode_number":3,"episode_type":"standard","id":888049,"name":"Forgotten debts","overview":"Unpaid debts and rage The dangerous game of the undercover agent - Martin Hristov continues. In the name of his mission, he will \"step\" into risky criminal acts. Jaro is furious because someone stole something from him and someone else forgot to pay back their debts. What actions will he take in his rage and what will happen to the people it targets? More about the bandit's past during his years in the police and what will happen in the newly formed triangle: Martin - Sunny - Ivo.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2011-12-11","episode_number":4,"episode_type":"standard","id":888051,"name":"The delivery","overview":"The drug market under double siege Undercover policeman Martin and Zdravko-Kosama have to deliver a ton of benzyl methyl ketone (BMK) - an ingredient used in the production of amphetamines. However, the two are deceived by the dealers who supply them with another substance. At the same time, the police set a trap for them and Jaro's employees are taken into custody, from where they are surprisingly released. It turns out that instead of the BMK ingredient, the dealers sold them epoxy resin, which is a substitute. Martin and Kosama's task is to find the crooks and return the goods, without which Jaro's big deal with amphetamines fails. In the meantime, the police are preparing an action against the person whose property is the workshop producing the illegal ingredient. Will Martin and Zdravko be able to outrun the police and correct their mistake in time? All they can do is fight back.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2011-12-18","episode_number":5,"episode_type":"standard","id":888050,"name":"Traces of the past","overview":"New traces of the past Ivaylo Hristov and Chocho Popjordanov go \"undercover\" Martin's mission continues. This time Jaro will ask him to rob the house of a rich collector and steal a golden rhyton from him. Since the house heist is extremely difficult, Martin will work with a new partner who happens to be his own father! Ivo, in turn, launders a large amount of money, but Jaro is not satisfied with the commission and the two come into conflict. Meanwhile, new evidence concerning the murder of MP Boris Zhelev arrives at the GDBOP, and a new very powerful player is involved in the investigation - Momchil Neshev (Chocho Popyordanov). How will Martin keep his cover with his father's appearance? Will Deyan Donkov's character survive and what will be Djaro's new business?","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2011-12-25","episode_number":6,"episode_type":"standard","id":888052,"name":"\"Collection\" - in the back!","overview":"Ivo and Kukata decide to rob a tow truck behind Jaro's back. Meanwhile, in GDBOP, Vasil's department is headed by Momchil Neshev. Neshev interrogates a suspect and uncovers important clues surrounding the murder of MP Zhelev. Unwittingly, Hook reveals details of the collection hit to Martin. To take revenge on Ivo, Martin gives Inspector Popov information about the upcoming robbery, and so Ivo and Hook fall into a trap, and their lives are in danger.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2012-01-01","episode_number":7,"episode_type":"standard","id":888053,"name":"The deal","overview":"A saved report on counterfeit money Popov understands that the \"Secret Service\" is expecting a big deal with counterfeit money, in which Jaro will also participate. Meanwhile, Jaro entrusts the same deal to Martin, and Ivo is humiliated by the collection hit. Hook is relieved that Ivo didn't turn him in to Jaro for his part in the heist. Martin does not report the counterfeit money to Popov, but when he makes the transaction, the inspector intervenes and sabotages it. Hook and the twins narrowly escape. And Martin has to explain why he lied to his mentor.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2012-01-08","episode_number":8,"episode_type":"standard","id":888054,"name":"The discovery","overview":"An Ancient Find, Kidnapping and Escape Plan An ancient tomb was discovered along the route of the border road built by Djaro. Before journalists knew about the find, the case urgently needed to be covered. To this end, Boyana bribes the official in charge of the archaeological finds, but is surprisingly kidnapped by strangers along with the permission to continue construction. This calls the whole project into question. Popov learns from Martin about the kidnapping and the police joins the search. Meanwhile, Sunny asks Martin to get her out of the secret apartment where she is hiding with Ivo's mother. The two make a plan to escape, but just as Sunny prepares to escape, Ivo comes home.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2012-01-15","episode_number":9,"episode_type":"standard","id":888055,"name":"A deadly game","overview":"Djaro's lawyer - Boyana accidentally finds out that his former lover Sunny is alive. Meanwhile, his accountant informs him that someone has been misappropriating funds from his illegal transactions. After Boyana shares her discovery with Jaro, he guesses that Ivo ignored his order to kill Sunny, and the fact that he has been embezzling money from his illegal business also comes to light. Jaro goes berserk and sets a trap for Ivo. At this time, Sunny and Martin separate, not knowing that they are in danger. Popov describes the witness protection program to Sunny and questions her about Djaro's business. At first she is scared and hesitant to testify against the boss, but she finally agrees and the deadly game begins.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2012-01-22","episode_number":10,"episode_type":"standard","id":888057,"name":"Djaro and Ivo in a direct fight","overview":"The conflict between Djaro and Ivo becomes even more acute when Ivo and Hook appropriate parts of Djaro's drug market. Meanwhile, Djaro announces Martin as Ivo's new deputy. For his part, Mironov asks Ana Nedelcheva to disclose information about Djaro and his project with the road to the Greek border. In the GDBOP, Popov and Neshev reveal new clues about the murder of MP Boris Zhelev. Stung by Ivo and Hook, the drug lord Meto contacts Djaro and tells him about a meeting of the bosses organized by Ivo. Although Djaro promises General Penev not to frame Ivo, the boss goes to the meeting to settle scores with his former right-hand man. Who will survive this dangerous game?","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Aleksandar Mironov","credit_id":"5772e20a9251412f5e0003d6","order":501,"adult":false,"gender":2,"id":966876,"known_for_department":"Acting","name":"Hristo Mutafchiev","original_name":"Hristo Mutafchiev","popularity":2.066,"profile_path":"/15zbrJkDSDfDRHHqdunGiuRKyPo.jpg"}]},{"air_date":"2012-01-29","episode_number":11,"episode_type":"standard","id":888056,"name":"Mironov sets a trap for Djaro","overview":"Popov will try to find Damyanov, but Djaro will overtake him and thwart his escape. The boss pressures Damyanov and makes him reveal who he works for. Damyanov tries to escape, but Djaro tortures him, and he admits that the plan to bring down the boss empire with the border road was Mironov's. Djaro is shocked as he thought he had settled his scores with Mironov in Russia. Popov finds Damyanov in a miserable state and decides to personally monitor Djaro, as he believes that Mironov is ready to act. In this way, Popov unwittingly stumbles upon the trap that Mironov has set for Djaro. Will he be able to escape? Martin is faced with another difficult choice, and Ivo makes a serious request for a new boss on the street.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-05","episode_number":12,"episode_type":"finale","id":888058,"name":"Who will emerge alive from the dangerous game of money, power and crime?","overview":"Martin reported to Popov about Djaro's plans to make a counterfeit money deal and leave the country. The agent is desperate as he has been put on a national manhunt and Popov is powerless to help him. The undercover cop knows that without direct evidence they can't arrest Jaro and he will get away. Before the cops hit Jaro's printer, Martin steals a disk with files on the counterfeit notes from her. Meanwhile, Hook is worried that mass arrests have begun and wants to cover temporarily. Djaro finds out that his printing shop is closed and threatens Popov's family. At this time, Martin slips the disk from the print shop into Djaro's apartment. Popov and Neshev searched the boss's apartment and arrested him on charges of counterfeiting money.","production_code":"","runtime":null,"season_number":2,"show_id":43424,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"After the beating of Emil Popov, Petar Tudzharov - Djaro found out that the commissar had survived. In order to save his life and business, the mob boss must look for new solutions. Undercover agent Martin is faced with a choice of whose side to go on. A new strong player will make him an unexpected offer. A scandalous explosion is followed by a brutal political assassination that will mess up everyone's plans.","id":52840,"poster_path":"/gR6JGVYF36T6LiyN74STGsxQ2V8.jpg","season_number":2,"vote_average":0},"3":{"_id":"525964fa760ee346619a46d6","air_date":"2012-11-25","episodes":[{"air_date":"2012-11-25","episode_number":1,"episode_type":"standard","id":888035,"name":"Episode 1","overview":"Djaro is in custody, Popov is restless, works late - his family is in crisis. Martin's cover is no longer just between Djaro and Popov. Neshev helps him get out of custody. Outside, the drug market with crimes continues.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/cWYQ7IxAth4Qv8zYyDTcojc1dlv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-02","episode_number":2,"episode_type":"standard","id":888036,"name":"Episode 2","overview":"Ivo becomes strong, stops at nothing and does not listen to friendly advice. Djaro finds a way to control his people by using the best alibi.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/3pNRTKrnSDTq9qQXIwq1NkgsVGA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-09","episode_number":3,"episode_type":"standard","id":888037,"name":"Episode 3","overview":"After Djaro's poisoning in prison, Ivo is determined to seize the sea territories. All narcotics and illegal dealings by sea must now flow from him, otherwise punishments from his right-hand man Krum are inevitable. A woman appears in Ivo's life, but will her tenderness help Andonov to be less cruel.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/2SL9fOaMHOjUNYz3oPggEY46TAY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-16","episode_number":4,"episode_type":"standard","id":888038,"name":"Episode 4","overview":"The clash between Djaro and Ivo for supremacy and power becomes more and more acute. Popov's daughter is a victim of his failed family.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/oTk7Xnhls47788VlNlLcrmooGCQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-23","episode_number":5,"episode_type":"standard","id":888039,"name":"Episode 5","overview":"Ivo organized a scheme to siphon off VAT. Popov's daughter is in danger. He ends up at a closed party in a hotel in Borovets together with hired girls. Martin saves her.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/4dm0LUbzJrdyHwaa88E9N2ECoCW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-30","episode_number":6,"episode_type":"standard","id":888040,"name":"Episode 6","overview":"Djaro orders a \"mutual\" assassination of Martin and the twins. All three were shot. Martin manages to call the Kukata.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/sG5Kg7uUrXLQxeYv0do7r6XBFXd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-06","episode_number":7,"episode_type":"standard","id":888041,"name":"Episode 7","overview":"Kukata saves the injured Martin and the Big Twin. The three bury the Little Twin. Ivo is increasingly brutal. The hook is considering his own credit card skimming \"business\".","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/i2lFtAr0e3k1gKFOd4dJ5lq5tO4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-13","episode_number":8,"episode_type":"standard","id":888042,"name":"Episode 8","overview":"Kukata successfully develops the \"business\" of draining credit cards. The arrested Ivo shows Popov a recording of his daughter snorting cocaine. Popov withdraws the charges.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/bs2Xd7Phxg3UiLuiyaeJVm0VF8e.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-20","episode_number":9,"episode_type":"standard","id":888043,"name":"Episode 9","overview":"Ivo organized a successful theft of the Gold treasure of Panagiyrishte. Martin follows Hair and finds out about the robbery. Through the information provided by the agent, Commissioner Popov returns the treasure and is restored to his post.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/o2n40eUG49pyO8oRZbpVVgNmML3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-03","episode_number":10,"episode_type":"standard","id":888045,"name":"Episode 10","overview":"Martin is blackmailed by the thieves of his file; Ivo tries to take over Hook's credit card \"business\"; Martin returns his file by all means, regardless of Popov.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/IoUBS1pJ4MS2mi4MGTfK9EAwZM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-10","episode_number":11,"episode_type":"standard","id":888044,"name":"Episode 11","overview":"Kosama confesses her love for Adi. Ivo forces him to testify against Djaro. Under the influence of Martin Kosama turns his testimony. Ivo takes revenge.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/cOQ1qXl1I94JexC1MvDNnNhzhgt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-17","episode_number":12,"episode_type":"finale","id":888046,"name":"Episode 12","overview":"Kukata avenges Kosama's death. Ivo kidnaps Martin and takes him along with his file to Djaro. Pursued by Popov, Djaro takes off running across the border high into the winter mountains.","production_code":"","runtime":null,"season_number":3,"show_id":43424,"still_path":"/4RL3r0I0i9og3T5dr9Hl9j05u2H.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"After the arrest of Djaro and a serious shake-up of his position, Martin remains in the underworld as an undercover cop. This time his enemies are more and stronger. His new enemy is Ivo Andonov. After the death of his father and Sunny, he has nothing left to lose but to continue fighting crime to the end and at any cost. In order to prevent the acquittal of Petar Tudzharov, he must remain loyal as his right-hand man, but in the meantime enters into an alliance with the Kukata to fight against Ivo. The journalist Elitsa Vladeva also joins the actions against the underworld. Martin now knows that only by legal means is the fight doomed.","id":52839,"poster_path":"/vzumc9423Ug1L9cPxmeCf2Xh7Il.jpg","season_number":3,"vote_average":0},"4":{"_id":"52d299f319c2952afc02b79e","air_date":"2014-01-19","episodes":[{"air_date":"2014-01-19","episode_number":1,"episode_type":"standard","id":1035956,"name":"Episode 1","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/rHfMFPIsQtZhXDEFzcHPiI5xbdL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-26","episode_number":2,"episode_type":"standard","id":1035957,"name":"Episode 2","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/lLR13c5AmM0eKFoJbd5IW8XkW5a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-02","episode_number":3,"episode_type":"standard","id":1035958,"name":"Episode 3","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/nBtE5dU2uR2DcEKQKDB9yfYTiDp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-09","episode_number":4,"episode_type":"standard","id":1035959,"name":"Episode 4","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/TNPbC9YQ15Kq2Y3wSD3YW1HRCs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-16","episode_number":5,"episode_type":"standard","id":1035960,"name":"Episode 5","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/1WFR9bPffxS4pm7bnilmf17ZF2l.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-23","episode_number":6,"episode_type":"standard","id":1035961,"name":"Episode 6","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/nSvBpTWVY03obojXk1kaHPApHkH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-02","episode_number":7,"episode_type":"standard","id":1035962,"name":"Episode 7","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/rHfMFPIsQtZhXDEFzcHPiI5xbdL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-09","episode_number":8,"episode_type":"standard","id":1035963,"name":"Episode 8","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/lLR13c5AmM0eKFoJbd5IW8XkW5a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-16","episode_number":9,"episode_type":"standard","id":1035964,"name":"Episode 9","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/nBtE5dU2uR2DcEKQKDB9yfYTiDp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-23","episode_number":10,"episode_type":"standard","id":1035965,"name":"Episode 10","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/TNPbC9YQ15Kq2Y3wSD3YW1HRCs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-30","episode_number":11,"episode_type":"standard","id":1035966,"name":"Episode 11","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/1WFR9bPffxS4pm7bnilmf17ZF2l.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-06","episode_number":12,"episode_type":"finale","id":1035967,"name":"Episode 12","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":43424,"still_path":"/nSvBpTWVY03obojXk1kaHPApHkH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"Six months after the recent events, Martin Hristov is officially a police officer in the GDBOP, in the department of Commissioner Emil Popov. Ivo rules the street, disguised behind a legal business. Next to him is Nia Tujarova, who has returned from New Zealand in an attempt to reconcile with her father Djaro. Djaro is in Turkey to make contact with the Turkish mafia and is involved in the restoration of an international drug channel through Bulgaria. Tragedy overtakes Kukata in his Spanish exile – he returns to Bulgaria with a plan for revenge. Martin took advantage of his desire for revenge. The two make a deal that affects the interests of Ivo, Jaro and the Turks in life and death.","id":59823,"poster_path":"/pg7qBQQEcMHk7sFGIwiCNQM1G6f.jpg","season_number":4,"vote_average":0},"5":{"_id":"560829d19251416bf0000217","air_date":"2016-03-20","episodes":[{"air_date":"2016-03-20","episode_number":1,"episode_type":"standard","id":1149889,"name":"Episode 1","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/apRP8AOrUq3HvVGwXDT1cCK818R.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-03-27","episode_number":2,"episode_type":"standard","id":1175537,"name":"Episode 2","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/tcRoehIOKhnA4yLK06zqLWKhGhZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-04-03","episode_number":3,"episode_type":"standard","id":1175538,"name":"Episode 3","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/5Uz3mBnwPjhg13IHeelOsrM5e2N.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-04-10","episode_number":4,"episode_type":"standard","id":1175539,"name":"Episode 4","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/suFkJTLiCTzxUrz5o46dWM4kzoo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-04-17","episode_number":5,"episode_type":"standard","id":1175540,"name":"Episode 5","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/ydBvPsKPg2yitmoMQj27AokUCPu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-04-24","episode_number":6,"episode_type":"standard","id":1175541,"name":"Episode 6","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/mpnw4tz9tS6GG9OZelFQLucoAaU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-01","episode_number":7,"episode_type":"standard","id":1175542,"name":"Episode 7","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/wfuLWluuZDOvBsLJPVpKHqAm9dp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-08","episode_number":8,"episode_type":"standard","id":1175543,"name":"Episode 8","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/74cd3Bqrzo9QeUTVj3rIw9ELp2p.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-15","episode_number":9,"episode_type":"standard","id":1175544,"name":"Episode 9","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/wgLDSefvf8woN5YWwkl7cR5BMNZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-22","episode_number":10,"episode_type":"standard","id":1175545,"name":"Episode 10","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/xk4UR6OKhiVYDKRpkHBPgEEfe8i.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-29","episode_number":11,"episode_type":"standard","id":1175546,"name":"Episode 11","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/nGr16CPzEeXNBymecXRGnNFGPQR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-04","episode_number":12,"episode_type":"finale","id":1175547,"name":"Episode 12","overview":"","production_code":"","runtime":null,"season_number":5,"show_id":43424,"still_path":"/9ejRRgElWHTlIkBy3F160N44ZOd.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"Djaro is killed by Popov and someone will have to take his place. It is most natural that it should be Ivo. Undercover cop Martin is exposed and takes over Popov's old team. Now Errol - the new undercover cop - will try to take his place.","id":70999,"poster_path":"/4jXhoFg9n153pNTZuhnIGq5u3HZ.jpg","season_number":5,"vote_average":7.5}}}