{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[],"first_air_date":"1965-09-01","genres":[],"homepage":"","id":43667,"in_production":false,"languages":["en"],"last_air_date":"1966-01-12","last_episode_to_air":{"id":889614,"name":"Terror in a Tiny Town (2)","overview":"This episode continues the plot of Part 1.Escaping, Amos goes to see The Man and learns that he is wanted for murder.  He returns to Sorrel and finds the secret that Harlan O'Brien knew: the town has been brainwashed by subliminal tapes broadcast from station KJHS.  Hawkes is behind the entire scheme - he has stolen an atom bomb from the plant, piece by piece, and hidden it inside a statue in Washington, D. C. Burke allows himself to be arrested, then manages to get the zombie-like citizens to turn on Hawkes.  The bomb squad finds the stolen atom bomb and successfully defuses it.","vote_average":0,"vote_count":0,"air_date":"1966-01-12","episode_number":17,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null},"name":"Amos Burke: Secret Agent","next_episode_to_air":null,"networks":[{"id":2,"logo_path":"/2uy2ZWcplrSObIyt4x0Y9rkG6qO.png","name":"ABC","origin_country":"US"}],"number_of_episodes":17,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Amos Burke: Secret Agent","overview":"","popularity":2.286,"poster_path":"/ycc2dTeURYp9RtOMT2x53LAnT6j.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"1965-09-15","episode_count":17,"id":52987,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"52596598760ee346619ae05b","air_date":"1965-09-15","episodes":[{"air_date":"1965-09-15","episode_number":1,"episode_type":"standard","id":889599,"name":"Balance of Terror","overview":"Burke turns in his police badge to work as a secret agent for the Federal Government. In his first assignment, he travels to Switzerland to work with the local Swiss police to crack an international ring of gold smugglers.  Red Chinese gold is being smuggled from Switzerland into Latin America.  The leader of the smugglers is General Edrego Barata, once a Latin American dictator who stripped his country of its wealth.  Burke poses as syndicate hit man Paul Schreiner, whom Barata has never met.  The plan goes awry when the real Schreiner is released from jail and exposes Burke.  Burke manages to ultimately kill Barata.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52596599760ee346619ae094","adult":false,"gender":2,"id":20371,"known_for_department":"Writing","name":"Robert Buckner","original_name":"Robert Buckner","popularity":1.388,"profile_path":null}],"guest_stars":[]},{"air_date":"1965-09-22","episode_number":2,"episode_type":"standard","id":889598,"name":"Operation Long Shadow","overview":"In a combination of \"\"Day of the Jackal\"\" and \"\"The Man Who Knew Too Much\"\", Burke is sent to Paris to lacate the missing son of an American diplomat.  The boy disappeared shortly after someone murdered his father's girlfriend by pushing her off the Eiffel Tower.  When Burke arrives, he finds himself involved in a bizarre plot to assassinate Charles de Gaulle that takes him across the French countryside.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"61bca62dd2f5b50041b4ca18","adult":false,"gender":2,"id":9108,"known_for_department":"Directing","name":"Don Taylor","original_name":"Don Taylor","popularity":6.999,"profile_path":"/6Gg2DR2oP3qUPTEomlJi7i4dne9.jpg"}],"guest_stars":[]},{"air_date":"1965-09-29","episode_number":3,"episode_type":"standard","id":889600,"name":"Steam Heat","overview":"Burke poses as a jewel thief and infiltrates a criminal syndicate planning to put New York City to sleep with gas introduced into all the steam mains.  The crooks, Albert Indigo, Tucson the Cowboy, Charlie \"\"The Arm\"\" Segal, and Ziggy White, then plan to loot the entire city.  With the finances for the plan suppied by foreign interests, the syndicate also intends to kill a few important, connected people.  While planning takes place at the Villa Ruposa, \"\"Mr. I\"\" undergoes a senate hearing, after which he vows vengeance on Senator Burrows.  With the aid of co-spy Ursula Prince, Burke learns about the entire operation, but a beautiful crook named Silkie kills Ursula so she can have Burke all to herself.  Burke ultimately triumphs and gets word to the police, who wear gas masks to round up the gang.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52596599760ee346619ae0b3","adult":false,"gender":0,"id":1224756,"known_for_department":"Writing","name":"Marc Brandel","original_name":"Marc Brandel","popularity":1.38,"profile_path":null}],"guest_stars":[]},{"air_date":"1965-10-06","episode_number":4,"episode_type":"standard","id":889601,"name":"Password to Death","overview":"In London, Burke investigates two murders.  The victims, a German electronics expert and a Yugoslavian engineer, had one thing in common:  they both died after telephoning a certain number.  Burke uncovers an intricate plot involving a password that means instant death, tin mines that have poison gas in the ventilating system, and a new, deadly Soviet satellite.  Behind it all is megalomaniac who plans to destroy all the top people in England and take over the nation.  Burke saves the day, but not before the Russians conspire to lead him to the brink of disaster.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1965-10-13","episode_number":5,"episode_type":"standard","id":889602,"name":"The Man with the Power","overview":"Burke is sent behind the Iron Curtain and must smuggle out a famous scientist who has developed an ultra-powerful nuclear device.  Another agent, Tony Scott, is assigned to assist Burke, but is actually in a conspiracy to steal the new weapon and sell it.  Once they get Dr. Crystal into Austria, Scott kidnaps him and hooks him up to his bomb, which will destroy Vienna withing 22 hours if 2 million dollars in uncut diamonds aren't paid.  Burke gets the diamonds released to an Austrian official.  However, he too is in on the plot.  Claiming the diamonds are fake, the official accuses Burke of stealing the real gems, planning to blame the inevitable disaster on Burke and then kill him.  Burke finally discovers a special code consisting of 12 numbers that must be given in order to defuse the bomb.  1937 is one known sequence of numbers in the code.  The remaining 8 are discovered at the last minute....8523....6472.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1965-10-20","episode_number":6,"episode_type":"standard","id":889603,"name":"Nightmare in the Sun","overview":"Burke is in Mexico City to try and learn who is behind an assassination attempt against Pablo Vasquez, the Mexican Government's Labor Leader, who very pro-U.S.  He discovers that a proposed peace treaty is the reason behind the attempt on Vasquez while he was watching the renowned female matador, La Tigra.  Burke gets himself thrown in jail in order to question a suspected conspirator, but learns nothing.  La Tigra distracts Burke while he is guarding Vasquez and Vasquez is kidnapped.  Failing to kill Burke, La Tigra confesses that she was only in on the plot because she was being blackmailed by the leader of the plot, Darvas.  Together, Burke and La Tigra rush to her ranch where Vasquez is being held captive by Darvas.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52596599760ee346619ae0f6","adult":false,"gender":2,"id":15630,"known_for_department":"Directing","name":"James Goldstone","original_name":"James Goldstone","popularity":1.669,"profile_path":null}],"guest_stars":[]},{"air_date":"1965-10-27","episode_number":7,"episode_type":"standard","id":889604,"name":"The Prisoners of Mr. Sin","overview":"Special Installation MX-3 in Washington, D. C. is protecting a renowned cryptographer and head clerk of a U.S. intelligence installation, Dr. Waldo E. Bannister, responsible for breaking the Manchurian Code.  With his knowledge, expertise, and photographic memory, he is highly sought after.  Deep in his brain are the files of twenty-one of the country's best agents, including Burke.  In retirement, Bannister travels to the Isle of Tio Moro, a thieves market where the most unusual items regularly change hands and the home of the notorious Mr. Sin.  Planning on selling his information, Bannister is instead captured by Mr. Sin, who plans to auction off Bannister's facts to the highest bidder, keeping the money for himself.  Burke is sent to either retrieve Bannister off the island or kill him before he talks.  Posing as a playboy who operates on the fringes of the law, Burke gains the confidence of Mr. Sin and plans to bid on Bannister.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52596599760ee346619ae119","adult":false,"gender":2,"id":15947,"known_for_department":"Writing","name":"Gilbert Ralston","original_name":"Gilbert Ralston","popularity":2.372,"profile_path":null},{"department":"Writing","job":"Writer","credit_id":"52596599760ee346619ae0b3","adult":false,"gender":0,"id":1224756,"known_for_department":"Writing","name":"Marc Brandel","original_name":"Marc Brandel","popularity":1.38,"profile_path":null}],"guest_stars":[]},{"air_date":"1965-11-03","episode_number":8,"episode_type":"standard","id":889605,"name":"Peace, It's a Gasser","overview":"Union Seecorps, a fanatical revolutionary group led by Harrison Quentin Filmore, has a dream.  Filmore wants to bring peace to the world through Operation Euphoria.  He plans to to dose Washington, D.C., with LSD gas for three days.  First they must steal H09, a gasoline additive, from Narvoo Air Base, in order to drug the troops.  Burke is sent to the base and poses as a member of the military police in order to guard the additive.  Filmore, however, manages to drug the entire base and steal the additive.  Other members of the Union plan to take advantage of Filmore's \"\"high\"\" ideas of peace and take over the United States Government.  Burke now has to pose as a traitor in order to infiltrate the Union.  He does, but Filmore decides to test his \"\"disloyalty\"\" by ordering him to kill a CIA agent.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52596599760ee346619ae0f6","adult":false,"gender":2,"id":15630,"known_for_department":"Directing","name":"James Goldstone","original_name":"James Goldstone","popularity":1.669,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"62dbb558dc1cb4004fab1c88","adult":false,"gender":2,"id":121071,"known_for_department":"Writing","name":"Palmer Thompson","original_name":"Palmer Thompson","popularity":0.608,"profile_path":null}],"guest_stars":[]},{"air_date":"1965-11-10","episode_number":9,"episode_type":"standard","id":889606,"name":"The Weapon","overview":"Burke heads to London to battle power-crazed tycoon Alexander Szabo, a maniac who possesses a deadly truth serum.  Szabo uses the serum on top government officials who, after revealing secret information, are then caused to commit suicide by the drug's effects.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1965-11-17","episode_number":10,"episode_type":"standard","id":889607,"name":"Deadlier than the Male","overview":"Exiled South American dictator Pedro Cabrial is living in a Spanish castle but aspires to return to power with the help of foreign financial aid.  Carla, his wife, conceals from him the fact that he has contracted a fatal illness and will be dead in thirty days.  In this way, she figures so he will go through with a planned coup and then she will be able to gain control of the country.  Jeff Smith (an undercover agent who happens to be The Man's son), Dr. Torres, and anyone else who gets in the way of the military takeover are killed.  Pepe, Sra. Cabrial's loyal servant, watches as she recalls the splendor of her life as Viva Evita on film, over and over again.  Burke is sent to infiltrate Cabrial's stronghold.  He succeeds in getting inside the castle, only to be captured and put on a rack left over from the Inquisition.  Django, responsible for Agent Smith's demise under the instructions of Capt. Luzardo, is killed in turn by Burke.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1965-12-01","episode_number":11,"episode_type":"standard","id":889609,"name":"Whatever Happened to Adriana and Why Won't She Stay Dead?","overview":"A warehouse explosion destroys evidence needed to convict international narcotics king, James Gunnar Ketterbach.  His new line of business is smuggling missiles into South America.  Burke's mission is to capture one of the missiles and bring it back to be used in evidence at the United Nations inquest.  Ketterbach has disposed of a woman for a top Sicilian official and put her in a coffin marked \"\"Adriana Montavi\"\".  Since then, he has been blackmailing the official into helping him with his operation.  Adriana, however, is very much alive and helps Burke defeat Ketterbach.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52596599760ee346619ae192","adult":false,"gender":2,"id":1214564,"known_for_department":"Directing","name":"Seymour Robbie","original_name":"Seymour Robbie","popularity":3.124,"profile_path":null}],"guest_stars":[]},{"air_date":"1965-12-08","episode_number":12,"episode_type":"standard","id":889608,"name":"The Man's Men","overview":"The title refers to the operatives of Burke's boss, \"\"The Man\"\". The Man has devised an ambitious project entitled Operation Eyeball.  It is a plan to bug every foreign embassy in the world.  Shortly before the plan is to be put into effect, a microfilm containing a list of American agents assigned to the operation is stolen, along with a photograph of each one.  The list is being offered in trade for seven million in diamonds for international bidding on future targets.  Even though the ransom is paid, The Man knows the list has been copied and so orders Burke and female agent Sylvia Kellogg to kill everyone connected with the theft.  As they carry out the mission, Burke begins to suspect that Sylvia is working for the other side.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52596599760ee346619ae173","adult":false,"gender":2,"id":116986,"known_for_department":"Directing","name":"Jerry Hopper","original_name":"Jerry Hopper","popularity":1.822,"profile_path":null}],"guest_stars":[]},{"air_date":"1965-12-15","episode_number":13,"episode_type":"standard","id":889610,"name":"Or No Tomorrow","overview":"The Man sends Burke to Ceylon to investigate a ransom note that the U.S. government has received.  The note threatened to unleash a deadly new fungus called Blast on the Asian continent unless a pair of convicted spies were released to the extortionist.  After the fungus is released on the small island of Perzan in the Indian Ocean, the rice crops become diseased and have to be burned and destroyed after only forty-eight hours.  Unless Burke can find a way to stop whoever is behind the plan, the entire world may be faced with a great famine.  Burke learns that the person behind the plot is the mad Prince Ransputa, and he poses as a wealthy American in search of rare emeralds in order to get to the prince.  Once inside the palace, he discovers that the fungus was unwittingly created by a beautiful scientist, Tashu Anil.  She is in love with the prince and is being used by him.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1965-12-22","episode_number":14,"episode_type":"standard","id":889611,"name":"A Little Gift for Cairo","overview":"Sheik Farid, deposed King of Egypt, is collecting a secret aresenal of weapons to take over what he has lost.  The Man assigns Burke to foil Farid's takeover plans.  To help him, he has an elderly but effective British agent named Agatha Carruthers.  Burke plans to romance Farid's mistress, Yasmin, and plant a bug in a fake diamond pendant he plans to give her.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52596599760ee346619ae173","adult":false,"gender":2,"id":116986,"known_for_department":"Directing","name":"Jerry Hopper","original_name":"Jerry Hopper","popularity":1.822,"profile_path":null}],"guest_stars":[]},{"air_date":"1965-12-29","episode_number":15,"episode_type":"standard","id":889613,"name":"A Very Important Russian Is Missing","overview":"The United States and Russia collaborate on finding a Soviet agent, Borodin, feared kidnapped by China.  Both the U. S. and U.S.S.R. worry that the Red Chinese will extract the many military secrets he carries in his head.  A top Soviet agent, Pavlov, is sent to assist Burke in locating the missing Borodin.  They learn that Borodin has been smuggled into Switzerland in the carcass of a dead ox and is being held in a state of suspended animation.  Deceptions lead Burke to finally discover that Russians are actually holding Borodin for a ransom of 4 million dollars.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1966-01-05","episode_number":16,"episode_type":"standard","id":889612,"name":"Terror in a Tiny Town (1)","overview":"Harlan O'Brien, Chief Security Officer at the nuclear power plant in the small town of Sorrel, is shot by a policeman after going berserk in a restaurant.  After his death, Burke goes to investigate the death of his old war buddy and finds the townspeople all seem to be under some form of mass hypnosis.  Expressionless, they refuse to discuss anything but their great loyalty to their town.  Burke tries to uncover the truth about an orgnanization known as The Friends of Progress.  The town leader, ex-Congressman Jed Hawkes, seems sane enough until he suddenly orders the citizens to kill Burke.  A mob forms and they finally corner Burke in a laundromat.  Five of the seemingly \"\"normal\"\" people enter with shotguns and come after Burke as the episode ends.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52596599760ee346619ae0b3","adult":false,"gender":0,"id":1224756,"known_for_department":"Writing","name":"Marc Brandel","original_name":"Marc Brandel","popularity":1.38,"profile_path":null}],"guest_stars":[]},{"air_date":"1966-01-12","episode_number":17,"episode_type":"finale","id":889614,"name":"Terror in a Tiny Town (2)","overview":"This episode continues the plot of Part 1.Escaping, Amos goes to see The Man and learns that he is wanted for murder.  He returns to Sorrel and finds the secret that Harlan O'Brien knew: the town has been brainwashed by subliminal tapes broadcast from station KJHS.  Hawkes is behind the entire scheme - he has stolen an atom bomb from the plant, piece by piece, and hidden it inside a statue in Washington, D. C. Burke allows himself to be arrested, then manages to get the zombie-like citizens to turn on Hawkes.  The bomb squad finds the stolen atom bomb and successfully defuses it.","production_code":"","runtime":null,"season_number":1,"show_id":43667,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52596599760ee346619ae0b3","adult":false,"gender":0,"id":1224756,"known_for_department":"Writing","name":"Marc Brandel","original_name":"Marc Brandel","popularity":1.38,"profile_path":null}],"guest_stars":[]}],"name":"Season 1","overview":"","id":52987,"poster_path":null,"season_number":1,"vote_average":0}}}