{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[43],"first_air_date":"2011-08-31","genres":[{"id":99,"name":"Documentary"},{"id":10764,"name":"Reality"}],"homepage":"","id":43832,"in_production":false,"languages":["en"],"last_air_date":"2012-12-26","last_episode_to_air":{"id":890384,"name":"Magical Jet Propulsion, Missing Link Mystery, Typhoid Mary","overview":"One man combined the occult and rockets to produce the technology that underpinned Mutually Assured Destruction. A skull found in 1912 seems to solve Darwin's puzzle of where we came from. Mary Mallon infects hundreds with typhoid despite being healthy.","vote_average":0,"vote_count":0,"air_date":"2012-12-26","episode_number":13,"episode_type":"finale","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null},"name":"Dark Matters: Twisted But True","next_episode_to_air":null,"networks":[{"id":226,"logo_path":"/orcpefChr3hPSipPcoYa9gSq7ev.png","name":"Science","origin_country":"US"}],"number_of_episodes":19,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Dark Matters: Twisted But True","overview":"Dark Matters: Twisted But True is a television series featured on the Science Channel. Hosted by actor John Noble of Fringe and Lord of the Rings, the show takes the viewer inside the laboratory to profile strange science and expose some of history's most bizarre experiments. This show uses narration and reenactments to portray the stories in this show. A new season of episodes, under the title Dark Matters: Extra Twisted, premiered on January 23, 2013. The episodes revisit previous stories with \"deeper insight and new information.\"","popularity":5.97,"poster_path":"/fz0QmvCqLGIgpTKonMDHASbRqsL.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2011-08-31","episode_count":6,"id":53114,"name":"Season 1","overview":"","poster_path":"/xCas8MaRdFujfYF9fG3JenD4nKI.jpg","season_number":1,"vote_average":0},{"air_date":"2012-07-14","episode_count":13,"id":53115,"name":"Season 2","overview":"","poster_path":"/x5B6T1jYVNgUUEDskKhazEKV4wc.jpg","season_number":2,"vote_average":6}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":7.6,"vote_count":11,"season_data":{"1":{"_id":"525965ff760ee346619b3bec","air_date":"2011-08-31","episodes":[{"air_date":"2011-08-31","episode_number":1,"episode_type":"standard","id":890369,"name":"The Philadelphia Experiment, Ape-Man Army, Zapped to Death","overview":"The Philadelphia Experiment: In 1956 astronomer and UFOlogist Morris Jessup received an extraordinary letter. It claimed that during World War 2 the US Navy had experimented with invisibility and teleportation in a botched test on a destroyer, the USS Eldridge. Jessup's search for the truth will lead him to pay the ultimate price. APE-MAN ARMY: In the 1920s and 30s Soviet scientist Dr. Ilya Ivanov began a series of disturbing experiments to cross breed humans with apes. At first he tried to make female apes pregnant using humans as the fathers. His experiments grew so grotesque he was expelled from French Guinea in Africa when he attempted to make women pregnant using apes as the fathers. But his research continued in Russia. Did he succeed? ZAPPED TO DEATH: Thomas Edison was a great man, one of the inventors of the modern world. But even the greatest men make mistakes. Caught up in a commercial battle to supply America with electricity, Edison ran a disturbing publicity campaign against his bitter rival George Westinghouse. The campaign used Westinghouse technology to electrocute animals. Ultimately Edison's campaign went even further, leading to the invention of the electric chair. It was a battle Edison regretted for the rest of his life.","production_code":"","runtime":43,"season_number":1,"show_id":43832,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-07","episode_number":2,"episode_type":"standard","id":890370,"name":"I Have Einstein's Brain, Unidentified Flying Nazis, Killer Thoughts","overview":"I HAVE EINSTEIN'S BRAIN: When Albert Einstein dies in 1955, the pathologist tasked with the autopsy steals his brain. Dr. Thomas Harvey promises he will unravel the mystery of where genius lies within its physical structure. In fact, he embarks on a bizarre 40 year odyssey accompanied by the brain, floating in a mayonnaise jar… UNIDENTIFIED FLYING NAZIS: A fireball streaks through the skies of Pennsylvania in 1965. Is it just a meteor? If so, why have the military cordoned off the area within hours? Could it be a UFO? The Air Force says, 'No'. Then a historian discovers some extraordinary evidence from the end of the Second World War. Could the fireball be evidence that the US got hold of an outlandish piece of Nazi anti-gravity technology? KILLER THOUGHTS: Could the Cold War have been won just by thinking about it? Both Russia and the United States spent millions trying to develop mind-weapons and extra-sensory espionage. While nuclear weapons were paraded in front of the world, behind the scenes there was a full blown psychic arms race going on.","production_code":"","runtime":43,"season_number":1,"show_id":43832,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-14","episode_number":3,"episode_type":"standard","id":890367,"name":"Sexy Secret Agent, Full Body Transplant, Honey I Nuked the Planet","overview":"SEXY SECRET AGENT: When talk show host John Nebel married ex-model Candy Jones he had no idea that she would reveal that she was a brainwashed CIA secret agent called Arlene Grant. She claims to have been the subject of mind control experiments in the late 50s and to have been sent on foreign missions where she was tortured. But was it true, or had Candy Jones developed a split personality during her troubled childhood? Truth or fantasy? FULL BODY TRANSPLANT: In 1971, in the culmination of a series of gruesome experiments, neurosurgeon Dr. Robert White successfully transplanted the head of one rhesus monkey onto the decapitated body of another. A devout Catholic, White believed the techniques could one day save human souls when their bodies gave out. But would it ever have worked? And would we tolerate today the level of unnecessary animal cruelty that he believed acceptable? HONEY I NUKED THE PLANET: In 1962 the United States exploded a 1.4 megaton H-Bomb in space Scientist James van Allen was asked to prove the test was safe but given just weeks to do it. President Kennedy went on to use Van Allen's name to prove the tests were not dangerous. The bomb created a radiation storm around the planet that took ten years to dissipate, blew out orbiting satellites and plunged parts of Oahu into darkness. They were fortunate it wasn't far worse. Van Allen kept his own council until the test was complete but then exploded labeling it shoddy and unsafe.","production_code":"","runtime":43,"season_number":1,"show_id":43832,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-21","episode_number":4,"episode_type":"standard","id":890366,"name":"It's Alive!, Tripping with Uncle Sam, My Hand Is Killing Me","overview":"IT'S ALIVE!: Could we restore the dead to life? At the beginning of the 19th century, Italian scientist Giovanni Aldini suspected that electricity could be the God given vital force of life. He began with frogs' legs…but he ended up attempting to resurrect a human corpse. This is the true story that inspired Mary Shelley to write the classic horror story Frankenstein. TRIPPING WITH UNCLE SAM: Could madness be infectious? In the late 90's journalist Hank Albarelli tied an epidemic of insanity in a small French town to the apparent suicide of a top US government scientist. Combining his own government sources with a detailed analysis of declassified files he concluded that the town of Pont Saint Esprit in Southern France had been used as a test bed for a mind control experiment and that the scientist had been murdered to prevent him blowing the story. MY HAND IS KILLING ME: Are you alone in your head or could there be another, darker personality hidden away in your mind? In 1908 a German woman's left hand began attacking her. She became the first recorded case of a new condition: Alien Hand Syndrome. Experiments later revealed that when the two hemispheres of the brain become separated a new, often irrational personality can appear alongside the patient's original one. But does this only happen when the brain is split in two, or could it exist in all of us?","production_code":"","runtime":43,"season_number":1,"show_id":43832,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-28","episode_number":5,"episode_type":"standard","id":890368,"name":"21 Grams, Missing Cosmonauts, Sound of Death","overview":"21 GRAMS: Boston medic Dr. Duncan Macdougall sets out to scientifically prove the existence of the human soul, by weighing a man at the moment of death. If the patient loses weight, Macdougall believes he will have recorded the departure of the man's soul, and science will have shown religion to be right. But finding subjects willing to die on cue is not an easy task. His experiment, and results, remain controversial to this day. Is 21 gram the weight of a human soul? MISSING COSMONAUTS: The dawn of the space age. Two amateur radio hams are listening in, recording broadcasts from early Russian launches into space. One day, they hear a heart-stopping sound. Someone tapping out a distress signal from space. Was cosmonaut Yuri Gagarin really the first man in orbit, or did the Soviets send others up before him? Were they erased from history because they never came back? SOUND OF DEATH: There is a weapon you have probably never heard of. Some say it has never been used in anger. And yet several governments have called for it to be banned. When French scientist Vladimir Gavreau finds his laboratory flooded with a mysterious energy that has debilitating effects on the human body, his research is taken in a menacing new direction. Did he invent a new type of weapon of mass destruction? His work, and its military uses, remain shrouded in mystery to this day.","production_code":"","runtime":43,"season_number":1,"show_id":43832,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-05","episode_number":6,"episode_type":"finale","id":890371,"name":"Radio Waves of Death, How to Make a Zombie, Jekyll vs. Hyde","overview":"RADIO WAVES OF DEATH: Nikola Tesla was a genius with a plan to send electricity through the air. But as his behavior grew increasingly eccentric throughout his life, his financial backers abandoned him. Desperate to sell his ideas, he suggested that not only could his technology be the ultimate weapon of war, but that he had tested it. Was Tesla responsible for devastating a remote area of Siberia ninety years ago? HOW TO MAKE A ZOMBIE: Harvard scientist Wade Davis became obsessed with cracking the secrets of the Zombie. His journey led him to the island of Haiti where he tracked down a man with something few of us possess; his own death certificate. Digging down into the dark world of the voodoo sorcerer, Wade Davis believed he had uncovered the science that explained the zombie legend. But had he? JEKYLL VS. HYDE: You've probably never heard of Horace Wells, but he may have saved your life. In the 1840s Wells tried to invent anesthesia using laughing gas. But failure transformed him into an object of ridicule. Desperate to salvage his reputation, Wells experimented with a new drug, Chloroform. He had no idea of its addictive and hallucinogenic effects. In a drug-fueled madness he disfigured a woman with acid. He ended his own life without ever discovering that he had been acknowledged by his peers as the inventor of anesthesia.","production_code":"","runtime":43,"season_number":1,"show_id":43832,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":53114,"poster_path":"/xCas8MaRdFujfYF9fG3JenD4nKI.jpg","season_number":1,"vote_average":0},"2":{"_id":"525965ff760ee346619b3bf7","air_date":"2012-07-14","episodes":[{"air_date":"2012-07-14","episode_number":1,"episode_type":"standard","id":890372,"name":"Lindbergh, Suicide Song, Living Organ Donor","overview":"Charles Lindburgh plans to conquer death, but only for the select few. A song is blamed for 18 suicides. Some donate their dead bodies to science, but science wants one man's body while he was still alive.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[{"character":"Himself","credit_id":"5f38113711c066003836d314","order":502,"adult":false,"gender":2,"id":1770970,"known_for_department":"Acting","name":"Michael Stevens","original_name":"Michael Stevens","popularity":2.825,"profile_path":"/f8HK1CwOxCXivtUB15buMe2GOgE.jpg"}]},{"air_date":"2012-07-21","episode_number":2,"episode_type":"standard","id":890374,"name":"Resurrection Row, Operation Brainwash, Rabid Roulette","overview":"Robert Cornish's method for cheating death means a murderer could walk free.The CIA pays Ewen Cameron to invent brainwashing at an awful price for his patients. Louis Pasteur creates a rabies vaccine by gambling with the life of a child.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-07-28","episode_number":3,"episode_type":"standard","id":890373,"name":"Dr. Lobotomy, Voodoo Rx, Killed by Kindness","overview":"Egas Moniz chops up living brains to cure mental illness and gets shot for it. Can words kill? A doctor uses the power of mind to save his patient. George Price proves human kindness is an illusion and it drives him to suicide.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-08-04","episode_number":4,"episode_type":"standard","id":890376,"name":"Amnesiac, Party Poopers, Risky Radiation","overview":"Brain surgery creates a perfect amnesiac who can't remember his own life from day to day. A scientist goes to extremes to prove his theory and save lives. A tiny slip while testing the core of an A-bomb releases a blast of radiation.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-08-11","episode_number":5,"episode_type":"standard","id":890378,"name":"Positively Poisonous, Medusa's Heroin, Beauty and Brains","overview":"Fritz Haber feeds the world and murders it with the same technology. Contaminated heroin freezes addicts like statues and the cure uses fetal brain cells. An actress forsees cell-phones and wi-fi but is too beautiful to be taken seriously.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-08-18","episode_number":6,"episode_type":"standard","id":890375,"name":"Creative Evil, Curiosity Killed Dr. Katskee, Bat-Bomb","overview":"The Stanford Prison Experiment, one of the most notorious in the history of science. A doctor takes a lethal dose of cocaine as a medical experiment. A dentist tries to bomb Japan with tiny bombs carried by millions of bats.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[{"character":"Prisoner 043","credit_id":"5f5b3bcb5c324700381d5ffd","order":503,"adult":false,"gender":2,"id":78730,"known_for_department":"Acting","name":"Oliver James","original_name":"Oliver James","popularity":4.705,"profile_path":"/yqfKdEexodXGzZZAPMw2CSpVMXq.jpg"}]},{"air_date":"2012-08-25","episode_number":7,"episode_type":"standard","id":890377,"name":"Tuskegee STD, Do You See What I See?, Cold War Cold Case","overview":"US government experiments illegally on black men with syphilis for 40 years. N-Rays will transform physics in France, if they actually exist. 9 skiers found dead with strange injuries. Was it a quarrel, a secret Soviet weapon, or a yeti?","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[{"character":"Tempalov","credit_id":"5f5b3bd956b9f7003778e730","order":504,"adult":false,"gender":2,"id":78730,"known_for_department":"Acting","name":"Oliver James","original_name":"Oliver James","popularity":4.705,"profile_path":"/yqfKdEexodXGzZZAPMw2CSpVMXq.jpg"}]},{"air_date":"2012-11-21","episode_number":8,"episode_type":"standard","id":890379,"name":"Agent Orange, Ben Franklin: Fraud Slayer, Price of Beauty","overview":"A chemical that speeds up the flowering process of soybeans and was used as a weapon during the Vietnam War is examined. Also: the origins of hypnotism; a deadly beauty treatment.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[{"character":"Frank Geyser","credit_id":"59d1dc5c925141142f03a286","order":500,"adult":false,"gender":2,"id":1465190,"known_for_department":"Acting","name":"Michael Malarkey","original_name":"Michael Malarkey","popularity":12.523,"profile_path":"/731hKJr8wnFf2OEx6wMcAQyO1g6.jpg"}]},{"air_date":"2012-11-28","episode_number":9,"episode_type":"standard","id":890380,"name":"Unabomber, Get the Lead Out, Salvation by Starvation","overview":"Examining a psychological experiment that Ted Kaczynski (aka the Unabomber) underwent during his teenage years. Also: leaded-gasoline poisonings; a look at Russian scientists who protected their work from the Nazis during World War II.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[{"character":"Alter","credit_id":"59d1dd01c3a36878ec039dbc","order":501,"adult":false,"gender":2,"id":1465190,"known_for_department":"Acting","name":"Michael Malarkey","original_name":"Michael Malarkey","popularity":12.523,"profile_path":"/731hKJr8wnFf2OEx6wMcAQyO1g6.jpg"}]},{"air_date":"2012-12-05","episode_number":10,"episode_type":"standard","id":890381,"name":"Remote Control Man, Cadavers for Sale, Einstein's Revenge","overview":"Jose Delgado begins to discover how to electronically control the mind. A doctor at Edinburgh University doesn't ask any questions when two men begin supplying him with fresh human cadavers. Scientist Phillip Lenard leads a vendetta against Einstein.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-12-12","episode_number":11,"episode_type":"standard","id":890383,"name":"Pavlovs Children, Raining Aliens, Glow Girls","overview":"Pavlovian experiments are performed on orphans; red rain that appears to contain biological cells falls in India; a glow-in-the-dark paint used during World War I contains a deadly ingredient.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-12-19","episode_number":12,"episode_type":"standard","id":890382,"name":"Theremin, The Monster Study, Roid Rage","overview":"A musical genius is forced to create the most brilliant piece of spy technology ever. Wendell Johnson turns his own stutter into a research topic, but it takes a twist in when he experiments on orphans. Dr John Ziegler introduces steroids to athletes.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-12-26","episode_number":13,"episode_type":"finale","id":890384,"name":"Magical Jet Propulsion, Missing Link Mystery, Typhoid Mary","overview":"One man combined the occult and rockets to produce the technology that underpinned Mutually Assured Destruction. A skull found in 1912 seems to solve Darwin's puzzle of where we came from. Mary Mallon infects hundreds with typhoid despite being healthy.","production_code":"","runtime":43,"season_number":2,"show_id":43832,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":53115,"poster_path":"/x5B6T1jYVNgUUEDskKhazEKV4wc.jpg","season_number":2,"vote_average":6}}}