{"adult":false,"backdrop_path":"/gp8lGYzOVwhuYgkjM7v3t4sDeAT.jpg","created_by":[{"id":1255673,"credit_id":"61ff99bba2423200b8152a14","name":"Masami Kurumada","gender":0,"profile_path":null}],"episode_run_time":[25],"first_air_date":"2012-04-01","genres":[{"id":10765,"name":"Sci-Fi & Fantasy"},{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"}],"homepage":"https://www.tv-asahi.co.jp/seiya-koga/","id":44317,"in_production":false,"languages":["ja"],"last_air_date":"2014-03-30","last_episode_to_air":{"id":1757146,"name":"The End of the Battle! Become a Legend, Kouga!","overview":"After a long and vicious battle, Kouga and his friends convince Saturn to recognize the value of mankind as he regains his lost memories from when he fought by their side as Subaru. The God of Time then takes his leave and while the efforts to rebuild the Sanctuary and Pallasvelda begin, Kouga and Eden embark on a journey together to find their own place in the world as a new era unfolds.","vote_average":0,"vote_count":0,"air_date":"2014-03-30","episode_number":97,"episode_type":"finale","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/gQ6nVGUTEsVLBtdYU23ugGyBsZ5.jpg"},"name":"Saint Seiya Omega","next_episode_to_air":null,"networks":[{"id":103,"logo_path":"/j3xAzk1SYQQwrQOD7acdSz675Wa.png","name":"tv asahi","origin_country":"JP"}],"number_of_episodes":97,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"聖闘士星矢Ω","overview":"A spin-off based on the Saint Seiya series.","popularity":50.594,"poster_path":"/qjgGUtZsosDehY49oshGU72TwTa.jpg","production_companies":[{"id":5542,"logo_path":"/ayE4LIqoAWotavo7xdvYngwqGML.png","name":"Toei Animation","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"2012-04-01","episode_count":97,"id":53381,"name":"Season 1","overview":"","poster_path":"/ddryifituWlbfTKTkkABx2YygEs.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.866,"vote_count":175,"season_data":{"1":{"_id":"5259675b760ee346619c6e2c","air_date":"2012-04-01","episodes":[{"air_date":"2012-04-01","episode_number":1,"episode_type":"standard","id":892761,"name":"Seiya Saves My Life! Legendary Saint Fighter's Resurrection!","overview":"Athena Saori watches over peace on Earth from Sanctuary and over young Kōga, until an invader causes commotion when he tries to kidnap Athena and the baby. Kōga is saved from certain death by the timely arrival of Gold Saint Seiya, who engages the mysterious invader, who reveals his identity as Mars. A new conflict begins as Seiya and Mars battle for the fate of Kōga, who years later, determined to live his life as he sees fit, challenges Athena.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/9F0giesCoij1jXh56PdTwRZ9rdx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-08","episode_number":2,"episode_type":"standard","id":892762,"name":"Departure! Saints of the new age!","overview":"Kōga is worried over the disappearance of Athena and frustrated for his failure to protect her and his mentor Shaina. Kōga is determined to master his Cosmo to rescue his goddess. Kōga departs to improve his mastery over Cosmo, later meeting Sōma, the Lionet Bronze Saint, who teaches him about the elements of Cosmo. Eventually, Kōga and Sōma are greeted by the challenge of Mantis Ordykia, one of Mars' henchmen, who puts their command over Cosmo to the test, an experience that strengthens their newfound friendship.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/znp8OEswXhZp2l3YrhOeuPBnOwY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-15","episode_number":3,"episode_type":"standard","id":892763,"name":"The Law of the Mask! The Wind Saint appears!","overview":"Kōga arrives to the Palaestra, guided by Bear Geki and his disciple Sōma. There he is greeted by Saint apprentices, who first approach him with hostility. Also, Kōga meets Aquila Yuna, the young female Saint, who teaches him about his constellation and about the code that guides Saint women.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/Adlf5sTW5RciyGwg3oly93ZNSp0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-22","episode_number":4,"episode_type":"standard","id":892764,"name":"The Son of a Hero! Ryūhō versus Kōga!","overview":"Ryūhō, the son of the legendary Bronze Saint Dragon Shiryū returns to the Palaestra after a short absence. The young Saint apprentices are subjected to a strict training to master their Cosmo element. Kōga is later forced to battle Ryūhō in an intense element-to-element duel.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/lyI4a8pETFCcJ2MlVHr712inf0C.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-29","episode_number":5,"episode_type":"standard","id":892765,"name":"Selection Trials! Challenged in the Camp of Death!","overview":"The young Bronze Saints are taken by Bear Geki to the Hell Camp, which is full of lethal traps composed of the elements of Cosmo. Those who survive the Camp are elligible to become Silver Saints. Kōga and Sōma must work together to overcome the obstacles, all while Sōma must avoid fellow Saint Argo's hostility and haunting memories of his past.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/96bNzdsfTOFzEBZVxB6ypx14308.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-06","episode_number":6,"episode_type":"standard","id":892766,"name":"The Curtain Raises! The Saint Fight!","overview":"The Saint Fights tournament begins to much anticipation. The young Bronze Saints engage each other in fierce battles, putting their abilities to the test. Kōga manages to attain his first victory after a tense battle, thanks to Sōma's advice; all while his fellow Saints remain intrigued about the seemingly enormous power of Orion Eden.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/wMhUJNQvRdNYblndVOfAQxBndrf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5259675b760ee346619c6ecd","order":500,"adult":false,"gender":2,"id":122661,"known_for_department":"Acting","name":"Yusuke Numata","original_name":"Yusuke Numata","popularity":5.712,"profile_path":"/cS3ZNEkZepRLyLJ7PPpJ7b2KSp.jpg"}]},{"air_date":"2012-05-13","episode_number":7,"episode_type":"standard","id":892767,"name":"The Fist of a Friend! Hit, Pegasus Meteor Fist!","overview":"The Saint Fights tournament continues. Geki and Kōga bond more while the former teaches the young Saint about the mysteries of Cosmo, and reminisces about his defeat at the hands of Seiya years ago. In the tournament, Yuna triumphs over Delphinus Güney, and Kōga and Sōma are pitted against each other in battle. As both are driven by strong motivations, Kōga draws more strength from the memories of Geki to narrowly achieve victory over his friend.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/4l7XIqYhhRuJn8y88fhYFcknbZG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-20","episode_number":8,"episode_type":"standard","id":892768,"name":"Fateful Meeting! The smashing Gold Saint!","overview":"After his victory over Sōma, Kōga senses a familiar Cosmo approaching, which he recognizes as Athena's. Rushing to meet her, to his surprise, he finds not Athena, but a frail, fearful young girl, whom Capricorn Ionia reveals to be Athena's true self. Ionia also reveals his true allegiance, to Mars, and reveals their plans to a shocked Kōga. After defeating the young Saint, Ionia leaves with the young girl, not before laying waste to the Palaestra, leaving it in ruins. Hours later, Kōga awakens in Mars' Saint Prison, to be greeted by the mysterious Wolf Haruto.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/cPVafxFDlvi1z1YWZLo9lYwVrJH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-27","episode_number":9,"episode_type":"standard","id":892769,"name":"The crisis of Sanctuary! Dash, Ninja Saint!","overview":"The malevolent entity known as Mars invades Sanctuary, accompanied by Capricorn Ionia and the young girl they claim to be the new Athena. Mars then completely obliterates the millenia-old Sanctuary, replacing it with his very own fortress. Meanwhile, Kōga manages to escape the Saint Prison with the help of Wolf Haruto, and after rejoining the other Bronze Saints, they set off together to invade Mars' headquarters, to rescue the young girl and to learn about the whereabouts of the true Athena","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/1YdFO36OUSHr1TkFX5BSfipcy2d.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-03","episode_number":10,"episode_type":"standard","id":892770,"name":"Suicidal rescue! One more Gold Saint!","overview":"The young Bronze Saints bravely invade Mars' Babel Tower, and succeed in rescuing the girl he claims to be Athena. She reveals to Kōga that her name is Aria. Sensing a threat approaching, Kōga dispatches Yuna along with Aria to avoid being recaptured, and together, the young Saints try desperately to buy time for their escape by facing the seemingly invincible Leo Mycene. In their darkest hour, a memory of Seiya deep in Kōga's heart brings them hope.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/yfPtoyANvbUsMnkPQRqeXBR6NCs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-10","episode_number":11,"episode_type":"standard","id":892771,"name":"Protect Aria! The Attack of Sonia, the Pursuer!","overview":"Yuna arrives with Aria to a small town. In Babel, Mars send Sonia (the Highest Martian), The Crow and Miguel of the Hound (Silver Saints) after them. Miguel guides the bad gang to the town where Aria and Yuna are in a church. Aria is left hidden and Yuna goes to fight. Right when Sonia is about to kill Yuna, one martian arrives asking Sonia to go back to Babel for a meeting of Mars with all the Saints. It is revealed that she killed Soma's father. She leaves and the Crow is beating Soma and Yuna. Koga save them and help Yuna to deliver a fatal blow on Crow. In Babel: Yuna, Soma, Koga, Ryuho and Haruto are blamed for Santuary destruction and taking Athena apart. So all the Saints are looking for them.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/xen3SMI4r1ZIanZvTTwpyC6JtWf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-17","episode_number":12,"episode_type":"standard","id":892772,"name":"The Inherited Cosmo! Shun, the Legendary Saint!","overview":"Kōga and friends continue their trek to take Aria to safety, when they're surprised by the attack of Hound Miguel. Overpowered by the merciless Silver Saint, the lives of the Bronze Saints are saved by the timely arrival of Andromeda Shun, the Saint of legend. Shun takes the youngsters to his village to rejoin Ryūhō, afterward they're once again attacked by Miguel, whom they manage to defeat after a fierce battle. Later, the young Saints leave Shun's village to continue their mission.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/a12yKvHTcFeybmpinKLPRxOPQiw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-24","episode_number":13,"episode_type":"standard","id":892773,"name":"Seiya's Message! To you, I entrust Athena!","overview":"Kōga and his friends continue their trek escorting Aria, until they come to a enormous whirlwind blocking their way. Meanwhile, Mars reveals his plans for his Tower that he deems the new Twelve Zodiac Temples, to his daughter and son, Sonia and Eden. A moribund Athena is also revealed by Mars, held hostage inside his tower. The young Saints decide to brave the whirlwind, managing to find a way inside it with the help of Yuna's command over wind. The traitorous Musca Fly tries to steal Kōga and Yuna's Cloths, only to be defeated in a fierce battle. Weary and alone, the young Saints find a new light of hope in the Pegasus constellation, which reveals a message from the legendary Seiya: \"To you, I entrust Athena!\"","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/sbIG3klDAmGkAjK1mDn7Qv2DRx0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-01","episode_number":14,"episode_type":"standard","id":892774,"name":"Reunion in My Homeland! Mentor and Disciple Duel in the Snowfields!","overview":"The Bronze Saints reach a snow-covered land, which causes Yuna to reminisce about her days as a Saint apprentice and her mentor, the kind Peacock Pavlin. Sensing her mentor near, Yuna rushes to her encounter, only to realize Pavlin's allegiance is to Mars. Disciple and master engage in a fierce duel, later Yuna realizes it was Pavlin testing her, as her mentor reveals she is truly loyal to Athena Saori, and informs Yuna she is still alive and being held hostage by Mars. As Yuna prepares to rejoin her fellow Bronze Saints, both female Saints are surrounded by traitorous Silver Saints. Pavlin stays behind to cover Yuna's escape, seemingly losing her life.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/eySmVvz1Mqmq6nW3yvAR826WBkv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-15","episode_number":15,"episode_type":"standard","id":892775,"name":"The Poisonous Fangs Approach! The Second Ruins Surrounded by Intrigue!","overview":"The episode begins with our heroes walking through the woods as we find they are looking for the Earth Cosmo Core. Haruto appears, informing them that there is a town in front of them and a visitor behind them before he disappears once more, despite them asking him to stay. The \"visitor\" turns out to be Ichi, the older Saint from Palestra that was never able to use his powers correctly, and since that time the bronze saints found some surprises along the way.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/yejDqCjZClVjuj13msWDZ0WbOMZ.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Storyboard Artist","department":"Art","credit_id":"637e66fdfa404600b277caf1","adult":false,"gender":2,"id":1083453,"known_for_department":"Directing","name":"Masahiro Hosoda","original_name":"Masahiro Hosoda","popularity":3.577,"profile_path":null}],"guest_stars":[]},{"air_date":"2012-07-22","episode_number":16,"episode_type":"standard","id":892776,"name":"At the Star of Destiny's Side! The Way of Living of a Saint!","overview":"Resuming their journey, the Bronze Saints eventually are tracked down by a small cadre of Martians. Running away from them to protect Aria, the teenagers reach a small but lively city, where Yuna fails to purchase a ship ticket as her purse fell during their escape. In order to rise money for ship fare, the Saints eventually find a job thanks to a kind old man who takes them to his wife's restaurant, where the youngsters prove they are not up to the challenge, much to the woman's chagrin. Later, the Martians are able to find the Saints and a fierce battle ensues. After achieving victory, the young Saints receive a resounding ovation from the crowd, and are given another chance at the restaurant.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/9NkCuCMMLqii9u3KtfZuVSna1Nt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-29","episode_number":17,"episode_type":"standard","id":892777,"name":"Protect Them! The Cloth Repairer and the Legendary Ore!","overview":"The Bronze Saints arrive to a desert area, in which they meet a young girl from the people of Jamir, called Raki, who at first attacks them. After realizing they are Saints, by tradition connected to the people of Jamir, Raki takes them through a shortcut to avoid the desert areas, only to be greeted by the challenge of Kerberos Dorie, who seeks to capture Aria. Managing to defeat Dorie after a difficult battle, the Bronze Saints resume their journey, bidding farewell to their young benefactor, who later is joined by her mentor, Appendix Kiki, the former apprentice of the legendary Aries Mu, now a young man, who realizes the Bronze Saints are the new embodiment of hope in this era.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/uDeEseFNhokucLSDkkaHSa59Yh7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-05","episode_number":18,"episode_type":"standard","id":892778,"name":"The Flames of Revenge! Sōma, The Battle of Destiny!","overview":"The Bronze Saints reach the Fire Ruins where Sonia finally comes across the murderer of his father, Hornet Sonia. Souma engages in a giant battle with her but his anger continues to lose his own focus and is unable to hit her. The battle proves fruitless until Koga manages to convince him to control his emotions. This allows Souma to finally hurt Sonia for real and she escapes beaten. After stopping the ruins, Souma realizes that he cannot stay with the team until he has settled things with Sonia and departs on his own.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/w1ang9JSX29tolcFx2jtSTMemPI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-12","episode_number":19,"episode_type":"standard","id":892779,"name":"The secret of the Five Old Peaks! Pass it down, Father, the fighting spirit of Shiryū!","overview":"After Sōma's fateful battle, the Bronze Saints reach the famed Lushan fairylands in China, and are rejoined by Dragon Ryūhō. Shortly afterward, the teens suffer the assault of the ferocious Perseus Mirfak, who turns them to stone, with the exception of Ryūhō, who barely manages to defeat Mirfak, repeating the miraculous feat his father performed years ago, against Perseus Algol. Continuing their journey, the Saints tresspass the Lushan waterfall with the help of the Libra Gold Cloth, only to be greeted by the challenge of a mysterious young man named Genmu, who takes the Libra Gold Cloth as his rightful heirloom, as he reveals himself to be the Libra Gold Saint.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/mw3BBmTLWc58RNIDr0jRjtUSsea.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-19","episode_number":20,"episode_type":"standard","id":892780,"name":"For Aria's sake! Eden's Wrathful Lightning Strike!","overview":"Learning of Souma's defeat, Eden leaves the Sanctuary in order to find Aria himself. He eventually manages to track down Aria, who is accompanied by Kouga and Yuna. After easily defeating Yuna, Eden and Kouga have their long awaited fight. However, the Orion Bronze Saint easily dominates the battle despite Kouga's best efforts. Not wanting to see her friend hurt, Aria allows Eden to take her away.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/uYrAaX3vxRQr1kncTLn1e9mHW4I.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-26","episode_number":21,"episode_type":"standard","id":892781,"name":"The Flightless Pegasus! The Journey of Forfeit!","overview":"Eden takes Aria away, and Aquila Yuna and Pegasus Kōga resume their journey, demoralized by their failure to protect their friend. Along the way, Yuna and Kōga separate, meanwhile Eden and Aria reminisce about the happy days they shared during their childhood. Kōga later meets a young man who first mocks his weakness, luring the teen Saint into a fight. Kōga later realizes the man to be the owner of an immense Cosmo, and turns out to be Cygnus Hyōga, one of the legendary Saints who protected Earth from great menaces many years ago. Hyōga manages to teach Kōga that to reach the true potential of his Cosmo, he must first believe in himself. After learning Hyōga's lesson, Kōga rejoins Yuna and both resume their way with renewed resolve.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/gTxHa7a5HBEfAKQN2CHZbt2tVHJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-02","episode_number":22,"episode_type":"standard","id":892782,"name":"Thoughts of a Friend! The Way of the Ninja and the Pride of a Saint!","overview":"Haruto, accompanied by Ryuhou, journeys to his home village in an attempt to come to terms with his past and regain his resolve. While there, Ryuhou learns that Haruto became a saint in order to follow the footsteps of his good friend and older brother figure Yoshitomi, the previous Wolf Saint. Yoshitomi had apparently been murdered by a masked silver saint in front of Haruto and the boy had been desperate for answers ever since. Haruto's fater, despite his disapproval of Haruto becoming a saint, helps him gain back his fighting spirit by staging an assassination attempt on his son's life.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/nxeyy8OxELDTv327CzszrvYrbuu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-09","episode_number":23,"episode_type":"standard","id":892783,"name":"Invading the Enemy Camp! Young Saints, Together Again!","overview":"The young Bronze Saints decide to invade Mars' stronghold to rescue Aria. The teenagers carry out their plan, finding strong opposition in the enemy lines. During a moment of desperate need, the Bronze Saints receive the assistance of Lionet Sōma, who rejoins them, stronger than before, thanks to further training under Unicorn Jabu, the Bronze Saint. The Saints reach Aria's chambers, only to find she has left. Not all is lost, as Sōma is able to retrieve the Southern Cross Cloth's Clothstone, which belonged to his father Kazuma, after defeating Hornet Sonia, his killer.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/nmrh56ZyHG2OOzWVYo3dEMPpMJg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-16","episode_number":24,"episode_type":"standard","id":892784,"name":"Aiming for a Reunion! Let's Go to the Last Ruins!","overview":"Knowing of Aria's whereabouts, the Bronze Saints set off to invade the final ruins, followed by Ophiuchus Shaina, who joins them. Before parting, Shaina reveals to Kōga the secret of his origin, as well as Aria's. Inside the ruins, the Bronze Saints face the threat of powerful Silver Saints, while Kōga engages Orion Eden to free Aria. Shaina takes Aria and with her help, they are able to vanquish Mars' dominion over the area. As Mars' power vanishes, the ruins crumble, and the bronze Saints realize Mars' dark power is emerging from the debris of the structure.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/pmH3Ngc10GOM0yPZVreTuSMnb9E.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-23","episode_number":25,"episode_type":"standard","id":892785,"name":"Unknown Territory! The Moment of a Chance Meeting!","overview":"Yuna, Ryuuhou and Haruto are transported to an unknown dark place and eventually reach a door, which they touch and are all transported to a world of memories. Yuna is on her hometown with her childhood friend before the war, Ryuuhou is on his childhood on Palestra along with his then friend Lynx Mirapolos and Haruto faces his own brother Yoshitomi. All three realize the world they are in is an illusion created by the darkness in their hearts and are at first hesitant to battle, but manage to overcome the darkness and reach the Core of Darkness.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/n3j9zHuRWykijG1iScUkTK8VvY5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-30","episode_number":26,"episode_type":"standard","id":892786,"name":"Reminiscences and Revenge! The Trap of the Ruins of Darkness!","overview":"Souma and Sonia are entrapped in an illusion of their past when Souma's father Southern Cross Kazuma was alive. Sonia is revealed to have been ordered by Medea to kill the Silver Saint for he was an open leader against the Martians. Hesitant on her mission she departs and faces Kazuma, as Souma also witnesses the past event. Sonia is first easily pushed away by Kazuma who tells her that her fists are made to protect those she care for, but when she thinks of her family, Sonia bursts into a rage and stabs Kazuma from the back. It is revealed then that after the murder,...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/pRbcjk7ZkI1VKfq8c88qKGPMTCB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-07","episode_number":27,"episode_type":"standard","id":892787,"name":"The End of the Journey! The Light of the Girl and the Youths!","overview":"Eden sees his own darkness as Aria is constantly being used by Mars without the power to do anything about it, before being confronted by his parents about his destiny for the new world. Accepting whatever punishment that would be suitable for his errors, Eden allows himself to succumb to his darkness. Meanwhile, tormented by her own darkness of being used as an instrument of destruction Aria resolves to use her Light to protect those who need her, in doing so she reaches both Eden and Kouga from their darkness and all reach the Core of Darkness. Aria then along Kouga...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/s60k9isBOos2kUxV3EyMM0uzUlL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-14","episode_number":28,"episode_type":"standard","id":892788,"name":"The Strongest Army! The Gathering of the Gold Saints!","overview":"The episode is just a summary of all the events that have happened thus far from Koga's birth to Aria's death at the hands of Mar's","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/oa8EEtBwbqoH4LiZx5IaMJQfloL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-21","episode_number":29,"episode_type":"standard","id":892790,"name":"The Beginning of a New Battle! The Zodiac Temples!","overview":"After briefly mourning the death of Aria, the Bronze Saints prepare to enter the Twelve Zodiac Temples. They are greeted by Aries Kiki, who explains the situation and how they are to proceed. Taking him for an enemy, Kouga attacks Kiki, to what he responds by restoring the Pegasus Cloth and also revealing to them the crucial secret of the Seventh Sense. Realizing Kiki is not an enemy, Kouga proceeds to the Temple of the Golden Bull, where he is challenged by its guardian, Taurus Harbinger, and a deadly battle ensues. Meanwhile, Kiki restores the remaining Cloths, and stays behind the teenagers, to battle alone against a large group of Martians.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/uWg36u3ltH45dwwbg7SP7XHSBqe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-28","episode_number":30,"episode_type":"standard","id":892789,"name":"Wondrous Power! The Taurus Saint!","overview":"After the defeat of Kouga at the hands of Harbinger, the remaining Bronze Saints engage him in battle, meeting with utter defeat. Harbinger reminisces about his difficult childhood and what drove him to a life of violence, to become the strongest and eventually a Gold Saint. Managing to recover after witnessing the defeat of his comrades, Kouga attacks Harbinger with a single blow imbued with all the power of his Cosmo. Much to his surprise, Harbinger emerges unscathed and his comrades have vanished.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/i41AYmvsc6aiBD4I2lr2WCZxIVN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-04","episode_number":31,"episode_type":"standard","id":892791,"name":"The Crossroad of Fate! The Enigma of Gemini!","overview":"Dragon Ryuhou arrives to the Temple of the Twins, being greeted by a strange, peaceful atmosphere and talking animals. Gemini Paradox, the guardian of the temple, gently welcomes the young Saint and exposes to him her motives for her allegiance to Mars, and reminisces about her past. Disagreeing with Paradox's amoral perspective, Ryuhou engages her in battle, managing to overpower the gentle Paradox. Much to his surprise, she emerges full of hate and with no trace of her previous loving personality. Meanwhile, Aquila Yuna arrives to the Cancer Temple.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/tOapqsnHz3cG5LJPWjLs10j0USA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-11","episode_number":32,"episode_type":"standard","id":892792,"name":"The True Terror! The Unearthly Atmosphere of Cancer!","overview":"Yuna arrives at the House of Cancer, and she is greeted by the deathly atmosphere of the gates of Praesepe. The guardian of the House, Cancer Schiller, engages her in battle, reminiscing about his past and motives for his allegiance to Mars. Aiming for Yuna's utter defeat, Schiller tries to break her morale by toying with her psyche, having Yuna fight her deceased friends Arné and Komachi. Meanwhile, Kouga continues his battle with Harbinger. After another clash between the two Saints' greatest techniques, Kouga heads towards the exit. Admiring his determination, ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/jSfJ3hD1anosvhthJ91I8AcWsuq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-18","episode_number":33,"episode_type":"standard","id":892793,"name":"The Essence of Cosmo! The Seventh Sense!","overview":"Koga arrives at the Gemini Temple. He and Ryuhou join forces in order to defeat Gemini Paradox. Despite their best efforts, the two of them are outclassed by the more experienced warrior, especially when her darker half comes out to fight. Incensed by Paradox's selfish nature, Ryuhou manages to awaken the Seventh Sense and pull out a desperate win at the last minute. Ryuhou and Kouga the head off to the Cancer Temple.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/zlrQjUh6uOMsb8vh38igaxvP0RP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-25","episode_number":34,"episode_type":"standard","id":892795,"name":"The Threshold Between Life and Death! The Battle of the Underworld!","overview":"Because of Schiller's Praesepe Underworld Waves, Yuna leaves the earthly plane and finds herself in the deathly Hill to the Land of Spirits. Terrified by the sight of the souls of the deceased and visions of her sordid past, Yuna cowers until the arrival of Kouga, who suffered her same fate, and losing his temper due to Schiller's mockery of Aria's death, Kouga is consumed by the Darkness Cosmo inside him. Managing to calm down Kouga, Yuna engages the Cancer Gold Saint in battle once again, and drawing from her bonds to Aria and her comrades, she finally finds the ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/9TxpSKrDqgM21nFO8vVtqdHsvgn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-02","episode_number":35,"episode_type":"standard","id":892794,"name":"The Fist of the Lion! Eden's Sorrowful Battle!","overview":"After Cancer Schiller's defeat, the Bronze Saints prepare to proceed further into Sanctuary. Meanwhile, Orion Eden reminisces about his late friend Aria. The grief-stricken Bronze Saint begins to question Mars' motives and their legitimacy, going as far as to challenge his master Leo Mycenae because of his loyalty to Mars. Mycenae and Eden engage in unequal combat to prove their conviction.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/oZnTFFGmyTnk6h5LjxuZvo8kjXH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-09","episode_number":36,"episode_type":"standard","id":892797,"name":"Sublime Pride! Mycenae's Kingly Fist!","overview":"After leaving Eden, Mycenae returns to guard his House, where Haruto and Souma arrive promptly. The young Saints find themselves to fight their way through the House of Leo, but the ferocious Mycenae proves to be an almost impossible foe to overcome, even when the two teenagers fight him together and neutralize his King's Roar technique. When he unleash his King's Emblem, Haruto risks his life by stopping Mycenae's final attack. Souma retaliates with a Lionet Bomber powerful enough to crack one of the shoulder pads on his Gold Cloth. The fierce determination of the ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/7WPGUKidzoGkd0C819rP9JiZf8N.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-16","episode_number":37,"episode_type":"standard","id":892796,"name":"Steadfast Guardian! The Gold Saint of Virgo!","overview":"Upon arriving at the next temple, Haruto and Souma are confronted by Virgo Fudo, a gold saint whose cosmos surpasses that of all the Gold Saints in the earlier temples. Yuna, Kouga, and Ryuhou join the battle in time to save their friends from a crushing defeat. But even the combined powers of the five Bronze Saints is no match for Fudo. When all hope seems lost, Eden arrive at the last minute and protects them from one of Fudo's techniques.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/2AtbxF0iRUwf8a6SHaUDMMX9BjG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-23","episode_number":38,"episode_type":"standard","id":892799,"name":"The Heroic Betrayal! Eden's Determined Fighting Spirit!","overview":"Eden takes over the fight against Fudo after blasting Kouga and the others out of the Virgo Temple. Following a desperate battle, Eden manages to defeat the Virgo Gold Saint when he awakens the seventh sense. At the same time, the other Bronze Saints attempt to use the opening he gave them to go to the Libra Temple. Unfortunately, they are confronted by Tokisada, the new Aquarias Gold Saint and the man who killed Haruto's brother. His apparent ability to control time makes him a powerful adversary and Kouga is defeated with little effort.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/zKNgbomWzMG1lqWBJwq7k335rm8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-06","episode_number":39,"episode_type":"standard","id":892798,"name":"Reunion in Libra! Clash, Gold vs. Gold!","overview":"Libra Genbu interferes in the battle between Tokisada and the Bronze Saints, teleporting everyone to his temple. To the shock of the Bronze Saints, Genbu takes over the fight and declares his loyalty belongs to Athena, to Saori Kido. While Tokisada is a powerful warrior, Genbu wins the fight. In a desperate gamble, Tokisada attempts a powerful technique to take the Bronze Saints with him but only manages to suck in Ryuho and Haruto. Koga, Souma, and Yuna proceed to the next temple with Genbu's blessing.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/hM3Gc7zDRbO3mJ5jxcZoqEAJrnx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-13","episode_number":40,"episode_type":"standard","id":892800,"name":"Sonia's Resolution! The Chain of Fate Is Broken!","overview":"Souma and Sonia, who has been given the Scorpio Gold Cloth by Medea, engage in their long awaited final battle at the Scorpio Temple.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/pDBJt1eDZACZd1qKh8iniPhZBIu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-20","episode_number":41,"episode_type":"standard","id":892804,"name":"Tokisada's Ambition! The Champion Beyond Time!","overview":"Eden arrives at the House of Scorpio, watching Souma right next to Sonia's body. Souma apologizes to Eden before moving to catch up with Kouga and Yuna. Meanwhile, Haruto and Ryuuhou awaken at the End of Time, finding themselves confronted by Tokisada, whose time-manipulating powers have regained their strength after his fight against Genbu. From the moment the battle begins, Tokisada easily gains the upper hand against the two Bronze Saints' combined strength. At the same time, Kouga and Yuna reach the House of Sagittarius, supposed to be protected by Seiya. Upon ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/fFuf2JAwLqu09mUAXG4iQLYRAym.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-27","episode_number":42,"episode_type":"standard","id":892807,"name":"The Traitorous Gold Saint! Ionia versus Kouga!","overview":"Kouga and Yuna reach the House of Capricorn where they meet Ionia and learn from him his reasons for betraying Athena. Kouga attacks the former Headmaster of the Palaestra, but is once again immobilized by his Domination Language technique, and his Darkness Cosmo is brought out. Before Yuna is able to help Kouga keep the Darkness Cosmo at bay, Ionia buries her in a rubble of books, facing Kouga alone. However, after succeeding to repress the Darkness Cosmo in his heart, Kouga awakens his Seventh Sense and finally kills Ionia with the legendary Pegasus Comet Punch.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/nTKBnZnUhugJkjKnx0aUlhniS5W.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-03","episode_number":43,"episode_type":"standard","id":892805,"name":"Resurrection of the War Gods! Break Into the Last Temple!","overview":"The Bronze Saints finally arrive to the House of Pisces, guarded by the ruthless Amor. After separating Kouga and Yuna from the others, Amor summons Mars' strongest warriors, the Four Heavenly Kings to fight the others. While stating that the Heavenly Kings are stronger than the Gold Saints, Amor immobilize Yuna, forcing her to watch her friends being attacked without resisting. Kouga, the only one capable of attacking, is restrained by Amor's Arrested Judgement, a special attack that can only be broken by Darkness Cosmo as part of Medea's plan to have him unleash the...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/3kwaOn4Y0l33rLNJJvdWQZqqntR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-10","episode_number":44,"episode_type":"standard","id":892809,"name":"For My Friends! The Hidden Power in Koga!","overview":"Kouga defeats one of the Heavenly Kings in one hit before he manages to once again keep his Darkness Cosmo due to him having reached his Seventh Sense earlier and Yuna calling out to him. Sending him ahead, Yuna engages Amor while Souma, Ryuuhou and Haruto engage the remaining three Heavenly Kings, using the last bit of strength they have left in order to finally defeat them. Leaving the rest to Kouga, they collapse to exhaustion. Amor decides to fight Yuna, but is interrupted by Eden who has arrived as well. Following a short fight, Yuna asks Eden to go onward and ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/uxsqAeIZFe8G3VaimNHr9j0a6jp.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"6031562d6e3deb003e0929a1","adult":false,"gender":2,"id":2859897,"known_for_department":"Visual Effects","name":"Takuro Shinbo","original_name":"Takuro Shinbo","popularity":0.988,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-02-17","episode_number":45,"episode_type":"standard","id":892808,"name":"The Malevolent War God! Mars and Ludwig!","overview":"Kouga finally reaches Mars' location, determined to stop him. As the War God deflects his attacks and counterattacks, Eden arrives in time to save Kouga. Mars then reveals to the true story from the days when he was known as Ludwig, a normal human who sought revenge for the death of his beloved wife, Misha. He deflects Eden's attacks before removing his mask, revealing himself as a human no longer.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/jNkGgm26Wf1Y9iPrwfg24WSUYaz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-24","episode_number":46,"episode_type":"standard","id":892806,"name":"Koga and Eden! Young Cosmo, Slay the Darkneess!","overview":"Sending Kouga ahead Eden awakens his Seventh Sense and challenges Mars, immobilizing him with his Cosmo. Eventually, while Kouga struggles to retrieve Aria's staff at the top of the Sanctuary, Mars breaks free and grievously wounds Eden, temporarily defeating him. Pursuing Kouga, Mars easily shrug off any attack from the Pegasus Saint until Eden finally catches up to the two. Bringing their Cosmos to the limit, Kouga and Eden finally defeat Mars together and have Ludwig return to his senses. However, just as Ludwig is about to retrieve Aria's staff to prevent Earth's ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/zRt8xPWboIJwQOgUlftXMsC7A1a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-03","episode_number":47,"episode_type":"standard","id":892803,"name":"The Only Hope! A New Battlefield!","overview":"As Earth's Cosmo is transferred to planet Mars, Medea drains the darkness Cosmo from Ludwig's body and transfers it to Amor, before she departs to Mars. After revealing all the suffering and prejudice he has suffered along with his sister during his childhood, Amor attacks Kouga. Eden joins Kouga against him, but when Amor transfers the battlefield to Mars, where his powers are increased to the same level as Mars possessed, Kouga finds on it an opportunity to retrieve Aria's staff and stop Earth's destruction.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/5cViPAjq02OF64seCLPYfNr6WtY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-10","episode_number":48,"episode_type":"standard","id":892802,"name":"Gather Friends! Koga's Overflowing Cosmo!","overview":"After infusing the Darkness Cosmo in Kouga's body, Amor finds out that he was betrayed by his sister from the beginning and swears to kill everyone including her, knocking out Eden in the process. Meanwhile on the Earth, Kiki, Harbinger, Fudo, and Genbu use their Cosmos to send Kouga's friends to Mars. As he finally reunites with Saori, Kouga is overcome by the Darkness Cosmo and possessed by the God of Darkness, Abzu, who kills Amor in one single blow. As the possessed Kouga now proceeds to kill Athena with his own hands, his friends try to have him return to his ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/9rC4zo8qcSuYgd2Uoa0rK9ojE8e.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-17","episode_number":49,"episode_type":"standard","id":892801,"name":"The Ruler of Darkness! The Terror of Abzu!","overview":"Eden tries to stop Abzu with no success until he gets the chance to obtain Aria's staff to confront him. Medea tries to dissuade him, but he refuses to comply and reclaims the staff by force. With Kouga's friends failing to get him back to normal despite everyone awakening their Seventh Sense, Eden eventually returns with the staff to the battle, just to find it destroyed by Abzu. Just as Eden is about to be dealt the final blow by the God of Darkness, Medea stands to protect her son, sacrificing herself for him. However, Eden is still dealt a heavy attack while the ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/73MgdAyssJNAo6bvhAhNySW4A3S.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-24","episode_number":50,"episode_type":"standard","id":892819,"name":"Take it to Seiya! The Wish of the Young Saints!","overview":"Yuna, the only one left standing after Abzu's terrifying onslaught against Kouga's friends, is encouraged by Athena to fight against Abzu in order to bring Kouga back. However, all her attempts fails, gaining her darkness wounds for each attempt. Just then, the fragments of Aria's staff combined with Kouga's friend's Cosmos awaken Seiya, who has been trapped in the depths of the red planet all this time, waiting for a chance to stop Abzu's plans. The Gold Saint confronts Abzu and manages to drive him from Kouga's body with aid from Yuna. The God of Darkness then flees...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/ho2rQQ6NGz2DD3c05Xyz36jfB4S.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-31","episode_number":51,"episode_type":"standard","id":892813,"name":"Shine, Koga! The Final Battle Between Light and Darkness!","overview":"Abzu tries to have Kouga under his control once more with no success and his attempts to kill Saori are stopped by his desperate efforts. Once feeling the radiance of his Cosmo, Kouga's friends send the last of their energies to assist him. Infused with the power of his companions and protected by Aria's light, Kouga manages to rescue Saori and destroy Abzu for good. As Earth regains the Cosmo that was siphoned from it, the planet returns to normal and the corruption that has spread into the Saints' bodies is washed away. After a brief encounter with Aria's spirit, ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/o9Cod9BzMNewPxUmnMAAFUyxCBT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-07","episode_number":52,"episode_type":"standard","id":892810,"name":"A New Cloth! Fly, New Pegasus!","overview":"One year after the defeat of Abzu, peace has returned to the world. However, a new threat rises with the advent of Pallas, an old enemy of Athena. Despite knowing that, Seiya can't find the resolve to kill the young Pallas as she is still an innocent child although she is destined to eventually come after Saori's life. Meanwhile, Kouga, training while still recuperating after his battle against Abzu, meets Subaru, a Steel Saint who is eager to challenge him in order to become a God. However, Kouga refuses to fight him and claims that with the world in peace and his ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/r7d3XhG42U63Z7ylOy1yPyuZQhI.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5ab1b4b29251411642000472","adult":false,"gender":2,"id":1057579,"known_for_department":"Directing","name":"Tatsuya Nagamine","original_name":"Tatsuya Nagamine","popularity":4.89,"profile_path":"/hiSUYqVI52RDFyaUPzfR85fQKZg.jpg"}],"guest_stars":[]},{"air_date":"2013-04-14","episode_number":53,"episode_type":"standard","id":892817,"name":"The Reunion! Souma, Let Your Spirit's Flame Burn!","overview":"With the Gold Saints protecting Athena and the Silver Saints looking for clues about the new enemies, Koga is instructed by Seiya and Saori to assemble the other Bronze Saints. Followed by Subaru, Koga encounters with Souma at the Palaestra, where he is working as a substitute teacher. However, when the Tertiary Pallasite Loge, a master of spear combat appears at the Palaestra, Koga, Souma, and Subaru must work together to protect the students.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/263VJxn7s4Y5bPI9e2HPl0OUjAL.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"6031562d6e3deb003e0929a1","adult":false,"gender":2,"id":2859897,"known_for_department":"Visual Effects","name":"Takuro Shinbo","original_name":"Takuro Shinbo","popularity":0.988,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-04-21","episode_number":54,"episode_type":"standard","id":892818,"name":"Strengthen my Courage! Cloth, be Reborn!","overview":"Souma, Koga, and Subaru travel to meet Kiki and Raki in order to have Souma's cloth fixed. Yuna arrives there first, but upon having her cloth restored, she finds herself unable to use it and Kiki claims that it is due to her indecision that is wavering her Cosmo. However, when Raki is attacked by two Tertiary Pallasites, Yuna finally gains the resolve to awaken her new Aquila Cloth and fight once more as the Aquila Saint with the help of Souma in his new Lionet Cloth.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/p6pbWozn4t07cfeQy6DhHXSO86Q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-28","episode_number":55,"episode_type":"standard","id":892821,"name":"The Irreplaceable One! Dragon, Awake!","overview":"Unaware of the advent of the Pallasites, Ryuhou believes that there is no reason to fight anymore and wants to return the Dragon Cloth to his father Shiryu, whose senses were restored, and live peacefully with his family. Meanwhile, Koga and the others learn that a Pallasite is after Ryuhou and rush to assist him, but when Ryuhou finds himself struggling to protect his mother Shunrei from the enemy, his renewed determination awakens his true power as the Dragon Saint and the new Dragon Cloth.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/6dkYrDMaMFZlHgZv3YSsmNAWNoV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-05","episode_number":56,"episode_type":"standard","id":892811,"name":"Resound in my Heart! Haruto's Shout!","overview":"With Yuna, Souma, and Ryuhou leaving ahead to the Sanctuary, Koga and Subaru look for Haruto in Japan and find, much to their surprise, that he is now a singer in a rock band. Haruto rejects Koga's pleas to return, claiming that to him, his music is now more important than being a Saint. However, during a concert, Haruto watches Koga and Subaru being attacked by some Pallasites, and to protect his friends and his fans, he dons his brand new Wolf Cloth to join the battle.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/ys6keccj4AjUbIeqj1sZyihDnNi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-12","episode_number":57,"episode_type":"standard","id":892816,"name":"Defeat Pegasus! Eden, the Warrior of Solitude!","overview":"Koga and Subaru are sent by Shina to investigate the disappearance of a Silver Saint. Upon finding their missing companion, they are approached by the Secondary Pallasite Europa and the Tertiary Pallasite Thebe and learn, much to their surprise that Eden is now working with them as a Tertiary Pallasite, with the promise of having Aria and the rest of his family revived. With orders to kill Koga, Eden attacks him mercilessly until Thebe decides to intervene and the Orion Saint reveals his true intentions as well as his new Orion Cloth.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/opqGJancUI8xDXFVFUmU87ZWlDC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-19","episode_number":58,"episode_type":"standard","id":892823,"name":"The Four Great Kings Arrive! Athena vs. Pallas Complete Showdown!","overview":"Ryuhou, Souma, and Yuna arrive to a village whose survivors of the Pallasite Halimede's attack are under Shun's protection. Among them is Ray, a child whose brother was also frozen by Halimede and blames Shun for it. Halimede instructs Ray to steal the Andromeda Cloth Stone from Shun with the promise of having his brother return to normal, but when the enemy intends to kill both, Shun brings the power of his cloth to the next level.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/573bcUvTQcTwBcfrnyOXerRqvxE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-26","episode_number":59,"episode_type":"standard","id":892822,"name":"The Bond between Brothers! Andromeda Shun Joins the Battle","overview":"Ryuhou, Souma, and Yuna arrive to a village whose survivors of the Pallasite Halimede's attack are under Shun's protection. Among them is Ray, a child whose brother was also frozen by Halimede and blames Shun for it. Halimede instructs Ray to steal the Andromeda Cloth Stone from Shun with the promise of having his brother return to normal, but when the enemy intends to kill both, Shun brings the power of his cloth to the next level.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/p6eYZNnqWXpiSyI4IFVp88pDbe5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-02","episode_number":60,"episode_type":"standard","id":892820,"name":"The Star of Steel! Subaru, Embrace your Fighting Spirit of Steel!","overview":"The Steel Saints training facility is stormed by the Pallasites led by Hati. Koga and Subaru arrive soon after and they learn that the residents had previously evacuated with former Bronze Saints Ban and Nachi. While investigating, Koga learns about Subaru's origins from his fellow Steel Saint Erna, and it is revealed that among the Steel Saints, Subaru has the strongest Cosmo, and that one day he may find his own Guardian Constelation and become a proper Saint.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/wMoKaG10yDaBNRDEzFX71Pkeyey.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-09","episode_number":61,"episode_type":"standard","id":892812,"name":"A Great Army Approaches! The Battle to Defend Palaestra!","overview":"Koga and Subaru return to the Palaestra which is full of refugees from the villages attacked by the Pallasites and rendezvous with their friends. Genbu approaches the Bronze Saints and, noticing how much their cloths are damaged, reprimands them for relying too much on them instead of their own abilities. When a large enemy force led by the secondary Pallasite Aegir surrounds the Palaestra, Genbu decides to face it head on by himself, while taking the opportunity to share with Koga and the others what he has learned from his teacher, the previous Libra Saint.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/cU17iRNeXTy3EHrmrW51PXyeDOW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-23","episode_number":62,"episode_type":"standard","id":892815,"name":"Genbu's Deadly Battle! Excalibur vs. the Sword of Libra","overview":"Aegir fails to defeat Genbu by himself and the Primary Pallasite Hyperion lends his own sword to assist him. Overwhelmed by the massive Cosmo flowing from the sword, the Gold Saint decides to forfeit his own life in an attempt to destroy it.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/llyF72OnsSLz6zQNQekttudgF7M.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-07","episode_number":63,"episode_type":"standard","id":892814,"name":"Seiya, Head to the Frontlines! Athena's Decision!","overview":"As the Saints mourn Genbu's death, Hati appears to resume the assault on the Palaestra until Seiya and Athena appear to drive the enemies away. Having finally decided to confront her sister, Saori takes advantage of the curse placed on her to find out where Pallas is hiding.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/l4S7a1HRNu0L55I7Q8ZnVNMhVBP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-14","episode_number":64,"episode_type":"standard","id":892824,"name":"Go Forward, Saint! The Innaccesible Road to Palace Belda!","overview":"Now knowing where Pallas is located, Seiya decides to lead an attack on her stronghold with the intention to kill her. On the way to meet him there, Koga and his friends are ambushed by the Tertiary Pallasite Cyllene and Haruto stays behind to confront him. Subaru decides to assist him ignoring his friends' warning and the two find later that they must fight not only Cyllene but also his twin brother Greip.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/4op7u6ADzVz0Bkdnnwdqjb3bQYs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-21","episode_number":65,"episode_type":"standard","id":892825,"name":"Break Down the Gate of the Iron Wall! Pegasus's Spear and Dragon's Shield!","overview":"Once the saints infiltrate the city, Seiya draws the attention of the enemy allowing Koga and the others to push forward. However, Tarvos appears to challenge Koga to a decisive battle and Ryuhou stays behind to assist him.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/jf7JePhxwbLkUEeVXRvRqztxlD9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-28","episode_number":66,"episode_type":"standard","id":892826,"name":"The Steel Struggle! The Nameless Warriors!","overview":"As the battle intensifies, Souma and Subaru fall back to assist the other Steel Saints in time to rescue only two of them, Kerry and Emma. Soon after, they are attacked by Loge and forced to retreat once Souma is injured. Surrounded by the enemy forces, Souma and the Steel Saints must work together to break Loge's siege and fight back.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/cxCqTmiZ8i0j1pWqhkNUrp86zuV.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"6031562d6e3deb003e0929a1","adult":false,"gender":2,"id":2859897,"known_for_department":"Visual Effects","name":"Takuro Shinbo","original_name":"Takuro Shinbo","popularity":0.988,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-08-04","episode_number":67,"episode_type":"standard","id":892827,"name":"Subaru, the Cosmo of Wonder! Eden's Mission!","overview":"Eden wanders through the city drawn by a strange cosmo when he meets the Secondary Pallasite Europa and is saved by Seiya. Inspired by the Gold Saint to look for a reason to fight, Eden pursues Europa who was sent in a mission to kill Koga, but has a hard time fighting the enemy until Subaru unleashes an impressive power that was dormant within him.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/kgxIJ1LLA6sThThUIddsYZpTRNa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-11","episode_number":68,"episode_type":"standard","id":892828,"name":"Koga and Pallas! Encounter on the Battlefield!","overview":"The Bronze Saints rescue civilians who were unaffected by Pallas' curse when Koga has an encounter with a young girl, unaware that she is none other than Pallas herself who has sneaked out of her castle. Meanwhile, Saori's body grows weaker due to her Cosmo being drained as Shiryu, Hyoga, and Shun approach the battlefield.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/oRmAFrvde7p2TMDXC18WM1UftmW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-18","episode_number":69,"episode_type":"standard","id":892829,"name":"Make A Storm Of Fire! The Friendship Of Yuna And Soma","overview":"To increase his power for his rematch against Yuna and Souma, Methone uses a dreadful item given to him by Europa to kill his sister Ymir and drain her Cosmo, and the two Bronze Saints must combine their strengths against the empowered Pallasite, as they reminisce upon the day they first met.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/ebzMygNME7J62eyossK2q0m29Cs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-01","episode_number":70,"episode_type":"standard","id":892830,"name":"The Cloth Destroyer! The Stray Pallasite Attack!","overview":"The second day of battles begin, and Koga, Ryuhou, Haruto, and Subaru take a chance to make a beeline for the Palace until they are intercepted by Mira, a Pallasite of unknown rank who fights without donning his Chronotector. Despite seemingly at a disadvantage, Mira easily overpowers the party with his speed and his Alchemy Glove's mysterious power to destroy Saint Cloths just by touching them, until Haruto realizes his trick and comes up with a way to fight back, but Mira is barely scathed by the counter. Just as he is about to don his Chronotector, he is ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/n6OxVfyuagMSpo6vZ9TTmuPxLgT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-15","episode_number":71,"episode_type":"standard","id":892832,"name":"The Accursed Cloth!? The Equuleus Saint!","overview":"On their way to the palace, Koga and his friends meet Celeris, who fights to protect the refugees with the Equuleus Cloth, despite taking heed of the dreaded curse that befalls whoever dons it. They also meet Selene, a young girl who takes care of all the humans who hide underground who has not been frozen in time, and Eden, with something to protect, has to fight Thebe once again, while Subaru and Celeris encounter Hati and have a short battle with him.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/tH1WviAQmiN14qijgFGPt5YenAQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-22","episode_number":72,"episode_type":"standard","id":892831,"name":"The Inherited Cloth! The Birth of Equuleus Subaru!","overview":"Koga's party departs to the palace through the secret passage shown by Celeris. However, worried about him, Subaru returns to assist the Equuleus Saint, and can do little to stop him from sacrificing himself to defeat Hati. Before passing away, Celeris entrusts the damaged Equuleus Clothstone to Subaru, and upon rejoining his fellow Bronze Saints, Subaru unlocks its true power to protect them, becoming a Bronze Saint as well.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/rFGzPvpy15TQIlWaYEdxbnuXJU9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-29","episode_number":73,"episode_type":"standard","id":1757105,"name":"The Tears of Equuleus?! Two Cloths Awaken!","overview":"Raki arrives at the city surrounding Pallasvelda to assist the others with a delivery of Cloth-restoring Stardust Sand but is attacked by the Pallasite Halimede, armed with a new triple rod. Koga and Subaru appear to protect her, but while Koga's cloth is too damaged, Subaru's suddenly stops moving out of grief for all the Saints who died wearing it. Eventually, he manages to help Equuleus overcome its sorrow and he defeats Halimede with a Pleiades Tempest. Meanwhile, Saori awakens and retrieves the Cloth of Athena to join the battle as well, accompanied by Kiki, Fudo...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/u1IQjqoS5Ndo6FU3AnZa9YptQAq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-06","episode_number":74,"episode_type":"standard","id":1757106,"name":"Kiki's War! Friendship Across Generations!","overview":"Koga and his friends keep traveling in order to find Kiki and fix their Cloths, as only Eden and Subaru can clear a path for the others. They rendezvous with Shaina and Aries Kiki who repairs their Cloths while explaining to each of them what they must focus on the most while fighting. However, Dione appears, and while the legendary Steel Saints Shou, Daichi and Ushio buy some time fending of the Pallasites with the other Saints, Kiki soon arrives to deal with the Secondary Pallasite himself, before Koga and his friends, with reinforced and fixed Cloths, head off ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/o3H5FzfofItIOtoQiJfd1ZR9LVY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-13","episode_number":75,"episode_type":"standard","id":1757108,"name":"The Destined Encounter! The Return of Gemini","overview":"As Saori and her escorts advance through the city overcoming all opposition, Ryuhou is separated from his fellow Bronze Saints by Paradox, who returns as a Secondary Pallasite for a rematch. Paradox's sister Integra appears to assist him as the new Gemini Gold Saint, while the last of the legendary saints, Phoenix Ikki, prepares himself to join the battle as well.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/lYEEMlRLAANQtSBmCtiIRWxusn0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-20","episode_number":76,"episode_type":"standard","id":1757110,"name":"The Phoenix! Phoenix Ikki Arrives!","overview":"As Koga and his friends approach Pallas' fortress, Mira appears before them again, but Ikki arrives in the nick of time to protect them. After the Pallasite flees, Ikki reveals to the other Bronze Saints that Pallas is not their greatest enemy, but an even greater foe who is manipulating the whole conflict from the shadows.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/sfj4ZrvAQy9NjPLNKXxY9h3oHWK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-27","episode_number":77,"episode_type":"standard","id":1757112,"name":"Move Time! Athena's Saints Gather!","overview":"At last Koga arrives at the front of Pallas' castle, which is sealed by the \"Gate of Time\", a massive door reinforced with Titan's powers. Koga attempts to break through the gate by himself but his own life is put in danger instead, until Athena and her Saints arrive to lend a hand.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/dcbFogKX6KppqY9Vee2lgXVwBlf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-03","episode_number":78,"episode_type":"standard","id":1757114,"name":"The Deciding Battle Begins! To Determine the Fate of the Goddesses!","overview":"Once inside the castle, Saori and the Saints are informed by Europa that only one of the four separate paths ahead of them lead to Pallas, and flees soon after, thus they decide to split up. Meanwhile, the Heavenly Kings conspire together not only against Athena, but against Pallas as well.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/gagHg6fZpAd3Mxny50NEaQr8eBF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-10","episode_number":79,"episode_type":"standard","id":1757115,"name":"The Offense and Defense Assasin! Shun's Secret Chain!","overview":"Koga, Yuna, and Souma advance through the first path while Shun stays behind to deal with the enemy reinforcements. However, the Secondary Pallasite Surtr blocks their path enveloped in a defensive barrier that seems impenetrable, until Shun catches up with them and realizes the secret behind the enemy's trick.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/9LByJB2IkoEFL96B6R2diQTh2gQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-24","episode_number":80,"episode_type":"standard","id":1757118,"name":"The King of Time! Hyoga's Absolute Zero Air!","overview":"Tokisada, the former Aquarius Gold Saint who was supposed to be defeated by Haruto at the End of Time, appears before him as a Secondary Pallasite at the second path, donning a Chronotector that enhances his time-control abilities. Haruto, Eden and Subaru have a hard time against him until Hyoga appears to battle him in their place.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/3IDbuJlDB6V7vwLl7mj7KFgKCv0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-01","episode_number":81,"episode_type":"standard","id":1757119,"name":"Putting On the Chronotector! The Four Heavenly Kings' Attack!","overview":"While Eden questions Subaru who he really is, Koga, Souma, Yuna, and Shun encounter the Primary Pallasite Aegaeon who wants to test the Bronze Saints' powers himself. After telling the Saints about how Ikki put his life on the line to crack Aegaeon's sword, Shun has a hard time fighting him until Koga, Souma, and Yuna keep fighting the Pallasite, defending Shun. Burning his Cosmo to the maximum, Koga manages to give Aegaeon a crack to his sword, before Ikki arrives to save the Bronze Saints, taking over the battle.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/zkkWhcQeLsCHoJ7hFbqf1NA0878.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-08","episode_number":82,"episode_type":"standard","id":1757120,"name":"The Peak Fighting Spirit! Ikki vs. Aegaeon!","overview":"Ikki fights Aegaeon while Koga, Souma, Yuna, and Shun keep moving onward. During the battle, Ikki and Aegaeon sustain grievous wounds. Meanwhile, the Gold Saints discuss Harbinger's loyalty to Athena since she gave the Athena Cloth to him for safekeeping, telling the Gold Saint that Athena trusts him. At the same time, Titan tries to calm down Pallas as she snaps after a Quaternary Pallasite informs her of Ikki fighting Aegaeon. At the end of the battle, Ikki sacrifices himself to completely defeat Aegaeon and all his fellow Bronze and Gold Saints grieve over his ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/qdgGlMauKbkHambuTezo8sI9Ka4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-15","episode_number":83,"episode_type":"standard","id":1757123,"name":"Shiryu and Ryuhou! Spirit of the Five Old Peaks!","overview":"After mourning the death of Ikki, Shiryu and Ryuhou have to face off against the Secondary Pallasite Rhea. In the occasion, the Libra Saint takes the opportunity to evaluate how far his son had improved his cosmo.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/stT8h3N5RZb23h08Wv6PKs5QR6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-22","episode_number":84,"episode_type":"standard","id":1757124,"name":"The Approaching Shadow! The Gold Saints Protecting Athena!","overview":"Athena, Seiya, Kiki, Fudo, and Harbinger are attacked by their former Gemini Gold Saint ally turned Secondary Pallasite Paradox. Integra, the new Gemini Saint and Paradox's twin sister, arrives to protect Athena and settle their score. Once defeated, Paradox is forgiven by Saori and reforms, just to be later fatally wounded by the Primary Pallasite Gallia.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/xDIFC3G5K4oWjqwOZM151vbbygU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-05","episode_number":85,"episode_type":"standard","id":1757126,"name":"Fighting Destiny! The Confession of Rebellion!","overview":"After dealing with Paradox, Gallia turns her attention to Athena and the Gold Saints, easily deflecting all their attacks until she reveals her Photontector. Meanwhile, the other three groups figure out the meaning of their endless running, figuring out that someone has put them into an endless corridor. As Seiya's attacks are easily deflected, and Gallia is about to kill him, Pallas informs her to stand back, with Gallia mocking Pallas for receiving no love in spite of being the Goddess of Love. However, Integra and Paradox combine their Cosmo, and destroy Europa's ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/trwNUuS8gdtvWpiPrywSt5Cgkeh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-12","episode_number":86,"episode_type":"standard","id":1757129,"name":"The Secret of the Cloths! A New Power Is Activated!","overview":"The young Bronze Saints face off against Gallia on their own, allowing the Gold Saints and Athena to move forward towards Pallas. Although Gallia's Photontector and Bushin Photon Sword seem impervious to harm, Subaru once more calls on the mysterious powerful cosmo to break through Gallia's offensive and actually damage the sword, convincing the others to call upon their own cosmo, transforming their New Cloths into the more powerful Omega Cloths, and together the six Bronze Saints defeat Gallia.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/bJoYt4ChZSY6wkh6lZBxIGo4SZb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-19","episode_number":87,"episode_type":"standard","id":1757130,"name":"The Gold Union! The Forbidden Mystery!","overview":"Fudo, Kiki, and Shiryu face off against Hyperion, allowing Athena, Seiya, and Harbinger to move forward. Hyperion's Destruction Tector and Tenchi Destruction Slash holy sword prove too powerful for the three Gold Saints' attacks on their own. In a final show of strength, they combine their Cosmo into a single forbidden attack: Athena Exclamation. The Saints and Pallasites throughout Pallasvelda react to the outpouring of Cosmo, and as the Tenchi Destruction Slash is destroyed, the three Saints' Cosmo vanishes.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/22GsreD6n381mv4E7zB4uN5j1C9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-26","episode_number":88,"episode_type":"standard","id":1757131,"name":"The Remaining Determination! The Great Saints' Teachings!","overview":"The Bronze Saints investigate what they believe to be the final resting place of Shiryu, Kiki, and Fudou, who sacrificed themselves to defeat Hyperion, but they discover that while the Tenchi Destruction Slash has been destroyed, Hyperion has survived with barely a scratch. Koga and his friends must use their new Omega Cloths to take down Hyperion for good. During the battle, Subaru's great and powerful Cosmo once again surfaces to everyone's surprise, along with the proclamation that he is a god. However, after seemingly defeating Hyperion, a strange voice talks to ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/tkNEGWweAQV1Osn1mMIcR7Xuuf3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-02","episode_number":89,"episode_type":"standard","id":1757134,"name":"Awaken! The Ultimate Omega!","overview":"As Subaru's time is taken away by the Chrono Destruction, Koga, Yuna, Souma, Ryuhou, Haruto, and Eden still have to face the immense power of Hyperion as well as awaken their greater Omega Cosmo.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/5ORlhRrq20Uv3am7IBD0GmVgaiP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-09","episode_number":90,"episode_type":"standard","id":1757135,"name":"Taurus Charge!! Reaching Pallas's Chamber!","overview":"Accompained only by Seiya and Harbinger, Saori finally comes face to face with Pallas. Titan steps in to protect his master and Harbinger challenges the Pallasite, using Athena's cloth to draw his attention. Treating him as a mere ruffian, Titan is surprised by the true might of the Taurus Saint, who proves himself far more powerful and noble than he claims to be.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/vVC2DRNEhpDkjpOcw8OPufbZPfE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-02-16","episode_number":91,"episode_type":"standard","id":1757137,"name":"Athena and Pallas! Battle of the Goddesses","overview":"The long awaited confront between Athena and Pallas begins. Saori tries her best to dissuade Pallas, but her drive to enact revenge on Athena is stronger. However, even while draining her sister's energy and donning the strongest of all Chronotectors, Pallas is defeated by Athena and Titan stands between them to protect her in the last moment. To protect Saori, Seiya, bringing forth the true power of the Sagittarius cloth, steps in to confront the Pallasite.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/jEUFUC9M3LvbD4yWvSLczLDxtjD.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"60718781c74eba00410cc3ba","adult":false,"gender":1,"id":1848321,"known_for_department":"Visual Effects","name":"Yumiko Ishii","original_name":"Yumiko Ishii","popularity":1.29,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-02-23","episode_number":92,"episode_type":"standard","id":1757139,"name":"Seiya's True Feelings! The Lie From His Return!","overview":"After donning his New Gold Cloth, Seiya battles Titan, who questions his loyalty to Athena and the Sagittarius Saint reveals that his drive to follow Saori comes from his feelings for her. Knowing how he feels out of his devotion to Pallas, the Pallasite attacks with all his Cosmo, just to be wounded by Seiya's arrow. Pallas intervenes to protect Titan and Saori then reconciles with her, seeing how she has reformed after assuming her love for him. However, Europa appears and uses the curse laid on the goddesses to drain their Cosmo and pours it on Subaru, who is ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/b0IEoBK2dmJDmHli0NfKR7SDXjO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-02","episode_number":93,"episode_type":"standard","id":1757140,"name":"The God of Time! The Ascent of Saturn!","overview":"Subaru awakens as Saturn, the God of Time, the one who bestowed the Pallasites their Chrono Tectors and Holy Swords. Donning his own Chrono Tector, Saturn, accompanied by Europa and Mira, reveals that he had descended to Earth and erased his past memories to live among mankind and determine their worthiness. Having regained his former self, he then declares that humanity no longer deserves to remain on the Earth and uses his powers to freeze all of its inhabitants, before retreating to his heavenly palace with his servants. Determined to make Saturn pay and have ...","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/2wGDpGycnopilrunlchinsCKpOL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-09","episode_number":94,"episode_type":"standard","id":1757142,"name":"Fighter of Hope! The Ties That Bind Saints!","overview":"While Seiya, Kouga, and the other young Bronze Saints travel to face off against Saturn and Shun and Hyoga prepare for battle with Europa and Mira, the Steel Saints must deal with Aegir and his Phantom Arm of Hyperion. All hope seems lost until an old ally returns.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/9Qgigvdlj1LuoqXP0gJRBfNQaNy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-16","episode_number":95,"episode_type":"standard","id":1757144,"name":"Overcome the God! Seiya's Cosmo!","overview":"Sagittarius Seiya faces off against Saturn, the God of Time, and Shun and Hyoga protect Athena and Pallas from Europa and Mira.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/lmYobc8T35F8CCFf7fWJitr3ada.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-23","episode_number":96,"episode_type":"standard","id":1757145,"name":"The Final Battle! Go, Omega Saints!","overview":"Seiya is defeated by Saturn before Kouga and his friends also fall before his almighty power, following a desperate battle in which the Bronze Saints are defeated one by one. When all seems lost, Athena gathers the Cosmos of all the other Saints to restore Kouga, who rises again as the ultimate Omega Saint, determined to stop the God of Time once and for all.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/1KUvaRzSmjpIFwdOaWijl1H2wn9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-30","episode_number":97,"episode_type":"finale","id":1757146,"name":"The End of the Battle! Become a Legend, Kouga!","overview":"After a long and vicious battle, Kouga and his friends convince Saturn to recognize the value of mankind as he regains his lost memories from when he fought by their side as Subaru. The God of Time then takes his leave and while the efforts to rebuild the Sanctuary and Pallasvelda begin, Kouga and Eden embark on a journey together to find their own place in the world as a new era unfolds.","production_code":"","runtime":25,"season_number":1,"show_id":44317,"still_path":"/gQ6nVGUTEsVLBtdYU23ugGyBsZ5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":53381,"poster_path":"/ddryifituWlbfTKTkkABx2YygEs.jpg","season_number":1,"vote_average":0}}}