{"adult":false,"backdrop_path":"/41wdwXpVtgYVS5OjvZo7eTClJ8s.jpg","created_by":[{"id":2064059,"credit_id":"5b31b4f39251413c9d0070f0","name":"Chi Wah Lam","gender":2,"profile_path":"/5MBPK9EAMYNwb2gjYrMRid0spT9.jpg"}],"episode_run_time":[40],"first_air_date":"2012-09-24","genres":[{"id":10759,"name":"Action & Adventure"},{"id":18,"name":"Drama"}],"homepage":"https://www.mytvsuper.com/en/programme/highsandlows0001_110524/Highs-And-Lows/","id":44442,"in_production":false,"languages":["cn"],"last_air_date":"2012-11-02","last_episode_to_air":{"id":893553,"name":"Episode 30","overview":"HOK-LAI ties KA-PIK up in the ambulance and he threatens SAI-LOK to go to the warehouse alone. HOK-LAI asks HEUNG WING to go to the warehouse and he gives him a remote detonator. He asks HEUNG WING to take revenge by pressing the button when the Columbia drug dealers go into the ambulance. HEUNG WING believes that HOK-LAI plans to take ownership of all the drugs. HEUNG WING doesn't know that KA-PIK is trapped in the ambulance and he hesitates. During the time, SAI-LOK also sneaks into the warehouse with weapons. JOHNNY arrives but he fails to get in touch with HOK-LAI. He has no choice but to ask his guys to find the drugs in the ambulance. SAI-LOK discovers HEUNG WING and he asks him to stop. The ambulance suddenly explodes and SAI-LOK shots HEUNG WING. HOK-LAI helps HEUNG WING to escape but HEUNG WING suddenly points his gun towards HOK-LAI……","vote_average":0,"vote_count":0,"air_date":"2012-11-02","episode_number":30,"episode_type":"finale","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null},"name":"Highs and Lows","next_episode_to_air":null,"networks":[{"id":48,"logo_path":"/v78f4q6DYdRB8dLj4rQBpqQG8pW.png","name":"TVB Jade","origin_country":"HK"}],"number_of_episodes":30,"number_of_seasons":1,"origin_country":["HK"],"original_language":"cn","original_name":"雷霆掃毒","overview":"Gordon Heung and Wai Sai-Lok have been long-time collaborators in the police force, frequently working with each other to solve drug trafficking cases in the city. During an operation, Sai-Lok discovers clues that point to Gordon being a corrupt cop in a collusion conspiracy with drug dealers. Suspicious about Gordon's true intentions, Sai-Lok launches a secret investigation on him.","popularity":10.632,"poster_path":"/6tYRdwwx5Z6W25iE2dUndTiUXI2.jpg","production_companies":[{"id":79261,"logo_path":"/4OKzkasr0IV8CSqejjgRfKw7e0m.png","name":"TVB","origin_country":"HK"}],"production_countries":[{"iso_3166_1":"HK","name":"Hong Kong"}],"seasons":[{"air_date":"2012-09-24","episode_count":30,"id":53444,"name":"Season 1","overview":"","poster_path":"/nX8rFPe1qkzc6PypBmigV6ChnfF.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Cantonese","iso_639_1":"cn","name":"广州话 / 廣州話"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"52596796760ee346619cbfc9","air_date":"2012-09-24","episodes":[{"air_date":"2012-09-24","episode_number":1,"episode_type":"standard","id":893528,"name":"Episode 1","overview":"When HEUNG WING meets up with the drug dealer, Senior Inspector WAI SAI-LOK comes to arrest them but HEUNG WING escapes successfully. SAI-LOK discovers from his boss that HEUNG WING is an undercover police from the Narcotics Bureau. HEUNG WING tries to mingle with the drug dealers by pretending to be a drug maker. HEUNG WING’s subordinates HO KWAI, NIN YAU-FU and CHENG CHI-SHING help to take care of his family while he is carrying out duties. After arriving at the divan, HEUNG WING discovers that the most wanted man LEE BING-LUNG is the owner of the drug factory. Representing the Intelligence Unit of the Narcotics Bureau, SAI-LOK waits outside the drug factory with colleagues from the Operations Unit. SAI-LOK decides to utilize CHAN KA-PIK’s home as a temporary control centre for further investigation and he urges KA-PIK’s younger brother KA-CHUN to let them in. KA-PIK and her good friend NG TAK-TIM return home to collect some goods……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-25","episode_number":2,"episode_type":"standard","id":893526,"name":"Episode 2","overview":"BING-LUNG sends HEUNG WING to the illegal clinic for treatments. SAI-LOK asks the new staff HEI-SUEN to inspect the market. HEI-SUEN feels that SAI-LOK is making fun of her and she feels dissatisfied. SAI-LOK discovers that HOK-LAI’s team is following them and he asks his subordinate to offer coffee to HOK-LAI. HEUNG WING wakes up and tells BING-LUNG that he will start making drugs. BING-LUNG brings HEUNG WING to chase after the informer. HOK-LAI’s team arrives and starts a gunfight with BING-LUNG. KA-PIK receives a call from her good friend JENNY during work. KA-PIK discovers that JENNY is taking drugs and she rushes to find her. She discovers JENNY losing control and jumps down from the bridge. KA-PIK mourns for her by burning offerings at the bridge. SAI-LOK invites KA-PIK to be his snitch. He asks HEI-SUEN and KA-PIK to buy drugs from CHAN KIN. CHAN KIN finds HEI-SUEN unfamiliar and he asks her to take drugs on the spot.","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-26","episode_number":3,"episode_type":"standard","id":893525,"name":"Episode 3","overview":"CHAN KIN returns home and is attacked by three masked men. In order to protect himself, CHAN KIN asks HO KWAI and the others to protect him. HEUNG WING knows that BING-LUNG wants to kill him and he tries to slow down the drug-making process. In order to find out the whereabouts of the black money from drug trafficking, WING-TUNG from the Financial Investigation Unit opens an account in the securities company by pretending to be a rich woman Mrs CHIN. WING-TUNG asks SAI-LOK to monitor TSU WING-MAU closely and SAI-LOK discovers that WING-TUNG and HEI-SUEN are cousins. After meeting with HEUNG WING, the big boss asks BING-LUNG to kill HEUNG WING afterwards. After finishing BING-LUNG’s case, HOK-LAI is transferred to the Narcotics Bureau and he becomes HEUNG WING’s team leader. The police discover that the South America drug dealers are trading with Hong Kong’s drug dealers……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-27","episode_number":4,"episode_type":"standard","id":893527,"name":"Episode 4","overview":"SAI-LOK asks HEI-SUEN to attend KWOK-TUNG’s mother’s birthday banquet together. HEI-SUEN is shocked to discover many gangsters from the triad society there. HEI-SUEN finds SAI-LOK mingling with the gangsters naturally and she believes that he is acting against the police’s code of conducts. HEUNG WING persuades LAU FOOK to be an informer again and LAU FOOK hesitates. LAU FOOK asks SAM-KAU to meet him in the prison and SAM-KAU assures him that he can work in his seafood restaurant after releasing from jail. During the hearing of CHAN KIN’s case, KA-PIK is overjoyed to learn that CHAN KIN’s sentence is not heavy. CHAN KIN is shocked to realize that KA-PIK is his daughter. HEI-SUEN visits KA-PIK and KA-CHUN’s epilepsy is bothering him again. The doctor says that there is a new medicine to treat his illness but the cost is very high. KA-PIK is worried and she doesn’t know what to do. HOK-LAI and SAI-LOK do not coordinate with each other……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-28","episode_number":5,"episode_type":"standard","id":893524,"name":"Episode 5","overview":"While KA-PIK is tailing after SAM-KAU and the others, TAK-TIM suddenly arrives and her plan is almost ruined. SAM-KAU discovers that one of his followers is stealing his drugs for sale and he punishes him fiercely. LAU FOOK is startled to witness it. KA-PIK discovers LAU FOOK meeting with HO KWAI and she realizes that he is also a snitch. LAU FOOK wants to withdraw from his work but HOK-LAI forces him to carry on with both hard and soft tactics. SAI-LOK goes to Macau alone to rescue KWOK-TUNG’s son. HEI-SUEN finds SAI-LOK staying with KWOK-TUNG and she suspects that they have special relationship. WING-TUNG helps HEUNG WING to pick up their son from school since HEUNG WING is busy. WING-TUNG’s boyfriend CHEUK-LUN suggests her to fight for the custody of her son. HEI-SUEN follows SAI-LOK secretly and she discovers SAI-LOK meeting up with SAM-KAU through KWOK-TUNG……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-01","episode_number":6,"episode_type":"standard","id":893530,"name":"Episode 6","overview":"CHI-SHING realizes that HOK-LAI has discovered that he is skipping his duty. HEUNG WING assures him that he will take the blame for him. WING-TUNG informs HEUNG WING that she will fight for the custody of their son. SAI-LOK urges KA-PIK to take action. KA-PIK chats with SAM-KAU’s subordinate and finds out the transaction date. KA-PIK sneaks into the freezer when nobody’s there to carry out investigation and she finally discovers the secret inside. KA-PIK learns about the transaction location. While trying to inform SAI-LOK, KA-PIK is trapped in the freezer. On the other hand, HEI-SUEN suddenly comes with 2 policemen to arrest SAI-LOK for she believes that SAI-LOK is a dirty cop. HOK-LAI believes that he could stop SAM-KAU’s drug transaction after capturing the BOAT KING but his plan is not successful. SAI-LOK is questioned by the policemen and he refuses to disclose the truth……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-02","episode_number":7,"episode_type":"standard","id":893529,"name":"Episode 7","overview":"HEI-SUEN apologizes to SAI-LOK for misunderstanding him. SAI-LOK asks HEI-SUEN to help giving the informer fees to KA-PIK. KA-PIK is shocked to discover that she only gets slightly more than 10 thousand dollars. In order to take revenge for KA-PIK, TAK-TIM tries to fight against SAI-LOK but SAI-LOK makes fun of him. SAI-LOK knows that he has underpaid KA-PIK and he promises to help her if she has any problems in the future. HEUNG WING indulges in his work and his son waits in the police station for a long time. WING-TUNG cannot bear it and she brings their son home. HEUNG WING has no choice but to agree letting WING-TUNG to take care of their son temporarily. HEUNG WING and the others help SAM-KAU’s old maid TAO to stay in the elderly centre. Granny CHOI from the elderly centre asks HO KWAI to protect her. HEUNG WING discovers that Granny CHOI is the witness of a drug overdose death case……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-03","episode_number":8,"episode_type":"standard","id":893532,"name":"Episode 8","overview":"Reminded by the kindergarten principal, WING-TUNG realizes that she has been ignoring her son’s feelings and she apologizes to her son. TAK-TIM helps his head FAT LION and FAT LION assigns him to manage one of his entertainment venues. TAK-TIM is overjoyed. HOK-LAI discovers that a VCD is missing in the dead person’s home and he suspects that someone has stolen it. KA-PIK discovers people selling drugs in the entertainment venue. She believes that TAK-TIM has allowed it to happen and she kicks him away from her home. HO KWAI secretly looks for the only witness YAU-YEE, the daughter of the dead woman, to go back to the place for investigation. YAU-YEE’s foster father YAT-MING immediately asks HOK-LAI to stop him. YAU-YEE is sick suddenly and she is sent to the hospital. The doctor says that she suffers from kidney problems. HEUNG WING feels that YAT-MING’s behaviour is strange……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-04","episode_number":9,"episode_type":"standard","id":893533,"name":"Episode 9","overview":"SAI-LOK asks HEI-SUEN to keep an eye on Granny CHOI but HEI-SUEN carries out investigation on YAT-MING secretly. SAI-LOK and HEUNG WING wait for a long time but YAT-MING doesn’t arrive. HEI-SUEN suddenly reports that Granny CHOI is missing. HEI-SUEN rescues Granny CHOI but she falls down from the building. YAT-MING finally discloses his relationship with YAU-YEE’s mother to the police. However, in order to protect his wife and daughter, he refuses to disclose the name of the drug lord. HEI-SUEN has a bad mood because of her father. She invites KA-PIK and TAK-TIM to drink. The police believe that the tycoon CHIU CHI-FAI is the drug lord. SAI-LOK and the others monitor his telephone conversation. They discover that CHI-FAI is talking with the Columbia drug dealers. CHI-FAI escapes successfully while trading with the Columbia drug dealers. SHUI-KI asks SAI-LOK out for he suspects that there are dirty cops in the team.","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-05","episode_number":10,"episode_type":"standard","id":893531,"name":"Episode 10","overview":"SAI-LOK and HEI-SUEN return to the factory building for investigation. SAI-LOK discovers how CHI-FAI has escaped. WING-TUNG and HEUNG WING go to dinner together. WING-TUNG suddenly discovers her boyfriend quarrelling with somebody and she is surprised. HOK-LAI learns that the number of drug-taking venues in Sham Shui Po has increased a lot and he asks HEUNG WING to carry out investigation. While investigating the case, CHI-SHING learns that CHI-FAI has left Hong Kong. He quietly informs HO KWAI to wait at the pier together. In fact, SAI-LOK and HEI-SUEN have been monitoring the two of them. WING-TUNG freezes all the assets of CHI-FAI but CHI-FAI reveals that he will not be sentenced easily for somebody powerful is supporting him. HOK-LAI is eavesdropping HEI-SUEN and SAI-LOK’s conversation. He realizes that they are investigating whether HEUNG WING and the other three cops are dirty cops……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-08","episode_number":11,"episode_type":"standard","id":893534,"name":"Episode 11","overview":"SHUI-KI and SAI-WING are monitoring HEUNG WING’s team secretly. HEUNG WING brings his team to capture CHI-FAI but he discovers that the person is not CHI-FAI. SHUI-KI discussed the corrupt cop issue with SAI-LOK and HOK-LAI asks to join their investigation. When HOK-LAI is arguing with SAI-LOK, they learn that HEUNG WING’s team is leaving the police station secretly. After so many tests on the suspected corrupt cops, SHUI-KI decides to call off the action. SAI-LOK feels ashamed and guilty for suspecting HEUNG WING. HEUNG WING and the other three are awarded a commendation for capturing CHI-FAI successfully. However, HEUNG WING suddenly receives a call from AGENT and he recalls the shameful memory of becoming a corrupt cop. Two years ago when they were carrying out duty, CHI-SHING secretly takes money from the drug dealers out of greediness. A mysterious person called AGENT has taken video of it……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-09","episode_number":12,"episode_type":"standard","id":893536,"name":"Episode 12","overview":"SAI-LOK leaves a note to HEI-SUEN, asking her to help informing his boss that he will take a day off. The anniversary of KA-PIK’s mother’s death is coming. She goes to their old house in Lamma Island with KA-CHUN and TAK-TIM. WING-TUNG goes to HEUNG WING’s home to visit their son. She discovers HO KWAI and the others are going to perform drama in the elderly centre. WING-TUNG is upset that HEUNG WING is wasting their son’s time on unimportant things. KA-PIK visits her mother’s grave with KA-CHUN and she discovers SAI-LOK hiking there. WING-TUNG joins the drama performance reluctantly and she reveals that she finally has a deeper understanding on HEUNG WING. KA-PIK allows SAI-LOK to join her for hot-pot dinner. In the nighttime, the two of them chats with each other at the courtyard. HOK-LAI receives information on the drug dealing activities in China and he wants TAK-TM to be an informer……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-10","episode_number":13,"episode_type":"standard","id":893535,"name":"Episode 13","overview":"WING-TUNG carries out investigation at London Gold Investment Company by pretending to be a housewife. WING-TUNG tries to get close to the manager SUNNY. SUNNY is interested in her and he invites her to discuss the investment account matters in the hotel. WING-TUNG steals SUNNY’s phone data successfully. HEUNG WING sends WING-TUNG home and they chat under the tree where they used to date. CHEUK-LUN invites WING-TUNG and her son to live together in Switzerland and WING-TUNG is deeply touched. TAK-TIM follows the drug dealer to meet with their boss. KA-PIK suddenly joins him by pretending that she is his wife. TAK-TIM is very scared and the drug dealers discover it. HOK-LAI and his team start a gunfight with the drug dealers. A drug dealer captures SAI-LOK in order to escape. KA-PIK wakes up in the hospital and she is worried about SAI-LOK. She rushes to SAI-LOK’s home and they sleep together……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-11","episode_number":14,"episode_type":"standard","id":893537,"name":"Episode 14","overview":"HOK-LAI and HEI-SUEN joins the Asia Shooting Competition together. They become the champions and HOK-LAI believes that HEI-SUEN is his perfect match. WING-TUNG receives the investigation report and she is shocked to discover that CHEUK-LUN is involved in money laundering. She questions him and CHEUK-LUN reveals that he will die from hereditary disease soon. He involves himself in money laundering in order to save money for WING-TUNG and her son. WING-TUNG finally decides to keep the secret for him. KA-PIK hides away from SAI-LOK and SAI-LOK cannot bear to reveal his love to her outside her home. SAI-LOK waits for KA-PIK near his home but the injured HEI-SUEN arrives. SAI-LOK goes to the pub to look for KA-PIK but KA-PIK rejects him by saying that she slept with him just for fun. HEUNG WING urges WING-TUNG to stay in Hong Kong but WING-TUNG decides to leave because of CHEUK-LUN.","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-12","episode_number":15,"episode_type":"standard","id":893539,"name":"Episode 15","overview":"HOK-LAI asks HEI-SUEN to help selecting his father’s birthday gift. HOK-LAI’s mother even invites HEI-SUEN to join the birthday dinner. HOK-LAI lies to his mother that his girlfriend HOI-YING wants to separate with him. Later, HOK-LAI reveals to HOI-YING that he wants a separation. After winning the shooting competition, the team organizes a celebration party for HOK-LAI and HEI-SUEN. HEI-SUEN invites SAI-LOK to have the first dance and HOK-LAI is very jealous. HEUNG WING discovers that WING-TUNG is trying to protect CHEUK-LUN by hiding all the evidences and he questions her. HEUNG WING doesn’t know what to do and he reveals the case to HO KWAI and the others. CHEUK-LUN’s bank account password in the bank is changed. CHEUK-LUN asks somebody to kidnap WING-TUNG and HEUNG YEUNG. He threatens HEUNG WING to help taking back the two hundred million dollars from his account. SAI-LOK suggests chasing after the suspect with HEUNG WING……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-15","episode_number":16,"episode_type":"standard","id":893538,"name":"Episode 16","overview":"SAI-LOK and HEI-SUEN pretend to be the waiter and the waitress. However, the mad drug dealers suddenly grasp SAI-LOK and escape by car. On the other hand, HEUNG WING discovers CHEUK-LUN’s car. SAI-LOK finally escapes from PETER’s grasp but he discovers CHEUK-LUN’s subordinate pointing a gun towards HEUNG YEUNG. SAI-LOK tries to protect HEUNG YEUNG with his body. HEUNG WING enters the house and he discovers CHEUK-LUN grasping WING-TUNG. HEUNG WING starts a fight with CHEUK-LUN. SAI-LOK’s lumbar is injured and he needs to stay in a wheelchair before recovery. During the meeting, HOK-LAI questions WING-TUNG and YAU-FU speaks for her. KA-PIK kicks TAK-TIM away. TAK-TIM goes gambling in CHI-HUNG’s casino for he hopes to win some money for giving medical treatments to KA-CHUN. He plays trick during gambling and the staff there discover it……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-16","episode_number":17,"episode_type":"standard","id":893540,"name":"Episode 17","overview":"WING-TUNG sneaks into WAN-YEE’s office at night to carry out investigation and WAN-YEE discovers her. HEUNG WING arrives to rescue her by pretending to be a security guard. WAN-YEE recognises that HEUNG WING was a senior schoolmate in her secondary school. KA-PIK offends a gangster in the pub. CHI-HUNG kicks the gangster away and invites KA-PIK to work in his casino. HEI-SUEN tells SAI-LOK that she is carrying out investigation on a man called KEUNG CHI-HUNG but she fails to find any useful information. WAN-YEE is almost injured by a car but HEUNG WING rescues her. WAN-YEE invites HEUNG WING to be her bodyguard by paying him 40 thousand dollars a month. HEI-SUEN and SAI-LOK follow KA-PIK secretly and they discover that she is meeting HOK-LAI at the seashore. HEUNG WING discovers YAU-FU acting strange and he follows him. YAU-FU tries to borrow money from the credit company and HEUNG WING suggests lending him the money……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-17","episode_number":18,"episode_type":"standard","id":893542,"name":"Episode 18","overview":"CHI-HUNG buys a flower shop for KA-PIK. A man suddenly comes to attack CHI-HUNG and KA-PIK beats the man with a glass bottle. KA-PIK is injured and CHI-HUNG sends her to the hospital. CHI-HUNG’s subordinate informs him that CHIU SAM-KAU is the one who arranges the attack. HOK-LAI complains to SHUI-KI that SAI-LOK is disturbing his snitch. SHUI-KI asks SAI-LOK to stop interfering. KA-PIK returns home to discover that KA-CHUN is missing and SAM-KAU suddenly arrives. WAN-YEE is ill and HEUNG WING suggests her to visit the doctor but she refuses to do so. HEUNG WING goes to buy medicine for WAN-YEE. He returns to discover that WAN-YEE is taking drugs. TAK-TIM asks to work for CHI-HUNG for he wants to be successful. KA-PIK follows CHI-HUNG to the walled village and CHI-HUNG discovers her. KA-PIK claims that she worries that he is meeting another woman. TAK-TIM meets SAM-KAU accidentally and he picks up SAM-KAU’s smart phone card……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-18","episode_number":19,"episode_type":"standard","id":893541,"name":"Episode 19","overview":"CHI-SHING, YAU-FU and HO KWAI discover that HEUNG WING has lent them over 1 million dollars already. HEUNG WING reveals that he has mortgaged his house and all the others feel very grateful. HEUNG WING asks WAN-YEE to tell him who is the drug supplier. He arrests the person but later discover that this is only a small dealer. KA-PIK receives a call from TAK-TIM. She goes to the rooftop to discover SAI-LOK and HEI-SUEN there. HEI-SUEN meets CHI-HUNG accidentally. KA-PIK arrives to explain that HEI-SUEN used to work with her in the pub. CHI-HUNG invites HEI-SUEN to work in his casino. HEI-SUEN discovers that the owner of the soy sauce factory dresses luxuriously these days. SAI-LOK finds that the electricity and water bills of the factory are taking up half of its total production expenses. HEUNG WING receives information and he arrests a band member who used to work with WAN-YEE……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-19","episode_number":20,"episode_type":"standard","id":893543,"name":"Episode 20","overview":"SAI-LOK blames HOK-LAI for asking KA-PIK to be his snitch. HOK-LAI claims that he will assign a team to rescue KA-CHUN besides chasing after the drug dealers. KA-PIK learns that CHI-HUNG’s soy sauce factory has sent out the goods and she informs SAM-KAU. SAM-KAU threatens CHI-HUNG by capturing KA-PIK. SAI-LOK and HEI-SUEN discover that KA-PIK is in danger. They ask HOK-LAI to rescue her but HOK-LAI ignores them. SAM-KAU escapes and KA-PIK takes away all the drugs. HOK-LAI announces that they should find KA-PIK and arrest her. TAK-TIM and SAI-LOK discover the whereabouts of KA-PIK. They try to go there and HOK-LAI follows them secretly. SAI-LOK finds KA-PIK but KA-PIK stuns him. KA-PIK delivers the drugs to SAM-KAU. HOK-LAI learns that his snitch LAU FOOK is killed by SAM-KAU. HEUNG WING discovers the whereabouts of SAM-KAU and he rushes to the place. SAI-LOK and HEI-SUEN search all the way to Yuen Long. HEUNG WING arrives as well……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-22","episode_number":21,"episode_type":"standard","id":893544,"name":"Episode 21","overview":"SHUI-KI believes that SAM-KAU intended to kill KA-CHUN in the very beginning and he asks HOK-LAI not to be too guilty for KA-CHUN’s death. HEI-SUEN is heart-broken after learning that SAI-LOK loves KA-PIK deeply. HOK-LAI seizes the chance to console HEI-SUEN. HOI-YING drinks in the pub and she is heart-broken after receiving HOK-LAI’s SMS. When she returns home, a man tries to molest her and YAU-FU rescues her. YAU-FU doesn’t know where HOI-YING lives so he brings her home. On the next morning, HOI-YING misconceives that YAU-FU has done something bad to her. TAK-TIM asks HEI-SUEN to visit KA-PIK and HEI-SUEN discovers KA-PIK injecting drugs. On the other hand, HO KWAI and HEUNG WING admit that they have taken AGENT’s money. HEI-SUEN wants to help KA-PIK but KA-PIK runs away. HEI-SUEN and SAI-LOK look for KA-PIK everywhere……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-23","episode_number":22,"episode_type":"standard","id":893546,"name":"Episode 22","overview":"HEUNG WING meets up with AGENT to reveal that the police are suspecting them already. AGENT tells HO KWAI that HEUNG WING has taken money from him every time. He threatens HO KWAI to help him or he will tell the police what has happened at the waste paper recycling yard. YAU-FU explains to HOI-YING what has happened on that night and HOI-YING apologizes to him. She also reveals her sadness on the relationship with HOK-LAI to him. While carrying out duty, SAI-LOK is shocked to discover that KA-PIK is injecting drugs. SAI-LOK and HEI-SUEN find KA-PIK eventually. KA-PIK reveals that SAM-KAU and his subordinates have injected drugs into her body by force. They also raped her together. She becomes a drug addict afterwards in order to escape from this painful memory. SAI-LOK is totally shocked and heart-broken. HEUNG WING gives HO KWAI a memory stick with all the crime information and he asks him to help writing a report at home……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-24","episode_number":23,"episode_type":"standard","id":893545,"name":"Episode 23","overview":"HO KWAI warns the drug factory beforehand and the police fail to arrest anybody there. SAI-LOK suspects that HO KWAI has done it because his bank account has suddenly got 300 thousand dollars. The Intelligence Unit learns that the Columbia drug dealers are coming to Hong Kong to meet HO-WAI. HOK-LAI and SAI-LOK carry out investigation in HO-WAI’s nightclub. KA-PIK suddenly attacks SAI-LOK and the police arrest her. HO KWAI suspects that HEUNG WING has transferred the 300 thousand dollars to his bank. HO KWAI’s wife informs him that his children are missing. SAI-LOK has done it and he hints to HO KWAI that he should stop what he is doing now. HEI-SUEN discovers that the footprints outside the house where KA-PIK used to stay are identical with the footprints outside SAM-KAU’s hiding place. She suspects that somebody has been following KA-PIK secretly. KA-PIK and TAK-TIM represent HO-WAI to trade drugs……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-25","episode_number":24,"episode_type":"standard","id":893552,"name":"Episode 24","overview":"CHI-SHING and YAU-FU reveal to HO KWAI that SAI-LOK is carrying out investigation on dirty cops again. HO KWAI asks his wife and children to hide away in Macau. He then decides to leave Hong Kong illegally. HEUNG WING carries out investigation on AGENT and he meets a suspicious man outside a guesthouse. HEUNG WING follows the man all the way to HO KWAI's home and he realizes that this man is a killer. HOK-LAI pretends to be helping HEI-SUEN to find clues of the footprints outside the male's toilet but he actually wants to mislead her to investigate in the wrong direction. HO-WAI finally allows KA-PIK and TAK-TIM to help trading drugs with KAU MAN-LUNG. KA-PIK believes that everything is going smooth but KAU MAN-LUNG suddenly discovers that most of her money is fake. KA-PIK and TAK-TIM run away and hide in an apartment. TAK-TIM suggests to leave Hong Kong but KA-PIK doesn't want to be wronged……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-26","episode_number":25,"episode_type":"standard","id":893551,"name":"Episode 25","overview":"HO-WAI dies and KA-PIK takes over his drug trafficking business. SAI-LOK persuades KA-PIK to stop doing it but KA-PIK treats him coldly. HOK-LAI worries that the police will discover that he is the one who keeps following KA-PIK. He tries to burn the evidences but this harms others unexpectedly. HO KWAI says goodbye to CHI-SHING and YAU-FU. HEUNG WING has found some important information and YAU-FU reveals it to HO KWAI. HO KWAI finally decides to meet his family members in Macau first. HEUNG WING wants to kill AGENT and the killer during their meeting but SAI-LOK suddenly appears. After overcoming various obstacles, HEUNG WING finally arrives at the warehouse but he discovers HO KWAI's dead body there. HEUNG WING believes that everything has passed. He decides to start anew with CHI-SHING and YAU-FU. HOK-LAI believes that HO KWAI's death is suspicious and he tries to carry out investigation on the case……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-29","episode_number":26,"episode_type":"standard","id":893550,"name":"Episode 26","overview":"The police monitor KA-PIK's business closely. TAK-TIM plays tricks to facilitate their drug trafficking business and KA-PIK's business is expanding rapidly. Mr CHAN and his wife from the elderly centre are planning to have another wedding ceremony. Mr CHAN invites HEUNG WING to be his best man at wedding. HEUNG WING seizes the chance to propose marriage to WING-TUNG in front of everybody. During HEUNG WING and WING-TUNG's wedding ceremony, HOK-LAI arrives without being invited. Before the ceremony, HEUNG WING suddenly receives a SMS and he calls off the ceremony in front of everybody. HEUNG WING has received AGENT's video and they believe that AGENT is still alive. HEUNG WING rushes to the SMS sending location and he is shocked to discover HOK-LAI there dressing just like AGENT. HOK-LAI asks HEUNG WING to become a dirty cop again and HEUNG WING accepts the proposal reluctantly……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-30","episode_number":27,"episode_type":"standard","id":893547,"name":"Episode 27","overview":"SAI-LOK finally discovers KA-PIK’s tricks. When KA-PIK and TAK-TIM collect the drugs, the police arrive to capture them. HEUNG WING suddenly receives HOK-LAI's instruction to let KA-PIK go. SAI-LOK airs his grievances to HEUNG WING and he believes that somebody has been helping KA-PIK to escape. HOK-LAI goes to look for KA-PIK in the nightclub. He reveals to her that he has played tricks on SAM-KAU and SAM-KAU has already committed suicide in the prison. KA-PIK is happy to learn the news and she allows HOK-LAI to join her drug trafficking business. HOK-LAI invites CHI-SHING and YAU-FU to come together. HEUNG WING realizes that HOK-LAI wants them to take the black money together and he is very angry. HOK-LAI plays tricks and KAU MAN-LUNG is arrested for possession of drugs. The drug dealers try to punish KA-PIK but HOK-LAI arrives with Columbia drug dealers and he persuades the local drug dealers to collaborate with them……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-31","episode_number":28,"episode_type":"standard","id":893548,"name":"Episode 28","overview":"KA-PIK meets SAI-LOK while visiting KA-CHUN's grave. HOK-LAI deliberately shows off his relationship with KA-PIK in front of SAI-LOK. SAI-LOK and WING-TUNG try to find out how the Columbia drug dealers are shipping their drugs to Hong Kong. WING-TUNG has assigned someone to carry out investigation at the suspicious shipping company. WING-TUNG finally receives the documents from her informer but the contents are replaced already. In order to protect KA-PIK, TAK-TIM begs HOK-LAI to give him a job and HOK-LAI asks him to justify his loyalty by taking drugs. The police come to arrest KA-PIK and TAK-TIM suddenly arrives with a car to rescue her. SAI-LOK fails to capture KA-PIK. SHUI-KI believes that SAI-LOK has released KA-PIK deliberately and he is suspended from his duty. The police have taken away all the drugs but HOK-LAI persuades the Columbia drug dealers to get back the drugs together……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-01","episode_number":29,"episode_type":"standard","id":893549,"name":"Episode 29","overview":"TAK-TIM resorts to drink in the pub. Afterwards, he decides to go to HOK-LAI's office and kill him. KA-PIK rushes to the place and she discovers TAK-TIM falling down from the building. SAI-LOK believes that HOK-LAI will try to get back the drugs with Columbia drug dealers. HOK-LAI asks HEUNG WING to help him and HEUNG WING asks the police to arrest SAI-LOK for loitering. HEUNG WING goes into the warehouse to get the drug samples and he finds some sparkles from the cocaine. HEUNG WING asks his colleagues to move all the drugs out of the warehouse and an ambulance suddenly arrives. SAI-LOK arrives to discover that HEUNG WING is having a gunfight with the drug dealers. Drug dealer JOHNNY tries to shot SAI-LOK and HEI-SUEN protects him with her body. JOHNNY delivers all the drugs to a warehouse successfully and HOK-LAI reveals that the drugs will be shipped away soon……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-02","episode_number":30,"episode_type":"finale","id":893553,"name":"Episode 30","overview":"HOK-LAI ties KA-PIK up in the ambulance and he threatens SAI-LOK to go to the warehouse alone. HOK-LAI asks HEUNG WING to go to the warehouse and he gives him a remote detonator. He asks HEUNG WING to take revenge by pressing the button when the Columbia drug dealers go into the ambulance. HEUNG WING believes that HOK-LAI plans to take ownership of all the drugs. HEUNG WING doesn't know that KA-PIK is trapped in the ambulance and he hesitates. During the time, SAI-LOK also sneaks into the warehouse with weapons. JOHNNY arrives but he fails to get in touch with HOK-LAI. He has no choice but to ask his guys to find the drugs in the ambulance. SAI-LOK discovers HEUNG WING and he asks him to stop. The ambulance suddenly explodes and SAI-LOK shots HEUNG WING. HOK-LAI helps HEUNG WING to escape but HEUNG WING suddenly points his gun towards HOK-LAI……","production_code":"","runtime":45,"season_number":1,"show_id":44442,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":53444,"poster_path":"/nX8rFPe1qkzc6PypBmigV6ChnfF.jpg","season_number":1,"vote_average":0}}}