{"adult":false,"backdrop_path":"/dNNTU3JtfqaZwVwCq1N5y1m41L0.jpg","created_by":[{"id":1247375,"credit_id":"525968f5760ee346619db203","name":"Michael Wood","gender":2,"profile_path":"/2OAsA80K3FUinxeXqdCn47o8hhC.jpg"}],"episode_run_time":[60],"first_air_date":"2012-05-25","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.bbc.co.uk/programmes/p00r12j3","id":44828,"in_production":false,"languages":["en"],"last_air_date":"2012-08-10","last_episode_to_air":{"id":895622,"name":"Modern Britain","overview":"Michael Wood takes an overview of events between the jubilees of 1897 and 2012.","vote_average":0,"vote_count":0,"air_date":"2012-08-10","episode_number":8,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":44828,"still_path":null},"name":"The Great British Story: A People's History","next_episode_to_air":null,"networks":[{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":8,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"The Great British Story: A People's History","overview":"Series looking at history through the eyes of ordinary people. Rulers and royals, lords and ladies have all had their say down the centuries, what were the last 1,600 years like for everyday Britons?","popularity":1.026,"poster_path":"/owi2Cgy6dRFTBK8JMgWxk5oqege.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2012-06-12","episode_count":12,"id":53636,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2012-05-25","episode_count":8,"id":53637,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Miniseries","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"525968f4760ee346619db0a4","air_date":"2012-05-25","episodes":[{"air_date":"2012-05-25","episode_number":1,"episode_type":"standard","id":895616,"name":"Britannia","overview":"Michael Wood kicks off the series by looking at the roots of early Britain. He marvels at the resilience and diversity of its people who turned a small island into a great power, and celebrates \"one of the most astonishing tales in history\". He reveals how the Romans - who named this far corner of their empire 'Britannia' - envied the land of the Britons with its \"winters not too cold, and summers not too hot\".","production_code":"","runtime":60,"season_number":1,"show_id":44828,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-01","episode_number":2,"episode_type":"standard","id":895617,"name":"Tribes to Nations","overview":"Historian Michael Wood presents a series exploring the United Kingdom's remarkable past from the perspective of ordinary people. This second episode explores how our modern ethnic and linguistic identities began to take shape after the Dark Ages, and how English, Scots and Welsh nations emerged under the impact of the Viking invasions. Michael Wood travels across Britain and Ireland to see local communities making exciting new discoveries about their medieval origins - from northern Scotland and County Antrim, to the Black Country, Cornwall and Norfolk, where a huge community dig is discovering the lives of their early Anglo-Saxon ancestors. The tale of the coming of the Vikings is seen from Ireland, the Wirral, Govan and York as the Vikings begin to change the racial and cultural makeup of much of Britain and Ireland. Towards the year 1000, kingdoms have arisen across Britain: the British people have created societies, law and order, and Michael concludes that the dialogue has begun between the rulers and the people.","production_code":"","runtime":60,"season_number":1,"show_id":44828,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-08","episode_number":3,"episode_type":"standard","id":895621,"name":"The Norman Yoke","overview":"The next chapter of The Great British Story begins with the Battle of Hastings and the Norman Conquest, a brutal foreign occupation that will eventually draw in Wales and Ireland too. This episode explores how the Normans consolidated their power by building castles all over England. Michael Wood visits the excavation of an enormous Norman Castle mound at Mount Bures, Essex, and returns to the community big dig at Long Melford to find out what life was like for the Anglo-Saxon peasantry in the decades after 1066. Going into the 12th century, the programme looks at the medieval beginnings of trade and industry in Bristol, Wales and the Black Country. Finally, Michael explores the battle for rights enshrined in Magna Carta with an original copy in Hereford before looking at the Barons' War and the Scottish War of Independence, struggles that will shape the lives of the British people till today.","production_code":"","runtime":60,"season_number":1,"show_id":44828,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-15","episode_number":4,"episode_type":"standard","id":895618,"name":"The Great Rising","overview":"This episode covers the catastrophic 14th century, including the Black Death and the Peasants Revolt. Delving into local records Michael Wood tracks the plague across Britain from Little Cornard in Suffolk to Abergavenny in the Welsh borders, and from St Andrews in Scotland to Dublin. With over half the population dead, British work patterns change in the aftermath. Michael discovers women's roles in the workforce as brewsters and shopkeepers and finds a new class of cloth workers in our Test Dig at Long Melford. The fight for workers rights in the Peasants Revolt is defeated but in the next century peasants rise to become middle class, illustrated by the oldest primary school in Britain. Also, unique letters from a Norfolk village give us medieval womens' takes on love, marriage, and men. Finally in 15th century Lavenham, Michael crawls down a Tudor sewer for some really hands-on history at the beginning of our modern world.","production_code":"","runtime":60,"season_number":1,"show_id":44828,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-20","episode_number":5,"episode_type":"standard","id":895619,"name":"Lost Worlds and New Worlds","overview":"Historian Michael Wood continues his journey exploring the United Kingdom's remarkable past from the perspective of ordinary people. Charting the Reformation, Michael visits a fascinating community project revealing medieval wall paintings in Llancarfan, near Cardiff, and follows the Cornish Prayer Book rebellion from one parish to its defeat in battle by the government's army in Exeter. As the Reformation proceeds, other forces are working in British society with the rise of industry and commerce. In Scotland there's the amazing discovery of the remains of a mine dug under the River Forth. In Bristol, Tudor merchants open up Atlantic trade and the first black community is found in Whitechapel, London. The tale opens out to the Elizabethan conquest of Ireland where Michael examines a unique Gaelic and English phrase book written for Elizabeth herself in the hope of better Anglo-Irish understanding. By the 1580s the establishment had triumphed and the old world was all but swept away. The programme traces the rise of radical religious ideas at Scrooby, Nottinghamshire, ideas that would lead to the radicalism of the mid century in England and the Pilgrim Fathers in America and as a woman at the village fete said: 'America began here in Scrooby'!","production_code":"","runtime":60,"season_number":1,"show_id":44828,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-27","episode_number":6,"episode_type":"standard","id":895620,"name":"The Age of Revolution","overview":"Historian Michael Wood continues his journey exploring the United Kingdom's remarkable past from the perspective of ordinary people. Michael tells the story of the British Civil Wars, seen from the perspective of the people right across the British Isles. In search of their experience he travels to Dublin to uncover the horrors of the Irish Rebellion, to County Down with the Ulster Scots, and to Cornwall where an amazing local project is mapping the battlefield finds of Parliament's greatest defeat. Uncovering little known stories in the arms manufacturing centres of the Black Country and Birmingham, Michael shows how the war split local communities. In Myddle, in Shropshire, a unique village account gives a vivid portrait of the young men who died in the war. In the aftermath with the monarchy overthrown and the king executed, revolutionary movements rise up, Levellers and Diggers, which Michael argues are the roots of our modern British democracy. The episode ends with the monarchy restored, and the British people united under one crown, on the verge of the Age of Industry.","production_code":"","runtime":60,"season_number":1,"show_id":44828,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-03","episode_number":7,"episode_type":"standard","id":895623,"name":"Industry and Empire","overview":"Michael Wood uncovers the extraordinary tale of the Industrial Revolution which turned Britain into the world's first industrial society. Exploring the deep roots of British industry, Michael visits the Free Miners of the Forest of Dean, the flax mills of Northern Ireland, the Cornish tin mines, the Potteries and the world's first centre of copper production in South Wales. In Liverpool he shows how slavery underpinned British wealth and trade, which was expanding to India. As urban society grew and the countryside was depopulated by enclosures and clearances, on the island of Skye, at Tolpuddle in Dorset and at Downton in Wiltshire, Michael shows how the rural workforce responded. Meanwhile, Enlightenment ideals were transforming society, from Armagh, with its great library and observatory to Birmingham, home to the Lunar Society and James Watt's steam engine. In Manchester, the 'shock city' of the age, Michael joins an excavation in the Angel Meadow slum and meets the descendants of poor families who lived there. With British society transformed into an urban proletariat, Michael looks finally at the social progress of the late Victorian age and the migrations which took vast numbers of ordinary people from all over the British Isles to the farthest corners of the globe.","production_code":"","runtime":60,"season_number":1,"show_id":44828,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-08-10","episode_number":8,"episode_type":"finale","id":895622,"name":"Modern Britain","overview":"Michael Wood takes an overview of events between the jubilees of 1897 and 2012.","production_code":"","runtime":60,"season_number":1,"show_id":44828,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":53637,"poster_path":null,"season_number":1,"vote_average":0}}}