{
    "adult": false,
    "backdrop_path": "/8i1ZkSkWKPV3OFjSDYYO0XDs0HF.jpg",
    "created_by": [],
    "episode_run_time": [
        22
    ],
    "first_air_date": "2013-01-01",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "",
    "id": 45673,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2013-08-06",
    "last_episode_to_air": {
        "id": 904211,
        "name": "Russian Roulette",
        "overview": "Wayne had received numerous phone calls from Degrassi, the guy that scammed him on the hot dog cart business; later, he left for unknown business, knowing that he was supposed to return on time to join Randy for an important meeting that could open up a lucrative opportunity for Royal Jewelry. Later, a customer recovered Wayne's \"lost\" wallet. And when it came time for the meeting, Wayne was a no-show. But when Wayne's wife said that he wasn't at home, Randy fears that Wayne was a victim of foul play.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2013-08-06",
        "episode_number": 17,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 22,
        "season_number": 1,
        "show_id": 45673,
        "still_path": null
    },
    "name": "Hardcore Pawn: Chicago",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 364,
            "logo_path": "/c48pVcWAEYhEFXrWFsYxx343mjx.png",
            "name": "truTV",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 17,
    "number_of_seasons": 2,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "Hardcore Pawn: Chicago",
    "overview": "A spin-off of Hardcore Pawn, the series follows the day-to-day operations of the Royal Pawn Shop located in Chicago, Illinois at 428 S. Clark Street, across from the Metropolitan Correctional Center near Chicago's Financial District.",
    "popularity": 0.927,
    "poster_path": "/x1wETRvNG9CvqQehdTQadyUEBJH.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "US",
            "name": "United States of America"
        }
    ],
    "seasons": [
        {
            "air_date": "2013-01-01",
            "episode_count": 17,
            "id": 54226,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": null,
            "episode_count": 0,
            "id": 54227,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 5.4,
    "vote_count": 8,
    "season_data": {
        "1": {
            "_id": "52596cb4760ee34661a0ec4c",
            "air_date": "2013-01-01",
            "episodes": [
                {
                    "air_date": "2013-01-01",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 904203,
                    "name": "Something's Missing",
                    "overview": "The goings-on at a family-run Chicago pawn shop are documented. In the series premiere, a ring worth $80,000 goes missing, touching off an edition of the blame game. Meanwhile, a dissatisfied customer blows her top and then takes her gripe to the top; and an employee tries to authenticate signed astronaut photos that were brought in.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-08",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 904207,
                    "name": "Wedding Crashers",
                    "overview": "Royal Pawn Shop normally doesn't sell bridal dresses, but with a bridal fair going on that weekend in Chicago, Wayne had a bright idea -- buy used bridal dresses in bulk and sell them for a profit. While his sale drew in a lot of brides-to-be, Wayne finds out the hard way that he doesn't know a thing about selling bridal dresses.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 904208,
                    "name": "Changing of the Guard",
                    "overview": "Randy notices that the security crew, including Carlos and Rogers, are not only late in opening the store, but they have become lax in their security details, leading to a television being stolen under their noses while the thief's accomplice complains over the value of a mink coat. At that point, Randy placed Carlos and Rogers on notice -- one more mistake and they're fired. Furthermore, Elyse volunteers to be their security supervisor, despite Randy's doubts. Later, Carlos and Rogers would prove that they were serious about their employment when they confront a guitar thief, while that thief's accomplice complains about his \"stolen\" laptop.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-22",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 904204,
                    "name": "The Kids Are All Right",
                    "overview": "Randy and Wayne drive to the suburbs to visit a man who's selling everything in his \"man cave\", including sports memorabilia, but the price Randy and Wayne will pay will come down to a turn of a card. Meanwhile, Elyse and Nate watch over the store, but when Hymie called in sick, they had no choice but to wing it with their own intuition, which ended up proving very costly for the store -- until a customer came in with a rare opal.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-01-29",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 904202,
                    "name": "The Competition",
                    "overview": "When Randy noticed that Wayne had sold a Rolex watch to a chain smoker for less than value, he challenges him to a contest -- the man who sells the least amount of items in monetary value must parade up and down Clark Street in a \"money suit\", advertising the store.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-05",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 904199,
                    "name": "Paranormal Pawn",
                    "overview": "Wayne and Randy take in some Freemasonry memorabilia from a family who believed that their house became haunted because of it. However, after they took possession of it, the store itself became haunted, to a point where it took a dangerous turn when Hymie accidentally dropped acid used for gold testing in his eye instead of eye drops, which was right next to the bottle of acid. As a result, Wayne became reluctant to buy the items for any price, as he fears for his life, but Randy, however, was still game, chalking everything up to odd coincidences.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-12",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 904210,
                    "name": "Two Heads are Better Than One",
                    "overview": "An unusual item could lead to a killer payday; and soft-touch Wayne falls for a woman's sob story, which leads to a fraternal fracas. Meanwhile, a perturbed ex-con poses a threat to the shop.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-19",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 904196,
                    "name": "A Dangerous Combination: Part 1",
                    "overview": "A man came in to sell a safe originally used at a hotel, dating back to Chicago's gangster era. Randy refuses to buy the safe, but Wayne buys it behind his back. A buyer is interested in purchasing the safe, but Wayne wants to know what was inside first. Also: a man gets very belligerent when he demands proper payment for his heavily-flawed diamond. And another man came to pawn his 1969 Yenko Camaro, but Randy tries to talk him into selling it instead.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-02-26",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 904198,
                    "name": "A Dangerous Combination: Part 2",
                    "overview": "Continuing from last episode, Wayne tried to get a safecracker to open the safe, but failing that, he had someone come and drill the safe open -- something that costs $300 to do, furthering Randy's anger about the situation. Whether or not Randy's attitude changes depends on the contents of the safe. Also: a couple try to sell several designer handbags, which was proven by an expert to be fake.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-06-18",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 904197,
                    "name": "Pawned Off",
                    "overview": "A customer comes in to redeem his pawn of a late-19th Century Hamilton railroader's watch -- a family heirloom -- but no one was able to find the watch. Later, he gets very angry when he found out that Hymie sold the watch by mistake, and he refuses any money to make up for it. As a result, Randy and Wayne visit the person who bought the watch, with Randy offering as much money as it takes to get it back -- but the buyer refuses to sell the watch back at any cost. But Wayne comes up with a solution, involving the watch's backstory.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-06-25",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 4625064,
                    "name": "Hot or Not?",
                    "overview": "",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-02",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 904205,
                    "name": "Lucky Horseshoe?",
                    "overview": "Wayne purchases a horseshoe signed by famed jockey Willie Shoemaker that was said to have been used on his last winning racehorse, Beau Genius. The sale also includes a tip on a longshot on a racehorse at a local track. While the horseshoe and signature was proved to be fake, Wayne still hopes that it'll give him luck, in hopes that the tip would lead to a win.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-09",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 904200,
                    "name": "Hot Dog Cart Pt. 1",
                    "overview": "Carlos, fed up for not getting enough pay for his security guard work, walks off the job, forcing Randy and Wayne to find a substitute. Also: Randy and Wayne purchase a velvet-lined case that claimed to have come from the gangster era and once contained a Tommy Gun. And Wayne walks away from making a deal on a hot dog cart, but when he realised that he could make a profit on it, he changes his mind -- behind Randy's back.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-16",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 904201,
                    "name": "Hot Dog Cart: Part 2",
                    "overview": "Wayne decides to use the hot dog cart to start a new sideline for Royal Jewelry -- selling hot dogs on the street, so he set up a deal with a shady customer to supply him with hot dogs, buns, and a license. But Wayne ended up learning about food sales the hard way -- from the lobster restaurant next door (for stealing his customers), another hot dog vendor (for invading his territory), the sanitary inspector (for selling spoiled, out of date hot dogs without a license), Wayne's shady \"supplier\" (for making him look bad), and even Randy (for losing money for the pawn shop).",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-23",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 904206,
                    "name": "Diamonds Are Forever",
                    "overview": "For $60,000, Randy and Wayne buy a set of flawless diamonds that Wayne thinks was cut from the Marlborough diamond, a 26-carat diamond that was part of a 1980 London robbery committed by two Chicago-based mafiosi: Joseph Scalise and Arthur Rachel.[14][15] While Randy would rather just have the diamonds certified, Wayne had a diamond expert friend of his examine them instead, thinking that if it was the Marlborough diamond, he could get reward money exceeding the money they paid for them.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-07-30",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 904209,
                    "name": "Comic Book Caper",
                    "overview": "A mother of her son away at college makes a deal with Wayne and Randy to sell his comic books for $100, after an expert they hired determined their value. However, she later called off the deal when she got a better offer from another dealer, who was offering her $200. They would later find out that that other seller was actually the expert that they hired. Furthermore, they found the reason why the expert wanted the comics -- it included a copy of Amazing Fantasy #15, which featured the debut of Spider Man, valued at around $12,000.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-08-06",
                    "episode_number": 17,
                    "episode_type": "finale",
                    "id": 904211,
                    "name": "Russian Roulette",
                    "overview": "Wayne had received numerous phone calls from Degrassi, the guy that scammed him on the hot dog cart business; later, he left for unknown business, knowing that he was supposed to return on time to join Randy for an important meeting that could open up a lucrative opportunity for Royal Jewelry. Later, a customer recovered Wayne's \"lost\" wallet. And when it came time for the meeting, Wayne was a no-show. But when Wayne's wife said that he wasn't at home, Randy fears that Wayne was a victim of foul play.",
                    "production_code": "",
                    "runtime": 22,
                    "season_number": 1,
                    "show_id": 45673,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 54226,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "52596cb4760ee34661a0ec57",
            "air_date": null,
            "episodes": [],
            "name": "Season 2",
            "overview": "",
            "id": 54227,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    }
}