{"adult":false,"backdrop_path":"/m2Csyrc0mknBkqG72bdHIEiwXYN.jpg","created_by":[{"id":1560869,"credit_id":"56917a6e92514179a0000c3b","name":"Thomas Romain","gender":2,"profile_path":null},{"id":1560870,"credit_id":"56917a79925141799e0009f3","name":"Tania Palumbo","gender":0,"profile_path":null}],"episode_run_time":[23],"first_air_date":"2003-09-03","genres":[{"id":10765,"name":"Sci-Fi & Fantasy"},{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"},{"id":10759,"name":"Action & Adventure"}],"homepage":"http://codelyoko.fr","id":4622,"in_production":false,"languages":["fr"],"last_air_date":"2007-11-10","last_episode_to_air":{"id":335419,"name":"Echoes","overview":"With their mission completed, the group looks back on all their fond memories of Lyoko. Sissi, meanwhile, plants a tracking device on Ulrich in order to discover their secret. When it comes time to shut down the supercomputer, all but Yumi are unwilling to go through with it: Aelita is still holding onto the hope that her father can somehow be saved, Jeremie doesn't want to take away the thing which made them friends, and Odd and Ulrich both liked being heroes. While they muse over their attachments to Lyoko, Sissi finds her way into the computer lab, and Jeremie's open diary reveals the whole of their adventures. When Sissi tries to explain this to her father, he believes she has lost it and sends her to the infirmary. A return to the past deals with that problem. Ulrich stops Sissi from planting the tracker on the repeat attempt, and the quintet invites her as a friend. Once more at the supercomputer, the group unanimously decides to shut it down, closing the book on their adventures, for now.","vote_average":10,"vote_count":1,"air_date":"2007-11-10","episode_number":30,"episode_type":"finale","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/bEtWAiO4pbumT5dDxpS342uhhi6.jpg"},"name":"Code Lyoko","next_episode_to_air":null,"networks":[{"id":249,"logo_path":"/1ePfTUHHvBlVQxa0Fltx5kWhIs5.png","name":"France 3","origin_country":"FR"}],"number_of_episodes":95,"number_of_seasons":4,"origin_country":["FR"],"original_language":"fr","original_name":"Code Lyoko","overview":"Code Lyoko centers on four children who travel to the virtual world of Lyoko to battle against a sentient artificial intelligence named XANA, with a virtual human called Aelita.","popularity":18.782,"poster_path":"/86LdmxBCP9ghdtATP4WjN29vSqP.jpg","production_companies":[{"id":62041,"logo_path":"/bpwbP4LWzTGOYrGciytKcAaeW5X.png","name":"MoonScoop","origin_country":"FR"},{"id":130265,"logo_path":"/j1T7FkYoncVpTi3CylwiiBPvRwV.png","name":"Antefilms Production","origin_country":""}],"production_countries":[],"seasons":[{"air_date":"2001-06-04","episode_count":3,"id":14118,"name":"Specials","overview":"First episode where they discover the factory.","poster_path":"/aSj7md7mtEcBCKYvojmWiMQYPMg.jpg","season_number":0,"vote_average":0},{"air_date":"2003-09-03","episode_count":26,"id":14113,"name":"Season 1","overview":"","poster_path":"/mv0mbvBh9LHMzKl8UdorwM9M1xM.jpg","season_number":1,"vote_average":9.3},{"air_date":"2005-08-31","episode_count":26,"id":14114,"name":"Season 2","overview":"","poster_path":"/kZrWH0suHet8XfWk1nqcrc4tegi.jpg","season_number":2,"vote_average":9.3},{"air_date":"2006-09-09","episode_count":13,"id":14115,"name":"Season 3","overview":"","poster_path":"/8VtS52DUmq2neijF1xqmqJHUvhK.jpg","season_number":3,"vote_average":9.2},{"air_date":"2007-08-13","episode_count":30,"id":14116,"name":"Season 4","overview":"","poster_path":"/3ag8kIlGz4nhbRlHtPAGZdrbUFd.jpg","season_number":4,"vote_average":9.3}],"spoken_languages":[{"english_name":"French","iso_639_1":"fr","name":"Français"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.225,"vote_count":51,"season_data":{"1":{"_id":"5257772e760ee36aaa539785","air_date":"2003-09-03","episodes":[{"air_date":"2003-09-03","episode_number":1,"episode_type":"standard","id":335326,"name":"Teddygozilla","overview":"A student named Milly seeks the comfort of her teddy bear after being embarrassed and ostracized due to her young age by Sissi, the school's bully/diva.  Milly believes that her teddy is the only one that she can turn to for comfort and support.  A corrupted super computer known as X.A.N.A. enters the real world by possessing the bear.  In a quest to strike and destroy his enemies, the X.A.N.A infected teddy bear increases to an enormous size.  No one is safe as this monstrosity creates a path of destruction.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/ouAvqOlcVEbYoWFuK0AeWenXxxX.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2003-09-10","episode_number":2,"episode_type":"standard","id":335327,"name":"Seeing Is Believing","overview":"Odd decides to start a music band with his friends. But Jeremy can't play, so they try to hire a drummer.  In the end, the best drummer they can find is Nicholas (Sissi's blond-haired crony).  As the group argues over whether or not to let Nicholas join the band (Ulrich and Yumi: Pro-Nicholas. Odd: Anti-Nicholas, Pro-Naomi), Jeremie alerts them that XANA is planning to overload a pylon and send this massive electric current through the telephone wires to blow up a nuclear power plant.  Just in the nick of time, Aelita, Ulrich, and Odd stop XANA's plan.  At the end of the episode, Odd gives in and allows Nicholas to be the drummer of his rock band.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/6HVTK5uiUAbgTn8XJOYyCCgmu3N.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-09-17","episode_number":3,"episode_type":"standard","id":335328,"name":"Holiday in the Fog","overview":"Ulrich and Jeremy are doing graffiti on a wall on campus while Kiwi wakes up Jim. When Jim passes Ulrich and Jeremy, Ulrich gets away, but Jeremy just stays there and gets I'm trouble and has to stay in the campus over vacation. Sissy is being suspicious of Jeremy and thinks that he wanted to get in trouble. She asks her father to stay over the campus over her vacation, while she sorta spies on Jeremy. Jim is telling Jeremy to wash off the graffiti, then leaves while Jeremy gives Sissy the sponge and tells her (while mimicking Jim) to wash off the paint and later once again gets in trouble with Jeremy.\n\nMeanwhile, Xana has attacked again, this time spilling two toxic chemicals creating hazardous smoke. Sissy claims that she saw the smoke with arms and bumps into Jim who later finds the smoke after not believing in Jeremy and go into a small room where there is no vent and if they try to open the door, they can die. How will Yumi, Aelita, and Odd save  the world and how will Ulrick find","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/ouAvqOlcVEbYoWFuK0AeWenXxxX.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-10-01","episode_number":4,"episode_type":"standard","id":335329,"name":"Log Book","overview":"Sissi has found something very special and dear to Ulrich, his diary!  Unfortunately the diary contains some information on X.A.N.A. and Lyoko.  Sissi decides to use this as a means of blackmail to get with Ulrich.  Later Odd, Ulrich, Sissi, and some of the other students are going to a pool, the bus that their riding in is X.A.N.A.'s next target.  He wants to ram the bus into a chemical plant.  Now the team must head to Lyoko to help Aelita get to the tower to save the students and the rest of the city.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/cBb7kKn69ihTfSljNfmjpxKWBou.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-10-01","episode_number":5,"episode_type":"standard","id":335330,"name":"Big Bug","overview":"The day starts off when two girls are talking about Ulrich and then Sissi goes and interrupts and tells the girls that Ulrich is hiding his affections for her. Later, Odd, and Ulrich pull a prank on Sissi, giving her a txt message about a \"\"true love\"\". While the prank is being set, people in the town are experiencing difficulties due to a strange virus, now 2 trains are going on a collision course and one of the trains has highly toxic chemicals which can kill the town's population.\n\nYumi cannot contact Ulrich and Odd because they shut off their mobiles. The prank is being set and Sissi opens a shed which happens to be Kiwi (Odd's dog)in there and jump om Sissy. Then Od gets in trouble after bringing Kiwi on the campus. Yumi finds the 2 and try to go to the factory, but Odd is stopped by Jim and is carried over to the principal. Now to help Aelida fix Xana, they will need everyone in the group, where is Odd when you need him?","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/qgcHrJ7AXfiDe7eN3diXo6M9CIg.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-10-08","episode_number":6,"episode_type":"standard","id":335331,"name":"Cruel Dilemma","overview":"Jeremie is working on the materialization program, and finally gets it.  Jeremie wants to matierialize Aelita, but realizes that preparations need to be made.  That night, Xana possesses two bulldozers and starts to destroy the factory.  Odd and Yumi go into Lyoko where she falls into a virtual black hole.  In order to save Yumi's life, Jeremie has to choose between either materializing her or Aelita.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/aPyivkqtlyEFx6ZNG7FONCtbsJI.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-10-15","episode_number":7,"episode_type":"standard","id":335332,"name":"Image Problem","overview":"This episode starts out as Yumi and Aelita are running inside Lyoko looking for the activated tower. Then Yumi suddenly disappears! She comes out of Lyoko exhausted, and looks just fine! Until Yumi Comes into Jeremy's room and takes off Jeremy's glasses and deeply gazes into his eyes and Odd and Urick come in the room and they are shocked. Then Jeremy realizes that Yumi is being controlled by Xana! Then Odd, Ulrich and supposedly Yumi.... get digitized. Yumi breaks out and trys to destroy the factory. Until they find the \"\"real\"\" Yumi in an orb and then they destroy the bad Yumi and the show ends.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/6hoACMbV8ZKN4Ru6XMfuR9wvvDh.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-10-22","episode_number":8,"episode_type":"standard","id":335333,"name":"End of Take","overview":"When a director comes to town to film a movie, XANA posseses a plastic alien model in order to destroy Ulrich and the others.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/dwHb2c2TprnRNZmYCytjvzi3umD.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-10-29","episode_number":9,"episode_type":"standard","id":335334,"name":"Satellite","overview":"When all the student's cell phone goes off in class, it starts Sissy on a petition to save her cell phone--but it's goes awry when Odd breaks into the school's office's locker to get his, Ulrich, & Yumi's cell phone.  It turns out that X.A.N.A. is trying to get out board a highly powerful miltiary satellite in space.  X.A.N.A.'s target turns out be our heroes.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/kCI1YDSXyVmdSSfErxGjBpYPIeq.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-11-05","episode_number":10,"episode_type":"standard","id":335335,"name":"The Girl of the Dreams","overview":"Jeremie mysteriously loses contact with Aelita. The same day, a new student named Taelia (who looks alot like Aelita) arrives at school.  Jeremie is convinced that Taelia is Aelita devirtualized, but the others aren't too sure.  Meanwhile, XANA posseses an ancient samurai armor that Yumi brought for a project and goes out to kill Jeremie and the others. Jeremie heads to the lab, taking Taelia with him, hoping that she'll get over her \"\"amnesia\"\" and remember that she is Aelita. But what happens when Jeremie discovers that he wrong?","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/jdCXRb77FkUr4N8cy3toWu6f2gR.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-11-12","episode_number":11,"episode_type":"standard","id":335350,"name":"Plagued","overview":"Jeremie learns that he has to take a test. If he passes, he'll get transfered to a new school and nobody will be able to stop XANA.  Speaking of which, XANA takes control of a pack of rats. The rats attack the school and makes it nearly impossible to move around.  Ulrich, Yumi, and Odd get Jim, Sissi, and everyone else to the roof and then proceed to the lab.  Ulrich and Odd are virtualized, while Yumi controls the supercomputer. Does the team stand a chance with Jeremie temporarily gone?","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/gtUbNf8ocpbTCsG3KH7eMMdve5h.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-11-19","episode_number":12,"episode_type":"standard","id":335336,"name":"Swarming Attack","overview":"Ulrich is fussing over a mysterious letter found slipped under his door one night... a love letter signed by Yumi!  Meanwhile, XANA infects a hive of bees and is using it to attack our heroes.  Ulrich struggles with his feelings and how to tell Yumi how he feels about her; that is, if he can figure it out himself, and saving the day from XANA in an episode of life and death.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/hAJfqoFMTMahX06rBM4LZGfh4Rs.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-11-26","episode_number":13,"episode_type":"standard","id":335337,"name":"Just in Time","overview":"The episode starts with Jeremie still trying to materalize Aelita.  He calls the team to the factory to show them his latest development: a strand of her hair that he has materalized into a test tube.  Unfortunately, he didn't realize that he pressed one button too many, and thus screwed up Aelita's programming by adding in a whole lot of bugs.  The result is that, immediately after she successfully enters the code (LYOKO) into a tower, she will be formatted - as in, deleted.  And of course, as Jeremie is trying to literally work out the bugs, Xana attacks by putting out shockwaves to shake things up, putting Odd, the two junior journalists, and Kiwi in danger.  But is Jeremie willing to allow Aelita to be deleted in order to save his friends?","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/pSGRUTT7z1LFCjQYbUOI6jN44N9.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-12-03","episode_number":14,"episode_type":"standard","id":335338,"name":"The Trap","overview":"It's the anniversary of the day Jeremie and the others met Aelita.  They begin planning a surprise for her, unaware that Sissi is spying.  When Jeremie and Odd try to open the lab elevator, it won't work.  They go to the control room to see what's wrong and XANA uses the machinery in the room to attack them. They escape and reach the lab basement.  Meanwhile, Ulrich and Yumi get to the elevator.  This time it opens.  Sissi gets in with them at the last moment, but just then XANA causes the elevator to plummet down the chute. Yumi escapes to go join Jeremy and Odd in the lab. Back at the elevator, water leaks from the walls and begins to drown Ulrich and Sissi.  Ulrich promises that if they get out alive, he'll be nicer to Sissi.  Aelita manages to input Code Lyoko and reset time just Ulrich and Sissi begin to drown.  At the end, Jeremie and the others present Aelita with an anniversary cake and Ulrich keeps his the promise he made to Sissi in the elevator.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/uWGXDyQpEHboLHsGlsqboE8OLgN.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-12-10","episode_number":15,"episode_type":"standard","id":335351,"name":"Laughing Fit","overview":"After seeing laughing gas in Science class, Team Lyoko has to see it again - working for Xana.  While working for Sissy in a school production of Romeo and Juliet, Ulrich and Yumi are overcome by the gas, and both Jeremie and Odd get a bit too much at the factory.  Of course, this results in a data transfer error, leaving Odd bearly able to walk, much less fight off Xana's hordes of monsters.  With Aelita flying solo and three of the team in critical condition, will the crew literally die laughing?","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/mjEaouoNooBPf0o39GJr03D3B7p.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-12-17","episode_number":16,"episode_type":"standard","id":335339,"name":"Claustrophobia","overview":"After a quick game of soccer, Yumi heads home for the night, but Odd and Ulrich head in for dinner, and Jeremie is already there.  He decides to check on Aelita, and Yumi ends up following him instead.  But, while scarfing the desserts the others left behind, he and Ulrich get caught up in a shocking Xana trap.  Not only is the lunchroom electrified, the roof may fall in at any time.  Even the combined power of the eight kids trapped inside - including Odd, Ulrich, and Sissy - can only delay Xana for a short time.  Will Yumi be able to get Aelita to the tower before the room becomes a final resting place for our heroes?","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/hlxjuXa4gjoOPIhZyU1q6qUnCfU.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-12-24","episode_number":17,"episode_type":"standard","id":335340,"name":"Amnesia","overview":"When learning about NanoDoctors, small robots being designed to cure dieases, Ulrich holds some gel that the NanoDoctors would live in. Od pranks him and pushes the gel into Ulrich's face, and some minutes later Ulrich suddenly faints and loses his memory.  Strangely, amnesia spreads throughout the school, and Jeremy and Od think it's Xana at work. Yumi and Od are virtualized while Ulrich escapes from Sissy, who's trying to convince him they're in love. Ulrich gets virtualized and re-learns how to fight from Od. They help Aileta deactivate the tower. It ends up being the NanoDoctor's gel habitat was infested by Xana Nano-Virii and got up Ulrich's nose.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/BXNp3f78HTyrph6zqzswe0eiua.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2003-12-31","episode_number":18,"episode_type":"standard","id":335341,"name":"Killer Music","overview":"A new rock song Odd downloads sends him into a coma, and the same song is passed through the school.  XANA's new beat is the cause, and he can broadcast it anywhere.  The hospital is full to bursting with cases, and Odd's heart gets weaker with every beat it makes.  But when the tune starts playing in the factory, will the crew learn that music can do more than just soothe the soul?  And, will Aelita be able to save the crew?  It's all up to a leap of faith...","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/tN75sFVSmh4qPNHo2XULkVi6YEY.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-01-07","episode_number":19,"episode_type":"standard","id":335342,"name":"Frontier","overview":"Jeremie is now taking his \"\"Materalize Aelita!\"\" campaign to levels unknown - quite literally.  He virtualizes himself, but there isn't enough memory in the system to complete the transfer, and Jeremie is caught between worlds.  It will take more memory than the factory has to complete the transfer back to Earth, and if the crew doesn't hurry, Jeremie will be deleted as an old file!  Could this be the final frontier for Jeremie?  Will Yumi be able to pick up the slack?","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/xDeVulec35nm59kquBJiZJBdnDz.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-01-14","episode_number":20,"episode_type":"standard","id":335343,"name":"The Robots","overview":"Both Herb & Jeremy are in a robot competition Herb with \"\"Iron Sissy\"\", and Jeremy with \"\"Kiwi 2.\"\"  Herb cheats by launching a gear from Sissy to destroy \"\"Kiwi 2.\"\"  Meanwhile, Xana's latest plan, using the factory to built a robot.  Ulrich & Yumi get help from Herb in slow down Xana's robot.  Jeremy discover that Xana robot had built in the factory and messed with computer that goes to Lyoko. Jeremy fixes the super computer, and Odd helps out Alieta in Lyoko.  After the time reboot, Kiwi 2 dodges Herb's gear to win the contest.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/pQb5tUR5js3LX6TYWNkg3Qc5xfM.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-01-21","episode_number":21,"episode_type":"standard","id":335344,"name":"Zero Gravity Zone","overview":"Xana decided to get rid of everyone by using the power of Gravity, and Yumi, Odd, and Jeremy went to the factory, but Ulrich had a soccer game, and his Dad was there, and as Odd said: If you're not first, then you're not good in his book. Ulrich had to save Mrs. Hertz though, because she was in the science lab. So Yumi and Odd went to Lyoko, but a huge swarm of monsters reached them, and Yumi and Odd had to clear a path for Aelita, and Yumi created a rock shield with her Telekenesis, but Yumi's Telekenisis didn't last very long, so Aelita decided to go across another way. She ended up getting hit and she fell off the bridge she was materializing. Odd and Yumi were in disbelief. But, Aelita appeared right behind them. Ulrich slammed through the science lab window, trying to save his dad, leaving Sissy with Mrs. Hertz.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/6XvQe6Tv80QQFa1LwcubEhxORLd.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-01-28","episode_number":22,"episode_type":"standard","id":335345,"name":"Routine","overview":"Ulrich is getting tired of getting being rebooted so many times and waiting to find out if Yumi has feelings for him or not.  He thinks these are his only troubles, but he is not counting on two things: 1) Sissy getting in the way again and 2) Xana's latest attack which is quite deadly.  He disconnects the scanners that makes the return to the real world if he or any of the gang lose all their life points.  Instead of returning devirtualized, they could die in Lyoko.  Can Aelita shut down the tower in time?","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/hN9bqtXTrUJWLBblQtMjkupkp2s.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-02-04","episode_number":23,"episode_type":"standard","id":335346,"name":"Rock Bottom?","overview":"Well, it starts off as Yumi wanting to have a party at her house. Of course, Odd jumps into action, and says that he has the Deejay problem all solved, they weren't going to listen to Sissy's music. But, oddly, Jeremy couldn't get a connection with Lyoko. Later, Odd and Ulrich are having sliding contests across the floor, but soon, a picture of the Deejay Odd was getting fell on the floor. Ulrich and Jeremy saw is and they asked who it was. Odd said it wasn't important, and he had some stuff to do. Later, again, Odd saw Samantha, the Deejay he was getting, and obviously, he happened to know her. They got into the Comp.  Lab, and Sam wanted to take the most powerful laptop there.\n\nJim went in and saw Odd holding the laptop. He scolded Odd, and he ended up getting out. But, they saw Xana attacking. They went to go and rescue Samantha, as she was still in the lab. Yumi and Jeremy went to the factory. Ulrich and Odd saved Samantha, but when Yumi got to Lyoko, she was materialized as soon as","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/qktMSmU8eIxerrKNztO0UZJDupF.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-02-11","episode_number":24,"episode_type":"standard","id":335347,"name":"Ghost Channel","overview":"One day at school, Jeremy notices that Odd, Ulrich, and Yumi are missing. Meanwhile, Odd, Ulrich, and Yumi ARE at school with Jeremy! What's going on? Turns out that XANA (in the form of Jeremy) has trapped Odd, Ulrich, and Yumi in a virtual world identical to the boarding school, completely at his mercy. With Aelita's help, Jeremy reaches the fake school and tries to convince his friends that he is the real Jeremy and that the imposter is XANA. When they learn that Jeremy got into the scanner to come here, XANA claims that Jeremy is the fake because he would never go into the scanner. But the others say that if his friends were in danger, he would. XANA gets angry and tries to crush everyone with wires and holographic zombies of Jim, Nicholas, and Herve. But Aelita destroys the false school just in time, foiling XANA's plan.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/bLFGyJ9e2XcjUvEANTGBk9L7qcB.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[{"character":"","credit_id":"52577731760ee36aaa5399b9","order":500,"adult":false,"gender":2,"id":1237646,"known_for_department":"Acting","name":"David Gasman","original_name":"David Gasman","popularity":1.947,"profile_path":"/yQMHhOw6KLMoqneTWfLEC7Sfcry.jpg"}]},{"air_date":"2004-02-18","episode_number":25,"episode_type":"standard","id":335348,"name":"Code: Earth","overview":"As Jeremy is perfecting his materialization program for Aelita, Yumi, Ulrich and Odd are making preparations for her arrival. But as success comes within their grasps, Jim's paranoia aggrivates the already bad situation started by XANA.\n\nDue to his injured ankle Jeremy has no choice but to reveal the existance of Lyoko to Jim so he can get to the warehouse.  In the end XANA's attack is stopped and Aelita has finally been materialized into the real world. Or has she?","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/sgSYo6fi3FH0bjM4DgR6K0hPjsH.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-02-25","episode_number":26,"episode_type":"finale","id":335349,"name":"False Start","overview":"Aelita is materialized, but unfortunately, Xana implanted a virus inside of Aelita, so if Xana dies, so does Aelita. Then Xana decides to attack with bringing his own monsters to Earth. Ulrich and Yumi fight off the monsters, while Odd goes to Lyoko with Aelita. Odd eventually get materialized himself, but luckily, Ulrich and Yumi reach the factory, and fight off the last Hornet, attacking Aelita. She deactivates the Tower, and on the second run, the gang is talking with Aelita, about finding an anti-virus, but Aelita can still be materialized for small visits. So they look ahead to the future, and the episode ends.","production_code":"","runtime":23,"season_number":1,"show_id":4622,"still_path":"/m2Z6Elmz6RwJNDzm5lLvDntEuja.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":14113,"poster_path":"/mv0mbvBh9LHMzKl8UdorwM9M1xM.jpg","season_number":1,"vote_average":9.3},"2":{"_id":"5257772e760ee36aaa53979c","air_date":"2005-08-31","episodes":[{"air_date":"2005-08-31","episode_number":1,"episode_type":"standard","id":335352,"name":"New Order","overview":"After discovering Aelita's link to the supercomputer and the inability to shut off the supercomputer that stems from it, Jeremie works hard to find new and better ways to fight Xana. To that end, he develops new vehicles for the group. He also develops a new tower-scanning program that instantly detects activated towers, allowing Aelita to live on Earth. While adjusting to her new life, the class takes a trip to the nearby woods for a scientific field trip. Ulrich wants to partner up with Yumi, but she's already partnered up with someone named William.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/8GxhMA1HeQqb33nOQsj2p8coaCJ.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-09-07","episode_number":2,"episode_type":"standard","id":335353,"name":"Uncharted Territory","overview":"While Aelita adjusts to her new life on Earth, Jeremie and the others investigate the mysterious owner of the Hermitage, Franz Hopper, and his link to the supercomputer, Lyoko, and Xana. It is discovered that Franz Hopper was in fact a former teacher at Kadic. After being teased by Sissi, Aelita retreats to Lyoko but gets lost. Jeremie finds her in a previously undiscovered fifth sector of Lyoko, The Carthage Region.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/5U88MU4eFTcqpTg7aziZM1YhHT4.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-09-14","episode_number":3,"episode_type":"standard","id":335354,"name":"Exploration","overview":"After discovering The Carthage Region, the group decides to explore it. Yumi is forced to opt out after her continued late-night trips to Lyoko draw the attention of her parents. While on The Carthage Region, Ulrich and Odd get dematerialized but don't appear in the real world, so Yumi sneaks out of the house to go to Lyoko and rescue Aelita from the Scyphozoa while Jeremie searches for a way to recover Odd and Ulrich. Unfortunately, Yumi's parents discover that she is missing and alert the school, who in turn discover that the other four are missing as well.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/97vNJrkIDxHGwpO44RWES4OQvs.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-09-21","episode_number":4,"episode_type":"standard","id":335355,"name":"A Great Day","overview":"After taking another trip to The Carthage Region and returning to the school, Aelita talks to Jeremie about not being human, unaware that Sissi is recording their conversation. On top of that, the data they had retrieved from the Carthage Region takes over the supercomputer and starts running return trips over and over. Jeremie discovers that returning to the past makes X.A.N.A. much stronger and more powerful. During the third return trip, Xana possesses Sissi with his newly strengthened and increased abilities and powers and goes after Ulrich. Not only does the group have to deal with Sissi, but they also have to stop the return trips from continuing.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/cEkLW21x0rzeY9qlan0hMDBBsqG.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-09-28","episode_number":5,"episode_type":"standard","id":335356,"name":"Mister Puck","overview":"When Aelita's dreams and hallucinations become too disruptive to ignore, the group heads to the Hermitage to discover their source. There, Aelita finds a doll she inexplicably recognizes to be Mister Pück. Hidden on this doll is a key to a train station locker, which contains the heavily encrypted diary of Franz Hopper. Upon its discovery, Xana takes action, possessing Jeremie, to ensure they'll never be able to read it. When they deactivate the tower and Jeremie comes to his senses, Yumi explains to Jeremie why Xana can possess him and not Ulrich, Aelita, Odd, or Yumi.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/cjSUeDkIrztiVA745ZvRSYhma2R.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-10-05","episode_number":6,"episode_type":"standard","id":335357,"name":"Saint Valentine's Day","overview":"It's Saint Valentine's Day and love is in the air. Ulrich forgets, so at last minute writes a poem for Yumi. However, when William presents Yumi with flowers, Ulrich gets jealous and reads the poem to Sissi instead, hoping to elicit jealousy from Yumi. The two end up in a fight, both bothered and wondering if the other really likes them. Also, a man possessed by Xana leaves a necklace at Aelita's door, Aelita is convinced that it was Jeremie who got it for her. Since Jeremie didn't actually get it, he's left to wonder who did, and ends up suspecting Odd, who avoids the question. This puts the two at odds, so to speak. Meanwhile, Aelita's necklace takes control of her and forces her to deliver herself to the Scyphozoa. Luckily, Odd arrives in time, and is able to save Aelita from the Scyphozoa by \"threatening\" to kill her.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/7W8wZgQxvBASDSl0U2ASnmOFtor.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-10-12","episode_number":7,"episode_type":"standard","id":335358,"name":"Final Mix","overview":"When the school holds a concert in the gym, William accidentally drops a mixing board for the DJ contest. Odd offers to fix it, and tries to get Jeremie to help. Jeremie is busy, so Aelita offers her help. She easily fixes the device, and finds that she is quite talented in using it. The school is holding its finals, as well, and Odd finds that he is not prepared in the least. Meanwhile, Xana possesses Jim and takes Aelita to the factory in order to deliver her to the Scyphozoa.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/xvxvAqN3zHJHR2H97L70IJV8qVS.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-10-19","episode_number":8,"episode_type":"standard","id":335359,"name":"Missing Link","overview":"During a mission to The Carthage Region, the Scyphozoa attacks Yumi, stealing her human DNA, having her trapped on Lyoko. To make matters worse, it's picture day for her class and she will be suspended if absent. After some discussion, Ulrich gets the idea to have Sissi stand in for Yumi. Strangely, Sissi agrees and asks for nothing in return. During this, Jeremie tries to come up with a way to bring Yumi back. Aelita thinks of a way, but won't tell Jeremie about it. She only tells him once she gets to Lyoko, so he can't object. She begins to transfer her own genetic code to Yumi, which will let Xana take her memory at will, being exposed. Luckily, Odd and Ulrich get there in time to stop her. Meanwhile, Jermie figures out that Yumi's DNA should be stored in XANA's memory, which is accessible through Sector Five.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/53JeqJnrOSj7kKhSjoptMskrHb5.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-10-26","episode_number":9,"episode_type":"standard","id":335360,"name":"The Chips are Down","overview":"When Ulrich learns that Yumi might have to go back to Japan because her father lost his job, he can't accept losing her. After hearing the lottery numbers on the radio though, he gets an idea. Using a return trip, he is able to get a ticket with the winning numbers and give it to Mr. and Mrs. Ishiyama. When the others find out, they kick him out of the group until they can figure out what to do. To make matters worse, Xana activates a tower and possesses Nicolas. On top of that, he creates an army of Krabs to guard it.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/1hB5YX9ZjQbkEkHyb9rJdrbaVfK.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-11-02","episode_number":10,"episode_type":"standard","id":335361,"name":"Marabounta","overview":"After deciphering a part of Franz Hopper's diary, Jeremie gets an idea to make a monster that fights on the side of good. By combining techniques, he makes the Marabounta, a sphere that can replicate itself endlessly and devour any monster it can encase. Though it works quite well to begin with, everything goes wrong when it senses Aelita's virus, which is linked to Xana. After Odd attacks it to save her, the Marabounta goes haywire and threatens to devour all of Lyoko, so XANA sends his monsters to help destroy the Marabounta in order to protect Aelita and her memories. The monsters leave the Lyoko Warriors without causing any trouble.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/mrbzfq0fbirZ3MJzMs4up2qfHm.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-11-09","episode_number":11,"episode_type":"standard","id":335362,"name":"Common Interest","overview":"When the supercomputer's uranium power source begins to fail, Xana is forced to possess a local criminal named Peter Duncan to replace it. The supercomputer's periodic shutdowns threaten not only Xana, but also Aelita, whose heart stops beating with each shutdown.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/uzPPIalVlXN7oVYOLmGhuyLILMO.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-12-07","episode_number":12,"episode_type":"standard","id":335374,"name":"Temptation","overview":"After a Xana attack, Jeremie insists on a return trip, regardless of the fact that Xana didn't even cause any damage. When questioned, he gets defensive and angry, insisting that it's necessary. Further questioning on the matter leads to the same result. After the next return trip, Jeremie is found unconscious in his room. Yumi and Ulrich go searching through Jeremie's room to see what they can find about Jeremie's problem. Upon decoding a video diary that is stored on his computer, they learn that he had been using the return trips to increase his own intelligence. When he's about to be taken to the hospital, Xana attacks, possessing the ambulance and driving it towards the river with Yumi with him. Now the others have to save Jeremie and deactivate the tower without Jeremie's help.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/gkAR5WWHe6XMV7eKhixXw7StwfT.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-11-16","episode_number":13,"episode_type":"standard","id":335369,"name":"A Bad Turn","overview":"Ulrich and William get into a fight over Yumi. When Xana activates a tower and materializes Krabbes, he attacks Yumi's house and destroys two scanners.  While Ulrich is in detention, Yumi defends her family, and Odd distracts the Krabbe at the factory, Aelita has to make her way to the tower without any support.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/l4IH8kcbaYsklkxtKJXnvYzRa7T.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-11-23","episode_number":14,"episode_type":"standard","id":335363,"name":"Attack of the Zombies","overview":"When Xana possesses Kiwi, it turns the little dog into the carrier for a virulent virus that turns those it infects into zombies. To make matters worse, Aelita and Jeremie are stuck in the cafeteria and can't get to the factory. On top of that, Odd is a zombie himself. Jermie and Aelita escape but Ulrich and the other students (except William, who is turned into one himself) fight the rest.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/4VSUbEXUgF6KXx8hcQEmNOSIRfr.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-11-30","episode_number":15,"episode_type":"standard","id":335364,"name":"Ultimatum","overview":"After Xana possesses the principal of the school and kidnaps Odd and Yumi, he gives Jeremie an ultimatum: deliver Aelita to the Scyphozoa or sacrifice Odd and Yumi. However, Jeremie and Aelita go to Sissi for help and Sissi agrees to be tempoarily part of the group to help save her father and eradicate Xana.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/4vk2VCRtT2B2FSKlYccuLF1nPD3.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-12-14","episode_number":16,"episode_type":"standard","id":335365,"name":"A Fine Mess","overview":"After a malfunction and a little bug with the regular materialization program, Odd and Yumi are bugged up, ending up in each others' bodies. Even worse, their atoms start splitting after a while due to being dematerialized, even on Lyoko. The gang has to go to Lyoko and fix the problem before Odd and Yumi disintegrate and disappear forever, but it's not easy when Xana tries to stop them.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/xr2IN1BAxLW5uOEqXqY8RUr3h8N.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-01-11","episode_number":17,"episode_type":"standard","id":335366,"name":"XANA's Kiss","overview":"Xana creates a ghost called a polymorphic specter, that can change its shape or form at will and doesn't need to possess a host, then uses it to drive a wedge between the group by having it kiss people while disguised as them. At the end of the episode Aelita kisses Jeremy to see how he'll react. He (predictably) freezes up.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/eZxLpJHHVTXwL9geLKm3BHn5bEU.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-01-11","episode_number":18,"episode_type":"standard","id":335367,"name":"Vertigo","overview":"After a trip to the Carthage Region, Jeremie believes he has the data necessary to cure Aelita's virus. While the two work on the cure, Odd, Ulrich, and Yumi go to a rock climbing contest. Odd races against Hervé, who is no match for Odd. William then goads Ulrich into racing, despite his obvious reluctance. During the race, Ulrich gets dizzy and falls. Yumi realizes that he must have vertigo. Ulrich, embarrassed, runs off. Meanwhile, Jeremie finds the anti-virus and gives it to Aelita. Despite some problem with the application, it seems to work. However, this does not last. An error in the anti-virus causes her to turn invisible. On top of that, she can't enter the towers on Lyoko, making it impossible for her to stop Xana's latest attack, which is a possessed pack of wolves targeting Odd, Ulrich, and Yumi.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/ti3PMNbRjhLGQVE7j7Ujjn7eMgA.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-01-18","episode_number":19,"episode_type":"standard","id":335368,"name":"Cold War","overview":"Jeremy is woken up to an alarm signal, with no activated towers, so he goes back to sleep. The next morning, while Jeremy and Aelita are investigating Jeremy's computer, Odd looks for his DVD of his movie \"I Guess Our Guest is a Ghost\" to show the famous news reporter T.V. (Thomas Vincint), who is coming to the school to do a report on the lackluster of today's schools. Later, another tower is activated and Odd, Ulrich and Aelita are sent to Lyoko, only for the tower to deactivate itself. Then another tower activates and deactivates. Jeremy and Aelita stay at the factory while Odd, Ulrich, and Yumi go back to school. Finally, one more tower is activated and it starts to snow. Then it turns to a blizzard, trapping the three at the school. While they try to get to the factory, the find Sissi, Hervé, and T.V. in T.V.'s car, crashed into a tree. As the tree timbers, Yumi pushes Ulrich out of the way and gets trapped in the process. Ulrich stays with Yumi and Odd goes to the factory. The tower is deactivated before Yumi and Ulrich freeze to death.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/3aWd11WcVIBXPQf6gsuZnqCBYv.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-01-18","episode_number":20,"episode_type":"standard","id":335370,"name":"Déjà Vu","overview":"Aelita's visions become a problem once again, but not the same visions as before. This time, she has visions of her and Franz Hopper being chased by government agents. The visions come even when she's awake, causing her to lose consciousness while at the pool. Wanting to know the source of the visions, she heads to the Hermitage to learn more about them. Jeremie discovers that Xana is causing the visions through her link to the supercomputer. During the mission to stop them, Aelita breaks away and heads to The Carthage Region, determined to discover the source of the visions.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/dK6K8FB91C8tirx5olpVbRkU2Pr.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-01-25","episode_number":21,"episode_type":"standard","id":335371,"name":"Tip-Top Shape","overview":"During the school physicals, Xana possesses the school nurse, Yolande, and has her kidnap Aelita. The rest of the group beats her to the factory, but has no way to get Aelita from the far more powerful nurse. Having no other choice, Jeremie decides to test out an experiment which will give a person the same powers as one possessed by Xana. To do this, he has to activate a tower like Xana. Jeremie's towers turn green instead of red. Odd volunteers, and is enhanced by a ghost of Jeremie's design. This allows Odd to fight the nurse effectively while the others deactivate the tower. This fortune doesn't last, however. Xana is able to take over Jeremie's tower, reversing the effect of the ghost to drain Odd's energy. And on Lyoko, Xana makes everything invisible. Now the group has to deactivate not only the original tower, but the tower that's draining Odd's energy.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/FHKQFdQjlkEcCqrmFUQ4eMXlw0.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-01-25","episode_number":22,"episode_type":"standard","id":335373,"name":"Is Anybody Out There?","overview":"After reading about a dead man named Leon Corbe, who died during the construction of Kadic, Sissi decides to hold a séance to communicate with him. She manages to convince Ulrich to attend. During the séance, one of Xana's ghosts appears in the form of a four-armed monster. At first, it seem docile, but quickly gets angry and attacks. Ulrich leaves Sissi with Odd while he goes to tell Jeremie. Jeremie can't find an activated tower, which seems wrong considering the situation. As Jim patrols the hallways, he is picked up by an invisible object. Jeremie, Odd, and Ulrich arrive to spray it with a fire extinguisher, confirming that it's a ghost and implying that the super scan is broken. With the ghost on the loose, the group heads off to the factory. After they arrive, Aelita, Odd, and Yumi head to Lyoko. Odd looks for the tower while the other two head to The Carthage Region to fix the super scan. Meanwhile, Jeremie and Ulrich are left to deal with the ghost.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/zshTz4DthVcQfPLrQiMCex1y76J.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-02-01","episode_number":23,"episode_type":"standard","id":335372,"name":"Franz Hopper","overview":"Jeremie discovers five activated towers and gathers the group to take care of them. However, when they arrive at the factory, they find a man at the interface, deactivating the towers as if it were a simple matter to do so. When questioned, the man claims that he's none other than Franz Hopper. However, something seems off about this convenient arrival. Franz says that the scanners cause cell degeneration, and blames it and the destruction of his diary on Jeremie. With everyone except Aelita angry at him, Jeremie calls his father and asks to be withdrawn from Kadic in favor of a school for gifted students – but after he hangs up, while pondering his dilemma, he realizes that there is something inherently wrong with Franz's explanation.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/g3C3RqtGtVJLqOYuvUqCZSqKBIW.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-02-01","episode_number":24,"episode_type":"standard","id":335375,"name":"Contact","overview":"During a short film made by Odd and starring Sissi, Sissi seems to be possessed by a ghost. She does not act as expected, however. Instead, she starts speaking in some strange language, focusing on Jeremie as she does. She is taken to the infirmary as a result. Later on, she walks into Jeremie's room and writes some code on a piece of paper. Jeremie translates the code, revealing a message stating a desire to help. Sissi is sent to the hospital after this, forcing Odd and Yumi to go there and collect her. On a trip to Lyoko, Aelita and Ulrich discover a white tower. Xana isn't happy about the tower, and sends Megatanks to shut it down forcibly. At the same time, it activates a tower and possesses a nurse at the hospital to do the same to Sissi. Odd and Yumi are able to prevent the nurse from doing so. They bring Sissi to the factory to finish the message she started earlier. She manages to type most of it out before Xana succeeds in shutting down the white tower. After Xana's tower is shut down, Jeremie translates the message, revealing that Franz Hopper had activated the white tower.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/mJLmLWdjagQn3VSA1SBtWWuYDyp.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-02-08","episode_number":25,"episode_type":"standard","id":335376,"name":"Revelation","overview":"It's nearing the end of the year and Jeremie's research has hit a dead end. After the group collects some data from The Carthage Region, he plans to use a tower to decipher Franz Hopper's diary. Before the mission, Odd gets a message from a mystery girl. When he goes to meet her, he is attacked by one of Xana's ghosts and locked inside a well at the Hermitage. The ghost then assumes Odd's form and goes to Lyoko in his place. The tower that Xana activated to make the ghost then deactivates, confusing Jeremie. Putting it out of his mind, he begins his plan to decipher the diary. Shortly after they begin, the ghost turns on the group, devirtualizing Yumi and chasing Ulrich away from the tower as three Tarantulas arrive to protect it. At the same time, Xana attempts to take over Jeremie's tower, locking the decoding procedure so they can't abandon it. Jeremie realizes the true nature of the ghost during the fight, and Yumi goes off to find the real Odd. After the ghost proves to be ineffective against Ulrich, it shape-shifts into a clone of Ulrich. In this form, it proves to be an equal match for him. After much fighting, Ulrich finally beats the clone, but is taken out by a Tarantula shortly after. Just when it looks like Jeremie's tower will fall, Franz Hopper steps in and protects it. The diary then decodes fully. After examining the diary, Jeremie tells Aelita that she is Franz Hopper's daughter.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/7riAp8HfL4jcv52xDdIXP4WElE4.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-02-08","episode_number":26,"episode_type":"finale","id":335377,"name":"The Key","overview":"After going through all of Franz Hopper's diary, Jeremie discovers the truth behind the supercomputer, at least to some extent. Hopper had used it quite extensively, to the point of repeating a single day for more than seven years. His sanity degraded throughout the experience. Hopper also revealed that he and Aelita hold the keys to Lyoko, which Xana was after. He only needed her half, now. The keys would allow him to escape the supercomputer. Jeremie also finds a way to free Aelita from the supercomputer. It turns out that Aelita never had a virus. In fact, Xana had been holding onto a piece of her, which was responsible for linking her to the supercomputer. Aelita is not willing to go, angry over the fact that Hopper had essentially taken her life from her. She's also worried that Xana might escape. To that end, she shuts down the supercomputer. Jeremie rescues her, and the group goes to Lyoko to retrieve her fragment. After all their efforts, they seem to succeed, but it turns out to be a fake. Xana manages to devirtualize Aelita's defenders and steal her memory, effectively killing her and allowing him to escape, which shuts down Lyoko in the process. His escape allows Franz Hopper to revive Aelita and Lyoko, restoring all of Aelita's memories in the process. Through the restoration, Aelita finally remembers her past up to the point that she went to Lyoko. With Xana now free and Aelita's memories returned, neither are linked to the supercomputer. This means that they could shut it down, but it would do no good. Unsure of how they'll proceed, Jeremie promises that they'll find a way to stop Xana.","production_code":"","runtime":23,"season_number":2,"show_id":4622,"still_path":"/1QXM3KkTkT189x1EA8abM5ZlrzE.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":14114,"poster_path":"/kZrWH0suHet8XfWk1nqcrc4tegi.jpg","season_number":2,"vote_average":9.3},"3":{"_id":"5257772e760ee36aaa5397ad","air_date":"2006-09-09","episodes":[{"air_date":"2006-09-09","episode_number":1,"episode_type":"standard","id":335378,"name":"Straight To Heart","overview":"On her way to the forest as part of a science class field trip, Yumi becomes the target of the driver and the passengers on the school bus who all have been possessed by X.A.N.A. Meanwhile, Odd decides to compete against Jeremie and Herv in an election for student class representative.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/tPfx4eplMVJWlvLjgs1mQk6sbas.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-09-16","episode_number":2,"episode_type":"standard","id":335379,"name":"Lyoko Minus One","overview":"During a field trip with the rest of her 10th grade class, Yumi finds herself facing off against the students, teachers, and bus driver, all of whom Xana has possessed. At the same time, Xana plans to get rid of Lyoko through an alternate means: destroying each sector one at a time. To this end, he uses the Scyphozoa to possess Aelita and enter Code:XANA into the way tower, wiping out The Forest Sector, realized by Jeremie.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/3MWB377CNBvOVGlG64Niu5l7KzB.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-09-23","episode_number":3,"episode_type":"standard","id":335380,"name":"Tidal Wave","overview":"Xana attacks the Lyoko warriors by possessing a large amount of food. At the same time, he bugs up The Mountain Sector by rising the digital sea, but Odd and Aelita go to Sector 5 to stop him. Xana also mounts an attack on Lyoko's core at the same time.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/w1vYOusUJ2UYyWyPKeseCRLeuzl.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-09-30","episode_number":4,"episode_type":"standard","id":335381,"name":"False Lead","overview":"When Xana hacks into a weapon's manufacturing computer network and leaves a paper trail pointing to Jeremie, government agents arrive at the school looking for him. Then, the whole gang arrive at the factory. When they end up tracking Jeremie to the factory, Xana possesses them for an attack on the supercomputer itself in The Ice Sector, and in The Mountain Sector.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/wjVDSQ4unOypkc5iYwADoK4wwv9.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-10-07","episode_number":5,"episode_type":"standard","id":335382,"name":"Aelita","overview":"Aelita gets mad at Jeremie and she and Odd go into Lyoko without telling anybody, which causes problems. On lyoko, Xana creates a diversion to get everybody to deactivate the tower in The Mountain Sector while the monsters (mostly Mantas and Creepers) worked on destroying the core of Lyoko. Jeremie and Aelita find a strand of DNA that belongs to Franz Hopper, indicating he may be still alive.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/rxqkV8hNYtfFp4GMwmx19UfhUL1.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-10-14","episode_number":6,"episode_type":"standard","id":335383,"name":"The Pretender","overview":"Odd and Ulrich are talking in the shower room when a young boy, Johnny, asks to talk to Ulrich. It turns out that Johnny likes Yumi, and being jealous of that, Ulrich tells him to follow her around to get her attention, which Yumi hates. After following her all day and ending up in the gym, a flock of crows possessed by Xana attacks Yumi. She is beaten unconscious by their electrified beaks and sent to the hospital. Meanwhile, as Jeremie and the others are fighting monsters to deactivate the tower, the Scyphozoa possesses Aelita and has her enter Code:XANA into the way tower, wiping out The Desert Sector for good and leaving Lyoko with two main Sectors - The Mountain Sector and The Ice Sector. Once Jeremie finds out, he activates a return to the past with strong hope for Yumi's life. This episode proves that Ulrich is not as comfortable as being just friends with Yumi as he says he is.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/vF2cjUkH45ftb3LoQGzuxUgM3JT.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-10-21","episode_number":7,"episode_type":"standard","id":335384,"name":"The Secret","overview":"After being rejected by Yumi, William makes it his mission to find out the secret she's hiding. Soon enough, he manages to follow Ulrich and Odd to the factory and learns about Lyoko and Xana. Meanwhile in The Ice Sector, the Scyphozoa possesses Aelita to enter Code:Xana in the way tower, but is devirtualized just in time. The group thinks William's help is going to be quite useful, when a possessed demolition worker sets several bombs in the factory. They take a vote as to whether or not to include William as part of their group, but Yumi votes no and Jeremie initiates a return to the past.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/zwZ5o5UprhvBmeV9DoTIHG8fhWV.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-11-01","episode_number":8,"episode_type":"standard","id":335385,"name":"Temporary Insanity","overview":"Before leaving Sector 5, Odd and Ulrich are hit by a weird red beam from a pair of Mantas. They both eventually begin to act strange in the real world during a school play. They start seeing their environment, people as enemies, and fight as if they were still on Lyoko. They are branded as insane and hospitalized while Jeremie tries to figure out what happened. After finding the cause and devising a cure, Jeremie has Yumi and Aelita break them out of the hospital. Meanwhile, Xana uses their handicap to mount an attack on Lyoko's core. Yumi heads to protect the core, as Aelita tries to help the boys who instead now see the real world while on Lyoko.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/mJyzPIO8qa7dwVeXZVlfDsfj0q2.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-11-02","episode_number":9,"episode_type":"standard","id":335386,"name":"Sabotage","overview":"When Xana sabotages the supercomputer, weird bugs begin cropping up in Lyoko. With its power rapidly draining, Jeremie needs to repair it before it becomes completely useless. However, he seems to forget about boys' dorm inspection, so Jim forces him to stay behind. Meanwhile, Xana possesses vines to trip up the rest of the group, except Aelita. Since the attack keeps draining power from the supercomputer, Aelita purposefully wipes out The Ice Sector leaving The Mountain Sector left.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/857jVYVKGg1OcgFV0chokAMFoXO.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-11-03","episode_number":10,"episode_type":"standard","id":335387,"name":"Nobody in Particular","overview":"During a test to materialize Ulrich directly into Sector 5, his mind and body become separated, leaving Ulrich's body trapped on Lyoko and his spirit stuck on Earth. What's worse, Xana possesses Ulrich's body and uses it to attack the core. Meanwhile, Susan, disappointed with Ulrich's bad grades, tries to place him in remedial classes.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/lJc9DzbfbSVw7TyjHI0DOByQJ73.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-11-06","episode_number":11,"episode_type":"standard","id":335389,"name":"Triple Trouble","overview":"When Odd complains that he doesn't have any cool powers on Lyoko like his friends, Jeremie designs him a teleportation power. It works, but ends up leaving duplicates of himself in the location he teleported from in The Mountain Sector. After trying it twice, Jeremie devirtualizes Odd to find out what went wrong, accidentally creating three clones. Meanwhile, in the real world, Xana attacks using a mysterious smoke that turns anyone it hits to stone. One of Odd's copies gets turned to stone, so the other two Odds must retrieve him before they become unstable and disappear.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/z56zxiyM55Xd1eypPO5lDlBxgIn.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-11-07","episode_number":12,"episode_type":"standard","id":335388,"name":"Double Trouble","overview":"With Xana's attacks becoming more and more difficult to handle, the group contemplates adding another member to the team to make things easier. William is still the prime candidate, but Yumi still doesn't trust him. While Jeremie works on a way to get to Sector 5 directly, Xana makes a clone of him and has it take Jeremie's place. Meanwhile, Yumi has missed one too many classes, and will be expelled if she misses another. Odd and Yumi end up bugged by Jeremie's clone, preventing them from rescuing Aelita from the Scyphozoa. The Scyphozoa possesses Aelita, having her enter Code:Xana into the way tower, wiping out The Mountain Sector, cutting off access to Sector 5. However, Jeremie completes his program to send the group to Sector 5 directly.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/7kyWrybSv8ZELahM9grZ0bPOJa0.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2006-11-08","episode_number":13,"episode_type":"finale","id":335390,"name":"Final Round","overview":"After William is initiated into the group, a series of events leaves only him and Aelita to defend Lyoko's core. During William's first mission to Lyoko, Xana uses the Scyphozoa to possess him, making him the general of a massive army focused on Lyoko's core. Despite their best efforts, the group can't stop the possessed William from destroying the core, which both renders the supercomputer useless and transforms William into a darker, Xana-themed version of himself. Later, in the Hermitage, while the group broods over their predicament, Jeremie receives a coded message directly from the internet, sent by none other than Franz Hopper who somehow survived the destruction of Lyoko.","production_code":"","runtime":23,"season_number":3,"show_id":4622,"still_path":"/bS2zrUPCrbOu3DaMFkAKrpn7Yn9.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":14115,"poster_path":"/8VtS52DUmq2neijF1xqmqJHUvhK.jpg","season_number":3,"vote_average":9.2},"4":{"_id":"5257772e760ee36aaa5397c1","air_date":"2007-08-13","episodes":[{"air_date":"2007-08-13","episode_number":1,"episode_type":"standard","id":335391,"name":"William Returns","overview":"Using the data that Franz Hopper gave them, Jeremie and Aelita succeed in recreating Lyoko, which now holds only Sector Five. Soon after, William is devirtualized, and seems perfectly normal. Sissi decides to make herself \"editor-in-chief\" of Kadic News, much to Milly and Tamiya's dismay. She soon barges into Aelita's room to interview her and is stopped by William. As soon as William makes Sissi, timay and milly leave,William kidnaps Aelita and takes her to Lyoko. William leads Aelita out of Sector Five and to what used to be The Desert Sector. His intent is revealed to throw Aelita into the Digital Sea. Odd manages to stop him, but William dives into the digital sea. Jeremie concludes that this is Xana's new strategy, and that they must be careful.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/nhm5yFojzYFzbzLavy1vYZBo5FF.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-14","episode_number":2,"episode_type":"standard","id":335392,"name":"Double Take","overview":"In order to compensate for all of William, while under XANA's control, Jeremie sets to work designing new equipment for his friends and recreating Lyoko. In order to buy himself time to do this, he activates a tower and uses it to create a a clone of his own to attend class in his place. Meanwhile, William's absence is drawing attention, from both the principal and his father. While Jeremie's Clone is impressing Jim outside, William appears on Lyoko and tries to put the tower under XANA's control. In order to maintain his clone, Jeremie draws energy from Sector Five to maintain the activated tower. He eventually runs out of energy and the tower is put under XANA's control. While Odd holds the Jeremie Clone off, Aelita, Yumi, and Ulrich go to Lyoko with new outfits and powers. They eventually deactivate the tower and stop William, who tries to push Yumi into the digital sea. She is saved by Odd at the last second. Jeremie then does a return to the past and replaces the Jeremie Clone with a William Clone to prevent any suspicion about his absence.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/vjxnImpHTIS3KciAyn8IUzjMO9l.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-30","episode_number":3,"episode_type":"standard","id":335393,"name":"Opening Act","overview":"Aelita finds a photo of herself with Franz Hopper at the Hermitage, with a mathematical equation in the background. Jeremie discovers that the program works as a reset feature to Lyoko, something not too helpful but useful nonetheless. Meanwhile, Odd, in an attempt to impress a girl in photography class, inadvertently sends the photo to Sissi, who in turn shows it to her father. He questions the group about it, with Jeremie pointing out that Aelita would obviously be twenty-four by now if she were the one in the photo. They are sentenced to dentention in the library by Jim before any more discussion occurs. Before he can follow up on the matter, Jean-Pierre possessed by XANA. He delivers Aelita to Lyoko, where the Scyphozoa is waiting for her. It takes control of her and tries to force her to walk into the digital sea, but Ulrich and Yumi are there to keep her from doing so. As they battle Aelita and the monsters, Jeremie uses the reset program, clearing Aelita's possession and allowing her to deactivate the tower. After performing a return trip, Aelita explains that her real last name isn't Hopper, it's Schaeffer (the name listed on the folder in the end credits). Hopper is the last name of her mother, Antea. In addition, Franz's supposed first name is actually his middle name. Franz appearently changed both his and Aelita's names when they moved to the Hermitage in order to have a fresh start.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/eu6Bm930QzgOlKSSqaoWjahmT8c.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-15","episode_number":4,"episode_type":"standard","id":335394,"name":"Wreck Room","overview":"Jim's nephew Chris, the drummer of the Subdigitals, pays a visit to Kadic to look for an opening act for the band's next concert. Everybody tries out, and Aelita turns out to be the one Chris is looking for. However, circumstances make sure that Chris doesn't realize who Aelita is, and XANA's clone of him only complicates matters, kidnapping Aelita and sending her to Lyoko. Jim and Chris manage to involve themselves in their search for Aelita, and end up battling the clone while the rest of the group tries to deactivate the tower. After the threat is over, Jeremie executes a return trip so that Jim and Chris remember nothing. He also delivers Aelita's demo CD to Chris personally after doing so.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/cOHCWTe0xjXZdIUNmij4bTmCnjR.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-16","episode_number":5,"episode_type":"standard","id":335395,"name":"Skidbladnir","overview":"There is a new recreation room at Kadic and William's clone is put in charge of it. Meanwhile, Jeremie has developed a program to get the real William out of Lyoko. However, the program malfunctions and bugs up the tower, allowing XANA to take it over while Aelita cannot shut it down. As the William clone lashes out at the group, the real William is on Lyoko to keep the tower under XANA's control. Jeremie manages to repair the tower in time for Aelita to reset it, restoring the clone to working order. With a return trip to erase the unwanted memories of William's behavior at school, the group elects Sissi as the rec room monitor.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/6xGRfM2HwfruLcvjTDlUcGtEfL.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-17","episode_number":6,"episode_type":"standard","id":335396,"name":"Maiden Voyage","overview":"The new \"submarine\" (as Jeremie calls it) is almost complete, the last step being a secondary program that needs to be run by 4:00 p.m. the next day. However, when Aelita and Jeremie stay up late to set the program up, they are caught and given detention. William takes the opportunity to attack the incomplete sub, forcing Yumi to run the supercomputer in Jeremie's absence. Odd and Ulrich are unable to handle the situation, but Jeremie and Aelita are able to sneak out in time to help. Aelita is able to repel William with a massive attack, allowing Jeremie to complete the sub on-time. It is later christened Skidbladnir, nicknamed \"Skid\" by Odd, after the Norse ship.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/c6PR7yz5g5ooL52oDbkl77zWrH7.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-20","episode_number":7,"episode_type":"standard","id":335397,"name":"Crash Course","overview":"The gang manages to convince Jeremie to let them test out the Skid. During this test, the navigation system bugs up, leaving the gang stranded in the digital sea. Jeremie runs to his room to fetch the backup programs, but forgets that it's Fire Safety Day and runs into several teachers, eventually having to scale the roof to get to his room. Meanwhile, the Skid stumbles upon another Lyoko and is attacked by two eel-like monsters. Jeremie is able to repair the navigation system and bring his friends home, after which he surmises that the replika of Lyoko was created from the data XANA stole from Aelita's memories in \"The Key.\" Jeremie wonders how he plans to use it.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/8LoHiCd19q0yoTI4X7tILUEOgPI.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-21","episode_number":8,"episode_type":"standard","id":335398,"name":"Replika","overview":"Jeremie decides to teach Odd, Ulrich, and Yumi how to use the supercomputer in case he or Aelita are unable to, being XANA's favorite target. During the lesson, Jeremie is attacked by one of XANA's polymorphic clones, leaving the others to operate the supercomputer without help. Aelita is at the final audition with the Subdigitals, competing against two other candidates, and thus cannot be contacted. To make matters worse, the clone heads for her after dealing with Jeremie. Using what they learned from Jeremie, the others are able to rescue Aelita and deactivate the tower without his help. Aelita is also chosen as the winner of the audition despite her walking out on them.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/y2s3ViNDyMW8vxG9Fw8EPiIfUk.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-22","episode_number":9,"episode_type":"standard","id":335399,"name":"I'd Rather Not Talk About It","overview":"The group travels to one of XANA's Lyoko replicas in the digital sea. Meanwhile, Aelita and Odd get into a fight after Odd's desire to sleep in gets them both in trouble. Furthermore, their arguing inadvertently leads Nicolas and Herve into the factory, where Jeremie is forced to distract them while the group explores the Lyoko copy, which consists entirely of the Forest Region. On the Lyoko replika, William and a pair of Megatanks arrive to destroy the Skid, the destruction of which would cut the group off from the supercomputer. Odd and Aelita refuse to work together when they first arrive, but eventually resolve their differences and take William down. Jeremie surmises that another supercomputer is controlling the replika, and in order to get rid of it he'll have to find a way to materialize his friends at the location of the supercomputer.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/1grthPk0yZo8YeMMU1izyvwnZDh.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-23","episode_number":10,"episode_type":"standard","id":335400,"name":"Hot Shower","overview":"The group turns to Jim for training so they can be better prepared to fight XANA. However, things go bad when XANA possesses a boar to attack them with, forcing them to put their training to good use to avoid it. Furthermore, XANA sends William and a group of Mantas to attack Lyoko's core. Jeremie stays behind to help Jim while the others repel the attack. Jeremie risks his life to save Jim when the two encounter their attacker in a cave, and Aelita deactivates the tower in time to save them both.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/ftUk57IWuAGhwx7DUmkfidXLYhN.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-24","episode_number":11,"episode_type":"standard","id":335401,"name":"The Lake","overview":"When a comet passes near Earth, XANA uses a laser-equipped military satellite to split it into chunks, simultaneously aiming the bulk of it directly at the factory. Aelita, Odd, and Ulrich are exploring the digital sea at the time, and XANA traps them with a firewall to prevent them from stopping the attack. Meanwhile, Yumi is stuck at school and, when informed of the attack, works to evacuate the school. Jeremie tells Yumi to connect his laptop to an antenna to tap into the military satellite and destroy the comet. She does so with help from Hiroki and Johnny. However, XANA prevents him from doing so. Unable to stop the attack, Aelita reasons that XANA is more concerned with taking her prisoner than destroying the supercomputer, and to test it has Odd devirtualize her. Having guessed correctly, she watches as XANA destroys the comet and calls off his attack on his own accord.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/iyEdVvhlSAaBSUr7EMQyeQ6lDI8.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-27","episode_number":12,"episode_type":"standard","id":335402,"name":"Lost at Sea","overview":"Jeremie, Aelita, Ulrich, and Odd go with the rest of their science class on a field trip to an island in the middle of a nearby lake to study water-based plantlife. Yumi, not part of the class, remains behind to sit through two important exams. Jeremie's fears about XANA attacking at such an inopportune moment are realized when XANA creates an electricity-blasting sludge that attacks anyone who approaches the shore. Yumi is forced to go to Lyoko alone, and during her fight with William, is temporarily able to reach William's true personality. Though the evil William eventually reasserts himself, Yumi is saved by Aelita, who escaped the island. Aelita is able to shut down the tower and Yumi initiates a return trip to save the class from electrocution.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/7NqFbMGjWgnNQ4VeRRPUbpxMrRG.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-28","episode_number":13,"episode_type":"standard","id":335410,"name":"Lab Rat","overview":"Jeremie has perfected his \"Teleportation\" process, allowing him to send his friends to the location of Xana's supercomputer in the real world to destroy it. He uses it on Aelita and Odd first, sending them to the jungle laboratory containing the supercomputer. As they explore, they find that XANA is constructing cybernetic spiders with the help of a team of possessed scientists. Before they can stop him, however, William manages to sever their connection to the real world, bringing them back to Lyoko in the middle of their mission. In a side story, Yumi is angry with Ulrich because he has forgot her birthday, so Odd promises to get Yumi a present for him because Ulrich has detention.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/6ItGjFXayLqBwMIHdOIGt26YuAm.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-29","episode_number":14,"episode_type":"standard","id":335403,"name":"Bragging Rights","overview":"Jeremie has perfected his \"Teleportation\" process, allowing him to send his friends to the location of Xana's supercomputer in the real world to destroy it. He uses it on Aelita and Odd first, sending them to the jungle laboratory containing the supercomputer. As they explore, they find that XANA is constructing cybernetic spiders with the help of a team of possessed scientists. Before they can stop him, however, William manages to sever their connection to the real world, bringing them back to Lyoko in the middle of their mission. In a side story, Yumi is angry with Ulrich because he has forgot her birthday, so Odd promises to get Yumi a present for him because Ulrich has detention.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/q3dTLEPUMPiHsrdymaJ9rGD0CTn.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-29","episode_number":15,"episode_type":"standard","id":335404,"name":"Dog Day Afternoon","overview":"Having failed to destroy XANA's supercomputer in the previous episode, the group sets out to finish the job. Meanwhile, Odd's bragging gets the better of him, and he makes a bet with Ulrich not to brag for 24 hours. However, circumstances conspire to constantly put him in the spotlight, and when he ultimately both defeats William singlehandedly and destroys the supercomputer in the real world, Odd becomes convinced that being a braggart is something he can be proud of.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/ieoycDPw9dnxTbc5lfnJ60GdJrs.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-30","episode_number":16,"episode_type":"standard","id":335405,"name":"A Lack of Goodwill","overview":"Odd tries to take Kiwi to Lyoko, but ends up absorbing him instead. As a result, Odd slowly begins to take on dog traits, such as enhanced smell and scratching himself with his foot. While Jeremie works on separating the two, XANA possesses a biker gang to attack Yumi. When Ulrich and Aelita arrive to Lyoko, they are confronted by William and three Tarantulas. Jeremie manages to split Odd and Kiwi while Aelita deactivates the tower.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/rCREPpPsLfDbyqXkUe4AhbiUTAV.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-08-31","episode_number":17,"episode_type":"standard","id":335406,"name":"Distant Memory","overview":"Jeremie has developed a program to make the William clone smarter, but the learning curve is still problematic, as it tries to fling a glass into the air from a fork. Milly and Tamiya, overhearing the group's conversation about the clone, decide to ask him personally. The clone, having never been told to keep the information a secret, reveals everything to them, and even takes them to the factory. Meanwhile, Jeremie plans a mission to the next Replika, a copy of the Desert Sector. During the trip, William emerges from a scanner and tries to destroy the supercomputer. With the help of Milly, Tamiya, and the William clone, he is defeated, and a return trip keeps Milly and Tamiya in the dark about the supercomputer.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/9cdxSqNlGpedKsnrOANddHM0eg0.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-09-08","episode_number":18,"episode_type":"standard","id":335407,"name":"Hard Luck","overview":"It's holiday time at Kadic and everyone is headed home. Aelita, however, has no home to go to. As she watches over Lyoko, she gets a message from Franz Hopper, who has constructed a simulation bubble of their mountain home on Lyoko. Though happy to see her father, Aelita quickly learns that the entire thing is a trick from xana - her father is just a mirage, and William is there waiting for her to throw Aelita in the digital sea Williams say(impossible to escape this bubble as it is your prison) The rest of the group, having been unable to contact Aelita, follows her onto Lyoko, but they fail to keep William from throwing her into the digital sea. When it seems as if she's gone, she is lifted from the sea by the real Franz Hopper, who has manifested himself as a floating blue bubble with a pink aura. After dropping her back on Lyoko, he returns to the digital sea.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/wYGo7yHmKqMCDdpnhHm1WP21j51.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-09-15","episode_number":19,"episode_type":"standard","id":335408,"name":"Guided Missile","overview":"When Odd breaks a mirror, a little bad luck follows and jinxes him everywhere, even on Lyoko. A bug in his virtual avatar spreads to Yumi and Aelita, causing annoying pauses and random devirtualization in the copy of the Desert Sector. Meanwhile, at the site of the Replika supercomputer, Xana materializes Kankrelats in the real world to stop Ulrich and Yumi. Despite the bug, their mission to destroy XANA's next Replika ends in success, this time by Ulrich, and Odd's luck returns soon afterwards.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/5MH3XsCNt75S9GLNggkcCFCT5d9.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-09-22","episode_number":20,"episode_type":"standard","id":335409,"name":"Kadic Bombshell","overview":"Jeremie wins a contest to take a flight in an armed fighter jet, even though it was Odd who entered him into the contest in the first place. However, just before takeoff, XANA possesses the jet and sends it to destroy the factory and kill Jeremie by forcing it to crash. As it closes in, Aelita, Odd, Ulrich, and Yumi struggle against William, who devirtualizes them one by one in his attempt to throw Aelita into the digital sea. Ulrich is the one to come out on top in a blade to blade fight with William and Aelita is able to deactivate the tower. A return to the past is launched before the factory is destroyed, and Odd gets his chance to ride in the jet afterwards.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/aV15F3gxrPX0dQdfvX0GuBSDDzL.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-09-29","episode_number":21,"episode_type":"standard","id":335411,"name":"Canine Conundrum","overview":"When Kiwi's mindless destruction becomes too much for the group to bear, they force Odd to keep him at the factory. As Odd drops him off, XANA possesses Jeremie's Kiwi Two robot, turning it into an army of self-replicating attack dogs. The dogs attack Yumi and Ulrich, among other children, during Jim's Pencak Silat class. After Aelita deactivates the tower and a return trip erases the incident, the group decides that the regular Kiwi isn't that bad, after all.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/fRuaeOURS0cdlKTks7cP1moVbVW.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-10-06","episode_number":22,"episode_type":"standard","id":335413,"name":"A Space Oddity","overview":"Because of a surprise dorm inspection, Odd has to convince Yumi to keep Kiwi at her house. Jeremie, meanwhile, has located the next Replika, a copy of Sector Five. Its supercomputer is located on a newly-built space station orbiting Earth. While Odd and Yumi work to disable it, Aelita and Ulrich work to disable the Replika's defenses of Sector Five, which threaten to destroy the Skid. To make matters worse, the supercomputer is guarded by a trio of floating spheres that can grow spikes and melt through metal. In the end, Odd disables the supercomputer by breaking some cooling pipes in the room and damaging it with water. All the while, Yumi's dad, Takeo, has been having fun with Kiwi, much to Odd and Yumi's surprise.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/m9KkhQ8A8CySXeKtzTmEUaovuAa.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-10-13","episode_number":23,"episode_type":"standard","id":335412,"name":"Cousins Once Removed","overview":"Jeremie's cousin, Patrick, comes to visit. Jeremie isn't entirely happy about it, since Patrick is \"super cool\" compared to him. Discovering another Replika, Jeremie and his friends plan a mission to destroy it, leaving Sissi alone with Patrick. She is able to convince him to let Herve rummage through Jeremie's computer files. Herve discovers Aelita's forged documents and the program running the Skid, his efforts to decipher it inadvertently draining the Skid's power. To make matters worse, XANA possesses both him and Sissi to cause even more damage. Jeremie, meanwhile, deduces that it's his computer back at school causing the damage, and works with Patrick to stop them. Once the attack has passed, Jeremie has Aelita run a return trip to undo the damage caused. The second time around, Jeremie is a bit more appreciative of his cousin, since the two worked well together before. But, unfortunately Patrick goes back to his own school.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/xOh2gSb1MSzVR4GJA5kF56VyMJo.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-10-20","episode_number":24,"episode_type":"standard","id":335414,"name":"Music to Soothe The Savage Beast","overview":"Aelita's first concert with the Subdigitals is coming up, but Aelita's stage fright threatens to get the better of her. Odd meanwhile, has to find an extra ticket so he can bring a date. When the concert finally starts, XANA attacks, possessing Sophia, in order to kidnap Aelita. He also possesses Milly and Tamiya for some extra help. While Ulrich battles the two reporters, the others work to shut down the tower, all while the Subdigitals' music plays in the background. Once the threat is over, Jeremie activates a return to the past so Aelita won't miss the concert.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/dglATAOFLXq1IucxaJYLVdvmEm4.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-10-27","episode_number":25,"episode_type":"standard","id":335416,"name":"Wrong Exposure","overview":"Aelita finds a photo of herself with Franz Hopper at the Hermitage, with a mathematical equation in the background. Jeremie discovers that the program works as a reset feature to Lyoko, something not too helpful but useful nonetheless. Meanwhile, Odd, in an attempt to impress a girl in photography class, inadvertently sends the photo to Sissi, who in turn shows it to her father. He questions the group about it, with Jeremie pointing out that Aelita would obviously be twenty-four by now if she were the one in the photo. They are sentenced to dentention in the library by Jim before any more discussion occurs. Before he can follow up on the matter, Jean-Pierre possessed by XANA. He delivers Aelita to Lyoko, where the Scyphozoa is waiting for her. It takes control of her and tries to force her to walk into the digital sea, but Ulrich and Yumi are there to keep her from doing so.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/iqTGJtYb4m0qXSSWAk33bZZa8Qb.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-11-03","episode_number":26,"episode_type":"standard","id":335415,"name":"Bad Connection","overview":"Odd is presenting one of his films, but is unhappy because his parents are coming. According to him, they never find fault in anything he does, which he finds dissatisfying because he isn't treated like a normal teen. However, when he's finally pressured into it, XANA attacks, using the school's cell phone antenna to spread a virus to everyone who answers their phone to cause them to become vicious, angry mind controlled slaves , starting with Odd's parents. With the widespread use of cell phones, all but the Lyoko warriors and Sissi are affected, Sissi having had her phone accidentally broken by her father. While she and Odd attempt to evade the possessed students and faculty, the others deactivate the tower in the Mountain Sector. Once a return trip wipes everyone's memories, Odd plays his video, which showcases all the humorous moments at Kadic, with Sissi in particular being treated in a positive light as thanks for her earlier assistance, much to her confusion.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/cmUDIQuYfg0OXqfDNBkDbeDGQbA.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-11-03","episode_number":27,"episode_type":"standard","id":335418,"name":"Cold Sweat","overview":"When an embarrassing picture of Yumi is printed in the Kadic newspaper, she turns to Odd as the source. He manages to get Ulrich to take the blame, however, causing tension between him and Yumi. Putting that aside, Jeremie sets up a mission to the next Replika, a copy of the Ice Sector. Its supercomputer is located in Siberia, where XANA is growing brains for an unknown purpose. Odd and Yumi are sent to the real world to destroy it, only to be confronted by William. When trying to shut down the tower, Aelita realizes that the data it is generating could be used to free William. After downloading the necessary data and disabling William, everything seems to be set for destroying the Replika. However, XANA draws on the power of his many Replikas to create a new monster: the \"Kolossus,\" a massive creature resembling a fire elemental with a sword for a hand. It easily devirtualizes Aelita and Ulrich, and nearly destroys the Skid, as well. With this new development, and the realization that XANA has hundreds of supercomputers at his command, Jeremie has to change strategies. Meanwhile, Yumi forgives Ulrich for the picture, and Odd admits to his deception soon after. Yumi gets back at both of them by getting a picture of the two coming out of the shower in the paper.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/j5UNbqKqTHwacxuWcbVD2R98Lg1.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-11-03","episode_number":28,"episode_type":"standard","id":335417,"name":"Down to Earth","overview":"In order to defeat XANA, whom they have vastly underestimated, Jeremie plans to design another multi-agent system to combat him. That, however, is still under development. In more immediate matters, Jeremie has figured out how to free William from XANA, but needs to run his program directly from the Ice Replika supercomputer. Meanwhile, William's parents arrive to visit their son, and the strange behavior of his clone concerns them greatly. Back at the Replika, William and two Mantas come to try to sever the translation. However, the Mantas are quickly destroyed by Yumi and Ulrich. William then jumps into the digital void and comes back up with the Kolossus. Jeremie uses some new tricks to stop the Kolossus, allowing Aelita and Odd to reach the supercomputer without worry. However, an army of robotic drones now stationed at the facility complicates matters and they de-translated Odd. With much effort, Aelita is able to run the program to free William before she is de-translated also, but their victory comes at a cost: though William is saved, the Skid is destroyed by the Kolossus with Aelita in it. Fournately, she is devirtualized before the Skidbladnir was totally destroyed. Back on Earth, William is able to take his clone's place, pacifying his concerned parents. Ulrich, meanwhile, has to deal with William's affection for Yumi once more.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/vectYQ2hvHimF2YxVfaRMxkcWQk.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-11-10","episode_number":29,"episode_type":"standard","id":335420,"name":"Fight to the Finish","overview":"With the Skid gone and XANA's Replikas at unmanageable numbers, Jeremie continues work on his multi-agent system. Meanwhile, Aelita has nightmares about her father being killed by XANA. As Jeremie works, he is contacted by Franz Hopper, who arranges a meeting on Lyoko. William wants to help, but all except Aelita are a little wary of trusting him again. William is left in the lab with Jeremie. After meeting up, Franz transmits the data necessary to finish Jeremie's multi-agent system. However, XANA is not willing to give up without a fight, activating a tower to possess William once again while sending the Kolossus to deal with Franz. Yumi willingly devirtualizes herself and fights William while the others protect Franz. Once Franz is finished transmitting the data, Aelita and Odd head to Sector Five to finish the program. Ulrich, meanwhile, manages to defeat the Kolossus, but its corpse falls on Ulrich, devirtualizing him instantly. However, a problem arises: the energy requirements are too great. Aelita's nightmare is realized when Franz makes the ultimate sacrifice himself to power the program, and in doing so XANA is wiped out completely. Though a great victory for them, the loss of Franz Hopper leaves them with little reason to celebrate.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/qjkd1ArjGoCOsLbScJC1rz06CD4.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2007-11-10","episode_number":30,"episode_type":"finale","id":335419,"name":"Echoes","overview":"With their mission completed, the group looks back on all their fond memories of Lyoko. Sissi, meanwhile, plants a tracking device on Ulrich in order to discover their secret. When it comes time to shut down the supercomputer, all but Yumi are unwilling to go through with it: Aelita is still holding onto the hope that her father can somehow be saved, Jeremie doesn't want to take away the thing which made them friends, and Odd and Ulrich both liked being heroes. While they muse over their attachments to Lyoko, Sissi finds her way into the computer lab, and Jeremie's open diary reveals the whole of their adventures. When Sissi tries to explain this to her father, he believes she has lost it and sends her to the infirmary. A return to the past deals with that problem. Ulrich stops Sissi from planting the tracker on the repeat attempt, and the quintet invites her as a friend. Once more at the supercomputer, the group unanimously decides to shut it down, closing the book on their adventures, for now.","production_code":"","runtime":23,"season_number":4,"show_id":4622,"still_path":"/bEtWAiO4pbumT5dDxpS342uhhi6.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":14116,"poster_path":"/3ag8kIlGz4nhbRlHtPAGZdrbUFd.jpg","season_number":4,"vote_average":9.3}}}