{"adult":false,"backdrop_path":"/dtvYQ8Pvl1kNalmH8JGF1RtwsNe.jpg","created_by":[{"id":86543,"credit_id":"52b8da0319c29575810852a3","name":"David Attenborough","gender":2,"profile_path":"/tt3LW3XftcvxOZtMXmIaJSWFN7y.jpg"}],"episode_run_time":[50],"first_air_date":"2013-01-02","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.bbc.co.uk/programmes/p010jc6p","id":46664,"in_production":false,"languages":["en"],"last_air_date":"2013-02-06","last_episode_to_air":{"id":1214266,"name":"The Future","overview":"David Attenborough meets a baby rhino and wonders what the future holds for it.","vote_average":8.5,"vote_count":2,"air_date":"2013-02-06","episode_number":6,"episode_type":"finale","production_code":"","runtime":58,"season_number":1,"show_id":46664,"still_path":"/wBoktDJU0t1Qye4zvTrkmaVR51a.jpg"},"name":"Africa","next_episode_to_air":null,"networks":[{"id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","name":"BBC One","origin_country":"GB"}],"number_of_episodes":6,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Africa","overview":"Africa, the world's wildest continent. David Attenborough takes us on an awe-inspiring journey through one of the most diverse places in the world. We visit deserts, savannas, and jungles and meet up with some of Africa's amazing wildlife.","popularity":10.483,"poster_path":"/emrvQId86K5dXKRSnFGNQAH3XAO.jpg","production_companies":[{"id":5137,"logo_path":null,"name":"WVG Medien GmbH","origin_country":""},{"id":3324,"logo_path":"/dqT3yOTlfJRmtvk52Ccd1O6dZ0A.png","name":"BBC","origin_country":"GB"}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"}],"seasons":[{"air_date":"2013-02-12","episode_count":11,"id":119971,"name":"Specials","overview":"","poster_path":"/5zeheYtRx8SZorpeh4qlJvArsrP.jpg","season_number":0,"vote_average":0},{"air_date":"2013-01-02","episode_count":6,"id":59773,"name":"Season 1","overview":"","poster_path":"/irSvrXu5B5cEKTww88xJHyUjz8p.jpg","season_number":1,"vote_average":8.6}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Miniseries","vote_average":8.3,"vote_count":87,"season_data":{"1":{"_id":"52b8d61819c2957581080536","air_date":"2013-01-02","episodes":[{"air_date":"2013-01-02","episode_number":1,"episode_type":"standard","id":970151,"name":"Kalahari","overview":"The series opens in Africa's south west corner and features the wildlife and landscapes of the Kalahari and Namib deserts. Starlight cameras reveal previously unfilmed nocturnal behaviour of black rhinos as they socialise at a Kalahari waterhole, and super slow motion footage captures a fierce battle between two male giraffes. Other sequences show Namibia's famous and mysterious fairy circles, how a fork-tailed drongo's talent for mimicry allows it to steal a meal from a meerkat clan, how ostrichs help their chicks find water, and how red-billed queleas defend their nests from marauding armoured bush crickets. Also, for the first time, cameras enter the world's largest underground lake in Dragon's Breath Cave and film the critically endangered golden cave catfish. Eye to Eye looks behind the scenes of the rhino and giraffe filming.","production_code":"","runtime":57,"season_number":1,"show_id":46664,"still_path":"/3pF8pVnNy0kI2tK9Lgs740icf8e.jpg","vote_average":8.8,"vote_count":5,"crew":[],"guest_stars":[]},{"air_date":"2013-01-09","episode_number":2,"episode_type":"standard","id":970152,"name":"Savannah","overview":"East Africa is the subject of the second programme, from the glaciated peaks of the Rwenzori Mountains to the savannahs and caustic soda lakes of the Great Rift Valley. The filmmakers focus on the life and death decisions animals must make in this ever-changing region. On the savannah, agama lizards play a game of dare as they approach a sleeping pride of lions to catch flying insects. A shoebill chick is filmed attacking its weaker sibling, forcing the parents to abandon it. On the plains of Amboseli, the worst drought for 50 years claims the life of an elephant calf, one of hundreds which perish from starvation. Their resilience and adaptability is highlighted by the returning rains, which bring together large herds to socialize. In Eye to Eye, cameraman Mark Deeble discusses the ethics of filming the dying elephant calf. ","production_code":"","runtime":57,"season_number":1,"show_id":46664,"still_path":"/n1R8tiVIJwXs58EpUWSqALeejf8.jpg","vote_average":8.5,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2013-01-16","episode_number":3,"episode_type":"standard","id":970153,"name":"Congo","overview":"The third episode visits the Congo basin and features some of the creatures which inhabit its two million square miles of jungle. In the canopy, a chimpanzee is filmed extracting honey from a bees' nest using a variety of branches as tools, whilst underground, a female African rock python incubates her eggs by coiling her warm body around them. Rare footage shows the nesting behaviour of Picathartes and a gathering of forest elephants at Dzanga bai. Other sequences show African skimmers, leaf-folding frogs and luminous fungi. Loango in Gabon is one of the few remaining places where the jungle meets the ocean. African forest buffalo, hippo, elephants and red river hogs emerge from the forest to sunbathe and swim. Eye to Eye shows the difficulties of filming in the Congo. ","production_code":"","runtime":57,"season_number":1,"show_id":46664,"still_path":"/wiDuyL3a1bXSZJ5Z5rq4Eiuml0K.jpg","vote_average":8.7,"vote_count":3,"crew":[],"guest_stars":[]},{"air_date":"2013-01-23","episode_number":4,"episode_type":"standard","id":970154,"name":"Cape","overview":"The fourth instalment shows how Southern Africa is influenced by two very different ocean currents. The warm Agulhas Current generates rainfall in Mozambique's interior, where butterflies gather on the summit of Mount Mabu to court and breed. The cold Benguela Current influences the Western Cape, where little rain falls. The intense heat makes incubating eggs a difficult prospect for African penguins. In spring, as Namaqualand is transformed into a desert garden, the drama of a monkey beetle's love life plays out in a single flower. Great white sharks and a 15 m Bryde's whale are filmed in the rich feeding grounds of the Atlantic. Eye to Eye reveals how the opening sequence, documenting the first few minutes of a green turtle hatchling's life, was constructed. ","production_code":"","runtime":57,"season_number":1,"show_id":46664,"still_path":"/ca6md3HbSnh9RLjpQCDFk0IfULK.jpg","vote_average":8.7,"vote_count":3,"crew":[],"guest_stars":[]},{"air_date":"2013-01-30","episode_number":5,"episode_type":"standard","id":970155,"name":"Sahara","overview":"The penultimate episode opens in the cedar forests of the Atlas Mountains, where Barbary macaques have become isolated from other primates by the expanding Sahara. Aerial photography shows the Sahara is a landscape dominated by rock. Animals featured include Grévy's zebra, addax and naked mole rats, each found on the desert's fringes. Two million barn swallows are forced to cross the Sahara on their migrations, congregating at a poisoned oasis to feed on flies. The last remaining freshwater pools are home to stranded desert crocodiles, filmed hunting tilapia fish. Macro photography reveals the struggles of dung beetles and silver ants, the latter able to survive exposure to the brutal midday sun thanks to their reflective body coating. Eye to Eye shows how an 18-month time lapse sequence of Libya's sand dunes was filmed. ","production_code":"","runtime":58,"season_number":1,"show_id":46664,"still_path":"/2XCnFwQjjenbynmREdtIFMGJxP2.jpg","vote_average":8.7,"vote_count":3,"crew":[{"job":"Director","department":"Directing","credit_id":"64a7b7d4965220011df0673e","adult":false,"gender":0,"id":4134155,"known_for_department":"Directing","name":"Nick Easton","original_name":"Nick Easton","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-02-06","episode_number":6,"episode_type":"finale","id":1214266,"name":"The Future","overview":"David Attenborough meets a baby rhino and wonders what the future holds for it.","production_code":"","runtime":58,"season_number":1,"show_id":46664,"still_path":"/wBoktDJU0t1Qye4zvTrkmaVR51a.jpg","vote_average":8.5,"vote_count":2,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":59773,"poster_path":"/irSvrXu5B5cEKTww88xJHyUjz8p.jpg","season_number":1,"vote_average":8.6}}}