{"adult":false,"backdrop_path":"/v8EVN1llRZkZZDr1dCcNjsbUQbC.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2013-03-18","genres":[{"id":10764,"name":"Reality"}],"homepage":"","id":46847,"in_production":false,"languages":["en","hu"],"last_air_date":"2013-04-22","last_episode_to_air":{"id":913815,"name":"Enriched Bread","overview":"Paul Hollywood bakes breads that are spectacular treats for special occasions. He bakes an impressive Sicilian lemon and orange bread with a sweet almond glaze and teaches a local baking club the joy of baking a historic British classic, Lardy cake. He shares the secrets of Danish pastries making tempting onion and mushroom swirls but the show stopper is Paul’s savoury brioche crown, bursting with molten mozzarella and parma ham and topped with a spicy pumpkin salad.","vote_average":0,"vote_count":0,"air_date":"2013-04-22","episode_number":6,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":46847,"still_path":null},"name":"Paul Hollywood's Bread","next_episode_to_air":null,"networks":[{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":6,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Paul Hollywood's Bread","overview":"Paul Hollywood presents a series in which he reveals the secrets of breads from all over the world and shows how a loaf can be transformed into delicious dishes for breakfast, lunch and dinner.","popularity":14.76,"poster_path":"/3PL2i8qNvEf3GLqe8uBYXaxOW6M.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2013-03-18","episode_count":6,"id":55026,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"},{"english_name":"Hungarian","iso_639_1":"hu","name":"Magyar"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"525973b3760ee34661a562df","air_date":"2013-03-18","episodes":[{"air_date":"2013-03-18","episode_number":1,"episode_type":"standard","id":913812,"name":"Classic Bread","overview":"In this first programme, we celebrate the history and traditional flavours of great British bread. Paul explains the basics of bread making by making a classic white bloomer, a gorgeous crusty everyday bread that he transforms into the perfect portable lunch, and his colourful roasted vegetable picnic loaf. We track the history of British bread making from farm to miller, brewer and baker and Paul bakes his ultimate ploughman's loaf, a rye, oat and ale round. For tea, there is nothing better than a slice of Paul's honey glazed, fruit-packed malt loaf. But his breads are no sideshow, so for a hearty family dinner he bakes his medieval-style rye and wholemeal trencher, a stunning centrepiece flat loaf piled high with watercress salad and sliced, seared lamb leg steaks in a mustard dressing.","production_code":"","runtime":null,"season_number":1,"show_id":46847,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-25","episode_number":2,"episode_type":"standard","id":913811,"name":"Flat Bread","overview":"Paul Hollywood takes viewers on a globetrotting journey into the diverse and colourful world of flat breads. Along the way, he serves up flavour-packed dishes from all over the world, delicious at any time of day. With little more than cornflour and water, Paul makes authentic corn tortilla served stacked and layered with spicy roast chicken, guacamole and sour cream in a mouth-watering corn tortilla tower. He bakes an aromatic, herb laden Middle Eastern maneesh - dipped in his smoky baba ganoush, a perfect lunchtime snack. Paul also tries his hand at making traditional wafer thin Indian lentil dosa and gets to grips with a giant, Caribbean supersize flat bread, 'buss up shot'. But there is a special place in his heart for Cyprus, so he shares his recipe for nigella scented pittas stuffed with his favourite filling, succulent pork souvlaki.","production_code":"","runtime":null,"season_number":1,"show_id":46847,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-01","episode_number":3,"episode_type":"standard","id":913813,"name":"Continental Breads","overview":"Paul Hollywood reveals the secrets of some of the most iconic breads from the continent and uses them to make a feast of irresistible dishes. Paul bakes a classic baguette and then turns it into the ultimate roasted garlic bread. He bakes a crusty ciabatta for his panzanella salad and some crunchy biscotti that are great dunkers and why order a takeaway when it is so much fun to make your own pizza? Paul shares his tossing tips and a delicious fig, ham and gorgonzola topping.","production_code":"","runtime":null,"season_number":1,"show_id":46847,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-08","episode_number":4,"episode_type":"standard","id":913814,"name":"Sourdough Breads","overview":"Sourdough is bread for the connoisseur, and is Paul Hollywood's passion. Today he shares how to cultivate a sourdough starter, harnessing natural yeasts to leaven your bread. He starts with a classic sourdough and from this basic recipe, he makes the ultimate sweet bread, a white chocolate and raspberry sourdough and a fruit packed summer pudding. But for a real family feast, Paul serves tuna nicoise salad with tapenade and a stunning, leaf shaped sourdough fougasse bursting with olives.","production_code":"","runtime":null,"season_number":1,"show_id":46847,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-15","episode_number":5,"episode_type":"standard","id":913816,"name":"Soda Bread","overview":"No kneading, no proving - just mix, shape and bake. Paul Hollywood shows you how these simple breads can be at the heart of every meal. His classic wholemeal soda bread topped with a cheesy Irish rarebit is a perfect snack, like his impressive dark, full flavoured stout bread with smoked salmon pate. Paul shows you how easy it is to enjoy the magic of homemade crumpets bubbling on the griddle and how a simple scone recipe can transform a humble stew into hearty, fragrant beef cobbler.","production_code":"","runtime":null,"season_number":1,"show_id":46847,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-22","episode_number":6,"episode_type":"finale","id":913815,"name":"Enriched Bread","overview":"Paul Hollywood bakes breads that are spectacular treats for special occasions. He bakes an impressive Sicilian lemon and orange bread with a sweet almond glaze and teaches a local baking club the joy of baking a historic British classic, Lardy cake. He shares the secrets of Danish pastries making tempting onion and mushroom swirls but the show stopper is Paul’s savoury brioche crown, bursting with molten mozzarella and parma ham and topped with a spicy pumpkin salad.","production_code":"","runtime":null,"season_number":1,"show_id":46847,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":55026,"poster_path":null,"season_number":1,"vote_average":0}}}