{"adult":false,"backdrop_path":"/9m38iUBri4EqO5QxhUYhb4OUqLc.jpg","created_by":[],"episode_run_time":[42],"first_air_date":"2012-06-06","genres":[{"id":10764,"name":"Reality"}],"homepage":"https://go.discovery.com/tv-shows/fast-n-loud/","id":46874,"in_production":false,"languages":["en"],"last_air_date":"2020-05-25","last_episode_to_air":{"id":2276020,"name":"Flippin' the Bird","overview":"The guys face a seven-day deadline to raise their '67 Firebird from the ashes. Meanwhile, Richard heads to the boondocks of Tokio, TX, to search for a rare '51 VW Samba Bus. Finally, NFL star DeMarcus Ware shops for an authentic Gas Monkey hotrod.","vote_average":0,"vote_count":0,"air_date":"2020-05-25","episode_number":9,"episode_type":"finale","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":null},"name":"Fast N' Loud","next_episode_to_air":null,"networks":[{"id":64,"logo_path":"/tmttRFo2OiXQD0EHMxxlw8EzUuZ.png","name":"Discovery","origin_country":"US"}],"number_of_episodes":133,"number_of_seasons":13,"origin_country":["US"],"original_language":"en","original_name":"Fast N' Loud","overview":"Motor mastermind Richard Rawlings and mechanical prodigy Aaron Kaufman search for forgotten and neglected vintage cars. They need big projects and big profits to keep the doors open at Gas Monkey Garage in Dallas, TX.","popularity":28.561,"poster_path":"/976AyeDT1isz2uAnYuQrjRkS05D.jpg","production_companies":[{"id":26420,"logo_path":"/sbX5PhK6b3eshMYUkUq1MhtaRLk.png","name":"Pilgrim Media Group","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2012-10-15","episode_count":23,"id":55050,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2012-06-06","episode_count":12,"id":55048,"name":"Season 1","overview":"","poster_path":"/eFxkZH1i5KzMO7wKJUBF3quZ2oN.jpg","season_number":1,"vote_average":0},{"air_date":"2013-02-18","episode_count":7,"id":55047,"name":"Season 2","overview":"Richard decides he has outgrown the shop on Reeder Road, and leases for $6500 per month a much bigger building nearby on Merrell Road in Dallas, where Gas Monkey Garage can work on more cars at once. They hire new mechanics to help with the extra work, as well as a couple more people to help with buying parts and looking for cars to buy for future projects. The actual move took place in January 2013.","poster_path":"/jALk9pPNQi23QI6QgB6kISokpfQ.jpg","season_number":2,"vote_average":0},{"air_date":"2013-06-10","episode_count":8,"id":55049,"name":"Season 3","overview":"Fast N' Loud is back for another series of hidden gems and forgotten derelict classic cars, as motor mastermind Richard Rawlings and mechanical prodigy Aaron Kaufmann search the far-flung corners of Texas and the surrounding states for classic beauties. In the new series, Richard and Aaron conjure up a plan to transform a vintage '71 Dodge Scat Pack Challenger bought at auction. Their grand scheme turns into a mechanical challenge that Aaron and his team have never seen the likes of before. Meanwhile, Richard invests in a new live venue space across from the Grill and is nervous he's going to have to spend every last dollar he has to do it. The mechanics also bring back to life a '57 Shorty School bus with hilarious results.","poster_path":"/7M6YjrrGNQR0OvY9UU2SaHB3IRZ.jpg","season_number":3,"vote_average":0},{"air_date":"2013-09-02","episode_count":21,"id":55051,"name":"Season 4","overview":"In the hit series Fast N' Loud, Richard Rawlings and Aaron Kaufman travel the back roads, searching barns and open fields for that one rare ride to restore and choosing the right car is the trick. Richard is the man with the eye, the gift for seeing that rare find; while Aaron is the master mechanic who decides whether or not these relics are too far gone or the perfect basis for a Gas Monkey overhaul. Once Richard wheels and deals for a good price, it's back to the Garage to set the design plan and begin the major teardown. Then, the major work begins. It's always a race against the clock to get these cars finished: time is money at Gas Monkey Garage and the quicker they finish their cars, the quicker they can get to auction.","poster_path":"/oYzWhSNdTVpaRn9jkDh3VJc0NHD.jpg","season_number":4,"vote_average":7},{"air_date":"2014-08-18","episode_count":14,"id":65708,"name":"Season 5","overview":"This season, Richard and Aaron get back to their roots and build a chopped Model A. The duo also lands a huge muscle car for a SONIC restaurant drive-in, but the Camaro convertible SS turns out to be trickier than originally thought as the deadline inches closer and closer. Aaron also continues his dream of being a race car driver, and he enters one of the deadliest and most difficult road races in the world: Pike's Peak.","poster_path":"/611Rm4PRULNrg8kkzLtcirbzlb3.jpg","season_number":5,"vote_average":0},{"air_date":"2015-03-23","episode_count":6,"id":66275,"name":"Season 6","overview":"The Gas Monkey crew is busier than ever. Richard and Aaron take on one of their most demanding projects yet: rebuilding a '71 Dodge Scat Pack Challenger using parts from the 2015 version of the Dodge Scat Pack Challenger. The guys also get to work on a '68 Impala and A '57 Shorty School Bus. Additionally, Richard is working on expanding his business empire and the Gas Monkey brand by creating a new tequila company as well as opening up a concert hall. Both of these new projects represent a huge monetary risk for Richard, making it even more important that Gas Monkey Garage continue to keep the money rolling.","poster_path":"/1qr6wNLVlVFNyxhyzcjg8p6mMW1.jpg","season_number":6,"vote_average":0},{"air_date":"2015-09-07","episode_count":13,"id":70111,"name":"Season 7","overview":"This season begins with a new mantra for Richard: \"Big Risk, Big Reward,\" and he will roll the dice on some of Gas Monkey Garage's most expensive builds ever, while Aaron and his team attempt to conquer new technologies to create one-of-a kind masterpieces. Richard starts his quest to build bigger and better cars by scoring a '78 Cutlass, so Aaron can build Gas Monkey's first ever lowrider - something he's never attempted before. Richard and Aaron also hit the road to pick up a classic red '68 Cadillac convertible, giving it the luxury treatment in a risky bid to attract a higher caliber of buyer - even as costs escalate. Later, Richard heads to Kentucky to look at a prime '70 Ferrari 365, as his team attempts to soup up a near-totaled 2005 Ford GT. Richard also lands in Camaro heaven when he discovers a barn full of 16 vintage specimens.","poster_path":"/cHS13x0yuh4LO1Xjc39aIBnG7dV.jpg","season_number":7,"vote_average":0},{"air_date":"2016-09-05","episode_count":8,"id":73524,"name":"Season 8","overview":"The season begins with Aaron restoring a vintage Harley Davidson in celebration of Discovery's  Harley and the Davidsons. The rest of the season is jam-packed with adrenaline-fueled fun. Between a visit from iconic car builder Chip Foose, a trip to Nascar with the Miller Lite team, a Porsche vs. Porsche race and a venture into the business of Monster Trucks - the Gas Monkey Garage has its work cut out for it. The season also includes some of the best builds the crew has ever done, including a'72 Pantera, a '00 Porsche hot-rodded with a Chevy engine, and a classic '49 pickup, which turns out to be the ultimate curse for the team, as they attempt to restore it to show truck perfection.","poster_path":null,"season_number":8,"vote_average":0},{"air_date":"2017-01-16","episode_count":9,"id":79849,"name":"Season 9","overview":"The new season kicks off when Richard and Aaron come across a rare '55 Chevy. With the Barrett-Jackson Northeast auction on the horizon, the crew must work quickly to turn this beat up car into a hot classic. If they can finish in time, Richard will be able to bring the car to auction and secure a major payout. With the monkeys left back at the garage to work on the build, Aaron takes another run at the notoriously dangerous Pike's Peak road race and Richard opens a new Gas Monkey Bar and Grill in Key West, Florida. Then, Richard, Aaron and the monkeys head back in time, working on classic builds including an '80 El Camino and a '65 VW. Richard also returns to his high school roots when he finds and builds his very first high school car, a '74 Comet - a hot rod he WISHES he drove 20 years ago! Meanwhile, another dream comes to fruition when the Smokey and the Bandit fan club finds Richard the other car from his youth, a Red Trans Am. In the biggest undertaking of the season, the Gas Monkey Crew decides to build a race car, pulling out all the stops. Now all that's left to do is find a willing challenger.","poster_path":null,"season_number":9,"vote_average":0},{"air_date":"2017-10-16","episode_count":6,"id":83986,"name":"Season 10","overview":"With Aaron Kaufman's departure at the end of last season, Richard and his crew are entering a new stage at Gas Monkey Garage, setting out to prove the shop is still going strong. Richard and his team search high and low for forgotten and derelict vintage cars to buy and restore, and this season they're determined to go big—literally—by finding an original 1973 Chevy P30 Step Van and turning it into a hot rod. Throughout the season, guest builders Big Mike Sajid and Brian Bass also show off their skills and work with the Monkeys to build impressive hot rods. Without Aaron, the Monkeys work harder than ever before to turn even the most neglected cars into gold. However, these rare cars come with hefty price tags. Will Richard and his crew at Gas Monkey Garage be able to finish cars and turn a profit without Aaron, or will they lose sight of looming deadlines with too many opinions on each build?","poster_path":null,"season_number":10,"vote_average":0},{"air_date":"2018-03-12","episode_count":9,"id":87174,"name":"Season 11","overview":"Richard and the Monkeys are tuning into a whole new groove at Gas Monkey Garage with bigger builds and higher horsepower. Motor mastermind Richard Rawlings travels the back roads, searching barns, garages and open fields for that one rare ride to restore. Once the deal is sealed, it's back to Gas Monkey Garage where Richard and his team work to turn the cars into gold. The new season takes Richard and the Monkeys into unfamiliar territory as they attempt to break new ground in the build space, risking their reputation in the process. Also, throughout the season, guest builder Big Mike works with the Monkeys to build custom hot rods.","poster_path":null,"season_number":11,"vote_average":0},{"air_date":"2019-07-08","episode_count":11,"id":132089,"name":"Season 12","overview":"Richard is putting everything on the line in hopes of taking Gas Monkey Garage to new heights and a new level of success in the hotrod world. The new season brings incredible builds, iconic stunts and record payouts along with a set of new challenges that will put Gas Monkey Garage to the ultimate test. With builds bigger than ever before, Richard's team wrestles with intricate projects, impossible deadlines and Richard's demanding standards.","poster_path":null,"season_number":12,"vote_average":0},{"air_date":"2020-03-29","episode_count":9,"id":146870,"name":"Season 13","overview":"With builds bigger than ever before, Richard Rawlings' team wrestles with intricate projects, impossible deadlines and demanding standards while Gas Monkey Garage solidifies its elite status in the hotrod world. Throughout the season, Richard, Russell J. Holmes and the crew push the boundaries on some of the most complex builds the garage has ever taken on.","poster_path":"/976AyeDT1isz2uAnYuQrjRkS05D.jpg","season_number":13,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Reality","vote_average":6.6,"vote_count":42,"season_data":{"1":{"_id":"525973ce760ee34661a57866","air_date":"2012-06-06","episodes":[{"air_date":"2012-06-06","episode_number":1,"episode_type":"standard","id":914093,"name":"Model A Madness","overview":"Richard and Aaron find the hot rod of their dreams: a rust-free 1931 Model A. As renovation costs pile up, Richard looks to make some fast cash with a couple of quick flips, including the \"Drive Angry\" Buick Riviera and a Chevy 210.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":"/iQarHTtZmXKpVHhIp3HJKcRe56B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-13","episode_number":2,"episode_type":"standard","id":914086,"name":"Awesome Aussies and Olds","overview":"Richard and Aaron find a '55 Chevy Bel Air as well as a 1950 Oldsmobile Rocket 88 coupe, which had been perfectly preserved in a garage for over 50 years. They have 48 hours to fix up a broken-down '73 Caddy convertible for two Aussies hitting Route 66.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-20","episode_number":3,"episode_type":"standard","id":914092,"name":"Monkey Business Dragster","overview":"Richard and Aaron stumble upon a diamond in the rough: a 1960s Gasser that Richard wants to race. They buy a gleaming '32 Pontiac at a swap meet. And is a friend's 1960 Cadillac Sedan De Ville haunted and cursing the garage?","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-27","episode_number":4,"episode_type":"standard","id":914085,"name":"Double Trouble Galaxie","overview":"Richard and Aaron scramble to get a replacement '64 Galaxie ready for auction after the first one they find turns out to be in much rougher shape than expected. They have to get creative to get a stuck 1949 F-1 Ford off the back of a large car hauler.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-11","episode_number":5,"episode_type":"standard","id":914087,"name":"Low Riding Lincoln","overview":"Richard and Aaron turn the granddaddy of big cars, a 1970 Lincoln Continental Mark III, into a muscle car and bring a '68 Ford pickup back to life. Richard scoops up a 1970s style hot rod kit car with a mysterious past.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-18","episode_number":6,"episode_type":"standard","id":914090,"name":"Frankensteined Ford","overview":"The Gas Monkey guys \"frankenstein\" together a '68 Ford F-100 truck by blending together two vehicles that shouldn't go together. Richard relives his youth with a '77 Trans Am Firebird. He flips a '67 Caddy convertible to an international buyer.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-03","episode_number":7,"episode_type":"standard","id":914089,"name":"Amazing Impala","overview":"Richard, Aaron and the Gas Monkey crew unbury a '64 Impala buried in 10 years of debris and bring it back to life. A 1951 Bruco Fire Truck sparks former firefighter Richard's fancy as does a 1955 Caddy Coupe de Ville nicknamed Dolly.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-10","episode_number":8,"episode_type":"standard","id":914082,"name":"'48 Chevy Fleetmaster","overview":"Richard, Aaron, and the Gas Monkey crew try to \"knock the ugly outta\" a '48 Chevy Fleetmaster. Richard makes a profit but still gets schooled on a '74 Corvette. It's a tough Oklahoma crowd at the auction for their Chevy and \"Scarface\"-worthy '63 Caddy.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-17","episode_number":9,"episode_type":"standard","id":914091,"name":"Ramshackle Rambler","overview":"The Gas Monkey crew revives a rust-and-rat filled 59 Rambler to make it SoCal surf-worthy once again. Richard haggles for a 31 Model A. His new Willys Coupe Gasser could be worth $200K if Richard can prove its connection to a legendary drag racing team.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-09-24","episode_number":10,"episode_type":"standard","id":914084,"name":"One-of-a-Kind Woodill","overview":"The Gas Monkey crew have to handle a rare, fragile and flammable fiberglass-bodied Woodill Wildfire with kid gloves if they're going to make a six-figure sale. The boys take in a Harley and then blow off steam by entering Richard in the Demolition Derby.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-01","episode_number":11,"episode_type":"standard","id":914079,"name":"Fast & Furious Fairmont","overview":"Richard stretches Gas Monkey's style and Aaron's skills by making an \"ugly\" 1978 Ford Fairmont into a cool, mirrored drift car. Richard flips a rare 1967 Corvette Stingray complete with tank sticker and bets his driving skills to sell the shop truck.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-08","episode_number":12,"episode_type":"finale","id":914080,"name":"Holy Grail Hot Rod","overview":"A rare '32 Ford, a '64 Econoline van and an '89 Shelby pickup are featured.","production_code":"","runtime":42,"season_number":1,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":55048,"poster_path":"/eFxkZH1i5KzMO7wKJUBF3quZ2oN.jpg","season_number":1,"vote_average":0},"2":{"_id":"525973ce760ee34661a5785b","air_date":"2013-02-18","episodes":[{"air_date":"2013-02-18","episode_number":1,"episode_type":"standard","id":914072,"name":"Mashed Up Mustang","overview":"The crew renovates a ’67 Ford Mustang convertible, painting it black, lowering it, and giving it a new black interior. However, while the car was out for a test drive, it was totaled by a pickup truck driver without insurance; the car was ultimately repaired and sold (not shown).","production_code":"","runtime":42,"season_number":2,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-25","episode_number":2,"episode_type":"standard","id":914070,"name":"Bad Ass Bronco Part 1","overview":"In this two-part show, Gas Monkey Garage rebuilds a ’76 Bronco that is rusted beyond belief and sells it to the owner of the Twin Peaks restaurant chain.","production_code":"","runtime":42,"season_number":2,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-04","episode_number":3,"episode_type":"standard","id":914075,"name":"Bad Ass Bronco Part 2","overview":"In this two-part show, Gas Monkey Garage rebuilds a ’76 Bronco that is rusted beyond belief and sells it to the owner of the Twin Peaks restaurant chain.","production_code":"","runtime":42,"season_number":2,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-11","episode_number":4,"episode_type":"standard","id":914076,"name":"Far-Out Fairlane","overview":"Richard and Aaron resurrect two cars they bought from the Dallas Can Academy: a ’59 Fairlane and a ’54 Bel Air. Richard sells the Galaxie to his Swedish friend, Magnus Einarsson of Lone Star Cars AB, while Phipps gets the Bel Air running and helps selling it to a passerby.","production_code":"","runtime":42,"season_number":2,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-18","episode_number":5,"episode_type":"standard","id":914074,"name":"Stung By a '67 Corvette Stingray","overview":"Richard buys a ’73 Dodge Challenger and a ’67 Stingray, and while in Las Vegas, buys Evel Knievel's Messerschmitt microcar.","production_code":"","runtime":42,"season_number":2,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-25","episode_number":6,"episode_type":"standard","id":914073,"name":"Trials of a T-Bird","overview":"While Richard is out of town buying a ’58 Corvette, office manager Christie Brimberry buys a ’67 T-Bird that Richard forgot he had agreed to buy, the crew then turns it into a profitable deal. Model Alloy Ash makes an appearance at the new shop, showing off her welding skills.","production_code":"","runtime":42,"season_number":2,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-01","episode_number":7,"episode_type":"finale","id":914071,"name":"Ferocious Ford and Fast Ferrari","overview":"A ’38 Ford contaminated with rat droppings is turned into a cool hot rod. Richard buys Emmitt Smith's dilapidated Mercedes then takes a gamble on a banged up Ferrari F40.","production_code":"","runtime":42,"season_number":2,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"Richard decides he has outgrown the shop on Reeder Road, and leases for $6500 per month a much bigger building nearby on Merrell Road in Dallas, where Gas Monkey Garage can work on more cars at once. They hire new mechanics to help with the extra work, as well as a couple more people to help with buying parts and looking for cars to buy for future projects. The actual move took place in January 2013.","id":55047,"poster_path":"/jALk9pPNQi23QI6QgB6kISokpfQ.jpg","season_number":2,"vote_average":0},"3":{"_id":"525973ce760ee34661a57871","air_date":"2013-06-10","episodes":[{"air_date":"2013-06-10","episode_number":1,"episode_type":"standard","id":914095,"name":"Ferrari Fix Part 1/Dead Head Bus","overview":"In this two-part show, Richard and business partner Dennis Collins buy a wrecked red Ferrari F40 for $400,000 then spend $295,000 to paint it black and upgrade it with modern technology. Dennis buys the finished car for his collection.","production_code":"","runtime":42,"season_number":3,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-17","episode_number":2,"episode_type":"standard","id":914094,"name":"Ferrari Fix Part 2/1917 REO","overview":"In this two-part show, Richard and business partner Dennis Collins buy a wrecked red Ferrari F40 for $400,000 then spend $295,000 to paint it black and upgrade it with modern technology. Dennis buys the finished car for his collection.","production_code":"","runtime":42,"season_number":3,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-24","episode_number":3,"episode_type":"standard","id":914096,"name":"No Bull Bonneville","overview":"Richard has 72 hours to prepare a ’59 Bonneville for the road-tripping Aussies, nicknaming it the Keagle (Kangaroo-Eagle).","production_code":"","runtime":42,"season_number":3,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-01","episode_number":4,"episode_type":"standard","id":914097,"name":"Dodge Hodge Podge/'65 Mustang - Part 1","overview":"Richard and Aaron pick up a 64 Dodge Sweptline that's a mishmash of parts. A 32 Ford Roadster Richard forgot he bought rolls in, but it's up to Christie to seal the deal with the prospective buyer. KC hits the road with Richard to buy a 65 Mustang.","production_code":"","runtime":42,"season_number":3,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-08","episode_number":5,"episode_type":"standard","id":914098,"name":"Dodge Hodge Podge/Oldsmobile Delta 88 - Part 2","overview":"The crew struggles to finish the frankensteined 64 Dodge truck. Richard flips a 52 Chevy. He digs out an Oldsmobile Delta 88 he forgot he bought but it's also not quite what he remembered. Broke brakes leave a dent in the garage door.","production_code":"","runtime":42,"season_number":3,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-15","episode_number":6,"episode_type":"standard","id":914099,"name":"Ford Galaxie/Bikini Contest - Part 1","overview":"In this two-part episode, Richard and Aaron go to Roswell for a ’67 Ford Galaxie, then Richard goes to Los Angeles to pick up more cars. The owner of Twin Peaks Restaurants invites them to Denver, Colorado to be judges in a bikini contest.","production_code":"","runtime":42,"season_number":3,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-22","episode_number":7,"episode_type":"standard","id":914100,"name":"Ford Galaxie - Part 1/Nash Healey","overview":"In this two-part episode, Richard and Aaron go to Roswell for a ’67 Ford Galaxie, then Richard goes to Los Angeles to pick up more cars. The owner of Twin Peaks Restaurants invites them to Denver, Colorado to be judges in a bikini contest.","production_code":"","runtime":42,"season_number":3,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-29","episode_number":8,"episode_type":"finale","id":1218724,"name":"Beards, Builds and Beers","overview":"The team revisits the cars they flipped and answer fan mail.","production_code":"","runtime":42,"season_number":3,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"Fast N' Loud is back for another series of hidden gems and forgotten derelict classic cars, as motor mastermind Richard Rawlings and mechanical prodigy Aaron Kaufmann search the far-flung corners of Texas and the surrounding states for classic beauties. In the new series, Richard and Aaron conjure up a plan to transform a vintage '71 Dodge Scat Pack Challenger bought at auction. Their grand scheme turns into a mechanical challenge that Aaron and his team have never seen the likes of before. Meanwhile, Richard invests in a new live venue space across from the Grill and is nervous he's going to have to spend every last dollar he has to do it. The mechanics also bring back to life a '57 Shorty School bus with hilarious results.","id":55049,"poster_path":"/7M6YjrrGNQR0OvY9UU2SaHB3IRZ.jpg","season_number":3,"vote_average":0},"4":{"_id":"525973ce760ee34661a57887","air_date":"2013-09-02","episodes":[{"air_date":"2013-09-02","episode_number":1,"episode_type":"standard","id":1222087,"name":"Dale Jr.'s Sick Nomad","overview":"NASCAR's Dale Earnhardt Jr. asks for a custom-built car for a road trip vacation. The crew rebuilds a ’56 Chevy Nomad in record time and delivers it to his Mooresville, North Carolina estate.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":"/waeB5RBIS6SfTar4LsGaZUZP4dD.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-09-09","episode_number":2,"episode_type":"standard","id":978484,"name":"Chopped Cabriolet and 'Vette Rescue","overview":"A widow sells her husband's Ford ’32 Cabriolet, the team rebuilds a ’62 Corvette.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-16","episode_number":3,"episode_type":"standard","id":978485,"name":"Cool Customline","overview":"KC's upgraded ’55 Ford Customline is flipped to Mark Cuban. George Foreman visits the garage while Richard and Dennis are out to buy 2 Nash Healey cars and a ’38 Aston Martin.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-14","episode_number":4,"episode_type":"standard","id":978486,"name":"Killer COPO Camaro","overview":"Richard builds a COPO Camaro while Aaron builds his dream motorcycle.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-21","episode_number":5,"episode_type":"standard","id":978487,"name":"Caddy Rust Bucket / Bel Air Beauty, Part 1","overview":"In this two-part episode, Richard buys $38,500 worth of cars. Included is a ’49 classic convertible and ’68 Cadillac Coupe de Ville, which is so rusted out the Gas Monkey crew threatens mutiny. The crew then tries to recoup their losses with a ’60 Bel Air.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-28","episode_number":6,"episode_type":"standard","id":978488,"name":"Caddy Rust Bucket / Bel Air Beauty, Part 2","overview":"In this two-part episode, Richard buys $38,500 worth of cars. Included is a ’49 classic convertible and ’68 Cadillac Coupe de Ville, which is so rusted out the Gas Monkey crew threatens mutiny. The crew then tries to recoup their losses with a ’60 Bel Air.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-04","episode_number":7,"episode_type":"standard","id":978489,"name":"Flugtag Flyer / Wicked Wayfarer","overview":"GMG takes wing! Aaron builds a flying machine for the Red Bull Flugtag event and the team launches him off a 30-foot pier. But will the Gas Monkey Flying Circus take off or take a nose dive? Meanwhile, the crew brings a rare 1950 Dodge Wayfarer back to life.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-11","episode_number":8,"episode_type":"standard","id":978490,"name":"'71 Cool Kingswood / Retro Replicar","overview":"Aaron and crew turn an ugly duckling ’71 Kingswood station wagon into the cool, 70s hot rod dragster it was meant to be. Richard pries an ’80 MG Replicar from a husband reluctant to part with it. The Gas Monkey Bar N' Grill books its first celebrity musical act.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-18","episode_number":9,"episode_type":"standard","id":978491,"name":"Shelby Rent-A-Racer Restore, Part 1","overview":"The crew takes on a ’68 Shelby Mustang that looks sweet but what's it hiding? Richard flips his lid when Tom and Jordan buy two junker cars from two tourists. Richard and KC travel to a secret lair to make a deal on a Lotus Cortina and a rare Model 770 Amphicar amphibious car.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-25","episode_number":10,"episode_type":"standard","id":978492,"name":"Shelby Rent-A-Racer Restore, Part 2","overview":"Engine issues plague the ’68 Shelby Mustang. Richard flips the rare ’66 Lotus Cortina and the floating Amphicar for some fast cash. A classic Ford Falcon arrives at the garage—and selling it would be icing on the cake.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-02","episode_number":11,"episode_type":"standard","id":978493,"name":"Gas Monkey Bandit Car, Part 1","overview":"Richard and the Gas Monkey crew upgrade a 1977 TransAm for $70,000 plus a potential $65,000 bonus. Guest stars include Burt Reynolds (The Bandit from Smokey and the Bandit) and Paul Williams (Little Enos).","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-09","episode_number":12,"episode_type":"standard","id":978494,"name":"Gas Monkey Bandit Car, Part 2","overview":"Richard races to deliver the completed 1977 TransAm to a friend of his in New Orleans, with a $50,000 wager riding on delivering the car on time.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-27","episode_number":13,"episode_type":"standard","id":978495,"name":"Troll's Choice Rolls-Royce","overview":"When Richard \"accidentally\" buys $92K worth of cars at an auction, his bookkeeper sister Daphne insists he flip all five cars in one week. Some go more easily and profitably than others but it's a weirdly built Rolls Royce that even Aaron has a hard time fixing.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":"/qNjpn0j3AjVzmxhjyRkeeFyiHVQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-17","episode_number":14,"episode_type":"standard","id":1006712,"name":"Aaron's Falcon Racecar","overview":"Aaron falls in love with and buys a famous '63 Ford Falcon race car off Richard. But will the original owner be impressed by Aaron's Gas Monkey style? While Aaron's tied up in his passion project, Richard flips a 1919 Nash and an unusually painted truck.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-24","episode_number":15,"episode_type":"standard","id":978496,"name":"Mustang Mania","overview":"Aaron chances the wrath of the Big Monkey when he overrides Richard's instructions on a Mustang Fastback. After picking up a \"Holy Grail\" Boss 429 Mustang in Minnesota, Richard questions Dennis's decision to buy a rustbucket Jaguar E-type buried in snow.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-31","episode_number":16,"episode_type":"standard","id":978497,"name":"Jacked-Up Jeep","overview":"Aaron and the Gas Monkey crew overhaul a Jeep in 24 hours to surprise a friend. Richard flips a funky gull-winged Bricklin. Daphne convinces a reluctant Richard to hire his nephew. Dennis and Richard argue over how best to sell their COPO Camaros.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-07","episode_number":17,"episode_type":"standard","id":978498,"name":"Fleetline Superflip Frenzy","overview":"It's a Gas Monkey Fire Sale when Richard quick flips a menagerie of cars to make enough cash to buy back the first car he and Aaron built together 10 years ago. Richard and Dennis literally roll the dice on a 57 Chevy back in snowy Minnesota.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":"/79B16zZ1F2R3N4s3FB0Uqs4JcDm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-14","episode_number":18,"episode_type":"standard","id":978499,"name":"Demolition Theater","overview":"Richard and Aaron cringe along with you while watching some seriously epic fails—from hapless drivers unable to control their vehicles to a hotrodder who catches his engine and self on fire. Richard even has his own cringe-worthy moment in a stunt plane.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":"/AblSgzx1aqJpl9FGlThYj5jHhBD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-21","episode_number":19,"episode_type":"standard","id":978500,"name":"Holy Grail Firebirds - Part 1","overview":"Richard makes a deal to restore the first two Firebirds ever made, which comes with a strict deadline and pricey penalty; Aaron learns to race.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":"/oJuhFDA3Gjm4NvjFHkDpFQy2g1B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-28","episode_number":20,"episode_type":"standard","id":978501,"name":"Holy Grail Firebirds - Part 2","overview":"With a 10K-a-day penalty looming, Richard can't afford to lose any more time on the two Firebirds' concourse restoration and by the end of the project, the garage says goodbye to Jordan and Tom. Richard flips a '49 Mercury that comes complete with a tuxedo cat named Buster, who becomes part of the Gas Monkey team.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":"/5Cbc7uMHVfEopAsvUZoFIG2UvOP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-12","episode_number":21,"episode_type":"finale","id":978502,"name":"Fast Moving F100","overview":"Richard purchases a 1972 Ford Pantera. A 1969 Ford F100 pickup truck rebuilt with a new engine as a shop truck is featured. Sue charges $1000 for reupholstering one seat.","production_code":"","runtime":42,"season_number":4,"show_id":46874,"still_path":"/zGlShywGJzG1ZsL19nQZe5nz6mM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"In the hit series Fast N' Loud, Richard Rawlings and Aaron Kaufman travel the back roads, searching barns and open fields for that one rare ride to restore and choosing the right car is the trick. Richard is the man with the eye, the gift for seeing that rare find; while Aaron is the master mechanic who decides whether or not these relics are too far gone or the perfect basis for a Gas Monkey overhaul. Once Richard wheels and deals for a good price, it's back to the Garage to set the design plan and begin the major teardown. Then, the major work begins. It's always a race against the clock to get these cars finished: time is money at Gas Monkey Garage and the quicker they finish their cars, the quicker they can get to auction.","id":55051,"poster_path":"/oYzWhSNdTVpaRn9jkDh3VJc0NHD.jpg","season_number":4,"vote_average":7},"5":{"_id":"552354f09251416d4a0032a2","air_date":"2014-08-18","episodes":[{"air_date":"2014-08-18","episode_number":1,"episode_type":"standard","id":1051371,"name":"Chopped and Dropped Model A - Part I","overview":"Aaron and Richard find a 1931 Model A to chop! What begins as a simple build quickly grows into a grand green machine. With less than a month to build this chromed out 60’s show car from the ground up, Richard’s wild plan may be too much.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/jfH5WsOoLKTGLeGdm4cg7gUWQAy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-25","episode_number":2,"episode_type":"standard","id":1051372,"name":"Chopped and Dropped Model A - Part II","overview":"When Richard snaps back to his senses, he puts the Monkeys back on track. They must finish the ’31 chopped Model A in ten days but not without a lot of strife. Meanwhile, Richard and Dennis argue over a holy grail find of a ’64 ½ Mustang.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/tU9qb07sielVKg9SXw1EqYt7o59.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-01","episode_number":3,"episode_type":"standard","id":1051373,"name":"Super Sonic Camaro - Part I","overview":"When Richard lands the biggest deal in Gas Monkey's history, his crew struggles to hit Sonic Drive-In’s deadline. Meanwhile, Christie and Richard spar over losing an auction bid. Tensions are high and it doesn’t look like anyone’s going to come out on top.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/7HzxAN9yY5CefTCH5U67Zhyh6YA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-08","episode_number":4,"episode_type":"standard","id":1051374,"name":"Super Sonic Camaro - Part II","overview":"The Monkeys go super big with their first corporate client, Sonic Drive-In, to build a promotional '68 Camaro SS convertible. But with only days left until delivery, Richard might miss out on a huge payday, and tarnish his reputation.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/dH9bmHA2lM9F7FViYD4tekKwIQL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-15","episode_number":5,"episode_type":"standard","id":1051375,"name":"Pikes Peak or Bust - Part 1","overview":"As Aaron prepares for the Pikes Peak International Race, he learns that his Falcon still has some work to be done. Then Aaron springs on Richard that they have 3 weeks to build a Pace Race Truck for Pikes Peak. Meanwhile, Richard lands a sweet ’31 Model A.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/yxvsIoN1ar6ROu4S5x4e2f1Btm9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-22","episode_number":6,"episode_type":"standard","id":1051376,"name":"C10 Race Truck/Pikes Peak Pace Truck - Part 2","overview":"With the Pikes Peak International Race only days away, the truck is nowhere near complete; Aaron tries to keep the Falcon damage-free.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/d0Z9cDSctEEflrq6T1DuxpZ2Pt7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-13","episode_number":7,"episode_type":"standard","id":1051377,"name":"The Shorty Short VW Bus","overview":"When Richard buys a VW Type 2 Transporter, none of the Gas Monkeys really knows the mechanics of Volkswagens; and it is transformed into a micro-mini-midget Microbus. Later, when Richard and Aaron discover that the Fired Up Garage is attending a demolition derby, Richard has a trick up his sleeve to send his former employees reeling.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/8j9CK1kMhb85d9QKLonEDmFtCGJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-20","episode_number":8,"episode_type":"standard","id":1051378,"name":"One Cool Impala","overview":"When Richard buys a ’65 Chevy Impala, they put their Gas Monkey spin on it. Richard and Aaron score a ‘34 Five Window Ford. Later, Richard agrees to cool off the Monkeys with new air conditioning, but the Fired Up Garage crew gets hot and bothered about it.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/w6LC8Z7Xr8CVGyujrjWumyM0N7G.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-27","episode_number":9,"episode_type":"standard","id":1051379,"name":"Big, Bad C-10 Build","overview":"Richard and Aaron build their coolest hot rod, a 1976 Chevy C-10 short bed show truck to be auctioned at the Cattle Baron’s Ball. Plus, Richard misses out on a Firebird thanks to Thomas Weeks, and a '65 Cadillac is on the lot for one of Richard’s buyers.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/fBaJcADsSrgfzZRcMPFAhuWLYxb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-03","episode_number":10,"episode_type":"standard","id":1051380,"name":"Big, Bad C-10 Build - Part II","overview":"The plan to build Gas Monkey’s coolest show truck continues as Richard hopes to deliver a 1976 Chevy C-10 to the Cattle Baron’s Ball. Meanwhile, Richard tries to flip a ‘66 Continental and a ‘51 Caddy. Also, Richard stops by Fired Up Garage to check on the rent.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/rbGqBeMhCwuVedl7b1VnuX4nBOp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-10","episode_number":11,"episode_type":"standard","id":1051381,"name":"NHRA and a '55 Pink Caddy - Part I","overview":"When Richard gets a deal to build a ’55 Pink Cadillac for a hundred grand, it seems like a sweet deal ... until the Gas Monkeys relay that they may not be able to build the car in time for the tight deadline. Meanwhile, Richard invests in sponsoring an NHRA team.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/yAZIs0lRpioCMfhe283gwHoJcWR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-11-17","episode_number":12,"episode_type":"standard","id":1051382,"name":"NHRA and a '55 Pink Caddy - Part II","overview":"After a constant wait for parts for the ’55 Pink Caddy, the monkeys make a mad dash to get the car done on time. Meanwhile, Richard ventures into new territory as his Gas Monkey Dragster hits the Texas Motorplex for the NHRA qualifying runs.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/hh2iT5btpk26X8JNENIFAV3nnAj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-08","episode_number":13,"episode_type":"standard","id":1051383,"name":"Don't Hassle the Hoff - Pontiac Trans Am Part I","overview":"When an old friend of Richard's offers him $200,000 for a Knight Rider KITT car and a bonus if he can get David Hasselhoff to appear at his 40th birthday party, Richard can't pass up the offer. He sets out not only to find an 80's Trans Am, but the Hoff.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/bCt0mMdgmBSiRKcuP7KucUElqkm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-12-08","episode_number":14,"episode_type":"finale","id":1051384,"name":"Don't Hassle the Hoff - Pontiac Trans Am  Part II","overview":"It's a race against time as the Monkeys rush to finish the KITT car. Richard's on edge because he's worried that he and Aaron might not make it to the Las Vegas birthday party with the car by the deadline. They also don't know if the Hoff will show up.","production_code":"","runtime":42,"season_number":5,"show_id":46874,"still_path":"/ndQxzraHNz8rUT9WOZPbfBC564s.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"This season, Richard and Aaron get back to their roots and build a chopped Model A. The duo also lands a huge muscle car for a SONIC restaurant drive-in, but the Camaro convertible SS turns out to be trickier than originally thought as the deadline inches closer and closer. Aaron also continues his dream of being a race car driver, and he enters one of the deadliest and most difficult road races in the world: Pike's Peak.","id":65708,"poster_path":"/611Rm4PRULNrg8kkzLtcirbzlb3.jpg","season_number":5,"vote_average":0},"6":{"_id":"553e9f0f9251411435003fbf","air_date":"2015-03-23","episodes":[{"air_date":"2015-03-23","episode_number":1,"episode_type":"standard","id":1057275,"name":"'71 Scat Pack Challenger Part I","overview":"Richard and Aaron try and transform a vintage '71 Dodge Scat Pack Challenger.","production_code":"","runtime":42,"season_number":6,"show_id":46874,"still_path":"/lSx7S3jEuZIqpHBfkWZNe5pVvta.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-30","episode_number":2,"episode_type":"standard","id":1057276,"name":"'71 Scat Pack Challenger Part II","overview":"Aaron and his team attempt to get the '71 Challenger build to accept the 2015 Challenger technology. In the process, they create a one of a kind resto/mod. Richard buys a busted up '34 Plymouth and the crew takes the '57 Shorty bus for a test drive.","production_code":"","runtime":42,"season_number":6,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-06","episode_number":3,"episode_type":"standard","id":1057277,"name":"Back to the 80's in a 68' Coronet","overview":"Richard buys a '69 Malibu only to realize there are massive issues. Aaron crashes into a '68 Coronet on the GMG lot. Richard travels to St. Louis to buy a tricked out '79 Camaro. Motley Crue performs at Gas Monkey Live grand opening.","production_code":"","runtime":42,"season_number":6,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-13","episode_number":4,"episode_type":"standard","id":1057278,"name":"Road to Barrett Jackson Part 1","overview":"Richard sells the '79 Camaro to prepare for Barrett Jackson, the biggest auction of the year. Aaron's team builds a '68 Impala while Richard and Dennis buy a '64 Corvette Stingray. Richard pulls the '66 VW bus, '69 F100 truck and '76 C10 to auction.","production_code":"","runtime":42,"season_number":6,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-20","episode_number":5,"episode_type":"standard","id":1057279,"name":"Road to Barrett Jackson Part II/NHRA","overview":"It's showtime at Barrett Jackson with wheeling-and-dealing throughout the week showcasing the excitement. Richard's Stingray arrives just in time for the start of the auction. Meanwhile, Aaron attends NHRA in Vegas to see how team Gas Monkey performs.","production_code":"","runtime":42,"season_number":6,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-27","episode_number":6,"episode_type":"finale","id":1057169,"name":"Rocking '76 G10 van","overview":"Richard and Aaron take on a different build when they decide to transform a $300 find on the side of the road into a '76 Exploration Van.The Dale Earnhardt '56 Nomad makes an appearance back at the shop, as KC and his team are tasked with fixing the body after it hit a deer.","production_code":"","runtime":42,"season_number":6,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"The Gas Monkey crew is busier than ever. Richard and Aaron take on one of their most demanding projects yet: rebuilding a '71 Dodge Scat Pack Challenger using parts from the 2015 version of the Dodge Scat Pack Challenger. The guys also get to work on a '68 Impala and A '57 Shorty School Bus. Additionally, Richard is working on expanding his business empire and the Gas Monkey brand by creating a new tequila company as well as opening up a concert hall. Both of these new projects represent a huge monetary risk for Richard, making it even more important that Gas Monkey Garage continue to keep the money rolling.","id":66275,"poster_path":"/1qr6wNLVlVFNyxhyzcjg8p6mMW1.jpg","season_number":6,"vote_average":0},"7":{"_id":"55e46a9392514137ec00437b","air_date":"2015-09-07","episodes":[{"air_date":"2015-09-07","episode_number":1,"episode_type":"standard","id":1132554,"name":"Cutlass Low Rider, Part I","overview":"Richard buys a '78 Cutlass so Aaron can build Gas Monkey's first ever lowrider, only to discover that Aaron's plan to create custom hydraulics is something he's never attempted before.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":"/dYdH1XoK6sUM89oL3JgMtXeJQQF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-14","episode_number":2,"episode_type":"standard","id":1132555,"name":"Cutlass Low Rider, Part II","overview":"As Richard heads to Houston to check out Gas Monkey's top fuel NHRA dragster do some racing, the Monkeys need to do some racing of their own to finish a custom lowrider paint job on the '78 Cutlass in time for the car's debut.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":"/150IPL4hTL3giI1uiplLVy3760B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-21","episode_number":3,"episode_type":"standard","id":1132556,"name":"Big Red Caddy, Part I","overview":"Richard and Aaron decide bigger is better, giving a red '67 Cadillac convertible the luxury treatment in a risky bid to attract a higher caliber of buyers.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":"/p3vtGlC5nZVO0okA8Cbc92ungkC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-28","episode_number":4,"episode_type":"standard","id":1132563,"name":"Big Red Caddy, Part II","overview":"With a big time buyer already on the way, engine and upholstery problems threaten to derail Richard and Aaron's red '67 Cadillac convertible.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":"/rJzreI9sZtCFp9ln0MP5qEYY9T9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-05","episode_number":5,"episode_type":"standard","id":1132564,"name":"Supping up a Super Ford GT - Part I","overview":"When Richard brings a smashed up 2005 Ford GT back to the shop with the intention of making a quick repair for a fast profit, Aaron talks him into giving it the full Gas Monkey treatment.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":"/3WGhuyszDTitvVEQOakxCH5o4nM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-12","episode_number":6,"episode_type":"standard","id":1111459,"name":"Supping up a Super Ford GT - Part II","overview":"As work on a smashed up 2005 Ford GT continues, Richard heads to Indiana to try to sell a Shelby Cobra prop car used in the superhero movie Iron Man.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":"/pNj1m7Cbihr4kGUAIHM2w9umdWo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-04","episode_number":7,"episode_type":"standard","id":1102908,"name":"Racing a '67 Dodge Dart - Part I","overview":"When Richard receives a drag race challenge from a couple of internet upstarts, he changes his plans on his '67 Dart build to transform it into the ultimate dragster.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":"/3KfpCZPePlVJTSmugnvrsoEsdD1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-11","episode_number":8,"episode_type":"standard","id":1250339,"name":"Racing a '67 Dodge Dart - Part II","overview":"With engine problems on the Dart threatening to stop their big race with Roadkill before it starts, Richard and Aaron could face epic humiliation in front of millions of fans.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":"/8TFH4X7AOrFilu3BKhsmo2Z1RsW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-18","episode_number":9,"episode_type":"standard","id":1855855,"name":"Frustrated with a '32 Ford: Return to Pike's Peak - Part I","overview":"Richard buys a '32 5 window Ford Coupe planning for an easy build for the Monkeys while Aaron is away racing at Pikes Peak, but fate and fortune have other ideas.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-25","episode_number":10,"episode_type":"standard","id":1855856,"name":"Frustrated with a '32 Ford: Return to Pike's Peak - Part II","overview":"The '32 5 window Ford Coupe Richard bought as an easy build for the Monkeys continues giving them problems, as weather and car issues threaten to derail Aaron's trip to Pike's Peak.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-01","episode_number":11,"episode_type":"standard","id":1855857,"name":"Motorcycle Mayhem/Packing a Packard for Pebble - Part I","overview":"When Richard's '29 Packard receives an invitation to the fabled Concours d'Elegance at Pebble Beach, he challenges the Monkeys to a motorcycle build off to keep them busy while he's away.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-08","episode_number":12,"episode_type":"standard","id":1855858,"name":"Motorcycle Mayhem/Packing a Packard for Pebble - Part II","overview":"While Richard takes his '29 Packard to compete at the elite Concours d'Elegance at Pebble Beach, the Monkeys race to complete their motorcycles in their big build off.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-15","episode_number":13,"episode_type":"finale","id":1855859,"name":"Revving up a '69 Riviera","overview":"Auction fever hits the garage as the Monkeys have less than a week to build a '69 Riveria to sell at the Leake Auction along with motorcycles from their big chopper build off to determine who will win Richard's big prize.","production_code":"","runtime":42,"season_number":7,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"This season begins with a new mantra for Richard: \"Big Risk, Big Reward,\" and he will roll the dice on some of Gas Monkey Garage's most expensive builds ever, while Aaron and his team attempt to conquer new technologies to create one-of-a kind masterpieces. Richard starts his quest to build bigger and better cars by scoring a '78 Cutlass, so Aaron can build Gas Monkey's first ever lowrider - something he's never attempted before. Richard and Aaron also hit the road to pick up a classic red '68 Cadillac convertible, giving it the luxury treatment in a risky bid to attract a higher caliber of buyer - even as costs escalate. Later, Richard heads to Kentucky to look at a prime '70 Ferrari 365, as his team attempts to soup up a near-totaled 2005 Ford GT. Richard also lands in Camaro heaven when he discovers a barn full of 16 vintage specimens.","id":70111,"poster_path":"/cHS13x0yuh4LO1Xjc39aIBnG7dV.jpg","season_number":7,"vote_average":0},"8":{"_id":"568a0364c3a3685f89013b73","air_date":"2016-09-05","episodes":[{"air_date":"2016-09-05","episode_number":1,"episode_type":"standard","id":1153966,"name":"Harley and Me","overview":"Richard buys Aaron a 1942 Harley-Davidson WLA '45 with the aim of rebuilding the bike appropriate to its original era in order to participate in a vintage race on the New Jersey shore in just two weeks.","production_code":"","runtime":42,"season_number":8,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-12","episode_number":2,"episode_type":"standard","id":1155748,"name":"Hot off the Pantera","overview":"Looking to make a smash debut at an all-new Barrett-Jackson auction in eight weeks, Richard buys into Aaron’s plan to build a first-ever ’72 Pantera fitted with a custom turbo-charged Ford EcoBoost V6 engine.","production_code":"","runtime":42,"season_number":8,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-19","episode_number":3,"episode_type":"standard","id":1158935,"name":"Pan-tera’s Labyrinth","overview":"A last minute problem arises with the turbo-charged EcoBoost '72 Ford Pantera Aaron is building for the new Barrett-Jackson Northeast, which in turn, forces Richard to gamble by bringing his quarter-million dollar 2005 Ford GT to the auction instead.","production_code":"","runtime":42,"season_number":8,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-03","episode_number":4,"episode_type":"standard","id":1161142,"name":"The Pickup Artist","overview":"Richard and Aaron set an ambitious deadline of just six weeks to turn an old '49 Chevy pickup into a show-quality truck in time to debut at the big Lone Star Throwdown.","production_code":"","runtime":42,"season_number":8,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-10","episode_number":5,"episode_type":"standard","id":1162713,"name":"Pickup the Pieces","overview":"Richard and Aaron's goal of turning an old '49 Chevy pickup into a show-quality truck comes down to the wire as they race to finish it in time to debut at the Lone Star Throwdown.","production_code":"","runtime":42,"season_number":8,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-17","episode_number":6,"episode_type":"standard","id":1164212,"name":"Camaro Rising","overview":"After a number of tough builds, Richard decides to do something nice for Aaron and the Monkeys and buys them a '67 Camaro mounted on a K5 chassis hoping it will lift their spirits.","production_code":"","runtime":42,"season_number":8,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-24","episode_number":7,"episode_type":"standard","id":1166027,"name":"Porsche 9-1-1","overview":"Aaron wants to build a junkyard Porsche capable of going head to head with Richard's 911 Turbo S. Aaron finds out that the expensive conversion kits he bought will not fit. Richard heads off to buy four rare Mustangs.","production_code":"","runtime":42,"season_number":8,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-29","episode_number":8,"episode_type":"finale","id":1165996,"name":"Germany Meet America","overview":"Aaron and the gang aim to finish their junkyard Porsche ahead of their big race against Richard's new $200,000 Porsche Turbo S, and Richard finds four Mustangs.","production_code":"","runtime":42,"season_number":8,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"The season begins with Aaron restoring a vintage Harley Davidson in celebration of Discovery's  Harley and the Davidsons. The rest of the season is jam-packed with adrenaline-fueled fun. Between a visit from iconic car builder Chip Foose, a trip to Nascar with the Miller Lite team, a Porsche vs. Porsche race and a venture into the business of Monster Trucks - the Gas Monkey Garage has its work cut out for it. The season also includes some of the best builds the crew has ever done, including a'72 Pantera, a '00 Porsche hot-rodded with a Chevy engine, and a classic '49 pickup, which turns out to be the ultimate curse for the team, as they attempt to restore it to show truck perfection.","id":73524,"poster_path":null,"season_number":8,"vote_average":0},"9":{"_id":"57cc78b69251412625002d4c","air_date":"2017-01-16","episodes":[{"air_date":"2017-01-16","episode_number":1,"episode_type":"standard","id":1220161,"name":"Million Dollar Monkey","overview":"Aaron heads to Pike's Peak, while the guys build a 1955 Chevy that Richard plans to sell at a Barrett-Jackson auction on the East Coast.","production_code":"","runtime":42,"season_number":9,"show_id":46874,"still_path":"/ljQLP6Lrk7eYaUPlBs2VjwQTuKw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-23","episode_number":2,"episode_type":"standard","id":1222662,"name":"Opening Bid","overview":"Richard prepares for auction at Barrett-Jackson, but last-minute problems with his '55 Chevy may prevent him from taking it to auction.","production_code":"","runtime":42,"season_number":9,"show_id":46874,"still_path":"/u3dFywnck9Fg5vmFgQY7vftLxGq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-30","episode_number":3,"episode_type":"standard","id":1224296,"name":"When Lightning Strikes","overview":"Betting on a speedy build because of all the aftermarket parts available for G-Body cars, Aaron decides to bet Richard that he can finish a 1980 El Camino in three weeks instead of four.","production_code":"","runtime":42,"season_number":9,"show_id":46874,"still_path":"/rYoiF9h7GCwl6mNkAvNxs9srgrq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-06","episode_number":4,"episode_type":"standard","id":1228590,"name":"La Casa Del Camino","overview":"Just when Aaron thinks he can win a bet against Richard, last minute problems threaten to push them past their deadline to finish a 1980 El Camino one week ahead of schedule.","production_code":"","runtime":42,"season_number":9,"show_id":46874,"still_path":"/wv2xA6j52uj6jhzzXH9iZodmoK4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-13","episode_number":5,"episode_type":"standard","id":1230411,"name":"Buggin' Out","overview":"With Aaron set to take off soon for a long-deserved vacation, he and Richard get the Monkeys started on giving the \"proper\" treatment to a '65 Volkswagen Beetle.","production_code":"","runtime":42,"season_number":9,"show_id":46874,"still_path":"/nnET8xjxlJ63ZrECEd5S23SH4jl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-20","episode_number":6,"episode_type":"standard","id":1926277,"name":"100 Monkeys","overview":"With 100 episodes of Fast n' Loud now under their belts, Richard and Aaron host a star-studded party to celebrate the past, present, and future of Gas Monkey Garage.","production_code":"","runtime":42,"season_number":9,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-20","episode_number":7,"episode_type":"standard","id":1232407,"name":"The Vomit Comet","overview":"With Aaron on vacation, Richard lets the Monkeys give his first car he owned in high school the Gas Monkey treatment, a '74 vomit green Mercury Comet.","production_code":"","runtime":42,"season_number":9,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-27","episode_number":8,"episode_type":"standard","id":1233850,"name":"Bye Bye Beardy / Build to Mega Race Part I","overview":"Aaron tells Richard he is quitting Gas Monkey just as Richard agrees to a drag strip showdown with Big Chief from Street Outlaws. The Monkeys are stuck to build a race car on their own at the same time he's challenged to his own race against another set of Outlaws.","production_code":"","runtime":42,"season_number":9,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-03-06","episode_number":9,"episode_type":"finale","id":1233849,"name":"Vs. Street Outlaws: Build to Mega Race, Part II","overview":"Aaron struggles to get his BMW ready for the race with Street Outlaws. Meanwhile, Richard deals with the aftermath when his Challenger crashes on its final test run.","production_code":"","runtime":42,"season_number":9,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"The new season kicks off when Richard and Aaron come across a rare '55 Chevy. With the Barrett-Jackson Northeast auction on the horizon, the crew must work quickly to turn this beat up car into a hot classic. If they can finish in time, Richard will be able to bring the car to auction and secure a major payout. With the monkeys left back at the garage to work on the build, Aaron takes another run at the notoriously dangerous Pike's Peak road race and Richard opens a new Gas Monkey Bar and Grill in Key West, Florida. Then, Richard, Aaron and the monkeys head back in time, working on classic builds including an '80 El Camino and a '65 VW. Richard also returns to his high school roots when he finds and builds his very first high school car, a '74 Comet - a hot rod he WISHES he drove 20 years ago! Meanwhile, another dream comes to fruition when the Smokey and the Bandit fan club finds Richard the other car from his youth, a Red Trans Am. In the biggest undertaking of the season, the Gas Monkey Crew decides to build a race car, pulling out all the stops. Now all that's left to do is find a willing challenger.","id":79849,"poster_path":null,"season_number":9,"vote_average":0},"10":{"_id":"587b9b6ec3a3684a6501083e","air_date":"2017-10-16","episodes":[{"air_date":"2017-10-16","episode_number":1,"episode_type":"standard","id":1257452,"name":"Step Vanning into a New Era","overview":"It's the beginning of a new era at Gas Monkey Garage as Richard puts the Monkeys in charge of hot-rodding a '73 Chevy P30 Step Van for their first big build without Aaron.","production_code":"","runtime":42,"season_number":10,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-23","episode_number":2,"episode_type":"standard","id":1259755,"name":"Crusin' for a Bruisin'","overview":"As the Monkeys race to finish their first big build without Aaron, Richard tries to unload his '65 Shelby Mustang GT that has a frozen engine.","production_code":"","runtime":42,"season_number":10,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-30","episode_number":3,"episode_type":"standard","id":1262434,"name":"All About the Bass","overview":"Richard brings in Gas Monkey's first ever guest builder, Dallas Hot rodder Brian Bass, to team up with the Monkeys and build a '60s style hot rod out of a '34 Ford Coupe.","production_code":"","runtime":42,"season_number":10,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-06","episode_number":4,"episode_type":"standard","id":1265459,"name":"Bad Bass","overview":"As the Monkeys and guest builder Brian Bass go over the schedule on their '34 Coupe, Richard makes a deal to feature the car in Hot Rod magazine if the car can be finished on time.","production_code":"","runtime":42,"season_number":10,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-13","episode_number":5,"episode_type":"standard","id":1278569,"name":"Busch vs. Logano","overview":"After 2017 Daytona 500 winner Kurt Busch makes a surprise visit to Gas Monkey, Richard strikes a deal to build him a '72 Pantera to race against fellow NASCAR champion Joey Logano.","production_code":"","runtime":42,"season_number":10,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-20","episode_number":6,"episode_type":"finale","id":1282430,"name":"The Race: Busch vs. Logano","overview":"Richard and the Monkeys make an attempt to finish Kurt Busch's custom '72 Pantera in time for his grudge race against NASCAR superstar Joey Logano and his Factory 5 Shelby Daytona.","production_code":"","runtime":42,"season_number":10,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"With Aaron Kaufman's departure at the end of last season, Richard and his crew are entering a new stage at Gas Monkey Garage, setting out to prove the shop is still going strong. Richard and his team search high and low for forgotten and derelict vintage cars to buy and restore, and this season they're determined to go big—literally—by finding an original 1973 Chevy P30 Step Van and turning it into a hot rod. Throughout the season, guest builders Big Mike Sajid and Brian Bass also show off their skills and work with the Monkeys to build impressive hot rods. Without Aaron, the Monkeys work harder than ever before to turn even the most neglected cars into gold. However, these rare cars come with hefty price tags. Will Richard and his crew at Gas Monkey Garage be able to finish cars and turn a profit without Aaron, or will they lose sight of looming deadlines with too many opinions on each build?","id":83986,"poster_path":null,"season_number":10,"vote_average":0},"11":{"_id":"58e67e789251412810042d9b","air_date":"2018-03-12","episodes":[{"air_date":"2018-03-12","episode_number":1,"episode_type":"standard","id":1300360,"name":"Dat Car","overview":"Richard and the Monkeys partner up with SEMA Battle of the Builders finalist Big Mike to build Gas Monkey's first ever import tuner, a '75 Datsun 280Z.","production_code":"","runtime":42,"season_number":11,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-19","episode_number":2,"episode_type":"standard","id":1300361,"name":"Tune It Up","overview":"As the Monkeys and guest builder Big Mike race to get their '75 Datsun 280Z ready, a missing part may stop Richard from debuting Gas Monkeys first-ever tuner car at SEMA.","production_code":"","runtime":42,"season_number":11,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-26","episode_number":3,"episode_type":"standard","id":1300362,"name":"Shining Up a '59 F-100","overview":"When a big-name client wants Gas Monkey to build them a promotional vehicle on spec, Richard bets they'll take a shine to a custom '59 Ford F-100.","production_code":"","runtime":42,"season_number":11,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-02","episode_number":4,"episode_type":"standard","id":1300363,"name":"Monkeying Around","overview":"Richard and the Monkeys gather at the Monkey Trap along with their biggest fans to answer questions, share memorable moments, and revisit favorite builds like the 4x4 Camaro and Firebirds #1 and #2.","production_code":"","runtime":42,"season_number":11,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-09","episode_number":5,"episode_type":"standard","id":1300364,"name":"Shiny and New","overview":"Richard's gamble of building a '59 Ford F-100 on spec for Shiner Beer may payoff to the tune $150,000, but only if they like the final result.","production_code":"","runtime":42,"season_number":11,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-16","episode_number":6,"episode_type":"standard","id":1300366,"name":"Trouble in the Galaxie","overview":"Richard's plan for a straightforward upgrade on a '62 Ford Galaxie goes south when the Monkeys discover the worst body panel they've ever seen after it returns from sandblasting.","production_code":"","runtime":42,"season_number":11,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-23","episode_number":7,"episode_type":"standard","id":1300367,"name":"Richard's Guide to the Galaxies","overview":"A series of bad decisions on their '62 Galaxie build by the Monkeys could jeopardize Richard's plan to take it to auction.","production_code":"","runtime":42,"season_number":11,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-30","episode_number":8,"episode_type":"standard","id":1300368,"name":"The Bass Is Back","overview":"Builder Brian Bass is back and rejoins the Gas Monkey crew as Richard plans to build the iconic '92 Chevy 3500 Dually known as the \"Krew Kut\" in time to reveal the pickup at the Lone Star Throwdown.","production_code":"","runtime":42,"season_number":11,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-07","episode_number":9,"episode_type":"finale","id":1300369,"name":"The Cutting Krew","overview":"Richard's plan to reveal the Krew Kut Dually at the Lone Star Throwdown hits a snag when rain forces him to come up with a new plan to re-introduce it to its fans.","production_code":"","runtime":42,"season_number":11,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 11","overview":"Richard and the Monkeys are tuning into a whole new groove at Gas Monkey Garage with bigger builds and higher horsepower. Motor mastermind Richard Rawlings travels the back roads, searching barns, garages and open fields for that one rare ride to restore. Once the deal is sealed, it's back to Gas Monkey Garage where Richard and his team work to turn the cars into gold. The new season takes Richard and the Monkeys into unfamiliar territory as they attempt to break new ground in the build space, risking their reputation in the process. Also, throughout the season, guest builder Big Mike works with the Monkeys to build custom hot rods.","id":87174,"poster_path":null,"season_number":11,"vote_average":0},"12":{"_id":"5d77c7ed5907de00122cc262","air_date":"2019-07-08","episodes":[{"air_date":"2019-07-08","episode_number":1,"episode_type":"standard","id":1926259,"name":"Bullitt in the Chamber","overview":"Richard Rawlings and the Monkeys are handed a huge challenge when Chad McQueen asks them to take a 1968 Fastback Mustang and turn it into the iconic muscle car for a recreation of Hollywood's most famous move car chase.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5f2438edbbe1dd00372bd3a9","order":500,"adult":false,"gender":2,"id":23920,"known_for_department":"Acting","name":"Chad McQueen","original_name":"Chad McQueen","popularity":10.227,"profile_path":"/wHU54LIBJwxjnNvmc6sofdiy8Bi.jpg"}]},{"air_date":"2019-07-15","episode_number":2,"episode_type":"standard","id":1926260,"name":"Scout's Honor","overview":"Richard Rawlings and the Monkeys forge gear-head history, to be the first to pack a '79 Scout with a 707 horsepower Hellcrate engine for a huge payday. Then, after Feds busted its last owner, will Richard retake his famous Ferrari \"Dark Horse?\"","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-07-22","episode_number":3,"episode_type":"standard","id":1926261,"name":"Beyond Reasonable Scout","overview":"The Monkeys race to be the first-ever to drop a Hellcat motor in their '79 International Scout and fulfill Richard's quest to fetch the world record for the most-expensive ever sold. And Richard tries to convince a friend to buy a '63 Stingray.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-05","episode_number":4,"episode_type":"standard","id":1926262,"name":"SEMA Dreamin'","overview":"The Monkeys raise the bar at Gas Monkey Garage with a mind-blowing super-build they plan to debut at SEMA.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-12","episode_number":5,"episode_type":"standard","id":1926263,"name":"Chop Shop Truck","overview":"Richard Rawlings makes Brian Bass an offer he can't refuse to turn his antique Ford into the ultimate Gas Monkey shop truck. And Richard is seeing green over a 1970 Cuda, but transit trouble has the rest of the Monkeys seeing red.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-19","episode_number":6,"episode_type":"standard","id":1926264,"name":"Monsters and Monkeys","overview":"The Monkeys find themselves in a hot-rod dilemma when their 1950s flat-head isn't tailor-made for their 1933 Ford pickup, as a looming deadline approaches; Richard travels west to buy a far-out 1970s van, and the garage heads to Monster Jam.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-26","episode_number":7,"episode_type":"standard","id":1926265,"name":"Keeping It Shelby","overview":"The Monkeys prepare Richard's beloved '68 Mustang for the prestigious Shelby Mustang Meet and Richard buys a one-of-a-kind van once owned by a Mopar icon.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-02","episode_number":8,"episode_type":"standard","id":1926266,"name":"A Very Brady Edition","overview":"When Barry Williams asks Richard and the Monkeys to recreate the iconic Brady Bunch station wagon for HGTV, Richard can't say no. But with only 30 days and several mishaps along the way, the revamped '69 Plymouth Satellite may not make the deadline.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-16","episode_number":9,"episode_type":"standard","id":1926268,"name":"Chevy Chase","overview":"It's a double-barreled blast of NASCAR as Richard Rawlings and the Gas Monkeys dive into stock car racing; first, they turn a 1952 Chevy Coupe into a fire-breathing dirt track racer, and then Richard partners with NASCAR royalty.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-16","episode_number":10,"episode_type":"standard","id":2210660,"name":"Thunderstruck","overview":"Richard Rawlings and the Gas Monkeys battle numerous setbacks including an act of God as they race to finish their old-time NASCAR tribute build. Then an old friend talks Richard into working on a dubious \"classic,\" an '85 Zimmer.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-23","episode_number":11,"episode_type":"finale","id":1976915,"name":"No Second Chances","overview":"The Monkeys put the pedal to the metal in their final attempt to finish the '72 Buick Riviera super-build in time for SEMA. The team's integrity is on the line and $300,000 has been invested so failure is not an option.","production_code":"","runtime":42,"season_number":12,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 12","overview":"Richard is putting everything on the line in hopes of taking Gas Monkey Garage to new heights and a new level of success in the hotrod world. The new season brings incredible builds, iconic stunts and record payouts along with a set of new challenges that will put Gas Monkey Garage to the ultimate test. With builds bigger than ever before, Richard's team wrestles with intricate projects, impossible deadlines and Richard's demanding standards.","id":132089,"poster_path":null,"season_number":12,"vote_average":0},"13":{"_id":"5e87c9256dc6c0001780ad5e","air_date":"2020-03-29","episodes":[{"air_date":"2020-03-30","episode_number":1,"episode_type":"standard","id":2210661,"name":"Super Troupe Jeep","overview":"Gas Monkey teams up with the Gary Sinese Foundation to build a custom '81 Jeep CJ7 as a throwback tribute to the soldiers for Veteran's Day. Later, an original '68 Chevelle has Richard seeing green but only if he can part with his California dream.","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":"/oDQpxXLaaWmNdPcbDstfxpddTTP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-06","episode_number":2,"episode_type":"standard","id":2213617,"name":"Wranglin' World Records","overview":"The Monkeys begin work on a 2018 Jeep Wrangler, the second of two jeeps they're customizing for the Gary Sinese Foundation's Veteran's Day auction. Meanwhile, Richard makes a deal on a '55 Crown Vic he hopes to donate to the Gas Monkey Foundation.","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":"/hN48h1EltaFMr385Qm6yvn3h44K.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-13","episode_number":3,"episode_type":"standard","id":2223032,"name":"Vintage Payday","overview":"Richard races toward a vintage payday by restoring his '37 Buick Racer back to its Indy 500 roots. Meanwhile, the guys buy a one-owner '77 Blazer that could fetch them double their money. Later, a surprise birthday gift has Richard feeling nostalgic.","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":"/mFaACus5fuchkE5eFEacTCbbEa7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-20","episode_number":4,"episode_type":"standard","id":2235200,"name":"Race Against Time","overview":"The Monkeys race to finish their Buick Indy Racer for a deep-pocket client. Next, a collector wheels and deals for Richard's 1975 Datsun 280-Z and Brian Bass reveals upcoming changes at Gas Monkey Garage.","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-27","episode_number":5,"episode_type":"standard","id":2243567,"name":"Quick-Flippin' a Caddy","overview":"Richard pays big bucks hoping to use a '63 Cadillac for a flip project. The guys do a bang-up job on a budget but Jason goes rogue and risks tanking the whole thing. Later, Russell overpays for a '47 Fleetline that looks bomb ... but doesn't run.","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-04","episode_number":6,"episode_type":"standard","id":2258031,"name":"In a Galaxie Far, Far Away","overview":"The guys set a seven-day deadline to bust the rust off a '68 Ford Galaxie XL. Next, Richard pairs up with Variety Motorsports to knock out a 1980 Stutz Four Motor Car for country music star Charlie Pride. Finally, Richard rides a beast of a motorcycle.","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-11","episode_number":7,"episode_type":"standard","id":2258032,"name":"Galaxie Quest","overview":"The Monkeys sprint to wrap up the '68 Ford Galaxie XL before its owner comes to Dallas. Meanwhile, the guys dig through barn grime and dust to get to a '69 Camaro in Minnesota. Finally, the guys get a tempting invite from the Golden Knights.","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-18","episode_number":8,"episode_type":"standard","id":2276019,"name":"Hot for Firebirds","overview":"The Monkeys start out with a quick-and-easy flip on a '67 Firebird convertible that quickly turns into a full-on Gas Monkey build the guys depend on for a profit. Later, a Hellcat comes up missing and a full-scale mission is launched for its return.","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-25","episode_number":9,"episode_type":"finale","id":2276020,"name":"Flippin' the Bird","overview":"The guys face a seven-day deadline to raise their '67 Firebird from the ashes. Meanwhile, Richard heads to the boondocks of Tokio, TX, to search for a rare '51 VW Samba Bus. Finally, NFL star DeMarcus Ware shops for an authentic Gas Monkey hotrod.","production_code":"","runtime":42,"season_number":13,"show_id":46874,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 13","overview":"With builds bigger than ever before, Richard Rawlings' team wrestles with intricate projects, impossible deadlines and demanding standards while Gas Monkey Garage solidifies its elite status in the hotrod world. Throughout the season, Richard, Russell J. Holmes and the crew push the boundaries on some of the most complex builds the garage has ever taken on.","id":146870,"poster_path":"/976AyeDT1isz2uAnYuQrjRkS05D.jpg","season_number":13,"vote_average":0}}}