{"adult":false,"backdrop_path":"/vhDErhLUBnyLdDNtgaeOYAfIoM2.jpg","created_by":[{"id":1466423,"credit_id":"5aa1a1650e0a260d450037e8","name":"Jody Schaeffer","gender":0,"profile_path":null},{"id":1676173,"credit_id":"5aa1a16ec3a3686677003475","name":"George Krstic","gender":0,"profile_path":null}],"episode_run_time":[26,30],"first_air_date":"2004-05-01","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"},{"id":35,"name":"Comedy"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"","id":472,"in_production":false,"languages":["en"],"last_air_date":"2005-01-15","last_episode_to_air":{"id":1449539,"name":"Rearview Mirror, Mirror (Part Two)","overview":"In an attempt to stop evil Coop from destroying their dimension, Coop and Gorrath, assisted by alternate Jamie, launch a desperate assault on the evil Coop.","vote_average":8,"vote_count":1,"air_date":"2005-01-15","episode_number":13,"episode_type":"finale","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/6TipKtoqWPqwk4YK9laxmb3AM8W.jpg"},"name":"Megas XLR","next_episode_to_air":null,"networks":[{"id":56,"logo_path":"/c5OC6oVCg6QP4eqzW6XIq17CQjI.png","name":"Cartoon Network","origin_country":"US"}],"number_of_episodes":26,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Megas XLR","overview":"Megas XLR is a series about an overweight couch potato named Coop who stumbles across a giant robot in a junkyard. He soon discovers that the robot was sent from the future when a woman named Kiva returns to the past to claim what is rightfully hers, though Coop made so many modification to the machine so he's the only one who can fully operate it. Things also heat up when Coop learns that an alien race called the Glorft are also after his MEGAS robot, so he teams up with Kiva and his best friend Jamie to fight them off, though mostly so he can keep his new toy.","popularity":34.579,"poster_path":"/d4Mc687WE8wFAk5nlmJJh4qNuIO.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2004-05-01","episode_count":13,"id":80089,"name":"Season 1","overview":"","poster_path":"/tsiTKIEd3wVTTlaRTA1LGeDb4MN.jpg","season_number":1,"vote_average":7},{"air_date":"2004-10-16","episode_count":13,"id":88739,"name":"Season 2","overview":"","poster_path":"/tsiTKIEd3wVTTlaRTA1LGeDb4MN.jpg","season_number":2,"vote_average":6.2}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.367,"vote_count":79,"season_data":{"1":{"_id":"57d4ba6c92514150d9001fae","air_date":"2004-05-01","episodes":[{"air_date":"2004-05-01","episode_number":1,"episode_type":"standard","id":1222550,"name":"Test Drive","overview":"Coop finds an alien robot in a Jersey City junkyard, and decides to soup it up with hot-rod parts and flame decals. What happens when the original owner of this robot sees Coop's improvements?","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/rx71mDAMyxSarHfBj3782VnjmSH.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-05-08","episode_number":2,"episode_type":"standard","id":1222551,"name":"Battle Royal","overview":"A floating alien head invites Coop to participate in a tournament; Coop is asked to take a dive during one of his fights for a windfall.","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/rPIz6UKKQUnwMIS89x0KiZSjcqv.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-05-15","episode_number":3,"episode_type":"standard","id":1222552,"name":"All I Wanted Was a Slushie","overview":"Coop quests for a slushie on a hot day in the city; however, every store he visits gets destroyed before he can get his frozen treat.","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/v85S1xt3mhskNduCI5vOWsxDWUe.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-05-01","episode_number":4,"episode_type":"standard","id":1259806,"name":"The Fat & the Furious","overview":"Coop begins a bad day by accidentally creating a giant cheese monster and has to stop it, but the method he uses gets cheese in Megas's CPU core. Unaware of this, Coop enters Megas in an auto show, and is putting up a very good showing until Megas breaks down and nearly destroys the building. Fortunately, he's able to stop it, but now the Glorft see an opening to attack and invade the city, hoping to capture Megas. But first they need to find the CPU core.","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/xE9Haw8fBs8yuy6pNdcwZCrRN0d.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-05-29","episode_number":5,"episode_type":"standard","id":1259807,"name":"Buggin the System","overview":"Coop, Jaime and Kiva discover an ancient Ringworld filled with energy-loving worms.","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/4DHhrn9UIcDZmYzM5Pf7fgJVEtc.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-05-22","episode_number":6,"episode_type":"standard","id":1259808,"name":"The Bad Guy","overview":"The S-Force erroneously attack Coop because they believe he is an evil-doer intent on destroying the Earth; to complicate matters, Coop is aided by the S-Force's arch-nemesis, Ender, as he too believes Coop is evil.","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/3IHGXlnIDfBWakw12I10e1dr7rI.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-06-05","episode_number":7,"episode_type":"standard","id":1259809,"name":"Break Out","overview":"After buying a game cartridge from a garage sale, Coop accidentally releases dangerous prisoners from an inter-dimensional prison.","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/cTnK0uRwZTK8oa82UPyxEuUfCpL.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-06-07","episode_number":8,"episode_type":"standard","id":1259810,"name":"DMV: Department of Megas Violations","overview":"After racking up multiple driving violations, Coop has to spend the day at the DMV to get Megas out of impound.","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/lGGxriClRaDSKxgGg3pAvqMuP5M.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-07-31","episode_number":9,"episode_type":"standard","id":1449522,"name":"Dude, Where's My Head?","overview":"In order to impress a girl, Jamie borrows Coop's car to take her for a ride. Unfortunately, Warmaster Gorrath arrives piloting a deadly replica of Megas (dubbed Mecha-Megas) who's destroying Jersey searching for Megas; naturally, everyone thinks that the fake is just Coop being destructive. So Coop must use his secondary command bridge to control Megas. However, this method is much more difficult, so Coop does rather badly. Even worse, Jamie accidentally activates the car's connection to Megas, so now he's in control of Megas, but he has no idea - he's just trying to have a date.","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/5IUQyXyW8XAMc1oeuVQl6r7xtnv.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-08-14","episode_number":10,"episode_type":"standard","id":1449523,"name":"Junk in the Trunk","overview":"Coop accidentally damages a vital part of Megas, the photonic stabilizer. Without it, Megas will go up in a blaze of fiery glory and explode, which will not only destroy Megas, but also, everything within a 100-mile radius. Fortunately, Coop found a junk planet that probably has just about everything. Unfortunately, Varshin the Dealer wants Megas' time drive to complete his own robot and sends various \"zombie\" robots to retrieve it. Even more unfortunate, Goat has come along for the ride, and is thoroughly annoying Kiva, not to mention he's fantasizing about a personal robot of his own without any idea how to get or build one properly.","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/rZUhGHbAVHwwvOZ5T4nuHqTNoWb.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-08-21","episode_number":11,"episode_type":"standard","id":1449524,"name":"TV Dinner","overview":"In an attempt to fix the television, Coop accidentally causes a blast of concentrated television waves to go out into space and attracts a giant, radio-wave eating monster to Earth. Due to the fact it is eating all the TV-satellites, it is impossible for anyone to watch any TV. Coop needs to stop this thing at all costs, but there's one major snag - how do you stop a planet-sized monster that eats television waves, not to mention that it has a bunch of killer boogers inside its body?","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/7xMYNNvXOAZNQ5fz3Vwz1mfYHoa.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-09-04","episode_number":12,"episode_type":"standard","id":1449525,"name":"Coop D'Etat","overview":"Coop accidentally destroys a sacred treasure of the Azion Worlds, a robotic, alien empire - the Flame of Azeroth. The Emperor declares whoever captures Megas and bring it to judgement will be named as the new Emperor, so now Coop has to fight off a bunch of Azionites in the deep, dark reaches of the final frontier, all of which are, if necessary, willing to destroy each other to become the Emperor. (Note: due to a tape mixup, this episode was not shown until nearly a year later).","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/yhZPI3zoZ1fEQ2ND1MfGB8NnMr5.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-08-28","episode_number":13,"episode_type":"finale","id":1449526,"name":"The Driver's Seat","overview":"Coop accidentally teleports himself directly into the Karrajor, the Glorft Mothership, and now Kiva and Jamie have to figure out how to pilot Megas to save him. They do okay at first, but eventually crash into the Glorft mothership and get themselves - and Megas - captured. Fortunately, Gorrath foolishly lets Coop get the car, so Coop tears through the ship, intent on rescuing his friends and Megas. Now Coop must rescue everyone while finishing off the Glorft invasion once and for all, but how is he supposed to do that when the sheer amount of Glorft mech's overpowers even Megas and tears off several vital parts? Even worse, the Glorft have a new mech, the Karrajor in Mech mode, which is even larger than the UMD, which raises the question: how will Coop defeat this new threat with a critically damaged Megas?","production_code":"","runtime":null,"season_number":1,"show_id":472,"still_path":"/oyOvAEzSLVX9OoQow2zdjWckmlo.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":80089,"poster_path":"/tsiTKIEd3wVTTlaRTA1LGeDb4MN.jpg","season_number":1,"vote_average":7},"2":{"_id":"59291a199251413b5b047c7a","air_date":"2004-10-16","episodes":[{"air_date":"2004-10-16","episode_number":1,"episode_type":"standard","id":1449527,"name":"Ultra Chicks","overview":"In an effort to impress some Sailor Senshi-style space girls, known as the Ultra-Cadets, Jamie poses as Coop and is taken to their planet, where he learns the Ultra Cadets' city is in trouble from a giant fire monster. Armed only with an age-old, feminine robot, Jamie \"fights\" the monster and defeats it the way Coop always does: sheer luck. However, Coop arrives with Megas to save Jamie and gets into a fight with the mechanized Ultra Cadets.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/xmyCahcj0oYOuE9VYQ5AUYIduRt.jpg","vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-10-23","episode_number":2,"episode_type":"standard","id":1449528,"name":"The Return","overview":"It's 5:01 and a video is due back at the rental store by 5:30, and Coop has to get it there on time to keep his membership from being revoked. However, Magnanimous appears and challenges Coop to protect his title against several robots, including one resembling Mr. T. Coop manages to beat the robots, but inadvertently challenges the entire galaxy to fight him - and the galaxy takes him up on the offer.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/chRdKi2Eytkn9b9Ru61kCIGREnw.jpg","vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-10-30","episode_number":3,"episode_type":"standard","id":1449529,"name":"Don't Tell Mom the Babysitter's Coop","overview":"Coop inadvertently frees the Glorft from no-space, allowing Gorrath to start his revenge. The only thing Coop is worried about, however, is babysitting cousin Skippy, who is easily bored and hates everything about Coop's house. In an effort to get him to shut up, Coop takes Skippy to the moon in Megas. (Incredibly, he is still bored.) There he discovers the Glorft is plotting to smash the moon into the Earth. Coop has to fight off the Glorft while making sure Skippy doesn't end up Glorft fodder.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/6guh2Y8cD9S5KJ30blzhTg32PkL.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-11-06","episode_number":4,"episode_type":"standard","id":1449530,"name":"Viva Las Megas","overview":"Coop, Jamie and Kiva head off to Las Vegas, and inadvertently discover Area 50. Coop accidentally activates a destructive energy-leech robot, who, due to severe and fatal programming errors, sees everything as \"the enemy.\" Coop further screws up by directing the robot to Las Vegas. Now Coop must find a way to shut down the robot permanently before Las Vegas loses all its power. Coop in the end destroying the cities power source causing the robot to deactivate. And he then buried the robot in the Grand Canyon which he had to fill with dirt.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/oI6JAqcHXypY5M8RKrWwLYX1lE2.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-11-13","episode_number":5,"episode_type":"standard","id":1449531,"name":"S-Force S.O.S.","overview":"The S-Force has been captured by an evil villain named Zarek, and he is planning to execute them. Fortunately, Jax escapes and manages to enlist Coop's help. Coop manages to save the S-Force from the \"infinity zone,\" which Coop, Jamie, Kiva, the S-Force, and Megas fall into, but survive the Infinity Zone after Coop helps everyone escape, but now Zarek is sending down an entire army to terminate them. It's Megas and the Ultra-Dimensional Power Zorp vs. a bunch of insect robots! The \"gift\" that Zarek offers Coop, Jamie and Kiva is an end to their lives, whereas the \"gifts\" Coop tries to give Zarek, but almost destroys the S-Force with, is actually thousands of missiles being fired at Zarek, due to the new Super Destructor Mode.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/mjE5nJeH19P4ohWG0nNTArvHh5g.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-11-20","episode_number":6,"episode_type":"standard","id":1449532,"name":"Space Booty","overview":"Kiva gets some unwanted attention from Captain Warlock, a space pirate who goes for red heads, and now must make a choice between a possible time drive or two complete idiots. As usual, one wrong choice means certain death. Now Kiva must find a way to free Coop and Jamie as well as fend of the advances of one love sick space pirate and his mechanized crew.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/mtH3LuCw1axsJ6hi2jRuX9Vhz6S.jpg","vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-11-27","episode_number":7,"episode_type":"standard","id":1449533,"name":"Thanksgiving Throwdown!","overview":"Once again, Coop mistakenly releases a giant, plant-type alien menace that wants to destroy Earth and acquire its heat. Fortunately, Megas is too big for the plant to handle, so it has to find a bigger form. Unfortunately, this is Thanksgiving, and the spore fuses with a bunch of parade balloons to this end. Coop now must prevent the plant from wrecking the holiday.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/oADpjPVBfkC1Wv11YoEozV5XZLn.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-12-04","episode_number":8,"episode_type":"standard","id":1449534,"name":"Terminate Her","overview":"The Glorft, disguised as a motorcycle gang thanks to their latest Holo-Camouflages, comes to a rock concert. They're not there for entertainment, however - they want to eliminate Kiva's ancestor, which in turn would cause Kiva to cease to exist, which in turn would mean Megas would stay with the Glorft and never reach Coop, which would in turn doom Earth into extinction. Kiva and Jamie must protect the ancestor until Coop can get to Megas. To make matters worse, it seems that Jamie and has fallen for Kiva's ancestor and she has fallen for him.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/6Y1HDXi9gxKnbk1mTfLBzWJ8vhp.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-12-11","episode_number":9,"episode_type":"standard","id":1449535,"name":"Ice Ice Megas","overview":"Coop crashlands on an icy planet and ends up destroying its only mechanized guardian. Now he must protect the Yetis there from selfish, ice-hungry robots named the Cerilians, who use it to maintain their cooling systems. Trouble is, Megas is iced over, and does some of the Cerilian Army's work for him. This is going to be one icy battle for the team.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/iiD7y1mRYaaVCjuUzEPmyU0outa.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2004-12-18","episode_number":10,"episode_type":"standard","id":1449536,"name":"A Clockwork Megas","overview":"Coop, Jamie and Kiva teleport themselves to a planet with brainwashed robots who act like sissies and workers. The alien who did it tries to do the same to Megas, but his brainwasher device only works on sentient robots. (Obviously, Coop's doesn't count.) Coop tries to put the alien out of business for good without unnecessarily destroying the prisoners. Coop in the end destroys the mind control device, freeing the robots. He then leaves the planet, unfortunatly as the group leaves it's shown that the planet was actually a prison to the worst robots in the universe. Who start destroying the planet after they leave.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/hOP7lNdx2ZLbHifa9bmRYvbVJqP.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-01-01","episode_number":11,"episode_type":"standard","id":1449537,"name":"Universal Remote","overview":"Coop's builds the world's most powerful universal remote - and Skalgar (who Coop and Jamie called \"School Girl\"), an ignorant, alien criminal with an inferiority complex, wants it, believing its (non-existent) destructive power can boost his reputation. Coop underestimates his short opponent, and Skalgar teleports the remote to his own mech. Coop then typically destroys half of Jersey City attempting to recover the remote.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/wYQfQDbPeSDfnC22JmkmdX8V0h5.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-01-08","episode_number":12,"episode_type":"standard","id":1449538,"name":"Rearview Mirror, Mirror (Part One)","overview":"In the last days of the Earth War, Jamie and Kiva were busy shutting down the Glorft Core Destroyer, while Coop and the Glorft, led by Gorrath as usual, were fighting out. However, Coop and Gorrath get transported to a mirror dimension - because of a gamepad combo that activated the Transdimension Device - where Coop meets his alternate self, a futuristic, evil, and muscular warlord version of himself at that, having defeated the Glorft, abandoned Megas, formed an Empire, and keeps on destroying - no matter the location, time, dimension and enemy. He also sees that Kiva has turned cyborg as well and is evil Coop's sidekick. Alternate Jamie, on the other hand, has lost his cowardice forever and became strong enough to try and defeat evil Coop and his empire with his Resistance (and on a side note, Jamie and Kiva were dating in the future). Coop and Gorrath must work together this time to stop mirror Coop and prevent him from ever destroying Earth again.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/vcT8g4Cu63A2CU7hlQY9HuweMzd.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2005-01-15","episode_number":13,"episode_type":"finale","id":1449539,"name":"Rearview Mirror, Mirror (Part Two)","overview":"In an attempt to stop evil Coop from destroying their dimension, Coop and Gorrath, assisted by alternate Jamie, launch a desperate assault on the evil Coop.","production_code":"","runtime":null,"season_number":2,"show_id":472,"still_path":"/6TipKtoqWPqwk4YK9laxmb3AM8W.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":88739,"poster_path":"/tsiTKIEd3wVTTlaRTA1LGeDb4MN.jpg","season_number":2,"vote_average":6.2}}}