{
    "adult": false,
    "backdrop_path": null,
    "created_by": [],
    "episode_run_time": [
        45
    ],
    "first_air_date": "2011-09-22",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "",
    "id": 47856,
    "in_production": true,
    "languages": [
        "en",
        "cy"
    ],
    "last_air_date": "2020-11-17",
    "last_episode_to_air": {
        "id": 2498439,
        "name": "Greater Manchester Episode 4",
        "overview": "The pressure is on at Harrop Fold as GCSE exams get underway, and the school finds itself hitting the headlines when four members of staff are suspended over allegations of removing disadvantaged and struggling pupils from the school roll to improve exam results. The new heads girl launches an online campaign against uniform policy that lands her in trouble. Mr Walker is concerned that year 10 pupil Morgan may not be able to catch up with Spanish in time for her exams, and Mr Povey intervenes to find out the underlying cause of her disruptive behaviour",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2020-11-17",
        "episode_number": 4,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 45,
        "season_number": 6,
        "show_id": 47856,
        "still_path": "/2TgvSuu4AwF5qGbLeTxVFsn2rHX.jpg"
    },
    "name": "Educating …",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 26,
            "logo_path": "/hbifXPpM55B1fL5wPo7t72vzN78.png",
            "name": "Channel 4",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 43,
    "number_of_seasons": 6,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Educating …",
    "overview": "Educating … is a British documentary television programme produced by Twofour for Channel 4 that has run since 2011. It uses a fly on the wall format to show the everyday lives of the staff and students of various secondary schools around the UK; interspersed with interviews of those involved and featuring narration from the director and interviewer, David Clews.\n\nFilmed on location at schools in Harlow, Dewsbury, Walthamstow, Cardiff and Salford respectively, there have been six series to date: Educating Essex (2011), Educating Yorkshire (2013), Educating the East End (2014), Educating Cardiff (2015) and Educating Greater Manchester 1 & 2 (2017 and 2020).",
    "popularity": 4.097,
    "poster_path": "/kFf6AyIqbi4uNipxeGGXpwc7PXd.jpg",
    "production_companies": [
        {
            "id": 61485,
            "logo_path": "/zmJQMYKn6VdC1YUxK76u54TImIP.png",
            "name": "Twofour",
            "origin_country": "GB"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2013-12-19",
            "episode_count": 9,
            "id": 74579,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2011-09-22",
            "episode_count": 7,
            "id": 74575,
            "name": "Educating Essex",
            "overview": "Educating Essex is a British documentary television programme produced by Twofour for Channel 4 that ran for seven episodes from September to November 2011. It uses a fly on the wall format to show the everyday lives of the staff and students of Passmores Academy, a secondary school in Harlow, Essex, interspersed with interviews of those involved and featuring narration from the director and interviewer, David Clews.\n\nThe series received mixed media coverage: it was largely praised for its insight into the lives and behaviour of teenagers and the education system, but was also criticised for its depiction of students and teachers using profanity, as well as bullying and teenage pregnancy. The show received numerous awards, including director David Clews's British Academy Television Craft Award for his work on the programme in 2012; in the same year, the show was nominated for a Grierson Award for \"Best Documentary Series\".\n\nWhat is life really like for today's students and teachers? This series has unprecedented access to an English secondary school to follow a group of GCSE students, and the staff who teach them, as they face the most important year in their education. Passmores School in Harlow, Essex, is a successful school in a challenging area. Under headteacher Vic Goddard, it's been awarded Academy status and is rated 'outstanding' by Ofsted. The school has been rigged with 65 fixed cameras — from the corridors to the canteen, and from the headteacher's office to the detention hall — to reveal every detail of daily life.",
            "poster_path": "/t1TCZtk9gXwrtspNu4EpZwYZCZC.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2013-09-05",
            "episode_count": 8,
            "id": 74576,
            "name": "Educating Yorkshire",
            "overview": "Educating Yorkshire is a British documentary television programme broadcast on Channel 4. The eight-episode first series was first broadcast on 5 September 2013. Its format is based on the BAFTA Award winning 2011 series Educating Essex. It follows the everyday lives of the staff and students of Thornhill Community Academy, a secondary school in Dewsbury, Yorkshire.\n\nFilmed at Thornhill Community Academy near Dewsbury, Educating Yorkshire captures every detail of life in the school, from playground hijinks and inspirational lessons to life-changing events. It follows the work of Headteacher Jonny Mitchell to better the chances for all his students and build on successive years of improving exam results. Located at the heart of a diverse northern community and with a student population that is almost exactly half white-British and half British-Asian, the school offers a fascinating insight into modern school life in the UK. Told with warmth and humour, Educating Yorkshire explores the universally-recognisable themes of teenage life and those all-important pupil-teacher relationships that lie at the heart of everyone's formative years.",
            "poster_path": "/o6bQFeqR9PUQgfnuiMLvwpEcQID.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2014-09-04",
            "episode_count": 8,
            "id": 74577,
            "name": "Educating the East End",
            "overview": "Seeing what our secondary-school teachers have to contend with (and can achieve) in the classroom is an eye-opener, as we saw in the brilliant observational series Educating Yorkshire. Even though they try to be inspirational and encouraging, it can be a struggle. “It’s really hard to balance the idealism with the difficulties of dealing with a bunch of adolescents,” says Ms Smith, head at Frederick Bremer School in east London. Trainee teacher Mr Bispham’s attempts to teach a year-nine class Shakespeare shows how frustrating and challenging it is (rowdiness, swearing, chatting, boredom – he gets it all) but how much he and his colleagues care oozes through the screen.",
            "poster_path": "/3OlRJTs4fJ3zT3bZ1eRL1XWJi6o.jpg",
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2015-08-25",
            "episode_count": 8,
            "id": 74578,
            "name": "Educating Cardiff",
            "overview": "Educating is back, and this time we are in Wales at Willows High School in Cardiff. Educating Cardiff captures every detail of life at Willows and to kick the series off we are introduced to Head Teacher Joy Ballard, her stellar team of staff and some dynamic kids. From Year 7 to Year 11, newly qualified teachers to old-hands, this series shows what it’s like to learn and teach in the Welsh capital.\n\nEducating Cardiff captures every detail of what life is like for the students and staff at Willows High School.",
            "poster_path": "/8JEuzDRDcj2IvXw5bNfU3GtXvPx.jpg",
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2017-08-31",
            "episode_count": 8,
            "id": 136685,
            "name": "Educating Greater Manchester 1",
            "overview": "A warm and honest exploration of what life's like for students and their teachers at Harrop Fold, a secondary school at the heart of a changing community in Salford",
            "poster_path": "/f6GWxwXqvjBmqsWoGXxZUgkpkTu.jpg",
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2020-11-03",
            "episode_count": 4,
            "id": 167860,
            "name": "Educating Greater Manchester 2",
            "overview": "The series offering moving, funny and dramatic insights into modern schooling and teen life returns to Harrop Fold School, Greater Manchester",
            "poster_path": "/v1udSMBWXPNh24VILqjPmRqYKUw.jpg",
            "season_number": 6,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        },
        {
            "english_name": "Welsh",
            "iso_639_1": "cy",
            "name": "Cymraeg"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 8.5,
    "vote_count": 2,
    "season_data": {
        "1": {
            "_id": "56c0d5f89251410a6200044f",
            "air_date": "2011-09-22",
            "episodes": [
                {
                    "air_date": "2011-09-22",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1165794,
                    "name": "Essex Episode 1",
                    "overview": "The first programme of the series joins Passmores School's deputy head Mr Drew on the front line of school discipline.\n\nDealing with emotional teenagers, enforcing detentions and maintaining the school's high standards - as well as teaching history - is all in a day's work for Mr Drew. Some love him, others love to hate him.\n\nIt's the last few days of term before Christmas and Mr Drew has more to contend with than a few snowballs in the playground. When a row over school uniform escalates, an accusation from a pupil threatens to derail his entire career.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 47856,
                    "still_path": "/uH5Bl9pymJmXuTRQthRnTY90Ldw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-09-29",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1165795,
                    "name": "Essex Episode 2",
                    "overview": "This programme features the age-old problem of bullying. From cyber-harassment to an old-fashioned scrap, bullying is something that every school faces.\n\nAs headteacher Mr Goddard says, it's only by acknowledging this that a school can tackle the issue. And while technology may have changed, with texts and social media, the issues of falling out and fitting in remain the same.\n\nRebel Sam and model student Gabby come from opposite ends of the academic spectrum, but both of them, in different ways, have been affected by bullying. When Gabby starts to receive threatening text messages, deputy headteacher Mr Drew plays detective as he tries to discover the culprit and bring them to justice.\n\nAnd when Sam - who has been bullied in the past for being 'different' - falls out with close friend Dean, Mr Drew is called upon to act as referee as Dean's irate mum and sister arrive at school demanding action.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 47856,
                    "still_path": "/h25Mf0xzCmot1hjIfdTgE2auO5.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-06",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1165796,
                    "name": "Essex Episode 3",
                    "overview": "Charming but cheeky Vinni was a model student when he started at the school. But since the break-up of Vinni's parents' marriage his behaviour has deteriorated.\n\nSo much so that head teacher Mr Goddard worries whether Vinni will make it to the end of Year 11. And some staff question how far the school can go to keep him in school.\n\nWhen Vinni's home situation dramatically changes, it has a huge impact on his school life and leads Mr Goddard to one of the most heartbreaking moments in his career.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 47856,
                    "still_path": "/mnvnuKcH9MaZD6oFtFOgggym487.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-13",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1165797,
                    "name": "Essex Episode 4",
                    "overview": "Final year students Sky and Liam's world is turned upside down when they discover they're expecting a baby. Sky desperately wants to finish school, but will she manage to when the baby is due at the same time as her GCSEs?\n\nLuke has a troubled relationship with school. His temper can get the better of him and the staff worry whether they can coax him to the end of the year and the GCSEs that will help determine his future.\n\nAs autumn exam week arrives, Mr Drew hands out performance-enhancing 'brain food' (fruit) to the students and deals with Luke as he walks out of the hall mid-paper.\n\nMeanwhile, first-year student Ciaran has an unusual request for headteacher Vic Goddard: he wants time off from lessons to write a novel.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 47856,
                    "still_path": "/hWaRZXRbDvLjaNXL7SH8vXvvuc6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-20",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1165798,
                    "name": "Essex Episode 5",
                    "overview": "Carrie and Ashleigh are at the heart of the biggest and loudest clique in school: they love clothes, boys and parties.\n\nBut teenage girls also love a drama and as the best friends fall out, the argument looks set to disrupt more than their friendship, with the effects spilling into the classroom.\n\nIn a modern school, arguments are harder to contain as the issues spread from the classroom to Facebook and BlackBerry Messenger . The school grapevine is soon buzzing.\n\nMeanwhile, Ashleigh's ex-boyfriend Brad is prepared to fight for her love and the teachers discover how tough it can be to keep students focused on academic work and their futures when there are so many distractions.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 47856,
                    "still_path": "/5DK5jA0vdcgGug977YMPsLr5s5J.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-10-27",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1165800,
                    "name": "Essex Episode 6",
                    "overview": "Has deputy head Mr Drew finally met his match in clever but complicated student Mollie? As Mollie finds herself on report to him so begins a series of demanding, but often delightful, daily encounters between teacher and pupil.\n\nAnother regular with Mr Drew is Mollie's equally bright sister Charlotte, who viewers saw bantering with the deputy head earlier in the series. Can the school's teachers coax the two talented girls to finally apply their energy to their academic work?\n\nFor all the pouting and tantrums it soon becomes clear that Mollie is actually very fond of 'Drewy' and that student and teacher have more in common than they might have once thought. But will she listen enough to achieve the grade As she is capable of?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 47856,
                    "still_path": "/3gYGa98UyA7DLcua6vRSECzeL2w.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2011-11-03",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 1165801,
                    "name": "Essex Episode 7",
                    "overview": "As leavers' day, exams and the all-important prom approach, the school tries to prepare two very different students for the future.\n\nFifteen-year-old Ryan, a recent arrival at the school, has Asperger's. Unsure of what the future will hold, the teachers attempt to equip him for life beyond the security of the school gates.  While Ryan wishes he could stay at school forever, troubled top-set student Vinni can't wait to leave. He voluntarily went into temporary care earlier in the term and now the staff work tirelessly to keep him on the straight and narrow.  Will Vinni leave the care home to move back to his family, can the teachers help him to leave with the grades and opportunities his abilities deserve, and will his behaviour improve enough for him to attend the prom?\n\nPerhaps more nervous than them all, however, is headteacher Vic Goddard. He finds it hard to sleep in the run-up to results day as he waits to see whether the school will achieve its targets.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 47856,
                    "still_path": "/fL9nHu53dqZf6aUtFUo5vZuC12R.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Educating Essex",
            "overview": "Educating Essex is a British documentary television programme produced by Twofour for Channel 4 that ran for seven episodes from September to November 2011. It uses a fly on the wall format to show the everyday lives of the staff and students of Passmores Academy, a secondary school in Harlow, Essex, interspersed with interviews of those involved and featuring narration from the director and interviewer, David Clews.\n\nThe series received mixed media coverage: it was largely praised for its insight into the lives and behaviour of teenagers and the education system, but was also criticised for its depiction of students and teachers using profanity, as well as bullying and teenage pregnancy. The show received numerous awards, including director David Clews's British Academy Television Craft Award for his work on the programme in 2012; in the same year, the show was nominated for a Grierson Award for \"Best Documentary Series\".\n\nWhat is life really like for today's students and teachers? This series has unprecedented access to an English secondary school to follow a group of GCSE students, and the staff who teach them, as they face the most important year in their education. Passmores School in Harlow, Essex, is a successful school in a challenging area. Under headteacher Vic Goddard, it's been awarded Academy status and is rated 'outstanding' by Ofsted. The school has been rigged with 65 fixed cameras — from the corridors to the canteen, and from the headteacher's office to the detention hall — to reveal every detail of daily life.",
            "id": 74575,
            "poster_path": "/t1TCZtk9gXwrtspNu4EpZwYZCZC.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "56c0d61b925141098000040c",
            "air_date": "2013-09-05",
            "episodes": [
                {
                    "air_date": "2013-09-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1165835,
                    "name": "Yorkshire Episode 1",
                    "overview": "This episode follows new Head Teacher Mr Mitchell on his mission to improve the school's fortunes. He's 18 months into his first ever headship and wants to revolutionise the school's ethos, results and reputation. But every day his vision is challenged by the trickiest of adversaries: teenagers.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 47856,
                    "still_path": "/6pXiDK8pWu1F4HFg9jIhtpPHgML.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-09-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1165837,
                    "name": "Yorkshire Episode 2",
                    "overview": "This programme follows the fallout from a chance clash between the queen bee of the 'cool group' and a member of the quieter crowd. In their quest to prepare every student for life beyond the school gates, Head Teacher Mr Mitchell and his team are left with difficult decisions about who needs to be dealt with and how. The students anxiously wait to learn their fates - for one, this means seeing if she will suffer the ultimate punishment of not being allowed to go to the end of school prom.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 47856,
                    "still_path": "/cttHvfW5gRjsI5FFKegEZ71TGUv.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-09-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1165839,
                    "name": "Yorkshire Episode 3",
                    "overview": "This episode focuses on two strikingly similar boys: one nearing his final year and another who's starting out at secondary school. Both are exploding with energy and charm but, to their teachers' frustration, neither of them is particularly interested in learning.\n\nAs Year 10 student Tom approaches his GCSEs, his failure to settle down is starting to cause concern. And although Year 7 Robbie-Joe's constant chatter seems harmless (and is often hilarious) his teachers are worried it's a sign of more serious things to come.\n\nThe programme follows the school in their attempts to channel Tom and Robbie-Joe's boundless energies in the right direction, revealing how a chance, life-changing event radically alters the course of Tom's year and watching as the school do all they can to intervene early with Robbie-Joe.\n\nUltimately, this is a film about two inspirational teachers guiding two lively lads through some of the toughest times they will face at school.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 47856,
                    "still_path": "/kb0Wmp9UEIkAwXbnNHMk3Rs5D0k.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-09-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1165842,
                    "name": "Yorkshire Episode 4",
                    "overview": "This episode presents the unlikely friendship of Hadiqa and Safiyyah. As headteacher Mr Mitchell says, these are the last two children that you'd expect to be best mates.\n\nIrrepressibly chatty Safiyyah punctuates every sentence with 'innit'. She dreams of becoming an air hostess, while gifted student Hadiqa has her sights set on becoming prime minister.\n\nAs pastoral year leader Mrs Crowther knows only too well, close friendships mean everything when you're a teenager.\n\nBut as exams approach, a crisis in Hadiqa and Safiyyah's friendship threatens to derail the girls academically and cause major upset.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 47856,
                    "still_path": "/jmzmGeyweF3Plc4HomadcPBw8b9.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-10-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1165843,
                    "name": "Yorkshire Episode 5",
                    "overview": "Everything changes in Year 9. It's full of hormonal 13-year-olds and is a critical academic turning point as the students choose their options for GCSE.\n\nIt's a year when Thornhill's students, hopefully, do some dramatic growing up but it's also the year with the worst behaviour record in the school.\n\nTasked with guiding his students through a perfect storm of adolescent pressures is Head of Year Mr Moses: an unlikely pacifier of teenage angst.\n\nHis job, as a pastoral leader, is to keep every Year 9 student on the straight and narrow. This year, one student proves particularly testing and strikes a chord with Mr Moses.\n\nMeanwhile, not all is complete in the Head of Year's own life: Mr Moses is looking for love.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 47856,
                    "still_path": "/eYCYVWlYNtVzp7MEcdRMNXRmqCf.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-10-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1165844,
                    "name": "Yorkshire Episode 6",
                    "overview": "Exams are approaching at Thornhill and it's not just the students that are feeling the pressure. From highly experienced deputy head Mr. Steer to newly qualified teachers, everyone is feeling the demands of the school's ever increasing targets.\n\nMr. Steer is in charge of the school's attainment and, as a rapidly improving academy, must ensure that results are the very best they can be.  He is also a star maths teacher and this year has a particularly tough challenge as he takes on a group of girls more interested in hair, make-up and parties than algebra and trigonometry.  Despite their current U grades, he's determined to get them that crucial C in maths that will ensure them places in college.\n\nMeanwhile, new teacher Miss Stephens is tasked with getting Sheridan through her geography GCSE, but engaging Sheridan in an academic debate around the European Union is not easy.\n\nAs the clock ticks down to the all-important exams,  Mr. Steer pushes himself to the limit...",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 47856,
                    "still_path": "/rG5PytLSMaspffPKbRYkNeuJZMQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-10-17",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1165845,
                    "name": "Yorkshire Episode 7",
                    "overview": "Jack loves history but is disruptive, and the school staff are worried that he may become Mr Mitchell's first ever permanent exclusion. Can Jack and his teachers turn around his behaviour?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 47856,
                    "still_path": "/gQKWqlDORDm2upM5t0EKoBwPJH4.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-10-24",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1165846,
                    "name": "Yorkshire Episode 8",
                    "overview": "It's the final months of school and the Year 11 students are preparing for life beyond Thornhill.\n\nEnglish teacher Mr Burton is one of a kind. He's an Assistant Head at just 30 years old, and music, fancy-dress and jumping on tables are all part of his teacher's toolkit. This year, he has his most challenging C/D borderline class so far, and two of his students pose very different challenges.\n\nMusharaf has a severe stammer, and anxiety about leaving Thornhill seems to have made it worse. As Musharaf prepares for his GCSE English oral exam, Mr Burton is prepared to try any tactic, no matter how unusual, to help improve his fluency.\n\nMeanwhile, Hannah would be capable of A grades, were it not for her aversion to staying in class. The school staff are concerned about her not achieving her potential, and wish she'd devote more energy to staying in lessons than finding excuses to escape them.\n\nCan Mr Burton's unique teaching style help his students make the grade?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 2,
                    "show_id": 47856,
                    "still_path": "/pyH70P1gypCvZLHSwr0f7Jpf6pW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Educating Yorkshire",
            "overview": "Educating Yorkshire is a British documentary television programme broadcast on Channel 4. The eight-episode first series was first broadcast on 5 September 2013. Its format is based on the BAFTA Award winning 2011 series Educating Essex. It follows the everyday lives of the staff and students of Thornhill Community Academy, a secondary school in Dewsbury, Yorkshire.\n\nFilmed at Thornhill Community Academy near Dewsbury, Educating Yorkshire captures every detail of life in the school, from playground hijinks and inspirational lessons to life-changing events. It follows the work of Headteacher Jonny Mitchell to better the chances for all his students and build on successive years of improving exam results. Located at the heart of a diverse northern community and with a student population that is almost exactly half white-British and half British-Asian, the school offers a fascinating insight into modern school life in the UK. Told with warmth and humour, Educating Yorkshire explores the universally-recognisable themes of teenage life and those all-important pupil-teacher relationships that lie at the heart of everyone's formative years.",
            "id": 74576,
            "poster_path": "/o6bQFeqR9PUQgfnuiMLvwpEcQID.jpg",
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "56c0d62e9251410a6200045b",
            "air_date": "2014-09-04",
            "episodes": [
                {
                    "air_date": "2014-09-04",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1165850,
                    "name": "East End Episode 1",
                    "overview": "Frederick Bremer school's newest teacher, Mr Bispham, soon learns that teaching isn't always plain sailing, especially when it comes to educating Year 9 girls",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 3,
                    "show_id": 47856,
                    "still_path": "/gsJOtCkCc3BocvSOzGjNp34ic4O.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-09-11",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1165851,
                    "name": "East End Episode 2",
                    "overview": "This time at Frederick Bremer School in East London it's all about the boys, and Head Teacher Jenny Smith is determined to set two strong-minded pupils off on the right path. Halil thinks he is the coolest kid at Frederick Bremer School, but despite his infectious laugh and \"cheeky chappy\" persona, he can't stay out of trouble. Meanwhile, Lemar doesn't like the stereotype of London \"hoodies\" hanging around the streets in big groups. His main ambition is to make it as a professional footballer, but staff are working hard to ensure he has other options available",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 3,
                    "show_id": 47856,
                    "still_path": "/nV6wnFiHSnGZccugsBCbwI63UR5.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-09-18",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1165875,
                    "name": "East End Episode 3",
                    "overview": "Election fever hits Frederick Bremer School as the pupils get on the campaign trail and vote for Head Boy and Girl. Will they vote for the confident candidates or the self-confessed geeks?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 3,
                    "show_id": 47856,
                    "still_path": "/99G9rFyIFuFDJpFIWbSPto4Mo3e.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-09-25",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1165876,
                    "name": "East End Episode 4",
                    "overview": "Being a head teacher often keeps Ms. Smith awake at night. She has 900 pupils in her care and feels responsible for every one of them.\n\nSome of the students' family dramas can impact on school life, and in this episode, alongside Ms. Smith, English teacher Mr. Bispham and deputy head Miss Hillman have to find a multitude of ways of engaging with the kids to help them leave their sometimes unsettling troubles at the gates.\n\nThe programme also meets Hazel, an East-Ender born and bred, and a non-teaching pastoral support worker at Frederick Bremer. She's the first port of call when kids are sent out of the classroom and can be found patrolling the corridor, walkie-talkie in hand, often notching up as many as five miles a day.  Excluded from her own school when she was younger, her own experiences of a personal family tragedy means= she feels particularly close to those hard-to-reach students she works with.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 3,
                    "show_id": 47856,
                    "still_path": "/aNHduuKfnVZhyRdoKqk6EYoMXia.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1165877,
                    "name": "East End Episode 5",
                    "overview": "This episode meets three boys at different stages of their school life.  Twelve-year-old Louie has just started secondary school at Frederick Bremer; he struggles to make friends and starts to bunk off.  With his attendance record steadily getting worse, it's time for home support worker Emma Austin to step in.\n\nDevonté, who's also 12, is another of Mrs. Austin's charges. He loves rap music and is constantly found playing songs through his phone in lesson time and rapping at inappropriate moments.  Due to his responsibilities at home, helping to care for his mother, Devonté relaxes at school instead, and often gets into trouble.\n\nCharlie, who's 16, is one of the top students in his year group, but the pressure of exams is resulting in panic attacks. He finds that playing music helps him relax.  His band are going to play at the school concert, but will he get over his nerves and manage to perform on stage in front of 200 other pupils?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 3,
                    "show_id": 47856,
                    "still_path": "/9PdIkGYf9wjIjifCQZ6izFJgVke.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-09",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1165878,
                    "name": "East End Episode 6",
                    "overview": "Those all-important GCSE exams are creeping ever closer, but while the pressure is on for the students of Year 11 to knuckle down to some much-needed revision, for many of the girls - Paige in particular - their attention has a habit of turning away from study, and instead toward friendships, proms and boys. She and her closest friends Georgia and Yasmine are three of the most popular girls in school, and while the younger girls look up to them, the boys have crushes on them. The girls are expected to do well in their exams, but they are very aware that the pressure on them is mounting, and cracks soon start to appear in the friendship and threaten to undo all the hard work they have put in so far",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 3,
                    "show_id": 47856,
                    "still_path": "/nM7QS6QKSCreUsHbit0ntSYrcpM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-16",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1165879,
                    "name": "East End Episode 7",
                    "overview": "With GCSE exams fast approaching, the teachers at Frederick Bremer School face the difficult task of motivating their students to revise. However, the staff face difficulties with two particular Year 11 boys, Paris and Oscar, who are both at risk of failing to reach their full potential. As concerns mount over the pair's performance, the teachers set out to discover what might be distracting the duo from their studies",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 3,
                    "show_id": 47856,
                    "still_path": "/2jGUeqUhVumwkvXGp6T4xHAZs5k.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-10-23",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1165880,
                    "name": "East End Episode 8",
                    "overview": "The school year is drawing to a close. The staff at Frederick Bremer are preparing the students for life beyond the school gates, ensuring that they have the confidence to move on to pastures new.\n\nThis heart-warming episode explores the autism provision, meeting a team who help to create a diverse school community and work hard to ensure that their pupils are ready for life beyond the classroom.\n\nYear 10 student Christopher is one of a handful of students at Frederick Bremer on the autism spectrum. He is constantly smiling and passing on his motto 'keep positive'.\n\nHome support worker Mrs Austin defines the impact he has on the school perfectly: 'everyone needs a spoonful of Christopher.'",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 3,
                    "show_id": 47856,
                    "still_path": "/u0pbA5gVP6419MrkuxXvgYNONfp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Educating the East End",
            "overview": "Seeing what our secondary-school teachers have to contend with (and can achieve) in the classroom is an eye-opener, as we saw in the brilliant observational series Educating Yorkshire. Even though they try to be inspirational and encouraging, it can be a struggle. “It’s really hard to balance the idealism with the difficulties of dealing with a bunch of adolescents,” says Ms Smith, head at Frederick Bremer School in east London. Trainee teacher Mr Bispham’s attempts to teach a year-nine class Shakespeare shows how frustrating and challenging it is (rowdiness, swearing, chatting, boredom – he gets it all) but how much he and his colleagues care oozes through the screen.",
            "id": 74577,
            "poster_path": "/3OlRJTs4fJ3zT3bZ1eRL1XWJi6o.jpg",
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "56c0d63ac3a368180600c28b",
            "air_date": "2015-08-25",
            "episodes": [
                {
                    "air_date": "2015-08-25",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1165881,
                    "name": "Cardiff Episode 1",
                    "overview": "This episode meets Head Teacher Joy Ballard, firm but fair Mr Hennessy, and two Year 11 girls facing very different issues.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 47856,
                    "still_path": "/7KkdkdN9AyVgO0MIcE6R5n7YAwA.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-01",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1165882,
                    "name": "Cardiff Episode 2",
                    "overview": "Moving from primary to secondary school isn't easy. This episode meets two Year 7 boys. Nervous Aaron struggles to find his feet, while popular Assad's antics disrupt the school.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 47856,
                    "still_path": "/67HpfhSu0suaHYmoVvgAel4S83H.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1165883,
                    "name": "Cardiff Episode 3",
                    "overview": "In this episode, the focus is on two feisty year 10 girls who are proud to wear their emotions on their sleeves, and express exactly how they are feeling at all times.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 47856,
                    "still_path": "/arJuQhdnirSy7ATkjukYXAdwk7h.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-15",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1165884,
                    "name": "Cardiff Episode 4",
                    "overview": "This episode focuses on Year 8. Corey and Gethin have been inseparable friends both on and off the rugby pitch, but now it's time for them to compete for the title of Rugby Captain.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 47856,
                    "still_path": "/xHMUvsb2fIXhVsSusbMHU5h5cyU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-22",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1165885,
                    "name": "Cardiff Episode 5",
                    "overview": "Benjy and Kalid are struggling in Maths. Extrovert Benjy has a bit of a love/hate relationship with Head of Maths Mr Hennessy. Kalid's missed quite a lot of school and is falling behind.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 47856,
                    "still_path": "/5DksxltmeWmJf0Dj2ixIlJLIqCS.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-29",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1165886,
                    "name": "Cardiff Episode 6",
                    "overview": "This episode focuses on young love and two unlikely couples. Georgia has been studying hard since she started dating high achiever Tyler. But the pressure of her Maths GCSE is getting to her.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 47856,
                    "still_path": "/wxdd09x7MvHVjLPFXXQS2CSesHB.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-06",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1165887,
                    "name": "Cardiff Episode 7",
                    "overview": "Dan and Shaun have been friends for years, but now Shaun has a crush on Kelsey and tension between the boys has risen so much that they've been moved to separate classes.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 47856,
                    "still_path": "/rSM1IFS78faICIt1NfeVA8m8Ov.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-10-13",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1165889,
                    "name": "Cardiff Episode 8",
                    "overview": "The documentary exploring day-to-day life at Willows High School in Cardiff concludes as the performing arts department prepares to stage a farewell concert. Auditions for the big show are well under way, and energetic pupil Coral is quick to sign up to sing. However, she is easily distracted in class, and her behaviour is worsening, and these issues hint at a bigger problem that may mean she is not yet ready for a solo performance in front of a 200-strong audience. Meanwhile, the women of the well-being and attendance office worry that Sean, a year 8 pupil with cerebral palsy, is relying a little too much on the safety and comfort of the Lunch Club, which offers pupils an alternative break spot to the rowdy canteen. Seeking to bring Sean out of his shell, the ladies decide the school cabaret might be the perfect opportunity to improve the youngster's confidence.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 47856,
                    "still_path": "/538KJiNQNMWBQsA3aIsLvTMWPT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Educating Cardiff",
            "overview": "Educating is back, and this time we are in Wales at Willows High School in Cardiff. Educating Cardiff captures every detail of life at Willows and to kick the series off we are introduced to Head Teacher Joy Ballard, her stellar team of staff and some dynamic kids. From Year 7 to Year 11, newly qualified teachers to old-hands, this series shows what it’s like to learn and teach in the Welsh capital.\n\nEducating Cardiff captures every detail of what life is like for the students and staff at Willows High School.",
            "id": 74578,
            "poster_path": "/8JEuzDRDcj2IvXw5bNfU3GtXvPx.jpg",
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "5ddec0dd4f58010016fb4f0b",
            "air_date": "2017-08-31",
            "episodes": [
                {
                    "air_date": "2017-08-31",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1997571,
                    "name": "Greater Manchester Episode 1",
                    "overview": "Friendship flourishes in Year 7 between Rani, who recently arrived from Syria, and old-before-his-time Jack. And the school responds to the shock of the terrorist attack at the Ariana Grande concert.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 5,
                    "show_id": 47856,
                    "still_path": "/gfX1P0Nxe63bC1yeFMuzNxYu3ti.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-07",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1997596,
                    "name": "Greater Manchester Episode 2",
                    "overview": "In this episode it's teen angst as Educating joins Harrop Fold's student development team. Mia's 15, seven months pregnant and just a few months away from her GCSE exams.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 5,
                    "show_id": 47856,
                    "still_path": "/3MNsNIDNjnowHyrPgdUcEZCRssv.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-14",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1997597,
                    "name": "Greater Manchester Episode 3",
                    "overview": "Mr Chambers wonders if he should turn equations into a form of dance to get drama enthusiast Mitchell to focus. Football-loving Callum's girlfriend convinces him to audition for the school play.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 5,
                    "show_id": 47856,
                    "still_path": "/n6BBs0DFPjp6Jpw0qp76cy1tH33.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-21",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1997598,
                    "name": "Greater Manchester Episode 4",
                    "overview": "This episode meets the school's behaviour team. Mr Chambers is close to losing his patience with cheeky Kayden. Mr Povey tries a left-field tactic with Vincent: putting him on the Student Council.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 5,
                    "show_id": 47856,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-28",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1997599,
                    "name": "Greater Manchester Episode 5",
                    "overview": "There's election fever as the search for Harrop Fold's first ever Head Girl and Head Boy begins. And an unexpected candidate throws his hat into the ring at the last minute.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 5,
                    "show_id": 47856,
                    "still_path": "/rNNLLTu1BABTxODLDfh4uM4H7vX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-05",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1997600,
                    "name": "Greater Manchester Episode 6",
                    "overview": "The teachers grapple with the effects of social media at the school, from Snapchat revolutions to FaceTime disputes and name-calling on social media",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 5,
                    "show_id": 47856,
                    "still_path": "/r3uETtVqbpj9d9NpKL5cbiSslwk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-12",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1997601,
                    "name": "Greater Manchester Episode 7",
                    "overview": "This episode meets the Year 7s and new teacher Mr Humphreys, who faces a challenge with mischievous best friends Tiger and Billy. And can 11-year-old Jacob win his ex-girlfriend Lily back?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 5,
                    "show_id": 47856,
                    "still_path": "/caFzKzLBXXVhD2RpUMHooUWffp7.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-19",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1997602,
                    "name": "Greater Manchester Episode 8",
                    "overview": "There are tears and tantrums as the Year 11s have their mock exams. When the results aren't good, the school throw everything they have at improving results for the real GCSEs.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 5,
                    "show_id": 47856,
                    "still_path": "/6kUBwdpbCWAKlyzmqV9diONN1Tm.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Educating Greater Manchester 1",
            "overview": "A warm and honest exploration of what life's like for students and their teachers at Harrop Fold, a secondary school at the heart of a changing community in Salford",
            "id": 136685,
            "poster_path": "/f6GWxwXqvjBmqsWoGXxZUgkpkTu.jpg",
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "5fa6731afcb8cc003f81e0a1",
            "air_date": "2020-11-03",
            "episodes": [
                {
                    "air_date": "2020-11-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2498435,
                    "name": "Greater Manchester Episode 1",
                    "overview": "The series about modern schooling and teen life returns for a new run to Harrop Fold School, where Jacob discusses his struggles with dyslexia and Katelyn keeps bunking off.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 6,
                    "show_id": 47856,
                    "still_path": "/yLQrpOVBD8nokLypbfnREdsGQog.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2498436,
                    "name": "Greater Manchester Episode 2",
                    "overview": "Holly bids to be voted Head Girl. Year 10's Jack is on a final warning for making prank phone calls. And a gaggle of therapy animals come to school to help with pupil wellbeing.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 6,
                    "show_id": 47856,
                    "still_path": "/qL0p2wg0EuibGwtJns8TpSIhLRD.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-10",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2498437,
                    "name": "Greater Manchester Episode 3",
                    "overview": "The new head girl is revealed. Year 9 couple Faye and Kieran get interactive 'babies' to look after. Rani plays a Valentine's prank on Jack. Chelci and Cheyenne have a falling out.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 6,
                    "show_id": 47856,
                    "still_path": "/oe4RKvkKs2SFGcHwcg1RbzeXhte.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-17",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 2498439,
                    "name": "Greater Manchester Episode 4",
                    "overview": "The pressure is on at Harrop Fold as GCSE exams get underway, and the school finds itself hitting the headlines when four members of staff are suspended over allegations of removing disadvantaged and struggling pupils from the school roll to improve exam results. The new heads girl launches an online campaign against uniform policy that lands her in trouble. Mr Walker is concerned that year 10 pupil Morgan may not be able to catch up with Spanish in time for her exams, and Mr Povey intervenes to find out the underlying cause of her disruptive behaviour",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 6,
                    "show_id": 47856,
                    "still_path": "/2TgvSuu4AwF5qGbLeTxVFsn2rHX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Educating Greater Manchester 2",
            "overview": "The series offering moving, funny and dramatic insights into modern schooling and teen life returns to Harrop Fold School, Greater Manchester",
            "id": 167860,
            "poster_path": "/v1udSMBWXPNh24VILqjPmRqYKUw.jpg",
            "season_number": 6,
            "vote_average": 0
        }
    }
}