{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[30,24],"first_air_date":"2002-03-05","genres":[{"id":10764,"name":"Reality"},{"id":35,"name":"Comedy"}],"homepage":"http://www.mtv.com/ontv/dyn/osbournes/series.jhtml","id":499,"in_production":false,"languages":["en"],"last_air_date":"2005-03-21","last_episode_to_air":{"id":24799,"name":"A Farewell to Ozz","overview":"Dr. Phil McGraw pays a visit to the house, where he holds a frank discussion with the Osbournes about drug abuse and other issues that have affected the family's relationships with one another.  Examples are given through clips from previous episodes.","vote_average":0,"vote_count":0,"air_date":"2005-03-21","episode_number":10,"episode_type":"finale","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/xGUocCA189rYbiec5HcHXLSOrCb.jpg"},"name":"The Osbournes","next_episode_to_air":null,"networks":[{"id":33,"logo_path":"/w4qtv7xBkSVsbOQdSzjUjlyOuSr.png","name":"MTV","origin_country":"US"}],"number_of_episodes":52,"number_of_seasons":4,"origin_country":["US"],"original_language":"en","original_name":"The Osbournes","overview":"The Osbournes is an American reality television program featuring the domestic life of heavy metal singer Ozzy Osbourne and his family. The series premiered on MTV on March 5, 2002, and in its first season, was cited as the most-viewed series ever on MTV. The final episode of the series aired March 21, 2005.","popularity":23.566,"poster_path":"/fxQInFCs47BaNPPRWQqqgZ2qVBk.jpg","production_companies":[{"id":59934,"logo_path":null,"name":"iCandy TV","origin_country":""},{"id":59935,"logo_path":null,"name":"Big Head Productions","origin_country":""},{"id":59936,"logo_path":null,"name":"JOKS Productions","origin_country":""},{"id":6043,"logo_path":null,"name":"MTV Networks","origin_country":""}],"production_countries":[],"seasons":[{"air_date":null,"episode_count":1,"id":1426,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2002-03-05","episode_count":10,"id":1428,"name":"Season 1","overview":"","poster_path":"/9DSpyTNmwUa0MCvS0U7jXkcdI5t.jpg","season_number":1,"vote_average":0},{"air_date":"2002-11-05","episode_count":22,"id":1427,"name":"Season 2","overview":"","poster_path":"/9k9uQXRMaqlso9YDNRBNouE1X45.jpg","season_number":2,"vote_average":0},{"air_date":"2004-01-27","episode_count":10,"id":1429,"name":"Season 3","overview":"","poster_path":"/2DMfBMxUUcSkrSIdvRRC7qY8NLm.jpg","season_number":3,"vote_average":0},{"air_date":"2005-01-17","episode_count":10,"id":1430,"name":"Season 4","overview":"","poster_path":"/8LV1Hu2qAGMemiCqw2m7YFWVN3G.jpg","season_number":4,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Reality","vote_average":5.9,"vote_count":35,"season_data":{"1":{"_id":"52537bac19c295794018fccb","air_date":"2002-03-05","episodes":[{"air_date":"2002-03-05","episode_number":1,"episode_type":"standard","id":24771,"name":"There Goes the Neighborhood","overview":"Ozzy Osbourne moves into a multi-million dollar Beverly Hills mansion with his wife/manager, Sharon; and their teenage children, Jack and Kelly.  Ozzy grows increasingly frustrated by his inability to operate the family's new satellite television system.  Kelly takes Jack to task for his habit of using his name to get into clubs.  The two constantly argue, sometimes coming to blows.  Ozzy reveals Kelly's tendency to have tempter tantrums, which he calls \"\"wobblers.\"\"  Sharon explains that Jack is a nice guy, but has trouble fitting in with his schoolmates.  Sharon convinces a reluctant Ozzy to perform on The Tonight Show With Jay Leno.  He later watches the broadcast (with Mike, the security guard who watches over the house), and feels that he gave a good performance.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/6qgOuomErCNa5Zl3wJx46U7wA0y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-12","episode_number":2,"episode_type":"standard","id":24773,"name":"Bark at the Moon","overview":"The Osbournes' pets begin to drive Ozzy crazy, as they monopolize the house and go to the bathroom all over the floors and carpets.  He believes that the situation could be brought under control if someone would simply remember to let the dogs outside to do their business, but they seem to be completely untrained.  The worst offender is Jack's dog Lola, who tears up a couch cushion and leaves the most unpleasant deposits of any of the animals.  Sharon finally brings in a pet therapist to deal with the situation, much to Ozzy's dismay.  The woman, Tamar, offers some advice and tries to work with the animals, but it really doesn't make any difference.  Lola goes to the bathroom on the floor seconds after Tamar has praised her.  Ozzy and Sharon consider getting rid of Lola, but cannot bring themselves to do this because she is so lovable.  Although Sharon promises Ozzy that they will not get any more pets, Kelly brings a second cat home from the pet store.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/x7l0kqwxYQvmvnQ2C6JPT61s2UV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-19","episode_number":3,"episode_type":"standard","id":24774,"name":"For the Record","overview":"Ozzy makes the rounds to promote the release of his new album, Down to Earth.  He reluctantly takes a limousine (which he hates) to Tower Records for an in-store appearance.  Kelly attends the event and is surprised when several fans recognize her.  Ozzy and Sharon are later guests on Loveline.  Jack listens to the show and is horrified when his parents discuss their sex life.  Jack goes away on a camping trip with his school while Ozzy, Sharon and Kelly are in New York.  Ozzy appears on Late Night With Conan O'Brien and MTV's TRL, where Kelly joins him for a promo.  Jack hates the camp, and gets in trouble for throwing rocks at other campers and arguing with the counselors.  Sharon tries to help Kelly's best friend, Robert, shop for a gift for her 17th birthday.  The family throws a big party in Kelly's honor.  She goes out with her friends after the party and winds up getting a tattoo, which she unsuccessfully tries to hide from Sharon.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/dyHxprTtUgnePduzDMbLDuQT1OJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52537bae19c295794018ff14","order":500,"adult":false,"gender":2,"id":76245,"known_for_department":"Acting","name":"Adam Carolla","original_name":"Adam Carolla","popularity":4.924,"profile_path":"/47k9w6HRLnGeU0gVtMeTPJs3ief.jpg"}]},{"air_date":"2002-03-26","episode_number":4,"episode_type":"standard","id":24772,"name":"Won't You Be My Neighbor?","overview":"Aimee (Ozzy and Sharon's eldest daughter) schedules Kelly for a gynecologist's appointment without her consent.  A panicked Ozzy fears that this means Kelly is sexually active, and refuses to listen to her claims to the contrary.  The Osbournes' neighbors continually irritate them by blasting loud music outdoors in the middle of the night.  Sharon confronts them, and tries to invite them over for tea to talk about the situation.  They do not show up.  On another night, the neighbors gather outside singing folk songs.  Jack tries to counteract them by playing Norwegian death metal, and goes over to argue with them.  Sharon winds up throwing a ham and bagels over the fence, prompting the neighbors to call the police.  The cops arrive and tell Sharon to call them instead of getting into a confrontation.  Ozzy finally becomes fed up with the late night parties.  Despite Sharon's pleas, he goes next door and throws a log through the window.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/eRzPMx0I53ngDK8rOJJnJjiunUy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-02","episode_number":5,"episode_type":"standard","id":24776,"name":"Tour of Duty","overview":"Ozzy works with a personal trainer and attends rehearsals in preparation for an upcoming tour.  He also records a series of silly videos that feature him in drag (including a spoof of the \"\"Lady Marmalade\"\" video) to be displayed on the giant screen during the shows.  Sharon and Kelly upset Ozzy with their tendency to go on shopping sprees.  They try to pull the wool over Ozzy's eyes, lying about what they have purchased and just how much they have spent.  Kelly takes Ozzy's credit card without permission and manages to lose it.  Sharon covers for her until she is able to find it in her truck.  Sharon, Kelly and some of the dogs accompany Ozzy on the tour, while Jack stays home and tries to get his own record label started.  Ozzy is appalled to discover some of the garish special effects to be used in conjunction with the shows, especially a bubble machine.  He repeatedly complains about this to Sharon.  Sharon tries to keep the tour itinerary hidden from Ozzy.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/2oQgpEujI4ZJGbd4aGbBLR6vuyJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-09","episode_number":6,"episode_type":"standard","id":24777,"name":"Trouble in Paradise","overview":"Kelly suffers a broken foot when she trips over a curb.  At the same time, Ozzy suffers a leg injury during his tour.  The kids stay at home, where Jack constantly clashes with the nanny, Melinda.  He worries her by staying out at clubs all night and resisting her when she tries to get him to go to school.  Ozzy calls Jack and tries to convince him to apologize to Melinda.  Ozzy aggravates his injury while jumping around onstage, and X-rays reveal a hairline fracture.  He must take a few weeks off from the tour.  He and Sharon return home and continue to have problems with the kids.  Kelly upsets Sharon by showing her a fake ID.  Jack and Kelly invite friends over to party all hours of the night, keeping their parents from sleeping.  Ozzy and Sharon decide to lay down the law in a family meeting.  The kids explain that is difficult to be expected to stick to a routine because they have spent most of their lives on tour.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/izybZ0n1NazAP5iFiXAFgjI21Wu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-16","episode_number":7,"episode_type":"standard","id":24775,"name":"Get Stuffed","overview":"Ozzy mixes alcohol with the pain medication for his foot injury and winds up stoned.  He tries to take Lola for a walk, but Sharon sends Jack to retrieve him.  The Osbournes suffer through a miserable Thanksgiving.  Ozzy works on the video for his song \"\"Dreamer,\"\" and adamantly refuses to wear a bat coat.  Kelly grows frustrated when the media continually mentions Jack's work with Epic Records, as she feels they are implying that she isn't doing anything with her life.  She angrily insists that she actually discovered the band that Jack is helping, and that he hasn't given her any credit.  She turns to Ozzy for sympathy, but he isn't quite sure what he wants her to say.  Ozzy grows fed up with the family and insists on returning to the tour alone.  Sharon, Jack and Kelly decide to surprise him in Chicago for his birthday.  They hide from him until his birthday because they fear he would become angry if he saw them before his birthday dinner.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/gc1zkbA5rTBkcp11yzurK3utrwf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-23","episode_number":8,"episode_type":"standard","id":24778,"name":"No Vagrancy","overview":"Jack invites his friend Jason Dill, a professional skateboarder, to stay at the house after he is kicked out of the home of yet another of his friends.  Ozzy and Sharon are more than a little put off by the fact that Jack just lets Dill come over without telling them, let alone asking for permission.  Dill is obnoxious and slovenly, and creeps out Ozzy and others with his habit of always scratching his head.  Dill also smokes and drinks a lot, and Sharon is annoyed to find a bottle of Jack Daniels with his belongings.  She decides that she is going to go to the bathroom in the bottle, but Kelly pleads with her not to do this.  Dill accidentally starts a fire in the kitchen, doing damage to a pan and the stovetop.  Jack is irritated by the fact that Dill is the only one who doesn't seem to be helping clean up the mess, although Dill points out that he would only make things worse.  Ozzy and Sharon finally persuade Jack to ask Dill to leave the house.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/qSoDDLXnWtmheMBGzTInM2x2U5c.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-30","episode_number":9,"episode_type":"standard","id":24779,"name":"A Very Ozzy Christmas","overview":"As Christmas approaches, Sharon goes on a shopping spree in New York while on tour with Ozzy and Jack.  They learn that Michael, their security guard, has been arrested for robbing the house behind theirs.  Michael denies any wrongdoing and insists that it was all a misunderstanding.  He says he is filing a suit for wrongful arrest.  The family, including Ozzy's eldest son Louis, gathers for the holidays.  Christmas dinner features a number of arguments, but also several bright spots.  Ozzy is very excited about the gravy he helped prepare.  Jack receives a knife as a gift, but his parents want to take it away because they fear he will get into trouble with the law.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/kpAGm630bhNGyrQOWVP9EcfJmku.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-07","episode_number":10,"episode_type":"finale","id":24780,"name":"Dinner with Ozzy","overview":"Ozzy sits down to a multi-course meal in the dining room and reflects on his life.  He says that he doesn't know the definition of a \"\"normal\"\" family, as he is so used to his lifestyle that he doesn't know anything else.  He explains that he always encourages honesty because he had to endure so much secrecy growing up.  However, his blue collar background also instilled him with an appreciation for hard work, so he tries to do enough of his own chores as he can.  He discusses Sharon and the kids, and his battle with dyslexia and ADD.  Ozzy is thrilled when he is presented with a star on the Hollywood Walk of Fame and receives praise from the mayor of Hollywood.  The episode concludes with a montage of season highlights.","production_code":"","runtime":null,"season_number":1,"show_id":499,"still_path":"/150nYUlhu0tiGwvvGtUbXmT64WA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":1428,"poster_path":"/9DSpyTNmwUa0MCvS0U7jXkcdI5t.jpg","season_number":1,"vote_average":0},"2":{"_id":"52537bac19c295794018fcba","air_date":"2002-11-05","episodes":[{"air_date":"2002-11-05","episode_number":1,"episode_type":"standard","id":24750,"name":"Catching Up with the Osbournes","overview":"Sharon sends Ozzy, Kelly and Jack off on a tour of stars' homes so that she can have the house to herself and get some rest.  She discusses the enormous (and immediate) impact that the show has had on their lives, and the unexpected fame that has resulted--particularly for Kelly and Lola.  She notes all of the press the family has received, both on television and in print, and all of the merchandise that has been released in conjunction with the show.  Ozzy and Jack play with their talking dolls on the tour bus and drive Kelly crazy.  Sharon also mentions several important events that have occurred since the end of the first season, including a visit from Mike Myers (as part of a commercial the family filmed) and the chance to meet the queen at Buckingham Palace.  Sharon also refers to her war of words with Bill Cosby, who upset her by making negative comments about the family.  She was particularly angered by the fact that he called her children \"\"sad,\"\" and responded to his remarks wit","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-26","episode_number":2,"episode_type":"standard","id":24749,"name":"What Goes Up...","overview":"Jack tries to deal with the annoying tourists who have begun showing up at the Osbournes' house since the show became a hit.  He uses remote control sprinklers to encourage the trespassers to leave the premises.  Ozzy and Sharon travel to Washington, D.C. to attend the White House Correspondents Dinner.  The president mentions Ozzy during his remarks, prompting Ozzy to stand and salute the crowd.  He immediately travels to London the next day, while Sharon returns to Los Angeles to watch Kelly perform \"\"Papa Don't Preach\"\" at the MTV Movie Awards.  Kelly believes that Jack is jealous of her success, but he seems genuinely excited for her as he watches her performance.  Jack also tracks one of his favorite actresses, Natalie Portman, and gets to sit on her lap.  Kelly moves to New York for a few months to work on her album.  As Sharon travels with her, she comments on the family's success and expresses her fear that something terrible will come along to bring them back to earth.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/xYxHaSGjK1jDwnqurlO5vmWCrVG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52537bac19c295794018fd29","order":503,"adult":false,"gender":2,"id":35595,"known_for_department":"Acting","name":"Scott Foley","original_name":"Scott Foley","popularity":13.345,"profile_path":"/91jhs4Biigdhwvco0UdlpobnUaL.jpg"},{"character":"","credit_id":"52537bac19c295794018fd47","order":505,"adult":false,"gender":2,"id":880,"known_for_department":"Acting","name":"Ben Affleck","original_name":"Ben Affleck","popularity":54.345,"profile_path":"/aTcqu8cI4wMohU17xTdqmXKTGrw.jpg"},{"character":"","credit_id":"52537bac19c295794018fd65","order":506,"adult":false,"gender":1,"id":9278,"known_for_department":"Acting","name":"Jennifer Garner","original_name":"Jennifer Garner","popularity":30.128,"profile_path":"/ftymEXqdTnXfaI6dGd9qrJoFOSE.jpg"}]},{"air_date":"2002-12-03","episode_number":3,"episode_type":"standard","id":24751,"name":"Must Come Down","overview":"Sharon recuperates at the family's Malibu beach house while undergoing treatment for colon cancer.  She vows to beat the disease, and tries to maintain as normal a life as possible.  Everyone talks about their reactions to the news of her diagnosis.  Ozzy struggles to remain sober while on tour with Ozzfest.  He had already been going through detox, and the news of Sharon's illness has made a difficult situation much worse.  A family friend/employee tries to help Ozzy by helping him get into yoga and reading him poetry, but Ozzy is decidedly less than impressed.  Some people try to talk to him about how religion helped them overcome their addictions, but he does not want any part of it.  He is terrified by the prospect of losing Sharon, and doesn't want to be away from her.  However, he elects to tough it out and stay on tour because he doesn't want to cause Sharon any further stress.  Ozzy comes home for a few days during a break in the tour.  Sharon tries to have a fire going in the","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/8ikJFo9dpaFAFoyezRrEOxSE2fq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-12-10","episode_number":4,"episode_type":"standard","id":24753,"name":"The Ozz Man and the Sea","overview":"Kelly travels to Europe for a series of interviews and appearances.  She is upset when her bag is lost (apparently seized by security because of concerns over her gun-shaped pin), leaving her without any extra underwear.  She first visits Germany, where she deals with several adoring fans and tries to fake her way through a radio interview conducted in German.  Kelly then goes to England to perform \"\"Papa Don't Preach\"\" on Top of the Pops.  Jack heads to North Carolina to film a guest spot for Dawson's Creek.  Sharon is depressed about the fact that everyone is away at the same time.  Ozzy tries to cheer her up by building a fire outside the beach house so that she can spend some time outside.  The fire department gives him some advice on building a pit for the fire, but the ocean is not very cooperative.  When the fire finally gets going, Ozzy gives Sharon a good laugh when he tries to catch a fish in the ocean--and ends up falling on his butt.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/rJokWCfxDPdW9v7QkpqmM2ZqUMW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-12-17","episode_number":5,"episode_type":"standard","id":24752,"name":"Beauty and the Bert","overview":"Kelly begins dating Bert McCracken, lead singer of the band The Used.  Sharon worries after hearing some stories about Bert (particularly the vulgar nickname he has within his band), while Jack thinks that Bert is weird because he professed his love to Kelly after only a few weeks of dating.  Kelly warns that she will run off to Vegas and marry before the end of the year.  Sharon actually encourages this, saying that she needs some excitement.  Sharon worries about the situation, but Ozzy encourages her to relax and just focus on living one day at a time.  Sharon wants Bert to stay at the house (and sleep in Jack's room) when his band comes to town.  Kelly refuses to bring him over to meet the family because she fears they will threaten or embarrass him.  She finally tries to sneak him into the house, but Sharon catches them.  She asks Bert about his nickname, leaving Kelly mortified.  Meanwhile, Ozzy has more problems with the television set, which winds up stuck on a cooking channel","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/u97CTCYRyIEHySByIzfuUd883GX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-07","episode_number":6,"episode_type":"standard","id":24754,"name":"Smells Like Teen Spirits","overview":"Sharon makes amends with her father after not speaking with him for over twenty years.  Kelly keeps going out and getting drunk every night, despite Sharon's pleas.  Ozzy tries to warn her of the consequences of her actions, as they can't protect her if she gets arrested for underage drinking.  Pop star Mandy Moore comes over to the house to hang out with Jack.  Jack also spends a lot of time partying, and ignores his trainer's repeated efforts to get him to change his lifestyle.  Kelly and Robert annoy Ozzy when they disturb his sleep with their loud, drunken behavior.  Sharon's father tries to give her advice on how to rein in the kids.  Kelly becomes very ill after drinking too much, and claims that she is going to stay in all weekend.  Sharon intentionally tortures her throughout her hangover by talking about disgusting food items.  Ozzy becomes a grandfather when his oldest daughter, Jessica, has a baby girl.  Ozzy later becomes addicted to burritos.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/fAYaewqyyhCwJxiF5fTwNKUs3vQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-14","episode_number":7,"episode_type":"standard","id":24760,"name":"Meow Means No!","overview":"Kelly recruits her friend Sarah to play the drums in her band.  However, Sarah has never had any formal lessons, and can't seem to keep up with the others during rehearsals.  Everyone becomes very frustrated, and reaches the conclusion that Sarah must be replaced by someone with more experience.  Kelly can't bring herself to fire her friend, so Sharon volunteers to handle it.  Sarah gets $10,000 for her services, and a job handling the slate during the filming of Kelly's video for \"\"Shut Up.\"\"  Dill returns to town, and Jack invites him to stay at the house.  Ozzy is not thrilled about this, but doesn't stand in his way.  Dill and Jack engage in a political debate that seems to bore the rest of their friends.  They later engage in a bizarre wrestling match in the driveway that finds them stripping half-naked.  One of the dogs, Arthur, becomes too frisky as he deals with leftover \"\"feelings\"\" after being fixed.  The family believes that Arthur has raped Gus the cat, although a veterinarian","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/uXXjPnYl1dB0uRaSY7Syr3eBp5d.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-21","episode_number":8,"episode_type":"standard","id":24758,"name":"It's a Hard Knock Life","overview":"Kelly grows frustrated with all of the appearances she must make as a recording artist.  She yells and screams at everyone.  Sharon sympathizes with her, noting that she just wants to be a teenager and is having a hard time handling all of the demands being placed on her.  She asks Ozzy to go talk to Kelly and reassure her.  Kelly quickly sends him scampering away as she throws a screaming fit.  Kelly flies to New York to work on her album.  She does a photo shoot for Vanity Fair, and ends up storming off and having another tantrum.  She later meets P.Diddy at a party.  He asks her to be his guest and gives her an expensive watch as an apology after one of his security guards knocks her down.  Sharon becomes fascinated with the idea of becoming P.Diddy's mother-in-law, and embarrasses Kelly by refusing to stop talking about it.  Ozzy and Kelly listen to some of her songs together.  He tells her that she has done well and expresses his pride.  Meanwhile, Jack has problems with a band th","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/uQBpwj53H3MiD6VlE3DfV24DQQc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-28","episode_number":9,"episode_type":"standard","id":24761,"name":"Cleanliness Is Next to Ozzyness","overview":"Ozzy grows increasingly tired of the dogs and their tendency to go to the bathroom everywhere.  Because Sharon's immune system is very weak due to the chemo, he fears that all of the germs will cause her to develop an infection.  He constantly cleans everything and tries to get everyone to wear gloves around Sharon.  He also urges Sharon not to let the dogs on the bed, but she ignores him.  Ozzy meets with a contractor about plans to build an outdoor kennel for all of the dogs, but Sharon quickly kills this idea.  Jack and Sharon argue when she insists on going out to dinner.  He believes she should rest, but she is feeling well and can't stand to be cooped up in the house.  Sharon takes Robert shopping for furniture for his new room.  She explains that Robert was a good friend to Aimee and Kelly after the Osbournes moved from England, so they have taken him in after his mother's death (from colon cancer).  Jack bonds with Robert and shows him how to make one of his favorite treats, be","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/sT3kvRgoXWPnoE5FHgRyyo4gxnD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-04","episode_number":10,"episode_type":"standard","id":24757,"name":"Viva Ozz Vegas","overview":"As Kelly's 18th birthday approaches, she repeatedly whines about the fact that she doesn't want to have a party.  She feels that she would just end up being ignored on what is supposed to be her day.  The family decides to go to Las Vegas for the weekend, and Ozzy will play a show.  Sharon insists that the whole thing will be a low-key affair.  Kelly becomes upset when Jack decides to bring eight friends along on the trip.  Jack and company wind up sitting around the hotel room watching Teletubbies because they can't get away from security.  Jack complains to Sharon about how unfair this is.  Kelly and Sarah get very drunk, and Sarah does a striptease atop a table while Sharon, Ozzy and other adults are trying to have dinner.  Jack and his friends eventually make it downstairs.  Kelly gets very upset because she thinks Jack is stealing her thunder.  Kelly and Sarah have an altercation with some girls who are hanging out with Jack and Dill, as one of them apparently looks at Kelly the w","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/6kq86RRwcNbmQsdItbKeD6xy242.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-11","episode_number":11,"episode_type":"standard","id":24759,"name":"My Big Fat Jewish Wedding","overview":"Sharon and Ozzy decide to renew their wedding vows at a hotel on New Year's Eve.  Kelly is to serve as flower girl, with Jack and Robert as ushers.  Kelly objects to the fact that the ceremony will be conducted by a rabbi; although Sharon's father is Jewish, Kelly insists that a person cannot be Jewish unless their mother is.  Ozzy is not at all enthused about the ceremony.  Kelly and Sarah are less than impressed with Jack's latest female \"\"friend,\"\" particularly because she once dated Jack's best friend.  Sharon catches the girl in bed with Jack, and later finds condoms in the room.  She tries to encourage Jack to settle down and find a steady girlfriend, but he would rather juggle several girls because the idea of a relationship freaks him out.  Ozzy and Jack have various body parts plucked, shaved and waxed before the wedding.  Sharon recalls the couple's first wedding night, when Ozzy passed out drunk in the hallway.  Ozzy insists that he will not drink this time.  Sharon recites he","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":"/m827CrS8OvRROoKIaI1bss1VoG9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52537bae19c295794018fe3a","order":502,"adult":false,"gender":0,"id":1217253,"known_for_department":"Acting","name":"Don Arden","original_name":"Don Arden","popularity":0.652,"profile_path":null}]},{"air_date":"2003-06-10","episode_number":12,"episode_type":"standard","id":24755,"name":"What a Boy Wants","overview":"The Osbournes struggle to come up with a gift for Jack's birthday.  Kelly strongly objects when Jack dances with Christina Aguilera, whom Kelly had previously insulted on a number of occasions.  Kelly complains that Jack is disrespecting her by hanging around someone that she dislikes, and insists that she would never do this to Jack.  Jack tries to explain that Christina actually had nice things to say about Kelly.  The kids get into a brawl, which Sharon must break up.  Meanwhile, Ozzy visits the dentist and intakes a bit too much nitrous oxide.  The family visits a medieval-themed club to celebrate Jack's birthday, and buys him a knight suit.  Jack tries out his new sword by dueling with a buddy in the street.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-17","episode_number":13,"episode_type":"standard","id":24756,"name":"Flea's a Crowd","overview":"The pets suffer from a flea infestation, creating havoc around the house and leaving everyone itchy and miserable.  Kelly prepares to go on a trip to Philadelphia to visit her boyfriend, Bert.  Sharon does not want her to go away alone (she prefers her to have security at all times), and drives Kelly crazy as she somewhat jokingly nags her.  Sharon has Robert and Jack move a heavy statue out to the garden, but never seems satisfied by the location.  She forces them to move it several times.  The house is redecorated, and Ozzy finds himself extremely bewildered by a giant statue of a hand.  Kelly goes against her parents' wishes and gets a nose ring, which Sharon wants her to remove.  Kelly later mistakes the nose ring for something on her nose and accidentally flicks it out.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-06-24","episode_number":14,"episode_type":"standard","id":24764,"name":"Run Ozzy Run","overview":"Ozzy continues to work out with his trainer, Pete, who Ozzy jokes may be a robot because he never stops talking, sweats, eats or goes to the bathroom.  Ozzy is to run five miles on his 54th birthday.  He runs almost two miles before he is stopped by a foot injury.  The family throws a party for Ozzy's birthday, complete with a fireworks display by Jack and Robert.  Ozzy eventually tries to run the five miles again, and succeeds this time.  Meanwhile, Ozzy has problems with his new car, as the voice recognition system can't understand a word he says.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-01","episode_number":15,"episode_type":"standard","id":24763,"name":"Fists of Fury","overview":"Ozzy and Sharon prepare to leave for a few days on a Hawaiian vacation.  Ozzy tells Jack that he is no longer to have people over at the house after 11 PM.  Kelly is afraid that Jack will turn the house into a nonstop party while their parents are gone.  Sharon promises to talk to him, but this does little to reassure Kelly.  Jack has a lot of people over late at night, and they soon begin using the pool and making a lot of noise.  Kelly becomes very upset because she is tired of Jack and his friends keeping her from sleeping.  He refuses to listen to Melinda when she asks them to be quiet.  When Kelly confronts Jack, he dares her to hit him, so she nails him in the face.  They get into a fight, and the staff has to pry them apart.  Kelly calls Sharon for sympathy, but Jack gets on the line and complains about the cuts to the face he sustained from the punch.  Kelly feels Jack deserved what he got; Melinda agrees somewhat, but warns Kelly to be careful about her temper.  Sharon and Ozz","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-08","episode_number":16,"episode_type":"standard","id":24768,"name":"Mama, I'm Staying Home","overview":"Ozzy decides to stay home while Sharon, Melinda and the kids travel to New York.  Sharon hopes that Ozzy and Robert will spend more time together, but the two mostly avoid one another because they have little in common.  Robert spends a lot of time listening to music and dancing in his guest house, and Ozzy cannot get one of the songs out of his head.  Ozzy buys a lot of kitchenware, and spends over $600 on candy for Sharon.  Meanwhile, Melinda learns that she is pregnant, and annoys Kelly by talking about her pregnancy nonstop.  Kelly also gets into a playful wrestling match with Sharon.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-15","episode_number":17,"episode_type":"standard","id":24765,"name":"Tennis Racket","overview":"Sharon receives a peace offering from one of her folk-singing neighbors, but the neighbors on the other side begin to drive the family crazy by playing tennis at all hours of the day and night.  Jack tries playing drums outside, and Ozzy blasts the loudest, most obnoxious music he can find.  However, nothing seems to have an effect on the neighbors.  Jack shoots at the court with his paintball gun, leading to a visit from the police.  Sharon suspects that the neighbors are responsible when three of the Osbournes' cats disappear, although the coyotes seem the more likely culprit.  Kelly brings home another cat, but Ozzy isn't very happy about it.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-22","episode_number":18,"episode_type":"standard","id":24762,"name":"A Little Ditty About Jack and Brieann","overview":"Jack visits the home of singer/actress Courtney Love.  He begins dating Kurt Cobain's sister Brieann, who is staying with Courtney.  They get along very well, and Jack teaches her some of his favorite recipes, including beans on toast.  Sharon is touched to learn that Jack has a tattoo of the word \"\"Mom\"\" with a heart around it.  (He got it right after she was diagnosed with cancer.)  Ozzy tries out some song lyrics on Sharon, who is busy shopping at the time.  He later plays a demo of the new song for Jack and Brieann.  Ozzy is bewildered by a rotisserie turkey as it cooks in the kitchen.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-07-29","episode_number":19,"episode_type":"standard","id":24767,"name":"Angler Management","overview":"After 17 years of waiting, Ozzy fulfills his dream of taking Jack on a fishing trip.  They get in trouble with the captain for throwing firecrackers at the pelicans.  Everyone on board places bets on who can catch the largest fish, and a friend of Jack's wins the contest.  Ozzy winds up catching some tin cans and a bird.  He also momentarily mistakes a seal for a shark.  Nevertheless, they both have a great time on the trip.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-05","episode_number":20,"episode_type":"standard","id":24766,"name":"Bye Bye Babies","overview":"Jack and Robert fly to England to spend time at the Osbournes' other home.  Jack shows Robert the house and introduces him to the family's oldest dog, Sugar.  Some of Jack's friends also come over to hang out with them and drink.  Lola grows lonely and bored because she misses Jack so much.  Sharon also laments the departures of both Jack and Kelly, who is away on tour.  Meanwhile, Ozzy uncovers an old keyboard from his Black Sabbath days and tries to get it working again.  He also becomes fascinated with carrot cake, but Pete tries to stop him from overdoing it.  Jack and Kelly return home and are reunited with their loved ones.","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-08-12","episode_number":21,"episode_type":"standard","id":24770,"name":"Ozz Well That Ends Well","overview":"Kelly experiences problems in her relationship with Bert.  He finally breaks up with her over the phone on Valentine's Day, claiming that no one took him seriously because he was dating her.  Kelly becomes extremely irritable and depressed, and takes her anger out on the family.  She argues with Sharon, who suggests that she find another manager; and bites Jack on the arm.  She overhears her family talking about her and decides to leave home.  Meanwhile, Jack is alarmed when he acts out violently in his sleep.  He wakes up one night to find himself beating up Lola.  On another night, he attacks Minnie; and is horrified to wake up and discover that he has killed her.  He flees the house with the body.  A devastated Sharon retreats to the family's Malibu home to escape memories of Minnie.  Ozzy is left all alone, with no one to help him fix the television.  Suddenly, the director yells, \"\"Cut!\"\"  Ozzy rejoins his family (including Minnie) in another room, and it is revealed that this episo","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-12-11","episode_number":22,"episode_type":"finale","id":24769,"name":"The Osbourne Family Christmas Special","overview":"The Osbournes prepare for Christmas in a series of skits.  The dogs are dressed in festive attire; Sharon horrifies Kelly by trying to make her dress \"\"Christmasy\"\" for the family's upcoming party; Mandy Moore tries in vain to get Jack and Kelly into the holiday spirit; and Ozzy very reluctantly performs a holiday duet with fellow MTV reality star Jessica Simpson.  The family hosts a blow-out celebrity bash for the holidays, complete with cooking segments, a visit from Santa, Christmas carols, and a unique version of \"\"'Twas the Night Before Christmas.\"\"","production_code":"","runtime":null,"season_number":2,"show_id":499,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52537bae19c295794018ff14","order":500,"adult":false,"gender":2,"id":76245,"known_for_department":"Acting","name":"Adam Carolla","original_name":"Adam Carolla","popularity":4.924,"profile_path":"/47k9w6HRLnGeU0gVtMeTPJs3ief.jpg"},{"character":"","credit_id":"52537bae19c295794018ff32","order":504,"adult":false,"gender":1,"id":111946,"known_for_department":"Acting","name":"Britney Spears","original_name":"Britney Spears","popularity":10.466,"profile_path":"/5ClVSzj0roqRY1ff2rNnZJcWuSA.jpg"},{"character":"","credit_id":"52537baf19c295794018ff50","order":507,"adult":false,"gender":1,"id":29221,"known_for_department":"Acting","name":"Brittany Snow","original_name":"Brittany Snow","popularity":29.372,"profile_path":"/uSQW2E7caOaXHBbvL2jdzGbwDwH.jpg"},{"character":"","credit_id":"52537baf19c295794018ff6e","order":508,"adult":false,"gender":1,"id":28639,"known_for_department":"Acting","name":"Carmen Electra","original_name":"Carmen Electra","popularity":16.42,"profile_path":"/oiNGbPpboR7uq9K7L2g63UZwyMq.jpg"}]}],"name":"Season 2","overview":"","id":1427,"poster_path":"/9k9uQXRMaqlso9YDNRBNouE1X45.jpg","season_number":2,"vote_average":0},"3":{"_id":"52537bac19c295794018fcdc","air_date":"2004-01-27","episodes":[{"air_date":"2004-01-27","episode_number":1,"episode_type":"standard","id":24785,"name":"The Show Must Go Oz","overview":"Sharon faces pressure from the powers that be behind her talk show, who are disappointed in her performance and expect her to work harder.  She refuses to incorporate their suggestions into the show.  Kelly and Jack grow tired of appearing on Sharon's show; both refuse her request for a co-hosting appearance.  Ozzy very reluctantly agrees to appear in the Halloween episode.  He believes that he is going to just be a guest, and is furious when he learns (at the last minute) that he is to serve as co-host.  Meanwhile, the Osbournes' property undergoes some re-decorating.  The workmen struggle to move a gigantic Buddha statue across the yard.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/6Yt8aajFKWaAFmyLzUzw7LirmUu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-03","episode_number":2,"episode_type":"standard","id":24783,"name":"Car Jacked","overview":"Jack turns 18 and receives a car as a birthday present.  Kelly doesn't believe that he will pass his driver's test because he is such a poor driver, but Sharon disagrees.  Jack practices parallel parking with his assistant, and winds up crashing into another car.  Jack passes his test, receiving a perfect score on the driving portion of the exam.  Meanwhile, Kelly frets about yet another confrontation with Christina Aguilera, this time during the MTV Europe Awards.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/4YURtm1VXkVNfmfswYGpPC5Gq92.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-10","episode_number":3,"episode_type":"standard","id":24784,"name":"Rebel Without an Ozz","overview":"Ozzy and Sharon fret about all of the time they must spend apart as she works on her talk show.  One of Sharon's scheduled guests, rapper/actor DMX, runs late and is in danger of not making it to the show on time.  He has a history of being late or skipping out on events, and Sharon finds the whole situation very amusing.  Ozzy gives everyone who stops by the house a tour of his new home studio.  He enjoys watching porn on the state-of-the-art TV.  Ozzy also buys a new motorcycle, but isn't quite sure how to start it.  Meanwhile, Jack and his friends find new and disgusting ways to entertain themselves.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/7Rx0pQBjocJklr4uEGHsytLDmdd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-17","episode_number":4,"episode_type":"standard","id":24782,"name":"Return of the Ring","overview":"Ozzy loses a diamond pinkie ring that is worth over $100,000.  He becomes obsessed with trying to find it, and pleads with Sharon not to buy any more jewelry.  She doesn't pay attention to his decree, and also buys his and her Bentleys.  Ozzy eventually finds the ring, but is upset to learn that Sharon plans to buy Kelly a ring for her birthday.  Meanwhile, one of the dogs, Colin, has to be fixed because he continuously humps everything in sight.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/c2jnurLSNMc4fbEi5HTZVUfOFqZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-24","episode_number":5,"episode_type":"standard","id":24781,"name":"The Accidental Tourist (1)","overview":"Kelly and Ozzy plan to travel to England, where they are to perform a duet of \"\"Changes,\"\" the title track from Kelly's sophomore album, on Top of the Pops.  Ozzy upsets Kelly by saying that he doesn't want to come with her, but Sharon assures her that he will change his mind.  Kelly's boyfriend, Rob, joins her on the trip.  Ozzy annoys Kelly when he immediately complains of boredom and says that he wants to go back to Los Angeles.  They later get along well while riding ATVs on the family's estate.  Everyone seems pleased with their duet, and Ozzy predicts that it could hit number one on the U.K. charts.  Before a talk show appearance, Kelly gets into a fight with Rob.  They apparently break up, and he returns to the U.S.  Ozzy suffers an accident while riding one of the ATVs.  His bodyguard finds him lying on the ground, unconscious.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/98VTMiF2oDicVJa1UilG00LPqVI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-06","episode_number":6,"episode_type":"standard","id":24786,"name":"The English Patient (2)","overview":"After three weeks in the hospital, Ozzy is released and continues to convalesce at his home in England.  He and Sharon miss each other desperately.  Ozzy develops a craving for eclairs, and cannot get enough of them.  Meanwhile, Jack finally gets a hair cut after two years.  Sharon experiences more problems with her talk show.  Publicists begin pulling their clients from the show because they do not approve of Sharon's behavior, and Sharon grows tired of the constant tinkering with the show (adding cooking segments and makeovers).  She decides to quit the show, and no one really fights her on it.  She and Ozzy agree that they will no longer work unless it is a project they can take together.  Ozzy is able to fly back home to Los Angeles, and is greeted warmly by the family.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/qog7hD7B1uChC2YarrX6u6iQFoU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-13","episode_number":7,"episode_type":"standard","id":24787,"name":"Scent of a Woman","overview":"Kelly annoys everyone, particularly Sharon, with her disgusting lack of personal hygiene as she refuses to shower for a long period of time.  She is upset when Sharon accuses her of smoking.  Ozzy receives a letter supposedly from the Prime Minister of Canada asking him to come to Canada to receive an award.  Ozzy, however, suspects that the whole thing is a hoax.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/nSxqFlGJD0kZj8x2YznYc0OaoVr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-20","episode_number":8,"episode_type":"standard","id":24788,"name":"Pain in the Neck","overview":"Ozzy grows increasingly frustrated about being cooped up around the house.  He misses Sharon, who is busy working on her show, and is upset about the weight he has been gaining because he cannot work out.  He also hates the bulky neck brace that he is forced to wear.  Jack gets another tattoo and reveals it to Ozzy.  Ozzy is so bored that he goes out grocery shopping with his assistant, Tony, even though he hates to shop.  He later joins Jack at the shooting range.  Ozzy is soon able to begin using the treadmill again, and receives the good news that he can take off the neck brace.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/pFNwPMLayCuD3x0qoDxmZRrr2rL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-27","episode_number":9,"episode_type":"standard","id":24789,"name":"Ozzy Knows Best","overview":"Ozzy is upset by Kelly's tendency to wear revealing outfits when she goes out to clubs and parties.  She feels that he is being overprotective.  Ozzy worries about the behavior of one of the bulldogs, Colin, as he is attacking the other dogs (especially Lola).  He tries to give him away to an employee, but Jack strongly objects.  Ozzy grows frustrated, as he feels that no one pays attention to anything he says.  He and Jack eventually patch things up, and Sharon tries to get through to Kelly.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/7Z4WRGWca0PLW1CaesOAHu4tryO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-05-04","episode_number":10,"episode_type":"finale","id":24790,"name":"Valentine Daze","overview":"Kelly continues to spend time with Rob, but doesn't want to be his girlfriend because he wants a committed relationship and she feels that she is too young to settle down.  Sharon and Melinda try to convince her to change her mind.  Jack heads off to Las Vegas.  Ozzy and Sharon worry that he will spend too much time gambling.  Kelly tells her parents that she is going to drive to San Diego.  They don't want her to go, but eventually offer their approval.  She actually has lied and is headed to Vegas as well.  Ozzy becomes annoyed with Sharon for trying to decorate his studio.  Ozzy and Sharon spend Valentine's Day together and express the hopes that their kids will meet someone special soon.  They reflect on their years together.","production_code":"","runtime":null,"season_number":3,"show_id":499,"still_path":"/pJHE8L601lb4N5Xd4E2CgFoTNpA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":1429,"poster_path":"/2DMfBMxUUcSkrSIdvRRC7qY8NLm.jpg","season_number":3,"vote_average":0},"4":{"_id":"52537bac19c295794018fced","air_date":"2005-01-17","episodes":[{"air_date":"2005-01-17","episode_number":1,"episode_type":"standard","id":24793,"name":"Sleepless in Beverly Hills","overview":"Ozzy begins suffering from insomnia.  He eventually undergoes testing with a sleep disorder expert to determine the cause.  Jack gets a tattoo of a cross on his chest, but Ozzy and Sharon do not like it.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/nzp8YCFKHYP6nPAqqrBUb1BhQSv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-24","episode_number":2,"episode_type":"standard","id":24796,"name":"Have Ozz Will Travel (1)","overview":"The family tries to decide where to go on vacation.  Sharon turns down Fiji because none of the hotels meet her standards, while Ozzy nixes a number of other locations for various reasons.  Sharon ultimately decides on Hawaii, although Ozzy is still reluctant to go.  Meanwhile, Kelly wins a major role in a television pilot.  She must miss out on the family's vacation to go to Vancouver for filming.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/3bR4ACqCJyHU2mxj7cScFXEHzOo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-31","episode_number":3,"episode_type":"standard","id":24791,"name":"Hawaii Five Ozz (2)","overview":"Ozzy, Sharon and Jack head to Hawaii for their vacation.  Ozzy continues to be miserable for a while, but cheers up following a private luau.  Jack goes diving in a shark cage.  His friends invite strippers to the luau, and behave in ways that embarrass him.  The traveling party winds up leaving without Jack's friends when they fail to show up on time for their flight.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/cPvseZ5bj6xHwi2NgPahS8Ub40u.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-07","episode_number":4,"episode_type":"standard","id":24795,"name":"Kelly Interrupted","overview":"Kelly irritates her mother by getting a lip ring.  Ozzy and Jack are convinced that Kelly's erratic behavior and chronic illness are the result of drug use, but Sharon refuses to hear of it.  Kelly eventually admits the truth to Sharon and enters rehab.  Ozzy and Sharon don't believe she will stay at the facility for long.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/rDIJ9MmnEUa8iwRWh9dc28jRUfN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-14","episode_number":5,"episode_type":"standard","id":24792,"name":"28 Days Later","overview":"Kelly struggles to adjust to life in rehab, and frequently calls home requesting various personal belongings.  She wants to leave, but Jack urges her to tough it out.  Jack celebrates both his birthday and a year of sobriety.  Kelly arrives home and becomes frustrated by the curfew and other rules she must follow.  She clashes with her mother often, and accuses Sharon of messing with her head when she expresses her concerns.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/w9KbEjreBNczoddw7wR118FObKM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-21","episode_number":6,"episode_type":"standard","id":24794,"name":"Charity Case","overview":"Sharon and Kelly plan a trip to Kenya on behalf of a charity organization.  Ozzy doesn't want them to go, as he fears they will be kidnapped or contract malaria.  Sharon also has second thoughts after hearing more details about the trip.  The family receives a visit from Sir Elton John, who gives Ozzy an expensive necklace that leaves him feeling a bit embarrassed; and goes on a shopping spree with Sharon, Jack and Kelly.  Ozzy, Sharon and Kelly later attend an event in honor of Covenant House, where Sharon receives an award and Kelly bids on a puppy.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/sFgrWVeiysU6Ua1PvP7QYmTxJNa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-02-28","episode_number":7,"episode_type":"standard","id":24798,"name":"Number One Fan","overview":"A 25-year-old fan wins a charity auction for the right to spend the day with Sharon.  Sharon is touched by the woman's generosity and invites her to spend the night at the Osbourne home.  Meanwhile, Jack must attend an online traffic school after getting a speeding ticket.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/wYaJtxlvNYMzoRb34GQNH1AbD5q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-07","episode_number":8,"episode_type":"standard","id":24800,"name":"Lozt in Translation","overview":"The family travels to Japan, where Ozzy is to receive the Legend Award at the Video Music Awards.  Kelly also makes several personal appearances.  One of the employees, Sam, meets with some family members whom he hasn't seen in years, but can only communicate with them through a translator.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/z8oWqzU4VZwqPwM8WFmDCBN2S5J.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-03-14","episode_number":9,"episode_type":"standard","id":24797,"name":"The Show Must Go Off!","overview":"Sharon's talk show tapes its final episodes.  Feeling mistreated, Sharon clashes with her bosses to the very end, showing up late on purpose and demanding money upfront.  She takes her mind off of things by shopping, including the purchase of a state-of-the-art toilet.  Kelly feels hurt when Sharon repeatedly criticizes her wardrobe.  Ozzy pays another visit to the dentist.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/7Dqbafo3akZf96ono1pksHj3RAd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52537bb019c29579401901c0","order":501,"adult":false,"gender":1,"id":115654,"known_for_department":"Acting","name":"Anna Nicole Smith","original_name":"Anna Nicole Smith","popularity":21.77,"profile_path":"/nvrEDjP32lT0e05GP1o4qJMGzVX.jpg"}]},{"air_date":"2005-03-21","episode_number":10,"episode_type":"finale","id":24799,"name":"A Farewell to Ozz","overview":"Dr. Phil McGraw pays a visit to the house, where he holds a frank discussion with the Osbournes about drug abuse and other issues that have affected the family's relationships with one another.  Examples are given through clips from previous episodes.","production_code":"","runtime":null,"season_number":4,"show_id":499,"still_path":"/xGUocCA189rYbiec5HcHXLSOrCb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":1430,"poster_path":"/8LV1Hu2qAGMemiCqw2m7YFWVN3G.jpg","season_number":4,"vote_average":0}}}