{"adult":false,"backdrop_path":"/4HepCh0HNn1od5m27mNgpipBMft.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2013-01-22","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":49949,"in_production":false,"languages":["en"],"last_air_date":"2016-03-22","last_episode_to_air":{"id":1178097,"name":"Indonesia Orangutan","overview":"Dom sails through the islands of Indonesia to find one of the most elusive and endangered great apes, the Sumatran orangutan, which shares 96 percent of our DNA but is six to eight times stronger than humans.","vote_average":0,"vote_count":0,"air_date":"2016-03-22","episode_number":13,"episode_type":"finale","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null},"name":"Wild Things with Dominic Monaghan","next_episode_to_air":null,"networks":[{"id":326,"logo_path":"/zS4kwaXhwNhMhoT55yOPtQqHxhX.png","name":"OLN","origin_country":"CA"}],"number_of_episodes":31,"number_of_seasons":3,"origin_country":["GB"],"original_language":"en","original_name":"Wild Things with Dominic Monaghan","overview":"A true nature lover, Dominic with his courageous cameraman Frank, travel  across four continents to far-flung countries in search of the largest,  weirdest and most intense creatures alive – all in an attempt to ease  fears of these often misunderstood animals. Crawling through dark caves,  sailing the Amazon River, surfing the Costa Rican coast, and immersing  himself in local culture, customs and cuisine makes for an adrenaline  pumping, wildly adventurous season.  He will also be joined by his buddy  Billy Boyd on a quest to New Zealand where they’ll search for the giant  wetapunga and return to where it all began for the duo, Hobbiton, home  of the Lord of the Rings world for a traditional Hangi feast.","popularity":1.512,"poster_path":"/6XeuWQqM4UN1uYEGhM5YPJ3Ud2C.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2013-01-22","episode_count":8,"id":75044,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2014-03-25","episode_count":10,"id":75045,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2016-01-05","episode_count":13,"id":75046,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":6.9,"vote_count":5,"season_data":{"1":{"_id":"56d6a0ebc3a3681e36019058","air_date":"2013-01-22","episodes":[{"air_date":"2013-01-22","episode_number":1,"episode_type":"standard","id":1173015,"name":"Giant Water Bug","overview":"Dom travels from the snake-infested rice paddies of Vietnam’s Mekong Delta to a crocodile filled lake in search of one of the world’s most dangerous aquatic insects – the giant water bug.","production_code":"","runtime":60,"season_number":1,"show_id":49949,"still_path":"/qrqCnbgvbjnVA0Omz1zcGtWgYY7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-29","episode_number":2,"episode_type":"standard","id":1173016,"name":"Giant Huntsman Spider","overview":"Dom journeys to Laos in search of a remote underground river that is home to a venomous, massive-fanged creature the size of a dinner plate – the Giant Huntsmen Spider – an arachnid so rare that only a few humans have ever interacted with it in the wild.","production_code":"","runtime":60,"season_number":1,"show_id":49949,"still_path":"/db6sDI5JStvnMWlFmF0BKEGWyE6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-05","episode_number":3,"episode_type":"standard","id":1173017,"name":"Black Hairy Thick Tail Scorpion","overview":"Dom braves the remote wilderness of Namibia while on the hunt for Africa's largest, deadliest scorpion - parabuthus villosus, commonly known as the black hairy thick-tailed scorpion. This beast can not only kill a human but also spray its venom up to a metre. Dom's journey to find the scorpion takes him into spectacular desert scenery.\nDom’s journey takes him into spectacular desert scenery, as he hikes up rugged mountain trails and across vast sand seas. On the way he survives a violent thunderstorm and flash floods; treads in the footprints of dinosaurs; and encounters a rock monitor, a meercat dining on a scorpion, a solifuge, a whip snake, and the lethally venomous horned adder. Dom also gets to meet an amazing array of different scorpions, including, eventually, the nastiest of the lot.","production_code":"","runtime":60,"season_number":1,"show_id":49949,"still_path":"/3W5qRhaJLed5PephboX2Fot1iCb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-12","episode_number":4,"episode_type":"standard","id":1173018,"name":"Giant Centipede","overview":"Dominic starts his adventure in Venezuela, South America, searching for a cave rumoured to house Scolopendra gigantea, which is one of the world's largest centipedes. He finds himself abseiling into a toxic cave and hiking through a snake-infested jungle, encountering a false chameleon, a sloth, a deadly neotropical rattlesnake and a tarantula just to get there.","production_code":"","runtime":60,"season_number":1,"show_id":49949,"still_path":"/7P0wUwVhSolxYGH5ueXgcTilsSk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-19","episode_number":5,"episode_type":"standard","id":1173019,"name":"White Goliath Beetle","overview":"In an attempt to locate one of the most rare animals on the planet - the giant white Goliath beetle - Dom must infiltrate the black market insect trade in Cameroon. Travelling around the country, Dom gradually works his way down the network of middlemen and hunters, until he finally discovers the man who will lead him to the beetle.","production_code":"","runtime":60,"season_number":1,"show_id":49949,"still_path":"/37OWpnHratjHuUumcUWlAXCjGdp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-26","episode_number":6,"episode_type":"standard","id":1173020,"name":"Army Ants","overview":"Dom travels deep into the heart of the Ecuadorian Amazon to face off with a four million-strong colony of flesh-eating, venom injecting army ants – a terrifying mass of insects that may be the largest ant colony ever discovered in the New World. En route through the jungle Dom also comes face to face with leaf cutter ants, an enormous rhinoceros beetle, a green parrot snake and a highly venomous Brazilian wandering spider. Once he finally tracks down a colony of army ants, he follows them on a raid, and watches spellbound as they attack and devour the creatures in their path, including a scorpion, a nest of paper wasps and a katydid. But will Dom have the courage to let the ants attack him?","production_code":"","runtime":60,"season_number":1,"show_id":49949,"still_path":"/b1zEJpnrcBQZ0bLeQ6G9Fs25tgm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-05","episode_number":7,"episode_type":"standard","id":1173021,"name":"Giant Malaysian Honey Bees","overview":"Dom faces his greatest fear when he must get up close and personal with hundreds of thousands of giant Malaysian honey bees – a formidable insect that lives in hives hundreds of feet above the jungle floor.","production_code":"","runtime":60,"season_number":1,"show_id":49949,"still_path":"/i5nbqqVRce3EsrqEs66f6EPcToO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-12","episode_number":8,"episode_type":"finale","id":1173022,"name":"Guatemalan Beaded Lizard","overview":"Dom travels to Guatemala and immerses himself in the rich world of Mayan legend and lore as he seeks out one of the most endangered and venomous reptiles on the planet – the Guatemalan beaded lizard.","production_code":"","runtime":60,"season_number":1,"show_id":49949,"still_path":"/xXGzdS5oZZrzBUaDq9MuiGsv1Ua.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":75044,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"56d6a1cac3a3681e36019092","air_date":"2014-03-25","episodes":[{"air_date":"2014-03-25","episode_number":1,"episode_type":"standard","id":1173023,"name":"Giant Spitting Cobra","overview":"Dominic heads to Kenya – the heart of safari country – to track down the incredible giant spitting cobra. Capable of blasting cornea-melting venom and delivering a bite lethal enough to kill more than 20 people, this might be his most dangerous mission to date. But the cobra isn’t his only worry on this adventure. While on his search, Dominic and cameraman Frank have their closest call ever when a six-ton elephant charges and almost tramples them after they stop to help perform life-saving field surgery on the wounded animal.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-01","episode_number":2,"episode_type":"standard","id":1173024,"name":"Ghost Bat","overview":"Dominic endures the scorching heat of the vast Australian Outback to locate one of the rarest bats on the planet – the ghost bat. The creature gets its name from its translucent white wings that make it look ghostly as it flies through the moonlight. To find them, Dominic has to crawl on his belly to fit into incredibly tight and pitch black spaces. One wrong step can mean disaster. The Northern Territory’s premiere bat expert, Dr. Damien Milne joins him on this dark search.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-08","episode_number":3,"episode_type":"standard","id":1173026,"name":"Lemur Leaf Frog","overview":"Dominic touches down in Costa Rica, home to more than a half-million known species of animal, including the extremely endangered, but incredibly beautiful, Lemur Leaf Frog – a thumbnail-sized master of camouflage. Dominic has to trek through the most remote stretches of Costa Rican jungle filled with predators to find the elusive creature. Meanwhile, he engages in a bit of fun playing on the monkey bars with a monkey and surfs the challenging Costa Rican coast.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-15","episode_number":4,"episode_type":"standard","id":1173027,"name":"Gaboon Viper","overview":"Dominic is in Zambia on a mission to find one of the most feared snakes on the planet, the enormous and deadly gaboon viper. Armed with an incredibly fast strike, the gaboon viper wields the longest fangs of any poisonous snake – two-inch long swiveling switchblades that deliver more venom in one bite than any other snake on Earth. He and local snake expert Morgan, travel by boat up the mighty Zambezi River, navigating his way through dangerous pods of hippos and Nile crocodiles, and through the Zambian forest – home to a group of very rare white rhinos and villagers who make their homes along the remote edges of the Zambian forest. While there, Dominic learns about the ancient relationship between the people and the termites that build spectacular 20-foot mounds nearby.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-22","episode_number":5,"episode_type":"standard","id":1173028,"name":"The Titan Beetle","overview":"Dominic sails the mighty Amazon River on a mission to find the largest beetle on the planet – the titan beetle. This massive insect can grow up to seven inches in length and wields mandibles so strong and sharp, it can snap a pencil in half. To find this rare and elusive beetle he has to venture into the remote corners of the Brazilian jungle. Along the way, he wrestles with a mighty green anaconda he encounters on the river. Dominic also visits a remote village in the rainforest, where he befriends a group of small children and gets his face painted with the seeds of the achiote fruit, an ancient practice.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-29","episode_number":6,"episode_type":"standard","id":1173029,"name":"Box Jellyfish","overview":"In his first underwater mission ever, Dominic heads to Australia’s legendary Great Barrier Reef to track down perhaps the most venomous creature in the ocean, the deadly box jellyfish. Responsible for more deaths than sharks and crocodiles combined, this creature is armed with potent venom that can stop the human heart in seconds.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-06","episode_number":7,"episode_type":"standard","id":1173030,"name":"The Giant Wetapunga","overview":"Dominic is in New Zealand on a mission to find one of the largest and heaviest insects on earth, the very rare and very cool giant wetapunga – the largest species of Wetas, found only in New Zealand. In a Wild Things twist, Dominic will be accompanied by his best friend and fellow hobbit, Billy Boyd. He and and Billy have not been in New Zealand together since they acted in The Lord of the Rings Trilogies. Together, Dom and Billy meet the incredible creatures endemic to the island and have a bit of fun in Hobbiton.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-13","episode_number":8,"episode_type":"standard","id":1173031,"name":"The Gila Monster","overview":"Dominic is in Arizona’s Sonoran Desert, the most bio desert in all of North America – it’s also one of the hottest. He’s come here to explore more than a hundred thousand square miles of wild desert, on a mission to find one of America’s most mythic creatures, the Gila Monster. It’s the largest of its kind in North America – a gorgeous ground dwelling creature that packs one of only two venomous lizard bites in the whole world! On his trip around the desert, Dominic runs into other fascinating and dangerous creatures including the biggest species of rattlesnake in North America and a Black Widow Spider.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-20","episode_number":9,"episode_type":"standard","id":1173032,"name":"Giant Salamander","overview":"Dominic faces one of his most challenging missions ever when he travels to the Land of the Rising Sun in pursuit of the giant Japanese salamander. Measuring over five feet in length and tipping the scales at a whopping 50 pounds, these massive amphibians live and hunt in cold, fast-moving remote mountain streams.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-27","episode_number":10,"episode_type":"finale","id":1173033,"name":"The Slow Loris","overview":"In the season finale, Dominic travels deep into the wilds of Thailand, searching for one of the most unique and endangered primates on the planet, the Slow Loris, the world’s only venomous primate.  It’s a nocturnal, tree dwelling creature with enormous eyes that can see in the dark, and has one of the sweetest faces on the planet… but don’t let that fool you.","production_code":"","runtime":60,"season_number":2,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":75045,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"56d6a2bec3a3682cef008252","air_date":"2016-01-05","episodes":[{"air_date":"2016-01-05","episode_number":1,"episode_type":"standard","id":1173034,"name":"Belize's Fer-de-Lance","overview":"Dominic Monaghan is in Belize on a mission to find Latin America's most deadly snake, the Fer-de-Lance. Along the way he encounters soaring Mayan pyramids, mysterious caves and lush rainforests filled with dramatic wildlife.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-12","episode_number":2,"episode_type":"standard","id":1173035,"name":"Florida's Stealthy Sharks","overview":"Dominic Monaghan dives into the Florida Keys in search of some of the largest and deadliest sharks. Along the way, he learns the local sport of alligator wrestling and finds a dangerous rattlesnake while driving an airboat.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-19","episode_number":3,"episode_type":"standard","id":1173036,"name":"Mythical Madagascar","overview":"As Dominic Monaghan searches for the most famous and feared lemur of Madagascar, he crosses a harrowing stone forest called the Big Tsingy, runs into the smallest and largest chameleons on earth and gets bitten by a rare snake.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-26","episode_number":4,"episode_type":"standard","id":1173037,"name":"Majestic Mozambique","overview":"Dominic Monaghan is hot on the trail of the largest fish on the planet - the 42-ton whale shark! Along the way, he enters a local boat race and partakes in an annual fishing celebration.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-02","episode_number":5,"episode_type":"standard","id":1173039,"name":"South Africa's White Lions","overview":"Dominic Monaghan is in South Africa searching for the rarest big cat on the planet: the White Lions of Timbavati. Along the way he chases an impala with a pair of cheetah brothers and secures the blessing of a local tribe.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-09","episode_number":6,"episode_type":"standard","id":1173040,"name":"Sri Lanka's Cunning Cobra","overview":"Dominic Monaghan is in Sri Lanka pursuing the dangerous Indian cobra. On his journey he visits a tea plantation, tries the challenging and uncomfortable task of stilt fishing and climbs the ancient city of Sigiriya Rock.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-16","episode_number":7,"episode_type":"standard","id":1173041,"name":"The Philippines' Real Dragon","overview":"Dominic Monaghan is on the hunt for the flying lizard in the Philippines. He runs into a psychic who predicts his future, crosses the lush \"chocolate hills\" and explores eerie mangroves where he discovers a slimy, local delicacy.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-23","episode_number":8,"episode_type":"standard","id":1173042,"name":"Peru's Electrifying Amazon","overview":"Dominic Monaghan navigates the Amazon River in search of the electric eel. He travels via a giant houseboat, encounters an aggressive primate species called Hellboy Monkey and visits a local shaman to cure a nasty cold.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-01","episode_number":9,"episode_type":"standard","id":1173045,"name":"Getting High in Peru","overview":"Dominic Monaghan climbs the Peruvian Andes to find the Lake Titicaca frog. As he makes this arduous ascent, Dom encounters a condor with a 10-foot wingspan and discovers a community that lives on a floating island made of straw.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-08","episode_number":10,"episode_type":"standard","id":1173043,"name":"Brazil's Brilliant Pantanal","overview":"Dominic Monaghan treks through Brazil's Pantanal in search of a bizarre beast - the giant anteater. En route he witnesses caimans attack their prey and gets caught in an electrical storm while herding cattle.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-15","episode_number":11,"episode_type":"standard","id":1173044,"name":"Bearing Down in Bolivia","overview":"Dominic Monaghan pursues the largest land animal in South America - the Andean bear. He encounters a flamingo lake on the edge of a volcano and takes a quick detour where he finds himself in a wrestling match with female fighters.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-22","episode_number":12,"episode_type":"standard","id":1177470,"name":"Paradise in Palau","overview":"Dominic Monaghan heads to Palau in search of the giant coconut crab, which can literally crack coconuts. He also dives into a lake teeming with millions of jellyfish and enters a cove where a species older than dinosaurs live.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-22","episode_number":13,"episode_type":"finale","id":1178097,"name":"Indonesia Orangutan","overview":"Dom sails through the islands of Indonesia to find one of the most elusive and endangered great apes, the Sumatran orangutan, which shares 96 percent of our DNA but is six to eight times stronger than humans.","production_code":"","runtime":40,"season_number":3,"show_id":49949,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":75046,"poster_path":null,"season_number":3,"vote_average":0}}}