{"adult":false,"backdrop_path":"/94VA7AoSsZhoeBNiylGoEUSSXbw.jpg","created_by":[{"id":1589213,"credit_id":"56e3a8049251416d4000210f","name":"Bill Nuss","gender":2,"profile_path":null}],"episode_run_time":[60],"first_air_date":"1996-03-02","genres":[{"id":18,"name":"Drama"},{"id":10759,"name":"Action & Adventure"},{"id":80,"name":"Crime"},{"id":10768,"name":"War & Politics"}],"homepage":"","id":50,"in_production":false,"languages":["en"],"last_air_date":"2000-04-09","last_episode_to_air":{"id":1291,"name":"S.N.A.F.U.","overview":"While Russ, Bobby, Monica and Jamie are out tracking pot growers in the Santa Monica mountains, Chris Kelly returns to visit a wounded T.C. Callaway, who's fighting addiction to pain pills, as well as kidnap victim Cory McNamara.All hell breaks loose when Chris finds out T.C. slept with her best friend, Cory, and that Cory doesn't know if her pregnancy is the result of Will Blake or T.C. Callaway.  The season-ending cliffhanger occurs when Cory opens the blood test results to find out which one is the father.","vote_average":0,"vote_count":0,"air_date":"2000-04-09","episode_number":22,"episode_type":"finale","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null},"name":"Pacific Blue","next_episode_to_air":null,"networks":[{"id":30,"logo_path":"/g1e0H0Ka97IG5SyInMXdJkHGKiH.png","name":"USA Network","origin_country":"US"}],"number_of_episodes":101,"number_of_seasons":5,"origin_country":["US"],"original_language":"en","original_name":"Pacific Blue","overview":"Pacific Blue is an American crime drama series about a team of police officers with the Santa Monica Police Department who patrolled its beaches on bicycles. The show ran for five seasons on the USA Network, from March 2, 1996 to April 9, 2000, with a total of one hundred and one episodes. Often compared as \"Baywatch on bikes,\" the series enjoyed a popular run among the Network's viewers, and was popular in France, Israel, Sweden, Bulgaria, Norway, Spain, Russia, Austria, Germany, Italy, South America, Canada, Denmark, Poland, and other foreign markets.","popularity":33.336,"poster_path":"/lVyEixUIkSWSuUQ1RO4fQMXcXgB.jpg","production_companies":[{"id":113377,"logo_path":null,"name":"Gary Nardino Productions","origin_country":""}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"1996-03-02","episode_count":13,"id":83,"name":"Season 1","overview":"","poster_path":"/aDZvyMtC4t1dCg1krQsf3pudcMi.jpg","season_number":1,"vote_average":0},{"air_date":"1996-08-17","episode_count":22,"id":82,"name":"Season 2","overview":"","poster_path":"/4ngIUTfqa7RVHlXRqEKCuDLpSd3.jpg","season_number":2,"vote_average":0},{"air_date":"1997-08-03","episode_count":22,"id":81,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"1998-07-26","episode_count":22,"id":84,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"1999-07-18","episode_count":22,"id":80,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5.5,"vote_count":73,"season_data":{"1":{"_id":"5253331719c2957940024034","air_date":"1996-03-02","episodes":[{"air_date":"1996-03-02","episode_number":1,"episode_type":"standard","id":1333,"name":"Pilot","overview":"Ambitious police officer Chris Kelly is introduced to the Bike Patrol after she's transferred from the P.R. Department of the Santa Monica Police Department.  T.C. Callaway, at a crossroads with his long term girlfriend, faces additional family pressure to quit the force and join the family business in Newport Beach.  The entire unit is on the trail of a vicious car-jacker working the beach area.","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":"/etMDjSkbxwBFO5jxtvfBUl6waUq.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5253332a19c2957940024ba2","adult":false,"gender":2,"id":109537,"known_for_department":"Directing","name":"Ralph Hemecker","original_name":"Ralph Hemecker","popularity":1.369,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"59823240c3a3680cc801d127","adult":false,"gender":2,"id":1589213,"known_for_department":"Writing","name":"Bill Nuss","original_name":"Bill Nuss","popularity":2.781,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5253332a19c2957940024aeb","order":512,"adult":false,"gender":2,"id":82775,"known_for_department":"Acting","name":"Micky Dolenz","original_name":"Micky Dolenz","popularity":4.648,"profile_path":"/q8MrC9DUqVBIP8UGeVISQGPkTYX.jpg"},{"character":"","credit_id":"598231c192514151e001b854","order":549,"adult":false,"gender":1,"id":79583,"known_for_department":"Acting","name":"Cindy Ambuehl","original_name":"Cindy Ambuehl","popularity":2.598,"profile_path":null},{"character":"","credit_id":"598231d392514151ae01a81c","order":551,"adult":false,"gender":2,"id":1088201,"known_for_department":"Acting","name":"Billy 'Sly' Williams","original_name":"Billy 'Sly' Williams","popularity":2.45,"profile_path":"/1xd9rnROztH78eaY7dmlo6e4xCr.jpg"},{"character":"","credit_id":"598231e992514151ae01a834","order":552,"adult":false,"gender":2,"id":65831,"known_for_department":"Acting","name":"Robert LaSardo","original_name":"Robert LaSardo","popularity":15.347,"profile_path":"/maezwGo8JUbjECLB6VZJPtGvn1B.jpg"},{"character":"","credit_id":"598231f5c3a3680d3201bdb7","order":553,"adult":false,"gender":2,"id":58924,"known_for_department":"Acting","name":"Clifton Powell","original_name":"Clifton Powell","popularity":21.195,"profile_path":"/9wGVqDcrjpZnwjlnwB45LMbsJSj.jpg"},{"character":"Sheila Silver","credit_id":"5982321ec3a3680d0e0192db","order":554,"adult":false,"gender":1,"id":45379,"known_for_department":"Acting","name":"Shannon Tweed","original_name":"Shannon Tweed","popularity":46.855,"profile_path":"/czrHsEP0hUkhN3D7W90KUa2CUgm.jpg"}]},{"air_date":"1996-03-09","episode_number":2,"episode_type":"standard","id":1334,"name":"First Shoot","overview":"While the Bike Patrol is being used as a CRASH Unit to fight gang activity in the beach area, Cory McNamara is forced to shoot a gangbanger fleeing a crime scene.  When no weapon is found, the incident becomes potential \"\"bad shoot\"\".  The situation is made worse by the fact that Cory is third generation in blue and the \"\"first shoot\"\" has to be a clean one (a police tradition and superstition).  Cory must deal with a disapproving cop father, the gangbanger on the loose, the threat of a sleazy lawsuit against the department, and her potential for lack of nerve on the street.\n\nA brash trouble-making young star comes to the beach to shoot a portion of his feature film, and members of the bike patrol are assigned as liaisons.  Once a sexy idol in the eyes of Chris Kelly, he soon proves his arrogant, wild-man reputation is well earned.  Victor, no fan of the actor, is charmed into playing a small part in the film.\n\nA band of rollerskating pickpockets are working the boardwalk, their spot, dip, h","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":"/6BhkKqDiXZHRs82Xz4uhZdfBRjE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-03-16","episode_number":3,"episode_type":"standard","id":1332,"name":"No Man's Land","overview":"While teaching del Torro to surf, T.C. encounters a band of highly territorial Surf Nazis bullying a Hispanic surfer on the beach.  Operating out of a beach bar decorated with Nazi symbols, the leader of this gang went to law school and is well vested in his rights.  T.C. and Victor, who is Hispanic but doesn't look it, are both goaded into a confrontation that results in T.C.'s suspension.\n\nCory and Victor chase and arrest an irrepressible sixteen-year-old black \"\"tagger\"\" who hits everything from tunnels to buildings to Victor's bicycle seat and the side of the firehouse.  After seeing his home and works of art, Cory realizes the tagger is truly talented and acting out using his painting skills.  Unfortunately, after an encounter in the firehouse cell with the leader of the Surf Nazis, the tagger becomes a target for their terror and must ultimately be saved by our officers.\n\n\"\"The Cove\"\" has long been an illegal nude beach, but election day is fast approaching and a ballot measure may mak","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":"/txltAgVreyKqG0B69LmsYxoULgS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332a19c2957940024aeb","order":512,"adult":false,"gender":2,"id":82775,"known_for_department":"Acting","name":"Micky Dolenz","original_name":"Micky Dolenz","popularity":4.648,"profile_path":"/q8MrC9DUqVBIP8UGeVISQGPkTYX.jpg"}]},{"air_date":"1996-03-23","episode_number":4,"episode_type":"standard","id":1337,"name":"Over the Edge","overview":"After discovering an old best friend, a guy T.C. felt he let down, has died in a suspicious skydiving accident, T.C. insinuates himself into a group of extreme-sport thrill seekers that he believes are behind the \"\"accident\"\".  With T.C. seeking redemption in the world of adrenaline junkies caught up in underwater challenges and mountain bike racing, Lt. Palermo and Chris Kelly are worried just how far T.C. will risk himself to find the killer.  Ultimately T.C. comes to grips with the reality of his own limitations, and brings down the extreme group who are using their mountain bikes to pull off the daredevil robbery of an armored car.\n\nA purse snatching dog is nailing patron after patron on the Venice Boardwalk. The pooch runs up behind women, grabs their purse in his teeth and then flees through alleys and under fences.","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":"/v2RvSkdnxq8zU9JkYBGqN9Rpns0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-03-30","episode_number":5,"episode_type":"standard","id":1339,"name":"Out of the Past","overview":"When a dead woman's body turns up on the beach with an origami angel on her chest, Palermo realizes that the serial killer who left him with a permanent leg injury has returned to the area.  Obsessed with finding the killer, he stays his vacation and bends all the rules to bring down the Angel of Death before he kills again.\n\nThere's been a string of cat burglaries at an upscale hotel that caters to couples having affairs.  Unable to catch the thief by conventional means, T.C. and Chris have to pose as lovers the to catch the elusive bandit.\n\nMariah, the bicyclist who rides faster than the wind, becomes a challenge to T.C. and Victor's egos as neither one of them can catch him after several high speed attempts.","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332c19c2957940024c42","order":505,"adult":false,"gender":2,"id":29712,"known_for_department":"Acting","name":"Tim Thomerson","original_name":"Tim Thomerson","popularity":9.606,"profile_path":"/dCqpmO9nDA07NYSdyQF5JYnmxpL.jpg"},{"character":"","credit_id":"5253332c19c2957940024c7c","order":537,"adult":false,"gender":2,"id":131725,"known_for_department":"Acting","name":"William Lucking","original_name":"William Lucking","popularity":5.987,"profile_path":"/3NLWAxgKYUXvl56x4XworHNer0f.jpg"}]},{"air_date":"1996-04-06","episode_number":6,"episode_type":"standard","id":1338,"name":"Takedown","overview":"While the unit is on the trail of a trio of heavily armed takedown robbers, T.C. finds himself face to face with one of the perps on the roof of a liquor store.  After being ordered to shoot T.C., the young gunman has cold feet and flees.  T.C., realizing his own mortality, becomes obsessed with the case as he spirals into self destructive behavior.  In the final act, our officers get into a high tension situation as two of the heavies try to take a young girl hostage in yet another market.  When T.C. finds himself again confronted by the same young gunman, he has to talk him out of killing a wounded Tony Palermo.\n\nVictor is shocked to discover that the skinny, awkward girl he took to the high school prom and later dumped, has just appeared as the centerfold in a Playboy-like magazine.  He embarks on a personal (and funny) quest to relocate and connect with his old high school sweetheart.\n\nAfter a series of failed relationships, Chris finally meets a man who can deal with the fact that s","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-04-13","episode_number":7,"episode_type":"standard","id":1343,"name":"Heatwave","overview":"A scorching heatwave has descended on the beach and is making everyone crazy.  Palermo has three problems at once:\n\nK.C.B.H. radio is transmitting their summer afternoon show from a storefront on the crowded boardwalk we patrol.  After striking up a friendship with the sexy sex-talk lady D.J., T.C. learns she's being stalked by a crazed listener bent on eliminating men he believes are part of the D.J.'s life.  At odds with the city detective assigned to the case, T.C. ultimately uses himself as a lure (posing as a romantic interest in the D.J.'s life) to capture the bad guy.\n\nCory and Victor are on the trail of the \"\"topless bandit\"\".  Two young women enter banks and jewelry stores at the beach, begin dancing and stripping, while an accomplice commits armed robbery.  No witnesses to the crime can give any description of the robber.\n\nElvis is convinced that a strange series of holes that have appeared at the shore line are the result of aliens trying to make contact with Southern Californian","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-04-20","episode_number":8,"episode_type":"standard","id":1341,"name":"Burnout","overview":"A waitress at Sheila's restaurant, who is also a body builder, seems to be hooked on steroids as she tries to bulk up for competition.  The seller is a vicious body builder himself, out of control due to frequent use of his own product.\n\nAn old Navy buddy of Chris' comes to visit after serving as a fighter pilot in the war in Bosnia.  Their friendship turns to romance, but Chris is disappointed to discover that this officer is not a gentleman.\n\nThere's a battle on the boardwalk between a Korean t-shirt shop owner and the weird homeless man who plays sax in front of his store all day long and only knows one song.","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-04-27","episode_number":9,"episode_type":"standard","id":1335,"name":"Moving Target","overview":"T.C. hooks up with an old flame after the boardwalk cafe where she's working is robbed by a till tapper on rollerblades.Shortly after rekindling their romance, she becomes a witness to a late-night shooting by a mysterious figure in the same cafe. After insisting that only T.C. could be assigned to protect her, the couple have to flee another attempt on her life. When too many loose ends don't add up, Chris becomes suspicious about the young woman's intentions and starts to follow her much to T.C.'s anger. She finally reveals to T.C. that the man trying to kill her is a boyfriend from back east, a criminal who recently committed a large diamond robbery with information he forced her to reveal from her old place of employment. In the end T.C. is shocked to discover that she is not the victim, but rather the co-conspirator in the crime and was using T.C. all along to kill her ex-partner and lover.\n\nAfter Tony Palermo is challenged by obnoxious lifeguard captain Mackie Smith he asks Victor","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332b19c2957940024be1","order":535,"adult":false,"gender":1,"id":146276,"known_for_department":"Acting","name":"Jacqueline Collen","original_name":"Jacqueline Collen","popularity":6.217,"profile_path":"/bjKfUUZIh0NaQqsEIqbZzV4IWgR.jpg"}]},{"air_date":"1996-05-04","episode_number":10,"episode_type":"standard","id":1336,"name":"Captive Audience","overview":"T.C. and Cory find themselves pinned into a bank when a robbery goes wrong and turns into a hostage situation.  Palermo, Victor and Chris arrive on the scene, then must search the beach for an eccentric computer genius who dropped out of this high-tech world and is living in a highly decorated rickshaw on the beach.  Inside the bank, Cory, who is in no hurry to have children herself, must deliver a baby when the hostage takers refuse to release a woman nine months pregnant.","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-05-11","episode_number":11,"episode_type":"standard","id":1340,"name":"The Phoenix","overview":"An arsonist believed to have perished years ago has reappeared in the Venice area.  While working with T.C. on the case, Chris must confront her own childhood memories of terror at having been caught in a fiery situation.  The two must also enlist the aid of an eccentric arsonist doing a long stretch in prison for details on how to catch the Phoenix.\n\nCory has to continually chase the \"\"Snakeman\"\", the last unlicensed vendor on the Venice Boardwalk.  At one point, she nearly traps him running through a wet t-shirt contest where she's thrown on stage, dumped on, and pronounced the winner.\n\nThe precinct is menaced by a rat that's eaten its way into the evidence lock-up and made off with a large portion of speed, making the rodent nearly impossible to catch.  Rat Man and Rat Boy, a father-son exterminating team, are brought in to catch the creature.","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332c19c2957940024cb6","order":513,"adult":false,"gender":2,"id":88950,"known_for_department":"Acting","name":"Joel McKinnon Miller","original_name":"Joel McKinnon Miller","popularity":9.041,"profile_path":"/oSZfZNYkhncAmpCl8wKjK5j5XFk.jpg"}]},{"air_date":"1996-05-18","episode_number":12,"episode_type":"standard","id":1342,"name":"The Big Spin","overview":"The Bike Patrol has a new transferee, Scott Kramer, a ten year veteran and department bad apple who seems to take extreme risks without regard to personal safety. He's teamed with Chris to try and stop a pair of bikers on Harleys who are robbing merchants in the Venice area and fleeing on their choppers. After several near death experiences, we come to realize that the reason this cop is so reckless is that he knows he has less than six months to live and wants to spend that time taking down every last criminal he can. To complicate matters, Chris Kelly develops a crush on this wild loner.\n\nElvis the bike mechanic gets everyone involved in his can't miss lotto scheme, pooling more and more money to the point where greed overcomes friendships among our regulars.","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-05-25","episode_number":13,"episode_type":"finale","id":1344,"name":"All Jammed Up","overview":"A wily bandit on a mountain bike is robbing people stuck in traffic jams at gunpoint and escaping through narrow passage ways on the streets near the beach.\n\nChris and Cory are assigned undercover duty as high priced call girls in order to find an elusive South American gun dealer with a distinctive tattoo on his rear end. To complicate matters, Cory's new boyfriend's upper class parents are staying in the same hotel and the boyfriend has not revealed to them what Cory does for a living.\n\nElvis has a crush on a young woman that works at Helen's Bike Shop and keeps ordering unneeded replacement parts in order to keep seeing her. His hangup is his inability to communicate well in English, so he enlists the aid of T.C. Callaway at the other end of a computer terminal. His dream turns to horror as he finds he can't keep up with the young lover he so desperately pursued.","production_code":"","runtime":60,"season_number":1,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332d19c2957940024d24","order":532,"adult":false,"gender":1,"id":20217,"known_for_department":"Acting","name":"Janet Carroll","original_name":"Janet Carroll","popularity":3.296,"profile_path":"/2HSNIB1kHTlxxQzWySjY0vRH0Me.jpg"},{"character":"","credit_id":"5e8c9e16ad87f700176afb04","order":557,"adult":false,"gender":1,"id":165232,"known_for_department":"Acting","name":"Kathleen McClellan","original_name":"Kathleen McClellan","popularity":1.96,"profile_path":"/yBYWNWthuMpvV5OwidmumX9qJQD.jpg"},{"character":"","credit_id":"641a7dd5a3e4ba00e71e0e8f","order":570,"adult":false,"gender":2,"id":38709,"known_for_department":"Acting","name":"Tom Virtue","original_name":"Tom Virtue","popularity":6.256,"profile_path":"/etCc7aFC9gOzOctFERT7e6qC83C.jpg"}]}],"name":"Season 1","overview":"","id":83,"poster_path":"/aDZvyMtC4t1dCg1krQsf3pudcMi.jpg","season_number":1,"vote_average":0},"2":{"_id":"5253331719c2957940024023","air_date":"1996-08-17","episodes":[{"air_date":"1996-08-17","episode_number":1,"episode_type":"standard","id":1324,"name":"Lights Out","overview":"An anti-technology terrorist is setting bombs around the beach, and will only let T.C. and Victor dismantle them. He wants all power in Santa Monica shut down for twelve hours on the first of the month. An FBI agent comes in to assist the unit, butting heads with Palermo by making Chris his liaison. In the end, it's the Bike Patrol -- and not the FBI -- that discovers the bomber's true plan is to use the blackout to pull a multi-million dollar bank heist. While this is happening, T.C.'s girlfriend Sandy returns to live with him, with the condition that he not tell her anything about his job so she won't worry. But the agreement ends up making things harder on both of them.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-08-24","episode_number":2,"episode_type":"standard","id":1328,"name":"The Daystalker","overview":"T.C.'s girlfriend Sandy is attacked at home by a serial rapist called \"\"The Daystalker\"\". During their investigation, the Bike Patrol must deal with a by-the-book detective who has her own ideas about how the case should be handled. Afraid that the Daystalker will move on to another town before they can catch him, Cory volunteers to act as bait in a trap, just as he crosses over from serial rapist to serial killer.\n\nElvis is hexed by a Rastafarian vendor on the boardwalk. After discovering that Victor is actually responsible for the resulting weird events, Elvis has the hex transferred to Victor.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-09-07","episode_number":3,"episode_type":"standard","id":1323,"name":"Rapscallions","overview":"With help from some skinhead cronies, the new manager for an apartment building on the Venice Boardwalk makes life hell for the tenants. The owner wants to raze the existing building and build high-priced condos. Cory and T.C. are sent to \"\"maintain a presence\"\" to keep the situation from getting out of hand.\n\nOne of the tenants, a former Navy SEAL/ war hero, refuses to budge. Despite constant run-ins with the manager and his gang, he refuses to press charges, making it impossible for T.C. and Cory to make any arrests.\n\nPalermo has woman trouble on two fronts. He's dating a woman several (noticeable) years his junior, which reinforces his fear that he's gotten old. Matters are complicated when his sixteen year-old daughter Jessie unexpectedly shows up to live with him and doesn't take kindly to the new female in his life.\n\nLifeguard captain Mackie Smith is back, challenging the Bike Patrol to a roller-hockey game versus the lifeguards. The lifeguards show up with NHL hockey star Rob Blake p","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-09-14","episode_number":4,"episode_type":"standard","id":1326,"name":"Bangers","overview":"While struggling to save a young teenager, Ricky, from a life of gangbanging, Victor finds himself falling for the boy's spirited older sister, Linda. Just as Victor starts to get through to him, Ricky runs away, convinced Victor's only hanging out with him to get in good with Linda. Victor has to find him before he commits a serious crime which will wed him to the gangbanging life forever.\n\nAt Cory's invitation, Chris agrees to stay at her apartment for a week while hers is being painted. The resulting \"\"Odd Couple\"\" situation almost breaks the friendship.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-09-21","episode_number":5,"episode_type":"standard","id":1321,"name":"Point Blank","overview":"During a fight with an armed robbery suspect, T.C. is knocked out and his gun stolen. T.C. takes it hard, and things get worse when they find the thief...killed by a bullet from T.C.'s gun. The trail of the gun leads to several other crimes, and eventually falls into the hands of a sixteen year-old boy who's being extorted by a group of kids on the boardwalk. Fearing further physical assaults, he's refused to report his bullies to the Bike Patrol. This gun is a way to finally get rid of his tormentors...permanently.\n\nVictor and Chris are approached by an eight year-old boy reporting his dog has been stolen. They don't take the report very seriously, until a partial license plate number is traced to a kennel which supplies dogs to research labs.\n\nAs a practical joke, Cory signs Chris up with a video-dating service. Initially upset, Chris comes to view it as an excellent way to screen thousands of potential boyfriends without the hassle and disappointment of a full-blown first date.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-09-28","episode_number":6,"episode_type":"standard","id":1329,"name":"The Enemy Within","overview":"The Bike Patrol investigates a series of home invasion robberies affecting Asian families. The case is unusual in that the robbers use keys to gain entrance and battery-powered bikes to make their getaway. The unit discovers that the thieves pose as valets at upscale restaurant parking lots to get access to house keys, and that one of the ringleaders has very close ties to one of the victims.\n\nWhen her older brother, Peter, suddenly begins buying luxuries for his family, Cory discovers that he's financing his purchases with money stolen from drug dealers. Her brother promises to stop, but Cory feels he's sullied the honor of being a cop--and his own status as her idolized older brother.\n\nThe Bike Squad brings in a psychic to help them on the home invasion case. Although extremely skeptical at first, Chris comes to believe in his abilities when he correctly predicts her dental trouble.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332919c29579400249dc","order":511,"adult":false,"gender":1,"id":11024,"known_for_department":"Acting","name":"Kelly Hu","original_name":"Kelly Hu","popularity":13.029,"profile_path":"/2s8l6WvXyoDf0RbLeFGZvEclmds.jpg"}]},{"air_date":"1996-10-06","episode_number":7,"episode_type":"standard","id":1320,"name":"Line in the Sand","overview":"Palermo, T.C. and Chris arrest two surfers who assault a kayaker \"\"invading their turf\"\". Out on bail, the surfers begin an ever-accelerating intimidation campaign against the kayaker's girlfriend to keep her from testifying against them in court.\n\nElvis is excited to be invited to a swingers party. The only catch is that he has to bring along a date to \"\"exchange\"\". Chris accepts Elvis' invitation to the supposed Charity Ball, with no idea of what's really in store.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-10-13","episode_number":8,"episode_type":"standard","id":1325,"name":"Undercover","overview":"Against Palermo's wishes, a Lieutenant from Santa Monica Metro sends Chris undercover to catch a man who's laundering money for Latino drug cartels. Chris' job is to hack into his computer and download files for evidence, but after spending time with the enigmatic computer whiz she begins to wonder if her feelings are entirely objective. When he confides to her that he's retiring and invites her to join him on a remote island, Chris finds herself considering the offer.\n\nCory breaks up with yuppie boyfriend Steven, but he begs her to take him back, promising to reform. When she rebuffs him for the last time, he mounts a psychological attack against her and her family, covering his tracks well enough so that Cory can't definitively prove he's the culprit.\n\nT.C. and Victor chase down a group of rollerbladers who are terrorizing boardwalk patrons with paintball guns.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332619c2957940024874","order":516,"adult":false,"gender":2,"id":117474,"known_for_department":"Acting","name":"Scott Plank","original_name":"Scott Plank","popularity":4.543,"profile_path":"/mvij8oEpguAdP7TpLBRahUAzfIU.jpg"}]},{"air_date":"1996-10-20","episode_number":9,"episode_type":"standard","id":1327,"name":"Genuine Heroes","overview":"Texas stick-up artist Jackie Earl Bates arrives in town with girlfriend Erlene Keene. Jackie's told her they've won the lottery, and she's excited to pursue her dream of becoming a centerfold model and television star. Once in Santa Monica, Jackie continues to rob stores, but the Bike Patrol's efforts to catch him are repeatedly thwarted by Tyrone Justice, a bounty hunter who's followed Jackie from Texas.\n\nWhen Cory and Victor discover a couple presumed lost at sea, the event makes the newscasts. MTV-style show \"\"Blast Off\"\" host Ginger Delvecchio sees the report and recruits Victor (and Cory) to provide security on her set against two frat boys trying to steal her bikini top. Later, Cory is disgusted to learn the rescued couple staged their disappearance to reap the monetary benefits of selling their story.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332819c29579400248b4","order":510,"adult":false,"gender":1,"id":131530,"known_for_department":"Acting","name":"Angelica Bridges","original_name":"Angelica Bridges","popularity":6.663,"profile_path":"/A9fSXgefMdDQK1eZUeYOjIXtcAq.jpg"},{"character":"","credit_id":"5253332819c2957940024932","order":538,"adult":false,"gender":2,"id":16119,"known_for_department":"Acting","name":"Charles Napier","original_name":"Charles Napier","popularity":6.281,"profile_path":"/kXenIuk3NWtwihRQIyrqQKf4d2t.jpg"},{"character":"","credit_id":"5253332819c295794002496a","order":546,"adult":false,"gender":2,"id":78463,"known_for_department":"Acting","name":"Gary Graham","original_name":"Gary Graham","popularity":5.316,"profile_path":"/uu3S6uK3mlRyjsabMg1NADuV0Vw.jpg"},{"character":"Jack","credit_id":"554ae10cc3a3685e63000c24","order":548,"adult":false,"gender":2,"id":20386,"known_for_department":"Acting","name":"Jason Behr","original_name":"Jason Behr","popularity":6.116,"profile_path":"/182lEPNJDKIJITUlz8M5KbCI0rK.jpg"}]},{"air_date":"1996-11-03","episode_number":10,"episode_type":"standard","id":1322,"name":"Cranked Up","overview":"The Bike Patrol participates in the \"\"Eco-Relay\"\", an exhausting bike race through the Santa Monica Mountains. Palermo is left behind with the truck as support. While taking a treacherous short cut, Victor's bike is damaged and Chris goes for help alone. In the middle of the forest, she stumbles on a crystal met amphetamine lab and is taken hostage by the \"\"chemists\"\" running the place--including a woman insanely jealous of Chris' affect on \"\"her\"\" men.\n\nWhen Victor and the others attempt a rescue, Cory is shot and all are recaptured. This leaves only Palermo to save his crew and stop the meth shipment from making it to the streets...all without weapons or a working radio.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332619c295794002480a","order":517,"adult":false,"gender":1,"id":121757,"known_for_department":"Acting","name":"Maddie Corman","original_name":"Maddie Corman","popularity":5.525,"profile_path":"/3Qa8GAf7CARtHeLXPX4GdR5ZFhm.jpg"}]},{"air_date":"1996-11-10","episode_number":11,"episode_type":"standard","id":953416,"name":"Deja Vu","overview":"Gene Savage, the \"\"dirty\"\" cop Palermo testified against early in his career, is out of jail and back in business with an arcade on the boardwalk. Savage does everything he can -- including hiring Palermo's girlfriend as a bookkeeper -- to pull Palermo into an altercation, then hands the incriminating security tape over to Internal Affairs. Later, a man is found dead on the beach, and Palermo's back-up revolver, stolen during a robbery, is the murder weapon. A teenage bike thief that T.C. and Victor have been chasing is a witness to the murder, but refuses to cooperate.\n\nA member of a \"\"Good Samaritans\"\" group similar to the \"\"Red Berets\"\" sports a beret and a huge crush on Cory. Despite her warnings against vigilante behavior, he almost gets his partner killed chasing a drug dealer. Cory must find him before he seeks retribution.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-11-17","episode_number":12,"episode_type":"standard","id":953420,"name":"Wheels of Fire","overview":"Two Russian mobsters, ILYA and GYORGI, extort Boardwalk vendors for \"\"protection money,\"\" but the vendors are too intimidated to identify the mobsters to the Bike Patrol. When ED TARLOW, a paraplegic store owner, is attacked, he agrees to testify. Palermo assigns T.C. and Cory to provide protection, but T.C.'s disdain toward Ed's questionable drug background and cop-hating attitude almost blows the case.\n\nChris suspects a trio of karate-trained teenage girls are responsible for several assaults on the beach. One of the girls, CARA, is uncomfortable with their vigilante attacks, but is hesitant to confide in Chris -- until Cara's friends question her loyalty.\n\nVictor's in a bad position when Jessie Palermo asks him about birth control and makes him promise not to tell her father. He takes it upon himself to check out her new boyfriend. When Palermo finds Victor's business card in Jessie's wallet -- along with a condom -- Victor's stuck with his oath to Jessie.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-12-08","episode_number":13,"episode_type":"standard","id":953418,"name":"Outlaw Extreme","overview":"A pair of daredevils pull dangerous, \"\"extreme\"\" stunts around the Boardwalk, hoping to be winners in an on-line contest on the internet. Unknown to Palermo, his daughter, Jessie, is attracted to one of the guys and is videotaping their exploits for the competition.\n\nTwo hijackers sell the goods from stolen trucks to various vendors on the Boardwalk. Chris gets closer to the case than she realizes when unscrupulous jewelry vendor MAHMOOD sells her a stolen watch.\n\nVictor's mother ROSA pays an unexpected visit, frustrating his efforts to get some \"\"quality time\"\" with Linda. When Rosa becomes overly curious --in Victor's opinion -- about Linda's plans for marriage and family, he gets angry. Much to his surprise, Linda then gets angry at him.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1996-12-15","episode_number":14,"episode_type":"standard","id":953415,"name":"One Kiss Goodbye","overview":"While fleeing two thugs, a man falls from his hotel room window and comes to with amnesia, ­ a condition which stifles Chris and Cory's investigation of the incident. As Cory tries to help the victim regain his memory ­ before the gunmen return ­ she finds herself attracted to this mysterious stranger. An attraction which is fully reciprocated.\n\nWhen T.C.'s girlfriend, SANDY, is accepted to a graduate school program in Georgia, she has to decide whether to pursue her dream of becoming a therapist or stay with the man she loves.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-01-05","episode_number":15,"episode_type":"standard","id":953417,"name":"Black Pearl","overview":"A deadly new form of heroin hits the streets of Santa Monica, sending the Bike Patrol into overtime as all hell breaks loose. During the investigation, T.C. falls under the seductive spell of an undercover DEA agent who's investigating one of the drug distributors but has become an addict herself.\n\nVictor is ordered to attend requalifying training on the bike, and much to his horror, his instructor is HANS REY, a former instructor who made his life miserable the first time around. The two engage in a one-upmanship contest, judged by Chris.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-01-12","episode_number":16,"episode_type":"standard","id":953419,"name":"Soft Targets","overview":"An Army veteran, ZACK TORRANCE, holds the beach hostage -- including Victor, Cory and several school children -- to insure that his information about a clandestine Army-sponsored drug operation reaches the public. As T.C. tries to negotiate with Zack, F.B.I. agent FRANKLIN QUILL takes over, and his orders result in Zack's death. Quill turns out to have a secret history with Zack, including a suspected affiliation with the C.I.A.\n\nCory tries to fix up T.C. with her school teacher friend GINA, whose ex-boyfriend DEAN, a lifeguard, isn't ready to give her up. Gina is wounded in the beach shoot-out, and when Dean risks his life to come to her aid, Gina realizes her love for him.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"527144f5760ee37ebb001ac7","order":502,"adult":false,"gender":2,"id":54859,"known_for_department":"Acting","name":"Sherman Howard","original_name":"Sherman Howard","popularity":3.161,"profile_path":"/oaFzlV0kddSSSelh4VSIJaKt7Gf.jpg"}]},{"air_date":"1997-01-19","episode_number":17,"episode_type":"standard","id":953414,"name":"Runaway","overview":"When MAGGIE GARRITY, the attractive director of a local shelter, comes to the Firehouse to report a missing runaway girl, T.C.'s motivation to help is less than altruistic. During their search for the girl, who has fallen in with two thieves, T.C. gets up the nerve to ask Maggie out, only to find out that she's a nun.\n\nVictor borrows Palermo's brand-new, extremely expensive bike, but loses it to a street kid who then delights at eluding him.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-02-23","episode_number":18,"episode_type":"standard","id":953423,"name":"Full Moon","overview":"The investigation of a string of ATM robberies brings T.C. and Chris together on a stakeout -- and closer together in their personal lives. When Palermo finds out that his two officers are romantically involved, T.C. and Chris have to decide whether to break up or transfer out of the Bike Patrol.\n\nPalermo's name turns up in Hollywood madam Laila Stine's \"\"little black book\"\", putting his career on the line. He and Cory discover that Laila padded her book with the names of people in law enforcement, hoping that then no one would come after her for fear of embarrassment.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"6365de34d7107e008d777f39","adult":false,"gender":0,"id":1308689,"known_for_department":"Directing","name":"Scott Lautanen","original_name":"Scott Lautanen","popularity":0.6,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"6365de510d2f530091996f1c","adult":false,"gender":2,"id":3771117,"known_for_department":"Writing","name":"Robert Earll","original_name":"Robert Earll","popularity":0.702,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"6365de621684f7007a9ab47a","adult":false,"gender":2,"id":109538,"known_for_department":"Writing","name":"Richard C. Okie","original_name":"Richard C. Okie","popularity":0.812,"profile_path":null}],"guest_stars":[{"character":"Zandy Mason","credit_id":"5868b9ca9251414e7f009195","order":550,"adult":false,"gender":1,"id":147396,"known_for_department":"Acting","name":"Charlie Spradling","original_name":"Charlie Spradling","popularity":6.441,"profile_path":"/neqwIFjMXisftd8bhrCVXRneF8D.jpg"}]},{"air_date":"1997-03-02","episode_number":19,"episode_type":"standard","id":1330,"name":"Lost and Found","overview":"Chris discovers that Rosey Evans, the friendly girl who serves her coffee every morning, is a runaway living with her boyfriend, who was also her high school teacher. When they bring Rosey into custody and call her father to pick her up, Chris is shocked to discover that Mr. Evans severely beat his daughter, part of the reason that she ran away.\n\nIn exchange for a lighter sentence, a criminal gives Cory some important information: a powerful drug dealer has hired a hitman to kill her brother, Peter McNamara in retribution for strong-arming him when he was a dirty cop. Cory and Peter have to draw the hitman out of hiding and defeat him without alerting anyone on the police force","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332919c2957940024a9a","order":525,"adult":false,"gender":2,"id":35158,"known_for_department":"Acting","name":"John Mariano","original_name":"John Mariano","popularity":3.252,"profile_path":"/WJbEhM4040D2XBb1ko7OHR7t2q.jpg"}]},{"air_date":"1997-04-06","episode_number":20,"episode_type":"standard","id":953421,"name":"Bad Company","overview":"JIMMY GUERRERO, a friend of Victor's, is killed in connection with an underground fighting syndicate, leaving his angry younger brother BILLY seeking revenge. Victor defuses the brother's desire to take revenge himself, convincing Billy to introduce him into the ring as a street fighter so Victor can find his friend's killer.\n\nAn uneasy truce between rival Santa Monica gangs -- a truce that Palermo helped put together -- is in danger of dissolving when SAMMY LUGO makes both leaders believe the other is breaking the peace in an effort to sell weapons to both sides.\n\nElvis goes into hiding when he witnesses Jimmy's beating and the simultaneous gun exchange, but a bad case of claustrophobia makes him an unwelcome houseguest for T.C.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"527144f5760ee37ebb001b43","order":501,"adult":false,"gender":2,"id":22113,"known_for_department":"Acting","name":"Judson Mills","original_name":"Judson Mills","popularity":6.885,"profile_path":"/67hF0Z0FYCXYMhZnUPEOK7Ro27R.jpg"}]},{"air_date":"1997-04-13","episode_number":21,"episode_type":"standard","id":953422,"name":"The Last Ride","overview":"Victor's close childhood friend EMILIO LOPEZ, a troubled kid who grew up to be a troubled adult -- Victor's mother ROSA has always considered him to be a second son. Out on parole, Emilio has taken a job at the local high school, but little does Victor know that Emilio is the leader of a car theft ring that's already left one person dead. Victor has to chase down his own best friend, who is determined not to go back to jail no matter what.\n\nMAHMOOD, sentenced to community service for his illegal activities (detailed in the episode \"\"Outlaw Extreme\"\"), is back at it when he and his \"\"business partner\"\" SARA FARMAN try to sell the Santa Monica Pier to a wise-guy wannabe LENNY STEINRUDER. But Sara takes off with the money, leaving Mahmood to deal with Lenny's anger -- and learning too late that Lenny has familial connections to a New York mafioso known as the \"\"Jewish Godfather.\"\" Cory and Chris reluctantly agree to help him only long enough to arrest Lenny as a way of getting to his father-in-l","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332419c29579400246ee","order":536,"adult":false,"gender":1,"id":46929,"known_for_department":"Acting","name":"Ivonne Coll","original_name":"Ivonne Coll","popularity":6.174,"profile_path":"/7cyzeWeX8zD4IwAUDfyE9BK8woY.jpg"}]},{"air_date":"1997-04-20","episode_number":22,"episode_type":"finale","id":1331,"name":"Rumplestiltskin","overview":"Timothy Stone, the F.B.I. agent who worked with the Bike Patrol on the bombing case in \"\"Lights Out\"\", returns to the Firehouse to get Cory and Chris' assistance in investigating a counterfeit ring operating in Santa Monica. Chris and Cory both find themselves attracted to Agent Stone, but when he and Cory begin a romance, Chris feels betrayed.\n\nThe counterfeiter, Lazlo Parkes-- who the Treasury Department has nicknamed \"\"Rumplestiltskin\"\" -- has been passing off fake $100 bills at Santa Monica hotspots with the help of a trio of women: Bree, Sheila and Lana.  Lazlo is plotting to exchange one million in fake bills for a supply of heroin from drug lord Alejandro Cruz-- a drug deal that Palermo has ordered T.C. and Victor to investigate. Little does Lazlo expect that Bree is plotting with boyfriend Nicky Mink to kill Lazlo and take off with the money... until the other two women discover the plan.","production_code":"","runtime":60,"season_number":2,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":82,"poster_path":"/4ngIUTfqa7RVHlXRqEKCuDLpSd3.jpg","season_number":2,"vote_average":0},"3":{"_id":"5253331719c2957940024015","air_date":"1997-08-03","episodes":[{"air_date":"1997-08-03","episode_number":1,"episode_type":"standard","id":1299,"name":"Inside Straight","overview":"While off-duty, T.C. confronts a man carrying a gun in a parking lot. The man whirls and fires at T.C., T.C. returns fire, killing him, but the man turns out to be an undercover police officer with a spotless record. When an investigation reveals that T.C. didn't identify himself as a police officer when he approached the man, T.C.'s left with suspension and the possibility he's killed a completely innocent man.\n\nT.C.'s brother, TEDDY, has a gambling problem which comes to light when he's accused of masterminding the hold-up of a high-stakes poker game.\n\nChris' building is going condo at the end of the month. She reluctantly accepts Cory's offer to be roommates, remembering that their first roommate experience almost ended in a double homicide... each other.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-08-10","episode_number":2,"episode_type":"standard","id":1298,"name":"Ties That Bind","overview":"A reformed murderer, CONWAY HEINRIKSEN, struggles to rebuild his life after many years in a mental institution, but his past victims are bent on seeing that the killer will never have peace in his life. Cory's friend, BILLIE, finds compassion towards Conway, but her life is in danger when the psychological warfare by the victims takes its toll.\n\nChris' biological father returns to her life after a thirty-year absence, and she struggles with her anger toward him as well as her parents, who told Chris he was dead.\n\nA thief steals Jeff Pierce's valuable pink jersey and T.C. and Victor take road racing lessons from the master to catch the thief.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253331f19c29579400243f7","order":509,"adult":false,"gender":2,"id":2062,"known_for_department":"Acting","name":"Kent McCord","original_name":"Kent McCord","popularity":5.597,"profile_path":"/12izGGcKLSWvsFenB3FVHJjwwP.jpg"}]},{"air_date":"1997-08-17","episode_number":3,"episode_type":"standard","id":1302,"name":"Rave On","overview":"Two young, overprivileged business school grads are holding raves at a Santa Monica warehouse where underage kids have access to drugs and alcohol. Firm in his belief that these kids are the product of irresponsible parents, Palermo questions his own parenting skills when he finds out his daughter JESSIE attends the raves with her best friend. Meanwhile, Victor gets in trouble trying to protect Jessie from getting found out; Chris is slipped a \"\"roofie\"\" by a rave organizer; and T.C.'s declared too \"\"uncool\"\" to work undercover.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"6303dc41fe63fa007f4bb2e2","order":564,"adult":false,"gender":1,"id":180884,"known_for_department":"Acting","name":"Rena Marlette Lesnar","original_name":"Rena Marlette Lesnar","popularity":5.697,"profile_path":"/wrqNL4O3n40ZaXyesB7ieVbMlDD.jpg"},{"character":"","credit_id":"6303dc69fe63fa007a168516","order":565,"adult":false,"gender":1,"id":179586,"known_for_department":"Acting","name":"Shira Scott","original_name":"Shira Scott","popularity":1.205,"profile_path":"/iwv1bt11oboE3ikW0fGz3Y9F2Ft.jpg"},{"character":"","credit_id":"6303dd32fb5299008281dc4d","order":569,"adult":false,"gender":1,"id":81375,"known_for_department":"Acting","name":"Colleen Flynn","original_name":"Colleen Flynn","popularity":5.927,"profile_path":"/nFO6Nn4hatGACowlN2gqGhUXeXh.jpg"}]},{"air_date":"1997-08-24","episode_number":4,"episode_type":"standard","id":1301,"name":"Blood for Blood","overview":"Victor's girlfriend, LINDA, is witness to a murder by a notorious local drug lord who has been arrested several times, but manages to get rid of any witnesses before each trial. Realizing that he'll lose Linda if she goes into witness protection, Victor proposes marriage, even though it would mean saying good-bye to his career, friends and family forever. Ultimately, Victor goes after the drug lord, forcing a final confrontation.\n\nA star rapper is gunned down after a concert where T.C. and Chris are providing security. With the help of Detective BEN \"\"WISHBONE\"\" COLLINS, T.C. and Chris search for the shooter, who turns out to be a psychopath determined to kill one person for each violation of the Ten Commandments. During the investigation, Chris forms a tentative friendship with the rapper's cynical teenage daughter.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-09-07","episode_number":5,"episode_type":"standard","id":1300,"name":"Excessive Force","overview":"A trio of heavily-armed and heavily-armored bank robbers holds up a Santa Monica bank. In the resulting shootout, a security officer is killed and Victor is shot. Victor's injury isn't life-threatening, but it makes him the \"\"butt\"\" of jokes at the Firehouse as he confronts the idea of his own mortality.\n\nChris is targeted for death by one of the robbers seeking vengeance for his gunshot wound. After the failed assassination attempt, Chris spends the night at T.C.'s house, rekindling their buried romance as they try to decide how to deal with those feelings.\n\nPalermo intervenes when he discovers his ex-wife, HELEN, is being physically abused by her current husband, a police officer. Palermo offers Helen the shelter of his home, but that night Jessie catches them making love. When she demands to know if her parents are getting back together, Palermo has to confess the truth -- he doesn't know.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332019c2957940024437","order":526,"adult":false,"gender":2,"id":154133,"known_for_department":"Acting","name":"Dorian Gregory","original_name":"Dorian Gregory","popularity":3.032,"profile_path":"/waRpVruJ2tT8eN8K1jgpXoebD1h.jpg"}]},{"air_date":"1997-09-21","episode_number":6,"episode_type":"standard","id":1307,"name":"Sandman","overview":"T.C. is outraged when \"\"The Sandman\"\", a hitman responsible for the murders of a police informant and an innocent bystander, is released from prison.Against the orders of DEA agent INSPECTOR ENRIGHT (from the episode \"\"Black Pearl\"\"), T.C. trails the Sandman on his own, hoping to catch him committing another crime. Enright finally arrests T.C. for obstruction of justice.  Neither knows that Sandman plans to use T.C. in exacting revenge on the three drug runners who made him take the fall for the informant's murder, and in such a way that he -- the Sandman -- won't even have to pull the trigger...","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332119c2957940024526","order":520,"adult":false,"gender":2,"id":88031,"known_for_department":"Acting","name":"Eddie Velez","original_name":"Eddie Velez","popularity":5.049,"profile_path":"/mnITDWkqvMWFdjtaXItRFKP0rv8.jpg"},{"character":"","credit_id":"5253332119c295794002455a","order":544,"adult":false,"gender":2,"id":13729,"known_for_department":"Acting","name":"Robert Walden","original_name":"Robert Walden","popularity":2.892,"profile_path":"/pCKGiXr9x6LyNiJLvIsS0qvl4w5.jpg"}]},{"air_date":"1997-09-28","episode_number":7,"episode_type":"standard","id":1312,"name":"Repeat Offender","overview":"The truth about Chris' navy career is revealed. Five years ago, Chris trained under a chauvinistic flight instructor CAPTAIN FRANK HAWKINS, whose intentional misinformation caused her to crash her jet. Chris accepted an honorable discharge on the condition that Hawkins never be a flight instructor again. However, Hawkins still is, and a female pilot has just had the same experience as Chris -- except, this time, her co-pilot died. The woman asks Chris to testify on her behalf, bringing up painful memories and fresh anger for Chris as she returns to the Navy base to bring closure to that period of her life.\n\nT.C. and Victor investigate a boardwalk robbery ring in which an attractive woman offers assistance to foreign tourists who are then robbed by the woman's partners. When the robberies turn into murders, T.C. and Palermo go undercover as wealthy -- and outrageously dressed -- foreigners to catch the suspects.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332319c2957940024616","order":515,"adult":false,"gender":2,"id":1205174,"known_for_department":"Acting","name":"Jim Fitzpatrick","original_name":"Jim Fitzpatrick","popularity":2.255,"profile_path":"/kDPq5l24OBOrlce2Xal2GSmSooM.jpg"}]},{"air_date":"1997-10-05","episode_number":8,"episode_type":"standard","id":1305,"name":"Matters of the Heart","overview":"Following a violent robbery at a cafe, the Bike Squad discovers an abandoned baby. In searching for the mother, they find that the child was part of a black market baby-selling scheme. Cory goes undercover as a pregnant woman to find the baby seller, unprepared for the rush of maternal feelings the case will uncover for her.\n\nThe cafe robber is arrested, but dies of a heart attack while in lockup. When it's learned that the robber was also a bike racer taking a powerful \"\"performance-enhancing\"\" drug, T.C. goes undercover to find the sellers, who operate out of a local bike shop, and befriends a guy hooked on the drug.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332019c29579400244a9","order":524,"adult":false,"gender":1,"id":104139,"known_for_department":"Acting","name":"Ahmo Hight","original_name":"Ahmo Hight","popularity":4.632,"profile_path":"/40HcjDfNdpxHCv0jneRiVYVX8QN.jpg"},{"character":"Brian","credit_id":"5a144f3dc3a3684ef300b5db","order":555,"adult":false,"gender":2,"id":17051,"known_for_department":"Acting","name":"James Franco","original_name":"James Franco","popularity":19.165,"profile_path":"/rShzuvrQJJQJ6lXDn3IQX4o0iCE.jpg"}]},{"air_date":"1997-11-02","episode_number":9,"episode_type":"standard","id":1304,"name":"Cop in a Box","overview":"A drug dealer T.C. arrested years ago breaks out of jail and kidnaps T.C., dumping him in a trailer buried in the sand underneath a beach. The convict demands ransom from T.C.'s father (ETHAN) and brother (TEDDY), or else T.C. will die in twelve hours. As the Pacific Blue squad searches frantically for T.C.'s location, T.C. tries to find his own way out of his underground prison before time runs out.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-11-09","episode_number":10,"episode_type":"standard","id":1309,"name":"Only in America","overview":"The wild ass son of a Romanian ambassador commits crimes on the boardwalk, causing a huge headache for the Pacific Blue team because the father's diplomatic immunity extends to his son. The government refuses to help because the ambassador is taking part in a secret sting operation to uncover illegal arms trading. When the son's crimes become serious, Palermo risks defying the government handlers to keep his beach safe.\n\nPalermo befriends a young black guy on the basketball court whom he believes to be an honest, hard-working kid; but discovers his new friend is a former college basketball player who was illiterate, and involved with drugs and point-shaving. When a local college coach asks for Palermo's help in recruiting the guy, Palermo must decide whether the kid's efforts to \"\"turn over a new leaf\"\" and re-enter college with a new identity in order to get a real education are genuine.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332119c29579400245a4","order":504,"adult":false,"gender":1,"id":106728,"known_for_department":"Acting","name":"Marjean Holden","original_name":"Marjean Holden","popularity":6.664,"profile_path":"/psdSq3GOF0pxYu9K8IJD8JfI5q6.jpg"},{"character":"","credit_id":"5253332119c29579400245c6","order":539,"adult":false,"gender":1,"id":43446,"known_for_department":"Acting","name":"Natalie Ramsey","original_name":"Natalie Ramsey","popularity":2.965,"profile_path":"/42kNwZqC0n25A8m0hoIoOrlvlWq.jpg"}]},{"air_date":"1997-11-30","episode_number":11,"episode_type":"standard","id":1311,"name":"Soul Mate","overview":"All the victims of a recent series of murders had earlier placed personal ads in a local paper. Chris and Cory enter the dating pool undercover, and in the course of the investigation, each meets the \"\"perfect\"\" man. When Cory's dream man attacks her (and escapes), Chris assumes her date is safe to pursue a relationship with -- unaware that it is the same man Cory dated, but with a different disguise.\n\nT.C. goes undercover in a wheelchair with ED TARLOW (from \"\"Wheels of Fire\"\"), hoping to catch a thief who is stealing expensive wheelchairs for resale. During his assignment, he discovers the difficulties of the disabled, and meets a \"\"wheelchair groupie\"\" -- a woman who likes T.C. because she thinks he's disabled.\n\nVictor prepares for an upcoming \"\"bachelor auction\"\", secretly concerned that T.C. might receive a higher bid. At the auction, his fears prove unfounded when a third man unexpectedly proves more popular than both of them... Tony Palermo!","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-12-07","episode_number":12,"episode_type":"standard","id":1303,"name":"Sisters","overview":"Cory goes undercover to investigate a Hollywood madam's operation after one of her call girls -- who was blackmailing clients -- washes up on the beach. A Hollywood actress whose estranged sister is also a callgirl demands that Pacific Blue help tear her sister from the madam's clutches.\n\nT.C. and Victor wonder why three kids in succession would try to steal a very ugly brooch from a pawn shop, then discover that the boys are brothers. The father of the boys finally admits he mistakenly pawned his shrewish wife's brooch and sent his kids to steal it when he couldn't afford to buy it back.\n\nT.C. and Chris consummate their romance, but Chris has \"\"morning after\"\" regrets and pushes T.C. away, fearing she will lose her best friend. Eventually, both decide to take the risk and be in love, though secretly.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-12-14","episode_number":13,"episode_type":"standard","id":1308,"name":"Avenging Angels","overview":"After a nightmare in which her dead mother shoots her in the course of arresting a suspect, Cory is injured in a car accident. As she works to rehabilitate her knee, Cory tries to decipher her mother's warning in the dream: \"\"Beware the simple things.\"\" She decides it could be a message to quit the force and become a more well-rounded person.\n\nTwo Korean twins use their flashy martial arts expertise to dispense vigilante justice along the boardwalk, attracting press attention and creating a headache for Pacific Blue. When the bike squad finally catches the twins, the duo reveals they were hoping to attract attention leading to a movie deal. Unfortunately, they've also attracted the attention of a criminal whose plan to distribute counterfeit money on the boardwalk has been scuttled as a result.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1997-12-21","episode_number":14,"episode_type":"standard","id":1310,"name":"With This Ring","overview":"A man is shot point-blank through the heart on the beach. In questioning the man's wife, Pacific Blue learns she hired two women to investigate her husband's suspected infidelities. Believing that the wife ordered her husband killed, Cory and Victor go undercover as a married couple to investigate the private investigators, and find that the women in charge lure men into compromising situations which they then videotape for the wives.\n\nT.C. and his brother TEDDY are shocked when their parents, ETHAN and CATHERINE CALLAWAY, decide to separate after thirty-five years of marriage.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-01-04","episode_number":15,"episode_type":"standard","id":1306,"name":"Heartbeat","overview":"Palermo and Baywatch lifeguard LANI McKENSIE launch M.E.R.I.T. -- a new program putting Paramedic-level care and advanced life-support equipment on the boardwalk alongside the Pacific Blue patrols. One of the paramedics, ALEXA CHOLAK, is Palermo's ex-girlfriend.  During a triage situation at a bombed-out building, Alexa violates protocol and performs CPR on Palermo after he's electrocuted. When another woman dies at the scene from internal injuries, both Alexa's career and the MERIT program are threatened.\n\nT.C. and Chris investigate the president of a radical environmental organization called GreenEarth, whom they suspect in the explosion of an office building which kills the executive of an oil company. Further investigation reveals that a \"\"security officer\"\" at the oil company planted the bomb to frame GreenEarth and get rid of the executive, who was feeding company secrets to GreenEarth personnel.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-01-11","episode_number":16,"episode_type":"standard","id":1315,"name":"Armed and Dangerous","overview":"When JESSIE PALERMO is shot at school, Palermo pulls out all the stops to find out who's dealing the guns to the students. He consults with local gun manufacturer CAVANAUGH, who is mystified that guns without serial numbers could leave his factory. T.C. goes undercover as a substitute teacher at the high school while Chris and Victor go undercover for a sting operation. The squad traces the guns back to the supplier -- KYLE CAVANAUGH, the factory owner's son... and the boyfriend of Jessie's best friend ERICA.\n\nAfter the shooting, Jessie returns to school but continues to suffer emotional turmoil. Her best friend, Erica, doesn't understand and becomes more involved with her boyfriend. Jessie does some investigating into the shooting on her own, but doesn't expect her assailant to be school geek JOSH TIMMONS, who had purchased the gun to ward off bullies.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-01-18","episode_number":17,"episode_type":"standard","id":1318,"name":"Double Lives","overview":"A \"\"posse\"\" of overprivileged teenagers lures men from a gay bar, then beats them up. Pacific Blue investigates, but, despite the evidence, can't convict the kids because the victims -- closet homosexuals in high-level occupations -- refuse to testify. Victor goes undercover at the bar, hoping to be the posse's next victim.\n\nA federal drug case witness Chris helped guard two years ago -- and who she slept with, SEAN McGOVERN -- returns to town. The target of an assassin, he wants Chris' help getting into the Witness Protection Program, even though he skipped out of protective custody two years before and damaged her career as a result. As Chris wrestles with her decision whether or not to help him, she also must deal with T.C.'s jealousy. But the assassin catches up to McGovern... by taking Chris hostage. However, Pacific Blue defeats the assassin in the end, and McGovern's former associate is put behind bars.\n\nThe Pacific Blue team participates in a golf tournament. Chris gets a hole-in-o","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-03-08","episode_number":18,"episode_type":"standard","id":1316,"name":"Caretakers","overview":"Victor and Cory investigate the murder of a drug company vice president who worked with local free clinics to get discounted medicine. They discover that a major pharmaceutical company is distributing inferior imported drugs to local clinics and drugstores that minister to the poor.\n\nAs part of the murder investigation, Chris is forced to question BO NYBY, a conspiracy nutcase who claims to have witnessed the murder. Chris writes off his rantings as delusional, but when Bo is subsequently shot, she feels guilty and undergoes hypnosis to re-examine Bo's statement for telling clues.\n\nVictor's concerned when he learns his mother, ROSA, is consulting DR. JAIME SERRANO for a health problem that she won't tell him about. Jaime is a childhood nemesis of Victor's, and Victor still holds a grudge. He's able to overcome it and is with Rosa when Jaime tells her she has cancer.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332319c29579400246c8","order":522,"adult":false,"gender":2,"id":87028,"known_for_department":"Acting","name":"Rex Smith","original_name":"Rex Smith","popularity":5.253,"profile_path":"/xxwTepFwKpYkJeky40PuxMBcHDl.jpg"},{"character":"","credit_id":"5253332419c29579400246ee","order":536,"adult":false,"gender":1,"id":46929,"known_for_department":"Acting","name":"Ivonne Coll","original_name":"Ivonne Coll","popularity":6.174,"profile_path":"/7cyzeWeX8zD4IwAUDfyE9BK8woY.jpg"},{"character":"","credit_id":"5253332419c295794002471e","order":545,"adult":false,"gender":2,"id":30861,"known_for_department":"Acting","name":"Leslie Jordan","original_name":"Leslie Jordan","popularity":7.949,"profile_path":"/3wEqWsL5ku3Gsn1kZRbJbxGuu6W.jpg"}]},{"air_date":"1998-03-15","episode_number":19,"episode_type":"standard","id":1319,"name":"House Party","overview":"When Chris and Cory apprehend one of the F.B.I.'s Ten Most Wanted, his accomplices seize the Firehouse, taking Chris hostage along with her father BROLIN JORGENSON and civilians. Outside, Palermo, T.C. and Cory plot to free the hostages as Victor, trapped inside during the takedown, secretly works to catch the criminals.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-03-22","episode_number":20,"episode_type":"standard","id":1317,"name":"Heat of the Moment","overview":"Chris is plagued with guilt and self-doubt after failing to apprehend a trio of vicious drug-infested jewelry store robbers. She left what she assumed to be a secure crime scene to give T.C. backup as he pursued a fleeing suspect. But a third robber was hiding, and all three criminals escaped. After a store manager is killed in a subsequent hold-up, Chris wonders if her affair with T.C. is affecting her decision-making skills. In the end, Chris makes a snap decision to stay behind and provide back-up for Palermo when their fellow officers rush to a what they believe is a robbery-in-progress, but which is actually a decoy. The decision saves Palermo's life, renewing Chris' faith in her instincts.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332519c295794002474e","order":523,"adult":false,"gender":2,"id":1212397,"known_for_department":"Acting","name":"Spencer Rochfort","original_name":"Spencer Rochfort","popularity":3.821,"profile_path":"/2dmjUd178d7yyp2p9Ri2VDXOyM1.jpg"},{"character":"","credit_id":"5253332519c2957940024792","order":540,"adult":false,"gender":2,"id":13875,"known_for_department":"Acting","name":"Robert Donner","original_name":"Robert Donner","popularity":5.002,"profile_path":"/f1eVXNa1hCxPhwsl25hZTHo4NPI.jpg"}]},{"air_date":"1998-04-12","episode_number":21,"episode_type":"standard","id":1313,"name":"Till Death Do Us Part","overview":"Pacific Blue tries to figure out why two robbers are holding up a chain of upscale clothing stores since the shops don't carry much cash. In actuality, the store robberies are a cover for FRANK KOVAC, the bodyguard of a prominent businessman (RUDY RIGAS) who has ordered Frank to get back his soon-to-be-ex wife's diamond jewelry. Frank steals the necklace while the wife is shopping at the shop. But Rudy does not know that Frank and his wife plan to double-cross him so that they can run away together.\n\nWhen LINDA DOMINGUEZ, Victor's fiancee, is killed during one of the store robberies, Victor defies department orders and pursues the killers himself. Though the killers are arrested as a result, Victor is suspended and Internal Affairs considers taking away his badge.","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332319c2957940024648","order":507,"adult":false,"gender":2,"id":106178,"known_for_department":"Acting","name":"Dennis Cole","original_name":"Dennis Cole","popularity":5.25,"profile_path":"/bbzEWixYo7OVYLAH2i9CPIoJfOW.jpg"},{"character":"","credit_id":"5253332319c295794002466a","order":543,"adult":false,"gender":2,"id":123333,"known_for_department":"Acting","name":"Rick Hearst","original_name":"Rick Hearst","popularity":1.983,"profile_path":"/vAPHhRuYb5Ko5KfGBjHKOsJOuz1.jpg"}]},{"air_date":"1998-04-19","episode_number":22,"episode_type":"finale","id":1314,"name":"Best Laid Plans","overview":"The squad investigates the \"\"Letterhead Beatings\"\" in which several people have been assaulted, tied to their beds, and the first letter of their last names is carved into their foreheads. Palermo is certain there is a message here, but his inability to solve it in time to prevent further victims compounds his burn-out. When the letters add up to spell A-L-E-R-M-O, the solution appears. Palermo realizes the attacks are personal.\n\nChris and T.C. discover she's pregnant. T.C. proposes marriage, but Chris refuses to \"\"get married at the end of a shotgun.\"\" Each fantasizes about impending parenthood, but just as they're settling into the idea, they learn that Chris is not pregnant after all.\n\nPalermo hosts the daughter of his high school sweetheart, a young aspiring actress. A night of dinner and wine lead to lovemaking... and serious morning-after regrets from Palermo, who is already suffering from a mid-life crisis. This and the Letterhead Beatings make him question his current path in life. A","production_code":"","runtime":60,"season_number":3,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":81,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"5253331719c2957940024048","air_date":"1998-07-26","episodes":[{"air_date":"1998-07-26","episode_number":1,"episode_type":"standard","id":1350,"name":"Glass Houses","overview":"T.C. Callaway marries Chris Kelly in Las Vegas and takes over command of the bike patrol.  After taking Russ Granger and Jamie Strickland, two raw recruits with attitude from the police academy, T.C. co-opts Bobby Cruz, a young Hispanic who has had previous problems with excessive violence while an L.A.P.D. officer, and a young, ambitious, sexy climber named Monica Harper to round out his new young team.\n\nTheir first case takes them undercover to a college campus where a chemistry professor is moonlighting as a manufacturer of methamphetamine and his daughter is involved with students and bikers who are distributing the drugs.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-08-02","episode_number":2,"episode_type":"standard","id":1345,"name":"Treasure Hunt","overview":"After making a rookie error, Jamie Strickland is drowning her sorrows at a local bar where someone slips her G.H.B. She wakes up the following morning with the possibility that she has been date-raped while unconscious. As her roommate, Russ Granger, helps her solve the case and get her badge back, Bobby Cruz is distracted by two shockjock radio talk hosts who have taken an interest in his wild 15 year-old sister, Theresa.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-08-09","episode_number":3,"episode_type":"standard","id":1349,"name":"Seduced","overview":"Russ Granger discovers that his best friend's little sister, Molly, is an underage porn star. After she resists being saved, Jamie goes undercover, hoping to nail the producer.\n\nMonica is offered ten thousand dollars to pose for Playpen Magazine, but only if she recruits the other three women from Pacific Blue. Thinking she has them all, Monica goes ahead and poses very provocatively before learning that the others have declined.\n\nCory informs Doug of her impending pregnancy, but gets a less than enthusiastic response from the father of her child.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-08-16","episode_number":4,"episode_type":"standard","id":1346,"name":"Users","overview":"Jamie goes undercover and befriends a fifteen-year-old snitch after he witnesses a murder. But a rogue Narc is controlling the kid, and is ultimately to blame for his death as well as two dealers.\n\nMonica Harper's sexual involvement with Commander McKinnon escalates. As their on-again, off-again relationship progresses, Bobby Cruz discovers his abusive nature and helps Monica trap McKinnon into backing off.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":"/o7edChE15ef44w4sjpXWUGCzWm7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-08-23","episode_number":5,"episode_type":"standard","id":1347,"name":"Overkill","overview":"Jamie is attracted to a 20 year-old martial artist who saves her from a gang attack. After a series of homicides that Chris is working on, point to the martial artist as a suspect, he commits one last crime and is never heard from again.\n\nRuss and Bobby compete for the affections of a sexy French film star who's being stalked while in Santa Monica to promote her latest movie.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332d19c2957940024d81","order":500,"adult":false,"gender":2,"id":84500,"known_for_department":"Acting","name":"Carl T. Evans","original_name":"Carl T. Evans","popularity":1.429,"profile_path":"/4UkqE9101b9Qsl1ITGxEFkXmegp.jpg"}]},{"air_date":"1998-08-30","episode_number":6,"episode_type":"standard","id":1348,"name":"Silver Dollar","overview":"After a series of college kids are hurt for not paying a bookmaker, Russ goes undercover at Pacific University. His own gambling problems are brought to the front as he gets involved with bookmakers, college-age gamblers and a star basketball player who's tempted to shave points.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-10-04","episode_number":7,"episode_type":"standard","id":1356,"name":"Damaged Goods","overview":"Pacific Blue backs into a college call girl ring after the roommate of the girl Bobby is dating is found dead below a 6th story window. Chris is convinced the death is a homicide. The trail leads to a radical female college professor who preaches hooking as a release for women with abusive backgrounds.\n\nCory McNamara miscarries as a result of stress.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332e19c2957940024ebf","order":506,"adult":false,"gender":1,"id":21596,"known_for_department":"Acting","name":"Shannon Elizabeth","original_name":"Shannon Elizabeth","popularity":19.563,"profile_path":"/NttGD7i2OgoMBZPDmpaSfoUUAm.jpg"}]},{"air_date":"1998-10-11","episode_number":8,"episode_type":"standard","id":1357,"name":"Heat in the Hole","overview":"After a series of murders in a female prison, Chris goes in undercover in chains while Bobby is placed inside as a prison guard. Monica uses the opportunity to tempt T.C., her next door neighbor, into a sexual situation.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332d19c2957940024d81","order":500,"adult":false,"gender":2,"id":84500,"known_for_department":"Acting","name":"Carl T. Evans","original_name":"Carl T. Evans","popularity":1.429,"profile_path":"/4UkqE9101b9Qsl1ITGxEFkXmegp.jpg"}]},{"air_date":"1998-10-18","episode_number":9,"episode_type":"standard","id":1354,"name":"Cutting Edge","overview":"T.C. Callaway befriends Kenny Slaughter, an up and coming champion surfer who is being pressured by Rip Cutter, a ruthless manufacturer of surfboards. Monica, being undercover with T.C., evokes jealousy from Chris, while the others pool their money to see who can bust the dumbest criminal among the mob at the Surf Week.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-11-29","episode_number":10,"episode_type":"standard","id":1353,"name":"Thrill Week","overview":"At Pacific University, a fraternity is holding their annual Thrill Week in a house on the Pacific Blue beach. After a series of incidents, Russ and T.C. are sent in undercover to stop abusive hazing which includes sexual harassment for Bobby's sister, Theresa and other women.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332d19c2957940024e4b","order":533,"adult":false,"gender":1,"id":94023,"known_for_department":"Acting","name":"Amy Weber","original_name":"Amy Weber","popularity":3.972,"profile_path":"/d3CxMAPJN3e7JGtW8NB5QUkhloJ.jpg"}]},{"air_date":"1998-12-06","episode_number":11,"episode_type":"standard","id":1351,"name":"Broken Dreams","overview":"After hitting a deaf person on the boardwalk, Cory is forced into working with Monica, tracking down an illicit ring of deaf beggars, controlled by a ruthless \"\"King.\"\" We discover Monica knows sign language because her mother was deaf.\n\nBobby Cruz is swapped into the horse patrol and pursues a gang of kids terrorizing the boardwalk with a potato cannon.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-12-13","episode_number":12,"episode_type":"standard","id":1355,"name":"Cruz Control","overview":"The woman who is responsible for the deaths of Bobby's parents while she was driving under the influence has returned to Venice Beach. Bobby is convinced she's involved in an illegal smuggling trade and sets out to seek revenge for his parents' deaths.\n\nL.A. pressures Jamie to spy on officers at Pacific Blue by holding over her head a dark secret from her past.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-01-10","episode_number":13,"episode_type":"standard","id":1358,"name":"Save Serenity","overview":"After stopping a late-night robbery in a bar, Victor Del Toro, once a member of the Pacific Blue unit, is on the verge of committing suicide on the Santa Monica pier. He's interrupted by a young woman looking for signatures for a petition to regain custody of her six year old daughter, now in the hands of a rich couple. Victor, in an effort to make up for the death of his fiancÃ©e, promises to capture the child for the mother. He takes advantage of his old friends and breaks numerous laws in his effort to trade his soul for that of the child, all under the suspicious eye of the new Pac Blue recruits.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-01-17","episode_number":14,"episode_type":"standard","id":1352,"name":"Infierno","overview":"While Bobby Cruz is undercover working the door of a trendy nightclub, a rock musician dies on the front steps. Monica Harper joins him undercover, but grows concerned when Bobby discovers that the nefarious club owner's girlfriend is his old flame, singer Rita Bunwell. Things become more complicated as they rekindle their romance under the nose of the dangerous drug-dealing nightclub owner.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253332d19c2957940024e0f","order":518,"adult":false,"gender":1,"id":27995,"known_for_department":"Acting","name":"Barbara Crampton","original_name":"Barbara Crampton","popularity":7.878,"profile_path":"/yXIEQiWM3hhgqmx2bJfRTp9341f.jpg"}]},{"air_date":"1999-01-24","episode_number":15,"episode_type":"standard","id":1359,"name":"Stargazer","overview":"Former \"\"Partridge Family\"\" cast member Danny Bonaduce stars as fallen teen idol JOHNNY OSIRIS, star of a 70's television series, who's now down on his luck and taken to robbing stores on the boardwalk. His fame is rekindled when the media learns that Johnny O has teamed with another criminal. Chris and Cory chase their former teen idol , who is being protected by his television sister (Susan Olsen of the \"\"Brady Bunch\"\"), his record-producer father (Adam West of \"\"Batman\"\") and a high profile defense attorney (Erik Estrada of \"\"CHiPS\"\").","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253333019c2957940024f7b","order":541,"adult":false,"gender":2,"id":26847,"known_for_department":"Acting","name":"Adam West","original_name":"Adam West","popularity":15.175,"profile_path":"/a3Yw8bb6AF7a8Zr7IyEZhZxWVWN.jpg"},{"character":"Steve Gugliermo","credit_id":"5ceab341c3a3685e872168cf","order":556,"adult":false,"gender":2,"id":157004,"known_for_department":"Acting","name":"Noah Blake","original_name":"Noah Blake","popularity":3.986,"profile_path":"/8RECEGsks6xQkzqFHf6vfjlFq7i.jpg"}]},{"air_date":"1999-02-28","episode_number":16,"episode_type":"standard","id":1360,"name":"Juvies","overview":"The return of corrupt SMPD detective PERRY MARCUS, who is again using a band of teenagers to set up high level drug dealers. Among the group of runaways is Jamie Strickland's estranged sister, JENNIE. Jamie confesses that it was she who killed their abusive father before he had a chance to continue his ways with Jennie. All this happens under the watchful eye of Internal Affairs investigator, SUSAN JESSUP, who's long had it in for Jamie Strickland and the Pacific Blue unit.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253333119c2957940024fab","order":521,"adult":false,"gender":2,"id":151070,"known_for_department":"Acting","name":"David Lago","original_name":"David Lago","popularity":1.382,"profile_path":null}]},{"air_date":"1999-03-07","episode_number":17,"episode_type":"standard","id":1366,"name":"Scarlet Rose","overview":"The opening of the Scarlet Rose ballroom, scene of Santa Monica's most notorious murder of the late 40's, piques Bobby's interest when he runs across a young woman at the club who bears a striking resemblance to the Scarlet Rose herself. Amid the background of swing dancing, Bobby discovers this woman is the granddaughter of the slain actress. She's returned to solve the mystery, which involves a precious diamond that's been missing for more than forty years.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253333419c29579400252a5","order":508,"adult":false,"gender":2,"id":1212003,"known_for_department":"Acting","name":"Ricky Paull Goldin","original_name":"Ricky Paull Goldin","popularity":2.447,"profile_path":"/ekZNTYJ2mWCXD2CTi0DDjXZNDYT.jpg"},{"character":"Ray","credit_id":"6129f8c90d9f5a002c540003","order":558,"adult":false,"gender":2,"id":2546507,"known_for_department":"Production","name":"Dave Oliver","original_name":"Dave Oliver","popularity":0.98,"profile_path":null}]},{"air_date":"1999-03-21","episode_number":18,"episode_type":"standard","id":1365,"name":"Thicker Than Water","overview":"After a young Mafia lawyer and his wife are murdered in their home, Cory catches up with the unharmed six year old boy who's on the run with his real mother, a stripper with whom the Mafia lawyer had a previous affair. Cory is reluctant to bring the pair to the authorities after she learns that the FBI agent working the case is actually the man that the boy identified as the killer who came to their home.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5253331c19c295794002425d","adult":false,"gender":0,"id":1212393,"known_for_department":"Directing","name":"Scott Lautanen","original_name":"Scott Lautanen","popularity":2.528,"profile_path":null},{"department":"Writing","job":"Writer","credit_id":"5253331e19c29579400242bf","adult":false,"gender":1,"id":1212394,"known_for_department":"Writing","name":"Emily Skopov","original_name":"Emily Skopov","popularity":1.166,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5253333419c295794002526b","order":534,"adult":false,"gender":2,"id":104504,"known_for_department":"Acting","name":"John Aprea","original_name":"John Aprea","popularity":6.312,"profile_path":"/hZ8Wlv3WaRMqNrRtWZBkw4lcjJj.jpg"}]},{"air_date":"1999-04-04","episode_number":19,"episode_type":"standard","id":1363,"name":"Near Death","overview":"A near death experience changes T.C.'s perspective on life after he comes face to face with ruthless home invaders.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253333319c2957940025221","order":527,"adult":false,"gender":2,"id":84163,"known_for_department":"Acting","name":"Matt Borlenghi","original_name":"Matt Borlenghi","popularity":7.376,"profile_path":"/5cxI8zKxxH75SQRTAcaQMCYDr4i.jpg"}]},{"air_date":"1999-04-11","episode_number":20,"episode_type":"standard","id":1362,"name":"Trust","overview":"After an old high school girl friend of Cory's is murdered upon her return to Santa Monica, Cory and the Pacific Blue unit are on the trail of her stalker boyfriend, with the aid of an FBI profiler. Cory is attracted to the FBI agent as they work together on the case, navigating twists and turns that eventually place Cory in extreme jeopardy. Russ Granger, meanwhile, has used his Intel video camera to contact a potential lover, \"\"Cybervixen,\"\" on the Internet and is making plans to meet her in person.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-04-18","episode_number":21,"episode_type":"standard","id":1361,"name":"Lucky 13","overview":"The worlds of black and white magic collide after a young girl disappears from the boardwalk. Russ and Jamie enter the world of the occult and have sex after falling under the spell of the dark side.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253333219c2957940024ff9","order":542,"adult":false,"gender":1,"id":99206,"known_for_department":"Acting","name":"JoAnna Garcia","original_name":"JoAnna Garcia","popularity":19.84,"profile_path":"/rlaDa8MgZbuLCn1So6H7Ff8Pa0c.jpg"},{"character":"","credit_id":"56b657f8c3a36806fc0099da","order":547,"adult":false,"gender":1,"id":149837,"known_for_department":"Acting","name":"Courtnee Draper","original_name":"Courtnee Draper","popularity":2.859,"profile_path":"/a56BUmpffz2jnhYskv8QRMizO4G.jpg"},{"character":"Sherry Drake","credit_id":"6186bc2569d280002b415b87","order":559,"adult":false,"gender":1,"id":1012982,"known_for_department":"Acting","name":"Amy Lindsay","original_name":"Amy Lindsay","popularity":10.561,"profile_path":"/qkpyO9yWNpfuDkglZudxBuKJgZl.jpg"}]},{"air_date":"1999-04-25","episode_number":22,"episode_type":"finale","id":1364,"name":"The Right Thing (1)","overview":"After a high profile Hispanic leader, JOHN PATRONE, who is trying to bring an end to warring gang factions in Santa Monica is slain by a snipers bullet, our young recruits finds the main suspect is a likeable motorcycle mechanic whose daughter committed suicide a year before. When it is learned she was pregnant by PATRONE, and that he was involved in drug dealing and gun running, it appears that this good citizen took the law into his own hands to bring the man down. By episode's end, Bobby Cruz is arrested for concealing evidence and the three other new Pacific Blue cops are under arrest as well.\n\nCannon Boy, a teenager obsessed with firing himself from a cannon, is pursued on the beach.","production_code":"","runtime":60,"season_number":4,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":84,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"5253331719c2957940024005","air_date":"1999-07-18","episodes":[{"air_date":"1999-07-18","episode_number":1,"episode_type":"standard","id":1277,"name":"Reckoning (2)","overview":"Pacific Blue's season opener picks up from the cliffhanger season-ender, \"\"The Right Thing,\"\" in which Bobby Cruz and the three other rookie cops were arrested for withholding evidence in the murder of gang conciliator, JOHN PATRONE.\n\nThe entire unit is pressured by IA officer SUSAN JESSUP, as BRUCE BEST is tried for the killing with Bobby Cruz as an accessory before Santa Monica's notorious hanging judge, J. GUNNAR HALLORAN.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253331919c2957940024098","order":528,"adult":false,"gender":1,"id":84894,"known_for_department":"Acting","name":"Michelle Clunie","original_name":"Michelle Clunie","popularity":4.803,"profile_path":"/2ufYSKtGj4smn6hBtQO1Uu81er2.jpg"}]},{"air_date":"1999-07-25","episode_number":2,"episode_type":"standard","id":1278,"name":"Naked Truth","overview":"After a sorority girl turns up dead, Monica and Chris go undercover at a very select sorority at Pacific University. Harper discovers that freshman pledges are being forced to strip at a local nightclub as part of their initiation, but then are being blackmailed to continue their activities or risk exposure to their parents and on the internet.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253331919c29579400240d6","order":529,"adult":false,"gender":1,"id":60953,"known_for_department":"Acting","name":"Erinn Bartlett","original_name":"Erinn Bartlett","popularity":5.902,"profile_path":"/hCxJwxvX1JufVlZOjokIHABcpNd.jpg"}]},{"air_date":"1999-08-01","episode_number":3,"episode_type":"standard","id":1276,"name":"Blue Hawaii (1)","overview":"While in Waikiki to train the Honolulu bike patrol, Bobby Cruz (Mario Lopez) and Russ Granger (Jeff Stearns) back into an undercover case when they are mistaken for buyers in a large scale drug smuggling operation. They team up with four young, hip undercover officers in Honolulu to bust a ring working out of a surf shop.\n\nCruz winds up falling for CLAIRE KEENE, one of the young undercover officers, and considers transferring to Hawaii, while she considers transferring to the mainland. Granger gets involved with a gorgeous, young exotic dancer who is thinking of moving to Japan to continue her trade.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5253331919c295794002406a","adult":false,"gender":2,"id":1212392,"known_for_department":"Directing","name":"Michael Levine","original_name":"Michael Levine","popularity":2.183,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-08-08","episode_number":4,"episode_type":"standard","id":1279,"name":"Blue Hawaii (2)","overview":"While in Waikiki to train the Honolulu bike patrol, Bobby Cruz (Mario Lopez) and Russ Granger (Jeff Stearns) back into an undercover case when they are mistaken for buyers in a large scale drug smuggling operation. They team up with four young, hip undercover officers in Honolulu to bust a ring working out of a surf shop.\n\nCruz winds up falling for CLAIRE KEENE, one of the young undercover officers, and considers transferring to Hawaii, while she considers transferring to the mainland. Granger gets involved with a gorgeous, young exotic dancer who is thinking of moving to Japan to continue her trade.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5253331919c295794002406a","adult":false,"gender":2,"id":1212392,"known_for_department":"Directing","name":"Michael Levine","original_name":"Michael Levine","popularity":2.183,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-08-15","episode_number":5,"episode_type":"standard","id":1281,"name":"Silicon Valley of the Dolls","overview":"A doctor running an underground clinic for plastic surgery causes the death of a young co-ed. The world of high school girls obsessed with plastic surgery is explored when Russ Granger and Monica Harper go undercover. Struck by the beautiful perfection of the students, Monica and Granger learn that their boyfriends have been financing plastic surgery by stealing cars.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-08-22","episode_number":6,"episode_type":"standard","id":1280,"name":"Hostile Witness","overview":"Granger and Cruz are sent to Ventura County on a seemingly simple case to return a witness to a murder trial in Santa Monica. The wild young woman makes their life miserable, escaping numerous times, and causing them to miss their date with two gorgeous women headed for Catalina.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5253331919c295794002406a","adult":false,"gender":2,"id":1212392,"known_for_department":"Directing","name":"Michael Levine","original_name":"Michael Levine","popularity":2.183,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-08-29","episode_number":7,"episode_type":"standard","id":1282,"name":"Dead Ringers","overview":"A pair of twins are killing people who rub them the wrong way. One of their victims is a Federal Witness, which brings an FBI agent, who thinks that one of the people he testified against lashed back. Chris finds herself fascinated with the case, which causes more friction between her and T.C. Chris suspects that they have a serial killer and the agent is impressed with her, that she requests that Chris help her, which makes T.C. unhappy. When a person who saw the twins in one of their moods tries to call Chris but is not around so T.C. takes the call. The twins kills him and when T.C. arrives they tell him that the one who called him went away. Bobby who thinks that something is wrong and who thinks that T.C. is letting his problems with Chris cloud his judgement, tells the FBI agent about the twins and the agent says that it's been theorized that the killer is  nore than one person, and the twins could be it. One of the twins lures Chris into a trap but Chris escapes and when one of","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-10-03","episode_number":8,"episode_type":"standard","id":1287,"name":"Just a Gigolo","overview":"After saving a woman who was about to kill herself, Granger learns that she's being blackmailed by a male escort service she used. While she won't testify, she tells him that they pose as auto servicemen. Granger and Cruz convince Cory to let them work undercover. They find out that one of the men who work there has a record and convince him to introduce them to the boss. The boss gives them a job. Cruz learns that one of the guys wants to leave and open his own escort business. The woman who saved takes a liking to him so much that she is practically splurging on him. When the boss catches the guy who wants to leave, stealing the client list, he kills him. When Granger and Cruz can't get anything on the operation, Cory wants to pull the plug. But they convince her to be the next mark. She goes to the service center, hoping to snag the boss but the boss sends Granger instead. While having dinner, the woman who like Granger sees them and blows his cover. The guys then grab her and Cory","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5253331c19c295794002425d","adult":false,"gender":0,"id":1212393,"known_for_department":"Directing","name":"Scott Lautanen","original_name":"Scott Lautanen","popularity":2.528,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5253331b19c2957940024239","order":519,"adult":false,"gender":1,"id":21858,"known_for_department":"Acting","name":"Krista Allen","original_name":"Krista Allen","popularity":41.772,"profile_path":"/dzSpRWvCr2XLkVUclv3OSXNe8wg.jpg"}]},{"air_date":"1999-10-10","episode_number":9,"episode_type":"standard","id":1289,"name":"Big Girls Don't Cry","overview":"A female boxer dies after an exhibition match. Cory decides to investigate but the new D.A. whom she is attrracted to, is concerned that she might not handle it properly. So he calls T.C. who has depressed ever since Chris left, to come back and he does, which doesn't make Cory happy. She Strickland and Cruz undercover as a boxer and her handler. They discover that the bottle the girl drank from was poisoned and has the fingerprints of Mia St. John on it. They bring her in for questioning and learn that the water bottle is hers and suspect that maybe she was the target. Strickland then meets Joey another boxer who feels that she is being passed over because she is not as attractive as the others. They then learn that Rick who manages Joey was once involved with Mia both personally and professionally. When they try to bring him in he runs away, they manage to catch him, and they grill him about trying to kill Mia but realize that he gave the bottle to the other girl. Cory decides to han","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5253331e19c29579400242bf","adult":false,"gender":1,"id":1212394,"known_for_department":"Writing","name":"Emily Skopov","original_name":"Emily Skopov","popularity":1.166,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-10-17","episode_number":10,"episode_type":"standard","id":1290,"name":"Gaslight","overview":"While working on a Haitian whom they suspect is smuggling in drugs Bobby sees a man whom he arrested a few years ago who is still in prison.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5253331c19c295794002425d","adult":false,"gender":0,"id":1212393,"known_for_department":"Directing","name":"Scott Lautanen","original_name":"Scott Lautanen","popularity":2.528,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-10-31","episode_number":11,"episode_type":"standard","id":1286,"name":"Ghost Town","overview":"Jamie who was about to go on vacation encounters a singer whose songs gave inspiration and hope when she was incarcerated. After finding her passed out Jamie brings her home. When she comes to she grabs Jamie's gun and tells her to stay away and she then leaves. Jamie needing to find her and her gun tracks her down to her mother's house. She finds her and upon convincing her that she only wants to help her, the singer tells her that she is down and outr because of her record producer. It seems that he is crooked; he takes very large cuts and when someone wants to leave he threatens them, which is what he did to her. Jamie tries to convince Cory that her claims have to be investigated, but Cory saying that this is not a criminal matter declines so Jamie decides to do it on her own. With Monica's help and one of the singers unpublished songs they try to goad the producer into doing something. He then sends his man to get the singer but Jamie saves her. Later Jamie gets the singer a gig o","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5253331a19c295794002418f","adult":false,"gender":2,"id":160124,"known_for_department":"Writing","name":"Paul Brown","original_name":"Paul Brown","popularity":1.519,"profile_path":null},{"department":"Directing","job":"Director","credit_id":"5253331b19c29579400241ed","adult":false,"gender":2,"id":160124,"known_for_department":"Writing","name":"Paul Brown","original_name":"Paul Brown","popularity":1.519,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5253331a19c29579400241c5","order":530,"adult":false,"gender":1,"id":93527,"known_for_department":"Acting","name":"Kelly Rowland","original_name":"Kelly Rowland","popularity":11.095,"profile_path":"/xBBhuEmno3vygtdpnL5D6MtOKmo.jpg"}]},{"air_date":"1999-12-05","episode_number":12,"episode_type":"standard","id":1285,"name":"God's Gift","overview":"Jamie Strickland and Cory McNamara go undercover in a sex cult operation. The master is very seductive and has convinced women to prostitute themselves in the name of God.\n\nMeanwhile Russ Granger and Monica Harper are on rollerblades trying to catch criminals.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":"/1AnvnauXg6wCqRII9tauRIbjT7e.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5253331a19c295794002418f","adult":false,"gender":2,"id":160124,"known_for_department":"Writing","name":"Paul Brown","original_name":"Paul Brown","popularity":1.519,"profile_path":null}],"guest_stars":[]},{"air_date":"1999-12-19","episode_number":13,"episode_type":"standard","id":1288,"name":"Swimming in the Dead Pool","overview":"A controversial and outspoken attorney, whose specialty is suing the police department; presently he has a wrongful death suit against them over the death of a young (black) man, whose death he believes was cause by the actions of the two policemen who were pursuing him. He then announces that he has found a witness, who will prove that he is right but he won't name the witness right now. Later at his apartment, someone knocks on the door and shoots him. When the department hears of this, the Chief, who is afraid that the press will assume that a cop is the killer, decides to let the Pacific Blue unit handle the investigation. Cory decides to first look into the possibility that this was the act of a scorned lover or wife, because the way the place was set up, it appears that he was expecting someone. Cory then learns that, that person is his assistant, so Cory goes to her place and finds the murder weapon. She says that she didn't do it and Cory thinks that she is innocent. Cory then","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253331c19c295794002428d","order":514,"adult":false,"gender":2,"id":105620,"known_for_department":"Acting","name":"Ben Murphy","original_name":"Ben Murphy","popularity":7.918,"profile_path":"/cOfXJVtl7Ji0tm5rUBwX2QGpMbR.jpg"}]},{"air_date":"2000-02-06","episode_number":14,"episode_type":"standard","id":1283,"name":"Double Vision","overview":"A female radio talk show host witnesses a murder on her way home. As the killers are about to shoot her too, TC saves her life. But the flash from his gun blinds the woman. TC becomes obsessed with protecting her due to his guilt and her resemblance to the love of his life, Chris Kelly. The woman doesn't know he's the one who robbed her from her sight, she just thinks he's a caring cop. This leads to a romans. But after a while the womans sight beings to return.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5253331919c295794002406a","adult":false,"gender":2,"id":1212392,"known_for_department":"Directing","name":"Michael Levine","original_name":"Michael Levine","popularity":2.183,"profile_path":null}],"guest_stars":[]},{"air_date":"2000-02-13","episode_number":15,"episode_type":"standard","id":1284,"name":"Kangaroo Court","overview":"Jamie's sister Jennie returns to Santa Monica, but is kidnapped by young juveniles. The guy Jamie is dating is somehow involved, also the dirty narc Detective Perry Marcus.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"5253331919c295794002406a","adult":false,"gender":2,"id":1212392,"known_for_department":"Directing","name":"Michael Levine","original_name":"Michael Levine","popularity":2.183,"profile_path":null}],"guest_stars":[]},{"air_date":"2000-02-20","episode_number":16,"episode_type":"standard","id":1293,"name":"A Thousand Words","overview":"Russ and Cory go undercover in the ugly, violent world of the Nazis, trying to catch the killers of several African-American and Mexican young men.    Jamie goes undercover and tries to protect a young boy, a very talented photographer, who has captured a meeting between two powerful adversaries.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253331e19c2957940024337","order":503,"adult":false,"gender":2,"id":1003386,"known_for_department":"Acting","name":"Sam Jones","original_name":"Sam Jones","popularity":2.779,"profile_path":"/cVZID4xSO9HqgE0Js0F86e8udzH.jpg"}]},{"air_date":"2000-02-27","episode_number":17,"episode_type":"standard","id":1296,"name":"Fifty-Nine Minutes","overview":"When a pretty 15 year old girl is kidnapped from a shopping mall parking lot, Cory and the rest of the unit must band together to find her within 59 minutes. The officers must deal with the hysterical mother and false leads before their 59 minutes is up.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253331f19c29579400243b1","order":531,"adult":false,"gender":1,"id":51536,"known_for_department":"Acting","name":"Agnes Bruckner","original_name":"Agnes Bruckner","popularity":12.988,"profile_path":"/n9bglCZa1Qv9cYbP8f7hg32YciH.jpg"},{"character":"","credit_id":"6303dc27e860170079b885d1","order":562,"adult":false,"gender":1,"id":20354,"known_for_department":"Acting","name":"Amber Tamblyn","original_name":"Amber Tamblyn","popularity":13.265,"profile_path":"/bzw0lxvtbEnYT7fZ8fn6NeSzMn9.jpg"},{"character":"","credit_id":"6303dc30fb5299007a76e123","order":563,"adult":false,"gender":1,"id":2552260,"known_for_department":"Acting","name":"Marlene Brehm","original_name":"Marlene Brehm","popularity":1.932,"profile_path":null}]},{"air_date":"2000-03-05","episode_number":18,"episode_type":"standard","id":1297,"name":"Disrobed","overview":"After Russ and Bobby arrest a murder suspect, the trial lands before hanging Judge J. Gunnar Halloran.  After tossing the weapon because of an illegal search, the heat is turned up on Bobby and Russ, who are accused of planting evidence.  The case is further hampered by the fact that Judge Halloran has fallen in love with the exotic dancer sent to blackmail him into releasing the defendant.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"641a7dd5a3e4ba00e71e0e8f","order":570,"adult":false,"gender":2,"id":38709,"known_for_department":"Acting","name":"Tom Virtue","original_name":"Tom Virtue","popularity":6.256,"profile_path":"/etCc7aFC9gOzOctFERT7e6qC83C.jpg"}]},{"air_date":"2000-03-12","episode_number":19,"episode_type":"standard","id":1294,"name":"Betrayal","overview":"Bobby Cruz' sister, Teresa, witnesses the suicide of a high school classmate and begins to fall under the spell of the girl's manipulative boyfriend.\n\nAn ambitious rookie cop, recently assigned to Pacific Blue, turns out to be a spy for Internal Affairs. Things get complicated when he's let into the young Pac Blue officers' scheme to frame a ruthless drug dealer.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"6303dbd7ac8e6b007d2648a3","order":560,"adult":false,"gender":2,"id":90576,"known_for_department":"Acting","name":"Jeff Branson","original_name":"Jeff Branson","popularity":5.153,"profile_path":"/90EYPrS0gW1mXGUtKkjBci9zmh3.jpg"},{"character":"","credit_id":"6303dbe095acf0007b8d85af","order":561,"adult":false,"gender":1,"id":6240,"known_for_department":"Acting","name":"Mariska Hargitay","original_name":"Mariska Hargitay","popularity":19.479,"profile_path":"/dQTXg59BAmEH6iUHQ3XUjg7drtd.jpg"}]},{"air_date":"2000-03-19","episode_number":20,"episode_type":"standard","id":1295,"name":"Kidnapped","overview":"Cory learns she is pregnant, but is unsure whether the father is T.C. Callaway, a one night stand, or Will Blake, her District Attorney boyfriend. Before she can tell either one the story, she's kidnapped by two jewel thieves who offer to let her go in exchange for the release from jail of their ace safecracker.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"6303dcb47d41aa007e395f21","order":566,"adult":false,"gender":2,"id":1195491,"known_for_department":"Acting","name":"Sean Waltman","original_name":"Sean Waltman","popularity":3.94,"profile_path":"/9V9kDnyqJfz0DJjVRdq63x5cho3.jpg"},{"character":"","credit_id":"6303dcbd839d93008b61d5fc","order":567,"adult":false,"gender":2,"id":568587,"known_for_department":"Acting","name":"Rick Rood","original_name":"Rick Rood","popularity":1.926,"profile_path":"/pcwDFX5G5NiZGImeOzOPAOFGuuq.jpg"},{"character":"","credit_id":"6303dccfdfe31d007b831638","order":568,"adult":false,"gender":1,"id":1381798,"known_for_department":"Acting","name":"Jodi Larratt","original_name":"Jodi Larratt","popularity":14.216,"profile_path":"/lGOa98ZAvmIENEzIpzBmoFoCacD.jpg"}]},{"air_date":"2000-04-02","episode_number":21,"episode_type":"standard","id":1292,"name":"Blind Eye","overview":"T.C., now hooked on painkillers from being shot in the leg, leads Pacific Blue on the trail of a potential serial killer who preys on young runaways that he locates via the Internet.\n\nCory and Monica convince a woman psychic, who used to help the police back East, into helping on the case.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5253331e19c29579400242bf","adult":false,"gender":1,"id":1212394,"known_for_department":"Writing","name":"Emily Skopov","original_name":"Emily Skopov","popularity":1.166,"profile_path":null}],"guest_stars":[]},{"air_date":"2000-04-09","episode_number":22,"episode_type":"finale","id":1291,"name":"S.N.A.F.U.","overview":"While Russ, Bobby, Monica and Jamie are out tracking pot growers in the Santa Monica mountains, Chris Kelly returns to visit a wounded T.C. Callaway, who's fighting addiction to pain pills, as well as kidnap victim Cory McNamara.All hell breaks loose when Chris finds out T.C. slept with her best friend, Cory, and that Cory doesn't know if her pregnancy is the result of Will Blake or T.C. Callaway.  The season-ending cliffhanger occurs when Cory opens the blood test results to find out which one is the father.","production_code":"","runtime":60,"season_number":5,"show_id":50,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"6303dc41fe63fa007f4bb2e2","order":564,"adult":false,"gender":1,"id":180884,"known_for_department":"Acting","name":"Rena Marlette Lesnar","original_name":"Rena Marlette Lesnar","popularity":8.323,"profile_path":"/wrqNL4O3n40ZaXyesB7ieVbMlDD.jpg"},{"character":"","credit_id":"6303dc69fe63fa007a168516","order":565,"adult":false,"gender":1,"id":179586,"known_for_department":"Acting","name":"Shira Scott","original_name":"Shira Scott","popularity":2.009,"profile_path":"/iwv1bt11oboE3ikW0fGz3Y9F2Ft.jpg"}]}],"name":"Season 5","overview":"","id":80,"poster_path":null,"season_number":5,"vote_average":0}}}