{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[30],"first_air_date":"2004-09-11","genres":[{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"}],"homepage":"","id":5197,"in_production":false,"languages":["en"],"last_air_date":"2005-01-04","last_episode_to_air":{"id":354289,"name":"Crack of Doom","overview":"Rusty threatens to blow up the town, and to get Zeroman's attention, he kidnaps Sally.","vote_average":0,"vote_count":0,"air_date":"2005-01-04","episode_number":13,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null},"name":"Zeroman","next_episode_to_air":null,"networks":[{"id":83,"logo_path":"/mE2ElX5BSeUhiT3V8qUhLjd3Nbz.png","name":"Teletoon","origin_country":"CA"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["CA"],"original_language":"en","original_name":"Zeroman","overview":"Zeroman is a Canadian animated television series that aired on the Canadian cartoon network Teletoon and on Télétoon. It tells the adventures of incompetent sixty-six-year-old postman Les Mutton who also happens to be the superhero known as Zeroman. As Zeroman, Les fights the crime that plagues Fair City in a similar fashion to Nielsen's Lieutenant Frank Drebin character in the Naked Gun series. Although a second season was once announced as in production, the death of Leslie Nielsen guaranteed that another season will not happen.","popularity":2.501,"poster_path":"/7CWjmadGMgdWPeLxQVSYKOy2JNQ.jpg","production_companies":[{"id":73474,"logo_path":null,"name":"Amberwood Entertainment","origin_country":""}],"production_countries":[],"seasons":[{"air_date":"2004-09-11","episode_count":13,"id":15082,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":1,"vote_count":1,"season_data":{"1":{"_id":"52577e5c760ee36aaa5b6ffa","air_date":"2004-09-11","episodes":[{"air_date":"2004-09-11","episode_number":1,"episode_type":"standard","id":354278,"name":"Smotherly Love","overview":"Having fallen prey to an evil trap set by Rusty, Zeroman's greatest weakness is exposed; anti-static sheets.  These clingy items wreak havoc on Zeroman's Supersuit causing his powers to fail him and run amok. Severely weakened, Zeroman manages to escape but eventually collapses on a random citizen's doorstep.  It turns out to be his own home and Jaundice Mutton, Zeroman's Number 1 Obsessed Fan, takes in her hero, vowing to nurse him back to health.","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-12","episode_number":2,"episode_type":"standard","id":354280,"name":"Hamsassin","overview":"In another of Rusty's diabolical plots to ruin Zeroman and simultaneously return to TV fame, he kidnaps famous hamster actor Sammy Hamster and trains him to attack Zeroman.","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-19","episode_number":3,"episode_type":"standard","id":354279,"name":"Supersuit and Ty Required","overview":"After shooting a commercial for a free \"Will and testi-kit\", Zeroman is determined that the time has come to find an eventual heir to the Supersuit; someone who can carry on as the protector of Fair City.","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-09-26","episode_number":4,"episode_type":"standard","id":354281,"name":"Artificial Intolerance","overview":"Les' misfortune with women hits a new low when Sally Uberchik tells him that she may leave town for a new job.    Les is too oblivious to see that Sally is genuinely interested in him, and that all she wants is one little sign that she should stay.    While escorting her to the high school reunion, Les is about to take a shot at convincing her to stay when trouble erupts.    Two revenge-seeking nerds, Blaine & Dwayne, unleash an attack on their former high school tormentors.    In order to save the night Les ditches Sally, returning as Zeroman and in teaching the evil nerds a lesson, makes new enemies.    The geeky brothers re-program their robotic girlfriend, commanding her to hunt down Zeroman and apply the kiss of death.    The beautiful Ann Droid sets out on her mission, causing more problems for our hero than ever before.    Zeroman wrongly assumes that this stalker knows his true identity, while Sally mistakenly believes that Les is romantically involved with her.    Our hero def","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-03","episode_number":5,"episode_type":"standard","id":354283,"name":"Mutton in Common","overview":"An overwhelmed Zeroman is faced with his toughest mission yet; he must find the perfect Mother's Day present.   Everyone is getting into the spirit of this special day, even evil Rusty Woodenwater, who promises his estranged mother the best present in the world.   Rusty concludes that this present must be none other than the Man of Zeal's Supersuit.   He sends his goons Don & Ron off to the Fair City Convention Center, the location of an annual Mother's Day Zeroman Fan Club Reunion, where they are to kidnap Zeroman's number one fan and ransom her for the Supersuit.   Jaundice is kidnapped and held captive in Rusty's lair.   Zeroman refuses to entertain any of Rusty's demands, but is shocked when the lunatics victim is revealed- His \"\"Mommy!\"\"   Ty does all he can to shake Zeroman from his comatose-like shock, but only upon hearing the desperate pleas of his mother over the phone does our hero snap out of it.   Despite Ty's concerns, Zeroman agrees to turn over the Supersuit in return for","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-10","episode_number":6,"episode_type":"standard","id":354287,"name":"Peace Off","overview":"Ty Cheese and Gary Glengarry are left at home in the Nerve Center while Zeroman heads out on a top secret, weekend long Super Hero Summit.   Zeroman and the other heroes are shocked when none other than evil Rusty Woodenwater and his assortment of villains check into the same hotel.   In a freak coincidence, both the good guys and the bad guys have booked the same hotel for their respective summits.   Agreeing to a weekend-long truce, both sides opt for a violence-free stay. But unbeknownst to Zeroman, Rusty has hired a rookie, an out-of-towner villain to take over Fair City. Since Zeroman is out of communication range, Gary and Ty must save the day on their own. Adopting their own superhero persona's they battle the crazed, guitar-wielding Man Wailin.    At the summit, Rusty and his baddies have great fun at the expense of the superheroes. The no-violence-allowed truce results in an all out prank war that escalates until an outraged Zeroman hollers that \"\"one more trick\"\" will send the","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-17","episode_number":7,"episode_type":"standard","id":354282,"name":"Son of Zeroman","overview":"A mysterious young boy named Sonny comes to town claiming to be the Man of Zeal's offspring.   Zeroman is childishly delighted at the possibility of being a father, and having someone with whom he can share his secret.   He ignores Ty's protests that Zeroman, for obvious reasons, can't possibly have a son.   He is equally oblivious to Gary's jealous outbursts, and his feelings of abandonment.   Sonny is actually Rusty Woodenwater in full disguise, making a desperate attempt to inherit the Supersuit.   While Ty tries to figure out this complex situation, Gary tracks the happy duo as they take part in father-son activities, finally throwing a fit at Fair Balls Stadium in front of Zeroman and Sonny.   Meanwhile, Rusty is truly growing close to Zeroman, and feels that he's found the father figure he never had.   Rusty even tells Don and Ron to cancel the original plan as he's happy just the way it is.   Once Zeroman has become Sonny's official guardian, he reveals his true identity to Rust","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-24","episode_number":8,"episode_type":"standard","id":354285,"name":"The Humidifier","overview":"Jaundice Mutton is planning this year's Mutton Family Picnic. While she is sorely disappointed that her favorite nephew, Handsome Harry Mutton, won't be present, Les is delighted.   Before Les can even breathe a sigh of relief. Handsome Harry happily informs Jaundice that he can, in fact, attend.   Newly hired as the Fair City Weatherman, Harry is replacing a very bitter and unphotogenic Dependable Dirby Dinkle.   Unbeknownst to all , the weather is always fair in Fair City because Dirby has been creating it!    But now he's become the newly dubbed, The Humidifier, an evil villan determined not only to curse Fair City with more than its fair share of bad weather, but to ruin Harry's new career.   Meanwhile Harry, who is staying at the Mutton home, commands even Sally's attentions. Plagued by his mother's obsession that he be more like Harry, never mind a bad case of allergies, Les is losing it.   As the weather front worsens Zeroman struggles to help secure the city, but is frazzled wh","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-31","episode_number":9,"episode_type":"standard","id":354284,"name":"Zman of Alcatruss","overview":"It's a glamorous night in Fair City during its annual awards ceremony, the Fairies, in recognition of the city's most honorable citizens.   Having already won everything else, Zeroman makes his way to the stage to collect yet another \"\"Fairy\"\", the one for Criminal Capture.   Suddenly, as he is just about to begin his final speech, Zeroman is apprehended and charged with outrageous crimes including insider trading and illegal puppy training.   He's rushed off to prison where he thinks everyone is his friend. Vowing to be the perfect inmate, Zeroman leaves it to Ty to get to the bottom of the hero frame-up.   In jail, Zeroman gets a rough welcome, and soon learns that to avoid being beat by 'em, you'd better join 'em, and fast.   He is quickly taken in by Rusty and his goons, Don & Ron who trick Zeroman into digging an escape tunnel by convincing the hero that he is innocently providing his pet rat with a natural habitat. Rusty plans a big riot to distract the prison guards during the jai","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-07","episode_number":10,"episode_type":"standard","id":354286,"name":"Less Than Zero","overview":"An evil clone of Zeroman rampages through the city in an attempt to rule the world and marry Sally! Will the REAL Zeroman stand for this?","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-14","episode_number":11,"episode_type":"standard","id":354290,"name":"Disorder in the Court","overview":"When the mayor is accused of false charges, Zeroman must try to figure out what really happened.","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-28","episode_number":12,"episode_type":"standard","id":354288,"name":"Alpha Beta V.H.Les","overview":"Les meets up with an old friend who is just using him to get to Sally and steal a priceless item.","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-01-04","episode_number":13,"episode_type":"finale","id":354289,"name":"Crack of Doom","overview":"Rusty threatens to blow up the town, and to get Zeroman's attention, he kidnaps Sally.","production_code":"","runtime":30,"season_number":1,"show_id":5197,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":15082,"poster_path":null,"season_number":1,"vote_average":0}}}