{"adult":false,"backdrop_path":"/kvHwNWMaTY6a7D9NjJFqWwgPY0q.jpg","created_by":[{"id":1224777,"credit_id":"52577e9919c29531db23f519","name":"Chris Haddock","gender":2,"profile_path":null}],"episode_run_time":[60],"first_air_date":"2006-10-10","genres":[{"id":80,"name":"Crime"},{"id":18,"name":"Drama"},{"id":10759,"name":"Action & Adventure"}],"homepage":"","id":5232,"in_production":false,"languages":["en"],"last_air_date":"2007-12-10","last_episode_to_air":{"id":355151,"name":"We Were Here Now We Disappear","overview":"Reardon gains the advantage against the Americans when he uncovers their connection to the DEA and unites the other suppliers in a boycott against them. Mary learns that Blackmire is a CIA front, but worries that releasing the information could be risky to her operation and career. Adding to her problems is a volatile Julianna, whose unpredictable behaviour continues to threaten the Blackmire investigation.","vote_average":0,"vote_count":0,"air_date":"2007-12-10","episode_number":12,"episode_type":"finale","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/v47jrqiKBE5BmL9sIi7PD54GZSF.jpg"},"name":"Intelligence","next_episode_to_air":null,"networks":[{"id":23,"logo_path":"/cw5WW6cc9UANam4A6o1BDua9njN.png","name":"CBC Television","origin_country":"CA"}],"number_of_episodes":25,"number_of_seasons":2,"origin_country":["CA"],"original_language":"en","original_name":"Intelligence","overview":"Mary Spalding, the director of the Vancouver Organized Crime Unit, offers Jimmy Reardon, one of Vancouver's top organized crime bosses, immunity from prosecution in exchange for his role as a police informant.","popularity":6.634,"poster_path":"/6WYhnGhfEvNAy7bYaiwUbjGlIYz.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"CA","name":"Canada"}],"seasons":[{"air_date":"2005-11-28","episode_count":2,"id":15154,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2006-10-10","episode_count":13,"id":15152,"name":"Season 1","overview":"","poster_path":"/tTwjavCXOEHnc0ev7NXCUIeQQiw.jpg","season_number":1,"vote_average":0},{"air_date":"2007-10-01","episode_count":12,"id":15153,"name":"Season 2","overview":"","poster_path":"/dGbVxrtWcdTb7oos4T2nyvuhuHF.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"Sex, drugs & spies.","type":"Scripted","vote_average":8.3,"vote_count":11,"season_data":{"1":{"_id":"52577e9419c29531db23f081","air_date":"2006-10-10","episodes":[{"air_date":"2006-10-10","episode_number":1,"episode_type":"standard","id":355133,"name":"Where Good Men Die Like Dogs","overview":"Crime boss Jimmy Reardon continues his informer-role with Organized Crime Unit Director Mary Spalding, at the same time shipping his own grower-turned-snitch, Bill, off to Mexico. Mary is still being groomed for a position at CSIS, though pressure is mounting to prove Reardon's value as an informer. Reardon tips Mary off that one of her wire-room operators is actually a mole working for the Chinese Triads, hoping in return Mary can help him in his custody battle with his ex-wife Francine. But with a mole in her wire room, the future of Mary's whole unit is now in jeopardy. And it doesn't help either Mary or Reardon when Bill suddenly turns up dead. Mary's Deputy-Director, Ted Altman, is pleased, wanting to undermine Mary as much as possible. Reardon denies involvement, but his own suspicions point to his impulsive brother, Michael.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/aCclOBh1Gx1yDsNV2rMuIryEAdu.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52577e9519c29531db23f0ba","adult":false,"gender":2,"id":1224777,"known_for_department":"Writing","name":"Chris Haddock","original_name":"Chris Haddock","popularity":1.788,"profile_path":null}],"guest_stars":[]},{"air_date":"2006-10-17","episode_number":2,"episode_type":"standard","id":355134,"name":"A Champagne Payday","overview":"Michael is behind the hit on Bill, but can't afford to pay for it, so he accepts a dope run with the bikers for cash. Ted, hoping to dig up dirt on Bill's murder, puts surveillance on Michael. Mary, in order to placate superiors about Reardon, offers to get an undercover operator inside Reardon's operation. She recruits Tina, a stripper, who gets a job inside Reardon's strip-club, \"The Chickadee.\" Meanwhile, Mary's wire room finds out about an arms shipment to Africa that is tied to a local broker, Bingham. Reardon finds out about Michael's debt for the hit, and pays it off to smooth things over. Mary uses Reardon's connection to Bingham to scare him into thinking the police know about his shipment. Mary's wire room picks up more info as a panicked Bingham calls his connections. Michael finds out about the surveillance on him and is able to evade it.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/rrVszKgHQNpBjXgSyuNvny7gZnN.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"52577e9519c29531db23f0ba","adult":false,"gender":2,"id":1224777,"known_for_department":"Writing","name":"Chris Haddock","original_name":"Chris Haddock","popularity":1.788,"profile_path":null}],"guest_stars":[]},{"air_date":"2006-10-24","episode_number":3,"episode_type":"standard","id":355137,"name":"Don't Break Your Brother's Heart","overview":"Mary recruits an outsider in order to get surveillance on her wire-room mole, Lee. If she can't turn Lee, she'll have to burn her unit to the ground and start from scratch. In the meantime Mary keeps expanding her overall intel network by recruiting a well know money launderer, Singh. If he wants to stay out of jail, he has to become an informer. Reardon's own money laundering operation is getting closer; an ATM scam to wash the tonnes of cash he is sitting on. He's also taking on new clients, supplying marijuana to a Vietnamese gang. Ted's ally in CSIS, the director Mary is being groomed to replace, is Roger Deakins. Deakins wants to do whatever it takes to keep Mary out of his job, and he and Ted agree to contact an American counterpart in the DEA about a US operation to entrap Reardon. An unknown hit man also tries to take Reardon out, but he is stopped at the last minute by an alert Michael.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/o2imZu4HQ4OrzODHuZBEg8zSuFV.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52577e9919c29531db23f417","adult":false,"gender":2,"id":56155,"known_for_department":"Directing","name":"Stephen Surjik","original_name":"Stephen Surjik","popularity":7.678,"profile_path":"/xZAl5XQqf51Yz4maYtLc6HSG62z.jpg"},{"department":"Writing","job":"Writer","credit_id":"52577e9519c29531db23f0ba","adult":false,"gender":2,"id":1224777,"known_for_department":"Writing","name":"Chris Haddock","original_name":"Chris Haddock","popularity":1.788,"profile_path":null}],"guest_stars":[{"character":"Patron","credit_id":"5e90d5becb6db50013bb3402","order":510,"adult":false,"gender":2,"id":1853280,"known_for_department":"Acting","name":"Ted Kozma","original_name":"Ted Kozma","popularity":2.786,"profile_path":null}]},{"air_date":"2006-10-31","episode_number":4,"episode_type":"standard","id":355138,"name":"Jimmy's Got a Money Machine","overview":"Reardon has his ATMs ready to start laundering cash. Now that Michael is a hero for stopping the hitman, he's put in charge of security for the cash runs. Tina, the stripper-informer, is getting cozy with Reardon's banker, Hogarty. Mary's freelancer, Forrest, has begun surveillance on the mole, Lee. Lee has a girlfriend who is talking about getting her brother to kill Lee's wife. Ted tells Deakins the DEA are on board for a reverse sting to bring Reardon down. Deakins doesn't have time for a lengthy sting, he needs dirt on Mary now. Ted looks into setting up a wire in Mary's apartment. Mary learns the brother of Lee's girlfriend is a leader in the local Hong-Kong backed gang, the Red Eagles. Bingham approaches Reardon and asks if his shipping connections can help with a gun-shipment. Reardon passes the info on to Mary in exchange for information on his would-be assassin.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/7AZGV74GEQGAf7LZ7pRncnkvjcg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-07","episode_number":5,"episode_type":"standard","id":355141,"name":"Where There's One There's Another","overview":"Mary prepares a sting operation on Lee. Reardon wants to see his daughter Stella, but Francine is still in the way. Ted meets with his DEA contact, Williams, and agrees to hand over all his intelligence files on Reardon -- but only if he gets to meet Williams' undercover operator. Bingham offers Reardon a stock offering in exchange for moving the gun shipment and Mary asks him to accept the deal. She also informs Reardon his would-be assassin is connected to the Vietnamese. Reardon meets with his Vietnamese contact, Phan, who promises to take care of his disgruntled former supplier. The sting on Lee goes off and Mary interrogates him. He agrees to turn on the Red Eagles and work for her. Stella sneaks away from home and shows up at the strip club looking for Reardon. Francine calls, enraged, but Reardon is able to get her to agree to let Stella stay the night with him.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/fAw4bRHDPRLmKc3U83Fw9lMIZFY.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52577e9519c29531db23f1a0","adult":false,"gender":2,"id":137575,"known_for_department":"Directing","name":"Stefan Pleszczynski","original_name":"Stefan Pleszczynski","popularity":3.249,"profile_path":"/gtJqmJHe20JKD3KQMNN53UQq5Vb.jpg"},{"department":"Writing","job":"Writer","credit_id":"52577e9519c29531db23f0ba","adult":false,"gender":2,"id":1224777,"known_for_department":"Writing","name":"Chris Haddock","original_name":"Chris Haddock","popularity":1.788,"profile_path":null}],"guest_stars":[]},{"air_date":"2006-11-14","episode_number":6,"episode_type":"standard","id":355136,"name":"Pressure Drop","overview":"The bikers try to squeeze Reardon out of the ATM business, giving him an ultimatum. Mary wants Reardon to move another gun shipment for Bingham, but he refuses unless Mary gives him info on the bikers. The mole, Lee, reveals that the Triad group he works for (The Red Eagles) wants to kill an incoming Chinese dissident. The bikers begin taking over Reardon's growers on the Island, and Reardon needs a new supply source or he'll go out of business. Ted tells the DEA the best way into the Reardon organization is through Ronnie or Michael. Karl, an old prison buddy of Michael's, shows up, offering to supply marijuana. Ronnie wants to hit the bikers back or they'll never let up. Reardon's lawyer advises Reardon to move his money offshore. The bikers rip Michael on his next cash run and almost kill him. Mary witnesses Donny, Lee's contact in the Red Eagles, execute Lee.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/ibUwi9KWmLtgiOvE7H65KM742tf.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52577e9519c29531db23f11a","adult":false,"gender":2,"id":43526,"known_for_department":"Directing","name":"Sturla Gunnarsson","original_name":"Sturla Gunnarsson","popularity":1.388,"profile_path":"/3bSzu6zac7SFlBnAe13lZM8nXql.jpg"},{"department":"Writing","job":"Writer","credit_id":"52577e9519c29531db23f0ba","adult":false,"gender":2,"id":1224777,"known_for_department":"Writing","name":"Chris Haddock","original_name":"Chris Haddock","popularity":1.788,"profile_path":null}],"guest_stars":[]},{"air_date":"2006-11-21","episode_number":7,"episode_type":"standard","id":355139,"name":"Love and War","overview":"Mary tries to figure out how Lee was compromised; fearing a leak within CSIS, she gets Vancouver Homicide to investigate Lee's death. Ronnie is certain Michael was hit by the bikers, and wants to strike back. Mary finds out Donny received a call from a police Commissioner in Hong Kong the day before he killed Lee. Reardon takes a meeting with a new marijuana supplier, who is actually a DEA undercover operator. Martin investigates Canadian research scientists selling seed patents to American agri-businesses. Mary arrests Bingham and convinces him to provide her with info on his gun-running connections. She wants Reardon to work with Bingham, but Reardon only agrees after Mary confirms it was the bikers who hit Michael. Mary learns that it was Deakins who called the Hong Kong police commissioner. Reardon meets with Phan about hitting the bikers' money exchange.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/oJLES8iQLDgCxpAFGWpGRcDZFzi.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5717ee26c3a3687fd60018f1","adult":false,"gender":2,"id":43,"known_for_department":"Directing","name":"John Fawcett","original_name":"John Fawcett","popularity":2.803,"profile_path":"/ArR5IXmo5yqjH4I6kcO9W5u9rDC.jpg"}],"guest_stars":[{"character":"Winston","credit_id":"64cd337cc439c0010c5cc41f","order":511,"adult":false,"gender":2,"id":27143,"known_for_department":"Acting","name":"John Tench","original_name":"John Tench","popularity":2.995,"profile_path":"/xF4Ylt8cD5HBkP8ERDmSTtSPnSN.jpg"}]},{"air_date":"2006-11-28","episode_number":8,"episode_type":"standard","id":355135,"name":"Clean and Simple","overview":"Reardon's team works out details on how to rip the bikers' money courier. Forrest introduces Mary to his ex-CIA contact, Flannegan. Flannegan gives Mary info on CSIS Director Royden's U.S. ties in exchange for info on Luiz Falcone, a Mexican cocaine exporter. Mallaby warns Mary that Homicide is making waves in Ottawa over questions about who had access to the files on Lee. Ronnie sets up Sweet as the owner of their new money stash house. Reardon's lawyer tries to convince Reardon to set up his own bank. Martin learns that an American agri-business is planning on stealing the Canadian researcher's seed patents. Mary tries to get Deakins suspended from CSIS. Reardon's rip on the bikers' money courier ends in violence. Reardon is with the undercover dope operator when they are pulled over by police. Mary and Flannegan discover that Luiz Falcone is protected by the DEA.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/d3jDy8cMc6ygWxD98FtWESS8v0y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Winston","credit_id":"64cd337cc439c0010c5cc41f","order":511,"adult":false,"gender":2,"id":27143,"known_for_department":"Acting","name":"John Tench","original_name":"John Tench","popularity":2.995,"profile_path":"/xF4Ylt8cD5HBkP8ERDmSTtSPnSN.jpg"}]},{"air_date":"2006-12-05","episode_number":9,"episode_type":"standard","id":355140,"name":"Cleaning Up","overview":"Winston, the DEA undercover agent, convinces the constable to call Ted and let him go. Reardon distances himself from the Viets after the fallout with the dead courier, who turns out to be Dante's nephew. Michael ID's the guy who attacked him as a biker associate. An unstable Francine begs Ronnie to be brought back into the \"family.\" Mary believes Royden is the bigger mole within CSIS, and decides to work with Deakins and Ted in order to go after him. Reardon takes delivery of the DEA dope from Winston. Hogarty and Coombs convince Reardon to invest in an offshore bank. Michael finds the guy who attacked him, spurring Reardon and Tremblay into action. Forrest and Flannegan install surveillance in Falcone's boat, and Mary finds out that Bingham is meeting with Falcone and the DEA about a gun shipment.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/h08cJgpNulAB3aP3Sjal0XaNeNw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Winston","credit_id":"64cd337cc439c0010c5cc41f","order":511,"adult":false,"gender":2,"id":27143,"known_for_department":"Acting","name":"John Tench","original_name":"John Tench","popularity":2.995,"profile_path":"/xF4Ylt8cD5HBkP8ERDmSTtSPnSN.jpg"}]},{"air_date":"2006-12-12","episode_number":10,"episode_type":"standard","id":355142,"name":"Things Change","overview":"The DEA begin tracking Reardon's dope shipment and his U.S. distribution. Tina overhears Reardon's banking plans, but Mary wants concrete details. Mary reigns in Bingham, reminding him he's supposed to be working for her. She wants to find out if the DEA made a deal with Falcone, or if DEA guy is a rogue agent. Reardon gets a possible tip on some government ferry contracts. Mary recruits Katarina to help in her plan to go after Royden. The DEA try to get Reardon to take a shipment of cocaine instead of weed. Reardon refuses and an impatient Ted pushes the DEA to jump on Reardon's US distribution now. Martin tries to turn one of the Canadian research scientists involved with the Americans. Reardon meets with Dante about calling a truce on the small-time ATMs, instead offering to launder the bulk of their money through Reardon's banking venture. Tina gets Hogarty's briefcase and calls Mary.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/iMR1EcyBngiOdV8KwbiF85QMMa8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Winston","credit_id":"64cd337cc439c0010c5cc41f","order":511,"adult":false,"gender":2,"id":27143,"known_for_department":"Acting","name":"John Tench","original_name":"John Tench","popularity":2.995,"profile_path":"/xF4Ylt8cD5HBkP8ERDmSTtSPnSN.jpg"}]},{"air_date":"2007-01-09","episode_number":11,"episode_type":"standard","id":355144,"name":"Not a Nice Boy!","overview":"Reardon puts up his shipping company as collateral in order to secure a loan to purchase the bank. Reardon's stateside distributor, Alex Morgan, is caught up in the DEA sting. Mary is told her investigation of Royden must go black. Mary sets Katarina up with a business front as cover for her sting on Royden. Reardon sets up a fake sting of his own to test Francine's loyalty. Michael tries to get his money back after a business deal sours. Under Mary's direction, Reardon agrees to handle a shipment of arms for Bingham. Royden looks to move to Vancouver in anticipation of taking over the CSIS office. Morgan works with the DEA in trying to get Reardon down south across the border. Mary conflicts with Ottawa over the best way to handle Royden. Dante kidnaps one of the Vietnamese, Johnny, and threatens to torture him in order to find out if Reardon had anything to do with the death of his nephew.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/jr3J5q0DoAIhx2AkzznApd6Hf8E.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52577e9919c29531db23f417","adult":false,"gender":2,"id":56155,"known_for_department":"Directing","name":"Stephen Surjik","original_name":"Stephen Surjik","popularity":7.678,"profile_path":"/xZAl5XQqf51Yz4maYtLc6HSG62z.jpg"}],"guest_stars":[{"character":"Winston","credit_id":"64cd337cc439c0010c5cc41f","order":511,"adult":false,"gender":2,"id":27143,"known_for_department":"Acting","name":"John Tench","original_name":"John Tench","popularity":2.995,"profile_path":"/xF4Ylt8cD5HBkP8ERDmSTtSPnSN.jpg"}]},{"air_date":"2007-01-16","episode_number":12,"episode_type":"standard","id":355143,"name":"Dante's Inferno","overview":"Ronnie and Reardon are too late to save Johnny. Mary, in an effort to keep her informant files out of Royden's hands, begins shredding them. Mary gains access to Royden's communication records. The Vietnam gang leader, Phan, wants to take immediate action but Reardon delays him. Ottawa again tells Mary she can't move on Royden unless she has concrete proof of his role as an American mole. Reardon agrees to visit Morgan stateside under the pretense of renegotiating his distribution deal. Reardon, still unsure if Johnny talked before he died, has Francine and Stella move in with him for safety. Michael's new club draws him into conflict with the bikers. Royden threatens to publicly leak Reardon's involvement with OCU unless Mary hands over her informant files. Mary is forced to warn Reardon that he may have been exposed.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/bI14cXdbqwkASJjcCMHBMIanu17.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-01-30","episode_number":13,"episode_type":"finale","id":355145,"name":"Down But Not Out","overview":"Reardon tries to uncover who's planning to out him as an informant. Mary sets up wire in Royden's hotel room. Reardon calls Morgan and agrees to meeting. Hogarty agrees to stash all of Jimmy's money in his bank vault. Reardon narrows his search to two possible names, Ted and Royden. Mary warns Katarina and Bingham to get out of town. Ottawa tells Mary that she is being removed from the investigation. Mary gets Forrest to leak to the CIA that Mary is onto Royden. Ronnie wants Tremblay to let Phan attack Dante. Coombs has narrowed the search to Royden. Mary and Martin overhear Royden and his handler and they head to arrest him, but find him dead. Reardon meets with Morgan and realizes it's a set-up. Ted learns Williams is contemplating having Reardon killed rather than arrested. Reardon calls Francine. He tells her he loves her and warns her to get out of town.","production_code":"","runtime":60,"season_number":1,"show_id":5232,"still_path":"/9CNpnO0l53om6V4bWYHIC1qHI7D.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Winston","credit_id":"64cd337cc439c0010c5cc41f","order":511,"adult":false,"gender":2,"id":27143,"known_for_department":"Acting","name":"John Tench","original_name":"John Tench","popularity":2.995,"profile_path":"/xF4Ylt8cD5HBkP8ERDmSTtSPnSN.jpg"}]}],"name":"Season 1","overview":"","id":15152,"poster_path":"/tTwjavCXOEHnc0ev7NXCUIeQQiw.jpg","season_number":1,"vote_average":0},"2":{"_id":"52577e9519c29531db23f08f","air_date":"2007-10-01","episodes":[{"air_date":"2007-10-01","episode_number":1,"episode_type":"standard","id":355149,"name":"A Man Escapes","overview":"Caught in a DEA sting in Seattle, Reardon tries to give himself up but it triggers a shootout. Although he never fired a shot DEA agent Williams is able to make it look like Reardon was responsible for both fatal shootings. As his partner and brother work out a plan to get him back to Canada. CSIS agent Mary Spalding has to deal with FBI agent Weathers as he hunts down Reardon while she attempts to determine the truth and protect her greatest intelligence asset.\n\nTo make matters worse the Disciples realize that in Reardon's absence a power play could be made so Ronnie must try to skillfully manoeuvre around the situation in order to keep them at bay.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/gDQlzpBtDF2K0xYEGUJez0csW9Q.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52577e9919c29531db23f417","adult":false,"gender":2,"id":56155,"known_for_department":"Directing","name":"Stephen Surjik","original_name":"Stephen Surjik","popularity":7.678,"profile_path":"/xZAl5XQqf51Yz4maYtLc6HSG62z.jpg"},{"department":"Writing","job":"Writer","credit_id":"52577e9519c29531db23f0ba","adult":false,"gender":2,"id":1224777,"known_for_department":"Writing","name":"Chris Haddock","original_name":"Chris Haddock","popularity":1.788,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"52577e9619c29531db23f24f","order":500,"adult":false,"gender":2,"id":61544,"known_for_department":"Acting","name":"David Lovgren","original_name":"David Lovgren","popularity":3.215,"profile_path":"/hFJ2K2QApj0XEPeqkhIiHigIK2s.jpg"},{"character":"","credit_id":"52577e9619c29531db23f265","order":501,"adult":false,"gender":2,"id":130935,"known_for_department":"Acting","name":"Shane Meier","original_name":"Shane Meier","popularity":4.765,"profile_path":"/z3lmQgYB1BX8cTOt4NTqjupgUqp.jpg"},{"character":"","credit_id":"52577e9619c29531db23f27b","order":502,"adult":false,"gender":2,"id":28871,"known_for_department":"Acting","name":"Eugene Lipinski","original_name":"Eugene Lipinski","popularity":4.63,"profile_path":"/n9SC7Ka8pVcSZnJadTpSFswBNyo.jpg"},{"character":"","credit_id":"52577e9619c29531db23f291","order":503,"adult":false,"gender":2,"id":12367,"known_for_department":"Acting","name":"John Mann","original_name":"John Mann","popularity":4.153,"profile_path":"/jU82lyc3bju4kcuJZpiX7J1EERM.jpg"},{"character":"","credit_id":"52577e9619c29531db23f2a7","order":504,"adult":false,"gender":2,"id":60719,"known_for_department":"Acting","name":"Hiro Kanagawa","original_name":"Hiro Kanagawa","popularity":11.785,"profile_path":"/dyWOPJmZTfy3r3R5eDY2d7yf8Ze.jpg"},{"character":"","credit_id":"52577e9619c29531db23f2bd","order":505,"adult":false,"gender":2,"id":65808,"known_for_department":"Acting","name":"Fulvio Cecere","original_name":"Fulvio Cecere","popularity":2.353,"profile_path":"/7Jc4LeoA0ND0stFqDiPzBeQ9SXt.jpg"},{"character":"","credit_id":"52577e9719c29531db23f2d3","order":506,"adult":false,"gender":2,"id":1216570,"known_for_department":"Acting","name":"Darcy Laurie","original_name":"Darcy Laurie","popularity":4.294,"profile_path":"/qr6SWY9IXC5OfAz88z1z5MhiZkC.jpg"},{"character":"","credit_id":"52577e9719c29531db23f2e9","order":507,"adult":false,"gender":1,"id":41434,"known_for_department":"Acting","name":"Alana Husband","original_name":"Alana Husband","popularity":1.268,"profile_path":"/xCtIIQwkbpPQJf03PY52NLmtqZI.jpg"},{"character":"","credit_id":"52577e9719c29531db23f2ff","order":508,"adult":false,"gender":1,"id":67978,"known_for_department":"Acting","name":"Ona Grauer","original_name":"Ona Grauer","popularity":7.393,"profile_path":"/vfcupzwyzs1CNrjuG0wW4B3eQcD.jpg"},{"character":"","credit_id":"52577e9819c29531db23f318","order":509,"adult":false,"gender":1,"id":1238598,"known_for_department":"Acting","name":"Kyla Mary Wise Halliday","original_name":"Kyla Mary Wise Halliday","popularity":2.606,"profile_path":"/oBGMe9Bm7kyJLkrdOZE2kVPgJtL.jpg"}]},{"air_date":"2007-10-08","episode_number":2,"episode_type":"standard","id":355148,"name":"A Man Is Framed","overview":"Jimmy is facing murder charges, while Mary tries to uncover the truth of what actually happened in Seattle.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/mP18wfIki1yLHuRzpf3gIeODQWL.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52577e9919c29531db23f417","adult":false,"gender":2,"id":56155,"known_for_department":"Directing","name":"Stephen Surjik","original_name":"Stephen Surjik","popularity":7.678,"profile_path":"/xZAl5XQqf51Yz4maYtLc6HSG62z.jpg"}],"guest_stars":[]},{"air_date":"2007-10-15","episode_number":3,"episode_type":"standard","id":355147,"name":"A Man Underground","overview":"Jimmy struggles to keep it all together as Dante is nipping at his heels. Mary takes on the FBI.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/6pW5P61XT3MtHsf5I8TLJBELDaB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-10-22","episode_number":4,"episode_type":"standard","id":355156,"name":"A Man and a Woman Betrayed","overview":"Reardon does all he can to push through the Bahama bank deal. Mary is tapped to bury a story.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/1Gv5vfvGBgD0GMhi9j6rHQI6tAm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Winston","credit_id":"64cd337cc439c0010c5cc41f","order":511,"adult":false,"gender":2,"id":27143,"known_for_department":"Acting","name":"John Tench","original_name":"John Tench","popularity":2.995,"profile_path":"/xF4Ylt8cD5HBkP8ERDmSTtSPnSN.jpg"}]},{"air_date":"2007-10-29","episode_number":5,"episode_type":"standard","id":355153,"name":"Love and Conspiracy","overview":"Mary is asked to keep tabs on her lover, Jimmy lashes out at a double crossing drug supplier.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/is4PPcSqXQ4vjJMRxAXlo5j7Q79.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-05","episode_number":6,"episode_type":"standard","id":355150,"name":"Something in the Air","overview":"Jimmy does his best to squeak out of being extradited to face charges in the US. Mary finds herself contending with issues of Canadian sovereignty.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/koa1q1zsxQCzq7y7LIg7OgcwMpQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-12","episode_number":7,"episode_type":"standard","id":355152,"name":"A Sweeheart Deal with the Devil","overview":"Facing imminent extradition and a rogue team of DEA kidnappers, Reardon must decide whether to flee the country. When Mary discovers that Reardon may be able to provide valuable intel on the financial workings of the Blackmire group, she races to convince the Attorney General to keep Reardon in Canada.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/7O8fCtN510ivGyBmELESFbQ9cX6.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52577e9919c29531db23f417","adult":false,"gender":2,"id":56155,"known_for_department":"Directing","name":"Stephen Surjik","original_name":"Stephen Surjik","popularity":7.678,"profile_path":"/xZAl5XQqf51Yz4maYtLc6HSG62z.jpg"}],"guest_stars":[]},{"air_date":"2007-11-19","episode_number":8,"episode_type":"standard","id":355158,"name":"Flipping the Script","overview":"As the clandestine kidnapping plot grows deadlier, Reardon removes himself further from the weed industry and moves closer towards his goal of legitimacy. Mary receives pressure from the CIA to stop her investigation of the Blackmire group, while an imminent turf war forces her to persuade Reardon to split his eastern drug connections between two rival gangs.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/6GeXSYAwH2ws5WDDJ9Ng3P8A69Q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-26","episode_number":9,"episode_type":"standard","id":355154,"name":"A Woman Inside","overview":"When Mary learns of the CIA's interest in Blackmire, she recognizes an opportunity to use Reardon and Julianna and make CSIS a key player in the global intelligence game. A new gang of cutthroat Americans begins to infiltrate the Vancouver crime scene, suggesting the plot to kidnap Reardon is part of a much more sinister play.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/n4zH9dSZBGA5WmmyqcNQG5iUMIW.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52577e9919c29531db23f417","adult":false,"gender":2,"id":56155,"known_for_department":"Directing","name":"Stephen Surjik","original_name":"Stephen Surjik","popularity":7.678,"profile_path":"/xZAl5XQqf51Yz4maYtLc6HSG62z.jpg"}],"guest_stars":[]},{"air_date":"2007-12-03","episode_number":10,"episode_type":"standard","id":355155,"name":"The Heat is On","overview":"Reardon meets with a rogue American crew suspected in the murders of both Phan and Dante's lieutenants. Meanwhile, Mary and Ted uncover evidence linking the Americans to a series of violent drug wars in Europe. When the CIA wants Julianna recruited for their own purposes, Mary devises a plan that will safeguard her as a CSIS informant.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/1iocozUVNPZiJNcBJZ8dO4bqJYj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-10","episode_number":11,"episode_type":"standard","id":355157,"name":"A Dark Alliance","overview":"Reardon gains the advantage against the Americans when he uncovers their connection to the DEA and unites the other suppliers in a boycott against them. Mary learns that Blackmire is a CIA front, but worries that releasing the information could be risky to her operation and career. Adding to her problems is a volatile Julianna, whose unpredictable behaviour continues to threaten the Blackmire investigation.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/ruA2yf9Ls5tfcO8TRMGrdI5ITwa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-10","episode_number":12,"episode_type":"finale","id":355151,"name":"We Were Here Now We Disappear","overview":"Reardon gains the advantage against the Americans when he uncovers their connection to the DEA and unites the other suppliers in a boycott against them. Mary learns that Blackmire is a CIA front, but worries that releasing the information could be risky to her operation and career. Adding to her problems is a volatile Julianna, whose unpredictable behaviour continues to threaten the Blackmire investigation.","production_code":"","runtime":60,"season_number":2,"show_id":5232,"still_path":"/v47jrqiKBE5BmL9sIi7PD54GZSF.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52577e9919c29531db23f417","adult":false,"gender":2,"id":56155,"known_for_department":"Directing","name":"Stephen Surjik","original_name":"Stephen Surjik","popularity":7.678,"profile_path":"/xZAl5XQqf51Yz4maYtLc6HSG62z.jpg"}],"guest_stars":[]}],"name":"Season 2","overview":"","id":15153,"poster_path":"/dGbVxrtWcdTb7oos4T2nyvuhuHF.jpg","season_number":2,"vote_average":0}}}