{"adult":false,"backdrop_path":"/9S4d5clqArmqoDcn1qUWuoJXbar.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2014-04-13","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://channel.nationalgeographic.com/years-of-living-dangerously/","id":52684,"in_production":false,"languages":["en","ar"],"last_air_date":"2016-12-14","last_episode_to_air":{"id":1244623,"name":"Uprising","overview":"","vote_average":0,"vote_count":0,"air_date":"2016-12-14","episode_number":8,"episode_type":"finale","production_code":"","runtime":60,"season_number":2,"show_id":52684,"still_path":null},"name":"Years of Living Dangerously","next_episode_to_air":null,"networks":[{"id":43,"logo_path":"/q9rPBG1rHbUjII1Qn98VG2v7cFa.png","name":"National Geographic","origin_country":"US"},{"id":67,"logo_path":"/Allse9kbjiP6ExaQrnSpIhkurEi.png","name":"Showtime","origin_country":"US"}],"number_of_episodes":17,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Years of Living Dangerously","overview":"Featuring some of Hollywood’s most influential stars, Years of Living Dangerously reveals emotional and hard-hitting accounts of the effects of climate change from across the planet.","popularity":2.484,"poster_path":"/A60XIMm3pFBNjHMV9LooW2Rh2pr.jpg","production_companies":[{"id":5861,"logo_path":null,"name":"Showtime Films","origin_country":""}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2014-04-13","episode_count":9,"id":61155,"name":"Season 1","overview":"This groundbreaking documentary event series explores the human impact of climate change. From the damage wrought by Hurricane Sandy to the upheaval caused by drought in the Middle East, YEARS OF LIVING DANGEROUSLY combines the blockbuster storytelling styles of top Hollywood movie makers with the reporting expertise of Hollywood's brightest stars and today's most respected journalists.","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2016-10-30","episode_count":8,"id":81519,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"},{"english_name":"Arabic","iso_639_1":"ar","name":"العربية"}],"status":"Canceled","tagline":"","type":"Documentary","vote_average":7.2,"vote_count":6,"season_data":{"1":{"_id":"53a045630e0a26507d0028c7","air_date":"2014-04-13","episodes":[{"air_date":"2014-04-13","episode_number":1,"episode_type":"standard","id":1006381,"name":"Dry Season","overview":"Globetrotting docu-series about the human impacts of climate change. Harrison Ford goes to Indonesia to investigate how the world's appetite for palm oil has inadvertently created one of the largest emitters of greenhouse gases. Back in the U.S., Don Cheadle meets a climate scientist and Evangelical Christian, with a very different explanation for the Texas drought. And, Pulitzer Prize-winner Thomas L. Friedman travels to Syria, examining how climate change can be a stress point in a volatile political situation. Series premiere.","production_code":"","runtime":60,"season_number":1,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-20","episode_number":2,"episode_type":"standard","id":1006379,"name":"End of the Woods","overview":"Harrison Ford continues his investigation into the global effects of the palm oil industry, exploring the corruption that has deforested the Indonesian landscape and created the world's largest emitter of greenhouse gases. Meanwhile, Former Governor Arnold Schwarzenegger joins an elite team of wild-land firefighters known as \"Hot Shots\" as they battle a new breed of forest fires made more deadly by climate change, and discovers another killer wiping out trees at an even faster rate than the fires.","production_code":"","runtime":60,"season_number":1,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-27","episode_number":3,"episode_type":"standard","id":1006382,"name":"The Surge","overview":"MSNBC's Chris Hayes shadows Staten Island's Republican Congressman - and climate change skeptic - Michael Grimm in the wake of Superstorm Sandy, questioning what he might have learned about climate change in the process. Conservationist M. Sanjayan travels to the far ends of the earth - including Christmas Island - to interview some of the world's top climate scientists as they collect key data unlocking the future of our planet's changing climate.","production_code":"","runtime":60,"season_number":1,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-04","episode_number":4,"episode_type":"standard","id":1006383,"name":"Ice & Brimstone","overview":"Lesley Stahl of '60 Minutes' travels to Greenland to investigate the effects of global warming in the Arctic. Down south, Ian Somerhalder travels to North Carolina to listen in on both sides of the evangelical community's debate over climate change and finds himself caught in the middle of not only a religious debate, but a familial one: the father is a megachurch preacher who doesn't believe in climate change; the daughter is an activist trying to shut down the local coal-fired power plant.","production_code":"","runtime":60,"season_number":1,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-12","episode_number":5,"episode_type":"standard","id":1006384,"name":"True Colors","overview":"Olivia Munn profiles climate-conscious Governor Jay Inslee of Washington State, discussing the issues he's faced since being elected. Meanwhile, 'New York Times' columnist Mark Bittman probes New Jersey Governor Chris Christie on the topic of man-made climate change during the rebuilding of his state's coastline in the aftermath of Superstorm Sandy. Christie once acknowledged the scientific consensus on climate change, but steadfastly refused to discuss it during the rush to rebuild.","production_code":"","runtime":60,"season_number":1,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-19","episode_number":6,"episode_type":"standard","id":1006385,"name":"Winds of Change","overview":"America Ferrera profiles prominent skeptic James Taylor of the Heartland Institute as he crusades against clean energy, and investigates the battle over the future of renewable energy in the US. 'New York Times' columnist Mark Bittman returns to conduct a yearlong investigation into natural gas, which has been touted as \"America's energy source\" and a way towards a cleaner, greener future. But is it true?","production_code":"","runtime":60,"season_number":1,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-26","episode_number":7,"episode_type":"standard","id":1006387,"name":"Revolt, Rebuild, Renew","overview":"Jessica Alba meets three members of Climate Corps - an innovative MBA-focused program - as they try to convince America's corporations that sustainability can actually boost their bottom lines. Pulitzer Prize-winner Thomas L. Friedman finds himself in Egypt to explore how what happens in the wheat fields of Kansas plays out on the volatile streets of Cairo. And MSNBC's Chris Hayes reveals an intimate story about life after Superstorm Sandy, with the most economically vulnerable trying to survive the impacts of climate change.","production_code":"","runtime":60,"season_number":1,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-02","episode_number":8,"episode_type":"standard","id":989224,"name":"A Dangerous Future","overview":"Matt Damon investigates the impact of extreme heat on human health and mortality, with a focus on research that has uncovered how rising temperatures are creating a worldwide public health emergency. Michael C. Hall visits Bangladesh to explore the prediction that by 2050, a global migration of upwards of 150 million people will produce the single most daunting burden to our future. And Thomas L. Friedman travels to Yemen to conclude his look into how climate stress can push volatile political situations over the edge.","production_code":"","runtime":60,"season_number":1,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-09","episode_number":9,"episode_type":"finale","id":1006388,"name":"Moving a Mountain","overview":"Michael C. Hall concludes his journey to the low-lying country of Bangladesh, where rising seas are expected to ultimately submerge 17% of the nation. Conservationist M. Sanjayan returns to further question some of the world's top climate scientists as they collect key data unlocking the past and future of our planet's changing climate. His destination: Tupungatito, the northernmost historically active stratovolcano in the southern Andes. Series finale.","production_code":"","runtime":60,"season_number":1,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"This groundbreaking documentary event series explores the human impact of climate change. From the damage wrought by Hurricane Sandy to the upheaval caused by drought in the Middle East, YEARS OF LIVING DANGEROUSLY combines the blockbuster storytelling styles of top Hollywood movie makers with the reporting expertise of Hollywood's brightest stars and today's most respected journalists.","id":61155,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5816340a9251415cd100f2eb","air_date":"2016-10-30","episodes":[{"air_date":"2016-10-30","episode_number":1,"episode_type":"standard","id":1235960,"name":"A Race Against Time","overview":"The energy market has an estimated global value of $6 trillion — a number that could be greatly affected by an increase in renewable sources, especially solar. In his first television project since retiring as host of CBS’s “The Late Show,” David Letterman travels to India for the first time to find out what the world’s soon-to-be most populous country is going to do to expand its inadequate energy grid, power its booming economy and bring basic electricity to 300 million citizens who have never plugged in. Letterman interviews the prime minister, travels to rural villages where power is a luxury few can afford and finds out why the U.S. may play a key role in India’s energy future. “Saturday Night Live” cast member Cecily Strong travels to Florida and Nevada to investigate what’s blocking the growth of solar energy in the U.S. — and she gets the real story from industry insiders and a retired commissioner now willing to tell their stories.","production_code":"","runtime":60,"season_number":2,"show_id":52684,"still_path":"/aG8QHeDWPZAA40JEunaOTuUjR0l.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-02","episode_number":2,"episode_type":"standard","id":1235961,"name":"Gathering Storm","overview":"If nothing is done to curb carbon emissions, Miami is in danger of being underwater by the end of the century. Jack Black is there to find out if and how the city and other low-lying coastal areas can survive rising seas. He finds a political and business community in denial and talks to a few lone legislators, residents, activists and scientists trying to do something before it’s too late. Ian Somerhalder journeys to the Bahamas to investigate the future threat of superstorms, caused by rising sea temperatures, whose devastating effects could reach biblical proportions. At the Woods Hole Oceanographic Institute, he joins scientists on a deep dive to explore blue holes, underwater caves that have collected the remnants of past storms for centuries.","production_code":"","runtime":60,"season_number":2,"show_id":52684,"still_path":"/9WM2oU6wnMXRvNsrwgHTL4zFnDY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-09","episode_number":3,"episode_type":"standard","id":1235962,"name":"The Uprooted","overview":"New York Times columnist Tom Friedman investigates the increasing population of climate refugees — migrants forced to leave their homes due to climate change-induced sea-level rise, natural disasters and destroyed livelihoods. He travels from the COP21 climate conference in Paris to the Sahel region of a parched and war-torn Africa, where he hears from refugees themselves. He explores this new wave and what the future may bring. Actor Don Cheadle is on the ground in California, where the worst drought in 1,200 years is devastating the nation’s most populous state and the world’s seventh-largest economy. He investigates how Gov. Jerry Brown’s administration is fighting the drought while also fighting climate change. Along the way, Cheadle meets a scientist who warns of a global water and food crisis as well as a family of farmers whose lives may never be the same as they struggle to find water in the parched Central Valley.","production_code":"","runtime":60,"season_number":2,"show_id":52684,"still_path":"/qGSIErUHtBUyaGP2PKwN61UVWd0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-16","episode_number":4,"episode_type":"standard","id":1235963,"name":"Fueling The Fire","overview":"Action hero, politician, climate crusader and Years of Living Dangerously executive producer Arnold Schwarzenegger sets out to explore the military’s relationship with a changing climate, including how our armed forces are dealing with an increasing number of climate-related disasters and how the military is working to reduce its own carbon footprint. Schwarzenegger travels to Kuwait to visit soldiers and travel in a fuel convoy (where more than 3,000 soldiers have been killed or injured since 9/11). He learns how serious a threat the military perceives climate change to be, talks to top-level military leaders and meets the brave men and women who are dealing with climate change threats and disasters on the front lines. The battle to save the Amazon in Brazil — the “lungs of the planet” — is the ultimate race against time. There are ever-increasing threats from cattle ranching, drought, deforestation, massive hydroelectric dams and illegal mining. Supermodel and activist Gisele Bündchen travels to her home country to see the extent of the damage and investigates what’s being done to save the rainforest for all of us. Deep in the Amazon, she joins the national environmental police on a mission to put an end to illegal deforestation; in Alta Floresta, she meets with Greenpeace for a flyover of the forest, which reveals huge patches of deforested land, logs piled high on trucks and barges, drought-stricken fields, burnt rainforests and vast cattle ranches that were once lush, thousand-year-old tropical rainforests.","production_code":"","runtime":60,"season_number":2,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-23","episode_number":5,"episode_type":"standard","id":1235964,"name":"Collapse Of The Oceans","overview":"Joshua Jackson investigates the one place on Earth where the impacts of climate change are most profound yet practically invisible: the oceans. Josh travels to Australia’s Great Barrier Reef to look at the devastating impacts of ocean warming on the world’s largest reef system, and he explores the predicted impact of ocean acidification. In the Philippines, he looks at the impact of climate change in a place where hundreds of millions of people rely on healthy reefs for food, income and protection from storms.","production_code":"","runtime":60,"season_number":2,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-30","episode_number":6,"episode_type":"standard","id":1244621,"name":"Priceless","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-07","episode_number":7,"episode_type":"standard","id":1244622,"name":"Safe Passage","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-14","episode_number":8,"episode_type":"finale","id":1244623,"name":"Uprising","overview":"","production_code":"","runtime":60,"season_number":2,"show_id":52684,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":81519,"poster_path":null,"season_number":2,"vote_average":0}}}