{"adult":false,"backdrop_path":"/c3dVIAeuVM70bTSG7QdFEBGc2xe.jpg","created_by":[{"id":106827,"credit_id":"52577f1319c29531db243a14","name":"Greg Weisman","gender":2,"profile_path":null}],"episode_run_time":[23],"first_air_date":"2000-02-25","genres":[{"id":16,"name":"Animation"}],"homepage":"","id":5283,"in_production":false,"languages":["en"],"last_air_date":"2002-01-15","last_episode_to_air":{"id":356718,"name":"Truth Be Told","overview":"Stuck in a van with a bomb, Josh is left with no choice, but to reveal his secret in front of another extreme sports star.","vote_average":0,"vote_count":0,"air_date":"2002-01-15","episode_number":9,"episode_type":"finale","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null},"name":"Max Steel","next_episode_to_air":null,"networks":[{"id":21,"logo_path":"/9GlDHjQj9c2dkfARCR3zlH87R66.png","name":"The WB","origin_country":"US"}],"number_of_episodes":35,"number_of_seasons":3,"origin_country":["US"],"original_language":"en","original_name":"Max Steel","overview":"A teenage boy with accidental body enhancements fights the enemies of peace as a super-powered secret agent.","popularity":9.86,"poster_path":"/thDuNE7KmVowSK2U8JVAEa387sH.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":null,"episode_count":8,"id":15258,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2000-02-25","episode_count":13,"id":15255,"name":"Season 1","overview":"","poster_path":"/bz3S4HAKVhADZQ5N4HtnXuN73Vl.jpg","season_number":1,"vote_average":0},{"air_date":"2000-10-28","episode_count":13,"id":15256,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2001-11-12","episode_count":9,"id":15257,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8,"vote_count":34,"season_data":{"1":{"_id":"52577f0e19c29531db2435ae","air_date":"2000-02-25","episodes":[{"air_date":"2000-02-25","episode_number":1,"episode_type":"standard","id":356675,"name":"Strangers","overview":"The first episode.  Rachel Leeds, the agent Max Steel has been partnered with, is among a group of people kidnapped at a peace conference at the Reichstag in Berlin.  The kidnapper quickly turns out to be L'Etranger, or \"\"The Stranger.\"\" Max saves them, just in time for his public identity, Josh McGrath, to pick up his girlfriend, Laura Chen.  A glimpse of surprises, and enemies, to come.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-04","episode_number":2,"episode_type":"standard","id":356677,"name":"Shadows","overview":"Josh is having nightmares about the time when he first learned of N-Tek's real mission, and became Max Steel.  Then, on a mission to Paris to investigate the cause of numerous city-wide blackouts, Max begins to faint at odd times, coincidentally at the same time as the outages happen.  Each time, he has a short flashback about his first meeting and fight with Psycho, and the events following it.  By the end, Max has come to terms once more with that clip of his past, and helps to defeat Psycho and save Paris.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-11","episode_number":3,"episode_type":"standard","id":356673,"name":"Sacrifices","overview":"The episode opens with an assassination attempt on United Nations secretary general, Mari Keita, or so N-Tek believes.  Max, however, has his doubts.  Especially when he is told his adoptive father, Jefferson Smith, has had a heart attack, and yet, is unable to be found in any hospital.  It quickly becomes apparent that Smith has been kidnapped.  While the rest of N-Tek searches various leads, Max heads out on his own hunt.  After discovering a hidden base and being captured, Max finds Jefferson.  Working together, the father-son team manages to escape, just in time to stop Psycho from stealing a lethal virus from a hospital, which was apparently the real goal.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-25","episode_number":4,"episode_type":"standard","id":356676,"name":"Sportsmen","overview":"While in the middle of a qualifying contest for the Del Oro Extreme, Josh and the other athletes are rocked by a strange and violent lightning storm.  By the next day, Josh has decided to quit the D.O.X., saying to his father that \"\"...there's no challenge; and it's just not fair.\"\"  However, when the lightning ceases to stop, Max must don the D.O.X. uniform, and try to find out the cause.  After a series of near-death experiences for all of the D.O.X. competitors, Max learns that the threat is caused by a crazed Woody Barkowski, and his sister, Annabelle.  He stops them, saving the day, and many lives.  Then, at the awards ceremony, Laura catches him talking to Rachel, and accuses him of cheating on her, using a comment he made back in the episode \"\"Strangers\"\" against him.  He pacifies her, sort of.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-01","episode_number":5,"episode_type":"standard","id":356679,"name":"Sabres","overview":"Josh and Laura seem to be repairing what damage was done to their relationship after a few recent events, while Pete simultaneously questions Josh as to his love for Laura.  Meanwhile, Sabre, N-Tek's space station, has suffered a mysterious malfunction, and is in danger of plummeting back to Earth.  Max, along with Jake Nez, is sent to investigate the problem.  After a short fight in space, the duo reaches the station, only to find that it was all a set-up, by Psycho and Vitriol, designed to steal N-Tek's shuttle, the Phoenix.  Max and Jake lock themselves in the bay, strategize, then simultaneously capture Vitriol and send Psycho spinning off into space.  Sabre is brought down safely in the Pacific Ocean, and Josh returns to Del Oro, just in time for another scolding from Pete, as our hero had missed another date with Laura.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-08","episode_number":6,"episode_type":"standard","id":356680,"name":"Sharks","overview":"After recapturing the Barkowskis and their hurricane machine, Max and Rachel must recover plutonium from a vessel that sank in the storm, not realizing that freelance mercenary L'ƒtranger is after it also.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-22","episode_number":7,"episode_type":"standard","id":356682,"name":"Sphinxes","overview":"In Egypt, Team Steel attempts to de-fuse Dragonelle and Dread's latest plot against world peace.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-05-13","episode_number":8,"episode_type":"standard","id":356683,"name":"Seraphim","overview":"When Max fails in his first attempt to steal back a computer code disk, N-Tek must bid for it at an auction.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-05-20","episode_number":9,"episode_type":"standard","id":356689,"name":"Snowblind","overview":"Vacationing in Aspen with Laura and their friend Pete, Josh spots Psycho and follows him, only to discover that Dread has tapped into his Bio-Link with N-Tek HQ in order to kidnap Max and experiment on him.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-09-16","episode_number":10,"episode_type":"standard","id":356686,"name":"Swashbucklers","overview":"Josh and Laura's Spring Break vacation in Baja turns into a Max Steel adventure, as they encounter pirates with an earthquake machine.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-09-23","episode_number":11,"episode_type":"standard","id":356688,"name":"Spear Carriers","overview":"Team Steel's new mobile base of operations, the Behemoth, is hijacked with 'Berto trapped inside.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-09-30","episode_number":12,"episode_type":"standard","id":356685,"name":"Scions","overview":"Trapped by a volcano, Max listens to a log of one of his late father's missions and imagines what it was like.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-10-14","episode_number":13,"episode_type":"finale","id":356687,"name":"Shattered","overview":"N-Tek has a climactic showdown with the forces of DREAD.","production_code":"","runtime":23,"season_number":1,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":15255,"poster_path":"/bz3S4HAKVhADZQ5N4HtnXuN73Vl.jpg","season_number":1,"vote_average":0},"2":{"_id":"52577f0e19c29531db2435bc","air_date":"2000-10-28","episodes":[{"air_date":"2000-10-28","episode_number":1,"episode_type":"standard","id":356695,"name":"The Return","overview":"Starting off the season by saving a hijacked NY City tour bus, Rachel is then promoted to be Max's boss, while Josh is approached by a pubescent girl to support the kids' efforts to get an extreme sports park built.  Laura isn't in the episode -- but is mentioned as leaving on a one-year trip.\n\nBut, arriving back at the apartment to try to spend a little time with Pete for a change, Josh finds a that Pete's been taken by Dread, who has survived last season's climax, and demands Max steal for him a vial of nano probes and a research disk, sending Max on a chase through a series of hurried legs to exchange vial & disk for Pete.  Oh, and Dread managed to jam Max's link with Berto, thank you.\n\nIn the process of saving Pete and putting Dread behind bars, Pete learns that Josh is Max.  We're left with Dread in prison, vowing that \"\"it's not over, Max!\"\"","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jo (voice)","credit_id":"63b6fe8673520500a78e70cf","order":500,"adult":false,"gender":1,"id":52404,"known_for_department":"Acting","name":"Mae Whitman","original_name":"Mae Whitman","popularity":27.782,"profile_path":"/x0DdzjoYN8K2PwjrnH3ogPYv2zo.jpg"}]},{"air_date":"2000-11-04","episode_number":2,"episode_type":"standard","id":356693,"name":"Fun in the Sun","overview":"Things are quiet for a few days at N-Tek (with the robotic dog problems of last week, 'Berto's now developed a robotic cat reminiscent of Sony's Aibo [who's the studio making this show!?!]), so Rachel lets Max take 'Berto to Waikii Beach, Hawaii, where they can both vacation, and Josh can talk to a submarine scientist at the Pearl Harbor naval base about his latest designs, helping Josh with his civil engineering class project.   After Josh & 'Berto make friends with an initially-hostile local windsurfer, a strange tsunami hits their hotel, and more rescues are in order.   While Josh talks with the submarine scientist, 'Berto hacks in to their systems and finds out that there's no natural cause to the tsunami.  Max & 'Berto decide to climb up to a mountainous side of the island to locate the cause of the tsunami when called from N-Tek, officially activating them and relaying L'Estranger's ransome demand for $5B to not wipe out Honolulu.   They manage to fight off his minions, but L'Est","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-11-11","episode_number":3,"episode_type":"standard","id":356690,"name":"Amazon","overview":"Max is dispatched to the Amazon rain forest to investigate, as large swaths of the forest are mysteriously being cleared.  There's another N-Tek operative, named Kat, who has been on the job for a few days, but her communications have gone silent.  Also, 'Berto has to come along, because Max's communications won't work properly inside the dense rain forest (huh ??) and 'Berto knows the area.  (Being from Columbia, he knows Brazil well.)\n\nAfter landing, Max & 'Berto are jumped -- and it turns out that they've surprised Kat, alive & well, but with a broken communicator.  Kat doesn't need any help, thank you.  Nor does Max need Kat.  But they have to work together, or at least in close proximity.  Orders, you know.\n\nKat is mildly pleased when Max saves them from an enormous boa constrictor, while they're motoring up river, but the boat sinks, and she turns sarcastic again.\n\nThey find some of the clear cuts in the forest, where 'Berto examines a felled tree, and identifies it as one with a sp","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-11-18","episode_number":4,"episode_type":"standard","id":356692,"name":"When Lightning Strikes Twice","overview":"The evil villain Electrix is angry with her history of being defeated by Max Steel and his crew. She becomes bent on revenge, but this time with a plan.","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jo (voice)","credit_id":"63b6fe8673520500a78e70cf","order":500,"adult":false,"gender":1,"id":52404,"known_for_department":"Acting","name":"Mae Whitman","original_name":"Mae Whitman","popularity":27.782,"profile_path":"/x0DdzjoYN8K2PwjrnH3ogPYv2zo.jpg"}]},{"air_date":"2000-12-02","episode_number":5,"episode_type":"standard","id":356691,"name":"Fire & Ice","overview":"Josh is eating dinner over at Pete's house when he is called to work by 'Berto.  Pete, who now knows Josh is also secret-agent Max, begs to come along, but Josh tells him no.\n\n'Berto sends the Hawk airplane to pick up Max, sending him to Arctic Alaska, where two N-Tek research scientists have gone missing.  Enroute, he discovers Pete stowed away in the back seat, still wanting to help his pal Josh with his secret agent role.  Pete will cause no end of distraction and trouble for Max, today.\n\nApproaching the Arctic, Max has to fight off anti-aircraft missles from the villain, while Pete has to fight off motion sickness.  They end up crash-landed close to the research station, and start to ski the rest of the way, where Max has to fight off a huge polar bear (without harming this endangered species!).\n\nAt the research station, they discover that Vitriol has tapped in to the Trans-Alaska Pipeline, and try to discover whether they're stealing oil or planning to cause an ecological disaster.\n\nI","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-12-09","episode_number":6,"episode_type":"standard","id":356697,"name":"Trapped","overview":"An unsatisfied employee is holding hostages in a high security building and plans to blow it up.","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-12-16","episode_number":7,"episode_type":"standard","id":356700,"name":"Steel vs. Steel","overview":"Kat & Max are sent to retrieve a \"\"magma crystal\"\" from the mouth of an active volcano, but fail.\n\nRegrouping back at N-Tek, one of Electrix's electrobots (captured in a previous episode) attacks Max!  No wait, it's not the same old electrobot -- 'Berto has modified it with trans-phasic energy to become an N-Tek \"\"techbot\"\": another agent, like Max & Kat.  Max is none too pleased about being replaced by \"\"a bucket of bolts with a motherboard strapped on\"\", but 'Berto makes him understand that it is just to help, not replace him.  Jefferson notes it would have been perfect to send into the volcano, instead of human agents, but Max is still skeptical.\n\nThey undertake to train the new \"\"agent\"\" over at the N-Tek training island.  Things begin to go wrong, and it turns out that Electrix included special code on the motherboard that, if captured, would re-assert the need to attack N-Tek agents, despite 'Berto's programming.\n\nThe electrobot activates its three pals in storage, and they take the Behemou","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-01-20","episode_number":8,"episode_type":"standard","id":356701,"name":"Space Opera (a.k.a. Shooting Stars)","overview":"Episode \"\"Space Opera\"\" in this database,    listed as \"\"Shooting Stars\"\" on Cartoon Network\n\n'Berto has been dying to do something that allows public recognition, unlike all his N-Tek work, and he gets word from NASA that he and his optics experiment have been approved to fly on the next Space Cruiser flight.  Max agrees to give him a week of training to get him into shape for the flight.  It's clear that 'Berto really is used to a lot of sitting!\n\n'Berto gets to the Cape and meets Sarah Wolf, the Mission Specialist in charge of him and the payloads, and the rest of the crew.  When N-Tek finds out his parents can't get to Florida in time to watch the launch, Max goes there to cheer on 'Berto.\n\nAfter 'Berto notes the last-minute loading of the latest space telescope onto the Cruiser, Josh arrives, and invites 'Berto to party on his last earth-bound night -- but 'Berto collapses, exhausted.\n\n'Berto gets up early on launch day and goes into the Cruiser to check on his experiment, only to find th","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-10","episode_number":9,"episode_type":"standard","id":356696,"name":"Old Friend, New Enemy","overview":"Max & Kat are sent to Kansas, where a former N-Tek employee, Dr. Klimo, is continuing his experimentation into harnassing the DNA of poisonous animals to create new weapons.  (Jefferson had fired him when his experiments started going beyond good science.  He USED to be a nice guy, even playing ball with N-Tek employee kids, like little Josh McGrath.)\n\nThey find Klimo at work in an old barn, surrounded by cages of bats & snakes, and huge bubbling vats.  He isn't interested in being taken back to Del Oro Bay, and a fight ensues.  Klimo falls off a platform down into one of his vats of bubbling blue toxins.  Just as Max & Kat turn to go, lamenting his death, a creature rises out of the vat -- Klimo's DNA has been altered, and his body is now sssssuper-ssssstrong, and constructed of coiled ssssssnakes!  Klimo has become a poisonoussssss sssssnake himself, and can call other sssssnakes to help.\n\nThey fight further, with Kat getting hurt in the ankle, but eventually Klimo morphs into a long,","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-17","episode_number":10,"episode_type":"standard","id":356704,"name":"Extreme","overview":"Josh enters a sports event and ends up entering as Max steel and teaming up with Tony Hawk. You may think that he'll be lucky but there's more. Someone is trying to cheat and it's up to Max to figure out what's wrong.","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-03","episode_number":11,"episode_type":"standard","id":356702,"name":"Best Friend","overview":"Max finds out his friend has been brainwashed and is intent on committing a murder. It is up to Max to save his friend, the person about to be murdered and discover who is behind the brainwashing.","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jo (voice)","credit_id":"63b6fe8673520500a78e70cf","order":500,"adult":false,"gender":1,"id":52404,"known_for_department":"Acting","name":"Mae Whitman","original_name":"Mae Whitman","popularity":27.782,"profile_path":"/x0DdzjoYN8K2PwjrnH3ogPYv2zo.jpg"}]},{"air_date":"2001-03-10","episode_number":12,"episode_type":"standard","id":356703,"name":"The Race","overview":"Max Steel is sent to test a new vehicle in the Sahara. However, he discovers a plot...","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-23","episode_number":13,"episode_type":"finale","id":356705,"name":"Breakout","overview":"Dread escapes from prison and Max and his crew have to stop him before he destroys a peace conference.","production_code":"","runtime":23,"season_number":2,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":15256,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"52577f0e19c29531db2435ca","air_date":"2001-11-12","episodes":[{"air_date":"2001-11-12","episode_number":1,"episode_type":"standard","id":356707,"name":"Deep Cover","overview":"NTEK was shut down, and Max Steel returned to his role as Josh McGrath, the extreme athlete.  When Josh discovers illegal weapons smuggling at the Radical Games, he and his team returns to crime fighting business.  But without constant T-Juice supply as he did in NTEK days, can Max survive the battle before his juice runs out?","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-11-19","episode_number":2,"episode_type":"standard","id":356708,"name":"Survival Instinct","overview":"While competing in a snowboarding competition, Josh meets up with one of his rivals. The two do not hesitate to make life hard for one another, but when an avalanche strikes, the two are trapped in a small cave with diminishing oxygen. It is up to the two to help one another tunnel out before the oxygen supply runs out.","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-05","episode_number":3,"episode_type":"standard","id":356713,"name":"Cold Sweat","overview":"Josh and co. attend a major hockey game, invited by a major hockey star. But things go the wrong way when a boy is held ransom.","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-06","episode_number":4,"episode_type":"standard","id":356712,"name":"Fan Appreciation","overview":"While attending the opening of a new extreme sports park, Kat is especially well treated by the park owner and worker. However, Max begins to grow suspicious...","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-12","episode_number":5,"episode_type":"standard","id":356711,"name":"Rough Seas","overview":"Josh, Berto and Kat take a dream cruise, but Psycho hijacks the ship. Max, Kat and Berto must get the passengers to safety and stop Psycho.","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-17","episode_number":6,"episode_type":"standard","id":356715,"name":"Prey","overview":"Josh is stuck in South America - in the jungle. Even worse is the fact that he is pursued by \"\"unseen forces\"\"","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-21","episode_number":7,"episode_type":"standard","id":356716,"name":"Special Delivery","overview":"Max, Kat and Berto meet up with Matt Hoffman to lend him some help and suport. However, his room is trashed and the team discover someone is trying to kidnap him.","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-05","episode_number":8,"episode_type":"standard","id":356710,"name":"Turbulence","overview":"Psycho steals a plane in order to steal from the federal reserve.","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-15","episode_number":9,"episode_type":"finale","id":356718,"name":"Truth Be Told","overview":"Stuck in a van with a bomb, Josh is left with no choice, but to reveal his secret in front of another extreme sports star.","production_code":"","runtime":23,"season_number":3,"show_id":5283,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":15257,"poster_path":null,"season_number":3,"vote_average":0}}}