{"adult":false,"backdrop_path":"/lvOSZaLxPMUaAoyv3Yf8fgavXpJ.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"1991-09-03","genres":[{"id":16,"name":"Animation"},{"id":10765,"name":"Sci-Fi & Fantasy"},{"id":10759,"name":"Action & Adventure"}],"homepage":"","id":529,"in_production":false,"languages":["en"],"last_air_date":"1993-06-25","last_episode_to_air":{"id":29468,"name":"The Hinge of Fate","overview":"The battle with Mordred's forces is fast approaching and things do not look good for our heroes.  Aleta and her army could offer Camelot the support it currently lacks from its people, but only if Lord Maldon does not act on his suspicions of the Queen of the Misty Isles.  Meanwhile, Allen returns to the Chapel of the Sword and the Stone and uncovers far more than he was sent to find.  Could his discovery save the New Order from oblivion, or are Valiant, Arn, Rowanne, and their army doomed to be crushed by Mordred's superior numbers?","vote_average":0,"vote_count":0,"air_date":"1993-06-25","episode_number":39,"episode_type":"finale","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null},"name":"The Legend of Prince Valiant","next_episode_to_air":null,"networks":[{"id":75,"logo_path":"/p57JGkSUBdXbOtqkEKeTnfHn7kd.png","name":"ABC Family","origin_country":"US"}],"number_of_episodes":65,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"The Legend of Prince Valiant","overview":"The Legend of Prince Valiant is an American animated television series based on the Prince Valiant comic strip created by Hal Foster. Set in the time of King Arthur, it's a family-oriented adventure show about an exiled prince who goes on a quest to become one of the Knights of the Round Table. He begins his quest after having a dream about Camelot and its idealistic New Order. This television series originally aired on The Family Channel from 1991 to 1994 for a total run of 65 episodes.","popularity":62.632,"poster_path":"/r1ozWw5J7oVL4BqGOA86Pyl2Wvi.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":null,"episode_count":0,"id":1599,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"1991-09-03","episode_count":26,"id":1600,"name":"Season 1","overview":"","poster_path":"/r1ozWw5J7oVL4BqGOA86Pyl2Wvi.jpg","season_number":1,"vote_average":7},{"air_date":"1992-10-02","episode_count":39,"id":1601,"name":"Season 2","overview":"","poster_path":"/6T2iqnn9uX2OwOcpyEeAQDKk2bw.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":5.4,"vote_count":9,"season_data":{"1":{"_id":"5253808e19c29579401ca2cc","air_date":"1991-09-03","episodes":[{"air_date":"1991-09-03","episode_number":1,"episode_type":"standard","id":29404,"name":"The Dream","overview":"The kingdom of Thule has fallen under the attack of King Sinnin and his massive army.  The forces of King Willam manage to hold out until their ruler drops his guard during the battle.  Sinnin wins the day and forces the survivors, including young Prince Valiant, to sail to a primitive land far from their home.  But Valiant eventually learns that Destiny does not intend for him to wallow in exile for long.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"","credit_id":"5253808e19c29579401ca2f6","order":512,"adult":false,"gender":1,"id":111466,"known_for_department":"Acting","name":"Mona Marshall","original_name":"Mona Marshall","popularity":6.319,"profile_path":"/A2RCAt0Xmm3jLBKZogQAJX6eD9n.jpg"}]},{"air_date":"1991-09-09","episode_number":2,"episode_type":"standard","id":29405,"name":"The Journey","overview":"While attempting to get some breakfast, Prince Valiant meets a wandering peasant named Arn who mocks his lack of fishing skills.  The two very different men are soon bonding over breakfast and a fishing lesson.  Their relaxing day is cut short when violent circumstances force Valiant to take a detour from his search for Camelot.  This detour leads to a devastating discovery about the future of this great kingdom.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-09-16","episode_number":3,"episode_type":"standard","id":29406,"name":"The Blacksmith's Daughter","overview":"The two would-be knights run afoul of Sheriff Robert when they stop him from abducting Rowanne (the blacksmith's daughter).  Their stay at her home that evening reveals that she is far from a typical maiden in distress: the young woman has spirit and a deadly aim with a bow and arrow.  The visit takes a near fatal turn when Robert comes to exact revenge for his humiliating defeat.  Valiant and Arn also have to contend with Robert's powerful brother Duncan when word of their quest reaches him.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253808e19c29579401ca32c","order":503,"adult":false,"gender":2,"id":43125,"known_for_department":"Acting","name":"Rob Paulsen","original_name":"Rob Paulsen","popularity":8.506,"profile_path":"/7buvKWIjPlspqruaO3b28V5owJr.jpg"}]},{"air_date":"1991-09-23","episode_number":4,"episode_type":"standard","id":29407,"name":"The Kidnapping","overview":"Rowanne is kidnapped by John Brodige, an inept buffoon out to claim the reward Baron Draconarius has offered for her.  It seems the young woman has broken the law by leaving home without the baron's consent.  The pair are pursued by Valiant and Arn, who don't know that Brodige poses little threat to their friend.  The real threat comes from Garth, the baron's ruthless bounty hunter, who will kill any man who comes between him and his prize.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253808e19c29579401ca352","order":513,"adult":false,"gender":2,"id":60257,"known_for_department":"Acting","name":"S. Scott Bullock","original_name":"S. Scott Bullock","popularity":2.398,"profile_path":null}]},{"air_date":"1991-09-29","episode_number":5,"episode_type":"standard","id":29408,"name":"The Trust","overview":"While renovating the ruins of the Castle Keep to suit their needs, the trio are interrupted by a wild boar's attack.  Valiant tracks the wounded animal and falls into some underground caves inhabited by an insane old Viking named Tor.  Rowanne and Arn venture into the caves to save Valiant from Tor's death traps; for some reason Arn's behavior grows increasingly irratic.  Can our heroes survive long enough to learn why this aged Viking is waging war on them?","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-06","episode_number":6,"episode_type":"standard","id":29409,"name":"The Finding of Camelot","overview":"After weeks of searching with no luck, the trio begins to doubt the truth of Valiant's dream of Camelot.  But the appearance of a wounded falcon within the Castle Keep leads to an omen that renews faith in the mission.  The falcon repays Valiant, Arn, and Rowanne for tending its injuries by leading them straight to Camelot the next morning.  Unfortunately, our heroes do not receive the welcome that they were anticipating.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-13","episode_number":7,"episode_type":"standard","id":29410,"name":"The Gift","overview":"Rolf, Valiant's old mentor, has come to Camelot both to deliver a letter from King Willam and spend some time with his beloved pupil.  But the prince is too angry to read what his father has to say and too busy training with Sir Bryant and Sir Gawain to make time for his friend.  Arn provides some measure of comfort for Rolf but cannot displace his yearning to reconnect with the young man he has loved like a son.  Valiant must learn the hard way that he should take advantage of his friend's presence while he can.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-10-20","episode_number":8,"episode_type":"standard","id":29411,"name":"The Singing Sword","overview":"Dreams of trouble in Bridgeford prompt Rowanne to return home and check on her father and mother.  She leaves with Arn against Valiant's protests that she is just homesick - the two of them are captured by Duncan's men just outside the town's borders.  The young warriors are sentenced to the same fate as the other townsfolk who have lately spoken of Camelot against the baron's wishes.  What can Valiant do to save his friends and liberate Bridgeford from this tyranny?","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253808e19c29579401ca32c","order":503,"adult":false,"gender":2,"id":43125,"known_for_department":"Acting","name":"Rob Paulsen","original_name":"Rob Paulsen","popularity":8.506,"profile_path":"/7buvKWIjPlspqruaO3b28V5owJr.jpg"}]},{"air_date":"1991-10-27","episode_number":9,"episode_type":"standard","id":29412,"name":"The Trust Betrayed","overview":"Sir Mordred's triumphant return after laying siege to the Vikings is bittersweet for our heroes.  While they are awestruck to see the king's champion and dear friend in person, they are saddened by the knowledge that this latest battle with the Vikings could have been avoided.  Valiant, Arn, and Rowanne are more determined than ever to discover the identity of the traitor within Camelot's walls.  This search for the truth brings the prince to the attention of two powerful new enemies who need him silenced to further their own agendas.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-12-01","episode_number":10,"episode_type":"standard","id":29413,"name":"The Secret of Perilous Garde","overview":"Proud bachelor Sir Gawain is about to marry Queen Ilene of Perilous Garde, and our heroes are Camelot's emissaries to his nuptuals.  The perfection of this extraordinary mountain city is sharply contrasted with the devastation of the drought-ridden village in the valley.  Valiant, Arn, and Rowanne are sorely tempted to take up Queen Ilene's offer to stay in this small paradise after experiencing its comforts and beauty.  But all this changes when Arn learns from one of the villagers about the secret behind Perilous Garde's prosperity.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-12-08","episode_number":11,"episode_type":"standard","id":29414,"name":"The Return","overview":"On the day that Ian, Warrior King of Kengary, comes to Camelot to negotiate an alliance with Arthur, Baron Draconarius and his brother Robert arrive to seek aid from Arthur.  Arthur barely restrains his deep-rooted hatred for Duncan as Guinevere offers him food and shelter for the night.  Duncan repays this kindness by plotting to sabatoge the negotiations with Kengary.  Soon the king's faith in his New Order is put to the test when the baron's actions go too far and Ian demands justice by the sword.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1991-12-15","episode_number":12,"episode_type":"standard","id":29415,"name":"The Visitor","overview":"Arn feels unworthy of knighthood in the presence of the noble-born knights who have come to compete in Camelot's tournament.  But he finds renewed confidence through his new friendship with Sir Harold of York.  Harold, a knight who boasts of surviving the legendary Combat of the Thirty, inspires Arn by revealing his own peasant ancestry.  But Arn's newfound elation may be deflated when Rowanne explains her unsettling suspicions about Sir Harold.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-01-05","episode_number":13,"episode_type":"standard","id":29416,"name":"The Awakening","overview":"With Arthur and Guinevere gone, Lady Morgana seizes an opportunity to rid herself of long-time rival Merlin once and for all.  She poisons the old wizard with a sleeping potion that traps him in a dream world that she controls.  The trio only has a day to save him and seeks help from an eccentric alchemist named \"\"The Mighty Oom.\"\"  Rowanne tests the antidote he gives them and falls seriously ill, which forces her two friends to confront their feelings for her.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-01-12","episode_number":14,"episode_type":"standard","id":29417,"name":"The Guardian","overview":"Sir Gawain can hardly contain his boredom as he leads a small battalion to the Roman Wall on what he believes to be a wild goose chase.  Julian the gatekeeper is such a simple-minded buffoon that his warnings hold little value to the proud knight.  But trouble is in fact brewing up north, suggesting that there may actually be an impending threat to Camelot's safety.  Valiant and Arn must uncover the problem on their own when Gawain can't be located by any of the men.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-01-26","episode_number":15,"episode_type":"standard","id":29418,"name":"The Trap","overview":"Arthur and Guinevere are looking forward to spending a quiet wedding anniversary together at Cannonwald.  But it isn't long before the entire castle is in an uproar.  When the king is severely wounded during an ambush, Guinevere distracts herself by taking charge of Excalibur and a couple refugees from the woods.  One of these refugees is a lovely young lady who manages to charm everyone in the castle except for a suspicious Rowanne.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-03-01","episode_number":16,"episode_type":"standard","id":29419,"name":"The Turn of the Wheel","overview":"After helping the eager young Sir Dylan gain admittance to Camelot's gala, Valiant is crushed when Merlin orders him to spend this holiday fixing carriages.  His interest in his chore is temporarily aroused upon learning that one of the older carriages once carried King Arthur on his first important peace mission.  Just when he is starting to fix that carriage's wheel, Sir Dylan gives him a chance to attend the gala as his guest.  The prince makes shoddy repairs on the worn out wheel without realizing that he may not be able to go back and properly finish the job.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-03-08","episode_number":17,"episode_type":"standard","id":29420,"name":"The Competitor","overview":"The charismatic Prince Edwin is a new favorite in Camelot and holds a special interest to Rowanne after he saves her life.  Both he and Prince Valiant appear to be the most likely candidates to win a coveted commission that could soon lead to knighthood.  Valiant's barely contained jealousy of Edwin only drives Rowanne away from him and closer to her enthusiastic admirer.  Sir Gawain and Sir Bryant expect some fighting to take place amongst these hot-headed youths; when it does, the results take everyone by surprise.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253808e19c29579401ca32c","order":503,"adult":false,"gender":2,"id":43125,"known_for_department":"Acting","name":"Rob Paulsen","original_name":"Rob Paulsen","popularity":8.506,"profile_path":"/7buvKWIjPlspqruaO3b28V5owJr.jpg"}]},{"air_date":"1992-03-15","episode_number":18,"episode_type":"standard","id":29421,"name":"The Road Back","overview":"The day has finally come to deliver Baron Draconarius to King Ian so that he can be punished for the murder of Kengary's chief advisor.  This is a dangerous time to do so, for the kingdom of Kengary is in the middle of a bloody civil war caused by the as-yet unavenged crime.  Valiant is assigned the task of escorting the prisoner to his fate (which is sure to be death).  Unfortunately, his hate-fueled drive to see that his old foe pays for his crimes places the entire mission in jeopardy.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-03-22","episode_number":19,"episode_type":"standard","id":29422,"name":"The Fist of Iron","overview":"The suspicious behavior of Sir Gideon, a legendary Knight of the Round Table whose hand was cut off by the Bronze Knight, arouses the attention of Sir Giles.  The young knight enlists Valiant's help in investigating the matter; this leads to the discovery of an extortion scheme taking place at the Twilingham silver mine.  Although Valiant wonders if Giles's feelings for Gideon's betrothed are clouding his judgement, he still encourages his friend to bring his accusation to the king.  Yet Giles's fear of losing his standing as a new knight could very well prevent the truth from coming out.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253808f19c29579401ca464","order":506,"adult":false,"gender":2,"id":64951,"known_for_department":"Acting","name":"Neil Ross","original_name":"Neil Ross","popularity":4.447,"profile_path":"/pNgkQKw5k6z9kscDnOAwstcmNnt.jpg"},{"character":"","credit_id":"5253808f19c29579401ca47a","order":518,"adult":false,"gender":2,"id":2372,"known_for_department":"Acting","name":"Ron Perlman","original_name":"Ron Perlman","popularity":49.324,"profile_path":"/9riPBfsWpzEzh2y9ucxTW22iakI.jpg"}]},{"air_date":"1992-03-29","episode_number":20,"episode_type":"standard","id":29423,"name":"The Waif","overview":"A young waif named Dennis falls uder Valiant's protection after being abused by a thieving juggler called Kerwood.  The duo become fast friends when the friendly and eager boy reveals that he too has dreamed of Camelot long before he knew it existed.  Together they fight for Dennis's right to remain in Camelot despite Kerwood's legal claim to him.  Yet Dennis's explanation of where he comes from could forever drive a wedge between him and the Prince of Thule.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-04-05","episode_number":21,"episode_type":"standard","id":29424,"name":"The Dawn of Darkness","overview":"Dragons are being blamed for a series of devastating attacks that are obliterating Camelot's fortresses.  Sir Bryant and the trio visit the estate of Lord Maldon to see what he knows, but the son of one of Arthur's old enemies refuses to treat the threat seriously.  Furthermore, there is a secret project going on deep in Maldon's bell factory that the group suspects could mean trouble.  Valiant's attempt to secretly spy on their host leads to a revelation that could spell the end for Camelot.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-04-12","episode_number":22,"episode_type":"standard","id":29425,"name":"The Battle of Greystone","overview":"Dylan has seized Greystone, prompting King Arthur to send an army to reclaim this castle for the side of good.  The king allows Valiant to take part in the campaign despite his fear that the prince won't be able to keep his hatred in check.  It turns out that Arthur should be more worried about Sir Gawain, who is concealing a serious injury in order to stay in command of Camelot's army.  How can Dylan be defeated if Gawain lacks the strength to lead?","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809019c29579401ca4ca","order":514,"adult":false,"gender":1,"id":69344,"known_for_department":"Acting","name":"Dana Hill","original_name":"Dana Hill","popularity":14.397,"profile_path":"/kLFYJSiPfBmXTla2MKInPi4YAqX.jpg"}]},{"air_date":"1992-04-19","episode_number":23,"episode_type":"standard","id":29426,"name":"The Reunion","overview":"Our heroes journey back to the marsh in order to enlist King Willam to join in the fight for Thule.  On their way, they are ambushed by a bullying brute named Vladimir who has been plundering the countryside with his band of thugs.  Valiant orchestrates their escape and the entire group finds refuge in Arn's hometown.  Upon learning that his old friends are living in a constant state of fear, Arn wonders if he should permanently stay behind and help them defend their homes against Vladimir.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-04-26","episode_number":24,"episode_type":"standard","id":29427,"name":"The Choice","overview":"Camelot's army sets sail for Thule at the beginning of a violent storm season.  While preparing to reclaim his kingdom from Sinnin, Valiant faces the startling realization that he cannot abandon his people to become a Knight of the Round Table.  He has always assumed that his journey to Camelot was ordained by Fate, but now he must choose for himself where he is ultimately to spend his life.  A devastating Viking attack then forces the prince to make an immediate decision regarding the campaign's - and his own - future.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-05-03","episode_number":25,"episode_type":"standard","id":29428,"name":"The Triumph","overview":"Prince Valiant and his army land at Thule and lay siege to the castle with the help of the local peasants.  Our heroes have an extra card to play when Dylan is taken hostage during a skirmish.  The prince relies on Merlin, Arn, and Rowanne to oversee his design to tunnel underneath the castle and cut off its water supply.  But this plan could be ruined when King Willam gets captured by Sinnin while trying to do things his own way.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809019c29579401ca510","order":500,"adult":false,"gender":2,"id":16407,"known_for_department":"Acting","name":"Roger Rees","original_name":"Roger Rees","popularity":9.572,"profile_path":"/qKWG7oxTL1JGzTzHLacsNLDAbNs.jpg"}]},{"air_date":"1992-05-10","episode_number":26,"episode_type":"finale","id":29429,"name":"The Dream Come True","overview":"The return of the queen completes the happiness that is widespread throughout Thule now that Sinnin is defeated.  The royal family finds pleasure in contemplating Valiant's future even though it must take him from Thule for many years.  Willam's final decision on how to deal with Sinnin inspires a partnership that could lead to a dark future for our heroes.  But first they must return to Camelot, where they learn that King Arthur has special plans for Prince Valiant.","production_code":"","runtime":30,"season_number":1,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":1600,"poster_path":"/r1ozWw5J7oVL4BqGOA86Pyl2Wvi.jpg","season_number":1,"vote_average":7},"2":{"_id":"5253808e19c29579401ca2da","air_date":"1992-10-02","episodes":[{"air_date":"1992-10-02","episode_number":1,"episode_type":"standard","id":29430,"name":"The Lost","overview":"Reports of Mordred's intentions to wage war against Arthur have reached Camelot, so the king has sent Sir Valiant to lead a small group in investigating the matter.  The prince is completely dedicated to conducting himself properly on his first important mission as a knight (much to his friends' displeasure).  So when Dennis is seriously injured while under his protection, Valiant throws caution to the wind in his efforts to save his young squire.  This leads to some dangerous confrontations with two familiar faces and an unruly army of mercenaries.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-10-09","episode_number":2,"episode_type":"standard","id":29431,"name":"The Deception","overview":"The body of Dylan, elder son of the exiled Sinnin, is brought to Camelot by a man who swears he saw Valiant commit the murder.  On the corpse is a message from Sinnin asking his other son Dennis to come back to the family and make a fresh start.  King Arthur, Merlin, and Dennis all have their doubts about the picture that is being presented before them.  Yet with Dylan's lifeless body right there and Valiant not present to deny the charges, what other explanation can there be?","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809019c29579401ca556","order":504,"adult":false,"gender":2,"id":162901,"known_for_department":"Acting","name":"Stephen Caffrey","original_name":"Stephen Caffrey","popularity":9.331,"profile_path":"/qvrH5yaO6EN04PeqcxTOUdUv04h.jpg"}]},{"air_date":"1992-10-16","episode_number":3,"episode_type":"standard","id":29432,"name":"The Black Rose","overview":"An attempt is made on Merlin's life by a member of the Brotherhood of the Black Rose.  But the wizard is more concerned about the threat this group poses to Arthur, who is away on a hunting trip with King Lot.  It is vital that Excalibur be delivered to the king before the dual threats of the Brotherhood and a band of Saxons overtake his small hunting party.  While on this journey, Merlin relates the true story of the Sword in the Stone to Valiant and Dennis.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-10-23","episode_number":4,"episode_type":"standard","id":29433,"name":"The Beggar","overview":"Valiant's knighthood and recent exploits commanding an army have given him such a swollen ego that he is neglecting his share of the work at the Castle Keep.  A special invitation to the Duke Griswald's wedding further raises his opinion of himself.  But the adulation Valiant has grown used to hearing turns to scorn after a robbery makes him appear to be a beggar.  His quest for aid leads to a lesson in humility from a stranger with an interesting history.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-10-30","episode_number":5,"episode_type":"standard","id":29434,"name":"The Flute","overview":"In the kingdom of Cathington, young Prince Henry cannot seem to do anything to make his father proud.  The severity with which King Donovan punishes his son for his failures sharply contrasts with the generosity he displays to his subjects and guests.  Among the king's current guests is Prince Valiant, who senses that both father and son are troubled in some way.  And then there is the mystery of the unknown flute player whose sad melody haunts the castle...","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809019c29579401ca59c","order":510,"adult":false,"gender":2,"id":655,"known_for_department":"Acting","name":"John Rhys-Davies","original_name":"John Rhys-Davies","popularity":26.057,"profile_path":"/bfn4WvhGo2QKYtv5ynk7tKu7NnL.jpg"}]},{"air_date":"1992-11-06","episode_number":6,"episode_type":"standard","id":29435,"name":"The Color of Honor","overview":"Believing that Sir Valiant has an innate understanding of justice, King Arthur appoints him to the distinguished post of Sheriff of Hammerscape.  An honored Valiant takes Arn and Rowanne with him to the town to begin his duties.  It's not long, though, before he learns how difficult it is to uphold both the letter of the law and the cause of justice.  This dilemma comes to a head when Sir Bryant is accused of high treason by the town's mayor.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809019c29579401ca5c2","order":501,"adult":false,"gender":2,"id":81662,"known_for_department":"Acting","name":"Richard Steven Horvitz","original_name":"Richard Steven Horvitz","popularity":8.601,"profile_path":"/pyL1MykCkuKTAp23PmmD6T8HVbn.jpg"},{"character":"","credit_id":"5253809119c29579401ca5d8","order":520,"adult":false,"gender":2,"id":34597,"known_for_department":"Acting","name":"Kevin McCarthy","original_name":"Kevin McCarthy","popularity":15.042,"profile_path":"/5VkWoJE2Q4a4Byfy3oEsGk5V1iP.jpg"}]},{"air_date":"1992-11-13","episode_number":7,"episode_type":"standard","id":29436,"name":"The Lesson Twice Learned","overview":"An ordinary mission brings Valiant into contact with an old friend he has not seen since Thule was first conquered.  Lorne, an old teacher of the prince's, has been using his expertise as a strategist to train peasants to defend their homes from danger.  Valiant offers the former Man-at-Arms a chance to once again plan and fight for a royal cause by returning with him to Camelot.  But is Lorne still up to the challenge of entering into combat amongst seasoned warriors?","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253808f19c29579401ca47a","order":518,"adult":false,"gender":2,"id":2372,"known_for_department":"Acting","name":"Ron Perlman","original_name":"Ron Perlman","popularity":49.324,"profile_path":"/9riPBfsWpzEzh2y9ucxTW22iakI.jpg"}]},{"air_date":"1992-11-20","episode_number":8,"episode_type":"standard","id":29438,"name":"Peace on Earth","overview":"Christmastime is fast approaching, and the people of Camelot are preparing to enjoy the holidays with such honored guests as Lady Daniella of the Misty Isles.  But the yultide cheer has been incomplete due to the continued absence of the many knights and soldiers off fighting a bloody war alongside their allies in North Gallace.  Our heroes can see little hope for peace as the bloodshed increases by leaps and bounds.  A Christmas miracle is desperately needed to ensure that no more lives are lost during what should be a joyous time of year.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809119c29579401ca624","order":517,"adult":false,"gender":2,"id":2,"known_for_department":"Acting","name":"Mark Hamill","original_name":"Mark Hamill","popularity":19.658,"profile_path":"/2ZulC2Ccq1yv3pemusks6Zlfy2s.jpg"}]},{"air_date":"1992-11-27","episode_number":9,"episode_type":"standard","id":29439,"name":"The Cursed","overview":"Lucitain refugees are journeying to the town of Serenity to start a new life in Camelot, so Sir Valiant is sent there to ensure their resettlement goes smoothly.  Rowanne accompanies him in order to visit her cousin Carl, whom she hasn't seen in years.  The pair arrive only to learn that Carl - as well as the rest of the native town inhabitants - has been experiencing hard times ever since the Lucitains arrived.  Valiant and Rowanne must do some investigating to uncover the real source of Serenity's trouble.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809119c29579401ca64a","order":507,"adult":false,"gender":2,"id":130581,"known_for_department":"Acting","name":"Thom Bray","original_name":"Thom Bray","popularity":4.185,"profile_path":"/s1Y98hwyo8SdiDfEIWtn9XZUjeq.jpg"}]},{"air_date":"1992-12-04","episode_number":10,"episode_type":"standard","id":29440,"name":"The Traitor","overview":"Sir Lymond sends word to Arthur that the northern Venicone tribe has finally agreed to negotiate a trade agreement with Camelot.  Sir Gawain and the trio are then sent north to help Lymond prepare for the king and queen's arrival.  While there, our heroes begin to suspect that the Venicones actually have hostile intentions.  Some undercover spying in the Venicone camp is required in order to gather enough evidence to warn Arthur of the danger he may be in.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-12-11","episode_number":11,"episode_type":"standard","id":29441,"name":"Empty Justice","overview":"The trio's mission to aid the town of Rheged in its reconstruction efforts leads to a joyful reunion between Arn and his old friend Harold.  The pair grows closer than ever as Arn meets Harold's family and hears Harold's dream of Arn's future knighthood.  Things take a horrible turn when Harold's old deception comes back to haunt him.  The resulting tragedy infects Arn with a violent desire for revenge that not even Valiant and Rowanne can talk him out of.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-12-18","episode_number":12,"episode_type":"standard","id":29442,"name":"The Crossbow","overview":"Valiant has a new crossbow that he believes will finally give him the advantage in an archery match against Rowanne.  But something happens to make the prince drop his weapon and leave the practice field without it.  Unfortunately, Dennis and his friend Wesley find the crossbow and begin to play with it.  This causes an accident that may cost Dennis someone he dearly loves.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1992-12-25","episode_number":13,"episode_type":"standard","id":29443,"name":"The Rival","overview":"Three lucky youths will be chosen from those competing in the Queen's Festival Competition to train for knighthood in Camelot.  Before the festival begins, Rowanne meets a sweet young woman named Fiona who idolizes her and wants to be a knight.  Rowanne decides her new friend has as much right to compete as any young man and makes sure that she is signed up.  Yet she begins to regret this when Fiona proves to be too impressive a rival both on and off the combat field.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-01-01","episode_number":14,"episode_type":"standard","id":29444,"name":"The Tree","overview":"The entire town of Harmony is up in arms against the neigboring town of Perkshire.   The dispute centers on the fate of Adam's Oak, a beautiful and historically significant tree that is in danger of being torn down to make room for a bridge.  Prince Valiant must settle the dispute but soon learns that both sides have convicing arguments in their favor.  Valiant's eventual decision leads to a surprise stand-off against an old friend who tells him to change his mind or fight to the death.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-01-08","episode_number":15,"episode_type":"standard","id":29437,"name":"The Princess Aleta","overview":"A message from King Hugo asks that Camelot's army be send to the Misty Isles to help defeat a barbarian army.  Arthur's knights, who have always believed that realm to be a myth, are suprised that their king plans to help the man who once tried to usurp his throne.  It falls to Valiant to lead Arn, Rowanne, and 100 men across dangerous waters to reach the island nation.  The prince then finds an unexpected source of beauty and spirit residing within these dreary shores.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-01-15","episode_number":16,"episode_type":"standard","id":29445,"name":"The Voyage","overview":"Despite King Arthur's misgivings, Valiant sets sail for the Misty Isles in order to bring King Hugo back to talk peace with Camelot.  The mission affords Valiant the chance to get closer to Princess Aleta, which does not sit well with Rowanne.  This delicate situation is made more tenuous when Rowanne suggests that Valiant plot a faster course through rough waters.  What happens when this new course is taken puts the ship's passengers in more danger than Rowanne intended.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-01-22","episode_number":17,"episode_type":"standard","id":29446,"name":"Mordred's Return","overview":"The people of Camelot give Mordred a hero's welcome when he returns in the company of Valiant and his party.  King Arthur is less than pleased by this turn of events - the same goes for Valiant, who is hostile towards his old foe as well as the Princess Aleta.  Revealing the events of the past voyage is the only way for Camelot's enemies to be driven from its shores.  Can Rowanne put her jealousy aside and do what's right for the kingdom?","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-01-29","episode_number":18,"episode_type":"standard","id":29447,"name":"The Rescue","overview":"Still reeling from the events of the past few days, Valiant requests permission to be sent on a mission that will take him away from Camelot for awhile.  The king dispatches him to the Hinterland to help Sir Gawain investigate reports of missing townsfolk and livestock.  What the prince finds there is more repulsive than he could ever have imagined.  Meanwhile, Rowanne has a talk with Aleta that leads the princess to make a drastic change in her life.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-02-05","episode_number":19,"episode_type":"standard","id":29448,"name":"The Parting","overview":"Trouble is brewing in Christendon in the form of a secret rebellion among soldiers loyal to Sir Mordred's philosophy.  King Arthur, aware of this threat, advises Valiant to watch himself around Aleta since she may pose a threat to Camelot.  The prince, once sure of Aleta's feelings and loyalties, finds himself doubting the princess when he learns that she intends to sail back to the Misty Isles.  His efforts to find proof of her true affiliation leads him right to the inner circle of Christendon's traitorous rebellion.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-02-12","episode_number":20,"episode_type":"standard","id":29449,"name":"The Walls of Tyranny","overview":"King Ian of Kengary has been killed in the middle of his campaign against the McGrath clan.  Duncan Draconarius - Ian's trusted friend and advisor - cannot hope to continue the war and avenge his king's death until the subject of Ian's succession is settled.  A peace delegation led by Sir Valiant is sent to Kengary to help straighten up the mess and determine whether Camelot should send military aid to its ally.  Unfortunately, all is not solved even when a new ruler is abuptly decided upon.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-02-19","episode_number":21,"episode_type":"standard","id":29450,"name":"The Jubilee","overview":"The kingdom of Arcadia, a longtime ally of Camelot, is celebrating a Silver Jubilee in honor of Queen Eleanora's twenty-five year reign.  Guinevere is positively giddy at the prospect of being reunited with her oldest and dearest friend after ten long years.  The two women pick up their friendship right where they left off and devote most of the festivities to catching up.  This joyous reunion turns sour when the trio reveals to the queen exactly what Eleanora has been up to in the years they've been separated.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809319c29579401ca712","order":508,"adult":false,"gender":1,"id":1217798,"known_for_department":"Acting","name":"Liz Georges","original_name":"Liz Georges","popularity":3.576,"profile_path":null}]},{"air_date":"1993-02-26","episode_number":22,"episode_type":"standard","id":29451,"name":"The Treaty","overview":"Troubles with the Vikings have been growing steadily worse this past spring.  King Arthur decides that he must finally make a direct effort to form a peace treaty with King Olaf in order to stop the loss of life and property.  But this delicate mission begins on a ominous note when he discovers that an item critical to its success has been stolen.  It's one bad turn after another as Valiant and the others journey to the north during a time of great unrest in their kingdom.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-03-05","episode_number":23,"episode_type":"standard","id":29452,"name":"The Blackest Poison","overview":"The neighboring kingdom of Velquin would make a powerful ally for Camelot, so Arthur and Guinevere decide to meet with King Edward to discuss the matter.  While Edward appears to be open to embracing the ideals of the New Order, his sister Sadisa is a firm believer in her people's tradition of conquest.  This tense and delicate situation grows profoundly worse when Arthur is poisoned during dinner.  Can Guinevere continue the peace talks while her husband is dying and the knights are ready to wage war?","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809319c29579401ca748","order":505,"adult":false,"gender":2,"id":5589,"known_for_department":"Acting","name":"John Glover","original_name":"John Glover","popularity":15.523,"profile_path":"/aPmq20MXqFALrUxaaJoC2Xonumo.jpg"},{"character":"","credit_id":"5253809319c29579401ca75e","order":521,"adult":false,"gender":2,"id":33836,"known_for_department":"Acting","name":"Sean O'Bryan","original_name":"Sean O'Bryan","popularity":8.286,"profile_path":"/5CZMf2bRnV9o5kcylbtUPlSbI7P.jpg"}]},{"air_date":"1993-03-12","episode_number":24,"episode_type":"standard","id":29453,"name":"The Hero","overview":"Raymond of Longport, the mightiest tournament fighter in the land, is the object of hero-worship amongst all who've heard of him.  This includes Dennis, who's trembling with excitement at the prospect of seeing him while accompanying the trio on a mission in Longport.  Valiant alone finds Raymond unappealing after he sees the fighter abuse his fame at a local tavern.  Arn and Rowanne attribute Valiant's dislike to jealousy over Dennis, but it's not long before Raymond gives everyone cause for alarm.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253808f19c29579401ca47a","order":518,"adult":false,"gender":2,"id":2372,"known_for_department":"Acting","name":"Ron Perlman","original_name":"Ron Perlman","popularity":49.324,"profile_path":"/9riPBfsWpzEzh2y9ucxTW22iakI.jpg"}]},{"air_date":"1993-03-19","episode_number":25,"episode_type":"standard","id":29454,"name":"The Vision","overview":"All Valiant, Arn, Rowanne, Dennis, and Merlin want to do is attend the nearby Spring Festival in peace.  But one disaster after another befalls them on what should be a simple journey.  The minor inconveniences eventually escalate into serious danger when the unarmed group wanders into a nortoriously lawless area.  An abnormally tense Valiant grows angry at Dennis for inventing childish schemes to solve their problems - as it turns out, one of those dreams holds the key to their salvation.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-03-26","episode_number":26,"episode_type":"standard","id":29455,"name":"The Shadows of Destiny","overview":"Valiant and Rowanne stumble over a book written by Merlin that describes future events.  The two friends are determined to challenge destiny by changing the tragic outcome of an entry dated two days in the future.  Their journey takes them to the ruins of a kingdom suspicious of outsiders and long hostile towards Camelot.  But with the fate of their kingdom depending on their success, the young heroes will stop at nothing to ensure its light of hope does not go out.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-04-02","episode_number":27,"episode_type":"standard","id":29457,"name":"The Eyes of the Serpent","overview":"A recurring nightmare involving a golden serpent has the prince worried about his future and the safety of Camelot.  Merlin tries to reassure him that some dreams are just dreams and sends him on a mission to see The Mighty Oom.  While there, Valiant's dream grows more vivid and deadly - he can feel that something bad is coming.  What eventually does come threatens Camelot as well as a lovely young woman Valiant meets.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809419c29579401ca7d0","order":516,"adult":false,"gender":2,"id":18,"known_for_department":"Acting","name":"Brad Garrett","original_name":"Brad Garrett","popularity":19.75,"profile_path":"/813ffbpoaoaJRdoe1yrbivboWKp.jpg"}]},{"air_date":"1993-04-09","episode_number":28,"episode_type":"standard","id":29456,"name":"The Spirit of Valor","overview":"Guinevere's goddaughter Celeste, the sole ruler of Velfort, is going to be married to King Aramis of Aquatian.  Only the trio accompanies Arthur and Guinevere dispite the fact that Aramis was formerly an enemy of Camelot.  Once again, Arn is nervous to be amongst so many noble guests at the wedding.  When Celeste's cousin Claudio suggests he try some \"\"liquid courage,\"\" Arn accepts the offer with disasterous results.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809019c29579401ca510","order":500,"adult":false,"gender":2,"id":16407,"known_for_department":"Acting","name":"Roger Rees","original_name":"Roger Rees","popularity":9.572,"profile_path":"/qKWG7oxTL1JGzTzHLacsNLDAbNs.jpg"}]},{"air_date":"1993-04-16","episode_number":29,"episode_type":"standard","id":29458,"name":"The Aurora","overview":"An unexpected death the day before a royal christening seems to signal the approach of some great calamity.  That calamity comes when Merlin is kidnapped while under Rowanne's protection.  Very rapidly, Rowanne begins feeling isolated from everyone she trusts as accusations from the people of Northland are thrown at her.  How she responds to the situation could end her future at Camelot as well as her relationships with Valiant and Arn.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809419c29579401ca7f6","order":509,"adult":false,"gender":2,"id":19547,"known_for_department":"Acting","name":"Gregg Berger","original_name":"Gregg Berger","popularity":4.272,"profile_path":"/bMlJUmhblX50gQrnA8XWG7UuaLk.jpg"}]},{"air_date":"1993-04-23","episode_number":30,"episode_type":"standard","id":29459,"name":"The Burning Bridge","overview":"King Arthur is determined to make the journey to Northland and attend Michael's coronation despite the danger along the way.  He assigns Valiant the dual tasks of preparing the security measures for the journey and delivering a personal message to Rowanne.  Unfortunately, Rowanne made it quite clear after recent events that she wants nothing to do with either Valiant or Camelot.  Still, both Valiant and Arn pray for the best as they ride to Bridgeford, leaving Sir Bryant to lead the garrison right into an ambush.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809419c29579401ca7f6","order":509,"adult":false,"gender":2,"id":19547,"known_for_department":"Acting","name":"Gregg Berger","original_name":"Gregg Berger","popularity":4.272,"profile_path":"/bMlJUmhblX50gQrnA8XWG7UuaLk.jpg"},{"character":"","credit_id":"5253809419c29579401ca81c","order":511,"adult":false,"gender":2,"id":12077,"known_for_department":"Acting","name":"Jim Cummings","original_name":"Jim Cummings","popularity":11.679,"profile_path":"/c0sQPRCM5Ri3F4gVyxPr4AcPmIq.jpg"}]},{"air_date":"1993-04-30","episode_number":31,"episode_type":"standard","id":29460,"name":"The Sage","overview":"The time has come for Rowanne to face King Arthur and ask for forgiveness.  She has her chance in Northland in the days preceding Michael's coronation, but she gets distracted by Michael's attentions to her.  The future king should be paying more attention to Selena and the threat she poses to his reign.  It's up to Valiant and Merlin to keep an eye on the cunning sage and see that the coronation goes as planned.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809419c29579401ca7f6","order":509,"adult":false,"gender":2,"id":19547,"known_for_department":"Acting","name":"Gregg Berger","original_name":"Gregg Berger","popularity":4.272,"profile_path":"/bMlJUmhblX50gQrnA8XWG7UuaLk.jpg"}]},{"air_date":"1993-05-07","episode_number":32,"episode_type":"standard","id":29461,"name":"The Song of Valor","overview":"Our heroes perform a daring rescue upon encountering two monks being robbed by a band of brigands.  Arn actually deserves the most credit but, as usual, makes light of his heroics out of low self-esteem.  He is put to the test when Rowanne is kidnapped and he and Valiant must venture into a trap to save her.  Circumstances soon force Arn to face his self-doubt and the forces of the Duke of Lionsgate alone.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-05-14","episode_number":33,"episode_type":"standard","id":29462,"name":"The Ring of Truth","overview":"War is brewing between Northland and Grafton, both of whom have signed treaties with Camelot and expect the kingdom to send its armies to help.  King Arthur refuses to choose between his allies until he knows the cause of the trouble.  He makes arrangements for the trio to find a diplomatic solution to the problem, not knowing that the rulers of Northland and Grafton both lack a clear sense of what is going on.  There is an outside force orchestrating this unrest; this force is determined to use our heroes' deaths to ensure that Camelot gets swept into a war it cannot win.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809419c29579401ca86e","order":515,"adult":false,"gender":2,"id":35040,"known_for_department":"Sound","name":"Paul Williams","original_name":"Paul Williams","popularity":14,"profile_path":"/hfBFenLU5reDGVi4wiP5P1VcP3G.jpg"}]},{"air_date":"1993-05-21","episode_number":34,"episode_type":"standard","id":29463,"name":"A Light in the Dark","overview":"Valiant is directly advised against returning to Camelot via a dangerous route through the Great Swamp.  But the prince is far too curious about the \"\"great evil\"\" that lives there to pass up the chance to investigate.  Arn and Rowanne soon wish he had heeded the warning as they are all attacked by creatures out of a nightmare.  In fact, that's just where they've landed themselves - in a nightmare world that is controlled by an old enemy.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-05-28","episode_number":35,"episode_type":"standard","id":29464,"name":"The Ghost","overview":"A convocation of the world's greatest scholars is being held in Camelot under Merlin's direction.  The wizard's pleasure at the wonderful turnout turns to fear when he spots a face from a past event he has long kept hidden from Arthur.  His terror at being exposed causes him to shun virtually everyone at the celebration, including his old friend The Mighty Oom.  But a series of mysterious accidents may force Merlin to confess his greatest shame to preserve the safey of those he loves.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-06-04","episode_number":36,"episode_type":"standard","id":29465,"name":"A New Dawn","overview":"Princess Aleta and King Hugo's visit to Camelot shortly precedes Sir Mordred's triumphant return from King Olaf's court.  Lord Maldon has also arrived to continue stirring up trouble between native Camelotians and their foreign neighbors.  Tensions mount between Arthur and Mordred over their long-held philosophical differences and Hugo and Valiant over Aleta's future.  In such a heated environment, one spark is all that's needed to send everyone spiraling out in different directions - all for Mordred's benefit.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-06-11","episode_number":37,"episode_type":"standard","id":29466,"name":"The Death of Arthur","overview":"Lord Maldon and his follower Allen have stepped up their efforts to generate civil unrest between foreigners and native Camelotians.  One of their schemes forces Valiant to return to Camelot for the sake of an injured loved one.  Once home, he learns that King Arthur intends on taking advantage of the upcoming Sword and the Stone Celebration to set in motion a plan to help combat Mordred's forces.  What shocks the prince, the queen, and the other Knights of the Round Table about this plan is that their king must die for it to succeed.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-06-18","episode_number":38,"episode_type":"standard","id":29467,"name":"The Gathering Storm","overview":"Mordred's army is only two days from the castle and outnumbers Camelot's forces three to one.  This leaves Valiant with the dual tasks of fortifying his soldiers for a bloody battle and convincing the fleeing populace that all hope did not die with Arthur.  The surprise reappearance of Lady Morgana does little to ease our hero's troubled state of mind.  Especially after she hands him solid proof identifying the knight who is even now plotting to cripple the command structure of Camelot's army.","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253809519c29579401ca8d4","order":502,"adult":false,"gender":1,"id":19548,"known_for_department":"Acting","name":"Susan Blu","original_name":"Susan Blu","popularity":3.01,"profile_path":"/xDtrH8YqqVc11kAUThxG80AaaHP.jpg"},{"character":"","credit_id":"5253809519c29579401ca8ea","order":519,"adult":false,"gender":2,"id":84495,"known_for_department":"Acting","name":"Jess Harnell","original_name":"Jess Harnell","popularity":6.2,"profile_path":"/zQ2zg7PL3ut4JhfXMKSRV4FMnxR.jpg"}]},{"air_date":"1993-06-25","episode_number":39,"episode_type":"finale","id":29468,"name":"The Hinge of Fate","overview":"The battle with Mordred's forces is fast approaching and things do not look good for our heroes.  Aleta and her army could offer Camelot the support it currently lacks from its people, but only if Lord Maldon does not act on his suspicions of the Queen of the Misty Isles.  Meanwhile, Allen returns to the Chapel of the Sword and the Stone and uncovers far more than he was sent to find.  Could his discovery save the New Order from oblivion, or are Valiant, Arn, Rowanne, and their army doomed to be crushed by Mordred's superior numbers?","production_code":"","runtime":30,"season_number":2,"show_id":529,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5253808f19c29579401ca47a","order":518,"adult":false,"gender":2,"id":2372,"known_for_department":"Acting","name":"Ron Perlman","original_name":"Ron Perlman","popularity":49.324,"profile_path":"/9riPBfsWpzEzh2y9ucxTW22iakI.jpg"}]}],"name":"Season 2","overview":"","id":1601,"poster_path":"/6T2iqnn9uX2OwOcpyEeAQDKk2bw.jpg","season_number":2,"vote_average":0}}}