{"adult":false,"backdrop_path":"/kfa9T0cUnyTAMhgdolA5ePIP1S9.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2011-10-09","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://braingames.nationalgeographic.com/","id":54315,"in_production":false,"languages":["en"],"last_air_date":"2020-03-02","last_episode_to_air":{"id":2179375,"name":"Tiffany Haddish: Movie Magic","overview":"","vote_average":0,"vote_count":0,"air_date":"2020-03-02","episode_number":8,"episode_type":"finale","production_code":"","runtime":60,"season_number":8,"show_id":54315,"still_path":"/3epxM2XkmgHB5vOi9sNfeLzC9yg.jpg"},"name":"Brain Games","next_episode_to_air":null,"networks":[{"id":43,"logo_path":"/q9rPBG1rHbUjII1Qn98VG2v7cFa.png","name":"National Geographic","origin_country":"US"}],"number_of_episodes":65,"number_of_seasons":8,"origin_country":["US"],"original_language":"en","original_name":"Brain Games","overview":"Get ready to have your mind messed with! \"Brain Games\" is a groundbreaking series that uses interactive experiments, misdirection and tricks to demonstrate how our brains create the illusion of seamless reality through our memory, through our sensory perception, and how we focus our attention.","popularity":23.18,"poster_path":"/1hGDLtVGomV5peD1BcPN8HRymad.jpg","production_companies":[{"id":26767,"logo_path":null,"name":"Atomic Entertainment","origin_country":""},{"id":7521,"logo_path":"/fRqMjLjyAqThtEg9P9WKCXLmCpJ.png","name":"National Geographic","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"2014-09-05","episode_count":4,"id":61619,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2011-10-09","episode_count":3,"id":61620,"name":"Season 1","overview":"","poster_path":"/4EfWOeOC3O1Ee3CQV0KiMUHmIgx.jpg","season_number":1,"vote_average":8},{"air_date":"2013-04-22","episode_count":12,"id":61621,"name":"Season 2","overview":"","poster_path":"/uWesIOI3SDYoLYYuiQO0CKG1c0f.jpg","season_number":2,"vote_average":7.9},{"air_date":"2013-11-11","episode_count":10,"id":61622,"name":"Season 3","overview":"","poster_path":"/tu8BkLXxLIdHMUT2YwjIPwxUqdD.jpg","season_number":3,"vote_average":7.9},{"air_date":"2014-07-14","episode_count":10,"id":61623,"name":"Season 4","overview":"","poster_path":"/ldDgSl4PrsTNEJIh4QP7bKalsfZ.jpg","season_number":4,"vote_average":0},{"air_date":"2015-01-19","episode_count":10,"id":68126,"name":"Season 5","overview":"","poster_path":"/q9sIKE0KStfdzCn2da2Ivb8xpAm.jpg","season_number":5,"vote_average":0},{"air_date":"2015-06-28","episode_count":6,"id":90865,"name":"Season 6","overview":"Kicking off the summer, Jason Silva hits the streets of New York and Las Vegas with new, captivating social experiments that reveal mysteries of the human mind. Experts across the fields of cognitive science, neuroscience and psychology join Silva in uncovering the processes behind daily activities, such as positive thinking, sleep, perspective, imagination, the unscrupulous world of scams and more. And delve into the differences and similarities between humans and animals in relation to jealousy, eating, memory, mating and more.","poster_path":"/la3u9tlP3NeRO7KaKnwekqNp9db.jpg","season_number":6,"vote_average":0},{"air_date":"2016-02-14","episode_count":6,"id":90862,"name":"Season 7","overview":"","poster_path":"/foxK4ZNMkkmlOxuNuqKafvPCTCe.jpg","season_number":7,"vote_average":0},{"air_date":"2020-01-20","episode_count":8,"id":141455,"name":"Season 8","overview":"","poster_path":"/1hGDLtVGomV5peD1BcPN8HRymad.jpg","season_number":8,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":7.591,"vote_count":44,"season_data":{"1":{"_id":"53b8e8d20e0a2676d3008a90","air_date":"2011-10-09","episodes":[{"air_date":"2011-10-09","episode_number":1,"episode_type":"standard","id":994017,"name":"Watch This!","overview":"Hack into the ultimate supercomputer ' the human brain ' as Hollywood filmmakers use color, light, motion, depth and sound to create mind-bending sensory illusions. Is it possible to feel the sensation of accidentally cutting your finger ' just by watching TV? Much of what we experience may be a mere fabrication, as our brains fill in gaps and stitch together a complete picture of the world bit-by-bit, designed to overcome our eyes' blind spots. But what happens when your senses get crossed?","production_code":"","runtime":46,"season_number":1,"show_id":54315,"still_path":"/wBZGRzQDwbhV1pLDI4QXiGBR7z.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-10-09","episode_number":2,"episode_type":"standard","id":994018,"name":"Pay Attention!","overview":"When it comes to mastering and manipulating attention, some of the world's leading experts aren't scientists; they're magicians like David Copperfield. While the brain's attention acts a bit like a spotlight to filter and make sense of a busy world, it can be easily controlled and deceived. Copperfield and a team of experts test, trick and fool using an elegant form of attention control.","production_code":"","runtime":46,"season_number":1,"show_id":54315,"still_path":"/oW9r5XmZuewVxLFwcMsk2pdCCyI.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2011-10-09","episode_number":3,"episode_type":"finale","id":994019,"name":"Remember This!","overview":"With memory, things are not always as they seem: Details go missing, recollections change, and sometimes our brains fill in the blanks and create false visual memories. Our experts are on a mission to find out where memories reside in the brain by examining every millimeter for clues. Investigating every piece of the memory puzzle, from how we recognize faces even if they have been digitally distorted to how we can move memories from short-term to long-term storage.","production_code":"","runtime":46,"season_number":1,"show_id":54315,"still_path":"/eaeohNJ1vNxKml2WXwHhQlHi5yQ.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":61620,"poster_path":"/4EfWOeOC3O1Ee3CQV0KiMUHmIgx.jpg","season_number":1,"vote_average":8},"2":{"_id":"53b8e8d40e0a2676cf008c58","air_date":"2013-04-22","episodes":[{"air_date":"2013-04-22","episode_number":1,"episode_type":"standard","id":994020,"name":"Focus Pocus","overview":"Think your field of vision is really in focus, or that your brain is focusing on everything happening in front of you? Think again. Brain Games reveal; the secrets behind the mysteries of focus and attention.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/gcAwmJYOu8VG7nC4udQvZ8uxRHS.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2013-04-22","episode_number":2,"episode_type":"standard","id":994021,"name":"It's About Time","overview":"Ever wonder why a watched pot never boils? See how the brain can actually warp and shift time, giving a false impression of the order and the speed of events. Neuroscientist Dr. Chess Stetson explains the oddball effect using a series of pictures. Illusionist Apollo Robbins uses juggling pins to demonstrate what happens when the brain doesn't have enough time to process a large amount of information, while host Jason Silva plays with the speed of sound and light to find out why movies and television shows are sometimes out of sync.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/1BR7FyddAknSGqP8mih1EBJAcq6.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-04-29","episode_number":3,"episode_type":"standard","id":994022,"name":"Motion Commotion","overview":"This is a show about your brain and how it perceives motion. Evolving in a world that is constantly moving, the human brain had to develop a pretty sophisticated sense of motion in order to survive. This episode stops to ask some deceptively simple questions-What really is motion? Is the movement that you see real? Or is the wiring of your brain's motion detectors merely being fooled? We explore the science behind how your brain detects and interprets motion, and you'll see how easily this hard-wiring can be fooled... for better and for worse.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/fR34hJmGsLt6HQ8is4ASpTC9ysS.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-04-29","episode_number":4,"episode_type":"standard","id":994023,"name":"Don't Be Afraid","overview":"Our experts examine the brain's internal tug of war between fear and rationalization. Whether boarding an airplane or walking down a spooky street at night, we'll see how dread and anticipation build feelings of fear. Putting our host's emotions to the test, Apollo Robbins challenges Jason Silva to a game of Russian roulette. Then, with the help of John Harlacher, co-director of one of New York City's scariest haunted houses, we \"Fear Factor\" a group of volunteers. Without their senses of sight, sound, or control of their limbs, see how they react to snakes, cockroaches and rats... or so they think.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/kMBzeHk10Q9vDpqzMhmnwkde1Qy.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-05-06","episode_number":5,"episode_type":"standard","id":994024,"name":"Power of Persuasion","overview":"By exposing us to specific stimuli, Jason Silva can prime our brains to respond in certain ways. See how identical twins interview for the same job, in the same clothes, with the same resume. They even give the exact same answers-but the order of the words in their answers is slightly different. The result? One twin comes off negative, and the other gets the job. Would you believe that Texas seceded from the U.S. if a crazy-looking guy told you? Probably not, but what if a news reporter with a microphone did? This episode unveils the subtle tactics that advertisers, marketers and con men can use to get you to do what they want, without you noticing.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/dBp1LdT62SNxLwroz7ZmqVnyYup.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-05-13","episode_number":6,"episode_type":"standard","id":994025,"name":"What You Don't Know","overview":"Bet you could explain something as basic as how a zipper works? Or correctly draw something as simple as a bicycle? If you said yes, you likely bet wrong... but don't worry it's not just you! When you stop and think about it, you're probably not that aware of all of the things you don't understand. The fact is we go through our daily lives feeling pretty confident in our knowledge and understanding of the world, but that confidence is mostly an illusion. In this episode of Brain Games, we'll show you firsthand just how the \"illusion of knowledge\" plagues the human brain and why we fall victim, again and again, to the notion that we understand more than we actually do.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/9ezFKIsjFf8w6vArJjwB5nr3XxP.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-05-20","episode_number":7,"episode_type":"standard","id":994026,"name":"Battle of the Sexes","overview":"From the second you're born, you're a unique individual. You'll make choices about your friends, your career, your relationships, where you live, and how you dress. But one thing you don't get to choose is whether you were born a man or a woman - and that flip of the genetic coin will play a huge role in determining how you think about...well, almost everything. In this episode, we find out once and for all which gender's hard drive is wired better...for doing what.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/xJ6VjnFmju4UZ7y2UWe2bnKh3bk.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-05-27","episode_number":8,"episode_type":"standard","id":994027,"name":"Seeing is Believing","overview":"Seeing is believing, right? Not necessarily. It all depends on your perspective. In this episode of Brain Games, mind-bending illusions will show you the ways in which your visual perceptions can be surprisingly off.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/gbzUGvap8dMatKRNFfHaD9aD8ih.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-06-03","episode_number":9,"episode_type":"standard","id":994028,"name":"You Decide","overview":"Every time you make a decision, your brain enters an often invisible battle between risk and reward. Through a series of addictive interactive games, surprising experiments, and relatable experts you'll learn astonishing facts about how you make decisions - and how to get better at making them.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/5vinD5ePLfqaPG0MjAgAaR3LDLj.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-06-10","episode_number":10,"episode_type":"standard","id":994029,"name":"Use It or Lose It","overview":"All the latest research says that your brain needs exercise to stay youthful and fit. Wonder junkie Jason Silva and deception specialist Apollo Robbins are going to put your brain to the test with a serious workout.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/jAAg8VlkAlrm6jMKfRmPe9NGSK1.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-06-17","episode_number":11,"episode_type":"standard","id":994030,"name":"Illusion Confusion","overview":"Brain Games reveals how optical illusions are a great way of showing the powerful mechanisms at work that allow your brain to perceive three dimensions.","production_code":"","runtime":23,"season_number":2,"show_id":54315,"still_path":"/qvMhUDAIcijVlW7M73sPxxVy7cg.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-06-24","episode_number":12,"episode_type":"finale","id":994031,"name":"Liar, Liar","overview":"Host Jason Silva and deception specialist Apollo Robbins break down why we lie and what happens in the brain, even though science tells us that the truth is physiologically and neurologically easier.","production_code":"","runtime":60,"season_number":2,"show_id":54315,"still_path":"/jjE55MDhMb7ndr6UqIL2QSHqDkR.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":61621,"poster_path":"/uWesIOI3SDYoLYYuiQO0CKG1c0f.jpg","season_number":2,"vote_average":7.9},"3":{"_id":"53b8e8d60e0a2676c4008c81","air_date":"2013-11-11","episodes":[{"air_date":"2013-11-11","episode_number":1,"episode_type":"standard","id":994035,"name":"Battle of the Ages","overview":"While it's long been believed that both your body and your brain deteriorate over time, recent studies show that may not always be the case. Some brain functions improve as we get older, while others don’t fully develop until later in life. In this episode, we explore your brain and how it doesn’t always act its age. Through a series of games and experiments, you'll discover how your daily routines might be aging your brain, and how you can actually slow down the clock.","production_code":"","runtime":23,"season_number":3,"show_id":54315,"still_path":"/i5sj3sT53OqdNdIWybvjni6p0ze.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2014-01-13","episode_number":2,"episode_type":"standard","id":994032,"name":"In Living Color","overview":"Think you understand the colors you see every day? Think an apple is actually red, or a leaf is really green? Think again. This episode of Brain Games puts your brain to the ultimate test with a series of interactive games and fascinating experiments that will reveal a shocking truth—color is just an illusion created by your brain. We'll show you how some colors can make you fly, reveal ghostly colors that don't actually exist, and if you play along you’ll see how color helps keep you alive.","production_code":"","runtime":60,"season_number":3,"show_id":54315,"still_path":"/kstTqHgWoeyu5HHcOGP5kGxUuc2.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-01-13","episode_number":3,"episode_type":"standard","id":994033,"name":"Laws of Attraction","overview":"In this episode you'll play along with interactive games that unlock the secrets to attraction, learn how your brain quickly calculates what's attractive (or not), and discover how hidden formulas can predict who you consider beautiful. Explore the secrets of long-term relationships, and play along to discover just what it is that attracts two people together beyond conscious control—including a shocking revelation of the one body part that can often predict compatibility. From secret formulas to brainwave patterns, you'll see the mysteries of attraction revealed.","production_code":"","runtime":23,"season_number":3,"show_id":54315,"still_path":"/tLSH24ZkdejSoAOUWmUXYsxcvsg.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-01-20","episode_number":4,"episode_type":"standard","id":994034,"name":"Trust Me","overview":"This is a show about your brain and trust. Does it sometimes seem like you have to be on your guard all the time against untrustworthy advertisers, politicians, and other people? So how do you maintain a level of trust in an untrustworthy world - and what is trust anyway? Through a series of fun and interactive games, you’ll learn to trust others a little more and your own brain a little less! Prepare to put your trust in Brain Games.","production_code":"","runtime":23,"season_number":3,"show_id":54315,"still_path":"/rHMGihT5kP2v0GkcEgxurgTWCpf.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2014-01-27","episode_number":5,"episode_type":"standard","id":994036,"name":"Stress Test","overview":"This is a show about your brain and stress. You'll see how your brain manages stress and how stress also manages you. From traffic jams to screaming babies, angry bosses to bill payments, you're surrounded by stress every day. But stress has a purpose, and you’ll discover why it's a good thing in many situations, even though it can overwhelm you. That said, don't let stress stress you out—there are ways to manage it! Through a series of interactive games and experiments, you’ll discover how stress works—and how to handle it better.","production_code":"","runtime":23,"season_number":3,"show_id":54315,"still_path":"/b8y1c2gCAFXn1m5ek5gN8xerMMC.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2014-02-03","episode_number":6,"episode_type":"standard","id":994037,"name":"What's Going On?","overview":"Whether it's remembering where you parked the car, or just finding the light switch in the morning, navigating your busy world can be tough. Luckily your brain has a built-in navigation system to help make sense of your surroundings. In fact, recent discoveries prove that the brain uses place cells and direction cells to help get us to where we're going. In this episode we explore spatial awareness. It's how your brain tells you where you are. Through a series of games and experiments we’ll test the boundaries of your brain’s hardwired sense of direction, and prove how you aren’t always aware of your surroundings or even your body. Plus you’ll learn a surprising technique to enhance your spatial memory.","production_code":"","runtime":23,"season_number":3,"show_id":54315,"still_path":"/9EcvL1ldzFqFeMHAZPkTGMWVQJt.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2014-02-24","episode_number":7,"episode_type":"standard","id":994038,"name":"Retrain Your Brain","overview":"Are you stuck with the brain you're born with, or can you improve it? It's easy to upgrade the electronic devices you rely on every day; can you do the same with your brain? The answer might surprise you. Discover how to take advantage of your brain's mental shortcuts, and how to be on the lookout for the little short circuits that can crash your system. We're going to hack your neural network to access secret mental software that can change your life, and if you play along you’ll get to try your hand at the only game PROVEN to boost your IQ.","production_code":"","runtime":23,"season_number":3,"show_id":54315,"still_path":"/z4yb9dDqDTWTmzViAgRk86dfp1M.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2014-03-03","episode_number":8,"episode_type":"standard","id":994039,"name":"Mind Your Body","overview":"Your mind and your body are connected in countless ways, some more mysterious than others. One might even call them \"frenemies\"—at times they work together like the best of friends, at others they fight like the fiercest of enemies. In this episode, we'll reveal what's happening when your brain betrays your body and the other way around. You'll learn some secrets about your body's reaction time as well as some physical feats that will baffle and amaze your friends.","production_code":"","runtime":23,"season_number":3,"show_id":54315,"still_path":"/933r8RiG9U63IZtR09G5y8pDYHO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-10","episode_number":9,"episode_type":"standard","id":994040,"name":"In It to Win It","overview":"Whether you're trying to get to the head of the class, earn the big promotion, or just find a parking spot—every day, you're competing. With yourself... and with others. So what is it about the human brain that makes you want to win—sometimes at all costs? In this episode we'll explore your brain and competition through a series of competitions! Each viewer will be assigned a team and play along as our Red and Blue teams duke it out in a head to head battle to determine the winner of “The Brain Games.” Along the way you'll learn what drives you to compete, why some people may be born more competitive, and how a little healthy rivalry can help you climb the ladder of success.","production_code":"","runtime":23,"season_number":3,"show_id":54315,"still_path":"/1tVDcpyqa9c9PUYAHrCiMIgdcn2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-17","episode_number":10,"episode_type":"finale","id":994041,"name":"Follow the Leader","overview":"Everyone thinks they’re unique and independent, but how much of your behavior is based on how much your brain is copying from people around you? You’ll discover how you unconsciously adapt the way you behave, speak, and move according to who you’re talking to, who you’re trying to please, or who you’d like to be like in the future.","production_code":"","runtime":23,"season_number":3,"show_id":54315,"still_path":"/gruNFOViPN6NdX6aXx9kH6dTo3Y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":61622,"poster_path":"/tu8BkLXxLIdHMUT2YwjIPwxUqdD.jpg","season_number":3,"vote_average":7.9},"4":{"_id":"53b8e8d80e0a2676c4008c86","air_date":"2014-07-14","episodes":[{"air_date":"2014-07-14","episode_number":1,"episode_type":"standard","id":994043,"name":"Compassion","overview":"Join host Jason Silva in a series of interactive games and experiments that explores your brain's capacity for compassion, and questions the motives behind both your selfless and selfish acts. In this episode we'll tackle the age-old question of nature vs. nurture, and test whether altruistic inclinations are hardwired in our brain from birth. You'll discover if you're actually born naughty or nice, and explore the chances of finding a psychopath among your family or friends — or even in the mirror!","production_code":"","runtime":23,"season_number":4,"show_id":54315,"still_path":"/HryFmCwqn86wK1ZgGvxi1gBdzO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-14","episode_number":2,"episode_type":"standard","id":994044,"name":"Addiction","overview":"We all have things we say we can’t live without — coffee, smartphones, social media... But do we really need all those things, or on some deep level are we addicted to them? In this episode we’ll put you through a series of games and experiments designed to reveal how, like it or not, we’re all addicted to something, and why some addictions might be the best thing that ever happened to you. Learn what one of the most addictive sounds in the world is, why you can’t stop checking your phone, and why that awful pop song is still stuck in your head.","production_code":"","runtime":22,"season_number":4,"show_id":54315,"still_path":"/ym8yqoG8OPIIa0GTGwkgC2wfik9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-21","episode_number":3,"episode_type":"standard","id":994045,"name":"Language","overview":"Would you believe language is the closest thing humans have to telepathy? Or that you speak volumes every day without uttering a single word? Play along as host Jason Silva — with help from biomedical-engineer Sri Sarma of Johns Hopkins University — leads you on a journey of discovery through the mystery of how you create meaning, and more. After we break down what to look for, viewers will be conversant in the hidden language of gestures, tells, and nonverbal signals. Through a series of addictive interactive games and unexpected experiments you’ll discover how language might be your brain’s most remarkable ability.","production_code":"","runtime":23,"season_number":4,"show_id":54315,"still_path":"/nRMVeP79baJQuywvJ2YaxiBNXwJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-21","episode_number":4,"episode_type":"standard","id":994046,"name":"Risk","overview":"Whether it's choosing what to eat for breakfast, where to invest your money or just when to cross the street, nearly every choice you make involves some sort of calculated risk. This episode explores how your brain evaluates risk — you'll discover why we're all born risk-takers and how life is often a big game of chance. You'll also find out that while your brain is hardwired to analyze risk, it doesn’t always make the most logical decisions. But pay attention, and you'll learn how to assess risk like your life depends on it... because it does!","production_code":"","runtime":23,"season_number":4,"show_id":54315,"still_path":"/k0anc0vFvzLxKhpnumLjZDDVHw8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-28","episode_number":5,"episode_type":"standard","id":994047,"name":"Battle of the Sexes 2","overview":"Girls and boys. Guys and gals. Ladies and Gentlemen. No matter how you say it, it all comes down to the same thing: Male and Female. In this episode the male brain and the female brain go head to head. We’re going to pit teams of men and women against each other in a series of games and experiments designed to mess with your mind and show you how the genders are not created equally... from how we talk, to how we listen, and especially how we think.","production_code":"","runtime":23,"season_number":4,"show_id":54315,"still_path":"/byz2VMLxqU5OTGFgU2njM9XBGLl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-28","episode_number":6,"episode_type":"standard","id":994048,"name":"Superstitions","overview":"Do you have a lucky number? Do you cross the street to avoid black cats? Have you ever thought you knew what someone was about to say–and turned out to be right? This is a show about your brain and superstition. Superstition is a big part of our everyday lives, and the same power our brain has to learn language, find meaning in chaos, and hit home runs makes us believe things that have no basis in reality. We’re going to mess with your mind as we put you through a series of games and experiments that will reveal how your brain may be hardwired to be superstitious. You'll find out if someone really can read your mind, and how you can do it too.","production_code":"","runtime":23,"season_number":4,"show_id":54315,"still_path":"/qhnSPYe0EMQfb3b2mfUy4LT1y1i.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-04","episode_number":7,"episode_type":"standard","id":994049,"name":"Food","overview":"In this episode, you'll discover that what goes into your stomach has less to do with your mouth and more to do with your brain. You'll see what happens when we turn up the volume on our test subjects' appetites through sound and smell, and learn how many of your food choices often have nothing to do with food. Through a series of interactive games and experiments you'll discover what makes you hungry, why you overeat, and whether you should take comfort in comfort food.","production_code":"","runtime":23,"season_number":4,"show_id":54315,"still_path":"/13mmCp9nK1cTWpCjYKdGzTucclZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-11","episode_number":8,"episode_type":"standard","id":994051,"name":"Anger","overview":"Whether it's full blown road rage or just the ever-present frustration at life's little inconveniences, we all feel a little mad sometimes. But what if getting angry had less to do with what's going on outside, and more to do with what's going on inside your brain? In this episode we'll explore why your brain gets angry and what you can do about it. Through a series of games and experiments, we'll prove to you that anger isn't always a bad thing, and how having a short fuse might not be the worst trait to have. Also you'll learn how to deal better with the anger of other people, and your own.","production_code":"","runtime":23,"season_number":4,"show_id":54315,"still_path":"/beoFYouKsg1ERDqWF85v5jA0hpf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-18","episode_number":9,"episode_type":"standard","id":994050,"name":"Patterns","overview":"Have you ever looked up at the night sky and thought you saw a man in the moon? In this episode, we're going to prove that there really is a man in the moon—in your brain. This is a show about your brain and patterns. Through a series of games and experiments, we'll show you how, when processing the world, your brain is always filling in the blanks. And whether you realize it or not, your life a series of complex patterns that repeat again, and again, and again. You'll learn exactly how patterns and habits rule your world, and you'll discover that what you think of as free will, might really be habit.","production_code":"","runtime":23,"season_number":4,"show_id":54315,"still_path":"/buyDznF6r8vB7aYURnlrIovWZKj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-25","episode_number":10,"episode_type":"finale","id":994052,"name":"Intuition","overview":"Ever had the strange sensation of just knowing something without being able to say how you know it? Or been bothered by something without knowing why? That tiny feeling is the key to unlocking one of your brain’s most powerful abilities: intuition. In this episode of Brain Games, we'll put your brain to the ultimate test with a series of interactive games and fascinating experiments that reveal a useful piece of advice: you should stop thinking with your head and listen to your gut.","production_code":"","runtime":23,"season_number":4,"show_id":54315,"still_path":"/4plBu5o329Oc3z1Y1iivHLn5zdY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":61623,"poster_path":"/ldDgSl4PrsTNEJIh4QP7bKalsfZ.jpg","season_number":4,"vote_average":0},"5":{"_id":"5591b66c925141757c001fc8","air_date":"2015-01-19","episodes":[{"air_date":"2015-01-19","episode_number":1,"episode_type":"standard","id":1081719,"name":"Common Sense","overview":"From knowing when to cross the street to avoiding hot stoves, your brain is constantly making judgments that you likely take for granted. We chalk it up to common sense - but just how common is it? Through interactive games and mind-bending challenges, unravel your mental shortcuts and learn how to harness the power of collective thinking. Play along to understand how your common sense can either lead you astray or keep you on the right track.","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/xUtV2yKjlMlMtT9hRAKXKilRjws.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-19","episode_number":2,"episode_type":"standard","id":1081720,"name":"Left vs. Right","overview":"Whether you're a left-handed artist or a right-handed accountant, we all use both sides of our brains. But is there any science behind the notion that the left half or our brain is the creative side while the right half is more logical? In this episode about your left and right brain, we're going to put you through a series of games and experiments designed to find out how the two sides operate, what they really control, and whether or not one side of your brain dominates the other.","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/l39xqqrW8LMmIHnqaQEfJwSg1e.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-26","episode_number":3,"episode_type":"standard","id":1081721,"name":"Morality","overview":"Have you ever wondered where your morality comes from? Is it ingrained in your brain, set by religion, or does society dictate what you deem as right or wrong? Through a series of interactive games and experiments, we'll test the strength of your moral fiber. Play along and discover how your brain makes countless moral decisions every single day. We're going to mess with your mind as we show you how outside influences like clothing, attitude, and your own evolutionary survival may sway your brain...and your morals.","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/l39xqqrW8LMmIHnqaQEfJwSg1e.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-02","episode_number":4,"episode_type":"standard","id":1081722,"name":"Money","overview":"This is a show about your brain and money. It's present in every corner of our lives-we earn it, spend it, manage it and often obsess over it, but how well do we really understand it? If you play along you'll understand why your brain gets excited when you think you're getting a deal, why there's no such thing as a free lunch, and you'll learn how to stop paying more for less.","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/rokYvyDR65Lm7YC0Fdshjdzaxmw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-09","episode_number":5,"episode_type":"standard","id":1081723,"name":"Paranormal","overview":"Have you ever seen a ghost? Have you ever known something was going happen before it happened? If so, you may share a link with the paranormal. Or it might just be your brain playing tricks on you. Whether you're a skeptic or a believer in the supernatural, you have to admit there are things out there your brain just can't quite explain. This is an episode about your brain and the paranormal. Get ready for a series of games and experiments designed to prove you actually know more about the unknown than you think. We're going to put your sixth sense to the test by ...","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/A8iGvqod7Zl5oWF4PBWwf9fC1Ew.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-16","episode_number":6,"episode_type":"standard","id":1081724,"name":"Memory","overview":"In this episode about memory, we're going to show you what memory is, why you even have one, and why you keep forgetting where you put those darn keys! And if you play along you'll see why forgetting can actually be a good thing! It's going to be a night to remember...on Brain Games.","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/gCbWxtKegbHv81nLT5tWgnMiK7w.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-02-23","episode_number":7,"episode_type":"standard","id":1081725,"name":"Misconceptions","overview":"This is a show about your brain and the widely held myths you believe to be true. Through a series of fun and interactive games and experiments, you'll discover whether or not you only use 10% of your brain, if size really does matter and whether listening to Mozart actually makes you smarter.","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/busKyG4pZdtsXGa7HbhHqqG4EW3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-02","episode_number":8,"episode_type":"standard","id":1081726,"name":"Peer Pressure","overview":"Are you a unique individual? Are you a rebel - or do you give into peer pressure? If you think you have full control of your thoughts and actions - think again. It turns out the clothes you wear, the food you eat, and even the way you walk has less to do with you and more to do with everyone else. In this episode, we'll explore that your brain may be hardwired to want to fit in. Through a series of games and experiments, we'll prove that the decisions that make you yourself also make you a part of the crowd. Sure, some of what we're about to point out might make you ...","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/7YJLej3m9bwGVDtvLAgjl7NuKXR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-09","episode_number":9,"episode_type":"standard","id":1081727,"name":"Logic","overview":"In this episode of Brain Games, we put your problem-solving skills to the test as we lead you through a labyrinth of logic games. Every day, you use logic to get things done, from dressing for the weather, choosing the best route to work, to deciding what to eat for dinner. Through a series of interactive games and experiments, you'll learn about the power and the limitations of your logical abilities. Studies have found that logic is something you develop and hone with practice, so play along as we present puzzles and illusions that will help strengthen your brain.","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/yk2FaejJqxlN4Td48SbWslnpS8H.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-03-16","episode_number":10,"episode_type":"finale","id":1081728,"name":"Faces","overview":"Your face is pretty remarkable. Whether you've got a baby face, a poker face, or a face only a mother could love... your identity is deeply rooted in your own unique face. And with over 40 muscles twisting and contorting, your face allows you to express a near infinite number of emotions and feelings. But not only are you capable of making faces -- your brain is also highly adept at recognizing what other peoples' faces are saying to you. In this episode about faces, we're going to mess with your mind and show you that there's more to a face than meets the eye. And if...","production_code":"","runtime":60,"season_number":5,"show_id":54315,"still_path":"/mSVjijr5nDW9ZP7sgC5MjOlXB8O.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":68126,"poster_path":"/q9sIKE0KStfdzCn2da2Ivb8xpAm.jpg","season_number":5,"vote_average":0},"6":{"_id":"597c04dd9251410751005eac","air_date":"2015-06-28","episodes":[{"air_date":"2015-06-28","episode_number":1,"episode_type":"standard","id":1342122,"name":"Positive Thinking","overview":"","production_code":"","runtime":23,"season_number":6,"show_id":54315,"still_path":"/oHdVub6sn48OikgfhkyHPVOeZR0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-28","episode_number":2,"episode_type":"standard","id":1342123,"name":"Scams","overview":"","production_code":"","runtime":23,"season_number":6,"show_id":54315,"still_path":"/niydqcPqxxom8cBYEEwWfhjOJ6s.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-28","episode_number":3,"episode_type":"standard","id":1342124,"name":"Sleep","overview":"","production_code":"","runtime":23,"season_number":6,"show_id":54315,"still_path":"/aBsh6yeGaVefZok3GLNs5mAlF7x.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-28","episode_number":4,"episode_type":"standard","id":1342125,"name":"Perspective","overview":"","production_code":"","runtime":23,"season_number":6,"show_id":54315,"still_path":"/Us9VVmNpMOeJWsCy2HObiLOSP5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-29","episode_number":5,"episode_type":"standard","id":1342126,"name":"Animal vs. Human","overview":"","production_code":"","runtime":23,"season_number":6,"show_id":54315,"still_path":"/75LkO1IVgfkibN3kwZVpqNJKy3e.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-29","episode_number":6,"episode_type":"finale","id":1342127,"name":"Imagination","overview":"","production_code":"","runtime":23,"season_number":6,"show_id":54315,"still_path":"/kForjSs4ngrBW2WE2cwtD62OR63.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"Kicking off the summer, Jason Silva hits the streets of New York and Las Vegas with new, captivating social experiments that reveal mysteries of the human mind. Experts across the fields of cognitive science, neuroscience and psychology join Silva in uncovering the processes behind daily activities, such as positive thinking, sleep, perspective, imagination, the unscrupulous world of scams and more. And delve into the differences and similarities between humans and animals in relation to jealousy, eating, memory, mating and more.","id":90865,"poster_path":"/la3u9tlP3NeRO7KaKnwekqNp9db.jpg","season_number":6,"vote_average":0},"7":{"_id":"597c015dc3a3681779005564","air_date":"2016-02-14","episodes":[{"air_date":"2016-02-14","episode_number":1,"episode_type":"standard","id":1342089,"name":"Meet the Brain","overview":"A tour through the labyrinthine city of London; a metaphor for your brain and its numerous regions and intricate pathways.","production_code":"","runtime":60,"season_number":7,"show_id":54315,"still_path":"/ph8SoNRgpHcYmCbZhA8ouP7P4Nt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-21","episode_number":2,"episode_type":"standard","id":1342090,"name":"The God Brain","overview":"Jason Silva travels to Israel to explore “The God Brain.” New research has uncovered that believing in God may be hardwired in our brains.","production_code":"","runtime":60,"season_number":7,"show_id":54315,"still_path":"/b3RTEI0xi2kfyzWwv38gN7FnIVC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-28","episode_number":3,"episode_type":"standard","id":1342091,"name":"Brains Behaving Badly","overview":"Host Jason Silva visits New Orleans, Louisiana, to explore the brain and bad behavior. A series of games and experiments demonstrate how the brain has an evolutionary predilection toward doing the wrong thing.","production_code":"","runtime":60,"season_number":7,"show_id":54315,"still_path":"/cTCy8nX8FmqQK10MiTCdvB88UZM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-06","episode_number":4,"episode_type":"standard","id":1342092,"name":"Life of the Brain","overview":"Everyone's brain changes throughout life, expanding and contracting, shifting points of views, adjusting perspectives - you wake up every day with a brand new brain. Host Jason Silva heads to the New Jersey Shore to show how the mind's point of view shifts over a lifetime.","production_code":"","runtime":60,"season_number":7,"show_id":54315,"still_path":"/vo4e1dFlwdbUgYPolCRiVSuoNpq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-13","episode_number":5,"episode_type":"standard","id":1342093,"name":"Super Senses","overview":"There's no better place than New York City to mess with your mind. Host Jason Silva leads viewers through a series of games and experiments designed to show that the brain has far more than just five senses, and how each of these work together to influence interactions with the world.","production_code":"","runtime":60,"season_number":7,"show_id":54315,"still_path":"/pVn9qunOgAMshQeR8MX2n6nJNC8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-20","episode_number":6,"episode_type":"finale","id":1342094,"name":"The Survivor Brain","overview":"Jason Silva meets several people in Colorado Springs, Colorado, who personify the word \"survivor,\" and puts their brains to the test in a battery of challenges engineered to demonstrate what it takes to be a super survivor.","production_code":"","runtime":60,"season_number":7,"show_id":54315,"still_path":"/jbFZzB1vl5LK8uypK6HbzWuap6f.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":90862,"poster_path":"/foxK4ZNMkkmlOxuNuqKafvPCTCe.jpg","season_number":7,"vote_average":0},"8":{"_id":"5e266015ed2ac2001538dbdc","air_date":"2020-01-20","episodes":[{"air_date":"2020-01-20","episode_number":1,"episode_type":"standard","id":2057669,"name":"Male Brain vs. Female Brain","overview":"Actors Kristen Bell and Dax Shepard face off in a series of Battle of the Sexes games designed to illustrate the differences between female and male brains.","production_code":"","runtime":60,"season_number":8,"show_id":54315,"still_path":"/tLQBzlCvmNFl9i6wTFOiwmgWCD2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"610978ae6331b2002ffd20df","order":500,"adult":false,"gender":1,"id":40462,"known_for_department":"Acting","name":"Kristen Bell","original_name":"Kristen Bell","popularity":30.449,"profile_path":"/rP74dJXl7EjinGM0shQtUOlH5s2.jpg"},{"character":"Self","credit_id":"610978b5ee43e8005e3f35ce","order":501,"adult":false,"gender":2,"id":51298,"known_for_department":"Acting","name":"Dax Shepard","original_name":"Dax Shepard","popularity":9.167,"profile_path":"/aaUGRjfghjgysn5grVdm8kyYN4V.jpg"}]},{"air_date":"2020-01-20","episode_number":2,"episode_type":"standard","id":2057670,"name":"Ted Danson: Fact or Fiction?","overview":"Actor Ted Danson learns how human brains distinguish fact from fiction in a series of games.","production_code":"","runtime":60,"season_number":8,"show_id":54315,"still_path":"/fzQv3Kp5IHnAsi0n0i8w4XP8fM0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"610978c5dcf875003036ff8c","order":502,"adult":false,"gender":2,"id":12836,"known_for_department":"Acting","name":"Ted Danson","original_name":"Ted Danson","popularity":16.546,"profile_path":"/2QUEYVhrKbOkRKeFEUnc5sJby6a.jpg"}]},{"air_date":"2020-01-27","episode_number":3,"episode_type":"standard","id":2057671,"name":"Drew Brees: Performance","overview":"NFL football player Drew Brees puts his brain to the test with a series of mental challenges exploring how humans have hacked their brains; Keegan and Drew play a game called Draft Day, which shows how the brain must react quickly and be flexible.","production_code":"","runtime":60,"season_number":8,"show_id":54315,"still_path":"/lmLNVlnhahztoftYrRNkG21A0B2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"610978d32ea6b9002d0566fe","order":503,"adult":false,"gender":2,"id":1223101,"known_for_department":"Acting","name":"Drew Brees","original_name":"Drew Brees","popularity":0.6,"profile_path":"/mE1wOR1fcJ4XvIo1hBBCCe8KIYn.jpg"}]},{"air_date":"2020-01-27","episode_number":4,"episode_type":"standard","id":2057672,"name":"Kids vs. Adults","overview":"Actors Anthony Anderson and Marsai Martin (\"Black-ish) face off in a series of games with host Keegan-Michael Key.","production_code":"","runtime":60,"season_number":8,"show_id":54315,"still_path":"/ydYvS9xfI0l790Fi1KAr7dCJS4B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"610978e38d22fc004715f419","order":504,"adult":false,"gender":2,"id":18471,"known_for_department":"Acting","name":"Anthony Anderson","original_name":"Anthony Anderson","popularity":15.27,"profile_path":"/reO1OjwFdtXmiO4LMDaBj6eatzK.jpg"},{"character":"Self","credit_id":"610978e92f8d09002d1accf0","order":505,"adult":false,"gender":1,"id":1407498,"known_for_department":"Acting","name":"Marsai Martin","original_name":"Marsai Martin","popularity":16.186,"profile_path":"/hYErUiiesrm9jmiY1JTbwlxcN7l.jpg"}]},{"air_date":"2020-02-10","episode_number":5,"episode_type":"standard","id":2057673,"name":"Jack Black: Music","overview":"Actor-musician Jack Black and his Tenacious D bandmate Kyle Gass learn how music affects the brain.","production_code":"","runtime":60,"season_number":8,"show_id":54315,"still_path":"/nYmSCSzHdBuMGBj7nMleVfgIWsy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"610978f38d22fc0076c01c5a","order":506,"adult":false,"gender":2,"id":70851,"known_for_department":"Acting","name":"Jack Black","original_name":"Jack Black","popularity":46.522,"profile_path":"/rtCx0fiYxJVhzXXdwZE2XRTfIKE.jpg"}]},{"air_date":"2020-02-17","episode_number":6,"episode_type":"standard","id":2057674,"name":"Mark Cuban: Power and Money","overview":"Keegan-Michael Key welcomes billionaire CEO and reality star Mark Cuban (\"Shark Tank\") to the show.","production_code":"","runtime":60,"season_number":8,"show_id":54315,"still_path":"/tonWvLNOfc6xHYSHdmpro0ZHLKh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"610978fe255dba002de4442e","order":507,"adult":false,"gender":2,"id":31515,"known_for_department":"Acting","name":"Mark Cuban","original_name":"Mark Cuban","popularity":8.874,"profile_path":"/iK8LVp8R9Pf2MnYWBP6c0HKPf2D.jpg"}]},{"air_date":"2020-02-24","episode_number":7,"episode_type":"standard","id":2057676,"name":"Rebel Wilson: Love and Attraction","overview":"Actress Rebel Wilson joins Keegan-Michael Key to explore the power of the subconscious when it comes to falling in love.","production_code":"","runtime":60,"season_number":8,"show_id":54315,"still_path":"/fTebgaJE6nLGyHrc2mebKGUin8G.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"61097910323eba0046d3297d","order":508,"adult":false,"gender":1,"id":221581,"known_for_department":"Acting","name":"Rebel Wilson","original_name":"Rebel Wilson","popularity":25.857,"profile_path":"/6iAFqhVcOSLjeZq83mONpx99NAQ.jpg"},{"character":"Self - Mentalist","credit_id":"610979332f8d090048ea835c","order":509,"adult":false,"gender":0,"id":2699152,"known_for_department":"Acting","name":"Lior Suchard","original_name":"Lior Suchard","popularity":1.109,"profile_path":null}]},{"air_date":"2020-03-02","episode_number":8,"episode_type":"finale","id":2179375,"name":"Tiffany Haddish: Movie Magic","overview":"","production_code":"","runtime":60,"season_number":8,"show_id":54315,"still_path":"/3epxM2XkmgHB5vOi9sNfeLzC9yg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self","credit_id":"61097956c613ce0028463f81","order":510,"adult":false,"gender":1,"id":1230868,"known_for_department":"Acting","name":"Tiffany Haddish","original_name":"Tiffany Haddish","popularity":14.207,"profile_path":"/Avmv1YY7Qscz0TyWxhqFoS7BO5f.jpg"},{"character":"Self","credit_id":"61097960323eba005dd28a5f","order":511,"adult":false,"gender":2,"id":291263,"known_for_department":"Acting","name":"Jordan Peele","original_name":"Jordan Peele","popularity":13.452,"profile_path":"/kFUKn5g3ebpyZ3CSZZZo2HFWRNQ.jpg"}]}],"name":"Season 8","overview":"","id":141455,"poster_path":"/1hGDLtVGomV5peD1BcPN8HRymad.jpg","season_number":8,"vote_average":0}}}