{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2013-09-05","genres":[{"id":9648,"name":"Mystery"},{"id":80,"name":"Crime"}],"homepage":"","id":58010,"in_production":false,"languages":["en"],"last_air_date":"2013-09-19","last_episode_to_air":{"id":972780,"name":"Episode Three","overview":"Under pressure to charge her prime suspect, Maggie's still not convinced they've found the killer. However, she's taken aback to discover that her stalker had close links to the Reid family.\n\nMeanwhile, Theresa's return pushes Claire and Daniel's marriage to breaking point and Luke is shaken by the reappearance of a teenage neighbour, who seems intent on making amends for the past.\n\nAs pressure grows to go public with the arrest, Maggie finds herself increasingly isolated at work and home as she confronts the reality that her son isn't like the other children in his class.\n\nWhen her suspect reveals information that only the killer could have known, Maggie has no choice but to charge them. But when a conflicted Teresa reignites Maggie’s suspicions about Daniel, Maggie begins to piece together Callum’s final hours, finding her instinct as a mother at war with her desire to solve the crime, as she comes to understand that that death isn't always the hardest loss to bear.\n\nThen a brutal death effectively closes the case and Maggie faces a stark choice – will she protect her career or expose the truth?\n\nAs the final pieces of the puzzle fall into place, we finally learn how and why Callum Reid died and how a terrible misunderstanding spiralled into a lie that destroyed a whole community.","vote_average":0,"vote_count":0,"air_date":"2013-09-19","episode_number":3,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":58010,"still_path":null},"name":"The Guilty","next_episode_to_air":null,"networks":[],"number_of_episodes":3,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"The Guilty","overview":"Lives are torn apart and relationships fractured forever when a young child goes missing. Five years later, DCI Maggie Brand leads a new investigation and puts at risk her own happy family life.","popularity":4.443,"poster_path":"/l7htAfsU3mxRyJIpFsFGSNBpfH7.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2013-09-05","episode_count":3,"id":59977,"name":"Season 1","overview":"The Guilty is set across two timelines – 2008 and present day – and tells the story of DC Maggie Brand (Tamsin Greig - Episodes, Friday Night Dinner), who investigates the disappearance of little Callum Reid whilst coping with her own young son's diagnosis with autism.\n\nFollowing an annual neighbourhood barbecue, Claire and Daniel Reid frantically search for Callum when they awake to find him missing. Katherine Kelly (Mr Selfridge, Coronation Street) and Darren Boyd (Case Sensitive, Dirk Gently) play the young couple living in hope that their son will one day be found.  \n\nFive years on, Arcadian Gardens is a very different place. An address synonymous with tragedy. The grief-stricken parents and their neighbours lives were torn apart by the events of that weekend, not least that of Callum’s big brother, Luke.\n\nThen, on the eve of the fifth anniversary of his disappearance, Callum’s body is discovered, buried only yards from his own front door. And the nightmare begins all over again.\n\nDCI Maggie Brand leads the new investigation. Pregnant when Callum went missing, debilitating morning sickness had forced her to step down from the original investigation. Her son, Sam, was born only a few months after Callum disappeared. Now he’s starting school and Maggie has to deal with her own feelings of \n\nloss, as she confronts the reality that her little boy is very different to the other children in his class. Driven by her obsession to discover what happened to Callum, Maggie leaves no stone unturned in piecing together the events of that fateful night.","poster_path":"/iVODjPwBbjqBeVEUyPuzWue73eB.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Miniseries","vote_average":6.9,"vote_count":11,"season_data":{"1":{"_id":"5312ab27925141101f003e4e","air_date":"2013-09-05","episodes":[{"air_date":"2013-09-05","episode_number":1,"episode_type":"standard","id":972778,"name":"Episode 1","overview":"2008 – a glorious May bank holiday weekend. A four year old boy goes missing after a neighbourhood barbecue. Believed to have been abducted, a nationwide search and media frenzy ensue, but the boy is never found.\n\nPresent day – the wettest spring on record. Workmen digging up a burst water main uncover a body under the communal garden. Little Callum Reid – buried just yards from his own front door. The missing boy never left Arcadian Gardens.\n\nIn 2008, Arcadian Gardens is a desirable address - a suburban oasis with comfortable detached homes overlooking a private shared garden. Unlike most anonymous urban streets, the residents pride themselves on their sense of community. Children play in the communal garden. People feed each other's pets and water one another's plants and, of course, every May Bank Holiday there's the annual neighbourhood barbecue.\n\nThen little Callum Reid from No. 4 goes missing and nothing is ever the same again.\n\nFive years on, Arcadian Gardens is a very different place. An address synonymous with tragedy. The grief-stricken parents’ and their neighbours’ lives were torn apart by the events of that long May weekend and even after all this time the wounds are still raw.\n\nThen, on the eve of the fifth anniversary of his disappearance, Callum’s body is discovered, buried only yards from his own front door. And the nightmare begins all over again.","production_code":"","runtime":60,"season_number":1,"show_id":58010,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-12","episode_number":2,"episode_type":"standard","id":972779,"name":"Episode 2","overview":"As Maggie and her team dig deeper into Callum Reid’s disappearance, they re-interview the Reids and their neighbours, forcing them to reopen old wounds and revisit painful memories, as they find themselves once again under suspicion.\n\nWhen new evidence eliminates the original prime suspect, the holes and inconsistencies in the first investigation begin to emerge and Maggie becomes convinced that Nina Huber, the Reids’ former au-pair, could hold the key. But where is she? And why can no-one find her? Meanwhile Maggie has to process some disturbing news about her own son, Sam, causing increasing tension at home as she struggles to remain focused on the case.\n\nThe Reids find their coping mechanisms in conflict as Claire's drive to find her child's killer threatens her relationship with their remaining son. Meanwhile, we revisit the events surrounding the night of the barbecue, gradually uncovering the truth about Nina's relationship, the secret lover the Reids’ neighbour Teresa cannot reveal and the fears that haunt young Luke's nightmares.\n\nWhen a trip to Germany leads to a shocking revelation, Maggie is forced to accept that they may have been wrong about the time and even the location of Callum's disappearance. Then Claire makes a disturbing discovery closer to home and Daniel finds himself under growing suspicion.\n\nBut who is the man who's been watching the Reids' house? And why is he so interested in Maggie?","production_code":"","runtime":60,"season_number":1,"show_id":58010,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-19","episode_number":3,"episode_type":"finale","id":972780,"name":"Episode Three","overview":"Under pressure to charge her prime suspect, Maggie's still not convinced they've found the killer. However, she's taken aback to discover that her stalker had close links to the Reid family.\n\nMeanwhile, Theresa's return pushes Claire and Daniel's marriage to breaking point and Luke is shaken by the reappearance of a teenage neighbour, who seems intent on making amends for the past.\n\nAs pressure grows to go public with the arrest, Maggie finds herself increasingly isolated at work and home as she confronts the reality that her son isn't like the other children in his class.\n\nWhen her suspect reveals information that only the killer could have known, Maggie has no choice but to charge them. But when a conflicted Teresa reignites Maggie’s suspicions about Daniel, Maggie begins to piece together Callum’s final hours, finding her instinct as a mother at war with her desire to solve the crime, as she comes to understand that that death isn't always the hardest loss to bear.\n\nThen a brutal death effectively closes the case and Maggie faces a stark choice – will she protect her career or expose the truth?\n\nAs the final pieces of the puzzle fall into place, we finally learn how and why Callum Reid died and how a terrible misunderstanding spiralled into a lie that destroyed a whole community.","production_code":"","runtime":60,"season_number":1,"show_id":58010,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"The Guilty is set across two timelines – 2008 and present day – and tells the story of DC Maggie Brand (Tamsin Greig - Episodes, Friday Night Dinner), who investigates the disappearance of little Callum Reid whilst coping with her own young son's diagnosis with autism.\n\nFollowing an annual neighbourhood barbecue, Claire and Daniel Reid frantically search for Callum when they awake to find him missing. Katherine Kelly (Mr Selfridge, Coronation Street) and Darren Boyd (Case Sensitive, Dirk Gently) play the young couple living in hope that their son will one day be found.  \n\nFive years on, Arcadian Gardens is a very different place. An address synonymous with tragedy. The grief-stricken parents and their neighbours lives were torn apart by the events of that weekend, not least that of Callum’s big brother, Luke.\n\nThen, on the eve of the fifth anniversary of his disappearance, Callum’s body is discovered, buried only yards from his own front door. And the nightmare begins all over again.\n\nDCI Maggie Brand leads the new investigation. Pregnant when Callum went missing, debilitating morning sickness had forced her to step down from the original investigation. Her son, Sam, was born only a few months after Callum disappeared. Now he’s starting school and Maggie has to deal with her own feelings of \n\nloss, as she confronts the reality that her little boy is very different to the other children in his class. Driven by her obsession to discover what happened to Callum, Maggie leaves no stone unturned in piecing together the events of that fateful night.","id":59977,"poster_path":"/iVODjPwBbjqBeVEUyPuzWue73eB.jpg","season_number":1,"vote_average":0}}}