{
    "adult": false,
    "backdrop_path": "/gOQDwdyhRSNrBWs4SUz1fhj3qIl.jpg",
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2013-09-17",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "",
    "id": 59880,
    "in_production": true,
    "languages": [],
    "last_air_date": "2016-03-02",
    "last_episode_to_air": {
        "id": 1173004,
        "name": "Episode 5",
        "overview": "",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2016-03-02",
        "episode_number": 5,
        "episode_type": "finale",
        "production_code": "",
        "runtime": null,
        "season_number": 5,
        "show_id": 59880,
        "still_path": null
    },
    "name": "Posh Pawn",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 26,
            "logo_path": "/hbifXPpM55B1fL5wPo7t72vzN78.png",
            "name": "Channel 4",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 31,
    "number_of_seasons": 5,
    "origin_country": [],
    "original_language": "en",
    "original_name": "Posh Pawn",
    "overview": "Prestige Pawnbrokers are the kings of pawning luxurious and costly  objects in cash-strapped Britain and are part of a growing number of  high-end pawnbrokers focusing on expensive and exclusive objects.  This documentary goes behind the scenes at Prestige and discovers that,  when it comes to upmarket pawn, everyone has a story to tell.",
    "popularity": 1.72,
    "poster_path": "/e5HVGDfKAWGx0gBJ3wkjhUYDfQt.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2013-09-17",
            "episode_count": 7,
            "id": 59331,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2014-09-09",
            "episode_count": 8,
            "id": 75038,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2014-11-12",
            "episode_count": 6,
            "id": 75039,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2015-08-26",
            "episode_count": 5,
            "id": 75040,
            "name": "Season 4",
            "overview": "",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2016-02-03",
            "episode_count": 5,
            "id": 75041,
            "name": "Season 5",
            "overview": "",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        }
    ],
    "spoken_languages": [],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 6.5,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "52599c8a760ee34661b5ebfc",
            "air_date": "2013-09-17",
            "episodes": [
                {
                    "air_date": "2013-09-17",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 948194,
                    "name": "Episode 1",
                    "overview": "Prestige Pawnbrokers are the kings of pawning luxurious and costly objects in cash-strapped Britain and are part of a growing number of high-end pawnbrokers focusing on expensive and exclusive objects.\n\nThis documentary goes behind the scenes at Prestige and discovers that, when it comes to upmarket pawn, everyone has a story to tell.\n\nHeaded up by slick former property developer James Constantinou, and with a quirky team of asset experts including salt-of-the-earth jewellery expert Lawrence and feisty PA Jo, Prestige is the go-to place for people who want fast cash in well-heeled Surrey, pawning everything from million-pound helicopters to Lambourghinis and £25,000 Hermes handbags.\n\nAnd it's an empire on the move: James is taking big risks investing in a new store in Richmond and has bigger plans too. But will expanding make or break the business?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-17",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1172979,
                    "name": "Episode 2",
                    "overview": "The staff at Prestige Pawnbrokers are blown away by two jaw-dropping diamond necklaces, owned by two very different clients.\n\nSingle mum Marcella is looking for a better future for herself and her son and needs £20,000 to kick-start her music career, while wealthy mother-of-four Ingrid wants to raise capital for her new horse importation and training business.\n\nThey both hope that family heirlooms that have been gathering dust can kick-start their new lives. But following a closer inspection of one of the necklaces, there's a sleepless night for staff member Patrick, who suspects one could be fake.\n\nAnd Prestige MD James Constantinou is excited by a very unusual yellow mini submarine, which policeman David wants to sell. James tests it in a 'James Bond-style' underwater joyride, as he attempts to impress a potential buyer.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-04-24",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1172980,
                    "name": "Episode 3",
                    "overview": "James has his work cut out sealing a deal with a pushy young entrepreneur who wants to borrow £100,000 against his Lamborghini Gallardo Spyder.\n\nLegendary film director Ken Russell's ex-wife Hetty gets a shock when she tries to raise money by pawning her personal family photographs.\n\nA married couple get emotional as they look to pawn their pride and joy: a six-foot Kerry Darlington painting.\n\nA mum-of-three pawns her mother's diamond ring to support her family; but how much is the ring worth?\n\nAnd long-term client Tauren falls behind on his loan repayments. Will he lose his prized designer watch collection?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-05-01",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1172981,
                    "name": "Episode 4",
                    "overview": "Reformed 1980s cat burglar Sid hopes to raise funds with help from his family and their jewellery.\n\nPrestige Pawnbrokers boss James gets the fright of his life when he test drives a client's superbike at Brands Hatch.\n\nNew employee Kristen is put to the test when she has to value two huge tanzanite stones.\n\nAnd Prestige's PA and office manager Jo visits a client, Maggie, who, following a string of bad luck, including being diagnosed with cancer, can't pay back her loan, and is in danger of losing her late mother's jewellery.\n\nTouched by Maggie's unique situation, Jo tries to convince James to extend her loan one last time to save her precious jewellery. But can Jo talk shrewd businessman James around?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-05-08",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1172982,
                    "name": "Episode 5",
                    "overview": "Ex-model Cathy is looking for a loan so she can launch a range of unusual women's lingerie. In the 1980s she shared the catwalk with the likes of Naomi Campbell and Kate Moss.\n\nShortly after the birth of her two children Cathy was taken ill with Cushing's syndrome, which meant she gained an abnormal amount of weight.\n\nShe has now recovered, and has raided her designer bag and jewellery collection in the hope of using them as collateral for a £50,000 loan to launch her underwear business. But will she get the money she needs?\n\nAlso in this episode, Prestige MD James gets some unwanted attention when he goes for a spin in a client's Ferrari, a young mum wants to pawn her grandfather's First World War medals to raise money for her mother's funeral, and an inventor turns up at Prestige to pawn his precious watch.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-05-15",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1172983,
                    "name": "Episode 6",
                    "overview": "A family man approaches Prestige Pawnbrokers with 12 classic cars to raise the money to avoid having his mansion repossessed, but it's another of his possessions that catches James's attention.\n\nA young drummer wants to cash in on a unique silver elephant his grandparents gave him to set up a recording studio so that he can stand on his own feet.\n\nA single mum parts with a five-carat diamond ring to give her boys a holiday; and a client who was adopted when she was three months old pawns her family heirlooms - including a sherry glass thought to have belonged to Queen Victoria - to raise money for a long-awaited trip to see her birth mother in Australia.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-05-22",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 1172984,
                    "name": "Episode 7",
                    "overview": "James' manoeuvring skills are put to the test as he test drives a client's 40-foot American motorhome.\n\nA self-confessed shopaholic hopes to sell two modern art paintings to pursue a new career in photography.\n\nA glamorous divorcée wants to sell some of her designer handbags to raise cash for her hair extensions business.\n\nAnd James and gem expert Kristen jet off to millionaires' playground Marbella to meet a glamorous client with some precious jewellery. James has a taste for the high life; can he drum up enough business to branch out overseas?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 59331,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "56d69a8b9251411884004c05",
            "air_date": "2014-09-09",
            "episodes": [
                {
                    "air_date": "2014-09-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1172986,
                    "name": "Episode 1",
                    "overview": "James and the team get excited when an ex-Chelsea footballer player turns up with some expensive Rolex watches, and James is put to the test when he's asked to evaluate a hovercraft used in a James Bond film.\n\nAn unusual painting of Saddam Hussein causes a stir in the office, and there's a huge surprise for a devoted mum looking to sell some spectacular jewellery to help her son's business venture.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-09-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1172987,
                    "name": "Episode 2",
                    "overview": "A divorcee from Newcastle wants to pawn her £185k necklace to pay for her children's private school fees. A Swarovski crystal-covered drum kit used on a Kylie Minogue tour gets staff member Patrick excited.\n\nA widowed pensioner hopes to make a fortune with her precious rings, and the team scratch their heads when a client turns up with a seven-foot Terminator model.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-09-30",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1172988,
                    "name": "Episode 3",
                    "overview": "James mixes business with pleasure as he heads to Spain to meet an entrepreneur friend who's looking to get a £100k loan on his luxury 18-metre yacht.\n\nA young widow and mum finds it hard to part with her late husband's vintage Jaguar to set up a new life in Croatia, jewellery expert Monika is shocked when she's asked to deal with a golden rat, and the shop staff struggle to put a price on some rare and problematic black coral statues.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-12",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4184773,
                    "name": "Episode 4",
                    "overview": "This episode sees a glamorous celebrity hat designer visit the pawnshop, looking to sell her spectacular diamond encrusted ruby necklace to raise funds to open a central London boutique.\n\nPaintings done by famous east end gangsters - the Kray twins - cause a big dilemma for the team, and MD James tries out an extreme water jet pack. And as the team get ready for the grand opening of the new flagship store, some fake watches cause a bust-up amongst the staff.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-19",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4184774,
                    "name": "Episode 5",
                    "overview": "The staff at Prestige find it funny after a life-sized suit of armour and matching horse show up at the new Hatton Garden shop. James becomes stuck without a paddle in London's canals on a barge a businessman is looking to get a loan against.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-26",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4184775,
                    "name": "Episode 6",
                    "overview": "James is on the verge of striking the biggest deal for the show yet as he heads to Lanzarote to buy a £1.5 million submarine. A jeweller to the stars tries pawning her collection in order to expand.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-03",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4184776,
                    "name": "Episode 7",
                    "overview": "James is on the verge of striking the biggest deal for the show yet as he heads to Lanzarote to buy a £1.5 million submarine. A jeweller to the stars tries pawning her collection in order to expand.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-10",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 4184777,
                    "name": "Episode 8",
                    "overview": "A bumper-car collector looking for a loan visits the shop offering an impromptu test drive in the city. Patrick is star-struck when he deals with a bass guitarist who used to play with Eric Clapton.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 75038,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "56d69b18c3a36870ac005f7c",
            "air_date": "2014-11-12",
            "episodes": [
                {
                    "air_date": "2014-11-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1172989,
                    "name": "Episode 1",
                    "overview": "This episode sees a glamorous celebrity hat designer visit the pawnshop, looking to sell her spectacular diamond encrusted ruby necklace to raise funds to open a central London boutique.\n\nPaintings done by famous east end gangsters - the Kray twins - cause a big dilemma for the team, and MD James tries out an extreme water jet pack. And as the team get ready for the grand opening of the new flagship store, some fake watches cause a bust-up amongst the staff.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-19",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1172990,
                    "name": "Episode 2",
                    "overview": "The staff at Prestige find it funny after a life-sized suit of armour and matching horse show up at the new Hatton Garden shop. James becomes stuck without a paddle in London's canals on a barge a businessman is looking to get a loan against.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-26",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1172991,
                    "name": "Episode 3",
                    "overview": "James is on the verge of striking the biggest deal for the show yet as he heads to Lanzarote to buy a £1.5 million submarine. A jeweller to the stars tries pawning her collection in order to expand.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-03",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1172992,
                    "name": "Episode 4",
                    "overview": "Kristin finds her gem skills being put to the test after she's faced with a piece of jade that could be worth around £300,000. A woman wants to pawn her mother's diamond ring to raise funds to stop her dad's house subsiding. A young couple who are due to get married soon hope to raise some money by selling a limited edition Philip Treacy handbag.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-10",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1172993,
                    "name": "Episode 5",
                    "overview": "A bumper-car collector looking for a loan visits the shop offering an impromptu test drive in the city. Patrick is star-struck when he deals with a bass guitarist who used to play with Eric Clapton.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-12-17",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 1172994,
                    "name": "Episode 6",
                    "overview": "James shocks the team when he offers valuations for free at a charity auction. Caprice sells a dress. A French mum learns about a necklace she wants to sell. The staff get ready for their Christmas party.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 75039,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "56d69bc0925141719e003b92",
            "air_date": "2015-08-26",
            "episodes": [
                {
                    "air_date": "2015-08-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1172995,
                    "name": "Episode 1",
                    "overview": "James travels to Palma to take a look at a stunning £150,000 yacht. Lawrence values a guitar signed by Oasis. A spectacular diamond bracelet offers new branch manager Alicja the chance to work with an international client.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-02",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1172996,
                    "name": "Episode 2",
                    "overview": "A retired couple decide to sell their huge back garden railway. A mother and son want to get a loan against a 71-carat tanzanite ring that they bought from a home shopping channel.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-09",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1172997,
                    "name": "Episode 3",
                    "overview": "A girl wants to see her grandfather's designer watch so that she and her boyfriend can invest in their fledgling jewellery business. History expert Lawrence is pleased to discover a 1960s autographed racing programme.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-16",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1172998,
                    "name": "Episode 4",
                    "overview": "A glamorous Ibiza club DJ wants to sell her designer goods to finance her push to go global. And can James recoup his losses on an unredeemed Aston Martin when it goes to auction?",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-09-23",
                    "episode_number": 5,
                    "episode_type": "finale",
                    "id": 1172999,
                    "name": "Episode 5",
                    "overview": "James visits Lanzarote and a wine collection that may be worth a million Euros. Meanwhile, an aspiring 23-year-old gastro pub owner wants to secure a loan against a £250,000 Bentley.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "",
            "id": 75040,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "56d69c4dc3a3682cef0080b7",
            "air_date": "2016-02-03",
            "episodes": [
                {
                    "air_date": "2016-02-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1173000,
                    "name": "Episode 1",
                    "overview": "James takes an extremely rare Porsche for a spin. A member of the team drops a bombshell. Can two handbags fund a mansion for a hairless cat? Plus a life-size David Beckham statue.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1173001,
                    "name": "Episode 2",
                    "overview": "Can the owner of a historic boat raise £750,000 to make his dream of becoming a well-known children's author come true? And James visits his new Manchester branch for the first time.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1173002,
                    "name": "Episode 3",
                    "overview": "James tries to cut a deal on a modified sports car. Claudia travels to Germany to value a large collection of bags from a New York socialite. A gold fanatic has a case of vintage wine for the staff to valuate.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1173003,
                    "name": "Episode 4",
                    "overview": "James is hoping he can sell a biplane. The team are given a headache when two very different diamond rings are brought in.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-02",
                    "episode_number": 5,
                    "episode_type": "finale",
                    "id": 1173004,
                    "name": "Episode 5",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 59880,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "",
            "id": 75041,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        }
    }
}