{"adult":false,"backdrop_path":"/AcKnrZgsf8ea8NJWdGWlqSYTQBG.jpg","created_by":[],"episode_run_time":[24],"first_air_date":"2012-10-07","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"http://www.project-magi.com/","id":60654,"in_production":false,"languages":["ja"],"last_air_date":"2013-12-29","last_episode_to_air":{"id":1226306,"name":"Titus Alexius","overview":"One year after parting with his friends, Aladdin progresses with his studies and passes the final exam of the First Kodor with flying colors by creating a huge mirage with his powers.Aladdin's friends are sure that he will be awarded as the best student of the First Kodor, but they get astonished when another student, Titus Alexius from the Reim Empire, was chosen instead. While moving to his new room, Aladdin is approached by Titus who wants to befriend him as he recognizes him as a brilliant student as well, but when Aladdin gropes him to make sure that he is not a girl, Titus gets angry at him until Matal Mogamett, the Academy's chanceller appears before them. In the occasion, it is announced that Aladdin and Titus will have a fight to test their abilities and decide if they are worthy of having advanced classes. The battle between them is fierce until both mutually expose the jewels incrusted in their arms by accident, and Mogamett declares that both will be recommended by himself. However, when Aladdin tells Titus that he wishes to talk to him about the jewels, he is suddenly attacked by Titus and despite Mogamett's intervention, Aladdin is knocked uncounscious and Titus is put into solitary confinement. While Aladdin is yet to recover, Titus make contact with Sheherazade who instructs him to \"keep with his mission\", which according to her, is the only reason why he was born.","vote_average":0,"vote_count":0,"air_date":"2013-12-29","episode_number":13,"episode_type":"standard","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/yaQ15DN5bZLr2S8ElJSQeoDMzwn.jpg"},"name":"Magi","next_episode_to_air":null,"networks":[{"id":94,"logo_path":"/7RNXnyiMbjgqtPAjja13wchcrGI.png","name":"MBS","origin_country":"JP"},{"id":160,"logo_path":"/lUACMATs6jcscXIrzNCQzbvNVN5.png","name":"TBS","origin_country":"JP"},{"id":201,"logo_path":"/qNooLje0YQh1y3y9LUM2Y5QCtiF.png","name":"CBC","origin_country":"JP"},{"id":2460,"logo_path":"/34sNEcsgcTAuDidRMrgxdfNyVjL.png","name":"BSN","origin_country":"JP"},{"id":2461,"logo_path":"/b4Ivxqz6UY0EogjYc09Y22ctC6F.png","name":"tys","origin_country":"JP"},{"id":2462,"logo_path":"/7zXfwh5ZhFqvdOWgWX80weU6Sqb.png","name":"Nagasaki Broadcasting Company","origin_country":"JP"},{"id":3970,"logo_path":"/9coKtCf4jSNCdSqGveVFyzvjrZt.png","name":"SBS TV","origin_country":"JP"},{"id":4748,"logo_path":"/o5Hlt7ZXJPEm4Qrx2Pl2rtc9A5y.png","name":"RKB","origin_country":"JP"}],"number_of_episodes":50,"number_of_seasons":2,"origin_country":["JP"],"original_language":"ja","original_name":"マギ","overview":"This story is about the flow of fate and the battle to keep the world on the right path. Aladdin is a boy who has set out to explore the world after being trapped in a room for most of his life. His best friend is a flute with a djinn in it named Ugo. Soon enough, Aladdin discovers he is a Magi, a magician who chooses kings, and he was born to choose kings who will follow the righteous path, battling against those who want to destroy fate. Follow his adventures as he meets others from 1001 Arabian Nights, like Ali Baba and Sinbad, and fights to keep the balance of world in check!","popularity":41.08,"poster_path":"/cDIDw98GGkVvyDa2ko0KGmE5g2A.jpg","production_companies":[{"id":2883,"logo_path":"/rDYExnBV61jGQnkhVVrPN4Yl7O1.png","name":"Aniplex","origin_country":"JP"},{"id":13113,"logo_path":"/xV5tPYKZhP2Ko9dOh5A3FahuKsx.png","name":"A-1 Pictures","origin_country":"JP"},{"id":3363,"logo_path":"/sj3vD7n63bTCih7bcf6GnWvRf1Q.png","name":"MBS","origin_country":"JP"},{"id":1778,"logo_path":"/b5rT6VbYza3LyfltCmz1OcqzWJM.png","name":"dentsu","origin_country":"JP"},{"id":9149,"logo_path":"/isLUpud9N56ifftJZ4XvzwBBpoG.png","name":"Shogakukan","origin_country":"JP"},{"id":41861,"logo_path":"/iQ9Av0fDGKDUInp4I5czxhz5fVj.png","name":"GYAO","origin_country":"JP"},{"id":81208,"logo_path":null,"name":"AnimatiC","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"2012-10-07","episode_count":25,"id":60191,"name":"Magi: The Labyrinth of Magic","overview":"Aladdin is a boy who has set out to explore the world after being trapped in a room for most of his life. His best friend is a flute with a djinn in it named Ugo. Soon enough, Aladdin discovers he is a Magi, a magician who chooses kings, and he was born to choose kings who will follow the righteous path, battling against those who want to destroy fate.","poster_path":"/htcydwrp69GeWmNFUf9Ja6wSzew.jpg","season_number":1,"vote_average":8.7},{"air_date":"2013-10-06","episode_count":25,"id":80498,"name":"Magi: The Kingdom of Magic","overview":"After celebrating their victory against Al-Thamen, Aladdin and his friends depart the land of Sindria. With the end of the battle, however, comes the time for each of them to go their separate ways. Hakuryuu and Kougyoku are ordered to go back to their home country, the Kou Empire. Meanwhile Aladdin announces he needs to head for Magnostadt—a mysterious country ruled by magicians—to investigate the mysterious events occurring in this new kingdom and become more proficient in magic. For their part, encouraged by Aladdin's words, Alibaba and Morgiana also set off in pursuit of their own goals: training and going to her homeland, respectively.","poster_path":"/5NxyJwSjpggv8HWTQ6JNAXtX5hJ.jpg","season_number":2,"vote_average":6.5}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.6,"vote_count":157,"season_data":{"1":{"_id":"53388d7ec3a3680e9f003ff3","air_date":"2012-10-07","episodes":[{"air_date":"2012-10-07","episode_number":1,"episode_type":"standard","id":974052,"name":"Aladdin and Alibaba","overview":"A young boy named Aladdin asks Ugo, a giant Djinn for a wish. Soon after, the boy crosses his path with Alibaba, a youngster who dreams to obtain power and wealth by clearing the mysterious dungeons around the world and claim their treasures. Upon learning of Aladdin's secret powers, Alibaba gets close to him trying to win over his favor, but he only manages to get his help when he finally assumes that his true desire is to overcome his own hopelessness. Aladdin's wish is finally granted when Alibaba agrees to become his friend.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/qvHr60A8cWiZcDhcyrPQBbxd24q.jpg","vote_average":9.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2012-10-14","episode_number":2,"episode_type":"standard","id":974053,"name":"Dungeon Suite","overview":"Alibaba and a slightly exhausted Aladdin enter a nearby dungeon. They manage to elude traps and confront monsters which they rely on the power of Ugo with a price of Aladdin's energy. Afterwards, they entered a passage that shoots fire and Alibaba called it the Dragon's Tail. Little they know that they were being followed by Jamil, Morgiana and a hulking man armed with a sword called Goltas. Jamil confronts Alibaba and demands to deactivate the shooting fires on the passage and as Alibaba manages to deactivate the flaming traps, he was engulfed by fire and Jamil continued their quest. Aladdin wakes up and searches for Alibaba by asking Morgiana. As Jamil continues to berate Alibaba and Morgiana, Alibaba appears and stops Jamil.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/5xPsvLYqHmMyeE21TwBftPDiPp9.jpg","vote_average":8.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2012-10-21","episode_number":3,"episode_type":"standard","id":974054,"name":"Magician of Creation","overview":"After escaping from Jamil and his slaves, Aladdin and Alibaba reach the dungeon's inner chamber. Soon after they are attacked again by Jamil and Morgiana. When Morgiana is about to kill Alibaba, Aladdin grabs a stone scepter and makes use of his powers to stop her, which propmts another Djinn named Amon to appear. Amon greets Aladdin and recognizes him as a Magi. Jamil urges Aladdin to recognize him as a king, just like his former teacher had foretold to him, but he declines. When the dungeon starts collapsing, Goltas grabs Jaamil and dies with him after asking Morgiana to escape with Aladdin and Alibaba, who grabs all the treasure he can before the trio is teleported out of the castle. Morgiana wakes up in the outskirts of the city. So does Aladdin, but in an unknown location. Alibaba, with the treasure in his possession, resurfaces where the now disappeared dungeon used to be and is greeted by the people of the city for clearing it. Unaware that Amon now resides within his sword, he asks himself about Aladdin's fate.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/UXAnyyrbeBM2mFXUsitqnWvP7w.jpg","vote_average":7.5,"vote_count":2,"crew":[{"job":"Storyboard Artist","department":"Art","credit_id":"63e155221f0275007f8da3c1","adult":false,"gender":1,"id":2379724,"known_for_department":"Directing","name":"Mamiko Sekiya","original_name":"Mamiko Sekiya","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2012-10-28","episode_number":4,"episode_type":"standard","id":974055,"name":"The People of the Plains","overview":"Three days after clearing the dungeon, Alibaba still had no news about Aladdin's fate. He is visited by Morgiana who thanks him for making use of the treasure he collected to free all slaves including her. Alibaba then decides to leave the city looking for his friend. Aladdin wakes up in a nomad village far away and is welcomed the Koga Clan's leader, the Shaman Chagan. Hakuei Ren, third princess of the Ko Empire appears at the village to ask the clan to join the Empire, but Chagan declines her offer. Fearing that the Empire may eventually annex the Koga by force, Aladdin pays a visit to the princess and she promises him to solve the matter without causing any deaths. Meanwhile, some women from the clan are kidnapped by slave traders, and a group of warriors set to rescue them, warned to not kill anybody in order to not cause a war. As Aladdin and Chagan wait for them to return, she tells him the story of how the Koga were once the biggest empire in the world after a king chosen by a magi unified his people and formed the first nation in history. After the warriors return, bringing the women with them and having fulfilled the promise to not shed any blood, Chagan announces her decision to have the clan join the Ko Empire, but soon after an arrow is shot at her.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/tSD6TcGTHDGIydvqBjOvX3hUIas.jpg","vote_average":7.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2012-11-04","episode_number":5,"episode_type":"standard","id":974056,"name":"Dungeon Capturer","overview":"As Aladdin rushes to take the Shaman to be treated, Hakuei learns that one of the soldiers was killed by an arrow from the Koga Clan and leaves the army under command of her aide Ryosai to learn the truth about the attack. She comes across the clan who does not believe her words even after she had herself wounded after refusing to fight back. Chagan, who is brought there by Aladdin under her request, reaffirms her decision to have the Koga become a protectorate of the Ko Empire and allows the princess to return. After Chagan expires from the wound, her spirit appears before Aladdin, who confirms that he is indeed, a Magi. Hakuei returns to the camp just to find Ryosai and his troops ready for war. She learns that it was all a plot of his to have her killed and him take command of her troops. Hakuei and her assistant fight against the troops just to be defeated when her magic artifact runs out of Magoi, but soon after Aladdin appears and saves them. Aladdin uses his powers to have Paimon, the Djinn inside Hakuei's artifact materialize and learns from her that Hakuei is her \"King Candidate\", appointed by a Magi who lives in the Ko Empire. After bidding farewell to the Koga Clan, Aladdin joins a caravan looking to reunite with Alibaba.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/dN0wWL54jFOtUD39i9gqWPSqqqA.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2012-11-11","episode_number":6,"episode_type":"standard","id":974057,"name":"Warrior Tribe Fanalis","overview":"Morgiana have passed the previous six months traveling with a caravan, but just when she is about to reach her destiny, the city of Balbadd, where she hopes to take a boat to her homeland, she learns that the caravan will take another route because of a group of thieves is on their way. Morgiana decides to confront the thieves by herself and is defeated by a slave trader who paralyzes her with the poisonous claws of his eagle. Once again in chains, she wakes up near a scared child who was separated from her parents and when the slave traders learn that the girl is feverish, they decide to feed their beasts with her. Morgiana watches in horror as the child is about to be killed when she hears Goltas' voice urging her to fight back, and she breaks up her restraints with her power, protecting the girl and defeating the slave traders. Morgiana then reaches the cell where the other captives are being held just to find Aladdin among the prisoners. As the members of Morgiana's caravan appear to help her, they find the thieves and slave traders fleeing in fear of Ugo. After reuniting with the caravan, Morgiana learns from Aladdin that he is also going for Balbadd to meet Alibaba and she continues her travel to the city now accompanied by him.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/5E61X2feMnYM2IRWjEMcCCuhzJO.jpg","vote_average":8,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2012-11-18","episode_number":7,"episode_type":"standard","id":974058,"name":"His Name is Sinbad","overview":"Aladdin and Morgiana come across a naked man who was robbed of all his belongings and accompany him to the city of Balbadd. There they learn that the man is no other than Sinbad, the king of Sindria. Sinbad has come to Balbadd to convince their rulers to reopen trade with Sindria, but they claim to have their hands full dealing with a group of thieves known as the \"Fog Troupe\" who is now being led by no other than Alibaba. Upon figuring out the thieves' next possible targets, Sinbad and his aide Masrur take guard in one place where his other retainer Ja'far, Aladdin and Morgiana guard the other. The Fog Troupe attacks subduing all resistance and just as Aladdin and Morgiana appear to fight them, Alibaba reveals himself before an astonished Aladdin.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/wm5m8lJigr0gPlULfQpKw9bchlq.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2012-11-25","episode_number":8,"episode_type":"standard","id":974059,"name":"A Broken Promise","overview":"Alibaba pass through Aladdin, claiming that unfortunately he can't keep the promise he made to him and invokes the flames of Amon's sword to escape with the rest of the Fog Troupe. Back to his room, Alibaba is kidnapped by Morgiana who brings him before Aladdin so he can explain himself properly. Meanwhile, Sinbad discovers that Balbadd is being pressured by the Kou Empire to adopt their currency. Alibaba reveals to Aladdin and Morgiana the story of how he was raised in the slums along Kassim, the de facto leader of the Fog Troupe and after his mother's death, he was taken in by his father, the King of Balbadd. On his deathbed, the King recognized Alibaba's capacity and asked him to assume Balbadd's throne, but while considering his offer, Alibaba sneaked out of the castle and met Cassim who made use of the tunnels used by Alibaba to infiltrate it with his fellow bandits, much to his regret.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/8obDiABjSEddEj5MEAlsYLVjOA1.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2012-12-02","episode_number":9,"episode_type":"standard","id":974060,"name":"A Prince's Duty","overview":"Alibaba concludes his story, revealing that after Cassim's attack on the palace, his father died and he fled the country in regret. After his encounter with Aladdin, he decided to return to Balbadd to take responsibility for his actions, just to find that the slums where he was raised are no more. Cassim revealed to Alibaba that it was destroyed by the government after an epidemic that claimed the life of his sister and asks him to become leader of the Fog Troupe to make a stand against the current king Abhmad, whose disregard for the people has put the country in turmoil. As Sinbad, who is listening the story in the next room takes heed of Alibaba's situation, the hotel is attacked by the Fog Troupe who intends to kill Sinbad and rescue Alibaba, but the King of Sindria and his aides defeat them all. Instead of taking them into custody, Sinbad convinces Alibaba to accompany him to the palace and help bring his brother, the king Abhmad to his senses. In the following day, as Abhmad refuses to listen to Alibaba's request to give aid to his people, Aladdin and Morgiana wait outside the palace amid a huge crowd. When a strange man passes through them, Aladdin has an ominous feeling about him.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/lMVY65q8WUTwnkHspdUXbBWowZk.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-12-09","episode_number":10,"episode_type":"standard","id":974061,"name":"His Name is Judar","overview":"he man presents himself as Judar, an oracle serving the Ko Empire who claims to have business with Abhmad. Ignoring Alibaba's protests, Abhmad reveals to Sinbad that by recommendation of his financial advisor Markkio, he relinquished all of Balbadd's trading rights to the Ko Empire, thus he is not in position to resume trading with Sindria. Back at the Fog Troupe's base, Sinbad announces to the people of the slums that negotiations with Abhmad failed, but for some reason, Cassim and his companions are nowhere to be found. Judar appears before Sinbad and notices that the Rukh behaves strangely around Aladdin. Sinbad then reveals that it is because Aladdin is a Magi just like him. Without any warning, Judar starts attacking Aladdin until Ugo appears to stop him. Judar strikes Aladdin with his ice spears and Ugo shields him with his own body. Aladdin tries to have the wounded Ugo return to the flute, but he refuses. Judar then impales Ugo with a huge ice spear but the Djinn makes use of his last strength to crush him with his hands.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/mmfG2C9SvvCu6hTiIEwHIdHCppt.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2012-12-16","episode_number":11,"episode_type":"standard","id":974062,"name":"A New Visitor","overview":"Judar is saved from being killed by a princess of the Kou Empire and her aid Ka Koubun, who tends to his wounds. Ugo tries to attack them, but the princess defeats him with the aid of her Djinn Vinea. Aladdin then launches himself in fury against the princess who orders her servants to kill everyone. However, Sinbad intervenes and convinces the princess to retreat. As the wounded from the battle are treated, Alibaba and Morgiana find an exhausted Aladdin who had almost all of his Magoi depleted in an attempt to bring back Ugo and is in critical condition. Feeling himself useless for not being able to do anything to help and with Cassim still missing, Alibaba is visited by his other brother, the viceroy Sabhmad. Sinbad deduces that it was Sabhmad who was leaking info about the army to the Fog Troupe and he explains that it was all to protect Alibaba, whom he claims is the only one able to stop Abhmad. He reveals that after contracting a huge debt with the Kou Empire, Abhmad intends to pay for it by selling the people of Balbadd as slaves. Upon hearing that, Morgiana urges Alibaba to make a stand against him.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/jVANA2L22vQo5as4pe366OSLJK4.jpg","vote_average":9,"vote_count":1,"crew":[{"job":"Key Animation","department":"Visual Effects","credit_id":"62c321d59672ed23ceff2fe5","adult":false,"gender":1,"id":2884130,"known_for_department":"Visual Effects","name":"Sakurako Sagano","original_name":"Sakurako Sagano","popularity":1.138,"profile_path":null}],"guest_stars":[]},{"air_date":"2012-12-23","episode_number":12,"episode_type":"standard","id":974063,"name":"Determination and Separation","overview":"Before returning to the palace, Sabhmad warns Alibaba that in five days, Abhmad will marry one of the Kou Empire's princesses and in the occasion, his decision to turn the people of Balbadd into slaves will be announced. Some time later while Aladdin still shows no signs of waking up, Alibaba is informed by Sinbad that in order to stop Abhmad's plans and prevent the country to be taken over by the Kou Empire, he must assume the throne of Balbadd. As Alibaba wanders the streets thinking about it, he is approached by Cassim, who is in hing among what remains of the Fog Troupe. Cassim reveals to Alibaba that he already knows about Abhmad's slavery plan and helped by the weapons dealer who supplies their magic tools, he intend to start a rebellion in two days. Alibaba refuses to cooperate with him, and affirms that he will look for a solution which does not involve the death of anyone. After Alibaba is driven away by Cassim, he turns to Sinbad and asks him to teach him how to properly use his djinn. Some time later, Morgiana tries to find Alibaba with no success and realizes that he had left to confront his brother alone. Meanwhile at the palace gates, Alibaba stands before the guards, asking them to let him in.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/tTtH2UPJkx41VTfv8NxK2YRCsxK.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-01-06","episode_number":13,"episode_type":"standard","id":974064,"name":"Prince of Rebellion","overview":"Alibaba manages to reach the palace grounds, but Abhmad sends one of the three royal guards from the Kou Empire to kill him. After finally succeding to properly equip Amon's sword, Alibaba defeats the first guard, but the second guard and his army of monkeys block his way until Morgiana appears to fight in his place, allowing him to keep pressing forward. As Morgiana fights the second guard, Alibaba runs out of Magoi while fighting the third guard and creates some fire with oil to power up Amon's sword for an instant, using it to bring him down. Meanwhile Sinbad learns about the situation and leaves to the palace too. With all guards defeated, Alibaba reaches the throne room where Abhmad orders his guards to kill him, but Sabhmad intervenes of his favor, insisting that the conversation between his two brothers must not be disturbed.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/9gMoV7VUEs5wUZ9Af7uBjSXCqug.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-13","episode_number":14,"episode_type":"standard","id":974065,"name":"Alibaba's Answer","overview":"As Alibaba tries to convince Abhmad to step down, Kogyoku Ren, the princess they previously met, appears in an attempt to stop the commotion. She claims that even if Abhmad is removed from power, another king must be chosen to marry her as part of Balbadd's agreement with the Kou Empire and all agreements between both countries, including the slavery treaty, must be acknowledged. Alibaba instead declares that there will be no king at all because Balbadd's monarchy shall be dissolved and adopt a democratic rule. Sinbad joins the discussion bringing some representatives of his confederation, the Alliance of Seven Seas with him and offers himself to discuss Balbadd's inclusion in said alliance with the Kou Emperor in person, prompting Kogyoku to retreat. As Alibaba addresses his decision to the people, the Rukh gathers strangely around Aladdin and Judar, while Cassim and his men approach the palace.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/i6p1a9haFzUjwrgCkocPbaFvS4E.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-20","episode_number":15,"episode_type":"standard","id":974066,"name":"Cassim's Answer","overview":"Instead of accepting Alibaba's solution, Cassim ignites a rebellion claiming that despite being removed from power, the monarchy still must be executed for their crimes against the people. Meanwhile, Aladdin's spirit is brought before Ugo, now reduced to just his head, who reveals to him that Alibaba and the others are in danger by the devices of those who intend to disrupt the natural flow of Rukh and cover the world in darkness. To fight them back Ugo sends Aladdin into a portal for him to be bestowed with the \"Wisdom of Solomon\" while bidding farewell to him, as according to Ugo, they will never meet again. Back at the palace, Alibaba confronts and defeats Cassim and the rest of the Fog Troupe, but instead of surrendering, Cassim stabs himself with his magic sword, drawing all the troupe's other swords to his body and transforming him into a huge black monster.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/kHGJT1k4Hnf7aMxIPnBf0sP5ZHi.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Key Animation","department":"Visual Effects","credit_id":"60fdb54b3d3557002d54e030","adult":false,"gender":1,"id":2234632,"known_for_department":"Visual Effects","name":"Sayaka Koiso","original_name":"Sayaka Koiso","popularity":3.053,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-01-27","episode_number":16,"episode_type":"standard","id":974067,"name":"Wisdom of Solomon","overview":"Now transformed into a Dark Djinn, Kassim takes advantage of Alibaba's reluctance to kill him and breaks his sword. Sinbad tries to weaken Kassim until he is restrained by Judar, who joins the battle and takes control of Kassim. Fueled by all the Black Rukh created by the turmoil in Balbadd, Judar and Kassim overpower Alibaba, but just as they are about to kill him, Aladdin appears to stand in their way. Enveloped by a huge mass of untainted Rukh, Aladdin deflects Judar's attacks and asks for Alibaba's help to save Kassim.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/elVyXi5E7oMcLeWUJcXAfMHyB6z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-03","episode_number":17,"episode_type":"standard","id":974068,"name":"Smile","overview":"Aladdin briefly restores Alibaba's sword, allowing to dive deep into the Dark Djinn and meet Cassim in spirit, learn the reasons behind his friend's hatred and convince him to give up on his revenge. Cassim's body then returns to normal, but he dies by the effects of the transformation. After the weapon dealer takes Judar away and send him to his masters, the organization \"Al-Thamen\", his body is destroyed by Sinbad who had his metal vessels returned to him by the thieves who stole it. Aladdin's power also allows the people of Balbadd to have a short meeting with the spirits of their late friends and loved ones, including Alibaba, who meets his father and mother, along Cassim and his deceased sister one last time. With no reason left to fight, the rebellion is Balbadd is finally suppressed.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/4Cs7RwGHxec7qHff5CJwptsrj1k.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-10","episode_number":18,"episode_type":"standard","id":974069,"name":"The Kingdom of Sindria","overview":"With the help of his friends, Alibaba organizes the reconstruction and establishment of the new democratic government in Balbadd and he is bitten by a strange snake that disappears soon after. However, a huge fleet from the Kou Empire approaches Balbadd and is preparing itself to invade it. Alibaba asks to Sinbad to let him defend his country against the invaders, but to protect him, he knocks him unconscious and sends him with Aladdin and Morgiana to Sindria instead, as he departs to the Kou Empire to negotiate with the Emperor on Balbadd's behalf. Several months later, Sinbad returns to Sindria and confirms to Alibaba and Aladdin that Balbadd had lost its sovereignty to the Empire but the rights of its citizens are ensured. In the occasion, Sinbad also tells them that the turmoil in Balbadd was orchestrated by Al-Thamen and asks for their help to stop their plans to spread chaos throughout the world. When informed that a huge monster is attacking, Sinbad sends Yamuraiha and Sharrkan, two of his generals to hunt it down and introduces them to Aladdin and Alibaba, claiming that they can teach them to increase their abilities. Later in the night, a huge party is held to celebrate Sinbad's return where he introduces his other generals to Aladdin and the others and Morgiana asks for Aladdin and Alibaba to keep fighting on their side in gratitude for all they did to her, which they oblige. Meanwhile, a prince sent by the Kou Empire to study in Sindria approaches the country, accompanied by Kogyoku, who by some reason, is furious with Sinbad.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/hL564cR6nWOhZmbSyqjQ8AfD033.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-17","episode_number":19,"episode_type":"standard","id":974070,"name":"The Culprit's Name is Sinbad","overview":"As Yamuraiha teaches Aladdin about the properties of Magic, Sinbad presents Alibaba with a sword he received from his late father to replace his broken knife as Amon's metal vessel. Morgiana is also asked to choose an item to be infused with Amon's power to serve as her household vessel, but she decides to have one forged from the same shackles she used during her times of slavery instead. Soon after, a fleet from the Kou Empire arrives bringing the fourth prince Hakuryuu Ren, accompanied by Kogyoku, who accuses Sinbad of defiling her body in her sleep during his visit to the Emperor. By Sinbad's request, Yamuraiha makes use of her magic to prove Sinbad's innocence and it is revealed that it was all a scheme of Koubun Ka's to have him marry the princess by force. When Sinbad and Hakuryuu meet in private, the prince expresses his desire to destroy the Kou Empire, which is now under the influence of Al-Thamen.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/zTaxuuvTIvnkggcv1SV6Ii9EKAA.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"60718f8f498bc20040d253cb","adult":false,"gender":1,"id":1848321,"known_for_department":"Visual Effects","name":"Yumiko Ishii","original_name":"Yumiko Ishii","popularity":1.29,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"60fdb54b3d3557002d54e030","adult":false,"gender":1,"id":2234632,"known_for_department":"Visual Effects","name":"Sayaka Koiso","original_name":"Sayaka Koiso","popularity":3.053,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-02-24","episode_number":20,"episode_type":"standard","id":974071,"name":"The Two Princes","overview":"Upon learning Hakuryuu's reasons, Sinbad insists that he should learn more about his country first and asks him to introduce himself to Alibaba and the others. When Alibaba meets Hakuryuu, he hears a voice from himself urging him to hate and attack him, but he collapses instead. Upon being examinated, it is revealed that the snake bite Alibaba suffered in Balbadd has spread into a dark wound onto his body, from which the agent of Al Thamen, who was supposedly destroyed there, emerges. Sharrkan attacks the enemy whose dark blood splashes on Sinbad, cursing him too. Before disappearing, the agent explains that upon cursed, it is only a matter of time before both Alibaba and Sinbad fall into depravity and become overtaken by the Black Rukh. However, there is a dungeon called \"Zagan\" in an island to the south which is yet to be conquered, and whose Djinn can heal any kind of disease. As Sinbad and his household are forbidden from entering any further dungeon as he already has seven Djinn under his command, he sends Aladdin, Morgiana and Alibaba to conquer Zagan instead. Hakuryuu also offers himself to accompany them on their quest and together they depart there, escorted by one of Sinbad's Generals, Pisti. Upon arriving at the island, the four are approached by a child who asks them to rescue her parents, who are trapped inside Zagan. Hakuryuu and the others agree to help her and set to the dungeon, from which a strange light emanates and pulls them inside.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/xTOHbZuHdxkrsLGmZYOXnCr0Qad.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-03","episode_number":21,"episode_type":"standard","id":974072,"name":"Zagan Labyrinth","overview":"After a brief contact with the bizarre creatures living inside the Zagan Dungeon, Aladdin, Alibaba, Morgiana and Hakuryuu are greeted by Zagan himself, who holds the child who asked them for help previously as a hostage and declares that to rescue her and the other islanders trapped there, they must succeed in passing his trials. The party clears the challenges and traps Zagan throws at them with certain ease, except for Hakuryuu, whose refusal to accept assistance causes more trouble than help, until he ends up kneeling into tears when Zagan teases him, denouncing how he is dragging down the others. Recognizing the prince as a reflection of his former self, as he believes he could save Cassim should he had asked for his friends' help sooner in Balbadd, Alibaba encourages Hakuryuu and the group resumes their quest with renewed confidence. Meanwhile, Judar appears hovering in mid air over Sindria.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/2apsPAhW7h1giAh8s0OXFSh6fjy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-10","episode_number":22,"episode_type":"standard","id":974073,"name":"Household of Flames","overview":"Judar breaks past Sindria's defenses and confronts Sinbad about his intentions of bringing Aladdin to his side. Judar also questions him about why despite there always had three Magi alive on each era and with the other two known to be still alive, a fourth Magi enlightened by the Wisdom of Solomon, Aladdin, has appeared. He also warns Sinbad that sending Aladdin and the others to Zagan by themselves was a mistake. Sinbad then realizes that there are members of Al-Thamen who infiltrated Zagan after them. Meanwhile, back in the Dungeon, Aladdin realizes that the creature that appears before them claiming to be Zagan is not him, but one of his creations. The monster confirms his suspicions and reveals that the real Zagan is sleeping deep inside the Dungeon Room and the party falls on a trap door that leads to its real body which intends to devour them. Desperate to save her companions, Morgiana succeeds to activate her Household Vessel and uses to rescue the others and destroy the monster, but she collapses soon after, as the effort drained almost all of her Magoi. Alibaba carries Morgiana to the Dungeon Room with the others to have Zagan heal her, but a trio of enemies sent by Al-Thamen appear in their way, with the intent to kill them.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/zt814g9cgPf1J9ATeUvYulZt0eW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-17","episode_number":23,"episode_type":"standard","id":974074,"name":"Battle Cry","overview":"Hakuryuu takes the villager girl and Morgiana to the treasure room for their own safety, leaving Aladdin and Alibaba to confront the three enemies, Ithnan, Dunya and her knight Isaac by themselves. Just like Cassim did once, Dunya impales herself with a Dark Metal Vessel and becomes a Dark Djinn to fight Aladdin, while Isaac crosses swords with Alibaba. The young Magi and his friend find themselves on a disadvantage at first, until they change their strategy and gain the upper hand. However, Ithnan has Dunya assume further control of her power, fully equipping her Dark Djinn, while Isaac somehow recovers from his wounds. Meanwhile in Sindria, Judar flees after declaring that with the barrier protecting the country now destroyed, an invading force from Al-Thamen is en route there to destroy it. As Hakuryuu returns to assist his friends against the enemy, Sinbad and his forces prepare to defend their country from the impending attack by Al-Thamen.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/qnP895CEe3DDzCdIt9bvbTmw8sa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-24","episode_number":24,"episode_type":"standard","id":974075,"name":"Fall into Depravity","overview":"The forces of Sindria resist the attack from Al-Thamen's forces, but while Sharrkan and Masrur manage to defeat two of the enemy's main commanders, an ominous huge mass approaches the island, devouring all it touches. Meanwhile at the dungeon, the empowered Dunya prepares a massive attack to wipe out Aladdin and the others while Isaac protects her. Just when Alibaba is about to be killed by Isaac, Hakuryuu stands between them to protect him and has his left hand cut off. Once completing her Extreme Magic, Dunya seemingly obliterates the trio with a rain of countless swords, just to find that she was aiming at a mirage created by Aladdin's magic, far away from their real position. Once exhausted Dunya returns to normal and Isaac starts breaking apart, revealed to be just an inorganic servant of hers. Alibaba tries to reason with Dunya, but she is mortally wounded by Ithnan, claiming that her services are no longer required. Alibaba is then surrounded by a mass of Black Rukn that shows him that she was a princess from the Musta'sim country, which was overthrown by the magicians of Magnostadt, and that Isaac was modeled after Dunya's servant who sacrificed himself to protect her. With the corruption spreading throughout his body, an enraged Alibaba stabs Ithnan with his sword. Ithnan then finally perishes, but not without accomplishing his objective: to have Alibaba fall into depravity and transform himself into a Dark Djinn.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/23DcpENw7iuMjZuDSTTAp0Uhnkw.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"60718f8f498bc20040d253cb","adult":false,"gender":1,"id":1848321,"known_for_department":"Visual Effects","name":"Yumiko Ishii","original_name":"Yumiko Ishii","popularity":1.29,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-03-31","episode_number":25,"episode_type":"finale","id":974076,"name":"Alibaba and Aladdin","overview":"Aladdin tries to reason with Alibaba with no success due to Ithnan's control. Morgiana and Hakuryuu join the fight and in the occasion, the real Zagan chooses Hakuryuu as his master, using his powers to create a replacement for his lost arm and they manage to give an opening for Aladdin to successfully reach his mind with the Wisdom of Solomon. With Kogyoku's help, Sinbad's forces manage to defeat the remaining threats and protect Sindria. As Ithnan flees away, Sinbad appears before him and fully equips his Djinn Focalor, but much to the enemy's surprise, his corrupted body recovers. Ithnan then realizes that by some reason, despite half of Sinbad's body having already fallen into depravity, he has full control over both his normal and black rukh, using them to deal a finishing blow to him. Inside Alibaba's conscience, Aladdin learns that a part of Cassim's magoi still lives inside Alibaba and with his help, he manages to erase the corruption in his body as well. Now with his main body destroyed, what remains of Ithnan inside Alibaba's mind is confronted by Aladdin, who wants to know the reason why Al Thamen intends to bring turmoil to the world and recognizing him as an envoy of King Solomon, he shows him visions of Solomon's kingdom Alma Toran, including the moment of its destruction. Claiming that it is impossible to dissuade him, Ithnan asks Alibaba to strike him down for good, but he refrains from doing so, allowing Aladdin to have him return peacefully to the guidance of Rukh. As Aladdin and Alibaba leave the dungeon with his friends, having saved the villagers and claimed its treasures, the young Magi renews his vow to help his friend to become a King that shall properly guide the world, certain that their adventures together are just beginning.","production_code":"","runtime":24,"season_number":1,"show_id":60654,"still_path":"/pYgdjeShF9sL1UQfLgEAPUkkLCi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Magi: The Labyrinth of Magic","overview":"Aladdin is a boy who has set out to explore the world after being trapped in a room for most of his life. His best friend is a flute with a djinn in it named Ugo. Soon enough, Aladdin discovers he is a Magi, a magician who chooses kings, and he was born to choose kings who will follow the righteous path, battling against those who want to destroy fate.","id":60191,"poster_path":"/htcydwrp69GeWmNFUf9Ja6wSzew.jpg","season_number":1,"vote_average":8.7},"2":{"_id":"57e789efc3a368475d006a29","air_date":"2013-10-06","episodes":[{"air_date":"2013-10-06","episode_number":1,"episode_type":"standard","id":1226294,"name":"Premonition of a Journey","overview":"Aladdin and his friends return to Sindria and are saluted by the people for conquering Zagan. During the festivities, Hakuryuu and Kougyoku hear that they were summoned back to the Kou Empire. It is also revealed that Dunya is resting at the palace, but refuses to talk to anyone beside Aladdin. By inspecting Dunya's dark metal vessel, Sinbad and his companions discover that it was crafted in Yamuraiha's home country, Magnostadt implying that said nation is somehow involved in Al-Thamen's plans. However, when Sinbad tries to inquire Dunya about it, the vessel fragment inside her body reacts, putting her life in danger. Aladdin manages to save her using Solomon's Wisdom but soon after, they learn that with her condition, she does not have much time left to live. Once reunited with Alibaba and Morgiana, Aladdin informs them that he will soon embark on a new journey by himself.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/dOwjWCZmawwLNXTVnOp8lhnhYCw.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-10-13","episode_number":2,"episode_type":"standard","id":1226295,"name":"Departure","overview":"Aladdin reveals to Morgiana and Alibaba that he intends to depart alone to study magic in Magnostadt. As there are suspicions of Magnostadt's involvement with Al-Thamen, his friends attempt to dissuade him with no success. In the next day, Alibaba trains his Djinn Equip when Kougyoku appears to challenge him for a duel, but Sinbad steps in to duel with her instead and easily wins after unleashing the power of his Djinn Zepar. After the battle, Alibaba keeps company to Kougyoku as she recovers and they end up becoming friends while Sinbad agrees to join Hakuryuu against Al-Thamen when the time comes for him to challenge them. Dunya's condition worsens and she eventually dies beside Aladdin. After Dunya's funeral, both Hakuryuu and Kougyoku reveal that it is time for them to return to the Kou Empire while Aladdin still keeps his resolve to leave for Magnostadt.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/AqGN6Xfk1LdPlzN5czYQ5cDzRn5.jpg","vote_average":6,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2013-10-20","episode_number":3,"episode_type":"standard","id":1226296,"name":"Setting Sail","overview":"The time comes for Aladdin's departure to Magnostadt. Hakuryuu and Morgiana decide to accompany him up to the Actia Kingdom before they follow their separate paths, with Hakuryuu returning to the Kou Empire and Morgiana leaving to visit her homeland in the Dark Continent. Alibaba, who is already aboard the ship, intends to make a surprise for Aladdin and the others but he is tricked by them who already knew about it. Alibaba then reveals that he intends to train with the Yambala Gladiators at the Reim Empire to master his Djinn Equip and learn to control his magoi. Several days later, the ship is about to reach the port in Actia when it is surrounded by pirates.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/ocyioZvXdYxkydqUIVkSwDgeI29.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-27","episode_number":4,"episode_type":"standard","id":1226297,"name":"Pirates","overview":"Aladdin and his friends have trouble fighting the pirates not only because of their magical tools, but due to the fact that all of them are children. When the pirates manage to capture Aladdin, they force the others to surrender and after looting the ship, they flee taking the young Magi with them. Unable to chase after their friend, Alibaba and the others disembark at Actia, where they learn that the pirates kidnapped several children from the slums and the military refuses to help them claiming that the country has mobilized its army to defend the northern frontier from a possible invasion from Magnostadt, but the commoners accuse them of turning a blind eye because the victims were not from the royalty or the nobility. Alibaba then agrees to help them without the military's help and Hakuryuu reveals that he can track down the pirates by a seed infused with his magic which he has hidden inside their loot. Meanwhile, Aladdin is introduced by the pirates leader Aum Madaura who claims that the children are better under her care then living in poverty with their families, but he refuses to believe her. As Aladdin confronts Madaura, Alibaba, Hakuryuu and Morgiana storm the pirates hideout to rescue him.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/uyWYSbXkMz46N0Xa0Hl9XKpJNm7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-03","episode_number":5,"episode_type":"standard","id":1226298,"name":"Mother","overview":"Aladdin's friends storm the pirate stronghold defeating all opposition despite being astonished at all their enemies being children, including small ones. Meanwhile, Madaura uses her magic tool, the \"Holy Mother Halo Fan\" to entice Aladdin using his feelings for his long lost mother, doing the same with Alibaba and the others when they arrive to rescue him. It is then revealed that the unyielding loyalty of Madaura's crew to hers is because all of them are under the fan's effect and she intends to use it on the future leaders of the world's nations while they are still children in order to control their nations. However, Aladdin breaks free from Madaura's spell and helps Alibaba and Morgiana to regain their senses as well, but Hakuryuu falls under its influence instead and turns against his friends to protect her.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/5m9qQbpmgYQ3z9u5rnreUKPINfn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-10","episode_number":6,"episode_type":"standard","id":1226299,"name":"A Kind Person","overview":"The brainwashed Hakuryuu fights his own friends until Alibaba manages to destroy his metal vessel and he collapses from exaustion. Madaura attempts to escape but she is captured by the Actian military along the rest of the pirates. Back at the port, a commotion is started by the locals who attack the imprisioned Madaura until Hakuryuu stops them not to defend her, but to decapitate her in front of the pirates who swear revenge on him. Questioning him for his actions, Alibaba learns from Hakuryuu that his true objective to to take revenge on his own mother for joining forces with Al-Thamen to have his uncle usurp the throne of the Kou Empire by orchestrating the death of his father and his older brothers. Realizing that the children under Madaura's spell are almost falling into depravity, Aladdin looks for a way to help them, but it is Alibaba who takes custody of the pirates and inspires them to move on with their lives as despite Madaura's death they still have each other to care for. As his friends watch the children depart to Sindria, Hakuryuu decides to leave without bidding farewell to them and when Morgiana appears looking for him, he confesses his feelings for her and asks for her hand in marriage but she refuses. Upon learning of Hakuryuu's sudden departure, Alibaba intends to reason with him fearing that he may end up suffering for killing his own parent just like Cassim did, but Aladdin decides to talk with him by himself. After properly bidding farewell to Hakuryuu, Aladdin returns to his friends' side as they also prepare themselves to follow their separate paths.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/iaCbCILjAkMZd5KFbmJ0xx7e46a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-17","episode_number":7,"episode_type":"standard","id":1226300,"name":"Ren Kouha Appears","overview":"Aladdin, Alibaba and Morgiana have one last party together before parting ways, promising to meet again as soon as possible. While Alibaba and Morgiana keep traveling by sea, but each with a different destination, Aladdin travels to Magnostadt riding his magic turban until he gets tired and boards a passing carriage instead, with instrucions to not disturb the other client who is traveling with them. When the convoy is attacked by thieves, the traveler is revealed to be prince Kouha Ren of the Kou Empire, who kills all the attackers with his metal vessel and befriends Aladdin, who keeps him company during the rest of the travel to Magnostadt. Upon arriving at their destination, Kouha and Aladdin part ways and to obtain permission to enter the country, the young Magi barely succeds in a test of his magic skills without revealing his true nature by using a special gem from Yamraiha that prevents him from drawing the Rukh arround him.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/89jAImKCw7z0crOhdy4VoRFTgS3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-24","episode_number":8,"episode_type":"standard","id":1226301,"name":"Days of Training","overview":"Forced to perform magic only with his own magoi, Aladdin is assigned to the lowest ranking class at the Magnostadt Academy, the \"sixth kodor\" where he is put under a heavy routine of physical training under his teacher Myers, who reveals that he and the other sixt kodor students will have another test in two months and will be expelled from the academy if they fail. He also meets his roommate Sphintus, who looks down on him at first for being assigned to a lower ranked class but eventually befriends him upon seeing his hard work. Myers' harsh training continues for one month, as more and more people drop out the academy until only Aladdin and other four students remain. Myers then reveals that the purpose of her training was to strenghten their bodies so they could increase the ammount of magoi they can harness for their magic and the results of their hard work are shown when they discover that their magical power had greatly increased. After a month of solely magic classes, the time comes for Aladdin's exam and he passes with flying colors, reassigned directly from the sixth to the first kodor, the highest ranking class in the academy. Meanwhile, Alibaba finally reaches his destination, the Reim Empire.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/lmLG5m7IPpOTxbqUEG8mmvllpqw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-01","episode_number":9,"episode_type":"standard","id":1226302,"name":"The Reim Empire","overview":"After being duped and stripped of all his belongings during his voyage, a hungry and weakened Alibaba finally arrives at the colosseum at the Reim Empire, seeking to study under the Yambala Gladiators, but having lost his letter of recommendation from Sinbad, Toto, one of the gladiators refuses to let him see her leader after easily defeating him in combat. Alibaba is then sheltered by the Nando Brothers, who used to be members of the Fog Troupe and had made a fortune by opening a cassino in Reim. After fully recovering, Alibaba meets the leader of the gladiators, Shambal Ramal and asks for a rematch with Toto, winning after having stripped her armor without hurting her. Alibaba is then examined by Shambal and learns from him that somehow his body houses two different kinds of Magoi, interfering with his body and unless he learns to control both, not only he will never master his Djinn Equip, but will also eventually die. Shambal then accepts Alibaba as a student but to have him pay for his tutoring fees, Shambal arranges a fight for him at the colosseum against a huge, vicious beast and among the spectators is Sheherazade, the High Priestess of Reim.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/mz9Y238M7n87AoSoBkNc9dw6kfh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-08","episode_number":10,"episode_type":"standard","id":1226303,"name":"The High Priestess","overview":"Forbidden to fight using his Djinn, Alibaba finds himself in a pinch against Garda, a huge ape monster on his debut at the colosseum. Severely wounded, Alibaba attempts to forfeit but the guars do not listen to him at all, as the audience wants a fight to the death. With his left arm broken, Alibaba reminisces about his childhood with Cassim and how they used to defeat much taller opponents with their wits and uses his surrounding at his favor to make a comeback and defeat Garda. In that moment, Shambal realizes that the two Magoi in Alibaba's body had fused into one when he recognized that the other magoi inhis body belonged to Cassim. A few days later, Alibaba recovers from his wounds and it is revealed that he bought Garda's freedom, and the giant monkey now watches him with respect. Shambal then accepts Alibaba as his disciple. Meanwhile, Morgiana finally reaches her destination in the Dark Continent.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/liMlJ4uc6HdI6jWaiNzVgHXjc9v.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-15","episode_number":11,"episode_type":"standard","id":1226304,"name":"The Great Rift","overview":"Disappointed upon learning that the Katarg region where she was born is not inhabitated by the Fanalis anymore, Morgiana is about to be attacked by slave traders when Alibaba's brothers, Abhmad and Sabhmad appear to intervene. As they take Morgiana to see a leader of the local Toran village, Sabhmad reveals that after being removed from power in Balbadd, Sinbad recruited them to work as archeologists and investigate the elusive Toran culture, which is far older than all others existant. After learning that the Fanalis have resettled by the other side of a gigantic canyon known as \"The Great Rift\", Morgiana decides to cross it in order to finally reunite with her people, despite being warned that no one ever returned. After reaching the bottom of the rift, Morgiana comes across a house and is recieved by the Magi Yunan, who reaffirms that once she reaches the other side, she could not return even with his powers. Meanwhile at Magnostadt, Kouha is informed that his father, the Kou Emperor has passed away, and is forced to return home, but not before leaving a warning that should Magnostadt not surrender, they will be invaded by Kou and having a brief meeting with Aladdin. Back at the Kou Empire, Hakuei reunites with her brother Hakuryuu, but she seems displeased with him for some reason, when their brother and the governor general Kouen Ren appears before them.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/aLw5keHys6bzhMAFAGR1aXS9nHt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-22","episode_number":12,"episode_type":"standard","id":1226305,"name":"A New Emperor","overview":"The heirs of the Kou Empire's throne gather to mourn their deceased father and decide his successor. In the occasion, Hakuei reminisces how ruthless her brother Hakuryuu has become after obtaining Zagan and becoming a general as her, although his army is solely composed of monsters he subdued. There is little doubt that their older brother Kouen will be chosen as the new emperor. However, their mother and empress Gyokuen Ren is appointed as the next ruler instead by a will allegedly left by her late husband, and a divide is created among the royal court, although Gyokuen claims that she will eventually relenquish the throne to Kouen once their ambition to conquer the whole world has been fulfilled. After the meeting, Hakuryuu attempts to convince Hakuei to join him against their mother with no success and decides to confront her by himself in order to avenge his father and brothers who were betrayed by her. However, even with his new power Hakuryuu is defeated by her and Judar offers himself to assist with his revenge, should he \"curses his fate\".","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/MbivkiEcYBHUkAyq8o4v9YHK7r.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-29","episode_number":13,"episode_type":"standard","id":1226306,"name":"Titus Alexius","overview":"One year after parting with his friends, Aladdin progresses with his studies and passes the final exam of the First Kodor with flying colors by creating a huge mirage with his powers.Aladdin's friends are sure that he will be awarded as the best student of the First Kodor, but they get astonished when another student, Titus Alexius from the Reim Empire, was chosen instead. While moving to his new room, Aladdin is approached by Titus who wants to befriend him as he recognizes him as a brilliant student as well, but when Aladdin gropes him to make sure that he is not a girl, Titus gets angry at him until Matal Mogamett, the Academy's chanceller appears before them. In the occasion, it is announced that Aladdin and Titus will have a fight to test their abilities and decide if they are worthy of having advanced classes. The battle between them is fierce until both mutually expose the jewels incrusted in their arms by accident, and Mogamett declares that both will be recommended by himself. However, when Aladdin tells Titus that he wishes to talk to him about the jewels, he is suddenly attacked by Titus and despite Mogamett's intervention, Aladdin is knocked uncounscious and Titus is put into solitary confinement. While Aladdin is yet to recover, Titus make contact with Sheherazade who instructs him to \"keep with his mission\", which according to her, is the only reason why he was born.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/yaQ15DN5bZLr2S8ElJSQeoDMzwn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-12","episode_number":14,"episode_type":"standard","id":1226307,"name":"The Hidden Citizens","overview":"Recovering from his wounds, Aladdin finds Titus in his room, who questions him about his intentions. In the occasion, Titus reveals that he is a magician sent by Sheherazade to spy on Magnostadt, Aladdin reveals his identity as a Magi and they become friends. In the next day, Aladdin, Titus and Sphintus explore the other districts of the city but are informed that the 5th Authorization District is off limits to them until they receive the proper education. Curious about it, the trio infiltrates the 1st district and while investigating some documents, learns that the 5th district is the lair of those without an occupation, comprising two thirds of the entire city's population. While exploring the 5th district, Aladdin and the others find that its residents are being slowly drained of their Magoi when a small child collapses near them. While providing assistance to the child, who introduces herself as Marga, they learn that the citizens of the 5th district have their Magoi drained to provide energy for the magical tools used by citizens of higher levels, and Marga's heart condition is being worsened by it. Soon after, some magicians arrive to check on the citizens and when they find that Marga's Magoi is almost depleted, they throw her into a large pit to discard her, but as she falls, Aladdin and Titus jump down to rescue her.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/4pUFy7zYHZJ9mhYCN68lUUKsXMU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-19","episode_number":15,"episode_type":"standard","id":1226308,"name":"The Magicians Country","overview":"Aladdin and Titus rescue Marga and confront the other magicians to protect the civilians until Myers appears to stop them. Brought before Mogamett, Aladdin is forgiven by the chancellor who reveals that he knows his teacher is Yamraiha and that he took care over her for some time after she lost her parents. In the next day, it is announced that the students are now authorized to visit the 5th district after Titus expressed his desire to keep watching over Marga's health, but before that, Mogamett appears to give them a lesson about the reasons for the current status quo of Magnostadt. Using clarivoyance magic, Mogamett reveals his memories of the past, when Magnostadt was still the Musta'sim Kingdom, 70 years ago when he and other magicians were forced by the royalty to use their magic to exhuastion in order to improve the land, which led to the death of his wife. After years of effort to perfect their magic, Mogamett and his fellow magicians earned themselves a place in the royal court, which drew the envy of the other nobles. However, when an unknown disease appeared in the country, the magicians were blamed and pursued for it until they were drafted as soldiers against an invasion from the Partevia Empire. The invaders were repelled, but several magicians were killed during the battle including Mogamett's only daughter and when realizing how the royals and nobles had no consideration at all for all their efforts and sacrifices, Mogamett decided to rebel against them.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/ifBdTcpNeaTqNaQDrqNYotviREJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-26","episode_number":16,"episode_type":"standard","id":1226309,"name":"Remaining Life","overview":"Mogamett then reveals that after using their magic to gain the favor of most of the population, the magicians led by him incited a revolt that led to the downfall of the Musta'sim royalty and the establishment of Magnostadt. Impressed with Mogamett's speech, the students start opening up to his views except for Aladdin and Titus. Some time later, Mogamett asks Titus to take him to Marga in the 5th district where he allows the girl to live with him at the surface. Aladdin accompanies them as well and realizes that Mogamett does not view the non-magicians as humans anymore and fears that it will eventually lead everyone to ruin. Marga is then examined and Mogamett reveals that while she can't be cured of her condition, her life can be saved, much to Titus' relief. Meanwhile, Aladdin has classes with High Magician Irene Smirnoff, who displays her experiments with Black Rukh and confirms his suspicions that Magnostadt is somehow connected to Al-Thamen. Back at his home, Titus is informed by Sheherazade that his mission is accomplished and is ordered to return home, but he turns to Mogamett for help instead, as just like Marga, he does not have much time left to live.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/n2JvwwVcQKOd7ZZnUGNiKOfBeEV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-26","episode_number":17,"episode_type":"standard","id":1226310,"name":"Declaration of War","overview":"Titus reveals that he is a clone of Sheherazade's created using a part of her body and infused with her Rukh to act as her proxy, and he only has a month until his body expires. Mogamett tries to calm him down when Sheherazade herself contacts the chancellor by possessing Titus' body and demands him to return the boy to her. In the occasion, she gives an ultimatum to Mogamett, claiming that eventually the only paths for Magnostadt are to be annexed by either Reim or the Kou Empire and urges him to surrender. Mogamett then breaks Titus and Sheherazade's connection to relieve him from her influence. After explaining the situation to Aladdin, Mogamett is inquired by him about his connection with Al-Thamen and reveals that he and his companions once allied with Ithnan and together, they developed the Dark Metal Vessels but severed ties with them after learning that they entrusted the vessels to non-magicians including Dunya. In the next day, the magicians decide to wage war against the Reim Empire to ensure their independence and while news of the war reach Sinbad and Kouha, Mu Alexius, one of Reim's three dungeon capturers and leader of the \"Fanalis Corps\" is entrusted with the task of conquer Magnostadt and bring Titus back. Mu and his forces then depart to Magnostadt, and Alibaba is seen aboard one of their ships, hoping to meet Aladdin there.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/aCsRvPErZ8IDq2tsyuq2aR98hEt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-02","episode_number":18,"episode_type":"standard","id":1226311,"name":"Leam's Threat","overview":"The forces of Reim led by Mu arrive at Magnostadt and after Mogamett and his forces refuse to surrender, the Empire's soldiers charge forward. However, they are easily repelled by one of the three magical barriers surrounding the city and the magicians' counterattack. Meanwhile, Aladdin roams through the city looking for something that he claims it will bring death to everyone at the city if left unchecked. Back at the battlefield, the Reim forces break through the first barrier using explosives and press forward until the magicians deploy a powerful long range weapon that wipes out hundreds of enemy soldiers at once until Mu and the Fanalis Corps join the battle to protect them by blocking the weapon's shots with massive rocks and confront the Magnostadt forces directly. Perceiving that the magicians' weapon is draining the Magoi of the citizens of the 5th district to the death, Aladdin destroys the cables that power it before flying to the frontlines where Mu defeats Titus and urges him to accompany back home until the young Magi arrives and asks for their cooperation to end the war for everyone's sake.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/18ZKFQ349p1hq7DuBFpSxoGJHKd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-09","episode_number":19,"episode_type":"standard","id":1226312,"name":"A True Magi","overview":"Aladdin attempts to dissuade Mu with no success and then unlocks his Magi powers to assist the magicians against the Fanalis Corps. With most of his companions defeated, Mu decides to press forward using the powers of his Djinn Barbatos, accompanied only by his sister Myron and his subordinate Lo'lo', fighting with their household vessels. The three Fanalis then approach the second barrier but before they could take it down, Aladdin summons three sand giants to protect it. Having fully recovered his powers, the Magi fires a huge column of fire to dissuade the invaders and Alibaba, stationed at a ship, wonders if it was his friend's doing. Aladdin reaffirms his will to end the war without further casualties, and when Mu dares him to stop his forces without killing them, he dispels the giants into a huge sandslide that drags the Reim forces all the way back to the coast, giving time for Mogamett to restore the barriers. Aladdin then declares that should the invaders attempt to press forward again, he will just push them back as much times as needed, breaking the soldiers will to fight.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/voGLsTv2U8YQFr5UcmDUWsOVyHs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-23","episode_number":20,"episode_type":"standard","id":1226313,"name":"Reunion","overview":"Following Aladdin's declaration, Mu equips his Djinn and attempts to kill him and take over Magnostadt in one fell swoop, but Alibaba appears to stop the general, using Amon's power to dispel his Extreme Magic. Soon after, Sheherazade appoaches them and asks for a meeting in private with Aladdin, Alibaba and Titus at a neutral location. During the meeting, Aladdin asks for Sheherazade to end the war, claiming that destruction will befall the world should Mogamett be pushed to the limit, as the chanceller has possibly assembled a large quantity of Black Rukh and this could be used to repeat the same tragedy that befell Alma Toran, mankind's original world. Aladdin also reveals that this is Al-Thamen's ultimate objective and it must be prevented at all costs. After agreeing with a cease fire, Sheherazade reveals that her young body is a clone of her original, aging body just like Titus and allows him to spend the rest of his days with his friends, as her original body is almost perishing, and when that happens, all her clones will die as well. However, news of another invasion, this time from the Kou Empire reach them, and when Mogamett learns about it, he claims that from then on he will deal with all the invaders personally.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/oJV0bZdwp0bUxEsJTUuPWi0FChI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-02","episode_number":21,"episode_type":"standard","id":1226314,"name":"The King's Candidate","overview":"Deep into the undergrounds of the 5th district, Mogamett takes control of a large mass of Black Rukh stored there after falling into depravity to deal with the invading forces, just as the Kou army, led by Kouha charges forward. Kouha's forces are repelled by three huge Dark Djinns summoned by Mogamett. Despite fully equipping his Djinn Leraje, Kouha fights to the exhuastion because the monsters keep regenerating and urges his forces to retreat, but the soldiers refuse to comply out of their loyalty to him. It is then revealed that Leraje had chose Kouha as its master because the members of his household come from outcasts and disgraced clans who were accepted by him with no prejudice at all, leading to their unyielding devotion to him. However, just as Kouha is about to be defeated, Alibaba, fully equipping Amon, appears to drive the Dark Djins away. When attacked by a bigger number of Dark Djinns, Alibaba decides to bring out his extreme magic to destroy them for good, but just before he could do it, the monsters are vanquished by the forces of Kouen, who appears to help his brother.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/rBZGU4y8jsEIwXPeifzuKyWfrfA.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Storyboard Artist","department":"Art","credit_id":"63e155221f0275007f8da3c1","adult":false,"gender":1,"id":2379724,"known_for_department":"Directing","name":"Mamiko Sekiya","original_name":"Mamiko Sekiya","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-03-09","episode_number":22,"episode_type":"standard","id":1226315,"name":"What You Want to Protect","overview":"The Dark Djinns are temporarily repelled by Kouen's household, but another group of them start attacking the Reim fleet and Sheherazade along Mu and the Fanalis Corps make a stand for the rest of their forces to retreat. Meanwhile, Back in Magnostadt, Titus is sheltered inside his house, clinging to Marga, in despair not only because he has so little time left but is unsure about what he should do for the sake of all the people he befriended. Marga then encourages him to follow his beliefs to the end no matter the cost and the duo leave to meet Mogamett at the Magoi Furnace. Certain that the chancellor does not truly hate the non-magicians as he claims, Titus use the last of the Magoi inside his body to pull Mogamett out of the furnace, dying in the process. However, the Furnace does not stop working and keeps draining Mogamett's Magoi until killing him, becoming a huge mass of energy that opens a portal in the sky and a large, ominous creature start appearing through it. Empress Gyokuen and the members of Al Thamen rejoice with the fact, claiming that the entity in question is their god and it was their intent to summon it all this time. Aladdin recognizes the being as well, and reveals that it must be stopped no matter the cost.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/qZY8TVbCb7Gbr4CwZ9DEGwaUyc1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-16","episode_number":23,"episode_type":"standard","id":1226316,"name":"The Djinn Warriors","overview":"Aladdin asks for Kouen's help and to convince him, summons his, Alibaba and Kouha's Djinns altogether. The Djinns then confirm Aladdin's claim that should the corrupt god Il Irah not be stopped, it will drain all of the world's White Rukh and all life on it will be extinguished. However, Kouen is more interested in which other secrets Aladdin could be hiding from him and agrees to help with the condition of the young Magi answering all his questions afterwards. As Kouen calls for his other brothers and sisters, the huge medium keeps conjuring Dark Djinns that attack the population of Magnostadt, and little Sheherazade and the magicians can do to stop them. Aladdin and Alibaba, assisted by the Kou Empire's King Vessels appear to fight the monsters, but the medium is protected by a strong barrier and Aladdin and the others would surely be exhausted before breaking it. Kouen then equips the Djinn Agares that he uses to bring forth a volcano and uses its heat to empower his Djinn Astaroth, allowing him to keep attacking without rest, but only its power is not enough, and he drags Alibaba to help him. As Amon is also a fire Djinn, both use the lava to empower their vessels and by combining his Extreme Magic with Kouen's, Alibaba strikes at the medium's barrier.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/pHxFzTTk8gPZFV4fXzpTTNFUVcf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-23","episode_number":24,"episode_type":"standard","id":1226317,"name":"Time of Destruction","overview":"Even with the combined effort of Alibaba and Kouen, the medium's barrier was not destroyed and it closes the volcano to prevent them from replenishing their magoi. Soon after, the medium assumes a grotesque, humanoid-like form that drains the White Rukh from everything it touches. When the medium seriously hurts Kouen and Alibaba, Kouen's brothers combine their efforts to deal a sequence of powerful attacks at it, ultimately dropping it into the ocean, which backfires when it empowers itself by draining the Rukh from the sea. Back at the Kou palace, Gyokuen watches in awe the whole battle, reminiscing the time when she was one of Solomon's Magi at Alma Torran before betraying him. Exhausted by the continued battle, Aladdin and the others little can do to stop the medium as it starts pulling Il Irah from the heavens, when Sinbad appears to assist them, accompanied by Drakon, Yamraiha and the other King Vessels from the Alliance of the Seven Seas. Surprised with their sudden appearance, Aladdin is informed by Sinbad that they were previouly warned of the situation by Yunan and Morgiana, who also appear to join the battle against the medium as well.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/vjN21OMv2Zd0dGd0jv4JEQJoMjM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-30","episode_number":25,"episode_type":"finale","id":1226318,"name":"Welcome Home","overview":"As the magicians rescue the wounded in Magnostadt, Mu and the other Vessels from Reim also join the battle. In a last effort to destroy the medium, Sheherazade sacrifices herself to reinvigorate the weary King Vessels with the last of her magoi and all dungeon capturers join forces to attack it with all their might at once. However, the medium survives the blow, but Aladdin glimpses a small light inside the giant making it hesitate. Certain that it must somehow related to Titus and Mogamett, the Magi uses the Solomon's Wisdom to reach them, accompanied by Yamraiha who also wants to reunite with her foster father. The two find Mogamett being conforted by Titus' Rukh and the chancellor reveals his regret for all the troubles he caused and all the people that he forced to fall into depravity in order to create the medium. In the occasion, it is revealed that Yamraiha was kidnapped from the Royal Palace in Musta'sim when she was a child and raised by him, but she claims that she does not regret it at all and he will always be a father to her. Mogamett then decides to depart to the Great Flow of Rukh, after asking Aladdin to look for a way to redeem those who had fallen into depravity and return them to the White Rukh as well. As the medium collapses, Gyokuen rejoices as despite failing to bring forth Il Irah this time, the medium had weakened the boundaries between worlds, and another medium may bring its advent immediately once completed. Meanwhile at the great palace, Ugo greets Sheherazade and offers her a chance to reincarnate as a Magi but she allows Titus to do so in her place. The Kou Empire then turns their attention to the conquest of Magnostadt, but Sinbad declares that Sindria and its allies had joined forces with the Reim Empire and he will take custody of the country for the sake of its reconstruction. Kouen then decides to take Aladdin with him and have him fulfill his part of their deal, but their discussion is interrupted when Titus, now reincarnated as the new Magi of Reim appears before them, much to his friends' rejoice. Elsewhere, Judar and Hakuryuu, who were watching the entire battle from afar, gather all the Black Rukh dispersed from the medium and before leaving with him, Hakuryuu bids farewell to Aladdin and the others, claiming that to follow the path he chose, he must turn his back to them.","production_code":"","runtime":24,"season_number":2,"show_id":60654,"still_path":"/c3XEnrCDHBt78mFSIJWrihvUKyb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Magi: The Kingdom of Magic","overview":"After celebrating their victory against Al-Thamen, Aladdin and his friends depart the land of Sindria. With the end of the battle, however, comes the time for each of them to go their separate ways. Hakuryuu and Kougyoku are ordered to go back to their home country, the Kou Empire. Meanwhile Aladdin announces he needs to head for Magnostadt—a mysterious country ruled by magicians—to investigate the mysterious events occurring in this new kingdom and become more proficient in magic. For their part, encouraged by Aladdin's words, Alibaba and Morgiana also set off in pursuit of their own goals: training and going to her homeland, respectively.","id":80498,"poster_path":"/5NxyJwSjpggv8HWTQ6JNAXtX5hJ.jpg","season_number":2,"vote_average":6.5}}}