{"adult":false,"backdrop_path":"/nRqJjdeFdQBHdNdBAYTyhRCryOE.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2012-01-21","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.history.com/shows/americas-book-of-secrets","id":60744,"in_production":false,"languages":["en"],"last_air_date":"2021-07-20","last_episode_to_air":{"id":3079469,"name":"Deadly Pandemics","overview":"In 2020, COVID 19 effectively shut down the entire world–and in the process, elevated pandemics to the most important issue across the globe. How do they start? Is it possible to contain them? And could COVID 19 be merely the precursor to something much worse?","vote_average":0,"vote_count":0,"air_date":"2021-07-20","episode_number":10,"episode_type":"finale","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/wCv9Az3QkS0yaTxb4IdvSNh6ooy.jpg"},"name":"America's Book of Secrets","next_episode_to_air":null,"networks":[{"id":65,"logo_path":"/9fGgdJz17aBX7dOyfHJtsozB7bf.png","name":"History","origin_country":"US"}],"number_of_episodes":43,"number_of_seasons":4,"origin_country":["US"],"original_language":"en","original_name":"America's Book of Secrets","overview":"Have you ever wondered what goes on behind the scenes of the most legendary monuments and powerful organizations in the United States? America’s Book of Secrets lifts the veil of mystery, giving you unparalleled access to historical narratives and insider information previously hidden from the public. Through in-depth research and exclusive channels, this series delves into a variety of familiar but enigmatic American institutions, from the FBI and the Pentagon to Fort Knox and Area 51. Go beyond the locked doors and security checkpoints of government agencies, famous landmarks and stealthy societies to glimpse the hidden worlds you were never intended to see.","popularity":5.709,"poster_path":"/u4l4CGzNoukLjXgvgnSladOc8Xq.jpg","production_companies":[{"id":23521,"logo_path":null,"name":"Prometheus Pictures","origin_country":""}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2012-01-21","episode_count":11,"id":60572,"name":"Season 1","overview":"","poster_path":"/jIYKNJE1qwrs9KCvggddrtvZNRN.jpg","season_number":1,"vote_average":0},{"air_date":"2013-04-05","episode_count":12,"id":60573,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2014-03-29","episode_count":10,"id":60574,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2021-05-11","episode_count":10,"id":202673,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":7.6,"vote_count":11,"season_data":{"1":{"_id":"537749e2c3a36855420014c0","air_date":"2012-01-21","episodes":[{"air_date":"2012-01-21","episode_number":1,"episode_type":"standard","id":977401,"name":"The White House","overview":"An inside look at the secret protocols, elite security and hidden history of the world's most public of private residences. What is the most secret room in the White House and what makes it so powerful? What secret visitors have been to the White House--invited or not? What kind of background checks are needed to work at the White House? What security measures go into effect if the White House is under attack? For over 200 years, the White House has functioned as a Presidential residence, Executive Office and national command center. But more guarded than the White House itself--are its secrets. Secrets that have remained untold...until now.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/gkXHxwvd420LkydoZrFLCdiHuUZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-28","episode_number":2,"episode_type":"standard","id":977400,"name":"Freemasons","overview":"It is America's most private organization with secretive meetings and a membership that includes the most powerful men in America--and the world. But behind this elite brotherhood... are secrets. This episode explores the secret history, rituals and reach of the most well-known secret society in the world. How did the Freemasons shape America? What goes on at Freemason meetings? What secrets ceremonies and rituals are still conducted today? What is the meaning of Freemasonry symbols like the eye, the square and the compass? Are the Freemasons part of a New World Order with plans to control the world? For centuries, the Freemasons have been thought to be the architects behind the world's greatest international conspiracies. But more elusive than the organization itself--are its secrets. Secrets that have remained untold...until now.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/bXL71C7WJ8VOeD8TUBgUlI4A9Ew.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-04","episode_number":3,"episode_type":"standard","id":977402,"name":"Fort Knox","overview":"It is one of the most secure structures in the world. It safeguards the vast wealth of the United States... And its name is synonymous with one of the most precious commodities in the history of the world--gold. But behind this building's stone exterior are secrets. This episode unlocks the secret contents, political controversy, and cutting edge security hidden behind the gates of the world's most famous vault. How did the Unites States amass its gold? What is the precious metal really worth? Who's allowed inside the vault? What else is stashed there? Could Fort Knox actually be empty?","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/5v6V9vIQS0tqJBuAuecGvBBmNkZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-11","episode_number":4,"episode_type":"standard","id":977404,"name":"Area 51","overview":"It is one of the most covert military bases on American soil, protecting the nation's most confidential research and development. For decades, the highest levels of government had denied its existence. But behind the barbed wire fences and surveillance cameras are secrets...Go inside the most famous secret military base on Earth to expose the high-tech security, undercover operations, and most outrageous claims surrounding the 575 square miles of \"restricted\" space. What actually goes on at Area 51? Is there a connection between Area 51 and the Roswell event of 1947? Could there be a secret subterranean city underneath the barren desert? Have the conspiracy theories surrounding Area 51 been a smokescreen for controversial military projects? While the government may never reveal what it's really hiding at Area 51, many believe it is a place where truth is stranger than fiction.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/cWP3jdJ97aq1o2VVG0Bilk9Q1j5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-18","episode_number":5,"episode_type":"standard","id":977403,"name":"The Playboy Mansion","overview":"It is America's most infamous address, a place where fantasies come to life--and anything goes. But behind the security cameras and stonewalls of the Playboy Mansion are secrets. Go inside the stately residence to reveal the secret places, decadent gatherings, and special indulgences usually reserved for beautiful women and Hollywood's elite. How hard is it to get an invitation to the Playboy Mansion? How did Hugh Hefner transform the Mansion into a palace of pleasure? Who is the most notorious guest? What does it take to protect the Mansion for outside intruders? Home to one of the world's most private of public figures, the Playboy Mansion is a sanctum of secrets.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/zueVo9iZNYU6n45hn6oCGCMTMcC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-25","episode_number":6,"episode_type":"standard","id":977405,"name":"Presidential Transports","overview":"They are the most advanced and heavily protected vehicles ever built--operated by technicians prepared for the worst. But behind the bullet proof glass and armored plating of the President's fleet of vehicles are secrets. Travel by land, sea and air to explore the special construction, elite training and secret weapons that protect the President when he's on the move. Who's in charge of the President's safety on Air Force One and Marine One? Why is the Presidential Limo called \"the Beast\"--and who gets to drive it? What kind of defensive and offensive capabilities does the Presidential bus, known as Ground Force One, have? No matter what form of transport, moving the President safely requires the utmost secrecy. Secrets that have remained untold...until now.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/7qJjpeFTPvatX37ajtw4E5Fw0Y0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-10","episode_number":7,"episode_type":"standard","id":977406,"name":"The FBI","overview":"It is America's most powerful police force--made up of an elite team of Special Agents secretly patrolling the nation--and the world. While its patriotic mission is public knowledge, the FBI's tactics are classified. We'll go undercover to reveal the secret training, special operations and state-of-the-art tools used in today's 21st century crime fighting. How far can the FBI go to prevent crime and protect Americans? What are ghost agents, and how are they used for undercover surveillance? Who is the most notorious double agent? How has the internet changed the way the FBI works? While its global reach and sophisticated technology helps keep America safe, the FBI's greatest strength is its ability to keep its crime fighting tactics secret...until now.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/95GCE11ndtBnvjrSTZyxcsQ4eWS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-15","episode_number":8,"episode_type":"standard","id":977407,"name":"West Point","overview":"It is the most prestigious military academy in the world. A place where cutting-edge technology converges with battle-proven tradition. But inside this launch pad for the Army's elite are secrets. Go inside the 200-year-old university to uncover the complex selection process, secret rituals and traditions and special training that each cadet experiences at the renowned institution of military might. How hard is it to get into West Point? What is the Honor Code, and what happens if a cadet breaks it? Who are the most famous--and infamous academy alumni? What special training goes into making cadets military leaders for the 21st century? West Point is where presidents, world leaders, and the Army's bravest officers are taught, trained and entrusted with some of the nation's most important secrets. Secrets that few outside the academy know... until now.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/jZFyXbp6Nz5iTGiXDmlWEr8xxsw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self (archive footage)","credit_id":"639fb0db223e20007d3d33cf","order":502,"adult":false,"gender":2,"id":3836656,"known_for_department":"Acting","name":"Anastasio Somoza Debayle","original_name":"Anastasio Somoza Debayle","popularity":1.214,"profile_path":"/hNi0HnjvpqWZRSqXHD5ocVVi0SI.jpg"},{"character":"Self (archive footage)","credit_id":"63a93c2ce4b57600a05229db","order":503,"adult":false,"gender":2,"id":1566208,"known_for_department":"Acting","name":"George S. Patton","original_name":"George S. Patton","popularity":1.255,"profile_path":"/23ZdKmalhlv5KaIAscWvv8UuH84.jpg"}]},{"air_date":"2012-03-24","episode_number":9,"episode_type":"standard","id":977408,"name":"Black Ops","overview":"They are top-secret missions manned by specially trained intelligence and military elite. Covert operations using unconventional tactics outside the standard protocol. This episode uncovers the clandestine activities and state-of-the-art training of the U.S. Special Forces that undertake the most dangerous surveillance, reconnaissance, and intelligence collecting missions on Earth. What makes a mission a Black Operation or Black Op? Who approves a mission--and how much does the President know? What secret training prepares a soldier for these life and death assignments? How is the CIA involved in Black Ops? From cloak and dagger spy games to hand-to-hand combat, Black Ops are shrouded in secrecy...until now.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/jZFyXbp6Nz5iTGiXDmlWEr8xxsw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-31","episode_number":10,"episode_type":"standard","id":977409,"name":"The Pentagon","overview":"It is the epicenter of America's military operations... a five-sided fortress with a single purpose--to defend the United States and its citizens. But behind the concrete walls and re-enforced windows are secrets. Enter the headquarters of the U.S. Department of Defense and explore the complex operations and top-secret business conducted at the largest low-rise office building in the world. How did the Pentagon get its unusual shape? How many people work at the Pentagon? What covert intelligence gathering organizations operate within the military compound--and how are their secrets protected? What top-secret information was compromised from the attack on September 11th? How quickly did the building and its tenants get back to business as usual? For seven decades, the Pentagon has been an icon of American strength and military excellence. But more impressive than the building itself are the secrets held there...until now.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/qybSFT2aoUYCELORVPWgPylZ9dp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-07","episode_number":11,"episode_type":"finale","id":4598034,"name":"The Monuments","overview":"In America, behind the public facade of nine of our most famed institutions and landmark structures, there is another world that is hidden from view. The special pierces the veil of secrecy which conceals forbidden histories and fascinating insider information from the public. Go behind the walls of the Washington Monument to reveal a series of secret symbols and codes, one which was put there by one of the world's most mysterious societies. Dig deep into the dark past of Governor's Island and unearth another possible motive for the assassination of Abraham Lincoln. While in the heart of America, the Book of Secrets will uncover the shadowy past of the architect behind the St. Louis Gateway Arch and show how it relates to a theory that the Arch contains mystical powers which ultimately control the weather. Through exclusive channels of access and deep research, viewers will be taken behind the locked doors of seemingly familiar places, into worlds they weren't intended to see.","production_code":"","runtime":60,"season_number":1,"show_id":60744,"still_path":"/oOd4b0GhidQHnE9ekDSBdLM366j.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":60572,"poster_path":"/jIYKNJE1qwrs9KCvggddrtvZNRN.jpg","season_number":1,"vote_average":0},"2":{"_id":"53774ac7c3a3685554001609","air_date":"2013-04-05","episodes":[{"air_date":"2013-04-05","episode_number":1,"episode_type":"standard","id":977410,"name":"The Ancient Astronaut Cover-Up","overview":"The notion of a universe inhabited by alien creatures can be found just about everywhere in American popular culture. But could mankind really have been visited by alien beings from other worlds? And might the truth have been kept secret for centuries? Ancient Astronaut theorists Erich von Daniken and Giorgio Tsoukalos, along with Apollo 14 astronaut Edgar Mitchell, journalists, scientists and government officials explore the mainstream resistance to the idea that aliens have been visiting the Earth for centuries. Has the United States government conspired with other nations to hide the facts about mankind's extraterrestrial past? Could there really be a global cover-up of ancient alien activity? One that shields the public from a profound knowledge that, if revealed, could shatter the very fabric of our civilization?","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/9nhZscIYyKTnhxTOlsMCwDcvJp8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Himself (archive footage)","credit_id":"5ddbbdc14284ea0017f81dcd","order":500,"adult":false,"gender":2,"id":1120760,"known_for_department":"Acting","name":"Mahatma Gandhi","original_name":"Mahatma Gandhi","popularity":2.35,"profile_path":"/mxSTci7ynAOR6qYsEPIFX42LfBY.jpg"}]},{"air_date":"2013-04-12","episode_number":2,"episode_type":"standard","id":977411,"name":"The Mafia","overview":"For decades, the criminal organization known as \"The Mafia\" has stained the fabric of American society. But what are the secrets behind the Mob's sinister success? According to the FBI, the American Mafia still has approximately 3,000 active members, and just like the iconic mobsters of the past, the modern Mafia's ill-gotten gains still come at a price: blood, bullets, and a massive body count. Uncover the secret world of organized crime and the violent tactics used by the Cosa Nostra to gain money and power. How did the Mafia become so powerful? How is it possible that with hundreds of gang related killings in Chicago in the 1920s, not one gangster--including the most violent of all, Al Capone--was ever convicted of murder? Why was the Director of the FBI, J. Edgar Hoover, reluctant to go after the Mafia in the 1930s and 40s? Could the Mafia's influence extend beyond local police and politicians? And what new illegal activities is the Mafia involved in today?","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/wbTLo7kc2UMYmEw5O9hfQAedhRJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-19","episode_number":3,"episode_type":"standard","id":977412,"name":"The Ku Klux Klan","overview":"They are the original domestic terrorists, hiding underneath white hoods and flowing robes, and taking cover in the rights and freedoms that they are actively seeking to destroy. The Ku Klux Klan--although officially considered by the U.S. Government to be a racist organization--is not an illegal one. And while objectionable to most Americans, its philosophy of racial intolerance is protected as free speech under the First Amendment. But just how large, powerful, and dangerous is the Ku Klux Klan? This episode exposes the nearly 150 years of KKK history and the many attempts to discredit the Klan's demands for segregation and white supremacy. Johnny Lee Clary, once the Imperial Wizard of the White Knights of the Ku Klux Klan in Mississippi, shares inside knowledge of the Klan, including the secret handshakes, secret greetings, and the secret goals of the odern hate group.","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/eMJTdtyjvEdDuamIkvwa0YnXRcj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-26","episode_number":4,"episode_type":"standard","id":977413,"name":"Serial Killers","overview":"They are secretly stalking America's streets and highways, hiding in plain sight and compelled by one simple motive: the thrill of taking another person's life. Since the 1970s, the United States has produced an estimated 1,400 serial killers--more than double the combined total of the rest of the world. What causes a seemingly normal human being to engage in serial acts of murder? This episode uncovers the psychological, biological and sociological make-up of these dangerous murderers. Why do they kill? How can they be identified and stopped before they strike? Former FBI profiler Clint Van Zandt, criminal psychologists Eric Hickey and Helen Morrison, journalists, scientists and law enforcement experts reveal the secret motives of serial killers like \"BTK Killer\" Dennis Rader and Jeffrey Dahmer--and explain why Ted Bundy, Donald Harvey \"The Angel of Death\" an the \"Grim Sleeper\" Lonnie Franklin Jr. were able to evade capture for years while they amassed a shocking number of victims.","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/hsd7iYzFMmB50dZ8TU6vrG6YAWh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-03","episode_number":5,"episode_type":"standard","id":977414,"name":"American Nazis","overview":"The history of neo-Nazi groups in the United States is examined.","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/yL56ahK3YkWjhFSQWk6DAh6IYJV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-10","episode_number":6,"episode_type":"standard","id":977415,"name":"Deadly Cults","overview":"Uncovering the psychological allure of cults, their leaders and methods of controlling their members.","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/8R4CXGMooxaDW53YAHylJnXGv1O.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self (archive footage)","credit_id":"64ae473b66a0d3013a74bf90","order":505,"adult":false,"gender":2,"id":938951,"known_for_department":"Acting","name":"Jim Jones","original_name":"Jim Jones","popularity":0.676,"profile_path":"/qcgfqqRai5JvDHMna23iz88gfPG.jpg"},{"character":"Self (archive footage)","credit_id":"64ae474ce24b935b30a1f9bb","order":506,"adult":false,"gender":2,"id":3837361,"known_for_department":"Acting","name":"Leo J. Ryan","original_name":"Leo J. Ryan","popularity":0.972,"profile_path":"/sqAPuBpPBFhy8vTXrDIveFU4jz0.jpg"}]},{"air_date":"2013-05-17","episode_number":7,"episode_type":"standard","id":977416,"name":"Presidential Cover Ups","overview":"How much do we really know about what goes on behind the doors of the Oval Office?","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/A5pNkLtsavK0EWEGAolO41S9Rng.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-24","episode_number":8,"episode_type":"standard","id":977417,"name":"The Drug Wars","overview":"Uncovering the conspiracies behind America's 40-year drug campaign and why marijuana is classified as equally dangerous as heroin.","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/7nlOdHlbuYg2FBso8WCSv3Bm2Op.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-31","episode_number":9,"episode_type":"standard","id":977418,"name":"The Mystery of Bigfoot","overview":"Bigfoot is everywhere you look, but why are so many millions of Americans obsessed with this mysterious man-ape? This episode sheds new light on some of the nation's darkest Sasquatch secrets.","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/mwucaNwMOV6b8HvXzEBki15y4Fs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-07","episode_number":10,"episode_type":"standard","id":977419,"name":"Presidential Assassins","overview":"Over the last century there have been four successful presidential assassinations and a multitude of failed attempts. But do we know the real story behind these assassination plots?","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/pYfFJo6F98XZKz1fMpurasKDlfJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-14","episode_number":11,"episode_type":"standard","id":977420,"name":"Lost Treasures","overview":"American treasure hunters are convinced that there are missing fortunes scattered all around the country just waiting to be found.","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/9RrfW5cxicAp7UmRHOvG7AZi2QF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-21","episode_number":12,"episode_type":"finale","id":977421,"name":"Hells Angels","overview":"Chronicling the history of the Hells Angels Motorcycle Club.","production_code":"","runtime":60,"season_number":2,"show_id":60744,"still_path":"/mtXw54gJF0S1imT1KYhAVwiaPoH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self - Author, American Biker","credit_id":"62080e22c56d2d009ed573ad","order":501,"adult":false,"gender":2,"id":3423772,"known_for_department":"Acting","name":"Bill Hayes","original_name":"Bill Hayes","popularity":0.98,"profile_path":null}]}],"name":"Season 2","overview":"","id":60573,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"53774accc3a36855310015f6","air_date":"2014-03-29","episodes":[{"air_date":"2014-03-29","episode_number":1,"episode_type":"standard","id":977422,"name":"Scientology","overview":"It is one of the most secret organizations in America. A religion–based on the cosmic revelations of an inspired genius–that boasts more than 100,000 faithful followers throughout the world. We'll reveal the hidden origins, strict doctrine, secret language and celebrity allure of the wealthy and influential institution. Former Scientologists disclose the reasons they were drawn to the church–and why they left. Jenna Miscavige Hill, niece of Scientology's current leader, David Miscavige, describes her difficult experiences inside the organization. Former church executive, Mark Rathbun, demonstrates Scientology's most revered spiritual technology–the \"E-Meter.\" And watchdog Tony Ortega explains the appeal of Scientology that draws in new members. Find out why some consider Scientology a spiritual choice and others consider it a road to ruin.","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/rEIfuq6Z2md3JV05xgLwRxAGSJ7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-05","episode_number":2,"episode_type":"standard","id":977423,"name":"Big Brother","overview":"This episode uncovers the secret surveillance methods the government and big business use to watch, monitor and record our every move. Government whistleblowers, Thomas Drake and Jesselyn Radack, reveal how the NSA decided to aggressively monitor Americans' correspondence after 9/11. Documentarian Cullen Hoback explains how the government has partnered with Silicon Valley high-tech companies like Facebook and Yahoo to gather data on every American citizen. And former computer hacker Sammy Kamkar explains how someone could watch you from inside your own home. Buzzing drones overhead. Emails monitored and stored. Cell phone records tracked and analyzed. In today's digital age, is the concept of privacy now extinct? There are those who believe Big Brother is already here–and that the secret monitoring of American citizens has only just begun.","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/ehOaQzbt1Nbkwhb072GPMYrRgMV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-12","episode_number":3,"episode_type":"standard","id":977424,"name":"American Terrorists","overview":"Political dissidents… armed to kill. Sociopathic outsiders… harboring hatred. Religious zealots… plotting mass destruction. And all of them hiding in plain sight. But just who are these killers in our midst and is there any way to stop them? This episode delves into the world of terrorism on American soil and reveals how authorities are working to stop these radical groups. Deputy Chief of LAPD Counter Terrorism Michael Downing reveals terrorists recruiting tactics in American prisons. Former Sergeant of the Massachusetts State Police Sean Murphy recounts the manhunt for the Boston Marathon Bombers. And journalist Laura Sullivan describes how today's new terrorists may be as close as your next-door neighbor. With an estimated tens of thousands of terrorists operating in the United States, can Americans ever reclaim the peace and security that was once taken for granted? Is there any chance of winning the so-called \"war on terror?\"","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/riz7UHG50bXOPmwp7CCsCNBP32j.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-19","episode_number":4,"episode_type":"standard","id":977425,"name":"The Gold Conspiracy","overview":"Gold. It is one of the most precious metals in the world. A glittering commodity so rare that people will go to great lengths to obtain it. But who sets the price? And what are the secret methods to control its value?Uncover the clandestine world surrounding the highly prized precious metal. How much gold does the United States really have–and where is it locked away? Is the American government overstating the amount of gold in its reserves to create the mystique of financial superiority? Former U.S. Secretary of Labor Robert Reich discusses the gold standard and the possible manipulation of the commodities markets. Chairman of Euro Pacific Precious Metals Peter Schiff describes how gold could replace credit cards. And author Matthew Hart details how the U.S. is storing gold that belongs to other countries–but may now be missing from the Federal Reserve's vaults.","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/m4daGqcI5tidSHmTBPIPg1uAiha.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-26","episode_number":5,"episode_type":"standard","id":977426,"name":"America's Secret Army","overview":"They operate in the shadows… Men trained to kill… without leaving a trace. But who are these secret forces? What are their covert methods? And, can they be trusted to protect the interests of the American people? Delve into the clandestine operations of the United States most expertly trained secret weapons. But what exactly are these surreptitious services designed to do–and whom do these stealth-like soldiers ultimately report to? Are the strategies of these covert armies effective in keeping the United States one step ahead of its power hungry enemies? National Security Attorney Mark Zaid reveals details about the prestigious Delta Force unit that have remained a well-kept secret–until now. Former Attorney General John Ashcroft discusses the concept of asymmetrical warfare and how our government employs it today. And author Peter Singer describes the underground war being waged over the internet.","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/uFJZ0eh7ZkMtKaPk1GM7SosNAJP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-03","episode_number":6,"episode_type":"standard","id":977428,"name":"Secret Prisons","overview":"Go inside the maximum-security world of America's \"secret prisons\" and unveil their hidden agendas and covert operations. With about one in every one hundred and seven Americans serving time, why are there more people incarcerated in the United States than anywhere else in the world? Bob Hood, the former Warden at the United States Administrative Maximum Facility reveals what life is like for prisoners inside the gates of what is considered the most secure prison in America. Former inmate Andrew Stepanian reveals details of his lock-up at the Communication Management Unit, a prison that holds some of the country's greatest security threats. Director of the ACLU National Prison Project David Fathi describes the \"Kids for Cash\" scandal and the under-the-radar Debtors' Prisons. And former Warden Daniel Vasquez explains the big-business surrounding private prisons and FEMA Camps.","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/lcYbuRt01qDBFFpooU4gAi29Ltr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-10","episode_number":7,"episode_type":"standard","id":977427,"name":"The Billionaire Agenda","overview":"This episode reveals the underground world of America's wealthiest citizens and the depths at which their power and influence take root. Do billionaires think they know better than the majority? Are the American masses just objects to control? Forbes Editor Luisa Kroll talks about the growing wealth of the super-rich and the exclusive billionaire communities that are forming around them. Former United States Secretary of Labor Robert Reich divulges how billionaires' \"dark money\" influences American politics in ways that are off-limits to public scrutiny. And Author Mark Dice discusses the Bilderberg Group, the world's most secretive society of billionaires and the extreme measures they take to ensure that what happens behind closed doors stays behind closed doors.","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/1Ir7yZI9g6MPQCnvVtwFTPQcb19.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-17","episode_number":8,"episode_type":"standard","id":977429,"name":"Secret Underground","overview":"Americans may be aware of what's above ground, but do they know what's concealed beneath? And could subterranean facilities on U.S. soil house secrets so dangerous, our government would stop at nothing to keep them hidden? We examine the tunnels, cities, and fortresses covertly constructed beneath the feet of the American public. Author, Nick Redfern, reveals the secret government fortress used in times of crisis to house high-ranking officials. Former CIA contractor, John Lear, discusses secret underground rail systems connecting America's major military installations. U.S. Attorney for the Southern District of California Laura Duffy describes the Super Tunnel; the latest discovered passage in an advanced network of drug smuggling tunnels beneath the US and Mexican border. Author, Terry Kirkpatrick, discusses the possibility of terrorists teaming with drug cartels to use underground tunnels as a means to attack the United States.","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/xOj5pSwEbdQLO2UzjukhnJ3q46q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-24","episode_number":9,"episode_type":"standard","id":977430,"name":"The Secret Service","overview":"They are an elite force of brave men and women who put their lives on the line. Their mission: to guard the most powerful person in the world. But just who are these American heroes? And what secrets are they protecting? This episode goes inside one of the most top-secret law enforcement agencies in the United States.","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/21f060jMENhfVD5may9IWzrdCC9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-31","episode_number":10,"episode_type":"finale","id":977431,"name":"America's Doomsday Plan","overview":"An atomic attack... cyber warfare... a deadly airborne virus... the list of doomsday scenarios facing the United States has shaken the American psyche. But what is the government doing to protect the nation from ultimate disaster? This episode takes an in-depth look at the impending threats facing our world today. With the Doomsday Clock set to 5 minutes before midnight, is the end of the world looming just around the corner? And could our lack of preparation force us to make the ultimate choice: who will live and who will die? Survivalist Tim Ralston talks about the ...","production_code":"","runtime":60,"season_number":3,"show_id":60744,"still_path":"/dIxcahv8el06IxMVQGd3JzYBWnw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":60574,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"60f382abd35dea0045c8be4b","air_date":"2021-05-11","episodes":[{"air_date":"2021-05-11","episode_number":1,"episode_type":"standard","id":3079460,"name":"The Secret Space Program","overview":"On December 20, 2019, the newest branch of the armed services was established–Space Force. But nearly two decades earlier in 2002, a man named Gary McKinnon claimed he had discovered evidence that a secret military space program already existed… after hacking top-secret Pentagon and NASA computers. Does this suggest that the U.S. has a much greater presence in space than the public is aware? Could we even have occupied bases on the Moon and Mars?","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/AwaIKVGVRLqVgBBZHhD7yRZbWTb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-18","episode_number":2,"episode_type":"standard","id":3079461,"name":"Protecting the President","overview":"The United States has experienced four presidential assassinations, and two more assassination attempts nearly succeeded. But how many more occur that never reach the public? And how far do we go to protect the commander in chief?The United States has experienced four presidential assassinations, and two more assassination attempts nearly succeeded. But how many more occur that never reach the public? And how far do we go to protect the commander in chief?","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/bd9HTnZplsduIFCV9Dwddy8zCo5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-25","episode_number":3,"episode_type":"standard","id":3079462,"name":"The Freemason Factor","overview":"The Freemasons are rumored to be able to trace their roots back to the medieval warrior monks known as the Knights Templar, and it is an established fact that they were highly influential in the founding of the United States.","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/kMgojjPUzmpFcZGnjPwZ9NKqQw6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-08","episode_number":4,"episode_type":"standard","id":3079463,"name":"FBI vs MLK","overview":"In 1962, Martin Luther King Jr. criticised Hoover’s FBI for refusing to prosecute white supremacists who had burnt down black churches in Albany, Georgia; Hoover took King’s criticisms as a personal insult and he ordered the FBI to investigate King.","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/9eguzija6MiyqOt53wFcP643pcr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-15","episode_number":5,"episode_type":"standard","id":3079464,"name":"The Hunt for Hitler's Relics","overview":"Adolph Hitler was deeply into the occult and even established a Nazi organization called the Ahnenerbe, with a secret mission to track down and confiscate holy relics–a fact that inspired the blockbuster film, Raiders of the Lost Ark. It was rumored that he sought not only the Ark of the Covenant, but the Holy Grail, the omphalos from the Oracle of Delphi, the entrance to the mythical land of Shambhala, and an object known as “The Spear of Destiny”–the spear that was supposedly used by a Roman soldier to pierce Christ’s side during the crucifixion. Did Hitler actually come to possess some of these ancient relics?","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/6fWuNbQb9UfWpCMW5d24t4tQd1V.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Self (archive footage)","credit_id":"63a93c2ce4b57600a05229db","order":503,"adult":false,"gender":2,"id":1566208,"known_for_department":"Acting","name":"George S. Patton","original_name":"George S. Patton","popularity":1.176,"profile_path":"/23ZdKmalhlv5KaIAscWvv8UuH84.jpg"},{"character":"Self (archive footage)","credit_id":"63a93c57238513008a317d1c","order":504,"adult":false,"gender":2,"id":10279,"known_for_department":"Acting","name":"Adolf Hitler","original_name":"Adolf Hitler","popularity":14.487,"profile_path":"/n6f81IUSes1a8jTzUIF7rJ5zZnP.jpg"}]},{"air_date":"2021-06-22","episode_number":6,"episode_type":"standard","id":3079465,"name":"Inside Area 51","overview":"In 2013–after decades of secrecy, denials, and cover-ups–the CIA declassified documents that acknowledged the existence of a top-secret military research facility known as Area 51. But despite this disclosure, six years later in 2019, millions responded to an internet post advocating to storm the gates. Why does this Top-Secret location continue to draw so much attention–and suspicion? What really goes on within its heavily secured walls? Should we be reassured by its existence? Or fearful?","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/8Ws57GWm1DdIUXkZRkMhyb26les.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-06-29","episode_number":7,"episode_type":"standard","id":3079466,"name":"Doomsday Scenarios","overview":"A look at what plans the United States government has in place to deal with a major attack or catastrophic event, from the designated survivor to the Mount Weather Emergency Operations Centre and FEMA catastrophe protocols.","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/cjge4uprFDFpX0dXo8JmMUoLLAi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-06","episode_number":8,"episode_type":"standard","id":3079467,"name":"Mind Control","overview":"From Masonic symbols to concealed bases and hidden tunnels that exist right under one’s feet, many of America’s best kept secrets hide in plain sight.","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/kSSoTbcyOvHBADCgmAQLD9faLhQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-13","episode_number":9,"episode_type":"standard","id":3079468,"name":"Alien Disclosure","overview":"Are governments around the world preparing mankind for the most startling event in human history–the official disclosure of extraterrestrial contact? Or even an extraterrestrial presence on Earth right now? And if so, why is this happening now, what form might the announcement take, and what might happen in its aftermath?","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/hRnVGBFvjfCNxWhuOxwkL1XPLkc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-07-20","episode_number":10,"episode_type":"finale","id":3079469,"name":"Deadly Pandemics","overview":"In 2020, COVID 19 effectively shut down the entire world–and in the process, elevated pandemics to the most important issue across the globe. How do they start? Is it possible to contain them? And could COVID 19 be merely the precursor to something much worse?","production_code":"","runtime":60,"season_number":4,"show_id":60744,"still_path":"/wCv9Az3QkS0yaTxb4IdvSNh6ooy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":202673,"poster_path":null,"season_number":4,"vote_average":0}}}