{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[45],"first_air_date":"2012-12-31","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":60773,"in_production":false,"languages":["en","de"],"last_air_date":"2013-12-31","last_episode_to_air":{"id":984374,"name":"Falkland Islands: Penguin Paradise","overview":"Its bleak, battered, and windswept archipelago lies 460 kilometres from the South American mainland. Rugged mountains and an expansive pristine coastline make The Falklands an unspoiled destination for wildlife, notably for one of the world’s most iconic flightless birds, the beloved penguin. The Falklands’ sandy beaches and rolling meadows combine to make it one of the world’s premiere penguin sanctuaries. Over a million breed on the islands each summer. Pandemonium breaks out in a rockhopper penguin colony, sea lions ambush gentoo penguins in the surf, Skuar scavenge carcasses of Megellanic penguins that have washed ashore, and black-browed albatrosses perform their romantic courtship rituals.","vote_average":0,"vote_count":0,"air_date":"2013-12-31","episode_number":5,"episode_type":"finale","production_code":"","runtime":45,"season_number":2,"show_id":60773,"still_path":"/oSEL1FhbXqepyFlwHnWx8i0xM59.jpg"},"name":"Wildest Islands","next_episode_to_air":null,"networks":[{"id":64,"logo_path":"/tmttRFo2OiXQD0EHMxxlw8EzUuZ.png","name":"Discovery","origin_country":"US"}],"number_of_episodes":10,"number_of_seasons":2,"origin_country":["GB"],"original_language":"en","original_name":"Wildest Islands","overview":"Islands can be home to the most extreme examples of life and the some of the most dramatic landscapes. Natural selection fuels evolution in the most extraordinary way. Isolated for hundreds of thousands of years, pockets of individuals survive, thrive and adapt to fill all available niches fuelling a rapid development of new species. Wildest Islands, a stunning five-part series featuring the world’s most spectacular island locations. Dive into the crystal clear waters of the Caribbean; journey through the lush forests of Zanzibar; discover the unspoilt environs of the Hebrides; and uncover the enduring wonders of the Galapagos Islands as Wildest Islands investigates the rich history of these pristine paradises.","popularity":2.44,"poster_path":"/sNwKovHMR5pRI4MrPHDqgGEZC7r.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2012-12-31","episode_count":5,"id":60668,"name":"Season 1","overview":"","poster_path":"/qa48v71V9QWFLQ67OXAPtDrsoD0.jpg","season_number":1,"vote_average":0},{"air_date":"2013-12-31","episode_count":5,"id":60743,"name":"Season 2","overview":"","poster_path":"/qa48v71V9QWFLQ67OXAPtDrsoD0.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"},{"english_name":"German","iso_639_1":"de","name":"Deutsch"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":7.7,"vote_count":6,"season_data":{"1":{"_id":"537c719d0e0a262a8e0010ce","air_date":"2012-12-31","episodes":[{"air_date":"2012-12-31","episode_number":1,"episode_type":"standard","id":980010,"name":"Zanzibar: Land of Giants","overview":"Lying 40km off the east coast of Tanzania in Africa, the Zanzibar Archipelago has been labeled as the most exotic island chain in the world. Pristine sands and azure blue sea make it a much loved holiday destination, but bizarre creatures, many of enormous size also roam the islands. The world’s largest crab scales trees in search of coconuts, and clouds of giant bats fill the skies at dusk.","production_code":"","runtime":45,"season_number":1,"show_id":60773,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-31","episode_number":2,"episode_type":"standard","id":980050,"name":"Caribbean: The Wild Side of Paradise","overview":"Between the continents of North and South America is a tropical paradise: The Caribbean. This is an archipelago of over 7,000 islands and reefs, lying within the crystal clear waters of the Caribbean Sea. From just a few metres wide, to hundreds of kilometers across, every island is different, and each has its own unique wildlife. Under the cover of darkness, giant leatherback turtles visit Trinidad’s beaches to lay their eggs. Dominica’s volcanic heritage gives it fertile soils, making the island rich in flowering plants. These provide food for some of the Caribbean’s fastest movers: hummingbirds. The Caribbean’s coral reefs are one of its richest treasures. Many of the species that find shelter here are found nowhere else. These warm, calm waters provide sanctuary for ocean giants too. Humpback whales travel thousands of miles to raise their young in the Caribbean Sea.","production_code":"","runtime":45,"season_number":1,"show_id":60773,"still_path":"/yMxN6Fnn47v8GNXHuabkr3pdgy6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-31","episode_number":3,"episode_type":"standard","id":980051,"name":"Galapagos: Darwin's Eden","overview":"Situated 1000 kilometres west of Ecuador in South America, the Galapagos archipelago contains 13 main islands and a hundred or so smaller rocks and reefs. The region’s wilderness is so pristine and rich in life it altered our entire view of the natural world. Gigantic tortoises, sea-swimming lizards and cormorants that have evolved to no longer fly, are just some of the bizarre and unique creatures found here.\n\nHuman influence has been so limited across the islands it allowed one man, Charles Darwin, to study and rethink the laws of Nature.","production_code":"","runtime":45,"season_number":1,"show_id":60773,"still_path":"/wEOhsQwHYi34okiB5J0z8dJPhyt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-31","episode_number":4,"episode_type":"standard","id":980052,"name":"Sri Lanka: Monsoon Island","overview":"This film uncovers how all life on Sri Lanka centres on one precious resource: water. Unusually, two different monsoons visit the island each year, drenching the windswept coastal plains with weeks of torrential rain. For the rest of the year, the animals of the plains must endure months of drought. Elephants numbering in their hundreds gather on the shores of a vast lake in search of water. Bold Sri Lankan leopards stalk spotted deer visiting waterholes. Mugger crocodiles, confined within small pools, choose the dry season to mate. Bee-eaters dig nesting tunnels in the dusty ground, and troops of toque macaques battle for status and hierarchy in the island’s ancient Buddhist monuments.","production_code":"","runtime":45,"season_number":1,"show_id":60773,"still_path":"/8Hz5RVf0scF2LkaJiHb0prGYOib.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-31","episode_number":5,"episode_type":"finale","id":980053,"name":"Hebrides: Land of Legends","overview":"Lying just off the coast of West Scotland, the Hebrides archipelago is made up of more than 500 islands and islets. Over 35,000 Grey seals choose one small beach to give birth and do battle for breeding rights. On other isles, some of the world’s largest gatherings of sea birds engulf precipitous cliffs in a bid to raise their young. On the Isle of Rum, Britain’s largest land mammal, the red deer, prepares for the annual rut, while Golden eagles patrol the skies anticipating their next meal. For thousands of years, people have battled with the Hebridean elements – the most treacherous on the planet and the roar from the world’s third largest whirlpool can be heard up to 16 kilometres away","production_code":"","runtime":45,"season_number":1,"show_id":60773,"still_path":"/pDqOzPaYYXZuBiJlkTIm2YaIDsh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":60668,"poster_path":"/qa48v71V9QWFLQ67OXAPtDrsoD0.jpg","season_number":1,"vote_average":0},"2":{"_id":"53812dacc3a368737d001147","air_date":"2013-12-31","episodes":[{"air_date":"2013-12-31","episode_number":1,"episode_type":"standard","id":984369,"name":"Japan: Island of Extremes","overview":"Explore the unique array of Asian and Arctic species that inhabit Japan, an expansive chain of 6,852 islands stretching over 2,400 kilometers and covering a range of wildly diverse climatic zones including snow-covered mountains and steamy mangroves. This is home to wildlife not found anywhere else on Earth, including some of the planet’s hardiest species. Winter in Japan’s central and northern islands can be savage. In bleak, inhospitable conditions in Honshu, snow monkeys or Japanese macaques endure the bitter cold of Hell’s Valley by basking in warm volcanic pools.","production_code":"","runtime":45,"season_number":2,"show_id":60773,"still_path":"/2QXLSpk6WUrm9dlfW7uD8kmUdh5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-31","episode_number":2,"episode_type":"standard","id":984370,"name":"Amazon River Islands: The Floating Forests","overview":"Learn about the amazing creatures that inhabit the thousands of isolated jungle islands spread along the Rio Negro and the Amazon River, the world’s largest freshwater archipelago. Stranded on the mighty Rio Negro, these islands are engulfed by seasonal floods changing their landscapes completely, so everything here is forced to adapt or die. At the heart lie the Anavilhanas and Mariua archipelagos surrounded by flooded forests and hidden dangers.","production_code":"","runtime":45,"season_number":2,"show_id":60773,"still_path":"/ppMNzUn357CIDzdBtNGgQHv57Ey.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-31","episode_number":3,"episode_type":"standard","id":984371,"name":"Vancouver Island: Rivers of Life","overview":"Over in British Columbia, Canada, lies Vancouver Island, a vast and wild island with a backbone of jagged mountains running its length. The largest island off the west coast of North America, its glaciers fuel the flow of some of Canada’s tallest waterfalls and an endless network of rivers and creeks make it the ideal habitat for the Pacific salmon. Turkey vultures gather for the migration south as they head for warmer weather in winter.","production_code":"","runtime":45,"season_number":2,"show_id":60773,"still_path":"/hPUXxSIWZQRRW2vJzBUqQOgVRu8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-31","episode_number":4,"episode_type":"standard","id":984373,"name":"Philipines: Islands of Mystery","overview":"The Philippine archipelago is made up of over 7,000 tropical islands and is a breeding ground for many rare animals. On the stunning island of Palawan, where craggy limestone cliffs poke out from the dense jungle, giant bugs roam the land. Predators line the edge of the forests, while rivers help carve one of the world’s most extensive cave systems, a subterranean cavernous world crowded with bats, whip scorpions, tarantulas, and other insects. This is the home of the mysterious bearcat, an animal that looks like a cross between a bear and a cat though related to neither and is as agile in the trees as a monkey.","production_code":"","runtime":45,"season_number":2,"show_id":60773,"still_path":"/2DBwXbgMRxMALNdtIicPQWUlKoA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-31","episode_number":5,"episode_type":"finale","id":984374,"name":"Falkland Islands: Penguin Paradise","overview":"Its bleak, battered, and windswept archipelago lies 460 kilometres from the South American mainland. Rugged mountains and an expansive pristine coastline make The Falklands an unspoiled destination for wildlife, notably for one of the world’s most iconic flightless birds, the beloved penguin. The Falklands’ sandy beaches and rolling meadows combine to make it one of the world’s premiere penguin sanctuaries. Over a million breed on the islands each summer. Pandemonium breaks out in a rockhopper penguin colony, sea lions ambush gentoo penguins in the surf, Skuar scavenge carcasses of Megellanic penguins that have washed ashore, and black-browed albatrosses perform their romantic courtship rituals.","production_code":"","runtime":45,"season_number":2,"show_id":60773,"still_path":"/oSEL1FhbXqepyFlwHnWx8i0xM59.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":60743,"poster_path":"/qa48v71V9QWFLQ67OXAPtDrsoD0.jpg","season_number":2,"vote_average":0}}}