{"adult":false,"backdrop_path":"/w0M9PlxxRK4uyOh96r6ZpzqBKgL.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2012-02-27","genres":[{"id":99,"name":"Documentary"},{"id":36,"name":"History"}],"homepage":"http://www.bbc.co.uk/programmes/p00p1388","id":61010,"in_production":false,"languages":["en"],"last_air_date":"2012-03-26","last_episode_to_air":{"id":995058,"name":"Doing Good","overview":"In the final part of his personal account of Britain's empire, Jeremy Paxman tells the extraordinary story of how a desire for conquest became a mission to improve the rest of mankind, especially in Africa, and how that mission shaded into an unquestioning belief that Britain could - and should - rule the world.\n\nIn Central Africa, he travels in the footsteps of David Livingstone who, though a failure as a missionary, became a legendary figure - the patron saint of empire who started a flood of missionaries to the so-called 'Dark Continent'.\n\nIn South Africa, Paxman tells the story of Cecil Rhodes, a man with a different sort of mission, who believed in the white man's right to rule the world, laying down the foundations for apartheid.\n\nThe journey ends in Kenya, where conflict between white settlers and the African population brought bloodshed, torture and eventual withdrawal.","vote_average":0,"vote_count":0,"air_date":"2012-03-26","episode_number":5,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":61010,"still_path":null},"name":"Empire","next_episode_to_air":null,"networks":[{"id":4,"logo_path":"/mVn7xESaTNmjBUyUtGNvDQd3CT1.png","name":"BBC One","origin_country":"GB"}],"number_of_episodes":5,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Empire","overview":"Empire is a major five-part series presented by Jeremy Paxman. It tells the story of the British Empire in a new way, tracing not only the rise and fall of the empire but also the complex effects of the empire on the modern world – political, technological and social – and on Britain.","popularity":1.07,"poster_path":"/z6iM7IUunGMm6x0F2aRNHOPZxYy.jpg","production_companies":[{"id":3324,"logo_path":"/dqT3yOTlfJRmtvk52Ccd1O6dZ0A.png","name":"BBC","origin_country":"GB"}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"}],"seasons":[{"air_date":"2012-02-27","episode_count":5,"id":61724,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":5.8,"vote_count":4,"season_data":{"1":{"_id":"53c0075d0e0a26158200709b","air_date":"2012-02-27","episodes":[{"air_date":"2012-02-27","episode_number":1,"episode_type":"standard","id":995054,"name":"A Taste for Power","overview":"Jeremy Paxman traces the story of the greatest empire the world has ever known: the British Empire.\r\n\r\nIn the first programme, he asks how such a small country got such a big head, and how a tiny island in the North Atlantic came to rule over a quarter of the world's population. He travels to India, where local soldiers and local maharajahs helped a handful of British traders to take over vast areas of land. Spectacular displays of imperial power dazzled subject peoples and developed a cult of Queen Victoria as Empress, mother and virtual God.\r\n\r\nIn Egypt, Jeremy explores the bit of Empire that never was, as Britain's temporary peace-keeping visit turned into a seventy year occupation. He travels to the desert where Lawrence of Arabia brought a touch of romance to the grim struggle of the First World War. As Britain came to believe it could solve the world's problems, he tells the story of the triumphant conquest of Palestine by Imperial troops - and Britain's role in a conflict that haunts the Middle East to this day.","production_code":"","runtime":60,"season_number":1,"show_id":61010,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-05","episode_number":2,"episode_type":"standard","id":995055,"name":"Making Ourselves at Home","overview":"Jeremy Paxman traces the story of the greatest empire the world has ever known: the British Empire. He continues his personal account of Britain's empire by looking at how traders, conquerors and settlers spread the British way of doing things around the world - in particular how they created a very British idea of home.\n\nHe begins in India, where early traders wore Indian costume and took Indian wives. Their descendants still cherish their mixed heritage. Victorian values put a stop to that as inter racial mixing became taboo.\n\nIn Singapore he visits a club where British colonials gathered together, in Canada he finds a town whose inhabitants are still fiercely proud of the traditions of their Scottish ancestors, in Kenya he meets the descendants of the first white settlers - men whose presence came to be bitterly resented as pressure for African independence grew.\n\nAnd he traces the story of an Indian family in Leicester whose migrations have been determined by the changing fortunes of the British empire.","production_code":"","runtime":60,"season_number":1,"show_id":61010,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-12","episode_number":3,"episode_type":"standard","id":995056,"name":"Playing The Game","overview":"Jeremy Paxman traces the story of the greatest empire the world has ever known: the British Empire. He continues his personal account of Britain's Empire by tracing the growth of a peculiarly British type of hero - adventurer, gentleman, amateur, sportsman and decent chap - and a peculiarly British type of obsession - sport, the empire at play.\n\nHe travels to East Africa in the footsteps of Victorian explorers in search of the source of the Nile; to Khartoum in Sudan to tell the story of General Gordon - a half-crazed visionary who 'played the game' to the hilt; to Hong Kong where the British indulged their passion for horse racing by building a spectacular race course; and to Jamaica where the greatest imperial game of all - cricket - became a battleground for racial equality.","production_code":"","runtime":60,"season_number":1,"show_id":61010,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-19","episode_number":4,"episode_type":"standard","id":995057,"name":"Making a Fortune","overview":"Jeremy Paxman continues his personal account of Britain's empire, looking at how the empire began as a pirates' treasure hunt, grew into an informal empire based on trade and developed into a global financial network. He travels from Jamaica, where sugar made plantation owners rich on the backs of African slaves, to Calcutta, where British traders became the new princes of India.\n\nJeremy then heads to Hong Kong, where British-supplied opium threatened to turn the Chinese into a nation of drug addicts - leading to the brutal opium wars, in which Britain triumphed and took the island of Hong Kong as booty.\n\nUnfair trading helped spark the independence movement in India, led by Mahatma Gandhi; in a former cotton spinning town in Lancashire, Jeremy meets two women who remember Gandhi's extraordinary visit in 1931.","production_code":"","runtime":60,"season_number":1,"show_id":61010,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-26","episode_number":5,"episode_type":"finale","id":995058,"name":"Doing Good","overview":"In the final part of his personal account of Britain's empire, Jeremy Paxman tells the extraordinary story of how a desire for conquest became a mission to improve the rest of mankind, especially in Africa, and how that mission shaded into an unquestioning belief that Britain could - and should - rule the world.\n\nIn Central Africa, he travels in the footsteps of David Livingstone who, though a failure as a missionary, became a legendary figure - the patron saint of empire who started a flood of missionaries to the so-called 'Dark Continent'.\n\nIn South Africa, Paxman tells the story of Cecil Rhodes, a man with a different sort of mission, who believed in the white man's right to rule the world, laying down the foundations for apartheid.\n\nThe journey ends in Kenya, where conflict between white settlers and the African population brought bloodshed, torture and eventual withdrawal.","production_code":"","runtime":60,"season_number":1,"show_id":61010,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":61724,"poster_path":null,"season_number":1,"vote_average":0}}}