{"adult":false,"backdrop_path":"/o5Q4zrU6KQwuJipkk5uYFgn763e.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"2014-08-08","genres":[{"id":10764,"name":"Reality"},{"id":99,"name":"Documentary"}],"homepage":"http://www.bbc.co.uk/programmes/b04dclt3","id":61162,"in_production":false,"languages":["en"],"last_air_date":"2016-10-28","last_episode_to_air":{"id":1391001,"name":"Episode 10","overview":"Going into the final, just three bakers remained, one of whom would be crowned the winner of 2016. Jo Brand is joined in studio Mary Berry to get her take on the nerve-wracking final bakes and why she and Paul chose their eventual champion. Jo interviews the year's winner as well as the two runners-up, and she is also joined by the rest of the year's bakers.","vote_average":0,"vote_count":0,"air_date":"2016-10-28","episode_number":10,"episode_type":"finale","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null},"name":"The Great British Bake Off: An Extra Slice","next_episode_to_air":null,"networks":[{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":30,"number_of_seasons":3,"origin_country":["GB"],"original_language":"en","original_name":"The Great British Bake Off: An Extra Slice","overview":"Jo Brand is joined by three different celebrity Bake Off fans to shine a spotlight on the good, the bad and the soggy bottomed from the most recent episode.","popularity":6.993,"poster_path":"/weIEmbrT2KrXeohm5Evs05lpjhN.jpg","production_companies":[{"id":52031,"logo_path":"/xXI1jqyY4QDrckA0QGiYnZye790.png","name":"Love Productions","origin_country":"GB"}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"}],"seasons":[{"air_date":"2014-08-08","episode_count":10,"id":62197,"name":"Series 1","overview":"Series One of the Great British Bake Off: An Extra Slice was hosted by Jo Brand, airing every Friday during the main show's fifth series from 8 August 2014.","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2015-08-07","episode_count":10,"id":95041,"name":"Series 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2016-08-26","episode_count":10,"id":79549,"name":"Series 3","overview":"","poster_path":null,"season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Reality","vote_average":5.2,"vote_count":4,"season_data":{"1":{"_id":"53e3880dc3a368484700214c","air_date":"2014-08-08","episodes":[{"air_date":"2014-08-08","episode_number":1,"episode_type":"standard","id":1003381,"name":"Episode 1","overview":"Kicking off the series, Jo and her panel of Bake Off fans will discuss the 12 new bakers and their bakes. The theme this week is cakes. What do the panel think of the bakers' Swiss roll? And how did they fare with their first ever technical challenge - Mary Berry's cherry cake? Whose 36 miniature cakes stopped the show? Plus lots of 'exclusive' footage from the tent.","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-15","episode_number":2,"episode_type":"standard","id":1003382,"name":"Episode 2","overview":"It's biscuit week in the tent, which means it's biscuit week in the An Extra Slice studio, where the studio audience will be challenged to bring in home-baked biscuits and viewers will be invited to share photos of their efforts too - the good, the bad and the downright disastrous.\n\nJo and her panel of Bake Off fans discuss the 11 bakers and their biscuit bakes. What do the panel think of the bakers' savoury biscuits? How did they fare with technical challenge number two - Mary Berry's florentines? And whose 3D biscuit scene stood out?","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":"/hp3PTjXHqfbwpaWvhE76m5DBo8I.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-22","episode_number":3,"episode_type":"standard","id":1005354,"name":"Episode 3","overview":"It's bread week in the tent, which means it's bread week in the An Extra Slice studio, where the studio audience are challenged to bring in home baked bread and viewers are invited to share photos of their efforts too - the good, the bad and the down-right disastrous.\n\nJo and her panel of Bake Off fans discuss the ten bakers and the bread they've baked. What do the panel think of the bakers' rye rolls? How did they fare with technical challenge number three - ciabatta? And whose filled centre-piece loaf stood out?\n\nPlus, there's another weekly serving of 'exclusive' footage from the tent.","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":"/nBbkQgVnzsHlRY4G068SlQh24c2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-08-29","episode_number":4,"episode_type":"standard","id":1005355,"name":"Episode 4","overview":"Jo Brand and three celebrity Bake Off fans highlight the week's dramatic events in the tent, with chat, unseen footage from the BBC One show and an interview with the week's eliminated baker.\n\nIt's dessert week in the tent, so it's dessert week in the studio. Jo and her panel of Bake Off fans discuss the nine remaining bakers and the puddings they've baked. What do the panel think of the bakers' self-saucing puds? How did the bakers do in technical challenge number four - Mary Berry's tiramisu cake? And what will they say about the most dramatic show-stopper ever - baked alaska?\n\nPlus, there's another weekly serving of 'exclusive' footage from the tent.","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-05","episode_number":5,"episode_type":"standard","id":1005356,"name":"Episode 5","overview":"The panel discuss the remaining Bake Off bakers and the pies and tarts they have baked. What do the panel think of the bakers' custard tarts? How did the bakers do in this week's technical challenge - Paul Hollywood's mini pear pies? And what will they say about the three-tier pies in the showstopper?\n\nThere is also another weekly serving of 'exclusive' footage from the tent.","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-12","episode_number":6,"episode_type":"standard","id":1008536,"name":"Episode 6","overview":"It is European cake week in the tent, so Jo and her panel of fans celebrate them by tasting audience bakes and looking at viewer photos of bakes from home - the triumphs and the tragedies. What do the panel think of the bakers' yeast-leavened cakes in the week's signature bake? How well do they think the bakers coped making a cake most had never heard of, a princess tarta? And what will they say about the challenging show-stopper bake - a two-tier dobos torte?\n\nThe Great British Bake Off: An Extra Slice - perfect if you simply can't resist a second helping.","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-19","episode_number":7,"episode_type":"standard","id":1010194,"name":"An Extra Slice of... Pastry","overview":"It is pastries week in the tent, which means Jo Brand and her panel of Bake Off fans are celebrating anything and everything to do with pastry. In the studio, the panel looks at bakes brought in by the audience and viewer photos of their bakes from home - the delectable and the downright disastrous.  Jo is joined by comedian Josh Widdicombe, broadcaster Danny Baker and series 4's victim of custard theft, Howard Middleton.\n\nWhat do the panel think of the Bake Off bakers' savoury pastry parcels in this week's signature bake? How well do they think the bakers coped in the technical test of making kouign amann? And what will they say about the challenging show-stopper - eclairs?","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":"/7e9Ji98w9ilnM1pPJUghXAInGi5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-26","episode_number":8,"episode_type":"standard","id":1010132,"name":"Episode 8","overview":"Advanced Dough","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-01","episode_number":9,"episode_type":"standard","id":1010133,"name":"Episode 9","overview":"Semi-final - Patisserie","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-10-08","episode_number":10,"episode_type":"finale","id":1010195,"name":"An Extra Slide of... The Final","overview":"It is the final week in the Bake Off tent and just three bakers remain. Who will be crowned this year's winner?  Jo Brand hosts and is joined in the studio by Paul Hollywood and Mary Berry to get their take on the nail-biting final bakes and how and why they chose their eventual winner. Jo interviews this year's champion, the two runners-up and is joined by all of this year's bakers.  Plus, there's lots of unseen footage from the BBC One show and a look at the best and worst viewer and audience bakes too.\n\nWith everything to play for, the final three bakers face a signature bake to create 24 viennoiserie; a technical that leaves the bakers nowhere to hide - scones, tartes aux citron and victoria sandwiches; and a final showstopper of a piece montee.","production_code":"","runtime":30,"season_number":1,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 1","overview":"Series One of the Great British Bake Off: An Extra Slice was hosted by Jo Brand, airing every Friday during the main show's fifth series from 8 August 2014.","id":62197,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5a046b11c3a3680f94012afb","air_date":"2015-08-07","episodes":[{"air_date":"2015-08-07","episode_number":1,"episode_type":"standard","id":1391250,"name":"An Extra Slice of... Madeira Cake","overview":"Kicking off the series, Jo and her panel of Bake Off fans will give us their take on the 12 brand new bakers and their attempts in cake week. Will they go mad for the bakers' madeira cake? How do they think the dozen coped with their first ever technical bake - Mary's frosted walnut cake? Whose black forest gateau show-stopper stopped the show?","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-14","episode_number":2,"episode_type":"standard","id":1391251,"name":"An Extra Slice of... Biscotti","overview":"It's biscuit week, so Jo and her guests celebrate all sorts of biscuits in the An Extra Slice studio, tasting audience attempts at cookies and crackers and looking at viewer photos of their bakes from home - the good, the bad and the downright disastrous. Jo and her panel of Bake Off fans give their take on the remaining 11 bakers and their attempts at biscuits. What do the panel think of the bakers' signature biscotti? How do they think the bakers coped with technical challenge number two - Paul Hollywood's arlettes? And which baker's biscuit box most impressed in the showstopper?","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-21","episode_number":3,"episode_type":"standard","id":1391252,"name":"An Extra Slice of... Quick Breads","overview":"It's bread week, so Jo and her guests will be casting their eye over the home-baked breads brought in by the studio audience, as well as looking at viewer photos of their home baking efforts too, be they triumphs or heroic fails. What will the panel make of the bakers' signature quick breads? Whose baguettes were bang-on in the technical challenge? And whose showstopping bread sculpture stood out?","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-28","episode_number":4,"episode_type":"standard","id":1391253,"name":"An Extra Slice of... Crème Brûlée","overview":"It's desserts week, so Jo and her guests will discuss the remaining nine bakers and their efforts. Whose signature creme brulees had the panel drooling? What did they make of the Spanish windtorte in the technical? Had they even heard of it? And whose tiered baked cheesecake show-stopper impressed them the most? Plus Jo and the panel will be tasting bakes brought in by the studio audience and looking at photos of your creations from home - from perfect puds to disastrous desserts.","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-04","episode_number":5,"episode_type":"standard","id":1391254,"name":"An Extra Slice of... Sugar-Free Cakes","overview":"Host Jo Brand is joined in the An Extra Slice studio by three celebrity guests giving their take on this week's Bake Off shenanigans. Along with chat and unseen footage from the BBC One show, there is an interview with the latest baker to leave the tent. Jo and her guests also taste bakes brought in by the audience, be they gluten-free, sugar-free or possibly even flavour-free. They also look at photos of viewer bakes from home - the good, the bad and the downright catastrophic. What will the panel think of the bakers' attempts at sugar-free cakes in the tent? Who do they think pulled off the best gluten-free pitta breads? And whose dairy-free ice cream roll had them salivating in the showstopper?","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-11","episode_number":6,"episode_type":"standard","id":1391255,"name":"An Extra Slice of... Frangipane Tarts","overview":"Joining host Jo Brand in the An Extra Slice studio will be three celebrity fans, all eager to chew over the latest goings on in the tent. There will be unseen footage from the BBC One show, chat about the latest baking shenanigans and an interview with the latest baker to leave. Jo and her guests will celebrate pastry in the An Extra Slice studio, tasting audience bakes and looking at viewer photos of their home bakes - from tantalising tarts to pitiful pastries. They will also be putting the remaining bakers and their bakes under the microscope. Whose frangipane tart was a work of art in this week's signature? What will the panel think of the flaounas in the technical, and have they even heard of them? And whose vol-au-vents will impress in the showstopper?","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-18","episode_number":7,"episode_type":"standard","id":1391256,"name":"An Extra Slice of... The Victorian Era","overview":"Joining host Jo Brand in the An Extra Slice studio will be three celebrity Bake Off fans eager to chew over the latest goings on in the tent. Jo and her guests will debate which bakers were victorious in Victorian Week. They will be tasting bakes brought in by the studio audience and looking at pictures of viewer bakes from home - from the incredible to the frankly inedible. There will be an interview with the latest baker to leave the tent, as well as unseen footage from the BBC One show. Jo will get the panel's take on the remaining bakers and their Victorian bakes. Who rose to the occasion in the raised game pie signature bake? Which baker served up a faultless tennis cake in the technical? And what will the panel make of this week's charlotte russe showstopper?","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-25","episode_number":8,"episode_type":"standard","id":1391257,"name":"An Extra Slice of... Patisserie","overview":"Sarah Millican stands in for Jo Brand on An Extra Slice and is joined by Gregg Wallace, Joe Lycett and pastry chef Cherish Finden to dissect this week's events in the tent, with unseen footage from the BBC One show and an interview with the latest baker to leave. They also taste bakes brought in by the studio audience and look at viewer photos of their bakes from home - the delicacies and the calamities. How do the panel think the bakers coped with cream horns in the signature? What did they make of the mokatines technical? Had the panel even heard of the showstopper - religieuse a l'ancienne? And which of the bakers do our panel think will make it through to the end?","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-02","episode_number":9,"episode_type":"standard","id":1391258,"name":"An Extra Slice of... Chocolate Tarte","overview":"Jo Brand is joined by three celebrity Bake Off fans to dissect the penultimate week in the tent, when the bakers tackled chocolate. As well as unseen footage from the BBC One show, Jo and the panel will taste bakes brought in by the studio audience and look at photos of bakes from viewers at home - the stonkers and the stinkers. Jo will interview the last baker to leave before the final. What will the panel think of the bakers' signature chocolate tarts? Who rose to the chocolate souffle technical? Whose show-stopping 3D chocolate centrepiece was the centre of attention? And which baker will the panel tip to be crowned the Great British Bake Off Champion 2015?","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-09","episode_number":10,"episode_type":"finale","id":1391259,"name":"An Extra Slice of... The Final","overview":"It is the final week in the Bake Off tent and just three bakers remain. Who will be crowned this year's winner? Jo Brand hosts An Extra Slice and is joined in studio by Paul Hollywood and Mary Berry to get their take on the nerve-wracking final bakes and how and why they chose their eventual winner. Jo will interview the champion, the two runners-up and will be joined by all of this year's bakers. Plus there's lots of unseen footage from the BBC One show and a look at the best and worst viewer and audience bakes too. With everything to play for, the final three face their last ever signature to create filled iced buns, a final nail-biting technical and a classic British cake in the show-stopper - whose bakes will be deemed worthy of a champion? The Great British Bake Off: An Extra Slice - your final helping of the year.","production_code":"","runtime":30,"season_number":2,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 2","overview":"","id":95041,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"57c04534c3a3684ce700343c","air_date":"2016-08-26","episodes":[{"air_date":"2016-08-26","episode_number":1,"episode_type":"standard","id":1217299,"name":"Episode 1","overview":"The Great British Bake Off is back and joined by An Extra Slice on BBC Two. Each week, host Jo Brand chats to a panel of celebrity Bake Off fans, looking at all the shenanigans in the tent. Jo shines a spotlight on the best, the worst and the 'must try harder next time' bakes from the latest episode, with chat, exclusive footage from the BBC One show and an interview with the baker who left the tent that week. The studio audience of Bake Off fans are challenged to bring a bake from home and reveal their efforts on the show, and viewers are invited to share photos of their efforts too - the delightful, the delicious and the downright disastrous. Kicking off the series, Jo and her panel of Bake Off fans give us their take on the 12 brand new bakers and their attempts in cake week. An Extra Slice - when one helping of Bake Off just isn't enough.","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-02","episode_number":2,"episode_type":"standard","id":1221370,"name":"Episode 2","overview":"It is week two in The Great British Bake Off tent and sister show An Extra Slice returns to serve up more Bake Off magic on BBC Two. This week, Jo Brand is joined by comedian Josh Widdicombe and chef Rosemary Shrager to dissect the latest goings-on, with unseen footage from the BBC One show and an interview with the latest baker to leave the tent. It is biscuit week, so Jo and her guests celebrate all sorts of biscuits in the An Extra Slice studio, tasting audience attempts at gingerbread and garibaldis and looking at viewer photos of their bakes from home - the good, the bad and the downright disastrous. What does Jo's panel make of the remaining 11 bakers and their attempts at decorated biscuits? Mary Berry's challenging technical? And which baker's 3D biscuit creation most impressed in the show-stopper? An Extra Slice - when one helping of Bake Off just isn't enough.","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-09","episode_number":3,"episode_type":"standard","id":1221371,"name":"Episode 3","overview":"It is bread week, so Jo and her guests cast their eyes over the baked bread brought in by the studio audience, and look at viewer photos of their bakes from home, be they triumphs or heroic fails.","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-16","episode_number":4,"episode_type":"standard","id":1390996,"name":"Episode 4","overview":"It is batter week in the tent, so Jo and her guests discuss the remaining nine bakers and their sweet and savoury creations, as well as tasting the bakes brought in by the studio audience. Plus, they look at viewers' photos of their attempts from home - the good, the bad and the downright ugly.","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-23","episode_number":5,"episode_type":"standard","id":1225627,"name":"Episode 5","overview":"It is week five in the Bake Off tent and just eight bakers remain to tackle pastry week.","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-30","episode_number":6,"episode_type":"standard","id":1390997,"name":"Episode 6","overview":"It is week six in the Great British Bake Off tent and just seven bakers remain to tackle a Bake Off first - botanical week. Joining host Jo Brand in the An Extra Slice studio are three celebrity fans including Danny Baker, all eager to chew over the latest goings on in the tent.","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-07","episode_number":7,"episode_type":"standard","id":1390998,"name":"Episode 7","overview":"It is dessert week in the Great British Bake Off tent and just six bakers remain. Joining host Jo Brand in the An Extra Slice studio are three celebrity Bake Off fans - double Olympic silver medalist Rebecca James, Crème de la Crème judge Cherish Finden and comedian Chris Addison.","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-14","episode_number":8,"episode_type":"standard","id":1390999,"name":"Episode 8","overview":"What will the panel think about the classic Tudor signature bake, a savoury stuffed pie? Which baker's traditional biscuit stood out in the technical? And whose showstopper was deemed fit for a king?","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-21","episode_number":9,"episode_type":"standard","id":1391000,"name":"Episode 9","overview":"What do the panel think of the bakers' signature French pastry? Who do they think rose to Paul's yeast-based fruit and chocolate cake in the technical? Whose showstopping mini cake bake won the day? And which baker will the panel tip to be crowned the Great British Bake Off Champion 2016?","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-28","episode_number":10,"episode_type":"finale","id":1391001,"name":"Episode 10","overview":"Going into the final, just three bakers remained, one of whom would be crowned the winner of 2016. Jo Brand is joined in studio Mary Berry to get her take on the nerve-wracking final bakes and why she and Paul chose their eventual champion. Jo interviews the year's winner as well as the two runners-up, and she is also joined by the rest of the year's bakers.","production_code":"","runtime":30,"season_number":3,"show_id":61162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 3","overview":"","id":79549,"poster_path":null,"season_number":3,"vote_average":0}}}