{
    "adult": false,
    "backdrop_path": "/mAOXMv0oIC43oz3qhEguzV6IO6a.jpg",
    "created_by": [],
    "episode_run_time": [
        60
    ],
    "first_air_date": "2013-12-09",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "http://www.bbc.co.uk/programmes/b04xwfg1",
    "id": 61926,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2015-01-21",
    "last_episode_to_air": {
        "id": 1038066,
        "name": "Wildlife Gardens and Peonies",
        "overview": "Diarmuid Gavin wants our gardens to become havens for wildlife. He visits a RSPB nature reserve in Yorkshire to understand how important our gardens are to Britain's wildlife population. He meets a group of gardeners at one of the country's only chemical-free community wildlife allotments and encourages the people of Sheffield to grow wildflowers in their gardens to attract pollinators by giving them a taste for flower flavoured honey. \n\nCharlie Dimmock is determined to make the peony the star of our beds and borders again. On her revival she visits a nursery in Somerset - one of the oldest in the UK - which has been championing peonies for over 150 years and she sets up a pop-up peony stall in a Bristol market to spread the word about her campaign.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2015-01-21",
        "episode_number": 10,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 60,
        "season_number": 2,
        "show_id": 61926,
        "still_path": null
    },
    "name": "Great British Garden Revival",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 332,
            "logo_path": "/7HVPn1p2w1nC5oRKBehXVHpss7e.png",
            "name": "BBC Two",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 20,
    "number_of_seasons": 2,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Great British Garden Revival",
    "overview": "Britain’s rich horticultural history is being lost. More and more front and back gardens are paved over - for development, for parking spaces, or because families don’t have the time or inclination to manage these spaces. The trend for easy-to-maintain lawns, patios and paving has also led to a decline in traditional gardens full of flowers, plants and trees to the extent that some of our most iconic flora and fauna have all but disappeared. Step forward the BBC’s most-loved gardening experts, who are determined to turn us back into a green-fingered nation once again.",
    "popularity": 7.57,
    "poster_path": "/xeyGglIUCZEViXfFfZwYGMVzNdx.jpg",
    "production_companies": [
        {
            "id": 44534,
            "logo_path": "/erve95rk8IXbmZLKcx5aBDMwwT3.png",
            "name": "Outline Productions",
            "origin_country": "GB"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2013-12-09",
            "episode_count": 10,
            "id": 64681,
            "name": "Series 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2015-01-06",
            "episode_count": 10,
            "id": 64682,
            "name": "Series 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 7,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "54bf76d69251411d7700ef6f",
            "air_date": "2013-12-09",
            "episodes": [
                {
                    "air_date": "2013-12-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1038047,
                    "name": "Wild Flowers and Front Gardens",
                    "overview": "Wild Flowers – Monty Don\n\nIn his revival campaign, Monty Don finds out that you really do reap what you sow. Since the first half of the 20th century, 98 per cent of wild flower meadows in Britain have been lost - a statistic that which Monty finds shocking. He passionately believes that it’s not too late to do something about this and gardeners all over the UK can grow our beautiful native wild flowers. \n\nFront Gardens – Joe Swift\n\nIn the past, our front gardens were highly valued and we used them to show off our gardening prowess, but sadly over time, front gardens have been paved over for parking and turned into a no-man’s land between the street and front door. Joe Swift is determined that we return our front gardens to their former glory.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/ektieZsKM2XgQane5GEAoQ9rke5.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-12-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1038049,
                    "name": "Topiary and Roof Gardens",
                    "overview": "Topiary – Rachel De Thame\n\nToday, topiary is mostly seen as the preserve of stately homes and formal gardens, out of reach from the rest of us. Rachel de Thame however, thinks that it’s time that this great tradition of trimming and shaping plants returns to all our gardens. \n\nRoof Gardens – James Wong\n\nJames Wong is up on the roof for his revival. Roof Gardens were at their height in the first half of the 20th century but they fell from grace and he now believes the time has come to return them to their rightful place, in a celebration of our gardening heritage.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/sgJTWlhBI5mu0aEwPQLJ0s11QV8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2013-12-13",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1038050,
                    "name": "Cottage Gardens and House Plants",
                    "overview": "Cottage Gardens – Carol Klein\n\nAs a passionate plantswoman, Carol Klein wants us all to embrace one of the most iconic and quintessentially British styles of gardening in her revival – the cottage garden. \n\nHouse Plants – Tom Hart Dyke\n\nPlant hunter and gardener Tom Hart Dyke is championing house plants in his revival. House plants were once revered by the Victorians but now they are much maligned, seen as dull and boring, something you would associate with being forgotten on a windowsill or gathering dust on your granny’s sideboard. As a plant hunter, Tom wants us all to fall back in love with the house plant, and hosts his campaign from the Glasshouse at RHS Garden Wisley.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/zWizu38bEo4mL6fffAYc8nc3bEF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1038051,
                    "name": "Cut Flowers and Trees",
                    "overview": "Cut Flowers – Rachel De Thame\n\nIn her revival, Rachel de Thame investigates the decline of Britain’s cut-flower industry. On her campaign she visits New Covent Garden and discovers that 90 per cent of our cut flowers are imported. She also meets a man in Cumbria who has dedicated his life to growing sweet peas. Cut flowers are big business and £120 million a year is forked out on wedding flowers. This is something close to Rachel’s heart, as she recently arranged the flowers for her daughter’s wedding and showcased the flowers she is passionate about bringing back into all our homes. \n\nTrees – Joe Swift\n\nToday only 2 per cent of Britain is covered in ancient woodland and, in our gardens, we’ve fallen out of love with trees, which is why they are the focus of Joe Swift’s revival. He loves them and as a garden designer, trees are the first things he considers when laying out a garden.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/4N3LcSgluTY5ZCeV8dEBS7xPCi8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-07",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1038052,
                    "name": "Rock Gardens and Herb Gardens",
                    "overview": "Rock Gardens – Carol Klein\n\nCarol Klein shares her infectious passion for a style of gardening that is in much need of a revival. Rock gardens were at the pinnacle of Victorian garden fashion. Carol opens up the horticultural display cabinet to the finest remaining examples across the country. \n\nHerb Gardens – Toby Buckland\n\nToby Buckland loves plants that you can grow and actually use. Throughout history, herbs have been used in medicine, to stimulate the senses and, of course, as a flavouring in food - but he thinks there’s a danger that our knowledge and understanding of these plants is being lost. Tucked away on the banks of the Thames, The Chelsea Physic Garden is the base for Toby’s Herb Garden Revival.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/xCdyI3pNU2qMbHSHQUPTdmCy66j.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-08",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1038053,
                    "name": "Glasshouses and Shrubs",
                    "overview": "Glasshouses – Diarmuid Gavin\n\nIn our own homes we’ve lost sight of the potential for growing under glass. In this episode, Chelsea gold-medal-winning designer Diarmuid Gavin wants us to use glasshouses to restore a sense of adventure, flair and excitement to our gardens. The base for his revival is the Great Glasshouse of the National Botanic Garden of Wales in Carmarthenshire. \n\nShrubs – Matt James\n\nMatt James believes that shrubs deliver by the bucket load. Fantastic for privacy and screening, backdrops, focal points, fragrance, flower and foliage, they have been overlooked and ignored for too long but that is about to change. Matt thinks they can give a garden so much and in his revival he wants people to rediscover and appreciate the importance of this amazing group of plants.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/kvORXEKHHw3RxwDpbpg309jsCVk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-09",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1038054,
                    "name": "Ponds and Stumperies",
                    "overview": "Ponds – Charlie Dimmock\n\nEver since she was a young girl, Charlie Dimmock has been fascinated by water and, in her revival, wants us all to celebrate water and wildlife in our gardens. Pollution, redevelopment and demand for water have resulted in the loss of half a million natural ponds over the last century, and Charlie believes now is the time for us all to take the plunge and do something about it. \n\nStumperies – Chris Beardshaw\n\nIn his revival, Chris Beardshaw wants to return a Victorian curiosity – the stumpery - to our back gardens. Similar to rock gardens but created from upturned stumps, logs, roots and pieces of bark, they were created to display the spoils of intrepid Victorian plant hunters.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/lyusIq6AtiyzLY3r4Onb0fLt8Ax.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-10",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1038055,
                    "name": "Lawns and Tropical Gardens",
                    "overview": "Lawns – Sarah Raven\n\nIn her revival, Sarah Raven investigates why the British are so proud of their lawns. She visits Worcester College Oxford, to catch a glimpse of lawn perfection and talks to author Tom Fort about the lawn's history and why it has fallen from favour.\n\nTropical Gardens – James Wong\n\nFor James Wong, no other gardening style can match tropical gardens when it comes to sheer spectacle, the thrill of innovation and a sense of fun. Seen as unfashionable, expensive and a lot of hard work, tropical gardening has fallen by the wayside and James is determined to revive it.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/7X0Z5Orr6hcCOrvmAHVDG1MQRcz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-13",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1038056,
                    "name": "Fruit Trees and Ornamental Bedding",
                    "overview": "Fruit Trees – Toby Buckland\n\nNinety per cent of all our fruit is imported and with our orchards disappearing, we’re in danger of losing our great fruit-growing heritage. As a gardener with a passion for growing produce, Toby Buckland wants to put home-grown fruit back on the menu. \n\nOrnamental Bedding - Christine Walkden\n\nOrnamental bedding was at its glorious, colourful peak during the Victorian era but high costs and high maintenance meant it ran out of steam and crashed out of fashion. Christine Walkden has always loved this decadent style of gardening and wants it back in our gardens.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/4jN9KuFUNRGvff8DGUPk5fpSnEB.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-14",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1038057,
                    "name": "Herbaceous Borders and Kitchen Gardens",
                    "overview": "Herbaceous Borders – Chris Beardshaw\n\nThe herbaceous border is a truly iconic British garden feature. The number of perennial plants required, the intricacies of the designs, space required and extensive maintenance, all contributed to the herbaceous border falling out of favour with gardeners in recent years. Chris Beardshaw believes that this trend can be reversed and that these incredible displays of floral fireworks should return to our gardens once more. \n\nKitchen Gardens – Alys Fowler\n\nGrow your own has been in full swing for the last few years but Alys Fowler wants to revive the original concept of the kitchen garden, not just the allotment or veg patch at the bottom of the garden. She thinks the garden should be a place of great ornamental beauty that provides us with food all year round.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 61926,
                    "still_path": "/1t1SjpNeOTV9dCxsLqNWviP5xlO.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Series 1",
            "overview": "",
            "id": 64681,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "54bf7f73c3a3686c6b011920",
            "air_date": "2015-01-06",
            "episodes": [
                {
                    "air_date": "2015-01-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1038058,
                    "name": "Roses and Climbers & Creepers",
                    "overview": "Rachel de Thame shares her love of old roses. In her revival, she meets a nurseryman in Oxford involved in the restoration and conservation of old rose gardens, takes to the streets of Solihull with her pop-up rose garden and visits the most famous rose nursery in the UK.\n\nJoe Swift wants to dispel some of the myths which have grown up around climbers and creepers and shows us that, with the right selection and a little bit of maintenance, they will suit any style of garden. On his revival, he meets a university research team investigating the effects that climbing plants can have on our buildings, sizes up the longest wisteria in the country and finds out that climbing plants can also be productive on a visit to a cooperative vineyard in London.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": "/amMrOR9MFZKUjUDoV1jEtYejVg4.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-07",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1038059,
                    "name": "Daffodils and Blossom Trees & Shrubs",
                    "overview": "Carol Klein reveals that she is daft about daffodils. On her revival she uncovers the history of the UK daffodil industry on a visit to Cornwall's Tamar Valley, takes to the streets of Falmouth and paints the town yellow, and meets a specialist bulb merchant in Somerset. \n\nChris Beardshaw is on the blossom campaign trail. On his revival he visits a man in the Scottish Borders who has restored a walled garden and created a living library of heritage fruit trees; takes to his bike on the blossom trail in Worcestershire; and meets a woman in Edinburgh who has been campaigning to save the flowering cherry trees on her street from the chop.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": "/85WAATnhBQ6EnrguCKtmsklZz3B.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1038060,
                    "name": "Rhododendrons and Carnations",
                    "overview": "James Wong wants to revive a plant which has fallen deeply out of garden fashion - the rhododendron. On his revival he visits the Lost Gardens of Heligan to see species of rhododendron which have been saved from the edge of extinction; he meets a scientist who is bringing Victorian species back from the dead; and attempts to win over the people of Truro with dwarf varieties suitable for any garden. \n\nChristine Walkden wants to revive a garage forecourt favourite - the carnation. On her revival she visits a specialist nursery who have been growing carnations for over 100 years; she heads to Gravetye Manor, the former home of the esteemed botanist, gardener and champion of naturalistic planting - William Robinson; and hits the streets in an attempt to bring back a forgotten tradition, the gentleman's buttonhole.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": "/84MCxkuVJ2EIa3oM7RDkb2UAyFW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-09",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1038061,
                    "name": "Scented Gardens and Tulips",
                    "overview": "Toby Buckland wants to bring back scent to our gardens, visiting a scented garden at Kenilworth Castle which was originally created to win the heart of a queen. He holds the country's first ever scented flower competition and gets behind the science of scent when he meets a chemist and perfumer in the Cotswolds. \n\nTom Hart Dyke wants to convince us all to grow tulips. He visits Spalding, which used to be the heart of tulip growing in the UK. He discovers the turbulent history of the broken tulip which four hundred years ago brought an economy to its knees, and lends a hand to one of Britain's last large-scale commercial tulip growers in Norfolk.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": "/cFVEpNor5ZeiJ75On4PqPJhn3el.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-12",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1038062,
                    "name": "Lavender and Knot Gardens",
                    "overview": "Diarmuid Gavin wants us to rekindle our love for lavender. On his revival he learns about its popularity and decline, when he visits what was once one of the major lavender growing regions in the UK. \n\nAlys Fowler wants to bring back an important part of our gardening heritage - the knot garden. On her revival she visits Hampton Court Palace to learn about one of the earliest knot gardens created, she helps out with a knot garden community restoration project in the Midlands and meets a man whose knot garden has turned into a real labour of love.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-13",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1038064,
                    "name": "Irises and Ornamental Grasses",
                    "overview": "Rachel de Thame thinks that irises aren't getting the attention they deserve. On her revival she uncovers one woman's mission to save a unique collection of heritage irises and she gets creative with floral art using irises for inspiration. \n\nToby Buckland reveals there is so much more to grass than meets the eye. On his revival he discovers the Victorians' passion for ornamental grasses with a visit to the Royal Botanic Gardens at Kew; he attempts to rebrand grasses to deal with their complicated, tongue-twisting Latin names, which often put gardeners off; and he meets a modern-day plant hunter who travels the world in search of unusual and exotic grasses.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": "/8CcoEIvW1tcIxCSoQc179QNGAUZ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1038068,
                    "name": "Conifers and Pelargoniums",
                    "overview": "Carol Klein flies the flag for conifers. On her revival, she visits the pinetum at RHS Garden Wisley to learn how we first became obsessed with conifers; she drops in on an old friend in the Peak District who has an extraordinary collection of dwarf conifers; and she tries to convince the people of Matlock about the joys of conifers by creating an amazing island installation in a local park. Throughout the show Carol shares here expertise and passion for these misunderstood plants. \n\nTom Hart Dyke wants to give pelargoniums - often incorrectly called geraniums - back their rightful name. On his campaign he visits a garden centre in an attempt to re-educate the public about pelargoniums; he visits the biggest pelargonium collection in the world; and he spreads the word when he hits the campaign trail for his pelargonium referendum.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": "/clazGgytainUjTQ3KL0S5EShLpD.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-19",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1038065,
                    "name": "Lilies and Woodland Gardens",
                    "overview": "James Wong is convinced we should all be growing lilies in our gardens. He unearths the history of the lily, meets expert lily growers as they prepare for one of the country's biggest flower shows at Tatton Park and gets intimate with the insect associated with the decline of lily growing in the UK.\n\nChristine Walkden thinks woodland plants have been left in the shade in favour of sun loving, bigger, blousier flowers. She shows the people of Brentwood that the only way isn't Essex, as she converts them to the joys of bluebells.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": "/qtVbpSXRykP8RlMALqvxV96URRf.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-20",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1038067,
                    "name": "Bog Gardens and Soft Fruit",
                    "overview": "Joe Swift campaigns for the return of the bog garden. He visits a Victorian bog garden in Warwickshire which is well adapted to flooding, he reveals how fantastic bog gardens are for attracting wildlife and learns about the latest innovation in this style of gardening designed to deal with higher rainfall and reduce the risk of flooding - the rain garden. \n\nAlys Fowler believes that soft fruit are ripe for a revival. She uncovers the history of kitchen gardens and the importance of growing berries in the UK, she visits a nursery which specialises in rare and interesting soft fruit that can be grown easily at home, and she heads to the Kent County Show in search of some prize-winning berries.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": "/tIcFzP7QZYw3C5Wbzfpyig9GEum.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-21",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1038066,
                    "name": "Wildlife Gardens and Peonies",
                    "overview": "Diarmuid Gavin wants our gardens to become havens for wildlife. He visits a RSPB nature reserve in Yorkshire to understand how important our gardens are to Britain's wildlife population. He meets a group of gardeners at one of the country's only chemical-free community wildlife allotments and encourages the people of Sheffield to grow wildflowers in their gardens to attract pollinators by giving them a taste for flower flavoured honey. \n\nCharlie Dimmock is determined to make the peony the star of our beds and borders again. On her revival she visits a nursery in Somerset - one of the oldest in the UK - which has been championing peonies for over 150 years and she sets up a pop-up peony stall in a Bristol market to spread the word about her campaign.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 61926,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Series 2",
            "overview": "",
            "id": 64682,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    }
}