{"adult":false,"backdrop_path":"/lnT3vepzSryIo9S6bMUyNgZo4PI.jpg","created_by":[],"episode_run_time":[50],"first_air_date":"2013-12-02","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.bbc.co.uk/programmes/b05rx6vh","id":62000,"in_production":false,"languages":["en"],"last_air_date":"2017-02-27","last_episode_to_air":{"id":1446533,"name":"Adelaide to Port Lincoln","overview":"Neil and the team embrace the rich colours and stories from where the desert meets the sea. Neil Oliver tries fishing with a pole and a line – and meets the pioneers who began the industry that made Port Lincoln rich.  On the Spencer Gulf, distinguished scientist Professor Tim Flannery finds food to feed the world in a horticultural experiment powered by the sun and the sea.","vote_average":0,"vote_count":0,"air_date":"2017-02-27","episode_number":8,"episode_type":"finale","production_code":"","runtime":50,"season_number":3,"show_id":62000,"still_path":null},"name":"Coast Australia","next_episode_to_air":null,"networks":[{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":24,"number_of_seasons":3,"origin_country":["GB"],"original_language":"en","original_name":"Coast Australia","overview":"Coast Australia follows renowned Scottish archaeologist and historian Neil Oliver on his very first trip to Australia, as he and a diverse group of co-hosts gather stories about our spectacular coastline: the history, the people, the archaeology, the geography and the marine life, investigating interesting and little known facts along the way. Oliver’s co-hosts, all experts in their field, are journalist and Australian arts and culture specialist Miriam Corowa, environmentalist Professor Tim Flannery, marine scientist Dr Emma Johnston, anthropologist Dr Xanthe Mallett and television presenter and landscape architect Brendan Moar.","popularity":3.462,"poster_path":"/cffYbrItZjsQ3VjEVYrLwD663xe.jpg","production_companies":[{"id":46039,"logo_path":null,"name":"Great Southern Television","origin_country":""}],"production_countries":[],"seasons":[{"air_date":"2013-12-02","episode_count":8,"id":64873,"name":"Series 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2015-04-02","episode_count":8,"id":77440,"name":"Series 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2017-01-09","episode_count":8,"id":77441,"name":"Series 3","overview":"","poster_path":null,"season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":6,"vote_count":1,"season_data":{"1":{"_id":"54d597b49251416b930011c7","air_date":"2013-12-02","episodes":[{"air_date":"2013-12-02","episode_number":1,"episode_type":"standard","id":1040639,"name":"The Kimberley","overview":"In the pristine Kimberley of Western Australia, Neil Oliver discovers Broome’s dark pearling history and the delicate science of their cultivation. Tim Flannery walks in primeval tracks along the legendary Dinosaur Coast. Xanthe Mallett explores a unique maritime war grave. Brendan Moar learns the art of Indigenous raft making and Emma Johnston investigates the lush, protected habitat of migratory shorebirds. Neil Oliver wrestles the southern hemisphere’s biggest tides at the surging Horizontal Falls, and finally experiences the dreaming stories through a little sacred maintenance on some ancient rock art at Freshwater Cove.","production_code":"","runtime":50,"season_number":1,"show_id":62000,"still_path":"/5g4tT8iaCabZ6hXd4uPNYTj8s5c.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-09","episode_number":2,"episode_type":"standard","id":1040640,"name":"Sydney to North Head","overview":"Across the glittering waters of Sydney, Neil Oliver explores the network of fortification to protect \"Fortress Sydney\", and discovers how close the city came to being taken in WW2. Xanthe Mallett learns how to make lime as the convicts did in her quest to understand the importance of oysters in building the early colony. Tim Flannery reveals the geological secrets of the city's vast and sprawling harbour and unlocks the riddle of the rivers that had Captain Philip baffled in 1788. Brendan Moar examines an international icon in engineering and design, and reveals the story of those who made the greatest sacrifice. Emma Johnston hunts for tropical fish in Sydney's temperate and diverse harbour.","production_code":"","runtime":50,"season_number":1,"show_id":62000,"still_path":"/x9JCHM9r2AxmIdTtAb1WAF7egfi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-16","episode_number":3,"episode_type":"standard","id":1040641,"name":"Great Barrier Reef","overview":"Neil Oliver begins this stunning journey through the world's largest coral reef in the wake of James Cook, and in the hands of the Australian Navy's hydrography team. \n\nBrendan Moar discovers an Australian community overcoming wretched beginnings by renewing island family ties. \n\nTim Flannery is granted rare access to a scientific research zone to examine coral history. \n\nXanthe Mallett dives a spectacular wreck in search of answers about its calamitous sinking. \n\nOn an idyllic island, Neil Oliver uncovers a bloody tale of cultural misunderstanding.\n\nFinally, at the southern end of the Great Barrier Reef, Emma Johnston heads underwater with Google to take the reef into homes around the world.","production_code":"","runtime":50,"season_number":1,"show_id":62000,"still_path":"/xGky5yNRvOmJk095zo32Q0wQb0m.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-23","episode_number":4,"episode_type":"standard","id":1040642,"name":"Tasmania","overview":"In the tranquil south-east of Tasmania, Neil Oliver probes Port Arthur’s harsh penal history. Brendan Moar examines the dramatic grip of lighthouse life on a remote Island. Emma Johnston dives into an underwater battleground to see how science and industry are saving the marine neighbourhood. Neil joins the southern hemisphere’s largest wooden boat festival. Tim Flannery investigates Hobart’s long and illustrious role in Antarctic exploration. Finally, Xanthe Mallett delves into the violent history of whaling, and the legacy that helped build a colony.","production_code":"","runtime":50,"season_number":1,"show_id":62000,"still_path":"/x0rIkPGSJKQbJ8ofrSGbkmhJEyR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-12-30","episode_number":5,"episode_type":"standard","id":1040643,"name":"Gold to Sunshine Coast","overview":"On Australia’s shiny holiday coast, Miriam Corowa investigates the engineering behind the 1970s Florida-style canal system of the Gold Coast. Neil Oliver heads to Peel Island to see the remains of a bleak chapter in history. Xanthe Mallett scours a WW2 fortification at what could have been Australia’s front line, and discovers what life was like waiting for the war to arrive. Brendan Moar dives headlong into a dangerous current to investigate first hand the science of rips. Emma Johnston joins a scientific hunt for dugongs, in the hope of saving them. Finally, Tim Flannery travels to Fraser Island to investigate what’s at the end of the line for the longest sand drift system in the world.","production_code":"","runtime":50,"season_number":1,"show_id":62000,"still_path":"/502K3Z8RwySWnFdKqTowkUYwMv1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-06","episode_number":6,"episode_type":"standard","id":1040644,"name":"Victoria","overview":"Along this historic stretch of coast, Neil Oliver explores Cape Otway and the beacon that helped birth a nation. Tim Flannery scours the water for evidence of the marine mega fauna that roamed ancestral Port Phillip Bay. Brendan Moar uncovers the history of the Great Ocean Road, and, armed with his pick, grasps the challenges of building a now world famous coastal road in the 1920s. Emma Johnston hunts for the delicate Weedy Seadragon and discovers a tragic tale of one artist much captivated by its vivid beauty. On the historic Loch Ard wreck, Xanthe Mallet dives for clues about how and why disaster struck, with only two lives saved, while Miriam Corowa discovers why the coast at Bells Beach keeps pumping out the perfect waves.","production_code":"","runtime":50,"season_number":1,"show_id":62000,"still_path":"/oDglJg5kMHrn8vxIvuO3W864nDC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-13","episode_number":7,"episode_type":"standard","id":1040645,"name":"Darwin and Beyond","overview":"Tim Flannery begins this Top End adventure at Victoria Settlement and its tragic history in the struggle to colonise Australia’s northern frontier. Neil Oliver examines the ferocious bombing of Darwin and a remarkable story of reconciliation between former enemies. Miriam Corowa confirms that not all Hollywood dreams come true especially along this unforgiving coast. Xanthe Mallett goes on patrol with Australian Customs &amp; Fisheries to hunt for killer ghost nets. And no Top End story would be complete without a crocodile – Emma Johnston draws blood in the name of science.","production_code":"","runtime":50,"season_number":1,"show_id":62000,"still_path":"/v79rt7UNHcUT0ZspfVyT8M4JYKq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-01-20","episode_number":8,"episode_type":"finale","id":1040647,"name":"Coral Coast","overview":"On this wind-swept coast, Neil Oliver investigates why no one survived the attack on HMAS Sydney in its dramatic battle with a German raider in 1941. Xanthe Mallett heads to the Houtman Abrolhos islands and unearths the gruesome tale of the Dutch Batavia murders of 1629. In Shark Bay Tim Flannery finds 3 billion year old life, while Neil Oliver explores why Carnarvon's jetty was once the life-blood of the Gascoyne region. Emma Johnston witnesses why the world's largest fish keeps returning to the crystal waters of Ningaloo Reef, and Brendan Moar catches up with coastal nomads off the grid, on the edge of the continent.","production_code":"","runtime":50,"season_number":1,"show_id":62000,"still_path":"/bMSNyBxgqnuLKZ5J7PuPMK8eoQI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 1","overview":"","id":64873,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"574b4e44c3a368303b001f55","air_date":"2015-04-02","episodes":[{"air_date":"2015-04-02","episode_number":1,"episode_type":"standard","id":1446134,"name":"Victoria","overview":"","production_code":"","runtime":50,"season_number":2,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-09","episode_number":2,"episode_type":"standard","id":1446135,"name":"South Australia","overview":"Neil takes to the air on an RAAF training mission to seek and destroy submarine invaders. Palaeontologist and explorer Professor Tim Flannery has a close encounter with history as he uncovers an unlikely meeting between two French and English navigators at Encounter Bay. Landscape architect Brendan Moar visits the moody Coorong to remember the ground-breaking Australian film Storm Boy. Neil investigates the quest to preserve Adelaide's mother-ship, freshly saved from Scottish ruin. Marine ecologist Professor Emma Johnston dives deep into the stunning underwater caverns of the Limestone Coast. In Robe, historian Dr Alice Garner gets a taste of how Victoria's gold rush was the making of this coastal town across the border, and Neil examines new archaeological evidence of a wild fur trade that sprung up on remote Kangaroo Island, and its lasting impact on the endangered sea lions of Seal Bay.","production_code":"","runtime":50,"season_number":2,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-16","episode_number":3,"episode_type":"standard","id":1446509,"name":"Northern NSW","overview":"Neil Oliver unearths the surprisingly dirty history of much-loved Byron Bay. Professor Tim Flannery uncovers the world's longest recorded unbroken raft journey. Neil investigates a war that the authorities were determined to cover up at great personal cost.","production_code":"","runtime":50,"season_number":2,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-23","episode_number":4,"episode_type":"standard","id":1446510,"name":"South WA","overview":"Neil Oliver travels from Perth to Augusta. He begins in the rigging of the Duyfken, a replica 16th Century Dutch ship, the first known European vessel to visit Australia.","production_code":"","runtime":50,"season_number":2,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-30","episode_number":5,"episode_type":"standard","id":1446511,"name":"Torres Strait","overview":"Neil travels to Horn Island in Australia's extreme north to uncover the role of Australia's only indigenous battalion, a Second World War fighting force of Torres Strait Islanders. On Possession Island Tim Flannery stands where James Cook finally claimed Australia for Great Britain, and discovers the riches that he missed.","production_code":"","runtime":50,"season_number":2,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-07","episode_number":6,"episode_type":"standard","id":1446512,"name":"Norfolk Island","overview":"On this lush-green island, 1500kms from the mainland. Neil Oliver wanders amidst penal ruins, as he discovers the legacies of two historic figures; an audacious convict, and the second a reforming commandant.","production_code":"","runtime":50,"season_number":2,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-14","episode_number":7,"episode_type":"standard","id":1446513,"name":"Southern NSW","overview":"Neil Oliver discovers the fatal engineering errors behind Cape St George Lighthouse that cursed Wreck Bay for four decades. In Callala Bay, Tim Flannery uncovers the life-saving properties of seaweeds.","production_code":"","runtime":50,"season_number":2,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-21","episode_number":8,"episode_type":"finale","id":1446514,"name":"Pilbara","overview":"Neil Oliver boards an iron ore carrier to discover only a tiny margin of error allowed in docking and loading these enormous vessels.","production_code":"","runtime":50,"season_number":2,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 2","overview":"","id":77440,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"574b4e7bc3a368319a002d01","air_date":"2017-01-09","episodes":[{"air_date":"2017-01-09","episode_number":1,"episode_type":"standard","id":1446515,"name":"Albany to Esperance","overview":"In the opening episode of the third season of Coast Australia, Neil Oliver heads offshore and ticks a big one off his bucket list.  He’s on the trail of that most majestic marine creature – the mighty Orca.  Neil also examines the notion that the ANZAC spirit was forged – not on the beaches of Gallipoli – but in the port of Albany where Australian and New Zealand troops gathered for their departure to World War One.","production_code":"","runtime":50,"season_number":3,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-16","episode_number":2,"episode_type":"standard","id":1446516,"name":"Hawkesbury to Lord Howe Island","overview":"A journey through the meandering waterways of Sydney’s Hawkesbury River system to the sublime wilderness of Lord Howe Island.  Neil travels to the Heritage-listed treasure of Lord Howe Island in search for the world’s rarest insect before meeting some curious sea birds endemic to the island.  Back on the mainland – he digs deep to find the true history of coal in Newcastle.","production_code":"","runtime":50,"season_number":3,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-23","episode_number":3,"episode_type":"standard","id":1446525,"name":"The North Kimberley","overview":"Neil and the team reveal fascinating tales from the inspiring and remote North Kimberley.  Neil visits Australia’s secret wartime airbase on the remote Anjo Peninsula before joining the traditional owners there to fight fire with fire.","production_code":"","runtime":50,"season_number":3,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-30","episode_number":4,"episode_type":"standard","id":1446528,"name":"Port Melbourne to Portland","overview":"A journey along Victoria’s fabled shipwreck coast to discover a diverse collection of stories from the deep – and shallow.  Neil Oliver joins the Port Phillip Pilots to navigate the bay’s treacherous entrance – ominously known as ‘The Rip’.","production_code":"","runtime":50,"season_number":3,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-06","episode_number":5,"episode_type":"standard","id":1446530,"name":"Townsville to Cooktown","overview":"Neil Oliver examines James Cook’s run of luck on the Great Barrier Reef. In this episode, Neil Oliver finds out how Captain James Cook resolved the crisis for which Cape Tribulation is named. And then, the indigenous story of his ‘lucky landing’ on sacred ground.","production_code":"","runtime":50,"season_number":3,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-13","episode_number":6,"episode_type":"standard","id":1446531,"name":"Botany Bay to the Shoalhaven Coast","overview":"This episode documents the industry, ingenuity and beauty of the coastline south of Sydney to the Shoalhaven. From the engineering wonder of Seacliff Bridge to pivotal moments in the aviation history, this episode charts a densely populated coastline with stories that brim with new insights and captivating natural beauty.  Neil Oliver examines a 18th Century close encounter in Botany Bay – before following the footsteps of legendary Australian aviator, Charles Kingsford Smith at Seven Mile Beach.","production_code":"","runtime":50,"season_number":3,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-20","episode_number":7,"episode_type":"standard","id":1446532,"name":"The North Coast & Bass Strait Islands","overview":"Neil and the team examine creativity and the art of reinvention along Tasmania’s northern coast and offshore islands. Neil collects some of the cleanest air in the world in the name of science.  On King Island, he examines the worst maritime disaster in the history of Australia before swinging back onto the mainland for a round of golf on a legendary links course.","production_code":"","runtime":50,"season_number":3,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-27","episode_number":8,"episode_type":"finale","id":1446533,"name":"Adelaide to Port Lincoln","overview":"Neil and the team embrace the rich colours and stories from where the desert meets the sea. Neil Oliver tries fishing with a pole and a line – and meets the pioneers who began the industry that made Port Lincoln rich.  On the Spencer Gulf, distinguished scientist Professor Tim Flannery finds food to feed the world in a horticultural experiment powered by the sun and the sea.","production_code":"","runtime":50,"season_number":3,"show_id":62000,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 3","overview":"","id":77441,"poster_path":null,"season_number":3,"vote_average":0}}}