{"adult":false,"backdrop_path":"/dtkI0fbbRnpTsuGtCKZlO7xz6vD.jpg","created_by":[{"id":24530,"credit_id":"635b8fc1f28838007b159f0a","name":"René Goscinny","gender":2,"profile_path":"/z3fYRh33fBTYChnyZPWy4X7jcih.jpg"},{"id":68448,"credit_id":"635b8fb7d400f3007a56e97d","name":"Morris","gender":2,"profile_path":"/eoYDoIZVxYidvxnOa2YvlpdCUJZ.jpg"},{"id":112779,"credit_id":"5fbfcfeb57530e00423e18b5","name":"Olivier Jean-Marie","gender":2,"profile_path":null}],"episode_run_time":[22],"first_air_date":"2001-09-16","genres":[{"id":37,"name":"Western"},{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"},{"id":10751,"name":"Family"}],"homepage":"https://www.youtube.com/channel/UC3JhM5SSUw8WoFbTuTIVIZA/about","id":62318,"in_production":false,"languages":["fr"],"last_air_date":"2003-05-04","last_episode_to_air":{"id":1331248,"name":"The Schoolmaster","overview":"After Congress declares the American republic can only become a great nation by schooling its people, Lucky saves a haughty, pedantic East coast teacher who immigrates to civilize the West and arrests three crooks who were robbing the teacher. The ignorant town-folk soon mistrust the hot-head educator. The local crime baron Jolly Potbelly forbids turning the saloon into a school for both adults and youth. Lucky stays as protector and armed truancy-fighter, but is ordered on the benches too as 'role model', later even as substitute.","vote_average":0,"vote_count":0,"air_date":"2003-05-04","episode_number":52,"episode_type":"finale","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/h0tK5NCiciUKfriPxa3Olk1Atbj.jpg"},"name":"The New Adventures of Lucky Luke","next_episode_to_air":null,"networks":[{"id":249,"logo_path":"/1ePfTUHHvBlVQxa0Fltx5kWhIs5.png","name":"France 3","origin_country":"FR"}],"number_of_episodes":53,"number_of_seasons":2,"origin_country":["FR"],"original_language":"fr","original_name":"Les Nouvelles Aventures de Lucky Luke","overview":"The cowboy who draws a gun faster than his shadow is back! Lucky Luke, the famous wandering cowboy fights crime and injustice, most often in the form of the bumbling Dalton brothers. He rides Jolly Jumper, \"the smartest horse in the world\" and is often accompanied by Rantanplan, \"the stupidest dog in the universe\".","popularity":13.091,"poster_path":"/no5MpPRcVVQWh33KDpA2CE7Tvvu.jpg","production_companies":[{"id":7131,"logo_path":"/eLvjHPYZ12GR58lrDgg6MXZp2a3.png","name":"France Télévisions","origin_country":"FR"},{"id":17065,"logo_path":"/mqoS56YswPVBO3nriH2Qj6pWWbY.png","name":"Studio Xilam","origin_country":"FR"}],"production_countries":[{"iso_3166_1":"CA","name":"Canada"},{"iso_3166_1":"FR","name":"France"}],"seasons":[{"air_date":"2001-09-16","episode_count":52,"id":65812,"name":"Season 1","overview":"Every hero must have a villain - and Lucky Luke has 4 - the Dalton brothers. Fortunately, he's faster to draw his revolver than his own shadow and he has a loyal friend in his horse.","poster_path":"/ahzsV1M8NegmvfTFZjnHlL8VcFA.jpg","season_number":1,"vote_average":8},{"air_date":null,"episode_count":1,"id":318160,"name":"Season 2","overview":"","poster_path":"/svTOTzigXy9KpVDTAzsWd3UIecq.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"French","iso_639_1":"fr","name":"Français"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.2,"vote_count":17,"season_data":{"1":{"_id":"5527a7699251411530000fbd","air_date":"2001-09-16","episodes":[{"air_date":"2001-09-16","episode_number":1,"episode_type":"standard","id":1052812,"name":"Episode 1","overview":"","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/dc7vjt943Jpe7Zuqgq6SPKdEwPD.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5cd2a30d9251417df727c2fa","adult":false,"gender":2,"id":112779,"known_for_department":"Creator","name":"Olivier Jean-Marie","original_name":"Olivier Jean-Marie","popularity":3.641,"profile_path":null},{"job":"Producer","department":"Production","credit_id":"6038bb8cd6819b0058aa73b5","adult":false,"gender":2,"id":112771,"known_for_department":"Production","name":"Marc Du Pontavice","original_name":"Marc Du Pontavice","popularity":2.807,"profile_path":"/ohvcMkKYjvaVGq6Q55QMPaIsvGO.jpg"}],"guest_stars":[]},{"air_date":"2001-09-23","episode_number":2,"episode_type":"standard","id":1052814,"name":"Lucky Luke vs Sherlock Holmes","overview":"Exasperated by Queen Victoria’s unbearable superiority complex, President Grant decides to challenge “her majesty” to a contest: Lucky Luke VS Sherlock Holmes.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/nukcvd9is0eJOLkNUyHw5fWpvgN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-09-30","episode_number":3,"episode_type":"standard","id":1052815,"name":"Lucky Luke meets Lucky Luke","overview":"Elmer Rotten, criminal par excellence and, master of disguise has turned himself into none other than yours truly, Lucky Luke. What better way to heist, rip off and bleed the wild west of its last penny?! Suddenly the “real” Lucky Luke becomes the most wanted man in the frontier and he finds himself having to hunt down...himself! Of course Rintindumb, the stupidest dog in the West is utterly convinced that Elmer Rotten is the “real” Lucky Luke! And faithful old pooch that he is, nobody, but nobody is going to lay a paw on his master!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/o2eqNLxy4sZLRCaEkmkcKeS7ntl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-10-14","episode_number":4,"episode_type":"standard","id":1052816,"name":"Hurray for Holly Woods","overview":"Lucky meets the brothers Lumière, and saves the French pioneers of cinematography on their way to Holly Woods, still equally unknown then, from such diverse dangers as a bear and a malicious businessman and his dogsbody Jack who try to sabotage their entertainment breaking trough, or on second thought steal their unique camera. Meanwhile their demo movies were destroyed, so Wild West folk must act in a new one...","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/5zGkGxdTMFEiFPeLJdQmtOWlHxE.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2001-10-21","episode_number":5,"episode_type":"standard","id":1052817,"name":"Flower Power for the Daltons","overview":"When Russian immigrant Vladimir's anti-capitalist rhetoric is about to get him lynched by the insulted rancher's cowboys, Lucky saves him from the noose by shooting down their weapons- and trousers. The escaped Daltons stole only one horse to remain inconspicuous, but loose it; when they come to Vladimir's cabin to steal his donkey, the Marxist's madness extends to invite the 'victims of unjust laws' to join the Utopian lawless society Freedonia he is planning, based solely on natural friendliness, and refuses to let Luke take the crooks back to jail, so Lucky decides...","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/5GikaSnCpsyZSIzQLsLhNCFtDg9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-10-28","episode_number":6,"episode_type":"standard","id":1052818,"name":"Indian roulette","overview":"Conniving old Poker Face is up to more of his dirty tricks. He has pulled some strings in Washington so that the Tribe of the Upright Men may be granted a license for gambling. Ignoring the advice of his good friend Lucky Luke, Chief Earnest Eagle accepts the dubious proposition in exchange for a meager stipend...drinking water! While Poker Face fills his pockets with filthy lucre, easy water turns all the Upright braves into spoiled little papooses! Full of remorse, Earnest Eagle calls to the rescue his brother Luke-the-pure-hearted. Nothing is more shameful to an Upright Man than to be downright irresponsible!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/jdXGUJrkgITyp9dpx1pJqj7IHj0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-11-04","episode_number":7,"episode_type":"standard","id":1052819,"name":"Episode 7","overview":"","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/hmMu1aebQJVW84aPWtpyPzdxiMH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-11-11","episode_number":8,"episode_type":"standard","id":1052820,"name":"The Dalton's Treasure","overview":"The Daltons have just escaped from the federal penitentiary along with A.B. Faria, an old, wheel-chair bound prisoner who claims he knows where the legendary treasure of Cibola is hidden. The fugitives are so discreet that pretty soon everyone west of the Mississippi knows about the treasure, including the Federal government who hires Lucky Luke to chase down the convicts...and find the treasure. Lucky Luke spies on our favorite friends from a distance as they’re dragged from one end of Arizona to the other by an old man with a memory shot full of holes. And to cap it off, the Daltons have to protect old pops from all of the crooks who are drawn to the treasure like flies to #@*!!. The mythical city of Cibola is finally uncovered...but once they see it, nobody is going to fight over the famed treasure!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/vljYPDJj8uPLgj6p1z30Jt1PLsc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-11-18","episode_number":9,"episode_type":"standard","id":1052821,"name":"Episode 9","overview":"","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/wf7YF3Q4QyOrc8eiOWVSYtIa0VH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-11-25","episode_number":10,"episode_type":"standard","id":1052822,"name":"For a Fistful of Daltons","overview":"The Daltons have escaped again and they wind up in Vaca Loca where a livestock fair is going on. Starved to death, they decide to steal the biggest bull for their barbecue! And immediately the Dalton’s heads go on sale for 400,000¨dollars! John Glutton, owner of the bull, wants them back behind bars. Rattle Snake the bounty hunter takes off after them, deciding along the way that he’d rather take them dead than alive. And for the first time in their life, Lucky Luke is going to play guardian angel and save their miserable little lives!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/v2kSN1uO35yGoXjDy2lfeEVZZV3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-02","episode_number":11,"episode_type":"standard","id":1052823,"name":"The Clown Princess","overview":"When Lucky attends a small-town horse rodeo, two fat wallets convince several contenders to bow out with 'leg cramp', leaving the Moldavian twins Bogdan and Todor, mistaken for Canadians, who are knocked down and out in no time, but ex-aequo. After the brothers bribe the sheriff for a chance to hunt down a criminal, Lucky takes charge and finds out they are rival crown princes on a contest for the right to succeed their uncle, king Slobko of Moldavia, consisting of three parts: rodeo, arresting a crook and scalping an Indian, but Lucky protects the peaceful No Joke tribe... Written by KGF Vissers","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/cw1RVMzzfBJ8OjTLi1gZi66B0XB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-09","episode_number":12,"episode_type":"standard","id":1052824,"name":"The Daltons go Native","overview":"Lucky Luke is escorting the Daltons during a prison transfer, when quite inadvertently, Joe saves the life of Hungry Hamster, son of Beastly Beaver. According to Indian custom, Joe becomes Hungry Hamster’s blood brother and as a consequence, is untouchable. Ditto for his brothers. The Daltons remain in the Indian Village and take advantage of their new immunity status. While they’re at it, they decide to get rid of Luke...until the day when Lucky saves Hungry Hamster’s life himself, becomes his blood brother and also...an untouchable. But the ties run deeper than blood and Luke is now also...the Daltons’ blood brother!!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/p6yqNmZawm1AJzCzjQOz7eyvHXQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-16","episode_number":13,"episode_type":"standard","id":1052879,"name":"The Last of the Buffalo","overview":"Out west, things are a mess!  Not a single buffalo on the horizon1  The federal government quickly takes action and decides to bring the noble beast back to its natural habitat. The news spreads like wildfire amongst the hunters and they claw at  each other to get first dibs at prime rib.  Lucky Luke who has been chosen to guide the last pair of buffaloes back to the prairies of Wyoming, is  going to go head-on with Buffalo Bill and J.J. Misdeal, the fastest fingers in West.  But he is  also going to have to reason with the Indians who have been deprived for too long of their favorite game.  The whole thing would be just another day’s work for our lonely cowboy if those dang furry critters weren’t so civilized...","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/bC3zn5xicnalfVefrm4GicRczhs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-23","episode_number":14,"episode_type":"standard","id":1052881,"name":"The Daltons' Christmas","overview":"The Daltons are on the lam again and while running away from the authorities they run into four Santa Clauses who are giving out free samples of Cactus-cola, a new pop drink. They steal their costumes and immediately rob a bank. Everything would have gone according to plan if Averell hadn’t had the brilliant idea of hiding the money in the presents so that Luke wouldn’t find it! And what’s worse is that Averell has the heart of Santa and hands out all of their loot filled presents to everyone he meets! And when they break into the homes of Nothing Gulch in order to tear up all of the presents under the Christmas trees, it’s sure that no one is likely to forget this festive season! The trail of the missing presents will lead them right to...the federal penitentiary where Luke is awaiting them with a Christmas gift of his own! Merry Christmas and a happy few years!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/aIefMqQiVVngsJwZD0Vqxq7Ai7k.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-12-30","episode_number":15,"episode_type":"standard","id":1331211,"name":"Cuff Love","overview":"The Daltons planned to escape by staging a trampoline act in the celebration for the prison's anniversary, but Lucky shoots that act down. Averell asks him for his escape artist act, as volunteer cuffed to Joe, but to both's horror the handcuffs can't be opened and nobody has a key, they were left by peddler Longneck who took off- the unwilling pair sets chase, while Joe keeps trying in vain to get rid of Lucky. General Custer has engaged Longneck to manufacture a tank in the same, allegedly unbreakable alloy. The other Dalton brothers escape and follow, looking for Joe... Written by KGF Vissers","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/zMx87S1falUX0hsmBo8h6EZBPef.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-06","episode_number":16,"episode_type":"standard","id":1331214,"name":"Vultures over the prairie","overview":"The wild west has always been an endless source of customers for the Undertakers Union. But they are getting worried. Because of Lucky Luke, the death rate in Coffin Gulch is disgustingly low. Whenever Lucky steps in, death runs out the door. The Union sends their specialist to do some field work. Dastardly Deadflower is quick stir up a tornado of rumors that discredit Lucky. Coffin Gulch quickly becomes a fortified camp until the mome","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/4gqNkT6ScxH2MDmVjSHhqlCEjCU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-13","episode_number":17,"episode_type":"standard","id":1331215,"name":"A new Dad for the Daltons","overview":"Ma Dalton is getting married! If it’s great news for that big baby Averell who is ecstatic at the idea of a new father, Joe is mad as hell. And to make matters worse, Luke has been hired to escort them from jail to the marriage. Blinded by love, Ma Dalton has paid no attention to the machiavellian maneuvers of her son Joe: he’d like to kill two birds with one stone and knock out both his new step father and Lucky Luke. Twist of fate, it’s thanks to Lucky’s wit and wisdom that Joe is able to get rid of step-daddy...","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/3pVpj7tYEEaaaA7WWDIE2MDq1ac.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-20","episode_number":18,"episode_type":"standard","id":1331216,"name":"Unlucky In Love","overview":"Lucky saves the Donahue sisters from the Backward Indians, who do everything the other way around- or is that the other way around? Next Lucky takes them on their way to California, where they have fiancés also from Dublin, to Independance, a gold-diggers bachelor town, where two girls, however tomcat, cause quite a stir and more. There are two strangers who seem suspiciously uninterested, but follow the trio the next morning over Backward territory, with surprise results for everybody... Written by KGF Vissers","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/1LmvGkUJ3r9St5R33oZ3VuOsXWd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-27","episode_number":19,"episode_type":"standard","id":1331217,"name":"Desperados Union","overview":"Old Timer is fed up with being swindled by Blacknail the banker, and robbed by Mo the local bandit. He asks his friend Lucky Luke to escort his gold in a self-designed armoured wagon. The new wagon resists all attacks! Soon, every prospector in Nugget Town has entrusted their gold to Luke and his wagon. The bandits, deprived of a living, set up a trade union, and lie down in the wagon's path in a protest demonstration… A wind of rebellion blows across town, and an unwilling Luke is obliged to negotiate.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/pFYPh9vLeVLvu29RloDaJ0Oc84S.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-03","episode_number":20,"episode_type":"standard","id":1331218,"name":"Ghosts and bagpipes","overview":"When three red-headed hulks wearing kilts and Scots berets muscle into O'City's saloon bar, Luck Luke chokes on his lemonade! This reaction sets off an brawl, giving the local Irish a perfect excuse to try and knock the brains out of the new lads in skirts. Later, when Lucky Luke is invited to stay at the Scots' castle, he finds himself embroiled in an intrigue involving the McCloud clan, the local Irish and native Indians. He'll have to deal with Lord Bloody's ghost, make peace with the Great Spirit of the Plains, and keep the Indians peaceful with the unexpected help of a Rugby match : child's play for Luke, compared to the next dilemma he's faced with: how to swallow haggis with dignity!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/fCh03alBSfYo98FVR1DHX01AlP4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-10","episode_number":21,"episode_type":"standard","id":1331219,"name":"The Commodore","overview":"Bandits attack a train, but Luke chases them off. This luxurious train belongs to the Commodore, richest man in the USA, on a honeymoon voyage to the West with his young bride Tallulah. In recompense, Luke is invited on board as a guest. A relief for Jolly Jumper, whose hooves are worn out! The Commodore, a dyed in the wool businessman, can't resist buying station after station to extend his railway empire right to San Francisco. Meanwhile, Luke has to cope with regular sabotage from a mysterious figure called Black Rider. Our hero is determined to discover his true identity…","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/tOPUbCpT0LqHc3MYDZcAvjIcNj6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-17","episode_number":22,"episode_type":"standard","id":1331221,"name":"The Battle","overview":"American people across the nation hang on Sneeze's every word. Sneeze is a special correspondent reporting from Mexico, describing the bloody conflict between General Ganache and the rebel El Coyote. When the journalist is captured by El Coyote, President Grant himself sends Lucky Luke south to deliver him. On the spot, Luke finds out that this hack reporter has made the whole story up! He's after glory… but in the meantime, he is kidnapped for real! Two Mexicans have convinced themselves that they ARE the two fictitious characters in question, and live out the exploits in earnest! Aye Caramba! Fiction becomes fact!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/A4MvQd6JONMD0QR56dCF5ZHuafK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-24","episode_number":23,"episode_type":"standard","id":1052813,"name":"Lucky Luke in Alaska","overview":"To pay off his gambling debts, the Great Tsar of Russia is obliged to sell Alaska. Henry Seward, the American Ambassador, whose patriotism is quasi-religious, is in charge of negotiations. He contacts Lucky Luke to escort him (and the funds!) to Alaska. Ralph Bargain, an unscrupulous businessman whom Seward regards as a faithful friend, is travelling with them. Bargain's sole interests are personal profit, and he means to recuperate the sale money for himself. Luke's journey to Alaska is rife with Russian revolutionaries, ambush attempts and even an intransigent polar bear!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/z07FNpHNHpvLUzJikHdqXe9Af5k.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-03","episode_number":24,"episode_type":"standard","id":1052880,"name":"Justice for the Daltons","overview":"Newly escaped from prison, the Daltons bump into Brad Alimony, a lawyer from the East Coast. This erudite fellow has a fail-proof plan to keep the four cronies out of jail. He can have every one of their sentences annulled… providing they pay. Questionable methods, but a legal method to clear the Daltons. Joe is reluctant to pay the lawyer's fees, but can't see any other way around it. So the Dalton's find that for once, they've got the Law on their side. Lucky Luke - on their trail yet again - ends up being accused and sentenced for harassment. Thankfully our hero knows a few loop-holes himself… legal ones of course!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/oKAW3e7H1F1xAex08HVmPhWELVJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-10","episode_number":25,"episode_type":"standard","id":1331220,"name":"Don Quixote del Texas","overview":"Lucky Luke saves a curious character from being hanged. A man who thinks he's \"Don Quixote\" - after a fall from his horse. This fellow meets Milky, the true love of his life. After being swindled by a crook, this young girl works as a singer in a saloon. The deranged \"Don Quixote\" vows to avenge her. Fortunately, Lucky Luke decides to tag along, and tries every way he can to bring the poor guy back to his senses. After many narrow escapes from disaster, Luke finally succeeds in his mission… but not the way he expected!","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/7DD1tRaCkywaPa1IJVMOcyU0cT5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-17","episode_number":26,"episode_type":"standard","id":1331222,"name":"The Mare","overview":"When Lucky Luke's boisterous tomcat friend, Calamity Jane, is officially wanted (dead or alive) for crimes committed by Phil Fast Finger, assuming her loud red-hair posture, Lucky agrees to help her escape. So now the crook catcher is hunted down with her by every bounty hunter- and trace the real culprit, to which end he masquerades with her as the respectable couple Jones. Their stage coach gets trough an attack by Indians, the rivaling bounty hunters catch up, and so does Phil.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/3hxHyYX4kTKyu8GBPuN0Eu0Ib3o.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-14","episode_number":27,"episode_type":"standard","id":1331223,"name":"Lola Montes","overview":"Foxy entertainer Loly Montes—instant target for the Abstentionist crones—and her French aristocratic partner, dwarf painter Eugene, were duped into buying an exhausted gold mine. their nasty cat becomes the object of Rantanplan's desire. Lola sets up a debauchery show in the saloon, Eugene tries to sell o the mine, only to be duped again by a crook who aims at robing the whole town. Lucky Luke must set everything straight.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/qw1v5PQajLoWlSnVlTZ5OBxF25d.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-28","episode_number":28,"episode_type":"standard","id":1331224,"name":"The Beast of Alabama","overview":"Lucky arrives in Green Valey, Alabama, a town obsessed with cattle and domineered by the largest cow herd rancher. When the only sheep-herd mourns individually named sheep, believing them to be devoured by a huge monster, Lucky soon smells a rat, but still has to prove his suspicions, helped or rather hindered by a clumsy self-invited 'monster hunter'.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/fB4JSLkMuK4nZ9JrUNTwLYwu0bo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-07-23","episode_number":29,"episode_type":"standard","id":1331225,"name":"The Daltons See Double","overview":"The Loony brothers, four different-sized, red-hair honest actors, present a Wild West show as the -jailed- Daltons. When the real crooks escape, they learn about their imitators and Joe comes up with a crafty plan: they kidnap the thespians and force them to wear Dalton-masks, so he can field two mixed teams, allowing the Dalton gang to commit crimes in two places at the same time, a stunt reported in the world press. It takes a while till Lucky Luke realizes, watching virtually identical showgirls, what their game must be, and still gets double-tricked, but Averill once more draws the wrong conclusions from Joe's frantic instructions about a play he wrote for themselves and a victim Luke... Written by KGF Vissers","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/m7UDQrUrZbLkFJ56QBNpAAPSCik.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-15","episode_number":30,"episode_type":"standard","id":1331226,"name":"A Cannon for the Daltons","overview":"US Cavalry Colonel Oswald has orders to test fat Bertha, the White House's top-secret artillery pet project. Alas he looses control over it after the Daltons saw it, so they escape to get hold of it, but so want Indian chief Oochi Coochie and the now dismounted troopers. Lucky must arrest the Daltons again at risk of being bombed to Kingdom come, and the Colonel gets a surprise visit.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/ojdWgyeHjDr1eHLXsPmE2XMQYjk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-22","episode_number":31,"episode_type":"standard","id":1331227,"name":"Indian Romance","overview":"Lucky is sent to check on Fort McCallister, which guards the Fake Tattoo Indians. He finds everything is peaceful. The commander's elderly but bossy mother, Julia, meets and falls in love with the chief's equal old and senile father Trilling Otter, which the brothers-in-law-to-be want to prevent at all cost. So the lovebirds elope.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/kSZOPlqsG5nltI9CK9a4ORzoqJN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-29","episode_number":32,"episode_type":"standard","id":1331228,"name":"The Daltons Ghost","overview":"After a distracted undersecretary signs a form declaring the Daltons dead and confirms so in the press, the warden kicks them out of jail. They rob a stage-coach, hear their official status and start a four men-crime wave dressed in white sheets. Spiritualist medium Irina follows Lucky, hoping to prove ghosts exist by photography. Lucky saves from lynching a Hindu fakir who hinders ranch-hands branding 'holy' cows and mistakes Rataplan for a fellow Vishnu reincarnation. Tracked by Lucky, Joe decides to move into a ghost town, which apparently has its own ghost, Roger.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/aLNnk3qyi3axXqYwEcEd1UVL3ew.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-06","episode_number":33,"episode_type":"standard","id":1331229,"name":"Kid and the gang","overview":"","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/dO7Zt90eYQaw49GYJuAjsdM2S0g.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-13","episode_number":34,"episode_type":"standard","id":1331230,"name":"High flying Daltons","overview":"The brothers Walter and John decide to spring the Daltons from jail by hot air balloon in order to prove even the most-feared gang can't crack their custom-order safes on board a train. Of course once free, nasty Joe decides to rob the Trick Gulch bank instead, where Lucky -who guessed so- waits for the Daltons, but the balloon rescues them, yet they throw the pilot out. Indians think the balloon is the stolen sun, Rataplan mistakes it for a toy-ball.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/k37DxLPgK5VJSrBLkLSdftny8HD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-20","episode_number":35,"episode_type":"standard","id":1331231,"name":"Custermania","overview":"Lucky arrives in a small town when mad general Custer is campaigning for president there against Gneral Grant's supporters. Each side aspires hero Luck's reluctant support. Custer's terrible temper hurt him despite a good campaign adviser, but his dog-phobia and panic fear for bad luck bringer Rataplan prove as crucially self-fulfilling.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/4lXYtczw67Nyj6MlnZXovBmwHBJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-27","episode_number":36,"episode_type":"standard","id":1331232,"name":"Jackpot for the Daltons","overview":"Lightning renders dumbo Averill smart enough to lead a Daltons escape and evil, seizing command from Joe and aiming to rob Fort Knox. While Lucky Luke sets chase, the lightning wears off, so Joe goes looking for more electricity to reproduce the effect, but can only recur to a rain-dancing Indian medicine-man.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/aoeastGo3tgEhKkBA706eh8e0vm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-03","episode_number":37,"episode_type":"standard","id":1331233,"name":"Do you believe in Martians?","overview":"Lucky investigates when a town gets divided over whether to believe that cattle theft is the doing pf green Martians arrived by flying saucer, or cleverly covering-up thieves as Luke assumes. Even an Indian medicine man seizes his chance to sell 'alien repellent' talismans.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/uyxLsbSEVdFPxNHMQoKGjhIn2dB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-10","episode_number":38,"episode_type":"standard","id":1331234,"name":"The Daltons  go cowboy","overview":"Despite Lucky's warning, the governor who wants to limit prison costs allows rancher Joe to take the Daltons for 'rehabilitation trough farm labor'. Thre crooks find earning their keep under a foreman's whip intolerable, ironically most of all Averel, although he is spoiled to his brothers' envy by farmer's wife Cynthia, who has the hots for the tall idiot, who alas hates kisses so much Lucky finds him in jail having dug a tunnel back in. By the time Joe manages to mount their escape, they get both Lucky and a woman scorned on their trail.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/nAl8Dr0Aszh3r1ZvzYVw4NOv1r5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-17","episode_number":39,"episode_type":"standard","id":1331235,"name":"The spies","overview":"During a visit of the War Minister's personal adviser to a secret base in the desert, Dr. Pretzel's secret 'ultimate weapon' invention, a bullet proof fabric, is stolen by Horace Twoface. Lucky Luke gets the job of retrieving it for the US government, which leads him to a tiny Mexican village near the Rio Grande, where the megalomaniac El General rules absolutely and pays well for such military advantages. Twoface also arrives there, in a car.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/zPwXh4dR4DGrIcYEb4tKVLk71dt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-24","episode_number":40,"episode_type":"standard","id":1331236,"name":"The charitable Daltons","overview":"The Daltons escape from Denver prison, over the Coloroda border, to Utah, the only state where they are still not wanted. So Lucky Luke has to wait before arresting them till they foul up, which is bound to happen as they met a slick con-artist who is bound to rival with them for the same victims.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/oZh4ok4kEMsb3YOaQfOmU0WaNp3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-12-08","episode_number":41,"episode_type":"standard","id":1331237,"name":"Dalton Junior","overview":"After yet another escape, the Daltons are handed a baby by a mother, who rides away as diversion 'chased by villains'. Although the boy clearly bonds only with him, Joe first dumps noisy Junior on the old farmers, who adopt the godsend, then changes his mind to steal the baby back hoping it's worth a royal ransom.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/pvSSjIsNgXJoRYZZ0wTjXBAGEGZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-12-15","episode_number":42,"episode_type":"standard","id":1331238,"name":"The Trappers","overview":"","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/zF4BZUhwLPuzjIxC3KALhLRnaCc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-02","episode_number":43,"episode_type":"standard","id":1331239,"name":"The Revenge of the Daltons","overview":"Lucky Luke catches traveling performer Otto abusing his hypnotizer skill for theft. He's jailed with the Daltons, who convince him to escape together, form a robbery gang and take revenge on Lucky. Otto hypnotizes a whole town, but Lucky remembers some cancel and other commands. Otto resorts to hypnotizing his own side, with weird side-effects, and Averill learned the skill.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/uDWtYgF8Me99FKoe3xk5Icj1KT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-09","episode_number":44,"episode_type":"standard","id":1331240,"name":"The war of the Docs","overview":"Lucky arrives as travel companion of qualified Chinese doc Li Ping Ping in mine town Diggers Point. There teacher Vicky had cornered the medical market, which is also claimed by peddler quack Dr Toxys. Luke accepts to serve as exemplary patient for both Li's acupuncture and Vicky's Western medicine, which attracts customer, Luke helps prove the quack's malice and disprove his attempt to discredit both rivals. When the mine collapses, all medical help is needed, and the cause of the epidemic found.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/sN5fdjE4Vfh7IeORoONuvKJlMxx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-16","episode_number":45,"episode_type":"standard","id":1331241,"name":"The Daltons Against Billy the Kid","overview":"When (young) Billy the Kid is jailed in the same prison as the Daltons, both legends escape. They are hell-bent to outdo the rival, and foremost to get Lucky's scalp, even ignoring rich preys along their respective paths. Lucky manages to play them against each-other and jails all five. But the locals are so into betting on various sides that they decide to free all crooks. In this way they can continue the ultimate contest for the worst Wild West criminal, in which their respective supporters intervene.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/qP1PwaWyEJ7dPiFPfoOiAEEZYPQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-23","episode_number":46,"episode_type":"standard","id":1331242,"name":"Crown Witness","overview":"A judge requires Lucky to escort New York zoology professor, Oscar Tinyboots, a snail expert, to St. Bob, Kansas. He's the star witness against Smiley Laughter, having killed a protected animal. Smiley, a gangster, has never lost a trial because he has all the witnesses murdered. Oscar's bossy wife, Mimi, and Luke escort Oscar, first masquerading as soldiers. When the leave, the platoon commander tries to catch the deserters, so they venture into tribal Indian land. There the humble snail suddenly becomes vital.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/4RA99k9Gt8sZE4FwQpj71NLSls1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-30","episode_number":47,"episode_type":"standard","id":1331243,"name":"A Bone for the Daltons","overview":"During excavation work to connect the prison with Washington via underground cable, a Platfeet settlement and graveyard is discovered. Lucky has the work stopped while a famous archaeologist examines the site and both confirms and even claims it proves Indians and Europeans have a common ancestor. Alas the Indians find out and lay siege to the fort. The Daltons escape, but realizing the find is a treasure, Joe is determined to break back in and steal it before escaping again, but neither proves easy. The defense includes moving the whole prison, while the contractor has his own drastic 'solution', which pleases only Rataplan. Written by KGF Vissers","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/zr6yFKJZENbMly6On0xCg4iCUDx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-06","episode_number":48,"episode_type":"standard","id":1331244,"name":"The Great Nose of Talisman","overview":"A professor's archaeological dig finds a great Ancient king's tomb. On his way to Santa Fé University through Schnozzola (big nose) Indian territory with the mummy, which carries a legendary talisman, he attracts thieves and an undertaker, fascinated by the lost embalming technique. The Indians, descended from the king's people, believe the talisman brings a brave chief supreme power. They decide to seize it, but the medicine-man wants to rule himself- or not just him? Lucky Luke escorts the professor.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/6IQ1MBdVJ5uBZgGdHj27MAwklrn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-13","episode_number":49,"episode_type":"standard","id":1331245,"name":"The Dalton Soldiers","overview":"A US Colonel's daughter Kate -passed off for his wife- goes missing in Indian territory. Since nobody volunteers for a rescue mission, his friend President Grant allows him to recruit long-term prisoners - the Daltons have nothing to lose. Kate meanwhile had whipped the chief -ignorant of feminism's dangers- who consented to emasculate his tribe, but the 'rescue' mission goes on. The madness gets ever worse, Luke makes no difference.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/7E6CtEUK2LVtXF592fKN0u4U2ix.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-20","episode_number":50,"episode_type":"standard","id":1331246,"name":"The Return of Liki Liki","overview":"Black cattle farmer Meredith is arrested by the racist Dixie sheriff of Leek Gulch, who confiscates his beloved cow Josephine on account of an absurdly high fine. The governor grants him only the services of a Chinese marshal who only makes up for his miserable shooting and riding skills with his martial arts. These skills are no use in preventing both of them being pitched and feathered. So he hires an 'assistant': his old friend Lucky Luke, who sends for a judge. Meanwhile the trio faces the sheriff's family, entirely crazy and blood-thirsty (the grandpa is worst of all) apart for one son (the saloon keeper), but impatient idiot Meredith gets himself arrested as semi-accidental cattle thief. Written by KGF Vissers","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/1hiSNfAZCjwBT8C3WW2qj4YwQCH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-27","episode_number":51,"episode_type":"standard","id":1331247,"name":"Sequoia Bay","overview":"Washington decides to turn the building of a bridge over Sequoia Bay, in Indian territory, for the Transcontinental Railroad into a race between the proponents of steel and wood constructions. Lucky is to keep both rival teams safe, but the cheaters are each other's worse enemies, bidding anything to get the laborers on their side. Lucky learns from the Indians mother nature chased them.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/kYfQYUSI82pUqP5zo45zZlaF0je.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-04","episode_number":52,"episode_type":"finale","id":1331248,"name":"The Schoolmaster","overview":"After Congress declares the American republic can only become a great nation by schooling its people, Lucky saves a haughty, pedantic East coast teacher who immigrates to civilize the West and arrests three crooks who were robbing the teacher. The ignorant town-folk soon mistrust the hot-head educator. The local crime baron Jolly Potbelly forbids turning the saloon into a school for both adults and youth. Lucky stays as protector and armed truancy-fighter, but is ordered on the benches too as 'role model', later even as substitute.","production_code":"","runtime":22,"season_number":1,"show_id":62318,"still_path":"/h0tK5NCiciUKfriPxa3Olk1Atbj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Every hero must have a villain - and Lucky Luke has 4 - the Dalton brothers. Fortunately, he's faster to draw his revolver than his own shadow and he has a loyal friend in his horse.","id":65812,"poster_path":"/ahzsV1M8NegmvfTFZjnHlL8VcFA.jpg","season_number":1,"vote_average":8},"2":{"_id":"638795fefb83460099620a49","air_date":null,"episodes":[{"air_date":null,"episode_number":1,"episode_type":"standard","id":4081491,"name":"Episode 1","overview":"","production_code":"","runtime":23,"season_number":2,"show_id":62318,"still_path":"/sJT0RTX67fFMJcX1d34UJTDgiJO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":318160,"poster_path":"/svTOTzigXy9KpVDTAzsWd3UIecq.jpg","season_number":2,"vote_average":0}}}