{
    "adult": false,
    "backdrop_path": "/lUIrxz7HwqdBQwCzJYysdYy34uH.jpg",
    "created_by": [
        {
            "id": 1683243,
            "credit_id": "6637496869c70f012b807c4b",
            "name": "Stig Thorsboe",
            "original_name": "Stig Thorsboe",
            "gender": 0,
            "profile_path": null
        },
        {
            "id": 1683244,
            "credit_id": "6637496e66565a012615c4a5",
            "name": "Hanna Lundblad",
            "original_name": "Hanna Lundblad",
            "gender": 0,
            "profile_path": null
        }
    ],
    "episode_run_time": [
        50
    ],
    "first_air_date": "2013-12-30",
    "genres": [
        {
            "id": 35,
            "name": "Comedy"
        },
        {
            "id": 18,
            "name": "Drama"
        }
    ],
    "homepage": "https://play.tv2.dk/programmer/serier/drama/badehotellet",
    "id": 62474,
    "in_production": false,
    "languages": [
        "da"
    ],
    "last_air_date": "2024-04-28",
    "last_episode_to_air": {
        "id": 5204725,
        "overview": "The hotel has been taken over by strangers who want to completely change it. Is it a sign that an era has come to an end, or should one make one last attempt to save the place?",
        "name": "Coming home",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2024-04-28",
        "episode_number": 9,
        "episode_type": "standard",
        "production_code": "",
        "runtime": 56,
        "season_number": 10,
        "show_id": 62474,
        "still_path": "/m4fYbkin9I5KrO6MAf9YUXGLMF3.jpg"
    },
    "name": "Seaside Hotel",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 125,
            "logo_path": "/fft3jrctrZNcgAxgN1w5Givtzip.png",
            "name": "TV 2",
            "origin_country": "DK"
        }
    ],
    "number_of_episodes": 64,
    "number_of_seasons": 10,
    "origin_country": [
        "DK"
    ],
    "original_language": "da",
    "original_name": "Badehotellet",
    "overview": "At Andersen’s Seaside Hotel by the North Sea dunes, meet three young people as they try to emancipate themselves from the plans other people have made on their behalf.",
    "popularity": 150.545,
    "poster_path": "/2YrFeKSc23Glr9g3GSgOclEjizd.jpg",
    "production_companies": [
        {
            "id": 758,
            "logo_path": "/fft3jrctrZNcgAxgN1w5Givtzip.png",
            "name": "TV 2",
            "origin_country": "DK"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "DK",
            "name": "Denmark"
        }
    ],
    "seasons": [
        {
            "air_date": "2015-03-09",
            "episode_count": 6,
            "id": 176059,
            "name": "Specials",
            "overview": "",
            "poster_path": "/9YbKLVJTLbqrPA4S3OJEH0ME14B.jpg",
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2013-12-30",
            "episode_count": 6,
            "id": 66141,
            "name": "1928",
            "overview": "The setting is the small Andersens Hotel by the North Sea in the northernmost part of Jutland in the summer of 1928, where the hotel's wealthy summer regulars and the hard-working local employees reunite as they have done for many years. They look at life very differently, but every summer their worlds merge when they meet at the hotel, and here amid the sandy grass dunes there is room for hope, secrets and showdowns.",
            "poster_path": "/g6Xf7QzZbQTNZY68NuwuAFbGXH9.jpg",
            "season_number": 1,
            "vote_average": 5
        },
        {
            "air_date": "2015-01-12",
            "episode_count": 7,
            "id": 66142,
            "name": "1929",
            "overview": "A year has passed and it is the summer of 1929. The regulars are back in the expectation of being pampered again by Mrs. Andersen and her girls. But also new guests move in– two young men who are going to turn it all upside down. In addition, the son of the deceased hotel host returns home from America to settle the legacy of his father which means new challenges for the small hotel. Meanwhile, the maid Fie and the wholesaler's daughter Amanda are each trying in their own way to find love and gain a foothold in life. All the action threads come together in the last episode of the season, on a weekend in October 1929, as the New York Stock Exchange collapses and sends shock waves across the world.",
            "poster_path": "/azIpMrZAbWFxNOhdCBx5tFTj2Br.jpg",
            "season_number": 2,
            "vote_average": 4.9
        },
        {
            "air_date": "2015-12-28",
            "episode_count": 7,
            "id": 80383,
            "name": "1930",
            "overview": "In the summer of 1930 the crisis after the American Wall Street crash is beginning to spread to Europe. The usual guests have gathered to enjoy the summer and escape to cheerful holiday life, but behind closed doors,  reality is quite different. Wholesaler Madsen is bankrupt and fighting a desperate battle to get back in business. Count Ditmar struggles to preserve his marriage and to hide his homosexuality. Actor Weyse has a secret relationship with a young acting student, and manufacturer Frigh is awakened by the midlife crisis his wife had thought was under control. Everyone is preoccupied with their own concerns and they do not notice at all that there are big changes happening in nearby Germany.",
            "poster_path": "/pcjBQzhECfxxDHHno70rCj4mmBU.jpg",
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2017-01-23",
            "episode_count": 7,
            "id": 84860,
            "name": "1931",
            "overview": "The summer of 1931 heralds new times in the small hotel. After an illness, Mrs. Andersen has withdrawn a little and has left the day-to-day operations to Fie. The regulars move in for the summer, but new ones also arrive, and then the looming crisis of the 1930s moves ever dangerously closer and closer to the hotel.",
            "poster_path": "/xUWcPiJYOIHUsFIYvnHPuS3Gmx1.jpg",
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2018-02-12",
            "episode_count": 6,
            "id": 99441,
            "name": "1932",
            "overview": "The year is 1932 and the regulars have moved in to enjoy their holiday. But when a famous  Copenhagen couple gets involved in the action, nothing goes quite as usual. The fifth season in the company of hotel guests and staff brings a conclusion for many things. But also a new beginning.",
            "poster_path": "/tKy6i1vbp9CCS2VQG5CdgPLbWw.jpg",
            "season_number": 5,
            "vote_average": 1
        },
        {
            "air_date": "2019-01-28",
            "episode_count": 6,
            "id": 118313,
            "name": "1939",
            "overview": "Six years have passed and it is the summer of 1939. Dark clouds have been looming over Europe, but the regulars have gone on holiday once again. Amanda struggles to keep her small commercial film company alive, but she does not get much help from her sister Vera, a young lady with firm opinions. Mrs. Frigh has become the manager of the tobacco factory and has big plans for her adult son Leslie, but she has not taken into account the new maid Nana. Actor Weyse is trying to forget an embarrassing accident on stage this spring. And wholesaler Madsen hopes to be allowed to build in Nazi Germany, while Mrs. Fjeldsø tries to help her daughter-in-law's brother, the Austrian Jew Robert, who is on the run from the Nazis.",
            "poster_path": "/5Pd7DQ54pLJED55mF1ITBpFyx6d.jpg",
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2020-01-27",
            "episode_count": 6,
            "id": 142207,
            "name": "1940",
            "overview": "The seaside hotel opens for a new summer with Amanda as new owner. Denmark was invaded April 9. Previous years' guests come, partly to get away from the Germans. They all deal with problems from the German occupation.",
            "poster_path": "/50kSACbbX31nmDDrMfIGgN2AGDo.jpg",
            "season_number": 7,
            "vote_average": 0
        },
        {
            "air_date": "2021-02-01",
            "episode_count": 5,
            "id": 176058,
            "name": "1941",
            "overview": "It is 1941 and for the second summer in a row, World War II looms over the lives of those in Denmark. Edward Weyse, Georg Madsen and other regulars at Andersens Seaside Hotel find it harder and harder to ignore the war as manager Amanda Madsen opens the hotel's doors again for the new season.",
            "poster_path": "/9I0wSY4AKbfALSpVSKPO62xH1tg.jpg",
            "season_number": 8,
            "vote_average": 8
        },
        {
            "air_date": "2022-02-06",
            "episode_count": 5,
            "id": 197992,
            "name": "1945",
            "overview": "It is the summer of 1945 and the hotel opens again. Everyone is eager to enjoy liberation together, and finally peace has come, but is there really peace?",
            "poster_path": "/pfTa5TEx1y2MCpsQEIfjPoh8Cxf.jpg",
            "season_number": 9,
            "vote_average": 0
        },
        {
            "air_date": "2024-03-03",
            "episode_count": 9,
            "id": 381305,
            "name": "Season 10",
            "overview": "",
            "poster_path": "/qcSdHapLJSDlmQPzjee3tLdJMaF.jpg",
            "season_number": 10,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "Danish",
            "iso_639_1": "da",
            "name": "Dansk"
        }
    ],
    "status": "Ended",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 8,
    "vote_count": 26,
    "season_data": {
        "1": {
            "_id": "55388d00c3a3685f9b001015",
            "air_date": "2013-12-30",
            "episodes": [
                {
                    "air_date": "2013-12-30",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1055840,
                    "name": "A Summer by the North Sea",
                    "overview": "Merchant Madsen's 19-year-old daughter Amanda is planning to run away from her family's holiday and Madsen himself is at odds with one of the locals when he runs some chickens down. This year there is a new girl on the staff; 18-year-old Fie going to be a kitchen maid, but is immediately promoted by the hotel host. This arouses indignation from one of the other maids who decides to work against Fie.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 1,
                    "show_id": 62474,
                    "still_path": "/wfsMy9x50XhC1URrFXW32uQGVu7.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-06",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1055841,
                    "name": "Men's Visit",
                    "overview": "Amanda has a bet with her friend in Hornbæk about who first debuts sexually, so now she is quickly trying to find a man. Her father is more concerned with getting her married well and sees his chance, as a Count's family moves into the hotel. One of the maids has a nocturnal visit from a young man which is strictly prohibited and hotel host Julius Andersen is determined to find out which of the girls it is. Andersen's morals are less important when he sees his chance to look through the keyhole when the young girls bathe. And then Royal actor Edward Weyse is suddenly summoned to a secret rendezvous in the summer night.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 1,
                    "show_id": 62474,
                    "still_path": "/8Wnv7FOCndnT36jF6z0vahJmsrw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-13",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1055842,
                    "name": "Fatal Consequences",
                    "overview": "Fie dreams that her father has became ill and falls. She wants to leave her place as maid and go home, but it's not easy to tell Mrs Andersen or the young man Morten, who has been interested in her. Amanda has other plans. She is determined to win the bet over who is first with a man and does everything possible to get to a party at one of the big hotels in Skagen. Her father's interest in the young Count Ditmar gives her unexpected help. And then the hotel host gets an urge to look through keyholes, while the young girls bathe.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 1,
                    "show_id": 62474,
                    "still_path": "/4VSLZD0sOjJaSeVN91l78w0xSi5.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1055843,
                    "name": "The Storm is Raging",
                    "overview": "It has rained and stormed for two consecutive days and the guests are starting to get on each other's nerves at the Seaside Hotel. Weyse has an argument with the theater about the cast for next year, and Amanda will be persuaded to take a trip to Skagen with Count Ditmar. Mrs. Andersen must cope with the operation of the hotel alone, now that Mr. Andersen is in the hospital after the accident with the electricity, and it is quite a challenge for Molly Andersen, who has never had anything to do with the finances.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 1,
                    "show_id": 62474,
                    "still_path": "/aiZjtAthht7K9X3VrxLbm8SIM4N.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1055844,
                    "name": "Adventures in the Summer Night",
                    "overview": "The small seaside hotel prepares for Mr. Andersen's funeral, but not all the guests think it is compatible with a holiday. For Molly Andersen, it's a sudden challenge to bear the whole responsibility for the hotel. Can she manage both guests and girls, and will she be allowed to keep the hotel right after her husband's death? Fie helps where she can, but Morten does not make it easier for her, as he once again provokes merchant Madsen. Yet it will be a very special evening at Andersen seaside hotel, where a summer night turns out to lure guests to unfamiliar adventure. And not least the awkward bachelor Adam gets an unexpected experience.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 1,
                    "show_id": 62474,
                    "still_path": "/uic2WvUUhjjJuUcNx5qVjT9ic7G.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-10",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 1055845,
                    "name": "The End of the Season",
                    "overview": "Summer is coming to an end at the resort and guests are preparing for parting with the sweet holiday life. Fie is invited to stay for the winter, but is in doubt because of the relationship with Morten. Mrs. Fjeldsø makes a last desperate attempt to find a suitable match for her son Adam, while Weyse abandons his desperate hunt for Mrs Aurland and learns something new about women's psychology. Merchant Madsen sees through Count Ditmar, but still hopes that he will be his son-in-law. Everything is bright until Ditmar's tormentor suddenly shows up at the hotel and threatens to expose the young Count's past.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 1,
                    "show_id": 62474,
                    "still_path": "/wtfk2tqotK0nc3y7adIgss592RI.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "1928",
            "overview": "The setting is the small Andersens Hotel by the North Sea in the northernmost part of Jutland in the summer of 1928, where the hotel's wealthy summer regulars and the hard-working local employees reunite as they have done for many years. They look at life very differently, but every summer their worlds merge when they meet at the hotel, and here amid the sandy grass dunes there is room for hope, secrets and showdowns.",
            "id": 66141,
            "poster_path": "/g6Xf7QzZbQTNZY68NuwuAFbGXH9.jpg",
            "season_number": 1,
            "vote_average": 5
        },
        "2": {
            "_id": "55388e3f9251413f5a000f7d",
            "air_date": "2015-01-12",
            "episodes": [
                {
                    "air_date": "2015-01-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1055846,
                    "name": "Amanda's Choice",
                    "overview": "The summer of 1929. The regulars from Copenhagen are back at Andersens Badehotel by the North Sea. Wholesaler Madsen's daughter Amanda is also arriving after a trip abroad, which was arranged by her parents to get her away from an unfortunate romantic connection. The maid Fie looks forward to Amanda's arrival with mixed feelings. The Grosserer daughter is the only one who can help Fie's boyfriend, Morten, free from the accusation that has kept him on the run for a year. But will she? And then two young men move into the hotel laden with a gramophone and jazz records in search of adventure.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 2,
                    "show_id": 62474,
                    "still_path": "/xCC39ajTSlmIuqZ337UbMiUrlC7.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-19",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1055847,
                    "name": "The Big Feast",
                    "overview": "The hotel is turned upside down to get ready for Amanda and Count Ditmar's engagement party. There are high expectations, but not for Max, who has a great desire to see Amanda say yes to someone else. Molly Andersen has picked up extra help at Hotel Udsigten, but there is smoke in the kitchen, as it turns out that the borrowed maid Jenny has just married the cook Martha's boyfriend. Weyse tries new means in his attempt to seduce office manager Aurland's wife, while Amanda has to remind her father of what he promised in return for her engagement. And Fie finally sees Morten again after a whole year.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 2,
                    "show_id": 62474,
                    "still_path": "/5pnzon7JWtO0oEJdKvSqt6YDy74.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-02",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1055848,
                    "name": "The Son from America",
                    "overview": "Ten years after he left in anger, the late hotel landlord's son, Poul, returns home from America to end the inheritance case with Mrs. Andersen. The girls in the kitchen wonder what really happened between the serious young man and his father, and whether he has come now because he wants to take over the hotel. Amanda has put her father on ice until he keeps his part of the deal and acquits Morten, but then she suddenly discovers a secret that can solve the problem completely without the help of wholesaler Madsen. Mrs. Aurland is distraught over her relationship with actor Weyse and decides instead to seduce her husband.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 2,
                    "show_id": 62474,
                    "still_path": "/hBPSDNQHBtst2IOS9ERohXVHlsn.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-09",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1055849,
                    "name": "Love",
                    "overview": "Molly tries to borrow extra money for Poul's inheritance share, but gets \"no\" from the bank. When a buyer signs up to take over the hotel, Fie thinks it's time Poul knows what he's exposing Mrs Andersen to. The female guests are tired of their husbands' indifference and take a trip to Skagen, but the gentlemen prove to be fine to run a party without them. Morten returns home free of all charges, so Fie and he can finally be together. And Amanda and Max are caught in a thunderstorm, while little sister Vera and Miss Vetterstrøm try to get in touch with the deceased hotel host.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 2,
                    "show_id": 62474,
                    "still_path": "/u6N7JX6I8VX3n91Ri3W6izxVGZR.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-16",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1055850,
                    "name": "The Sales Agreement",
                    "overview": "Molly has been promised she can continue as a tenant and keep her girls, even if grocer Damgaard buys the hotel. However, it quickly turns out that the grocery couple does not have the purest flour in the bag. Mrs. Fjeldsø is shocked by a letter from her son in Sweden, so her sister Lydia must use unconventional means to find out what has happened. Madsen is gripped by stock fever after big gains in the American market, and Poul finally finds his youthful love. In the kitchen, things also happen when Edith gets an idea of how she and the other girls can prevent Mrs. Andersen from signing the grocer's sales agreement.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 2,
                    "show_id": 62474,
                    "still_path": "/ecpqReGJSG4MjWuG40DHB9WOkwH.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-23",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1055851,
                    "name": "The Hour of Truth",
                    "overview": "In the penultimate episode, summer sings the last verse, and it has become the hour of truth for both guests and staff at the small hotel. It's getting harder and harder for Morten to hide from Fie what he's making a lot of money on. Helene Aurland has to decide if she should tell her husband that the child she is expecting is not his but actor Weyse's. And Amanda and Max make plans for how they can meet after the holidays until the truth hits them too. Only Mrs. Fjeldsø is completely certain– she has been let down by her son Adam, and it is irreparable.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 2,
                    "show_id": 62474,
                    "still_path": "/930SFZZJIIxFPwCnvCH71SOWcKx.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-03-02",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 1055852,
                    "name": "The Storm",
                    "overview": "Madsen has made a splash on the New York Stock Exchange, so he and his wife rent the hotel to a private hunting party to celebrate a happy family event. Fie and Molly have been busy opening out of season and the girls are extraordinarily summoned. Amanda struggles with the melancholy of being back after breaking up with Max and finds a confidante in Fie, while the jealous actor Weyse fears he will get into an accident with his rival, office manager Aurland, in the middle of the hunt. But nothing goes as expected this October weekend in 1929, when it blows up into a violent storm.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 2,
                    "show_id": 62474,
                    "still_path": "/dEoGHp49jbMSp9sf4acccc7Nj8J.jpg",
                    "vote_average": 4,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "1929",
            "overview": "A year has passed and it is the summer of 1929. The regulars are back in the expectation of being pampered again by Mrs. Andersen and her girls. But also new guests move in– two young men who are going to turn it all upside down. In addition, the son of the deceased hotel host returns home from America to settle the legacy of his father which means new challenges for the small hotel. Meanwhile, the maid Fie and the wholesaler's daughter Amanda are each trying in their own way to find love and gain a foothold in life. All the action threads come together in the last episode of the season, on a weekend in October 1929, as the New York Stock Exchange collapses and sends shock waves across the world.",
            "id": 66142,
            "poster_path": "/azIpMrZAbWFxNOhdCBx5tFTj2Br.jpg",
            "season_number": 2,
            "vote_average": 4.9
        },
        "3": {
            "_id": "57e38e889251411dc1000f22",
            "air_date": "2015-12-28",
            "episodes": [
                {
                    "air_date": "2015-12-28",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1225395,
                    "name": "Amanda's Guests",
                    "overview": "It's summer again, and Mrs. Andersen and her girls open the beach hotel for a new season. It's 1930 and the world crisis is going on just outside the country's borders, but quite different things occupy the regulars. Wholesaler Madsen is struggling to get back on top after the bankruptcy last fall. Mrs. Aurland fears her husband will find out he is not the father of their newborn son. Amanda is back in her marriage to Count Ditmar, but still dreams of Max. And Weyse arrives in the company of a young acting student who turns out to be a girl with multiple talents.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 3,
                    "show_id": 62474,
                    "still_path": "/kkXzwYqgCKYKqMtbUKTEhxv7oYp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1225396,
                    "name": "Vagabonds",
                    "overview": "A vagabond who has news about the missing Morten is treated to beer and brandy at the hotel and manages to impress one of the girls in particular. After the funeral of the old Count, Amanda and Ditmar return to the hotel accompanied by Ditmar's mother, who begins to understand Amanda's relationship with Max. At the same time, visits are expected from two fine gentlemen to assess whether the young Count is suitable to take over his father's hereditary place in the Danish Parliament. Madsen is diligently trying to find financing for his new construction project, while manufacturer Frigh is becoming more and more preoccupied with Mr Weyse's young acting student, Miss Kitty Hansen.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 3,
                    "show_id": 62474,
                    "still_path": "/28iHsHqpjlMrwEpCnr86MS1049a.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1225397,
                    "name": "Mrs. Madsen's Jewelry",
                    "overview": "Madsen has pledged his wife's jewelery to raise capital for the new construction project which makes problems for their marriage, but Mrs. Madsen gets unexpected help when the secretive lawyer Kvist moves into the hotel. Amanda has moved in with Max in the summer cottage, but she's afraid that Ditmar will want financial support from her parents. Weyse does what he can to protect his young acting student Kitty Hansen from manufacturer Frigh's approaches, but must recognise that she is independent. Morten's old childhood home is suddenly sold, which gives Molly and Fie the opportunity to finally contact Morten.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 3,
                    "show_id": 62474,
                    "still_path": "/qVRyayzx0JW2TW9X6d9H1vSahoP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Inger",
                            "credit_id": "5e80906baf85de00145ff7cc",
                            "order": 500,
                            "adult": false,
                            "gender": 1,
                            "id": 1518801,
                            "known_for_department": "Acting",
                            "name": "Sidsel Siem Koch",
                            "original_name": "Sidsel Siem Koch",
                            "popularity": 4.068,
                            "profile_path": "/3jed0p49UNic41YEJJxKZhyoPFc.jpg"
                        }
                    ]
                },
                {
                    "air_date": "2016-01-25",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1225398,
                    "name": "The Castaway",
                    "overview": "Amanda and Ditmar have agreed on how to handle their pro forma marriage, but neither Ditmar's mother nor Max fully agree with that plan. Miss Vetterstrøm returns from Copenhagen, because she mistakenly believes that Mrs Fjeldsø is ill. The two sisters finally reconcile helped by a bottle of liqueur. Weyse is suddenly called to a meeting at the theater which has received an anonymous letter threatening his career. Fie's father moves into the small farmhouse where Morten lived which evokes old feelings in Fie, but the discovery of a naked man on the beach soon has her thinking differently.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 3,
                    "show_id": 62474,
                    "still_path": "/1LYhzm3TLzImPxouwSUsdKwNKtb.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Inger",
                            "credit_id": "5e80906baf85de00145ff7cc",
                            "order": 500,
                            "adult": false,
                            "gender": 1,
                            "id": 1518801,
                            "known_for_department": "Acting",
                            "name": "Sidsel Siem Koch",
                            "original_name": "Sidsel Siem Koch",
                            "popularity": 4.068,
                            "profile_path": "/3jed0p49UNic41YEJJxKZhyoPFc.jpg"
                        }
                    ]
                },
                {
                    "air_date": "2016-02-01",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1225399,
                    "name": "Stauning",
                    "overview": "Both Max and manufacturer Frigh suffer from the sorrows of love. Max because Amanda has put him on ice after he quarreled with Ditmar's mother. Frigh because the object of his longing, the young acting student Kitty Hansen, has returned to Copenhagen. But then the two gentlemen both receive a letter that creates renewed hope. Fie's father has moved into the homestead and is  discouraged over his sad fate. Mrs. Andersen tries to cheer him up. It succeeds beyond all expectations. And in the middle of it all, the hotel is suddenly visited by Prime Minister Thorvald Stauning himself.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 3,
                    "show_id": 62474,
                    "still_path": "/yDGbIFokAV8FvbBaBn73RcjPf6C.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-08",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1225400,
                    "name": "Putting the Cards on the Table",
                    "overview": "Manufacturer Frigh has visited Kitty in Copenhagen and decides to go back to the hotel to put his cards on the table. But how do you tell your wife that you're leaving her? Frigh seeks advice from actor Weyse who is most experienced in these matters. Meanwhile Max and wholesaler Madsen are impatiently waiting for an answer from the architectural competition that can start their business. For Mrs Aurland, on the other hand, the wait is over. If her husband as found out that he is not the father of their child, it is high time for her to talk it out with him, regardless of the cost. But then Weyse receives a long-awaited call that turns everything upside down.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 3,
                    "show_id": 62474,
                    "still_path": "/mKbF82mG4QTIva9RANQKzsdS5Gz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-15",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 1225401,
                    "name": "Footprints in the Sand",
                    "overview": "It's now autumn. Edward Weyse has been fired from the theater and makes a living playing piano for silent films in a cinema. He is approached by Amanda, who has got a job as an assistant to the self-absorbed and choleric film director Gerhard Flügelhorn, who offers Weyse a role in his new film. The hotel opens out of season so that the final scenes of the film can be recorded there in peace and quiet. Unfortunately, the rumour of this exciting event has reached the old guests, so suddenly the film crew is no longer alone. Mrs. Andersen has become ill and is staying with Fie's father who is sure she will be better off if she is told Morten her big secret.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 3,
                    "show_id": 62474,
                    "still_path": "/v9gDFsmwhmlsV4E22utCmpSGtLZ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "1930",
            "overview": "In the summer of 1930 the crisis after the American Wall Street crash is beginning to spread to Europe. The usual guests have gathered to enjoy the summer and escape to cheerful holiday life, but behind closed doors,  reality is quite different. Wholesaler Madsen is bankrupt and fighting a desperate battle to get back in business. Count Ditmar struggles to preserve his marriage and to hide his homosexuality. Actor Weyse has a secret relationship with a young acting student, and manufacturer Frigh is awakened by the midlife crisis his wife had thought was under control. Everyone is preoccupied with their own concerns and they do not notice at all that there are big changes happening in nearby Germany.",
            "id": 80383,
            "poster_path": "/pcjBQzhECfxxDHHno70rCj4mmBU.jpg",
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "589c613dc3a36874ce0047b2",
            "air_date": "2017-01-23",
            "episodes": [
                {
                    "air_date": "2017-01-23",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1266758,
                    "name": "Midsummer Night",
                    "overview": "It's summer of 1931 by the North Sea. Newspapers are full of reports of bankruptcies and world crisis, but that does not stop the Copenhagen regulars from being back at the small hotel where Fie has taken over the day-to-day management. The maid Edith is sure that Fie is dreaming of something completely different, so she allies herself with the spiritual Miss Vetterstrøm to find out. Actor Weyse is riding a wave of success in the world of film and, in order to be at peace, has informed the press that he is on holiday on Lake Garda which he bitterly regrets when his mortal enemy from the theater, Sophus Poulsen, moves in, accompanied by Weyse's ex-wife.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 4,
                    "show_id": 62474,
                    "still_path": "/jWQnkPgjTKykRQ7YW8r96sqwnlT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Baby Severin",
                            "credit_id": "66197bad109cd0017ea3c59f",
                            "order": 501,
                            "adult": false,
                            "gender": 2,
                            "id": 3885475,
                            "known_for_department": "Acting",
                            "name": "Emil Sølvhøj",
                            "original_name": "Emil Sølvhøj",
                            "popularity": 1.444,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2017-01-30",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1266759,
                    "name": "Weyse's Curse",
                    "overview": "Fie's younger sister Ane shows up, fired by the vicar's wife. She starts working at the hotel but makes many mistakes. Amanda finally lures Max over to the hotel, where Weyse is being driven mad by the actor couple Bette and Sophus Poulsen, who have taken over the entertainment. Since these two tormenting spirits are going to stay all summer, higher powers must be taken to help. Wholesaler Madsen still wants Count Ditmar's lucrative properties in Copenhagen and is fighting desperately to find the money before Ditmar has time to sell to another party. But then Ditmar's German cousin Mitzi arrives in along with Ditmar's mother, who has her own plans for the visit.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 4,
                    "show_id": 62474,
                    "still_path": "/edSHRBK85Yx60v6XQmXCajvR8E.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-06",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1266760,
                    "name": "A Madhouse",
                    "overview": "Fie's younger sister Ane is lovesick after hearing Jesper play at Hotel Udsigten, but Fie will not let her see him. Ane makes plans anyway, which puts Edith in a bit of a pickle. Weyse has been offered the role of his dreams that may return him to the Royal Theater in triumph, but during rehearsal he is distracted by a scantily dressed Mrs. Aurland. Meanwhile Madsen does business with Morten.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 4,
                    "show_id": 62474,
                    "still_path": "/4KC8dryntJydLOOujyFSWCg07vj.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Baby Severin",
                            "credit_id": "66197bad109cd0017ea3c59f",
                            "order": 501,
                            "adult": false,
                            "gender": 2,
                            "id": 3885475,
                            "known_for_department": "Acting",
                            "name": "Emil Sølvhøj",
                            "original_name": "Emil Sølvhøj",
                            "popularity": 1.444,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2017-02-13",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1266761,
                    "name": "The Holiday Child",
                    "overview": "Mrs. Frigh finally gets some company when her daughter Bertha and the governess arrive from Copenhagen. At the station, they meet a poor boy whose story miraculously brings Mrs. Frigh into contact with a sympathetic widower. Ms. Vetterstrøm vividly dreams that the great love of her early life will move into the hotel. And Mr Aurland has traveled to Copenhagen for a radio debate with the Nazi-enthusiastic leader Knabstrup, so Mrs Aurland needs Weyse to look after Severin, which has an unexpected effect on the self-absorbed actor.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 4,
                    "show_id": 62474,
                    "still_path": "/1dIXkA2JLZSxLOEbaFBgdr5evsu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Baby Severin",
                            "credit_id": "66197bad109cd0017ea3c59f",
                            "order": 501,
                            "adult": false,
                            "gender": 2,
                            "id": 3885475,
                            "known_for_department": "Acting",
                            "name": "Emil Sølvhøj",
                            "original_name": "Emil Sølvhøj",
                            "popularity": 1.444,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2017-07-31",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1343793,
                    "name": "A Piece of Cake?",
                    "overview": "Two of the maids have become lethargic, so in the kitchen there is a fear that it is food poisoning and that some of the guests may also be affected. Amanda is close to landing a job with advertising director Holger Scharff, so she and Max are invited on a gusty sailing trip with the director. Madsen has set lawyer Kvist to dig into Morten's past and is impatiently waiting for the answer, while Weyse and Mrs. Aurland realize that the next step in the plan for a little sibling to Severin is to seduce her husband. It turns out to be harder than expected, as memories of Adolf Hitler have deprived the office manager of any desire.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 4,
                    "show_id": 62474,
                    "still_path": "/xhnmL4PrtlafigE0hDrXgVJN3Ql.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Baby Severin",
                            "credit_id": "66197bad109cd0017ea3c59f",
                            "order": 501,
                            "adult": false,
                            "gender": 2,
                            "id": 3885475,
                            "known_for_department": "Acting",
                            "name": "Emil Sølvhøj",
                            "original_name": "Emil Sølvhøj",
                            "popularity": 1.444,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2017-08-07",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2336894,
                    "name": "Cloudburst",
                    "overview": "A storm is threatening. but Madsen ignores this and has, to his family's surprise, arranged a full day excursion to Råbjerg Mile. Why? Ane knows she must tell her father that the date with Jesper has had consequences, but she fears her father's reaction. In her husband's absence, Mrs. Frigh is increasingly preoccupied with the local farmer, Arne Kokholm, while Mrs. Aurland becomes more and more careless in her secret relationship with Weyse. And then the sky finally opens its floodgates in a violent cloudburst that puts the hotel in chaos and brings both revelations and closer connections with it.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 4,
                    "show_id": 62474,
                    "still_path": "/xSHdU6DMu5zrqZBUzs8sY5hUUoL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Baby Severin",
                            "credit_id": "66197bad109cd0017ea3c59f",
                            "order": 501,
                            "adult": false,
                            "gender": 2,
                            "id": 3885475,
                            "known_for_department": "Acting",
                            "name": "Emil Sølvhøj",
                            "original_name": "Emil Sølvhøj",
                            "popularity": 1.444,
                            "profile_path": null
                        }
                    ]
                },
                {
                    "air_date": "2017-08-14",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 2336895,
                    "name": "For Sale",
                    "overview": "Summer is coming to an end, but sorrows and joys are far from over at the small hotel. Merchant Madsen receives a letter from the magistrate's construction department in Copenhagen, which sends him on an emotional roller coaster ride. Weyse and Mrs. Aurland wait in anxiety and excitement for Mr. Aurland's move, after he has guessed who Severin's father is. Mrs. Fjeldsø is discomposed by Dr. Ploug's surprising declaration of love, while Mrs. Frigh tries to find her balance after her husband has decided to follow the young Kitty Hansen to America. When Molly Andersen is called to an emergency meeting at the bank, it will also be a fateful hour for the hotel.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 4,
                    "show_id": 62474,
                    "still_path": "/hMUXtLZYRneY7IMEqGnUSMFRMCJ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": [
                        {
                            "character": "Baby Severin",
                            "credit_id": "66197bad109cd0017ea3c59f",
                            "order": 501,
                            "adult": false,
                            "gender": 2,
                            "id": 3885475,
                            "known_for_department": "Acting",
                            "name": "Emil Sølvhøj",
                            "original_name": "Emil Sølvhøj",
                            "popularity": 1.444,
                            "profile_path": null
                        }
                    ]
                }
            ],
            "name": "1931",
            "overview": "The summer of 1931 heralds new times in the small hotel. After an illness, Mrs. Andersen has withdrawn a little and has left the day-to-day operations to Fie. The regulars move in for the summer, but new ones also arrive, and then the looming crisis of the 1930s moves ever dangerously closer and closer to the hotel.",
            "id": 84860,
            "poster_path": "/xUWcPiJYOIHUsFIYvnHPuS3Gmx1.jpg",
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "5a85ba19c3a368637c02405a",
            "air_date": "2018-02-12",
            "episodes": [
                {
                    "air_date": "2018-02-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1433600,
                    "name": "The New Guests",
                    "overview": "It is the summer of 1932 and it has been a year since Morten gave Fie the hotel, but since then she has hardly seen him because he and Madsen are working on a large construction project in Copenhagen. But the regulars have turned up in large numbers. The Madsen family, Mr. Weyse, Mrs. Fjeldsø and her sister, and office manager Aurland with his wife and sons, as well as the Frigh family. Not Mr. Frigh, though. Because the couple is divorced she prefers him to stay away. In the middle of the idyll, the wealthy Copenhagen currency trader August Molin arrives with his Swedish wife, and Weyse is immediately captivated by Mrs. Molin which is a dangerous game because Mr Molin is fiercely jealous. And that's not the only secret Mr Molin is carrying.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 5,
                    "show_id": 62474,
                    "still_path": "/z6LjC9Tcqm4XQa9ygt0QA6xj76T.jpg",
                    "vote_average": 1,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-19",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1433601,
                    "name": "Ane's Secret",
                    "overview": "Wholesaler Madsen is close to completing the purchase of the cheap lumber that Molin has proposed to him. Meanwhile, Molin is desperately trying to hide that he is on the verge of bankruptcy and that the timber does not, as alleged, belong to one of his clients, but rather to himself, bought with the client's money but without his knowledge. At the same time, Molin has to make sure his beautiful wife stays away from actor Weyse. In return, good things happen for Amanda, who gets sold on an idea for a commercial featuring just Weyse. Meanwhile, manufacturer Frigh arranges a croquet tournament, Edith is put face to face with the man she once dreamed of, and Fie's little sister, Ane, demonstrates that secrets are not reserved for hotel guests.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 5,
                    "show_id": 62474,
                    "still_path": "/h53VkPzucLiYVm3VAIZ5KlkvFzj.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-26",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1947771,
                    "name": "All My Longings",
                    "overview": "The upscale currency trader August Molin has been hit by a nervous stomach because the sale of the Jutland building timber to Madsen is dragging on. Today is definitely the last chance if Molin's defrauding of a demented client is not to be revealed. Mrs. Alma Molin has been repressing the predicament the couple is in, and is looking forward to filming Amanda's commercial down on the beach. Weyse has also agreed to participate without knowing that the recordings will evoke emotions of a life that he thought was past. Finally, Valter tries Edith again, and office manager Aurland discovers Otilia's great interest in literature and comes up with a surprising suggestion for the sensible maid.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 5,
                    "show_id": 62474,
                    "still_path": "/gq7tHRiK8PrzaPNmuOthTFB2TCa.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-05",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1947772,
                    "name": "The Adder",
                    "overview": "Little Severin has been stung by a wasp, but Weyse is sure it's a viper, and thinks it requires action. Morten also wants action, after Madsen has arbitrarily bought Molin's Jutland building timber, but the meeting between the two partners goes differently than Madsen has feared. Meanwhile Edith has fallen head over heels in love which is intolerable for Otilia, who wants to feel the same tingle of bliss. There is a different peace between the Molin couple after the successful tree sale and the prospect of an even greater gain if they succeed in helping Frigh. Finally, Fie is faced with a difficult dilemma, when Miss Duelund in the hat shop discovers that Ane has lied to her.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 5,
                    "show_id": 62474,
                    "still_path": "/athPbuIktaGNQ1WhLAydj8Wfrbf.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-12",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1947773,
                    "name": "Visit From The South",
                    "overview": "Wholesaler Madsen is sure that Morten is out to cheat on him and sets a mildly reluctant Max to spy on him. With Ane and Fie, even bigger things are at stake, as Ane's newborn baby has been removed by Jesper's father and placed in an unknown orphanage. Fie realizes that only Jesper can help, but how does she find him? And then Count Ditmar's German wife, Mitzi, receives a visit from the south as her little brother and his Nazi friends make their entrance. Meanwhile, the power game continues between the Molin couple, who are finding it harder and harder to hide their crisis. And when the lady suddenly makes a surprising decision, it sets off an avalanche of love that spreads to several of the other guests.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 5,
                    "show_id": 62474,
                    "still_path": "/4RWwkN8wBQhu4iFgq4s4JLXpYjQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-19",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 1947774,
                    "name": "A Love Story",
                    "overview": "It's January 1933 and the hotel has long since closed for the season. But when wholesaler Madsen and manufacturer Frigh discover that two of their old friends have been secretly married, Fie is persuaded to open specially for a small surprise party. So all the regular guests defy both winter and political crisis and head to North Jutland. But what does the bride and groom think of the surprise? On this historic January day, when democracy is being tested in the great political settlement in the Prime Minister's apartment in Kanslergade at the same time as Hitler comes to power in Germany, a human drama is played out in the small seaside hotel about life, death and love.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 5,
                    "show_id": 62474,
                    "still_path": "/3YM2oRk1OHmki97sGMXGmAKUxcf.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "1932",
            "overview": "The year is 1932 and the regulars have moved in to enjoy their holiday. But when a famous  Copenhagen couple gets involved in the action, nothing goes quite as usual. The fifth season in the company of hotel guests and staff brings a conclusion for many things. But also a new beginning.",
            "id": 99441,
            "poster_path": "/tKy6i1vbp9CCS2VQG5CdgPLbWw.jpg",
            "season_number": 5,
            "vote_average": 1
        },
        "6": {
            "_id": "5c58975d9251410e246c9036",
            "air_date": "2019-01-28",
            "episodes": [
                {
                    "air_date": "2019-01-28",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1697156,
                    "name": "Welcome Home",
                    "overview": "In the summer of 1939, dark clouds are building over Europe. Despite this the regulars have arrived once again for their summer holiday at Anderson's Hotel.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 6,
                    "show_id": 62474,
                    "still_path": "/cVidFMMKuNd55kQVzLacLPK6pi4.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1697157,
                    "name": "A Happy Childhood",
                    "overview": "Leslie is fascinated by the maid Nana who saved him from drowning, and proposes a secret date. Weyse is taken back to his childhood by the psychologist who is treating his stage fright. Amanda is visited by Count Ditmar and Philip, who have significant news in their luggage. Mrs Andersen returns home from England with a surprising offer to Edith. And then Mrs. Fjeldsø experiences alarming news about her daughter-in-law's brother, the Austrian Jew Robert, who was rejected at the Danish border.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 6,
                    "show_id": 62474,
                    "still_path": "/t7q5O6t13JiN0sHrG08H0gSwvDs.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1697158,
                    "name": "The Stranger",
                    "overview": "Mrs. Fjeldsø's relative, the Austrian Jew Robert, escapes from a German concentration camp which gives rise to turmoil in the small hotel, where Madsen also is meeting with a German gentleman who is to help the wholesaler into the circle of the National Socialist leaders. Actor Weyse on the other hand, is more preoccupied with today's meeting with his psychologist, who has planned hypnosis to help him overcome his stage fright. Leslie discovers a new side of the maid Nana, while Amanda after her breakup with Max gets comfort from an unexpected direction.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 6,
                    "show_id": 62474,
                    "still_path": "/XfUphW6lRuYVHp4Eu1ev4x0cCf.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1713960,
                    "name": "New Plans",
                    "overview": "Merchant Madsen is near to the goal of his dreams - to be allowed to build in Germany, but what if the Nazis down there find out that his youngest daughter is helping to hide the illegal Jewish refugee, Robert? Meanwhile, Amanda faces a difficult choice– whether to risk her entire small company's finances to produce a big tourist film. Things begin to look better to actor Weyse, who finally overcomes his stage fright, though only to embark on an adventure he cannot overlook at all.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 6,
                    "show_id": 62474,
                    "still_path": "/wkTnrwTPMJjaswimmVvQsqrwgNz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1713961,
                    "name": "The Soldiers",
                    "overview": "After feeling adventurous with the young people for a few days, Weyse returns to the calmer environment of the hotel. But it will soon turn out that the troubles of the crisis-stricken actor have only just begun. Madsen, on the other hand, is delighted when he obtains Nazi approval to build in Germany. But the joy only lasts until he is faced with a deeply annoying question of conscience. Finally the hour of truth comes for Vera and her relationship with Robert. And Nana receives a visit from home that is going to turn everything upside down.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 6,
                    "show_id": 62474,
                    "still_path": "/e1nn58CSYt4fXQl9Rhf1GAobYRU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-04",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 1713962,
                    "name": "A New Beginning",
                    "overview": "Weyse returns from the hospital, but has to dig deep into his bag of bad excuses when his wife shows up and asks about his missing wedding ring. Nor does Madsen have the easiest time on earth if he is to both preserve his marriage and land the agreement with Germany. Many threads have to be sorted out near the end of the season, as Vera must admit that it will require extra ingenuity if Robert is to get to Sweden safely and where Amanda finally finds her way to a new beginning.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 6,
                    "show_id": 62474,
                    "still_path": "/n7b0jqu2CTWfcpOUjzwjftJIiDh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "1939",
            "overview": "Six years have passed and it is the summer of 1939. Dark clouds have been looming over Europe, but the regulars have gone on holiday once again. Amanda struggles to keep her small commercial film company alive, but she does not get much help from her sister Vera, a young lady with firm opinions. Mrs. Frigh has become the manager of the tobacco factory and has big plans for her adult son Leslie, but she has not taken into account the new maid Nana. Actor Weyse is trying to forget an embarrassing accident on stage this spring. And wholesaler Madsen hopes to be allowed to build in Nazi Germany, while Mrs. Fjeldsø tries to help her daughter-in-law's brother, the Austrian Jew Robert, who is on the run from the Nazis.",
            "id": 118313,
            "poster_path": "/5Pd7DQ54pLJED55mF1ITBpFyx6d.jpg",
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "_id": "5e305ecc98f1f10012fe3c4d",
            "air_date": "2020-01-27",
            "episodes": [
                {
                    "air_date": "2020-01-27",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2064256,
                    "name": "No Germans Here",
                    "overview": "The summer of 1940 and war in Europe. Amanda has taken over the hotel and welcomes guests; because even though the Germans have occupied the country, holidays must be taken.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 7,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-03",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2064319,
                    "name": "Cooperation",
                    "overview": "Molin returns from Berlin with a very tempting offer to Madsen for a new collaboration with the Germans. But is it wise now that Denmark is occupied?",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 7,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-10",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2164663,
                    "name": "Summer, Sea and Sunshine",
                    "overview": "Weyse suddenly gets a brilliant idea of how he can avoid performing for the Germans. But unfortunately, German Lieutenant Kiessling is also a man of ideas.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 7,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-17",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2164664,
                    "name": "Singing and Vandalism",
                    "overview": "Weyse rehearses his role for 'Vandalism' with the anti-Nazi Gerhard Flügelhorn, at the same time as he feverishly tries to hide what he has done for the Germans in Skagen.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 7,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-24",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2164665,
                    "name": "A Gentleman from Copenhagen",
                    "overview": "Leslie comes to talk his rebellious sister to reason, while their mother, Mrs. Frigh, waits impatiently for Johan Ramsing to return from Copenhagen.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 7,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-02",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 2743160,
                    "name": "Obsessed",
                    "overview": "When Amanda rejects the German lieutenant's approaches, it sets in motion a chain of events that is going to turn things upside down on all levels.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 7,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "1940",
            "overview": "The seaside hotel opens for a new summer with Amanda as new owner. Denmark was invaded April 9. Previous years' guests come, partly to get away from the Germans. They all deal with problems from the German occupation.",
            "id": 142207,
            "poster_path": "/50kSACbbX31nmDDrMfIGgN2AGDo.jpg",
            "season_number": 7,
            "vote_average": 0
        },
        "8": {
            "_id": "5ffc2f9b0c1255003ef60260",
            "air_date": "2021-02-01",
            "episodes": [
                {
                    "air_date": "2021-02-01",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2698628,
                    "name": "We're Not Talking About That",
                    "overview": "It's 1941 and the Germans have seized the neighboring hotel, but that does not keep the regulars away. As Weyse says: \"If we just pretend they are not there, then they are not there\".",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 8,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-02-08",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2701252,
                    "name": "Chocolate and Whipped Cream",
                    "overview": "Amanda manages to get the barbwire off her beach but only by making a compromise. Weyse's memoirs suffer from writer's block. Claus reveals himself to Bertha. Alice and Bertha fetch the mysterious bag.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 8,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-02-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2714679,
                    "name": "The Letter",
                    "overview": "Weyse thinks he has found the right person to write his memoirs for him. But sometimes you get more help than you have asked for. Madsen mails a letter for a German soldier.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 8,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-02-22",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2754811,
                    "name": "Something for Something",
                    "overview": "Amanda welcomes the Molin couple, but she also ends up in a dilemma as she receives a small gift from Lieutenant Kiessling and is forced to lie to the guests.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 8,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-03-01",
                    "episode_number": 5,
                    "episode_type": "finale",
                    "id": 2754812,
                    "name": "The Mine",
                    "overview": "A detached German sea mine is washed ashore near the hotel; the beginning of a dramatic end for all of the guests' summer holiday.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 8,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "1941",
            "overview": "It is 1941 and for the second summer in a row, World War II looms over the lives of those in Denmark. Edward Weyse, Georg Madsen and other regulars at Andersens Seaside Hotel find it harder and harder to ignore the war as manager Amanda Madsen opens the hotel's doors again for the new season.",
            "id": 176058,
            "poster_path": "/9I0wSY4AKbfALSpVSKPO62xH1tg.jpg",
            "season_number": 8,
            "vote_average": 8
        },
        "9": {
            "_id": "60b9d4c018b75100296f159b",
            "air_date": "2022-02-06",
            "episodes": [
                {
                    "air_date": "2022-02-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3486527,
                    "name": "It's been a long, long time",
                    "overview": "May 1945. Amanda is back at the hotel with her daughter, and soon both staff and regulars will arrive. Among others, Mrs. Fjeldsø and her Swedish granddaughter.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 9,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3486528,
                    "name": "Frida",
                    "overview": "Mrs. Fjeldsø tries to keep to keep Sarah away from Mr. Weyse, and Mrs. Frigh gets an admirer. Ditmar is back, and then a sign of life from Mrs. Knudsen gives Amanda hope.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 9,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3486529,
                    "name": "Dametur",
                    "overview": "Helene Weyse is tired of her husband's preoccupation with Sarah and invites Mrs. Frigh on an outing with surprises. The Molin couple make their entrance into the hotel.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 9,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3486530,
                    "name": "Weyse has had enough",
                    "overview": "Weyse is despairing that his unknown daughter has put him on ice, while Helene gets another invitation to Skagen. At last Amanda gets news from Germany.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 9,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-06",
                    "episode_number": 5,
                    "episode_type": "finale",
                    "id": 3486531,
                    "name": "Parting and Reunion",
                    "overview": "Much must be achieved before guests can travel home. Weyse makes a startling statement, and Amanda is impatiently waiting for news. Ditmar is ready to address editor Bruun's case.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 9,
                    "show_id": 62474,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "1945",
            "overview": "It is the summer of 1945 and the hotel opens again. Everyone is eager to enjoy liberation together, and finally peace has come, but is there really peace?",
            "id": 197992,
            "poster_path": "/pfTa5TEx1y2MCpsQEIfjPoh8Cxf.jpg",
            "season_number": 9,
            "vote_average": 0
        },
        "10": {
            "_id": "65de49999ae613018675d007",
            "air_date": "2024-03-03",
            "episodes": [
                {
                    "air_date": "2024-03-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 5177494,
                    "name": "Hjemve",
                    "overview": "Summer 1946. Guests and employees are back at the hotel. Madsen meets a wealthy Danish-American and immediately sees the chance for profit. Weyse is lured into a trap by the theater, but his wife has no time to help him. And Amanda misses her beloved Uwe, whom she has not been allowed to see for a year.",
                    "production_code": "",
                    "runtime": 49,
                    "season_number": 10,
                    "show_id": 62474,
                    "still_path": "/bOKYVqhvcqswdVsSWNenBjbI73y.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 5204708,
                    "name": "No business like showbusiness",
                    "overview": "Madsen returns with Seerup determined to hold on to the rich Danish-American long enough to land a deal. Helene gets to work with her mailbox.",
                    "production_code": "",
                    "runtime": 49,
                    "season_number": 10,
                    "show_id": 62474,
                    "still_path": "/llRtH1nuTVlYBVwAATr2Z94E3qp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 5204710,
                    "name": "Secrets",
                    "overview": "Otilia tries to get Aurland away from the gloomy reading, and Kitty gets Weyse up in the red field. And then the hotel's best-kept secret is revealed.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 10,
                    "show_id": 62474,
                    "still_path": "/yTDEVWdY8Y4N90g53MbRm83oJgQ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 5204713,
                    "name": "Rain, rain, rain",
                    "overview": "Madsen is expecting a visit from Seerup and his distinguished wife. Mrs. Frigh and Mrs. Madsen help Mrs. Weyse with the mailbox, and then a guest from the past moves in.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 10,
                    "show_id": 62474,
                    "still_path": "/fpEqlfNmIq8cOKr1fggA8WTmPmF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-31",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 5204715,
                    "name": "Modstand og håb",
                    "overview": "Amanda is pressured by the hotel's suppliers, and Weyse is pulled over for a plan he has forgotten all about. And then Mrs. Ellinor Seerup gets off wrongly.",
                    "production_code": "",
                    "runtime": 51,
                    "season_number": 10,
                    "show_id": 62474,
                    "still_path": "/tqh2w3xq1koTdfSttygcLQbIaTc.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-04-07",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 5204717,
                    "name": "Buying, selling and Rosita",
                    "overview": "Amanda has to give up the hotel if she and Frida are to have a future with Uwe. Weyse has given the theater a shock, and Madsen gets his deal with Seerup.",
                    "production_code": "",
                    "runtime": 51,
                    "season_number": 10,
                    "show_id": 62474,
                    "still_path": "/5DYiGAufDyyfbVIWij7aRaiD2df.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-04-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 5204721,
                    "name": "Small changes",
                    "overview": "Seerup wants to preserve the hotel as it is, but he has forgotten something. Madsen and Weyse get an offer from Ødegaard Andersen, and Otilia receives a letter from her priest.",
                    "production_code": "",
                    "runtime": 50,
                    "season_number": 10,
                    "show_id": 62474,
                    "still_path": "/uPsAai7hkfyMF3F44HkDjlgGPqX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-04-21",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 5204723,
                    "name": "If you want the rainbow",
                    "overview": "Ellinor Seerup's hotel plans take hold, and everyone directs their anger at Madsen. Weyse fears failure and tries to get out of the agreement with the theater.",
                    "production_code": "",
                    "runtime": 51,
                    "season_number": 10,
                    "show_id": 62474,
                    "still_path": "/oSWeheeSGakqIZO8QV3rDHSiJNv.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-04-28",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 5204725,
                    "name": "Coming home",
                    "overview": "The hotel has been taken over by strangers who want to completely change it. Is it a sign that an era has come to an end, or should one make one last attempt to save the place?",
                    "production_code": "",
                    "runtime": 56,
                    "season_number": 10,
                    "show_id": 62474,
                    "still_path": "/m4fYbkin9I5KrO6MAf9YUXGLMF3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 10",
            "overview": "",
            "id": 381305,
            "poster_path": "/qcSdHapLJSDlmQPzjee3tLdJMaF.jpg",
            "season_number": 10,
            "vote_average": 0
        }
    }
}