{"adult":false,"backdrop_path":"/n9qvs8UTmht93Y8hZQdiU4Rb6NF.jpg","created_by":[],"episode_run_time":[22],"first_air_date":"2013-04-16","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.hgtv.com/shows/flip-or-flop","id":62618,"in_production":false,"languages":["en"],"last_air_date":"2022-03-17","last_episode_to_air":{"id":3529510,"name":"Spanish Lessons","overview":"Tarek and Christina take on a huge project with an elaborate Spanish design that has proven to be difficult and costly in previous flips. They hope their past experiences will be enough to get everything just right and master this complicated style.","vote_average":0,"vote_count":0,"air_date":"2022-03-17","episode_number":14,"episode_type":"finale","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null},"name":"Flip or Flop","next_episode_to_air":null,"networks":[{"id":210,"logo_path":"/tzTtKdQ7vC2FkBvJDUErOhBPdKJ.png","name":"HGTV","origin_country":"US"}],"number_of_episodes":158,"number_of_seasons":10,"origin_country":["US"],"original_language":"en","original_name":"Flip or Flop","overview":"Tarek and Christina El Moussa buy distressed properties -- foreclosures, short sales and bank-owned homes -- remodel them and sell them at a profit. At least, that's the way it's supposed to work. Track the El Moussas' roller-coaster journey in each episode, beginning with a cash purchase at auction of a home -- often sight unseen -- and the fix-it-up process, to the nail-biting wait to find a buyer.","popularity":28.623,"poster_path":"/hgbymM0HJrXZVFHPCSXD6XmKkUo.jpg","production_companies":[{"id":181018,"logo_path":"/wk95YkRWUj4QHCoJ0RDCVk3qL23.png","name":"Pie Town Productions","origin_country":"US"}],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":"2018-09-13","episode_count":5,"id":194663,"name":"Specials","overview":"","poster_path":"/lGQSWKMftlXj4i8iJf5Zo3lHrAx.jpg","season_number":0,"vote_average":0},{"air_date":"2013-04-16","episode_count":15,"id":74864,"name":"Season 1","overview":"","poster_path":"/a6LYdvrKpkkShVTq2zEeSlbWHC7.jpg","season_number":1,"vote_average":0},{"air_date":"2014-04-08","episode_count":14,"id":75103,"name":"Season 2","overview":"","poster_path":"/lvP3xhy243aYdcnR5NIi0X7vBrp.jpg","season_number":2,"vote_average":0},{"air_date":"2014-10-07","episode_count":15,"id":66533,"name":"Season 3","overview":"","poster_path":"/bnZrwwFecmLwWzwXu3XhHvbN6k0.jpg","season_number":3,"vote_average":0},{"air_date":"2015-12-03","episode_count":15,"id":74863,"name":"Season 4","overview":"","poster_path":"/9TUvvtG5fpSpUa8sUCQqoYdkjTz.jpg","season_number":4,"vote_average":0},{"air_date":"2016-06-08","episode_count":15,"id":77666,"name":"Season 5","overview":"","poster_path":"/hO9bpRUnkCbHDowDgw5agW9Wthf.jpg","season_number":5,"vote_average":0},{"air_date":"2016-12-02","episode_count":17,"id":79980,"name":"Season 6","overview":"","poster_path":"/pFt0PS1buuoLKo6NvVZ8FGEgClw.jpg","season_number":6,"vote_average":0},{"air_date":"2017-06-16","episode_count":20,"id":82684,"name":"Season 7","overview":"","poster_path":"/a7eZzRysbMlco1O60vMg8EhLtP1.jpg","season_number":7,"vote_average":0},{"air_date":"2019-08-02","episode_count":18,"id":89599,"name":"Season 8","overview":"","poster_path":"/zSuKfxnRtpOemMhZiWE5UFyJTck.jpg","season_number":8,"vote_average":0},{"air_date":"2020-10-16","episode_count":15,"id":165844,"name":"Season 9","overview":"","poster_path":"/fyNYSxV14YFxJOTZwCRf63j87DZ.jpg","season_number":9,"vote_average":0},{"air_date":"2021-12-02","episode_count":14,"id":234184,"name":"Season 10","overview":"","poster_path":"/jMCrCDfFIIlK9QxoJM9jD6U3ZJB.jpg","season_number":10,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Reality","vote_average":6.2,"vote_count":24,"season_data":{"1":{"_id":"56cec6f59251413e5c001a27","air_date":"2013-04-16","episodes":[{"air_date":"2013-04-16","episode_number":1,"episode_type":"standard","id":1169137,"name":"The Foreclosure Heebie-Jeebies","overview":"Tarek and Christina put their life savings on the line at a foreclosure auction, and buy a house that they've never been inside, for $275,000. And now it's the moment of truth, as they walk through the door for the first time and find the house is a disaster. The kitchen, bathrooms and backyard all need a complete overhaul! But there's no turning back because foreclosures are sold as-is. So they start work on the flip and the rehab budget skyrockets to over 50K. With the flipping business at stake, Tarek and Christina feel the pressure to get the house completed before the housing market shifts beneath their feet. And the thought of failure gives them the foreclosure heebie-jeebies. Will Tarek and Christina Flip or Flop?","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-23","episode_number":2,"episode_type":"standard","id":1169127,"name":"Vandalized Foreclosure","overview":"Tarek and Christina have had their eyes on a short sale in Anaheim Hills for about a month, when suddenly it goes to foreclosure auction, so they jump on it for $430K. They arrive at the house for a walk through with their contractor and discover that the house has been vandalized! All the widows are broken, the hardwood floors are hammered, and there's graffiti and food all over the place! But worst of all, concrete was poured in the sinks, showers and toilets, destroying the plumbing in the house! Now their entire budget will be spent just fixing this damage, instead of doing the upgrades that would attract buyers. Will Tarek and Christina pull through this nightmare and flip this house? Or will this vandalized foreclosure sink their flipping business and make this a FLOP?","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-23","episode_number":3,"episode_type":"standard","id":1169135,"name":"Awkward Floor Plan","overview":"Tarek and Christina snoop a foreclosure in Yorba Linda, CA. After casing the property and looking through the windows, they're confident the house is in good shape. So they head to bid on the house at a foreclosure auction. During a high-voltage bidding war, Tarek and Christina spend $393K on the property, which is more than they planned. Tarek and Christina want to flip this house in 30 days, so they walk through their house with their contractor, Dan Messina. It has a very awkward layout, with the master bedroom located between the front door and the kitchen. But much worse, one of the bedrooms turns out to be an unpermitted loft conversion! They thought they were buying a 4-bedroom house, but it's actually a 3-bedroom house! If they have to market this house as a 3-bedroom, they will actually LOSE money and will have to write a check to sell the house. Are Tarek and Christina going to Flip or Flop?","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-23","episode_number":4,"episode_type":"standard","id":1169129,"name":"Double Trouble Flip","overview":"When Tarek and Christina see a 4-bedroom house in Garden Grove coming up for auction at a super low starting bid of $250K, they convince an investor that this is a good, cheap property to buy and flip. Tarek and Christina head to a foreclosure auction and buy the house sight-unseen for $280K. They meet their contractor Dan Messina for a walkthrough and realize the house is a major money pit. There is no master bedroom, a kitchen that needs a complete remodel, and a backyard that needs a complete re-haul, which includes fixing the pool and pool house. With the construction bid at 80K, this is the most they've ever spent on a flip. And when their investor Pete De Best stops in for a visit during construction, he begins to lose faith in the project. With their investor breathing down their necks, this double trouble flip has Tarek and Christina surfing the brink of disaster. Will they Flip or Flop?","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-30","episode_number":5,"episode_type":"standard","id":1169128,"name":"Underwater Flip","overview":"When Tarek and Christina see water damage in a home in Cypress they are looking to get, they are told that they cannot look into it further until they buy the house first.","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-30","episode_number":6,"episode_type":"standard","id":1169126,"name":"Spanish Style Salvage","overview":"Tarek and Christina see a 20's Spanish style home in Santa Ana. When they see that the home still has the original architecture, they try to determine if it is going to be worth it to flip the house.","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-07","episode_number":7,"episode_type":"standard","id":1914984,"name":"Inland Empire Cosmetic Nightmare","overview":"Tarek and Christina spot a large house in Ontario CA, going to auction for an opening bid 150K. But it's too far away to snoop and the auction starts in less than an hour. Based on comps, which are $240K-$260K, they take a leap of faith and head to the auction where they win the house for $180K. It's always nerve wracking to buy a house sight-unseen, but while walking through the house with their contractor, Dan Messina, it seems to be mostly cosmetic and can be done for 30K in 30 days. But after the work begins they find rotted wood, which leads to extensive termite damage. Will these termites destroy their budget to update the house? Will they be able to make the upgrades that will attract buyers? Or will they be forced to market this Inland Empire Cosmetic Nightmare as is.","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-07","episode_number":8,"episode_type":"standard","id":1169130,"name":"The Bungalow Gamble","overview":"Tarek and Christina get a lead on a bank-owned (REO) property that is a small 1920's craftsman bungalow in Whittier, CA. They are able to tour the house prior to making an offer, and discover it needs a complete overhaul. It may not be worth flipping. But there is a studio in the back that doesn't seem to be included in the square footage on the listing. If the studio is permitted, it would be a major selling point for potential owners, who might want to offset their mortgage with a renter. They check with the city and discover that it is in fact permitted. And the bank accepts their all cash offer of $182,000. They want to flip this house in 30 days so work begins right away. On Day 1 they discover that the lead paint on the house must be dealt with according to EPA standards at an unexpected cost of 12 thousand dollars! Day 2 and it's a broken water main, which once again destroys the budget! With their profit margin getting gouged, Tarek and Christina hold their breath to see if this bungalow gamble will Flip or Flop.","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-13","episode_number":9,"episode_type":"standard","id":1914985,"name":"Flop House Flip","overview":"After getting a great price on a home with a pool, Tarek and Christina El Moussa find out that it is going to require a complete rehab. They also discover that it is messy and disgusting inside.","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-14","episode_number":10,"episode_type":"standard","id":1169133,"name":"Facelift Flip","overview":"Tarek and Christina check out a short sale that's listed at $214,900, discounted a full 50% from the $430K currently owed on the house! Short sales can be great opportunities for house flippers because banks would rather take a loss on a house than foreclosing and having to sell it themselves. This house is a large 4 bedroom with a pool that appears to just need a facelift, and with comps in the area between $230,000 and $280,000, Tarek and Christina make an offer, which is accepted, for $200,000. They get a $30,000 bid from their contractor to update the kitchen, bathrooms, master closet and the pool, bringing them right to the lower end of their comps. But when they realize a back addition is unpermitted, the added costs may erase their profits, potentially leaving the facelift they planned on giving the house covered with red ink!","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-21","episode_number":11,"episode_type":"standard","id":1169131,"name":"A Flip With A View","overview":"Tarek and Christina decide to go big and invest in a Real Estate Owned, or banked owned, high-end hilltop home with a gorgeous view. They check their bank statements and realize that even after maxing out their credit cards, the only way they can cover the costs of rehab is to get Tarek's mother to invest by taking out a loan against her home equity. So, if they lose on this house, it will affect the whole family. Banking on the home's beautiful view, Tarek and Christina spend 20 thousand of their $50,000 rehab budget on landscaping, however, after they notice a crack in the foundation slab of the house, they realize that the home might be sinking down the hill along with their profits! With literally everything, and then some, invested, will this flip with a view have Tarek and his family sitting pretty, or tumbling down the hill towards bankruptcy?","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-21","episode_number":12,"episode_type":"standard","id":1169134,"name":"The Moldy Mess","overview":"After some intensive research on comps, Tarek and Christina find a promising 5 bedroom, 3 bath, house to flip in a family neighborhood of Bellflower, CA. When they tour the home with their contractor, Izzy, Tarek and Christina are thrilled to find a newly renovated kitchen and a dining room that just needs a coat of paint, however, their hopes, that the rest of the house will also be in turn-key condition, are quickly dashed when they discover that the upstairs master bathroom is covered in floor to ceiling mold. Considering the kitchen is in such good condition, Tarek and Christina decide that dealing with the mold remediation shouldn't ruin their remodel budget, and negotiate with the bank to secure the house for $385,000. But after they hire a mold inspector to run some tests, they discover they have toxic mold on their hands, which, not only is more expensive to treat than was expected, but will also take longer to fix. As they open up the walls to deal with the mold, they also find fire damage throughout the attic, and extensive termite damage throughout the house. With further delays and costs, all bets are off, as Tarek and Christina scramble to get this home renovated and on the market. Will cleaning up this moldy mess make them Flip or Flop?","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-28","episode_number":13,"episode_type":"standard","id":1169132,"name":"Keeping Up With The Joneses","overview":"Tarek and Christina follow up on a large family home in Fullerton, CA that is listed for $389,000. They tour the house with their contractor and discover that it will need extensive rehab. Not only will the interior need a full remodel, but the whole roof will also need to be replaced, multiple balconies will need to rebuilt from scratch, and the crumbling driveway needs to be entirely re-poured. However, it might be worth it because Tarek thinks a house this nice, in this area, will sell over $600,000, giving them potentially huge profit margins. But, the 1960's floor plan could seriously hinder its sale price. So Tarek and Christina check out a neighboring home with the identical floor plan that has been recently updated. They like it so much that they decide to replicate the house by opening up their kitchen and master bathroom walls. If they can modernize this mid-century home, it will appeal to a higher end buyer, but the scale of this remodel is pricey. So they cannot afford any unforeseen delays especially because they have to cover $600 a month in HOA fees themselves, until they can finish the rehab and sell the house. Will keeping up with the Joneses make them Flip or Flop?","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-16","episode_number":14,"episode_type":"standard","id":1169125,"name":"TO BE DELETED","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-21","episode_number":15,"episode_type":"finale","id":1169136,"name":"**TO BE DELTEED**","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":74864,"poster_path":"/a6LYdvrKpkkShVTq2zEeSlbWHC7.jpg","season_number":1,"vote_average":0},"2":{"_id":"56da0ed5925141210900002e","air_date":"2014-04-08","episodes":[{"air_date":"2014-04-08","episode_number":1,"episode_type":"standard","id":1173563,"name":"Foreclosure Shock","overview":"Bidding on a distant property without a preview.","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-15","episode_number":2,"episode_type":"standard","id":1173564,"name":"Hard Money Blues","overview":"Tarek and Christina get a lead on a listing in an upscale neighborhood of Whittier, California and although the entire home will need some serious updating from its original 1969 finishes, the renovation appears to be mostly cosmetic and comparable properties suggest great potential for profit. With all their money tied up in other flips, Tarek and Christina must secure a hard money loan to make an offer on the home; but that alone will cost them hundreds of dollars a day in interest and one never knows what budget-busting financial hazards could be lurking behind those popcorn-textured walls. Can their contractor renovate this big house in a small timeframe or will unforeseen problems leave the project a day late and a dollar short? Could this high-end home and its expensive loan leave Tarek and Christina singing the hard money blues?","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-22","episode_number":3,"episode_type":"standard","id":1173565,"name":"Nothing But Potential","overview":"Tarek and Christina come across a bank-owned listing which has been on the market for fewer than 24 hours and is only accepting offers until 5:00pm the very same day. It's a house with great potential and Tarek is ready to pounce, so they make an offer and the bank accepts. But as renovation rolls along to bring this home to its true potential, problems arise. As budgets crash through ceilings and deadlines continue to be pushed, could this latest flip turn out to be nothing but trouble, or will it prove it always had nothing but potential?","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-29","episode_number":4,"episode_type":"standard","id":1173566,"name":"Too Small to Fail","overview":"Tarek and Christina find a short sale home listed in Whittier, California that's rather small but the asking price of $275,000 looks enticing next to comparable properties in the area. With their own resources spread thinly across other flips, Tarek and Christina have only $300,000 to spend on the home and its renovation. Despite their rigid debt ceiling, they're convinced they can purchase and rehab the home within a strict budget. But as problems are discovered and the margins start getting tighter, Tarek and Christina hope they can turn a profit on this investment home that is too small to fail.","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-06","episode_number":5,"episode_type":"standard","id":1173567,"name":"Dirty, Dated and Undesired","overview":"Tarek and Christina spot a home listing online that's set for an auction that afternoon and based on neighborhood comps, the dirty and dated house looks like a bargain. By outward appearances, all it needs is an inexpensive cosmetic rehab. But after an unusual auction and a bevy of surprise issues, this dirty, dated and undesired home has quickly become more work than Tarek and Christina ever imagined.","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-13","episode_number":6,"episode_type":"standard","id":1173568,"name":"Unfinished Flip","overview":"Tarek and Christina are contacted by a cash strapped flipper who needs to unload a project house. With no bathrooms, no kitchen and nothing but plywood floors, exposed framing and piles of rubble, Tarek starts adding up the dollars required just to rehab the house.","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-20","episode_number":7,"episode_type":"standard","id":1173569,"name":"Flipper vs Flipper","overview":"Tarek and Christina get a lead on a short sale listing in Anaheim Hills that has just fallen out of escrow. The large home shows promise and with a heftier-than-usual price tag, Tarek and Christina will need financial help.","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-27","episode_number":8,"episode_type":"standard","id":1173570,"name":"A Barnyard Dance","overview":"Tarek and Christina come across an intriguing short sale listing in the desirable neighborhood of Torrance. The exterior is in good shape and the comparable properties indicate the house could be a good value; but once they tour the home it becomes immediately clear that a lot of work and a lot of money will be required to update this 1927 home. Convinced that there's a profit to be made here despite the numerous challenges, Tarek and Christina punch their dance card and purchase the property. Can Tarek and Christina navigate this renovation maze or will they live to regret taking this house out for a barnyard dance?","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-03","episode_number":9,"episode_type":"standard","id":1173571,"name":"Loud, Louder, Loudest","overview":"Christina receives an e-mail from an agent who has a listing in the South Bay neighborhood of Hawthorne. The dated house needs a lot of work and while it's situated on a busy street near an airport and a noisy elementary school, its attractive list price draws in Tarek and Christina. It's a challenge, but this total renovation is the kind of project they love to take on. That is until work begins and a multitude of hidden problems rise to the surface. Will Tarek and Christina's high hopes fall on deaf ears, or can they overcome this home's loud, louder, and loudest problems to turn a profit?","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-10","episode_number":10,"episode_type":"standard","id":1173572,"name":"A Neglected Flip","overview":"Tarek and Christina get a lead on a home in Anaheim, California that is being offered as a quick, all-cash sale with no inspections and no contingencies. This seems like a project that's right up their alley. But with a tenant still living in the property, Tarek and Christina can't see inside the home before deciding to make an offer and anything could be behind that front door. Will the unknown spell disaster or could a little tender loving care be all that's needed to reverse the woes of this neglected flip?","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-17","episode_number":11,"episode_type":"standard","id":1173573,"name":"Hilltop Hangup","overview":"Tarek and Christina come across a short sale listing in a desirable, hilly neighborhood of La Mirada, California. Although its price as compared to recent sales in the area leaves a tighter profit margin than they would like, the 1990s home is newer than the investment properties they typically buy and shouldn't need as much renovation as a result. With Tarek and Christina's usual contractor tied up by their growing roster of flip properties, they turn to a new contractor who comes recommended by fellow flippers. Will this newer home and new contractor make for a straightforward flip or could surprise costs and small mistakes leave Tarek and Christina risking a flop on this hilltop hangup?","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-06-24","episode_number":12,"episode_type":"standard","id":1173574,"name":"Ranch House of Ruin","overview":"Tarek and Christina come across a trust sale listing in Buena Park, California that looks very well-priced in comparison to recent sales in the area. After walking the home with their contractor and receiving a preliminary budget estimate, they're excited by the potential for profit. But as work begins and renovation costs rise on changing plans and hidden problems, their enticing profit margin appears to be on a downward spiral. Can Tarek and Christina rehabilitate this home into modern splendor or will mounting costs leave it to remain a ranch house of ruin?","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-01","episode_number":13,"episode_type":"standard","id":1173575,"name":"A Risky Flip","overview":"Tarek and Christina spot a listing that seems too good to be true, and as is often the case, the house doesn't exactly match the potential it had in the listing. But even with a major surprise in the details about the house, Tarek and Christina still see an opportunity for profit and embark on a fast flip with a new contractor. Will Tarek and Christina's gamble on this home and a new contractor pay off big profits or will this turn out to be nothing.","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-08","episode_number":14,"episode_type":"finale","id":1173576,"name":"Mid Century Flip","overview":"Tarek and Christina step out of their comfort zone when taking on an architecturally significant mid-century modern home.","production_code":"","runtime":30,"season_number":2,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":75103,"poster_path":"/lvP3xhy243aYdcnR5NIi0X7vBrp.jpg","season_number":2,"vote_average":0},"3":{"_id":"55493486c3a36841ab0004fe","air_date":"2014-10-07","episodes":[{"air_date":"2014-10-07","episode_number":1,"episode_type":"standard","id":1169110,"name":"Cracked Flip","overview":"Tarek and Christina come across a listing for a newer home in Yorba Linda, California that has great potential but has seen better days. The owner is motivated to sell quickly which could yield an enticing deal; but it also means Tarek and Christina won't have much time to inspect if they want to wrap up this investment property. The home is newer and will require mostly cosmetic fixes, but a series of cracks inside and outside have piqued Tarek and Christina's interest. Can they handle the problems hidden throughout this house or will they crack up before they can finish this cracked flip?","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-07","episode_number":2,"episode_type":"standard","id":1169111,"name":"Toxic Flip","overview":"Tarek and Christina take a calculated risk on a small house that's boarded up and in rough shape.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-14","episode_number":3,"episode_type":"standard","id":1169112,"name":"Custom Craftsman","overview":"A friend reaches out to Tarek and Christina looking to partner up on a craftsman-style home in a historic area of Santa Ana, Cal.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-21","episode_number":4,"episode_type":"standard","id":1169113,"name":"Abandoned Flip","overview":"A home that was abandoned in the middle of a massive do-it-yourself renovation catches the interest of Tarek and Christina.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-04-28","episode_number":5,"episode_type":"standard","id":1169114,"name":"Junk Yard Flip","overview":"Tarek and Christina spot an interesting property with an attractive backyard structure in Long Beach, California. Because the house is currently tenant-occupied, they must make their decision without the benefit of personally inspecting the property. Tarek and Christina make a deal to buy the property, but when they arrive as the new owners, they are shocked by what they find.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-05","episode_number":6,"episode_type":"standard","id":1059621,"name":"Pipe Dreams","overview":"Tarek and Christina come across a For Sale By Owner property in Garden Grove, California. This type of sale is always exciting for a flipper because it means no real estate agent commissions and an opportunity to negotiate a fair sale price. The house is in good shape and looks to need only cosmetic repairs and improvements.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-12","episode_number":7,"episode_type":"standard","id":1169115,"name":"Freeway Flip","overview":"Tarek and Christina find a well-priced fixer upper in Anaheim, Calif., but in spite of the character, historic homes hide unknown problems.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-19","episode_number":8,"episode_type":"standard","id":1169116,"name":"No Risk, No Reward","overview":"Despite their project manager's numerous concerns, Tarek and Christina take the plunge with an Anaheim, Calif., trust sale property.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-26","episode_number":9,"episode_type":"standard","id":1169117,"name":"Too Good To Be True","overview":"Tarek and Christina find a clean house in good shape that is aggressively priced in comparison to comparable properties in the area. It appears as good as advertised, so they quickly make an offer to snatch up this fast and simple cosmetic flip. But when they return as excited new owners a few days later, they are floored by what they discover.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-02","episode_number":10,"episode_type":"standard","id":1169119,"name":"A Flip With the Enemy","overview":"Being so busy, Tarek and Christina are very interested when a fellow flipper contacts them about partnering on a house, but they have to be careful not to give away their trade secrets while working together on budget and design.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-09","episode_number":11,"episode_type":"standard","id":1169120,"name":"Big Lot, Little Flip","overview":"Tarek and Christina find a small, rundown listing on a large lot in Buena Park, Calif., with a low asking-price.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-16","episode_number":12,"episode_type":"standard","id":1169121,"name":"The Money Pit","overview":"An offer is made sight unseen on a weathered home in Norwalk, Cal., which has the potential to turn into a money pit.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-23","episode_number":13,"episode_type":"standard","id":1169122,"name":"Thrifty vs. Glitzy","overview":"Tarek founds himself caught in the middle when working with Christina and a friend to flip a newer home in Orange, Cal., that needs some cosmetic updating.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-30","episode_number":14,"episode_type":"standard","id":1169123,"name":"A Dinky Flip","overview":"A small, outdated property in Downey, Cal., has the potential to be a fast, cosmetic flip, so Tarek pushes them to buy, but soon after the renovation begins they encounter problems and disagreements.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-07-07","episode_number":15,"episode_type":"finale","id":1169124,"name":"A Pig In A Poke","overview":"Tarek and Christina spot a trust sale in Fullerton, California that could either spell treasure trove or money pit.","production_code":"","runtime":30,"season_number":3,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":66533,"poster_path":"/bnZrwwFecmLwWzwXu3XhHvbN6k0.jpg","season_number":3,"vote_average":0},"4":{"_id":"56cec4bf9251413e620019fc","air_date":"2015-12-03","episodes":[{"air_date":"2015-12-03","episode_number":1,"episode_type":"standard","id":1169099,"name":"Of Wreck and Ruin","overview":"Tarek and Christina spot a home that's for sale by its owner in La Puente, California. It's in rough shape to say the least and because it's tenant occupied, they can't look inside. There's always a danger in purchasing a house sight unseen, but if they can get it for the right price, this home has the potential to pay off big time. Can Tarek and Christina right this sinking flip or could this home prove to be the stuff of wreck and ruin?","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-10","episode_number":2,"episode_type":"standard","id":1169100,"name":"Fun House Flip","overview":"Tarek and Christina get a tip on a short sale in Anaheim, California that has plenty of potential and is certain to attract investor interest. With only hours to determine if this could be their next flip, they meet their contractor at the house and are puzzled by what they find - a maze of barricaded windows and suspicious additions. Tarek and Christina know that if they're going to flip this house, they'll have to stick to the budget. Can they revive this family home or could tricky obstacles distort this fun house flip?","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-12-17","episode_number":3,"episode_type":"standard","id":1169101,"name":"Diamond in the Rough","overview":"Tarek and Christina spot a listing for a small home near the beach in Costa Mesa, California. The home is in rough shape and will surely require a lot of work to renovate, but it's in a desirable and eclectic neighborhood and properties in the surrounding beachside communities command top dollar. Can Tarek and Christina transform this house from the worst on the block to the showpiece by the beach, or could a ballooning budget prove this diamond in the rough to be a lump of coal?","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-07","episode_number":4,"episode_type":"standard","id":1169102,"name":"Abort Flip","overview":"Tarek and Christina purchase a house in Long Beach, California, and though they have only seen the house from the outside from a car, they take an educated risk knowing that properties in the area are selling for $100,000 above asking price.","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-14","episode_number":5,"episode_type":"standard","id":1169103,"name":"Big Money Flip","overview":"Tarek and Christina are contacted by an out-of-state seller looking to sell an old family home. It's a large house in original condition and could be a great flip. But it's also more expensive than their usual projects and the renovation could get pricey on this midcentury modern time capsule. Can Tarek and Christina turn a big money profit from this big money flip?","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-21","episode_number":6,"episode_type":"standard","id":1169104,"name":"Breaking Up","overview":"Tarek and Christina get a lead on a house in Torrance, California that is not only in rough shape, but also has known foundation issues. Right away it seems like this might be a bad buy; but Torrance is an exploding market and the land value alone could make this flip worth the risk. The house is going to need it all: good design, structural improvement, and careful renovation. It's a big project but it has the potential to be a big profit. Can Tarek and Christina transform this down and out home or could significant problems leave their budget and their profit margin on the verge of breaking up?","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-01-28","episode_number":7,"episode_type":"standard","id":1169105,"name":"Trickle Down Flip","overview":"Tarek and Christina get a lead on a home for sale in Chino, California that's rundown, overgrown, and in desperate need of cosmetic help. The price is fair and recent sales in the area show potential for profit. But right away there's a problem and Tarek and Christina are left wondering if this is an isolated issue or sign of what's to come. Will they turn a profit on this home or could mounting problems threaten to topple this trickle down flip?","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-04","episode_number":8,"episode_type":"standard","id":1169106,"name":"Boxed in Flip","overview":"Tarek and Christina scope out a house in Fullerton, Cal., that's in a good neighborhood and shows potential for profit, although it seems priced a little high for the area and they have to modify a cramped floor plan.","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-11","episode_number":9,"episode_type":"standard","id":1169107,"name":"Natural Disaster","overview":"Tarek and Christina are approached by an investor/friend who wants their help flipping a large home in an upscale, gated neighborhood.","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-18","episode_number":10,"episode_type":"standard","id":1169108,"name":"Dilapidated Flip","overview":"An abused property in Santa Ana, Cal., is transformed into a new family home.","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-02-25","episode_number":11,"episode_type":"standard","id":1169109,"name":"A Frantic Fiasco","overview":"A 1960s home is given a modern update.","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-03","episode_number":12,"episode_type":"standard","id":1173383,"name":"Million Dollar Flip","overview":"The couple finds a short sale listing for a large home in the upscale neighborhood of Yorba Linda, Calif.","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-10","episode_number":13,"episode_type":"standard","id":1173384,"name":"Pesky Flip","overview":"Tarek and Christina travel to Santa Ana, Calif., to check out an off-market listing, that appears to be in good shape.","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-17","episode_number":14,"episode_type":"standard","id":1176221,"name":"House of Hidden Horrors","overview":"","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-03-24","episode_number":15,"episode_type":"finale","id":1331413,"name":"A Family Friendly Flip","overview":"A longtime friend turns to Tarek and Christina for help flipping his family's home.","production_code":"","runtime":30,"season_number":4,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":74863,"poster_path":"/9TUvvtG5fpSpUa8sUCQqoYdkjTz.jpg","season_number":4,"vote_average":0},"5":{"_id":"5758ddd4c3a3687cb0000854","air_date":"2016-06-08","episodes":[{"air_date":"2016-06-09","episode_number":1,"episode_type":"standard","id":1198548,"name":"Down to the Studs","overview":"A house in disrepair is transformed into a modern home by Tarek and Christina in the Season 5 premiere.","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/aK6jekl8oGEIY1FuINNrAeoy3p1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-16","episode_number":2,"episode_type":"standard","id":1199998,"name":"Cat Nip Flip","overview":"Tarek and Christina are contacted by a realtor about an exciting new listing. So new, in fact, that the realtor doesn't even have keys yet. If Tarek and Christina want to buy this house, they'll have to do so sight unseen. The price is right and the profit potential is huge, but who knows what lurks behind that front door? Can Tarek and Christina stay on budget or will they be left clawing for profits on this cat nip flip?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/7LVmrEySVI1TIFVGYM5bizO5ILc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-23","episode_number":3,"episode_type":"standard","id":1199999,"name":"Old Time Flip","overview":"Tarek and Christina buy a turn of the century home in a historic Santa Ana, CA neighborhood. Old homes always present unseen problems throughout the process and this home is no exception. Can Tarek and Christina handle the issues that come along with renovating a century old home or will ancient issues come back to haunt them?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/wBAeDRVaf0B9bMkV1gLGQKxDGzB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-30","episode_number":4,"episode_type":"standard","id":1200000,"name":"Communal Flip","overview":"Tarek and Christina flip the worst home on the block in this Anaheim Hills neighborhood. With high profit margins in a desirable neighborhood this should be a slam dunk. Can Tarek and Christina renovate quickly or will a the strict HOA hold up this communal flip?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/ka8VbgR56c5htYke5ywBhyAIfJC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-07","episode_number":5,"episode_type":"standard","id":1331414,"name":"Fire Sale Flip","overview":"A homeowner in Costa Mesa, Cal., contacts Tarek and Christina about a great deal on a 1960s single-story home in a great neighborhood. But once they start working on the rehab, they immediately run into big-ticket issues that threaten their profits.","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/gWbnmbmfmUoLZ33R7lywDVVN5vb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-14","episode_number":6,"episode_type":"standard","id":1331415,"name":"New Flips, Familiar Faces","overview":"A run-down house in Corona, Cal., receives a modern makeover. But to get the job done, Tarek must enlist an old friend, while Christina is restricted to bed rest during her pregnancy.","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/hCwPf5ioaoYAWdoTJgFpGhV5fPw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-21","episode_number":7,"episode_type":"standard","id":1208778,"name":"Labor of Love","overview":"Tarek and Christina get a lead on home in Fullerton, CA which seems too good to be true. Upon arrival they see the house is riddled with cracks. Even with foundation repairs the profit margin is so large here it should be a good flip for them. With Christina close to having their baby, Tarek has his hand full with this one. Will they be able to rebuild this foundation from the ground up or will they watch as their profits disappear into this quicksand flip?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/p1UQq5TvR29FcpkX9iHZ32HklRg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-28","episode_number":8,"episode_type":"standard","id":1210115,"name":"Split at the Seams","overview":"Tarek gets contacted about a house on a desirable corner lot in Torrance, CA. Upon initial inspection it looks like a quick flip but then they see the house and foundation have cracks everywhere! Will Tarek and Christina be able to repair this home or will these splitting seams become a total rip off?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/tnrZHwRTw4NxYHA4Ki6oq83jjU9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-08-26","episode_number":9,"episode_type":"standard","id":1331417,"name":"Beachside Beauty","overview":"Tarek and Christina get a lead on a home in Torrance, California, that's just miles from the ocean and several upscale beach communities. The yard is small and tiered, but buyers in this area demand luxury and are willing to pay top dollar to get it. Tarek and Christina decide to pull out all the stops and make use of every inch of yard space to create an entertainer's dream fitting of its anticipated million dollar list price. Can they keep a lid on their budget or will this hillside spool wash away their profits?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/dPL9s8u2ErHuSc2Qb2E0RR2lh4C.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-02","episode_number":10,"episode_type":"standard","id":1331418,"name":"Split-Level Falls","overview":"Tarek and Christina get a lead on a split-level home in Long Beach, California. The style is unique among the other homes in the neighborhood and the small backyard is a ripe for creating classic California-style indoor/outdoor living. As work begins and the backyard starts to take shape, surprise interior costs threaten the overall budget. Can Tarek and Christina create a backyard beauty by the beach, or could design woes push them over the edge of this split-level falls?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/yQgZt5Giwsn5PJwVJs3nViWrYZN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-09","episode_number":11,"episode_type":"standard","id":1331419,"name":"Backyard Staycation","overview":"Tarek and Christina get a lead on a home in Riverside, California, with a massive backyard. It has great views and room to create a pool and outdoor living area fit for a five-star resort. The potential is there to make this the biggest backyard transformation they've ever done, but it won't come cheaply and they risk spending more than they can get back. Can Tarek and Christina create and reap the rewards of a resort-style backyard or could rising costs threaten to sink this backyard staycation dream home?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/o7ghvNxLt8qlT0LeoehuFBYa7nt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-16","episode_number":12,"episode_type":"standard","id":1331420,"name":"Pooling Value","overview":"Tarek and Christina find a large home in the desirable town of Cypress, California. They know they can make money on this flip, but the comparable sales indicate that an amazing backyard with a pool could bring even more profit in this family community. It'll cost a lot more than a standard flip to put in a pool and create an outdoor living space, but they decide it's worth the gamble. Can Tarek and Christina get top dollar for this entertainer's paradise, or could design and construction hiccups dry up the profits on this home's once pooling value?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/xcauZlfMXoQoiCVyoQaoU0CA1KL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-09-23","episode_number":13,"episode_type":"standard","id":1331421,"name":"Poolside Potential","overview":"Tarek and Christina are on the hunt for a summer project and find a unique home in Whittier, CA. With an old pool and a large backyard, this house has potential to be an entertainer's paradise. Taking on a backyard is a big challenge, but with big risks come big rewards. Can Tarek and Christina transform this home and reinvigorate its depressed pool, or could this project with poolside potential be in danger of circling the drain?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/9mhKBVB8TTnmyV6cKS5yc2DXaVg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-12","episode_number":14,"episode_type":"standard","id":1331422,"name":"Doll House Flip","overview":"Tarek and Christina are contacted by a homeowner in Garden Grove, California, about a house they want to quickly sell off the market. The house needs a lot of work, and has strange rooms everywhere which could spell disaster when trying to get permits. Can Tarek and Christina rebuild this dated house into a dream home, or will troubles threaten this doll house flip?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/cmwllqPhRcxbH85hmjJUuK5g9cZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-19","episode_number":15,"episode_type":"finale","id":1331423,"name":"Mid Century Miss","overview":"Tarek and Christina get a lead on a midcentury house in La Habra, CA, that is towards the top of a hill. The margin is tight on this home so they need to get in and out quickly to maximize profits. The neighborhood calls for high design and they need to deliver if they want to sell this house for top dollar. Will they be able to nail the design, or will this home be a midentury miss?","production_code":"","runtime":30,"season_number":5,"show_id":62618,"still_path":"/q1WvZe79K1aRqOvU0LORUalThRe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":77666,"poster_path":"/hO9bpRUnkCbHDowDgw5agW9Wthf.jpg","season_number":5,"vote_average":0},"6":{"_id":"57d0c16cc3a3684895002431","air_date":"2016-12-02","episodes":[{"air_date":"2016-12-02","episode_number":1,"episode_type":"standard","id":1331424,"name":"Hidden Potential","overview":"Tarek and Christina flip a house in Garden Grove, CA. They really have their work cut out for them on this one because not only is the house on a busy street but it is a mess! Have Tarek and Christina opened up a can of worms or does this flip have some hidden potential waiting to be uncovered?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-09","episode_number":2,"episode_type":"standard","id":1221237,"name":"Substitute Flip","overview":"Tarek gets contacted by his friend Pete DeBest who wants to go 50/50 on a smoking deal on a house in La Habra, CA. With the new addition of baby Brayden to the family they have their hand full. So while Christina is busy with Brayden, Tarek will team up with Pete to tackle this flip. Will the friendly duo be able to pull it off or will unforeseen problems sink this substitute flip?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-16","episode_number":3,"episode_type":"standard","id":1221230,"name":"Narrow Margin Flip","overview":"Tarek and Christina are contacted by their friend and fellow investor, Pete. He's already purchased a home in Anaheim, California and wants to bring Tarek and Christina in on what should be a quick flip for a modest profit. But as renovation begins, Pete's budget estimate goes out the window and this is starting to look less and less like a good buy. Can the trio save their investment on this narrow margin flip?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-23","episode_number":4,"episode_type":"standard","id":1221227,"name":"Fast Money Flip","overview":"Tarek and Christina check out a home with a tight profit margin in Whittier, California. The house is in good shape though, and it shouldn't take much time or money to transform this property. It's a risk, but as long as they stick to the schedule and budget they could turn a quick profit and move on to their next flip. Will it finally be smooth sailing on this project or will setbacks threaten Tarek and Christina's fast money flip?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-06","episode_number":5,"episode_type":"standard","id":1221234,"name":"Beached Bungalow","overview":"Tarek and Christina buy a charming bungalow home on the edge of a historic Long Beach, California neighborhood. Christina loves the period details and design while Tarek loves that the good condition of the interior could mean savings in the budget. Will Tarek and Christina be able to turn this home into a classic beauty or will this old house teach them a lesson.","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-13","episode_number":6,"episode_type":"standard","id":1331425,"name":"Doll House Flip","overview":"Tarek and Christina are contacted by a homeowner in Garden Grove, California, about a house they want to quickly sell off the market. The house needs a lot of work, and has strange rooms everywhere which could spell disaster when trying to get permits. Can Tarek and Christina rebuild this dated house into a dream home, or will troubles threaten this doll house flip?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-20","episode_number":7,"episode_type":"standard","id":1331426,"name":"Midcentury Miss","overview":"Tarek and Christina get a lead on a midcentury house in La Habra, CA, that is towards the top of a hill. The margin is tight on this home so they need to get in and out quickly to maximize profits. The neighborhood calls for high design and they need to deliver if they want to sell this house for top dollar. Will they be able to nail the design, or will this home be a midentury miss?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-27","episode_number":8,"episode_type":"standard","id":1331427,"name":"Addition and Subtraction","overview":"Tarek and Christina get a lead on a home in Garden Grove, California, that is in need of a major makeover. The house is small and needs a lot of work but it does have a large yard where they could add an extra bathroom or bedroom. Could an addition be the perfect solution to their problems or will it just end up subtracting from their profits?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-03","episode_number":9,"episode_type":"standard","id":1331428,"name":"Double Lot Limbo","overview":"Tarek and Christina get a lead on a house in Buena Park, California, that has a large lot behind it. This lot could mean extra profits if they are able to split and sell it separately from the house. The house poses its own problems with a strange layout and permit issues that could set the project back. Can Tarek and Christina take on this new challenge or will setbacks keep them in this double lot limbo?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-10","episode_number":10,"episode_type":"standard","id":1331430,"name":"Ready-to-Flip Ranch","overview":"Tarek and Christina are contacted by an owner in Anaheim, California, looking to sell their three bedroom, two bathroom home. These three bedroom, two bathroom houses are quick and easy to flip, exactly what they are looking for. Upon inspection the house looks good, but there is only one hiccup in their plan -- the second bathroom is only a half bathroom and it doesn't meet code. Will they be able to make this bathroom functional and keep the value of the home or will they have to lose a bathroom and some profit along with it","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-17","episode_number":11,"episode_type":"standard","id":1331431,"name":"Hot Market, Fast Flip","overview":"Tarek and Christina get a smoking deal on a house in an up-and-coming neighborhood of Garden Grove, CA. With not too much work to be done, this house should be quick flip for them. Can they keep this flip on schedule or will unpredictable problems douse this hot market flip?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-24","episode_number":12,"episode_type":"standard","id":1331432,"name":"Wishful Workshop","overview":"Tarek and Christina get a lead on a home in Garden Grove, California. They always do well in this neighborhood and see big potential with this house. When they go to check out the house there is a large workshop addition which could be a huge selling point for a buyer later on. Will this addition help sell this home once it's renovated or will permit issues bring down this wishful workshop","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-03-03","episode_number":13,"episode_type":"standard","id":1331433,"name":"Lessons in Laguna Beach","overview":"Tarek and Christina get a lead on a house in an upscale neighborhood in Laguna Beach, CA. Even though the house is small, it has an ocean view, which means big money. Having never flipped in the area, they aren't sure what to offer for the house, so they visit another flip in the area and see that the house they want is overpriced. When they offer below asking price for the home, the seller is shocked. Will they be able to get a good deal on this beachside home or will they miss their chance to make big money in Laguna?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-03-10","episode_number":14,"episode_type":"standard","id":1331434,"name":"Diving Into a Flip","overview":"Tarek and Christina buy a large home in Anaheim, California, with some strange additions that could end up costing them thousands of dollars and sacrificing square footage.","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-03-17","episode_number":15,"episode_type":"standard","id":1331435,"name":"Hillside Horror","overview":"Tarek and Christina get a lead on a property in the upscale neighborhood of Palos Verdes, California. The house may be small but because of the area, it could sell for over $1 million. Can Tarek and Christina turn this hillside horror into a high-class home, or are they in over their heads in this beachside community?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-03-24","episode_number":16,"episode_type":"standard","id":2946614,"name":"False Start Flip","overview":"Tarek and Christina are contacted about home in El Monte, California, but they can't take a look at the inside before making an offer. After checking out the outside, they make an offer and get it for a good price. But they think twice after they get inside and realize that they might have spent too much on this flip. Will they be able to keep costs to a minimum and maximize their profit, or did they jump the gun on this false-start flip?","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-03-31","episode_number":17,"episode_type":"finale","id":2946615,"name":"Beaming With Potential","overview":"Tarek and Christina get a lead on a four-bedroom home in Cypress, California, that the owner is looking to sell quickly. The home is a mess but already has an open floor plan, which will save them money in the long run. When they start demo on the kitchen, Tarek and Christina discover the ceiling isn't supported correctly, and they will have to reinforce it or add a post, which will close off the space. A house that was once beaming with potential could end up costing them more than they expected.","production_code":"","runtime":30,"season_number":6,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":79980,"poster_path":"/pFt0PS1buuoLKo6NvVZ8FGEgClw.jpg","season_number":6,"vote_average":0},"7":{"_id":"58496d1792514157b500151a","air_date":"2017-06-16","episodes":[{"air_date":"2017-06-16","episode_number":1,"episode_type":"standard","id":1246218,"name":"A Deceiving Deal","overview":"Tarek and Christina uncover some unpleasant surprises after buying a tenant-occupied home in Whittier, CA.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-23","episode_number":2,"episode_type":"standard","id":1246219,"name":"Switching Rooms","overview":"Tarek and Christina are contacted by a homeowner wanting to sell their four-bedroom home in Garden Grove, California. Knowing the high returns for the area they decide to go for it, but find the layout strange and question whether it's actually a four-bedroom house after all. Did they make a huge mistake, or can they find an upside from this potential mishap","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-30","episode_number":3,"episode_type":"standard","id":1247637,"name":"Post-Purchase Problems","overview":"Tarek and Christina are contacted about a three-bedroom, two-bathroom home in Anaheim, CA. The home appears to be in great shape and already has some major renovations completed, but the owner doesn't know how much they want to sell it for. There are structural issues that will have to be addressed before Christina's vision can come to fruition, but if she can pull it off, she and Tarek can make big bucks off this property. Is this house a flipper's dream home or are the structural issues the first of many problems to come?","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-07","episode_number":4,"episode_type":"standard","id":1249480,"name":"Midcentury Maze","overview":"Tarek and Christina check out a three-bedroom, two-bathroom home in their new stomping grounds of Garden Grove, CA. Hoping to snatch this property before it hits the market, they arrive to find the house is dirty with a mosquito-infested pool but has the potential to be charming. If they want to sell, the project will require a complex renovation with little room for error. Can they talk the seller down to a lower asking price or will Tarek and Christina have to pull off the perfect flip?","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-14","episode_number":5,"episode_type":"standard","id":1252692,"name":"Infringing Flip","overview":"A seller is looking to offload a three-bedroom, two-bathroom home in Garden Grove, CA, and asks Tarek and Christina to come have a look. The home already has an open floor plan and a master bedroom, but one of its bedrooms may be illegally permitted which could lead to hidden costs. Have they bought into a money trap or will they be able to pull out a profit on this infringing flip?","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-01","episode_number":6,"episode_type":"standard","id":1288000,"name":"Flipping and Dating","overview":"Tarek gets a lead on a house in Diamond Bar, CA, and asks Christina to meet him to view the property. Tarek rushes off for a date, however, and Christina relentlessly pokes fun at him. The underlying tension leads to a blowout, which could get in the way of finishing the flip and making a profit.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-08","episode_number":7,"episode_type":"standard","id":1288001,"name":"Junk-Pile Flip","overview":"Tarek and Christina flip a small home with big problems in Long Beach, CA. What seems like a great home reveals an avalanche of problems from the front door to the garage. This junk-pile flip is filled to the brim with hidden obstacles -- can it be saved?","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-15","episode_number":8,"episode_type":"standard","id":1288002,"name":"Bursting at the Seams","overview":"Tarek and Christina are out of town when they get a lead on a house in La Mirada, California, and are forced to buy the house sight unseen. Christina worries the house may be packed with problems, but Tarek believes big risks come with big rewards.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-22","episode_number":9,"episode_type":"standard","id":1288003,"name":"Two Houses For Sale","overview":"Tarek gets a lead on a house in Buena Park, CA, and calls Christina to check it out. When they arrive at the house, they find that it's dated inside and out and requires much more work than they'd hoped. As the renovation continues, Christina struggles to tell Tarek she wants to sell the house they lived in together because the news could send their flip off the rails.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-29","episode_number":10,"episode_type":"standard","id":1288004,"name":"Pigeonhole Flip","overview":"Tarek and Christina take on a home that's full of surprises in Santa Ana, California. They work to modernize the house as much as possible to appeal to the modern-day buyer, but with every challenge comes many problems.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-06","episode_number":11,"episode_type":"standard","id":1288005,"name":"New Normal in Arcadia","overview":"Tarek and Christina flip a large home in the unfamiliar neighborhood of Arcadia, CA, but their differing opinions threaten their profit margin in an area with a high market standard.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-13","episode_number":12,"episode_type":"standard","id":1288006,"name":"Shattered Flip","overview":"Tarek and Christina get a lead on a four-bedroom, two-bathroom home in Lakewood, Calif.; their hopes and dreams of a great deal in a good neighborhood shatter when they discover that the dilapidated house has been vandalized.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-20","episode_number":13,"episode_type":"standard","id":1288007,"name":"Dark and Dingy","overview":"Tarek and Christina find a good flip in Garden, CA, but Christina is worried that Tarek's penny-pinching will prevent them from making the necessary design decisions to maximize profits. As the flip goes along, Christina keeps pushing for big design to impress buyers while Tarek tries to manage the bottom line.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-27","episode_number":14,"episode_type":"standard","id":1288008,"name":"Tri-Level Flip","overview":"Tarek and Christina flip a four-bedroom, tri-level home in Orange, Calif. with a pool full of problems and a dated interior floor plan.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-08-03","episode_number":15,"episode_type":"standard","id":1288009,"name":"Midcentury Markup","overview":"Tarek and Christina get a lead on a Santa Ana, Calif., home with mid-century architectural details that could sell for top dollar; they're forced to outbid other investors to snag the home, leaving them wondering if more money means more problems.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-08-10","episode_number":16,"episode_type":"standard","id":2946587,"name":"Rock Bottom Flip","overview":"Tarek and Christina get a lead on a house in Whittier, Calif.; the home is dirty and dated, with a large fireplace in the center that will cost a fortune to update; they struggle to find a happy medium between design cost and profitability.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-08-17","episode_number":17,"episode_type":"standard","id":2946588,"name":"What's Old Is New Again","overview":"Tarek and Christina get a lead on a home in Hacienda Heights, Calif., where they find some outdated designs and others that are back in style; the retro property could be profitable in this hot market, or they may find something hiding inside.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-08-24","episode_number":18,"episode_type":"standard","id":2946589,"name":"Rotten Flip","overview":"Tarek and Christina gamble on a million-dollar possibility in Anaheim Hills, Calif., rotted with mold; Tarek wrestles to keep the project on track while Christina tip-toes around her ex being in a bad mood as things get worse with the home.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-08-31","episode_number":19,"episode_type":"standard","id":2946590,"name":"Fantastic Flip","overview":"Tarek and Christina take on a home in a trendy Costa Mesa, CA, neighborhood but if they want to give the hip homebuyers what they want, they'll first have to nail the design. While Christina is shooting for the stars with her designs, however, Tarek has a hard time spending the money. Will they be able to attract the right kind of buyer in this hard-to-please neighborhood or will their design miss the mark?","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-09-07","episode_number":20,"episode_type":"finale","id":2946592,"name":"Infested Flip","overview":"Tarek and Christina land on a small three-bedroom, two-bathroom home that needs a lot of work in Santa Ana, California. Once they get inside, they realize it needs more love than they expected. While deciding how to rehab the home, the duo clashes over style so they decide to compete to see whose design is better.","production_code":"","runtime":30,"season_number":7,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":82684,"poster_path":"/a7eZzRysbMlco1O60vMg8EhLtP1.jpg","season_number":7,"vote_average":0},"8":{"_id":"5944a2929251413fc200660d","air_date":"2019-08-02","episodes":[{"air_date":"2019-08-02","episode_number":1,"episode_type":"standard","id":1329565,"name":"Unpermitted Flip","overview":"Tarek and Christina flip a home in Rowland Heights, CA, that's jam-packed with issues. There's a large pool in a small backyard, and unexpected additions create problems they've never seen before. As their budgets grow and profits shrink, Tarek and Christina need to figure out creative ways to get top dollar on this project.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-09","episode_number":2,"episode_type":"standard","id":1331116,"name":"Fish Out of Water","overview":"Tarek and Christina take on a flip in West Covina, CA, which is a new area for them. They have to expand into new cities in order to grow their business, but the distance and their uncertainty of what buyers expect in the area lead to disagreements on the scope and design of the house.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-16","episode_number":3,"episode_type":"standard","id":1331117,"name":"Flea Bag Flip","overview":"Tarek and Christina get a lead on a house in Rowland Height, CA. This 3 bedroom, 2 bathroom house should be a quick flip but once they open the door they see this is a bigger project then they anticipated. Can they turn this run down house into a profit or will this flea bag flip be a flop?","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-23","episode_number":4,"episode_type":"standard","id":1331118,"name":"Bankrupt Flip","overview":"Tarek and Christina find a good deal in a familiar neighborhood in Anaheim, CA. They need to act fast if they want to lock it in, but they have to make an offer without seeing the inside.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-30","episode_number":5,"episode_type":"standard","id":1331119,"name":"Alarming Flip","overview":"Tarek and Christina return to the street of a previous flip in Cypress, Calif; when they can't agree on a design for the kitchen, they decide to settle matters with a quick game of hoops.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-06","episode_number":6,"episode_type":"standard","id":1920244,"name":"Midcentury Money Pit","overview":"Tarek and Christina flip a house in Fullerton, CA, right across the street from Tarek's first flip. Before renovating, they have to deal with crumbling concrete, and they need to figure out the market for the house. A lot has changed since Tarek's first flip, and changes bring new challenges.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-13","episode_number":7,"episode_type":"standard","id":1920245,"name":"It's a Dump","overview":"Tarek and Christina flip a house in Lakewood, CA, near one of their previous flips. They hope to repeat their past success, but modernizing an old house comes with a high price tag. A good flip will set the bar for the neighborhood, and a bad flip will leave them with minimal profits.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-20","episode_number":8,"episode_type":"standard","id":1920247,"name":"Money Mirage","overview":"Tarek and Christina take a gamble on a tri-level house in Irvine, CA, buying it sight unseen. The neighborhood is hot, but the house needs a lot of work. After opening up the tiny kitchen and updating the master bedroom, there's still a lot to do with a shrinking budget.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-27","episode_number":9,"episode_type":"standard","id":1920249,"name":"Additional Problems","overview":"Tarek and Christina find a house in Long Beach, CA, with tons of potential. To justify their investment, they decide to add a bedroom and bath. As work begins and problems spring up, they hope they haven't bitten off more than they can chew.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-10-04","episode_number":10,"episode_type":"standard","id":1920250,"name":"Cliff Makeover","overview":"Tarek and Christina take on a house in Anaheim, CA, designed by architect Cliff May. Having flipped a Cliff May house before, they're prepared to spend big for a midcentury makeover. But bad news from the city inspector and unexpected big-ticket expenses threaten to dig into their profits.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-10-11","episode_number":11,"episode_type":"standard","id":1977018,"name":"Turf Wars","overview":"Tarek and Christina team up with their friend Pete De Best on a house in Yorba Linda, CA. They've flipped houses with Pete and have had success, but he's a major penny pincher, and they must convince him that you have to spend money to make money.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-10-18","episode_number":12,"episode_type":"standard","id":1977019,"name":"Hoarding Potential","overview":"Tarek's friend, Robert, wants to get into flipping and they buy a home sight unseen in Lakewood, CA. When they discover it's a major hoarder house filled to the brim with junk, Robert worries they made a mistake.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-10-25","episode_number":13,"episode_type":"standard","id":1977020,"name":"Buyer's Remorse","overview":"Tarek and Christina get a smoking deal on a Yorba Linda, CA, home with a closed-off floor plan. They spend big money to remove a fireplace and open up the space, but when Tarek goes behind Christina's back and changes a tile design, she tackles the new fireplace herself.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-11-08","episode_number":14,"episode_type":"standard","id":1977024,"name":"Small House, Big Problems","overview":"Tarek and contractor Izzy Battres take on a small house in Fullerton, CA. The seemingly easy flip becomes difficult when removing a wall creates a nightmare with the city and an unpermitted laundry room must be moved inside.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-11-15","episode_number":15,"episode_type":"standard","id":1977032,"name":"Big House, Big Budget","overview":"Tarek and Christina take a risk on a huge home in pricey Anaheim Hills, CA, in hopes of making more money after sharing the profits. From water damage and invasive tree roots to a $30,000 roof, they're forced to break the bank on the massive project.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-11-22","episode_number":16,"episode_type":"standard","id":1977039,"name":"Million-dollar Cookie Cutter","overview":"Tarek tackles a cookie-cutter home in Newport Beach, CA, where everything looks exactly the same. He creates a plan with contractor Jeff Lawrence, but when a comp for $1.4 million hits the market, Tarek goes all out to take his flip to the next level.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":17,"episode_type":"standard","id":2948012,"name":"Treasure Hunt","overview":"Tarek and Christina flip a house in Fullerton, CA, with a fantastic view. When strange additions and design challenges collide, however, this quick flip turns out to be harder than anticipated.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-13","episode_number":18,"episode_type":"finale","id":2948013,"name":"Broken Flip","overview":"Tarek and Christina flip a house with a weird vibe in Anaheim, CA. From the start, they can't tell if someone is squatting in the house or if the neighborhood hoodlums are pranking them.","production_code":"","runtime":30,"season_number":8,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"","id":89599,"poster_path":"/zSuKfxnRtpOemMhZiWE5UFyJTck.jpg","season_number":8,"vote_average":0},"9":{"_id":"5f88a9eb2385130035383825","air_date":"2020-10-16","episodes":[{"air_date":"2020-10-16","episode_number":1,"episode_type":"standard","id":2465570,"name":"Back House Flip","overview":"Tarek and Christina find a small house in Lakewood, CA to flip quickly. But when they discover an unpermitted addition, they are faced with a dilemma of bringing the addition up to code or tearing down the nicest part of the house.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-10-23","episode_number":2,"episode_type":"standard","id":2474534,"name":"Better Be Quick","overview":"With so many flips in play, Tarek and Christina take out an expensive, hard-money loan to flip a house in Fountain Valley, CA. They're pressured to flip the house quickly as they juggle design decisions amidst a tight timeline.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-10-30","episode_number":3,"episode_type":"standard","id":2482927,"name":"Busy Flip","overview":"Between busy schedules, Tarek and Christina find time to check out a home in La Mirada, California, when a good deal pops up. What looks to be a quick flip turns out to be more difficult when problems arise as they try to modernize the layout.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-06","episode_number":4,"episode_type":"standard","id":2494693,"name":"Stiff Competition","overview":"Tarek and Christina get a lead on a house in an upscale neighborhood of North Tustin, CA. When they show up to view the house, however, they face competition from other investors. They must act quickly to flip the home before losing out in the hot market.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-13","episode_number":5,"episode_type":"standard","id":2505228,"name":"Cut And Run","overview":"Tarek and Christina take on a Laguna Hills, CA, house in a cookie-cutter neighborhood. When they arrive at the home, they find torn-up drywall and missing exterior siding, making them wonder why someone would leave the property in such a hurry.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-11-20","episode_number":6,"episode_type":"standard","id":2517434,"name":"Far Out Flip","overview":"Tarek and Christina are lured to North Hollywood, CA, by a 1930s Spanish home. They want to appeal to trendy Los Angeles buyers by preserving the historic architecture, but the home's inconvenient distance causes unexpected issues during renovations.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-11","episode_number":7,"episode_type":"standard","id":2552371,"name":"Covered Costs","overview":"Tarek and Christina take a risk on an unseen house in Orange, California, but they soon discover it's been vandalized and the owners covered a gross pool in the backyard. As more issues pop up, Tarek and Christina worry they won't recoup their costs.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-12-17","episode_number":8,"episode_type":"standard","id":2564991,"name":"Tilted Flop","overview":"A flip in Mission Viejo, California, looks promising until Tarek and Christina discover cracks and uneven floors -- this house is slipping off the hillside! After receiving a hefty quote for the fix, they realize this home may put them over the edge.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-08","episode_number":9,"episode_type":"standard","id":2623683,"name":"Go Big Or Go Home","overview":"Tarek and Christina take on one of their biggest projects to date in Anaheim Hills, California, but modernizing this '90s mansion will cost them a fortune. If they don't get the design just right, it could jeopardize the profit and their big investment.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-01-15","episode_number":10,"episode_type":"standard","id":2642260,"name":"Flew The Coop","overview":"From dirty carpets to rotten food, Tarek and Christina thought they had seen the worst of this house in Cerritos, California. After finding a bird cage with years of mess, they struggle to see past the trash and transform this home into a profitable flip.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-04-30","episode_number":11,"episode_type":"standard","id":2913872,"name":"Fifties Flip","overview":"Christina convinces Tarek to take on a classic 50's flip in Norwalk, California. Once they begin updating the vintage home to create a more functional layout for contemporary buyers, it proves to be a huge challenge as they navigate a tight profit margin.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-07","episode_number":12,"episode_type":"standard","id":2929423,"name":"Filthy Flip","overview":"Tarek and Christina have seen some nasty houses during their years of flipping, but this house in Garden Grove, CA might take the cake. And as they attempt to update the old home they encounter new problems that make them question their choices.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-14","episode_number":13,"episode_type":"standard","id":2946557,"name":"Smelly Time Capsule","overview":"Tarek and Christina make a costly decision to open up the floor plan on a stinky 1950s home in Whittier, California. The duo encounter extensive termite and water damage as they try to turn this disgusting and dated house into a modern money maker.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-21","episode_number":14,"episode_type":"standard","id":2948008,"name":"Enamored By The View","overview":"Tarek and Christina get a chance to flip a house in San Clemente, Calif.; when the cost to fix the foundation catches them by surprise, they realize they may have been too enamored by the panoramic views of the ocean to see the potential problems.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-05-28","episode_number":15,"episode_type":"finale","id":2948009,"name":"Prickly Flip","overview":"Tarek and Christina get a lead on a property overrun with cacti in Lakewood, California, but they can't see inside because tenants are still there! The duo returns to find a leaky water bed creating a huge mess that may endanger their profits.","production_code":"","runtime":30,"season_number":9,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 9","overview":"","id":165844,"poster_path":"/fyNYSxV14YFxJOTZwCRf63j87DZ.jpg","season_number":9,"vote_average":0},"10":{"_id":"61aa7e5309c24c0043ac3342","air_date":"2021-12-02","episodes":[{"air_date":"2021-12-02","episode_number":1,"episode_type":"standard","id":3376687,"name":"Takeover Flip","overview":"Tarek and Christina take over a project in Highland Park, California, that the previous owner abandoned mid-flip. When their inspection reveals that it doesnt have a roof, theyll have to piece this puzzling house together in an unfamiliar neighborhood.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-09","episode_number":2,"episode_type":"standard","id":3385039,"name":"Groovy Flip","overview":"Tarek and Christina are challenged by a home in Fullerton, CA with a unique style. Trying to go with the flow of the home's design, they are met with problems that don't quite jive with their vision.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-16","episode_number":3,"episode_type":"standard","id":3385040,"name":"Time Is Money","overview":"In order to take advantage of a hot market, Tarek and Christina plan a quick flip for a small house on a big lot. While their fast moves could land a big payday, they risk rushing the important details and creating bigger problems down the road.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-23","episode_number":4,"episode_type":"standard","id":3389601,"name":"Flashback Flip","overview":"Tarek and Christina head outside their comfort zone to flip a house that needs some work in Walnut, California. With few fixed-up homes nearby, they hope to leave their mark by setting the standard for local comps in this new neighborhood.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-30","episode_number":5,"episode_type":"standard","id":3389602,"name":"Addition Condition","overview":"Tarek and Christina find a house in Anaheim, California, with some strange additions that could cause problems down the line. They team up with contractor Izzy Battres to make the most of this house without blowing their budget.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-06","episode_number":6,"episode_type":"standard","id":3389603,"name":"Back to the Basics","overview":"Tarek and Christina find the perfect flip in Norwalk, California, but to avoid blowing their budget on over-improving the home, they'll need to utilize all of the fundamentals and rely on their experience to sell this house quickly.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-13","episode_number":7,"episode_type":"standard","id":3389604,"name":"Take It or Leave It","overview":"Tarek and Christina take on a house in Costa Mesa, California, with major foundation problems. While they lean on their past experience to leverage a good deal, the amount of work needed to fix the issues could crack their budget wide open.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-20","episode_number":8,"episode_type":"standard","id":3464231,"name":"Lucky Lakewood","overview":"Tarek and Christina head to Lakewood, CA to flip a home on a street where they have flipped multiple other houses; they have always gotten lucky by taking risks in this neighborhood.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-01-27","episode_number":9,"episode_type":"standard","id":3464255,"name":"Surf City Flip","overview":"Tarek and Christina head to Huntington Beach, California, to check out a large home in a nice neighborhood. The home is dated and has a boxy layout, but they hope their plan to modernize this monster will prevent them from wiping out in Surf City.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-02-03","episode_number":10,"episode_type":"standard","id":3464256,"name":"Townhouse Flip","overview":"Tarek and Christina take on a huge project in the upscale beach community of Corona del Mar, California, where trying to meet the highest standards of architecture and design proves to be no easy task in this seaside townhouse flip.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-02-24","episode_number":11,"episode_type":"standard","id":3529507,"name":"Century Flip","overview":"Tarek and Christina take on a hundred-year-old house in a historic neighborhood of Santa Ana, California, where they're faced with the challenges of preserving the home's original charm while modernizing it to today's standards.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-03","episode_number":12,"episode_type":"standard","id":3529508,"name":"Suburban Flip","overview":"Tarek and Christina find a nice, suburban house they believe is ripe for the flipping. While modernizing such a small home should be no problem, the duo may have bitten off more than they can chew when faced with costly but necessary upgrades.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-10","episode_number":13,"episode_type":"standard","id":3529509,"name":"Red Hot Flip","overview":"Tarek and Christina head out of their comfort zone to flip a house in the red hot market of Covina, California. The property seems like a good deal, but they'll quickly need to get everything perfect to take advantage of this fast-moving market.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2022-03-17","episode_number":14,"episode_type":"finale","id":3529510,"name":"Spanish Lessons","overview":"Tarek and Christina take on a huge project with an elaborate Spanish design that has proven to be difficult and costly in previous flips. They hope their past experiences will be enough to get everything just right and master this complicated style.","production_code":"","runtime":30,"season_number":10,"show_id":62618,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 10","overview":"","id":234184,"poster_path":"/jMCrCDfFIIlK9QxoJM9jD6U3ZJB.jpg","season_number":10,"vote_average":0}}}