{"adult":false,"backdrop_path":"/2RyoO9g8UskEfl2J27Am7l8Nnjx.jpg","created_by":[],"episode_run_time":[60],"first_air_date":"2015-06-22","genres":[{"id":9648,"name":"Mystery"},{"id":18,"name":"Drama"}],"homepage":"http://www.kbs.co.kr/drama/hellomonster/","id":62933,"in_production":false,"languages":["ko"],"last_air_date":"2015-08-11","last_episode_to_air":{"id":1082710,"name":"I Remember You","overview":"Lee Hyun remembers his past of killing the murderer of his mom and the meaning behind Lee Min’s cards.  Cha Ji-An tells Lee Min to turn himself in because it is wrong to hurt other people and if he doesn’t, he and Hyun will never have a happy ending.  Kang Eun-Hyuk interrupts Lee Joon-Yeong choking Ji-An. Later, he tells Ji-An that he likes her. Hyun and Min spend time together to cement the bonding of brotherhood.  Joon-Yeong is stabbed by one of his kids and then Min attempts to kill him.  Hyun arrives after Min is stabbed but is knockout.  Min and Joon-Yeong disappear.  After visiting Ji-An three times, Hyun disappears.  Choi Eun-Bok confesses to killing the Planning Officer and decides to be a witness against Joon-Yeong.","vote_average":0,"vote_count":0,"air_date":"2015-08-11","episode_number":16,"episode_type":"finale","production_code":"","runtime":64,"season_number":1,"show_id":62933,"still_path":"/QpeUM0rG3cLABzNkv2HFLTWtKn.jpg"},"name":"I Remember You","next_episode_to_air":null,"networks":[{"id":342,"logo_path":"/nFmWwUAf2D3iAtizUcmkxufaM0q.png","name":"KBS2","origin_country":"KR"}],"number_of_episodes":16,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"너를 기억해","overview":"This drama is a romantic thriller that centers around a criminal profiler, Lee Hyun who previously work as a consultant at the police department in New York. After he returns to south Korea, he’s in charge of a special criminal investigation team. Due to his special insight, he can analyze the crime scene and the suspect at one glance. He works together with an elite detective, Cha Ji An to solve the crimes and they develop a romantic relationship.","popularity":17.264,"poster_path":"/5g60Pp5z4pSioMqWekRVTcFeFLW.jpg","production_companies":[{"id":128404,"logo_path":"/dP3usmr6di1jMPH738rvbxdkmSQ.png","name":"CJ ENM","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2015-06-22","episode_count":16,"id":67681,"name":"Season 1","overview":"","poster_path":"/do47wTnPP5CVovmuQysgyFx8a89.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.536,"vote_count":97,"season_data":{"1":{"_id":"557c3797c3a3686328001d5f","air_date":"2015-06-22","episodes":[{"air_date":"2015-06-22","episode_number":1,"episode_type":"standard","id":1075441,"name":"Every Child's Story Begins with Their Parents","overview":"Lee Hyun, a Criminologist working for the New York Police, returns to Korea to investigate a recent email that he received.  He hopes to recover all of his early memories that he lost after the tragic murder of his father.  On arrival at the airport, he deciphers some cryptographic symbology that leads him to a recent murder scene.  Team 1 Investigative Unit arrives while he is there and mistakes him for the new Team Leader.  However, Cha Ji-An, the Lead Investigator knows who he is because she has stalked him since her youth.","production_code":"","runtime":60,"season_number":1,"show_id":62933,"still_path":"/aatJZVBxe0EBsJHJEywFAk2xC8G.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Lee Joon-young","credit_id":"558bd6999251415888000371","order":500,"adult":false,"gender":2,"id":1470219,"known_for_department":"Acting","name":"Doh Kyung-soo","original_name":"Doh Kyung-soo","popularity":7.675,"profile_path":"/gWWvDiecz99b7FPJnWUdu2NZO0p.jpg"}]},{"air_date":"2015-06-23","episode_number":2,"episode_type":"standard","id":1075443,"name":"Hello, Monster","overview":"Plagued by insidious thoughts planted by serial killer Lee Joon-Yeong and recent events; Lee Hyun's father believes that he is becoming a monster.  He isolates him in the basement to protect both him and the world.  Joon-Yeong escapes from prison, murders his father and absconds with his brother.  Lee Hyun discovers a painting at a murder scene that he believes may be his brother Lee Min’s.","production_code":"","runtime":59,"season_number":1,"show_id":62933,"still_path":"/xOpa1zCbNWRqTqeHMWcBXcBEF9J.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Lee Joon-young","credit_id":"558bd6999251415888000371","order":500,"adult":false,"gender":2,"id":1470219,"known_for_department":"Acting","name":"Doh Kyung-soo","original_name":"Doh Kyung-soo","popularity":7.675,"profile_path":"/gWWvDiecz99b7FPJnWUdu2NZO0p.jpg"}]},{"air_date":"2015-06-29","episode_number":3,"episode_type":"standard","id":1079311,"name":"Thou Shall Not Kill, But...","overview":"Team 1 working with Lee Hyun come up with a profile of the victims.  Cha Ji-An races to the next suspected victim and is successful in capturing the murder suspect but complications arise as there is no proof and the target drops any charges.  Attorney Jung Sun-ho arrived during the interrogation process and thwarts Lee Hyun and Cha Ji-An efforts to get a confession.","production_code":"","runtime":61,"season_number":1,"show_id":62933,"still_path":"/lnD2XvYl3FSOoZpGEwszLtmVKEv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-30","episode_number":4,"episode_type":"standard","id":1079312,"name":"The Suspect, Lee Hyun","overview":"The murder suspect, Yang Seung-Hoon, leaves on the first available plane to China.  Lee Hyun illegally uses Cha Ji-An’s computer and informs Chinese authorities of his drug trafficking.  They find evidence at his house and arrest him on arrival. Team Leader Kang Eun-Hyuk and Planning Officer Hyun Ji-Soo are reprimanded by the Deputy Chief for mishandling the case.  Cha Ji-An is transferred to another department.  Detective Yang sets up a meeting with Lee Hyun to relay some pertinent information concerning Joon-Ho.  Detective Yang is murdered, and he becomes the prime suspect.","production_code":"","runtime":60,"season_number":1,"show_id":62933,"still_path":"/uoSubPiVPfITGpeOXaXQ8zNzhc0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-07-06","episode_number":5,"episode_type":"standard","id":1079314,"name":"Borne Back Ceaselessly into the Past","overview":"Cha Ji-An is going stir crazy wanting to investigate so she joins up with Lee Hyun.  They evade capture by hiding in a closet at the crime scene.  They start bonding while he hides out at her place, and she attends his wounds. He convinces her to spy for him. Together they are able to figure out who the murderer is and his next target.  The Team Leader, Kang Eun-Hyuk, makes the arrest.  He and the Planning officer convince the Deputy Chief to return Cha Ji-An to the team.","production_code":"","runtime":61,"season_number":1,"show_id":62933,"still_path":"/yj8mZYyO4hfbDkW81LQgvUpI0KY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-07-07","episode_number":6,"episode_type":"standard","id":1079315,"name":"The Blood of a Murderer","overview":"Lee Hyun meets with Prosecutor Shin Jang-Ho concerning Park Young-Chul's case.  Jang-Ho informs Lee Hyun has experienced two cases of memory loss in relationship to his parents' deaths. Also, that Lee Joon-Yeong never leaves any bodies to be found for his murder cases.  In order to investigate the Park Jeung-Woo murder case, Lee Hyun is coerced to join Team 1 as an official advisor. Lee Hyun hires Jung-Sun-ho to be Lee Jung-Ha’s attorney because he believes he is innocent.","production_code":"","runtime":61,"season_number":1,"show_id":62933,"still_path":"/zPp4uPlFz7Xjo6K7LIBdrBmRJP1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Lee Jung-ha","credit_id":"55c7bdeec3a3687ed10024dd","order":501,"adult":false,"gender":2,"id":1256497,"known_for_department":"Acting","name":"Seo Young-joo","original_name":"Seo Young-joo","popularity":5.635,"profile_path":"/agT8nCtXN1dalLgMPmceOeOFttr.jpg"}]},{"air_date":"2015-07-13","episode_number":7,"episode_type":"standard","id":1082697,"name":"Let's Be Partners?","overview":"Lee Hyun confronts Cha Ji-An about her doubting him and thinking he may be like Lee Joon-Yeong. Lee Hyun believes Lee Jung-Ha is covering for Lee Jin-Woo.  Teams 1 solves the Park Jeung-Woo murder case.  After doing some soul searching, Cha Ji-An comes to the conclusion that she is wrong, and Lee Hyun is not like Lee Joon-Yeong.  She tells him that he is weird and annoying but not a monster.  After solidifying their partnership, she asks him out on a date and takes him to a closed amusement park to spend time together.","production_code":"","runtime":61,"season_number":1,"show_id":62933,"still_path":"/4sV8iBanUhSDzv0hqevkFk1cW4n.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Lee Jung-ha","credit_id":"55c7bdeec3a3687ed10024dd","order":501,"adult":false,"gender":2,"id":1256497,"known_for_department":"Acting","name":"Seo Young-joo","original_name":"Seo Young-joo","popularity":5.635,"profile_path":"/agT8nCtXN1dalLgMPmceOeOFttr.jpg"}]},{"air_date":"2015-07-14","episode_number":8,"episode_type":"standard","id":1082699,"name":"Remember Me","overview":"Chi Ji-An is brutally attacked in her home and Attorney Jung comes to her rescue.  Lee Hyun finds it suspicious and questions him if Yang Seung-Hoon is behind the attack.  After her hospitalization, Lee Hyun decides to let her stay with him for a few days.  Ji-An is awakened from her sleep to find Lee Hung at his desk having nightmares.  When Lee Hyun checks back with his Art Gallery friend, Na Bong Sun, finds out the symbol on the paintings is linked to an employee at the Fako Shipyard.  Going undercover, he discovers another dead body.","production_code":"","runtime":59,"season_number":1,"show_id":62933,"still_path":"/9eUaq5AJps6QuNxKsjJMJjTTYp2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-07-20","episode_number":9,"episode_type":"standard","id":1082701,"name":"Stalker S","overview":"The Planning Officer still refuses to open up to Lee Hyun concerning his past in regard to Joon-Young.  Team 1 starts working on another serial killer case involving stalking and missing persons. Detective Son’s blind date, Ji Hyun-Sook, goes missing.  Lee Hyun develops a profile with possible locations the culprit may be working from.  While Cha Ji-An and Team Leader Kang go to check it out, Lee Hyun has a dinner date with two persons of interest to him, Attorney Jung and Pathologist Lee.","production_code":"","runtime":61,"season_number":1,"show_id":62933,"still_path":"/jHvYQXln5RqwPilD8VO96YGIPFT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jae-shik's girlfriend","credit_id":"55c7be3192514105cc0029be","order":502,"adult":false,"gender":1,"id":1257661,"known_for_department":"Acting","name":"Lee El","original_name":"Lee El","popularity":14.797,"profile_path":"/cXG6IcCaqtn6BD5bDAFqVTbsUDD.jpg"}]},{"air_date":"2015-07-21","episode_number":10,"episode_type":"standard","id":1082702,"name":"Find Me","overview":"The serial killers, Do Jae-Shik and Kang Seong-Eun, capture Cha Ji-An and leave Team Leader Kang dying from a knife wound.  Lee Hyun, Attorney Jung, and Pathologist Lee join Team 1 as they rush to apprehend the suspects. Planning Officer Hyun finally confesses about her deal with Joon-Yeong that inadvertently lead to the death of his father and his brother’s disappearance. Officer Cha and Ji Hyun-Sook are rescued. Budding romance blooms as Lee Hyun and Ji-An move closer in their relationship.","production_code":"","runtime":60,"season_number":1,"show_id":62933,"still_path":"/bAR6jmXva7g76r31Avalu2mWos.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jae-shik's girlfriend","credit_id":"55c7be3192514105cc0029be","order":502,"adult":false,"gender":1,"id":1257661,"known_for_department":"Acting","name":"Lee El","original_name":"Lee El","popularity":14.797,"profile_path":"/cXG6IcCaqtn6BD5bDAFqVTbsUDD.jpg"}]},{"air_date":"2015-07-27","episode_number":11,"episode_type":"standard","id":1082703,"name":"Birth of a Monster","overview":"Detective Jang’s missing notebook mysteriously appears at Lee Hyun’s home.  Following the clues in the notebook, Ji-An and Lee Hyun arrive at the original home of Lee Joon-Yeong.  They discover a casket with the bones of what may be Joon-Yeong’s mother.  Park Joo-Ah, one of the family caregivers, comes forward and relates Joon-Yeong’s childhood and the death of everyone else living there.  Detective Ji-An’s stalking skills are put to use resolving key issues Lee Hyun is categorizing in his head, and he realizes that every time he visited Korea, he was given a gift box which contained clues left by his brother.  Joo Yeong-Jae, a student, is murdered and the adoptive parents' actions are questioned.","production_code":"","runtime":63,"season_number":1,"show_id":62933,"still_path":"/gRun825q0BpussFlOJftOAlz2UF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-07-28","episode_number":12,"episode_type":"standard","id":1082705,"name":"If I Had to Kill Somebody...","overview":"Team 1 arrest Joo Yeong-Jae’s mother for abuse as she was a witness to the beating and did not interfere.  Na Bong-Sung provides Lee Hyun with enough evidence to support his theory that Attorney Jung is his brother Lee Min. Min catches Hyun at his home looking at his paintings. Hyun request Min not to kill anymore but if he has a need to kill him first.  Photos are delivered to the precinct that are threatening to Lee Hyun.  Convinced that it is possibly a professional killer out to take revenge for the death of his girlfriend, Hyun believes that he will be punished by the death of Ji-An or Min.","production_code":"","runtime":62,"season_number":1,"show_id":62933,"still_path":"/pzIGx6RIikN9AvwNaOwwdNuSgES.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-03","episode_number":13,"episode_type":"standard","id":1082706,"name":"What Choice Would You Make?","overview":"Jo Yong-Woo attacks Lee Min in order to make Lee Hyun suffer.  Cha Ji-An arrives in time to prevent Yong-Woo from killing Min, but he manages to get away.  Lee Hyun confronts the Planning Officer and Deputy Chief about their collusion with Lee Joon-Yeong. Ji-An has concluded that the Medical Examiner, Lee Jun Ho is really Lee Joon-Yeong.  Tracing Jo Yong-Woo’s phone takes the team to the site where he was tortured, killed and buried.  While the team is celebrating Ji An's birthday, she receives a delivery package that contains a birthday card and map.","production_code":"","runtime":64,"season_number":1,"show_id":62933,"still_path":"/aB1gufjYJlPm9h478hZVXOwRQLB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-04","episode_number":14,"episode_type":"standard","id":1082707,"name":"Lee Joon-young's Room","overview":"Reeling from the discovery of her father’s remains, Cha Ji-An wants revenge but has to settle for seeking justice.  Lee Min decides to move in with Lee Hyun and Lee Joon-Yeong’s hopes for living together with the brothers is shattered.  Planning Officer Hyun Ji-Soo is murdered, devastating the entire team.  Hyun is shocked to find out how badly Min’s logic has been tainted.  Team Leader Kang finds out who framed Ji-An’s father as an accomplice during Joon-Yeong's escape.  Ji-An seizes an opportunity to search Joon-Yeong’s home.","production_code":"","runtime":64,"season_number":1,"show_id":62933,"still_path":"/a502bm7O7y53UcdVQTKQo9JrXZl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-10","episode_number":15,"episode_type":"standard","id":1082709,"name":"Is a Happy Ending Possible?","overview":"Lee Min catches Chai Ji-An ransacking Lee Jeong-Yeong’s special room but allows her to leave with some photos of children that he has taken under his wing.  Joon-Yeong poses a question to Lee Hyun, “Would you be able to take care of him by yourself?”  Kang Eun-Hyuk informs Ji-An of his father’s role in framing her dad. Min Seung-Joo finds out Choi Eun-Bok is one of Joon-Yeong’s kids.  He tries to get him to turn himself in for the murder of the Planning Officer Hyun Ji-Soo, Lee Hyun adopted mother. During the apprehension of Eun Bok, Hyun retrieves a fallen weapon which triggers memories of his past that causes him to collapse.","production_code":"","runtime":63,"season_number":1,"show_id":62933,"still_path":"/fsxI5ayosLi2Zbyz2KIc4DRTK2o.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-11","episode_number":16,"episode_type":"finale","id":1082710,"name":"I Remember You","overview":"Lee Hyun remembers his past of killing the murderer of his mom and the meaning behind Lee Min’s cards.  Cha Ji-An tells Lee Min to turn himself in because it is wrong to hurt other people and if he doesn’t, he and Hyun will never have a happy ending.  Kang Eun-Hyuk interrupts Lee Joon-Yeong choking Ji-An. Later, he tells Ji-An that he likes her. Hyun and Min spend time together to cement the bonding of brotherhood.  Joon-Yeong is stabbed by one of his kids and then Min attempts to kill him.  Hyun arrives after Min is stabbed but is knockout.  Min and Joon-Yeong disappear.  After visiting Ji-An three times, Hyun disappears.  Choi Eun-Bok confesses to killing the Planning Officer and decides to be a witness against Joon-Yeong.","production_code":"","runtime":64,"season_number":1,"show_id":62933,"still_path":"/QpeUM0rG3cLABzNkv2HFLTWtKn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":67681,"poster_path":"/do47wTnPP5CVovmuQysgyFx8a89.jpg","season_number":1,"vote_average":0}}}