{"adult":false,"backdrop_path":"/2Eq2CYTV8cAJeddla6vFgIlxIH6.jpg","created_by":[],"episode_run_time":[17],"first_air_date":"2015-10-04","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"},{"id":35,"name":"Comedy"}],"homepage":"http://kyojinchu.tv","id":63510,"in_production":false,"languages":["ja"],"last_air_date":"2015-12-20","last_episode_to_air":{"id":1245086,"name":"Attack! Titan Junior High School","overview":"Following the events of the 104th school festival, Eren vows to get their cheeseburgers back from the Titans, defying the teachers and heading to the Titans' building. Finally making their way to the principal's office, where they believe the cheeseburgers to be located, they find a gigantic key in the center of a small city. As the rest of the class fights to hold off the attacking Titans, Eren carries the key to the keyhole and unlocks it. Inside, they find themselves in what is revealed to be the principal's lunch box, as the Colossal Titan lifts the lid and takes the cheeseburger stand. Enraged, Eren attacks, but is swallowed along with the stand. As his classmates look on in horror, however, the Titan spits him back out, and Eren reveals that he managed to rescue one of the burgers. As the students celebrate their first victory against the Titans, Erwin tells the other faculty that with this victory, human students now have a chance for a happy school life.","vote_average":8.5,"vote_count":4,"air_date":"2015-12-20","episode_number":12,"episode_type":"finale","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/n2XsYnkxYIBMygY7poDfqUdi2Hk.jpg"},"name":"Attack on Titan: Junior High","next_episode_to_air":null,"networks":[{"id":94,"logo_path":"/7RNXnyiMbjgqtPAjja13wchcrGI.png","name":"MBS","origin_country":"JP"}],"number_of_episodes":12,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"進撃！巨人中学校","overview":"Your favorite characters from Attack on Titan are back in…junior high school? Adapted from the hit spinoff manga series—Attack on Titan: Junior High (written by Saki Nakagawa), this parody reimagines Eren, Mikasa, Armin, and other characters from the original manga as students and teachers at Titan Junior High School.","popularity":29.833,"poster_path":"/el6yFiXQxiPLZLCJsukAI9UTI6J.jpg","production_companies":[{"id":529,"logo_path":"/rwB6w2aPENQbx756pBWSw44Ouk.png","name":"Production I.G","origin_country":"JP"},{"id":1778,"logo_path":"/b5rT6VbYza3LyfltCmz1OcqzWJM.png","name":"dentsu","origin_country":"JP"},{"id":59118,"logo_path":"/9nTCEBgGaaI5swkv8gy2vny0Mb5.png","name":"Kodansha","origin_country":"JP"},{"id":3363,"logo_path":"/sj3vD7n63bTCih7bcf6GnWvRf1Q.png","name":"MBS","origin_country":"JP"},{"id":9148,"logo_path":"/rtW3NadfF4kR5mTW00ahiFxw6k7.png","name":"Pony Canyon","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"2015-10-04","episode_count":12,"id":69251,"name":"Season 1","overview":"","poster_path":"/raE04drTJmjVUn7dzYkgkh82rsW.jpg","season_number":1,"vote_average":8.1}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.912,"vote_count":164,"season_data":{"1":{"_id":"55bfacdf9251413bed005b08","air_date":"2015-10-04","episodes":[{"air_date":"2015-10-04","episode_number":1,"episode_type":"standard","id":1094047,"name":"Starting School! Titan Junior High School","overview":"On the very first day of junior high, Eren oversleeps and is woken up by Mikasa. While rushing to school, he runs into several of his classmates. When they arrive at school, everyone except Eren notices something is odd. They realize that they walked into the Titan side of Attack Junior High School, and are later introduced to their class 1-4 properly by Hannes. They attend the entrance ceremony, only to find that their principal unleashes Titans to crash their entrance ceremony.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/6bp01U4I7Q5KGnZYvFi0HItAGX6.jpg","vote_average":8,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-10-11","episode_number":2,"episode_type":"standard","id":1133448,"name":"Chasing! Titan Junior High School","overview":"Eren and Mikasa are sent to collect a club admission form from Armin, who has secluded himself at home all winter for fear of the cold. On the way, a Titan attempts to steal their gifts of food, but is defeated by Levi, who then steals Armin's futon. In an attempt to recover the futon, Eren and his classmates track down the Attack Junior High Scout Regiment, a secret, unapproved club. There they meet Eld, Oruo, Petra, and Gunther. Levi arrives with Armin's futon, which he had stolen in order to mend a tear it had developed, and accepts all of them into the club.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/cwKXCIfZHqxXbiOdFFUKTciEbs6.jpg","vote_average":8.2,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-10-18","episode_number":3,"episode_type":"standard","id":1133449,"name":"Dodgeball! Titan Junior High School","overview":"Annie is unable to admit her love of cheeseburgers at lunchtime due to the derision Eren received after admitting to the same thing; due to this, she develops a grudge and vows to defeat him in the next day's dodgeball match. However, when the match rolls around, Eren is late, causing Mikasa to be unable to devote herself to the game. After multiple rounds, only two teams are left: one with Jean, Mikasa, Armin, Sasha, and Connie; the other with Annie, Reiner, Bertold, Ymir, and Krista. At the last moment, however, Eren arrives, allowing Mikasa to give the game her all, battling to a tie with Annie while everyone else is eliminated. Annie finally admits the reason for her grudge to Eren and they make up, just as Connie finally figures out the rules and gets Annie out. Afterward, Eren, Mikasa, Annie, and Armin have lunch together, and Mikasa becomes jealous when Eren and Annie start to bond over their mutual love of cheeseburgers.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/4qbnK6NBor1kqFSagIHhOMOunkC.jpg","vote_average":8.2,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-10-25","episode_number":4,"episode_type":"standard","id":1133450,"name":"Cleanup! Titan Junior High School","overview":"Eren and the others are forced to join the Wall Cleanup Club since the Scout Regiment Club is an unapproved club. There, they are tasked with cleaning windows by Rico. Impressed by their work, she agrees to teach them how to use the club's secret equipment, the omni-directional mobility gear. Eren, however, fails the test because of an equipment failure. Hannes, the club's advisor, arrives to show him how it is done, but crashes into the Wall due to being drunk. This allows Rico to save face by blaming the broken equipment on Hannes. Two Titans then appear, and the club watches in horror as they vandalize the Wall. Rico explains that this is why the Wall Cleanup Club was originally founded. Outraged, Eren attacks the Titans, only to end up covered in paint.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/avBjguU5z5kPFiFih7KMUMxJ1Br.jpg","vote_average":8,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-11-01","episode_number":5,"episode_type":"standard","id":1133451,"name":"Studying Hard! Titan Junior High School","overview":"Sasha and Conny both fail their tests and ask Armin for help. Conny promptly forgets about the study session, but Armin manages to help Sasha with math by using food metaphors. Meanwhile, Eren, Mikasa, and Jean are forced to listen to Oruo brag about his test scores. Hange then arrives and tries to extort money out of them for lunch. When they ask her why she cannot afford her own, she shows them the two Titans she is keeping captive, forcing her to use up the biology club's budget as well as her allowance to feed them. Levi takes pity on her and gives her a bag of dog food to feed the Titans, which she then eats herself. Later, when the time comes around for the makeup test, Sasha fails due to fantasizing about food, and Conny fails after he forgets to show up for it; causing them both to be forced to take remedial classes.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/rTLZB4wD4O3KLSKXOnv3Q2KXLcy.jpg","vote_average":8,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-11-08","episode_number":6,"episode_type":"standard","id":1245080,"name":"Love Letter! Titan Junior High School","overview":"Jean finds a love letter in his locker and begins to fantasize about who it might be from. Annie approaches him in class, and a similar letter falls from her pocket, but she runs away before he can ask her about it. Later, they find her putting the letter in his locker; when Jean opens it, he finds a message asking him to meet at the park, and runs off. Annie then arrives at the park, and reveals that the letter was not from her, but from a Titan who fell in love with Jean after he gave her food as a distraction while he and Marco fled. Much to his classmates' horror, Jean refuses to accept reality, instead, convincing himself that the Titan is a normal girl. He soon comes to his senses, however, and rejects her; she smashes him into the ground and runs away, vowing not to give up. Sasha tries to console him by pretending that two pieces of food are girls who want to date him, and he retreats into fantasy. The others go home, leaving Marco to wait for Jean to come to his senses.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/vilzkXgQJPlwxySWDJVtZQTQ4wr.jpg","vote_average":8.2,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-11-15","episode_number":7,"episode_type":"standard","id":1245081,"name":"Showdown! Titan Junior High School","overview":"When Eren and his friends displease the upperclassmen, they are stuck with cleaning duty. Levi decides to teach them a lesson, challenging them to a contest in the Sports Day games in which the losing grade must clean the Titans' building. The next day, Sasha begins by losing the bread eating race to Hange when the latter uses her captive Titan, Sawney, to win. Jean also loses his game despite using the omni-directional mobility gear to cheat. The class begins to despair their chances of winning when Mikasa proposes a way to get ahead: defeat the upperclassmen in the shoulder wars match. They almost win, but are defeated by Levi. Hange then floods the entire field with confetti. As Eren and his classmates grumble about having to clean the field, they are joined by Rico and the other upperclassmen, who agree to help them.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/bFI5Jw1EVBJNq8Aj9f3aoWUG49g.jpg","vote_average":8,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-11-22","episode_number":8,"episode_type":"standard","id":1245082,"name":"Spine-chiller! Titan Junior High School","overview":"After the race of the last day, Hange and the other upperclassmen challenge Eren's class to a test of courage. That night they arrive at school, where Hange and Levi explain the rules: they must visit the art, music, and science rooms and write their names on the blackboard. The class splits into two groups and head out, encountering various ghostly apparitions said to be the \"Seven Wonders of Attack Junior High\"; there is a rumor that anyone who sees all seven will be cursed with misfortune. Finally reaching the gym, they find that the ghosts were, in fact, a prank orchestrated by the upperclassmen. Erwin Smith, the club's advisor, reveals that one spirit, the woman with black hair whom Christa encountered, was, in fact, a real ghost.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/xr5PsY1uC0lZPKGdpVn3zt7XVBK.jpg","vote_average":8.2,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-11-29","episode_number":9,"episode_type":"standard","id":1245083,"name":"Sweet Summer! Titan Junior High School","overview":"Bertholdt asks out Annie to the summer festival with Reiner, Christa, and Ymir. She is not interested but is forced to join in after her classmates all decide to go. On the rooftop, Reiner urges Bertholdt to tell Annie how he really feels about her. On the day of the summer festival, Reiner puts together three operations in plan to get Annie to fall in love with Bertholdt, but fails. In the third operation, shaved ice is almost spilled on Annie but Bertholdt rushes towards her in time, only to get himself soaked. After he washes himself, he heads towards a die-cutting stall out of interest while the group tries desperately to find him. Only Annie seems to know where he is and the owner of the die-cutting stall gives Bertholdt two masks thinking that Bertholdt and Annie are dating. Bertholdt blushes hard and tells him otherwise. The two sit on a bench at the area where the entire group is supposed to meet. Sasha is about to call out to them but Reiner and Ymir hold her back. In the end, Bertholdt seems to confess his feelings towards Annie under the cover of fireworks, and she replies with a \"yes.\" Just then, the group eavesdropping fall out of the bushes. Reiner and Ymir congratulate Bertholdt and Annie. Bertholdt actually asked Annie to go die-cutting with him, much to Reiner and Ymir's disappointment. While they are die-cutting, fireworks appear in the sky and everyone is in awe.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/lBJK47ZDl2WZLOl7NZKG5qfXNGR.jpg","vote_average":8,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-12-06","episode_number":10,"episode_type":"standard","id":1245084,"name":"Recommendation! Titan Junior High School","overview":"After a scandal, the president of the student council is ousted and an election is scheduled. Eren, Jean, Reiner, Oruo, Rico, and others all declare their intention of running. When they hear that Ilse Langnar, a member of the newspaper club, may have a notebook that contains the secret to winning the election, they pursue her in an attempt to procure it. Upon finally stealing it, however, they are disappointed to find that it only contains a plan for cleaning the school. When the time comes for the candidates to give their speeches, they all unintentionally alienate the students. However, when Marco attempts to defend Jean, he ends up awing the audience and being elected president by a large margin.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/zf4Y5cMUaeidMxxCGljMSEwkS2d.jpg","vote_average":8,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-12-13","episode_number":11,"episode_type":"standard","id":1245085,"name":"Clear and Sunny! Titan Junior High School","overview":"Eren and his classmates decide to run a cheeseburger stand for the school festival. However, upon opening, they find that they have stiff competition from Rico and her kamameshi stand, the winners of the previous year's snack stand contest. Meanwhile, Jean and Marco end up putting on a performance of Snow White almost single-handed due to the rest of the class working at the cheeseburger stand. As Rico prepares to unveil the giant pot of rice she has been cooking, Armin comes up with a strategy to lure away her customers; they will start offering double the amount of cheese for the same price. However, just as they begin to enact their plan, the Titans attack and carry off the stands, food and all.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/5Y2hT8c3ieB9p8LRskMeFPXxgPk.jpg","vote_average":8,"vote_count":4,"crew":[],"guest_stars":[]},{"air_date":"2015-12-20","episode_number":12,"episode_type":"finale","id":1245086,"name":"Attack! Titan Junior High School","overview":"Following the events of the 104th school festival, Eren vows to get their cheeseburgers back from the Titans, defying the teachers and heading to the Titans' building. Finally making their way to the principal's office, where they believe the cheeseburgers to be located, they find a gigantic key in the center of a small city. As the rest of the class fights to hold off the attacking Titans, Eren carries the key to the keyhole and unlocks it. Inside, they find themselves in what is revealed to be the principal's lunch box, as the Colossal Titan lifts the lid and takes the cheeseburger stand. Enraged, Eren attacks, but is swallowed along with the stand. As his classmates look on in horror, however, the Titan spits him back out, and Eren reveals that he managed to rescue one of the burgers. As the students celebrate their first victory against the Titans, Erwin tells the other faculty that with this victory, human students now have a chance for a happy school life.","production_code":"","runtime":17,"season_number":1,"show_id":63510,"still_path":"/n2XsYnkxYIBMygY7poDfqUdi2Hk.jpg","vote_average":8.5,"vote_count":4,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":69251,"poster_path":"/raE04drTJmjVUn7dzYkgkh82rsW.jpg","season_number":1,"vote_average":8.1}}}