{"adult":false,"backdrop_path":"/dIL6DoQIxtDZN5FlSkFoSSKmlSm.jpg","created_by":[{"id":1243026,"credit_id":"62580d5fafe224006637c775","name":"Jacqueline Wilson","gender":1,"profile_path":"/mfWZ0GqhU4E1RHi4pAaPrr9cl2q.jpg"}],"episode_run_time":[15],"first_air_date":"2002-01-08","genres":[{"id":10762,"name":"Kids"},{"id":10751,"name":"Family"},{"id":16,"name":"Animation"}],"homepage":"https://www.bbc.co.uk/cbbc/shows/the-story-of-tracy-beaker","id":6353,"in_production":false,"languages":["en"],"last_air_date":"2006-02-09","last_episode_to_air":{"id":374254,"name":"Cam's Wedding","overview":"Cam is heartbroken that Tracy won't be a part of her special day, but thanks to Crash and Jackie's wise words Tracy finally sees the light. As she packs her bags to leave the Dumping Ground for good, a brand new version of Tracy Beaker (Amy Sneaker) arrives at the care home - same attitude, same actions! Life goes on regardless.","vote_average":0,"vote_count":0,"air_date":"2006-02-09","episode_number":20,"episode_type":"finale","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null},"name":"The Story of Tracy Beaker","next_episode_to_air":null,"networks":[{"id":15,"logo_path":"/12roOdtGhLUriCtk1Qwu9eD5Nab.png","name":"CBBC","origin_country":"GB"}],"number_of_episodes":125,"number_of_seasons":5,"origin_country":["GB"],"original_language":"en","original_name":"The Story of Tracy Beaker","overview":"The Story of Tracy Beaker is a television programme adapted from the book of the same name by Jacqueline Wilson. It ran on CBBC for five series, from 2002 to 2005 and also contained a feature length episode, Tracy Beaker's Movie of Me, broadcast in 2004, as well as a week of interactive episodes for Children in Need. The theme song was written and performed by Keisha White. All of the five series have been released on DVD and the entire first season has been made available on Netflix .","popularity":5.32,"poster_path":"/iggQkR7r6hfbaJwheZQIixHx9dK.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2004-02-21","episode_count":1,"id":16507,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2002-01-08","episode_count":26,"id":16502,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2003-01-07","episode_count":26,"id":16503,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2004-02-12","episode_count":26,"id":16504,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2004-10-05","episode_count":27,"id":16505,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2006-01-09","episode_count":20,"id":16506,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.2,"vote_count":23,"season_data":{"1":{"_id":"525785e119c29531db28fdde","air_date":"2002-01-08","episodes":[{"air_date":"2002-01-08","episode_number":1,"episode_type":"standard","id":374177,"name":"Tracy's Return","overview":"As the above episode title would suggest, our eponymous heroine is not in the best of moods as she comes back from (presumably we include the word 'yet') another failed fostering attempt – and she is being very loud indeed, much to the dismay of everyone who has ever been involved in trying to match her wayward and yet surprisingly endearing personality with suitable guardians so far...","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"525785e419c29531db2901df","adult":false,"gender":1,"id":1221981,"known_for_department":"Directing","name":"Susan Tully","original_name":"Susan Tully","popularity":6.592,"profile_path":"/w9gjKJN46i1vzvHAzKHhYpydI7o.jpg"}],"guest_stars":[{"character":"Julie","credit_id":"61c5139f19ab590062ed0cde","order":502,"adult":false,"gender":1,"id":3356785,"known_for_department":"Acting","name":"Louise Barrett","original_name":"Louise Barrett","popularity":0.98,"profile_path":null}]},{"air_date":"2002-01-10","episode_number":2,"episode_type":"standard","id":374228,"name":"Dares","overview":"Strange noises fill the Dumping Ground in the middle of the night. Jenny investigates, but it turns out to be Tracy, who is looking through the files for her mum's (Annette Bentley) address. Jenny and social worker Elaine explain to Tracy that her mum knows where she is, but they can't give her mum's address. Soon after, Tracy and Justine compete in a game of dares to win back Tracy's room. Justine covers Jenny in flour, Tracy fills Mike's boots with cheese sauce, Justine steals Jenny's clothes while she is having a shower, and Tracy tries to climb a tree, but Mike climbs after her and pulls her down. Tracy dares Justine to put a worm down her trousers – which she does – but Justine tells Tracy to eat a worm. Tracy hates the idea, but does it, and throws it up later. Justine quits the competition and says Tracy can have her room back. However, after Justine has packed all her stuff, Tracy tells her she can keep the room as she likes her new room better, infuriating Justine.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-15","episode_number":3,"episode_type":"standard","id":374229,"name":"Sneaking In Ben","overview":"Louise is still struggling to choose between Justine and Tracy. Tracy is fed up with waiting for Louise, and stays out too long, missing out on doing her chore. While out, Tracy meets Ben again wants to show him the Dumping Ground, but Jenny says no, as she is angry that Tracy missed doing her chore. Tracy sneaks Ben in anyway, but Justine and Louise spot him. Justine snitches to Jenny, although Louise begs her not to. When Jenny searches Tracy's room, she finds only Louise, who swears that there is no one else there. However, just before Jenny leaves, she hears Ben's mobile phone, and discovers him hiding in the wardrobe. Meanwhile, chef Duke is having problems with rats in his kitchen. Jenny instructs him to get rid of them in a humane manner. Duke catches a rat and is about to kill it, but Ryan and Zac persuade him to let it go.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-17","episode_number":4,"episode_type":"standard","id":374178,"name":"Cam's First Visit","overview":"There is much activity in the Dumping Ground. They are expecting a visitor – writer Cam Lawson, who is writing an article about the care home. Tracy is especially excited, as she wants to be a writer. She even steals older girl Adele's makeup to try to impress Cam. When Cam arrives, she is surprisingly unglamorous, but Tracy is still excited to meet her. However, Justine ruins it by making fun of Tracy's life book in front of Cam, prompting the two to get into a fight and Tracy to be sent to her room. Before Cam leaves, she goes to Tracy's room to make up with her, but Tracy is furious and makes her leave. When Tracy discovers that Cam has left her a fairy cake, she thanks Cam out of her window just as she is leaving, and realises that Cam likes her. Meanwhile, Mike is stressed about Cam's visit and asks for Adele's help to get the house ready. He offers her many things, but Adele will not budge until he agrees to give her an extra late pass for that week. She eventually complies, only to discover that Mike has finished it all.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-22","episode_number":5,"episode_type":"standard","id":374230,"name":"Child of the Week","overview":"Elaine tells Tracy that she will be advertised as Child of the Week to potential foster parents in the local paper. Tracy is delighted and tells everyone. Elaine is then offered more space in the newspaper, so decides to advertise Louise as well. Tracy is initially upset, but she and Louise eventually bond over it. They agree that they should not smile, but look sad to still be in the care home and attract more foster parents that way. However, Justine and photographer Brian convince Louise to smile. Tracy is furious, but Ben persuades her that she would be doing herself more favours to smile, so Tracy remakes both her own and Louise's adverts and sneaks them into the office. Her own advert is now extremely flattering and asks expressly for very rich foster parents, and Louise's photo now has a bag over Louise's head. Meanwhile, Duke decides to start a new healthy food regime, and makes battered courgettes. The kids convince him that they like them, while secretly flushing them down the toilet.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-24","episode_number":6,"episode_type":"standard","id":374179,"name":"The Truth Is Revealed","overview":"Justine's dad has given her money to decorate her bedroom. Tracy wants to do the same and is very angry when she is not allowed. She storms out of the house to meet Ben, who shows her his treehouse in the woods. Later, Ben accidentally falls down the tree, and Tracy runs to get Mike to help. Ben gets Mike to take him home, but Tracy is furious when she discovers he's not a 'street kid' as he had told her, but lives in a very grand house with his mum. Meanwhile, the rest of the house help Justine with her bedroom, much to the annoyance of Adele, who has a school project to complete and is distracted by the noise. The project turns into a fiasco as Justine gets increasingly more demanding, making poor decisions and blaming everyone else. Eventually, everyone stops. However, Adele's project turns out to be about designing a room, and she finishes it off for her.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-29","episode_number":7,"episode_type":"standard","id":374182,"name":"Neve Ever Wanna See Him again","overview":"It's Tracy's birthday, but unfortunately for her, it's also younger boy Peter's birthday. He's extremely excited, but Tracy is doing her best to appear cynical and detached. Justine laughs at Tracy's hopes to get something from her mum, but the smile is wiped off her face when a card arrives in the post for Tracy. Mike notices that the card from Tracy's mum is written in brown felt pen and realises that Peter left the card. However, it fooled Justine and Louise, and Tracy says it is the nicest thing anyone has ever done for her. The party still goes wrong when Duke accidentally destroys Tracy's birthday cake and the sound system goes wrong. Tracy sulks in her room. Adele lures her downstairs and reveals that Ben has provided a new sound system. Tracy and Ben make friends again.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-01-31","episode_number":8,"episode_type":"standard","id":374181,"name":"1000 Words About Tracy","overview":"Cam makes a return visit to the home to interview Tracy for her article. As Tracy and Cam talk, Tracy tries to talk Cam into looking for her mum for her. Cam agrees, and is furious with herself when Jenny tells her that Tracy's mum already knows where she is, and doesn't want to get in touch. Tracy is upset and angry, but later forgives Cam, and they agree to meet up again. Meanwhile, Cam asks Justine and Louise to make a docu-soap about life in the home. They start to make one, until Ryan points out that they could make a more interesting film and make money with it. They set up a situation with excitable Maxy, who slips in the kitchen and pulls lots of things down on him, while Justine films. The staff are furious, but the kids are elated to have made a funny film – until they realise that Justine forgot to turn the camera on. Zac discovers that they still have entertaining footage of Justine falling over when they were making the docu-soap.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-05","episode_number":9,"episode_type":"standard","id":374180,"name":"Bad Peter","overview":"Tracy is excitedly waiting to be taken out for the day. However, when Tracy sees who's going to be taking her out – Terry and Jill Brown – she's horrified to see they are old. On the other hand, Peter likes the look of them. The day out doesn't go well, as Tracy is too lively for Terry and Jill to cope with. But a vengeful Tracy persuades Peter to become bad so that the Browns will not foster him, bringing chaos to the DG and completely shattering her friendship with Peter.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-07","episode_number":10,"episode_type":"standard","id":374175,"name":"Cam's Place","overview":"It's a busy Saturday at the Dumping Ground: Tracy is going out with Cam, Louise with an aunt, Justine is waiting for her dad and the boys are waiting for a football match to start.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-12","episode_number":11,"episode_type":"standard","id":374183,"name":"Dumping Ground Virus","overview":"Tracy is ill. It soon spreads around the Dumping Ground, incapacitating everyone but Adele and Justine, the latter of whom is trying her best to get the virus so she can avoid seeing the dentist. When Maxy picks up the phone to Elaine, he lets slip that everyone is ill, and she comes along to help, inadvertently making the situation much worse. Tracy and the others try to make out that Elaine has the virus to get rid of her, but it doesn't work, so Tracy has to think of another plan. When Adele mentions to Tracy that Elaine told her that another care home is also ill, Tracy gets Maxy to tell Elaine that the other home needs her. Elaine reluctantly leaves, and when Tracy announces this to the house, everyone appears to suddenly be better...","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-14","episode_number":12,"episode_type":"standard","id":374185,"name":"Justine's TV","overview":"Tracy has been made editor of the Dumping Ground newsletter, and is determined to find an exciting story. When she learns that Elaine has given Justine permission to have a television in her room, even though it is against the house rules, she starts a campaign to get Elaine sacked. Meanwhile, the kids begin paying Justine to allow them to watch her TV at night, but chaos occurs when she finds out that she is double booked by Adele and the boys.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-19","episode_number":13,"episode_type":"standard","id":374184,"name":"Tracy and Cam Row","overview":"Tracy is becoming increasingly frustrated with Cam, who has still not decided whether or not to foster her. Banned from phoning her, Tracy enlists Ben's help to go to see Cam in person. When they arrive at her flat, Cam is out, so Tracy and Ben rearrange the furniture, play music and eat her food. Meanwhile, Justine and Louise go head-to-head with Zac and Ryan when they begin washing cars for money, leading to a big waterfight outside the DG.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-21","episode_number":14,"episode_type":"standard","id":374186,"name":"Sleepover","overview":"The girls have been invited to a sleepover, but the rules of the care home don't allow them to go. The three of them unite in their determination to go anyway. Meanwhile, the boys are camping outside in the back garden.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-26","episode_number":15,"episode_type":"standard","id":374187,"name":"Parent's Evening","overview":"It's Tracy's parents' evening and she has to put up with Elaine the Pain seeing her teacher. Elaine is worried about Tracy's schooling and is expecting a bad report – if she gets to see Tracy's teacher that is. Meanwhile, Peter has trouble with a bully and the boys and Ben pitch in to change his clothing style.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-28","episode_number":16,"episode_type":"standard","id":374188,"name":"The Postcard","overview":"Justine is giving her dad a hard time for not visiting when he said he would. He said he left a message – and he did. Tracy took the message, but just forgot to pass it on. Meanwhile, a postcard arrives to the DG addressed to Tracy – from her mother. Is it genuine?","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-05","episode_number":17,"episode_type":"standard","id":374189,"name":"Where's The Work","overview":"Tracy will not hand in her homework. She claims a dog ran off with her book, but not even Elaine the Pain will fall for that one. She insists that Tracy is lying to cover up for not doing the homework.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-07","episode_number":18,"episode_type":"standard","id":374190,"name":"Helpful Tracy","overview":"Tracy is worried that her behavioural problems are what's putting Cam off fostering her. She proclaims that she will become the nicest, kindest, most helpful person around. Meanwhile, it's Maxy's clothing allowance day and it nearly ends in disaster when Maxy locks Jenny's minivan keys and then Mike's car keys in the van, all over a pair of trainers that Jenny liked but Maxy didn't.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-12","episode_number":19,"episode_type":"standard","id":374176,"name":"New Girl","overview":"Samantha is an eleven-year-old girl whose life is dominated by her mother. When her mother is rushed to hospital, Samantha must stay at the DG, where she strikes up a close bond with Tracy. Meanwhile there is a headlice epidemic in the house.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-14","episode_number":20,"episode_type":"standard","id":374191,"name":"Treasure Hunt","overview":"Elaine has decided the best way to get everybody together will be a Treasure Hunt. They will learn all about friendship and teamwork. Naturally, it is doomed.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-19","episode_number":21,"episode_type":"standard","id":374231,"name":"Romance","overview":"Tracy wants Elaine to hurry up Cam towards fostering. Elaine explains that fostering would be a busy step for a busy single woman. Tracy immediately sees a solution: find Cam a man and they can get married. She seems to like Mike, so he'll do. Meanwhile, in the Dumping Ground, the tables are turned on Jenny and Duke when Justine and Louise respectively fill in for their positions following a row over Louise using Justine's make-up.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-21","episode_number":22,"episode_type":"standard","id":374192,"name":"Temporary Care Worker","overview":"It's clothing allowance day. Tracy has been saving up and wants Jenny to take her out to get a whole new wardrobe. What she gets is Leah, a temporary care worker who's filling in while Jenny's in hospital following an operation to remove an ingrowing toenail.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-26","episode_number":23,"episode_type":"standard","id":374194,"name":"Cut the Weed","overview":"It's Peter's last day at the Dumping Ground before he goes to live with Terry and Jill. Everyone attends his party, except Tracy, who is secretly looking after two giant African land snails for the weekend. Later that night, it's full moon, and Zac has hung up garlic all over his and Ryan's bedroom so as to scare off vampires. And the snails escape from their cage. So, soon enough, everyone is creeping about all over the DG.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-28","episode_number":24,"episode_type":"standard","id":374193,"name":"Need Armbands","overview":"Tracy has had enough of waiting for Cam. They were supposed to go swimming, only for Cam to stand her up. Tracy visits Ben and realises his parents would be perfect for her.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-02","episode_number":25,"episode_type":"standard","id":374195,"name":"Miss You","overview":"The video recorder is broken. The kids decide to have a sale and buy a DVD player, but the items they want to sell don't amount too much, so it's a perfect opportunity to clean out the loft. The mood for selling is shattered however when Mike announces that he is leaving the Dumping Ground to go to another care home.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-04","episode_number":26,"episode_type":"finale","id":374232,"name":"The End!","overview":"Cam has to buy a new flat. When Tracy finds out, she's desperate to help make sure there will be a good bedroom for her. Cam still won't agree to fostering Tracy and the two get into a huge row. Eventually the row is resolved and Cam asks Tracy to move in with her. Tracy agrees, packs straight away and has a lovely goodbye from all the staff and children.","production_code":"","runtime":15,"season_number":1,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":16502,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"525785e119c29531db28fde9","air_date":"2003-01-07","episodes":[{"air_date":"2003-01-07","episode_number":1,"episode_type":"standard","id":956869,"name":"Back & Bad","overview":"Tracy lands back at the Dumping Ground with a bang after setting fire to Cam's kitchen. She swears never to see or talk to a distraught Cam again. Meanwhile, a new trainee careworker called Nathan arrives. When the other kids find they can't prank him, they seek the help of Tracy.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-09","episode_number":2,"episode_type":"standard","id":374263,"name":"Bedsit","overview":"Tracy is bored of being fussed over by everyone after her untimely return to the Care Home, so when she finds Adele's new bedsit address she decides go and visit her. After being wound up by the other kids, Tracy turns the garden shed into her bedsit. When the others decide to make bedsits of their own, Dolly causes havoc by transforming the bathroom into her bedsit.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-14","episode_number":3,"episode_type":"standard","id":374260,"name":"Brothers","overview":"Nathan is working on a food project and as well as providing nothing but healthy salads at mealtimes, he bans Dolly from a certain orange drink, making her intent on revenge. Meanwhile, Lol and Bouncer buy lots of unhealthy food from Nathan's website and create a shop in the cellar called \"The Sugar Shack\".","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-16","episode_number":4,"episode_type":"standard","id":374224,"name":"Action Therapy","overview":"Tracy has still not been in contact with Cam after coming back to the DG so Elaine resolves to get them talking with a series of role-play and trust exercises.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-21","episode_number":5,"episode_type":"standard","id":374223,"name":"Alien","overview":"A spooky sensation has taken over the DG, with Lol making horror-movies and strange noises in the middle of the night. Finally, the mystery is revealed – a new girl has arrived called Amber.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-23","episode_number":6,"episode_type":"standard","id":374271,"name":"Doggie","overview":"A stray dog is roaming the corridors of the DG and Dolly gets upset as he reminds her of a foster family's pet. Seeing Dolly sad, Tracy tries to help by offering to foster ‘Fang' and they pursue him until he's safely locked up in Tracy's bedroom.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-28","episode_number":7,"episode_type":"standard","id":374265,"name":"Bad Girls","overview":"Tracy sees Amber's bad girl gang and immediately wants to become a member. Meanwhile, Louise is tired of being a goody-goody and has a fashion and personality makeover, inspired once again by Amber's presence.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-30","episode_number":8,"episode_type":"standard","id":374221,"name":"Big Fight","overview":"Justine and Tracy have an argument over the TV remote control and, forbidden to fight by Elaine, set up Champions to wrestle on their behalf. But the two boys in question, Bouncer and Ben, are not keen.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-04","episode_number":9,"episode_type":"standard","id":374258,"name":"Hollywood","overview":"When the home all discover the wonders of the film camera in an attempt to get adopted, everyone tries their own method: Tracy films herself with the camera, with the help of Cam, and talks about why she should be adopted, while Louise tries to cry her way into the hearts of the viewer and Lol and Bouncer try and film the torture that they have to endure in the house, as their way of trying to attract foster parents.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-06","episode_number":10,"episode_type":"standard","id":374262,"name":"Home Truths","overview":"When Dolly makes Nathan play a game of Truth and Dare with her, Duke is worried about the consequences….and rightly so! When Tracy gets cross about being asked why Cam returned her to the home, and at the same time accused of constantly lying, she promises to tell the whole truth until six o'clock!","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-11","episode_number":11,"episode_type":"standard","id":374261,"name":"Day Trip","overview":"Jenny has arranged a trip out for the kids at an Adventure Centre and looks forward to a day of peace and tranquillity at the DG whilst Duke and Nathan accompany the kids into the countryside. When they arrive, it's clear that Gordon the Warden is a bit of a prat.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-13","episode_number":12,"episode_type":"standard","id":374269,"name":"Christmas","overview":"Bouncer and Lol's Aunt is considering taking them on full-time and Lol is excited to be leaving the Care Home for a life free of rules and regulations. But Bouncer has the opposite reaction – he's quite at home at the DG and bad Christmas memories of boiled chicken nuggets make him yearn to stay.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-18","episode_number":13,"episode_type":"standard","id":374272,"name":"Takeover","overview":"A mystery takes over the DG when chairs are being re-arranged, shoelaces tied together and other spooky phenomena. Bouncer and Lol are convinced it is the Case of the Night Stalker but when it turns out to be Lol sleepwalking, Justine and Louise have a great time teasing him.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-20","episode_number":14,"episode_type":"standard","id":374259,"name":"Work","overview":"Bouncer and Amber are doing badly at school, so Elaine takes charge of their next project – setting up work placements. Her options are extremely dull so Bouncer is inspired to get his own job – as a paperboy.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-25","episode_number":15,"episode_type":"standard","id":374257,"name":"Bridesmaid","overview":"Justine's Dad is getting married to girlfriend Carrie and Justine is to be a bridesmaid. But her Dad's unfortunate choice of dress leaves her so miserable that Tracy and the girls try to help. Several customisations later, the dress is in shreds and Adele manages to swoop to the rescue. Adele's work is later ruined at the DG's \"better-than-posh- restaurant party\" – the mood turns sour due to some appalling table manners from Bouncer, Amber and Dolly, and Justine is made to bear the brunt of it when Amber tosses a pizza at her dress.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-02-27","episode_number":16,"episode_type":"standard","id":374268,"name":"Quiz","overview":"Nathan is inspired after winning a quiz and enters the DG into a Care Home Quiz Competition. But his suggestion coincides with a rather nasty washing incident, which leaves all the kids clothes dyed an unfortunate shade of green proving he's being pretty incapable in his job.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-04","episode_number":17,"episode_type":"standard","id":374226,"name":"2-Timing Adele","overview":"Adele's mobile is being repaired and soon everyone at the Dumping Ground is tired of taking messages from all her boyfriends. But they soon realise that each boy offers a different range of goodies for them all – and set about getting their guy instated as Adele's ultimate beau.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-06","episode_number":18,"episode_type":"standard","id":374264,"name":"Secrets and Lies","overview":"Fears that he and his brother will be put into different schools lead Lol to ‘bug' a big staff meeting. But he's tricked when Amber gets to the tape before he can, and alarmed when she begins to fuel rumour and suspicion about the subjects discussed by the staff.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-11","episode_number":19,"episode_type":"standard","id":374256,"name":"Music","overview":"Inspired by Adele joining a band and sick and tired of sharing everything, Tracy decides she'll learn to play a musical instrument and Duke gets her a saxophone via Elaine. Meanwhile, after having been snitched on by Dolly about the graffiti on her bedroom walls, Amber causes havoc when Tracy is forced to share her room for the night.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-13","episode_number":20,"episode_type":"standard","id":374270,"name":"Family Tree","overview":"A school project has Tracy, Justine and Louise working on their ‘family trees' which brings out some intense feelings. Later, when Louise is about to meet a potential new foster family, she is worried at the thought of losing not only her best friend Justine but everything she knows and loves about the DG.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-18","episode_number":21,"episode_type":"standard","id":374222,"name":"Ben's Party","overview":"Amber accuses Ben of being dull so he decides to throw a huge party while his parents are out and invites all the DG kids along. Tracy doesn't get an invite when she doesn't stick up for him.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-20","episode_number":22,"episode_type":"standard","id":374267,"name":"Get Lost","overview":"When Tracy hears that Ben's Aunt and Uncle are visiting, she lands herself an invitation to his house – and gives Kate and Jasper the run-around thinking that she's a rich kid. Back at the DG, Dolly manages to wear 3 members of staff out all by herself.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-25","episode_number":23,"episode_type":"standard","id":374255,"name":"The Long Goodbye","overview":"It's Louise's last day at the DG, as she's going to be fostered by the Morris family. Sorting out her belongings, she tries to put a brave face on her worries about leaving the DG, her friends and especially Justine. And things look up for Amber as she finds a couple who share her enthusiasm for motorbikes and mayhem.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-27","episode_number":24,"episode_type":"standard","id":374266,"name":"Genius at Work","overview":"After a series of experimental art trials (including inscribing the letter ‘D' all over Duke's face and clothes) Tracy is grounded and is instructed to try to cheer Justine up, who is depressed that Louise has left. Meanwhile, Ben is ill, and Lol and Bouncer use this as a perfect opportunity to play with his games.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-01","episode_number":25,"episode_type":"standard","id":374273,"name":"Nathan's Assessment","overview":"Elaine arrives at the DG to check that Nathan is coming up to scratch as a trainee. After interviewing all the kids and a cross Tracy (whom he has cancelled a bowling trip with) and discovering that he hasn't completed one piece of coursework, her report looks worrying – she has the power to fail him.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-03","episode_number":26,"episode_type":"finale","id":374225,"name":"Home and Hosed","overview":"Ben's Aunt and Uncle, Kate and Jasper, arrive at the DG – and Tracy is informed that they want to foster her. But Ben is curiously unhappy about the plan.","production_code":"","runtime":15,"season_number":2,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":16503,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"525785e119c29531db28fdf4","air_date":"2004-02-12","episodes":[{"air_date":"2004-02-12","episode_number":1,"episode_type":"standard","id":374282,"name":"Leavin' on a Jet Plane","overview":"Tracy Beaker reckons she's top dog at the Dumping Ground, but new head care worker Shelley has other plans. Fearing that Tracy has become too settled, Shelley suggests it's time for Tracy to move to another home. She packs her bags and heads over to her best friend Cam's house, only to find that she's leaving for New York. Meanwhile the other kids decide if Tracy goes, they all go. Even Elaine, Nathan and Duke join in with the mutiny after being sick of Shelley's strict rules.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-12","episode_number":2,"episode_type":"standard","id":374294,"name":"Supernatural Shelley","overview":"Shelley opens her office door – eager to hear suggestions for improvements to the Dumping Ground. She's soon faced with a barrage of requests for sweetie machines, wave pools and daily rations of pickled onion crisps! Without a sensible idea in sight, Shelley sets about doing things her way. But her new healthy eating policy, interior design changes and bedroom swaps, go down like a lead balloon.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-19","episode_number":3,"episode_type":"standard","id":374280,"name":"Jackie","overview":"New arrival Jackie Hopper is dragged kicking and screaming to the Dumping Ground. She refuses to accept that she needs to be in care, and that her beloved Grandpa Jack has Alzheimer's and can no longer look after her. She's determined to escape, collect Grandpa from his nursing home and return to their old house together.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-19","episode_number":4,"episode_type":"standard","id":374277,"name":"Free Louise","overview":"Louise couldn't be happier with her new foster family the Morris's, but she attempts to spare the feelings of her parent-less friends in the Dumping Ground by fibbing that they are horrible. Tracy & Justine are horrified that their friend seems to be in trouble.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-26","episode_number":5,"episode_type":"standard","id":374298,"name":"The Bygraves","overview":"Michael has quickly established himself as the Dumping Ground's most unpopular kid – bullying the little ones, snitching on the older ones and constantly sucking up to the staff. Tracy realises that they could get rid of Michael for good if they could find someone to foster him. When Tracy stumbles across The Bygraves (ironically funeral directors), she reckons they might just be desperate enough to even consider Michael.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-02-26","episode_number":6,"episode_type":"standard","id":374281,"name":"Down with School","overview":"Jackie has run away from school so many times, that she now has to be tutored at the Dumping Ground. Faced with another boring Monday morning at school, Tracy and Crash reckon if Jackie can have home schooling, so can they.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-05","episode_number":7,"episode_type":"standard","id":374278,"name":"Crashed and Trashed","overview":"Crash and Tracy are both in lousy moods and fall out at breakfast. When Cam sends Tracy an 'I love NY' T-shirt in the post, Tracy is on cloud nine and can't resist boasting about her exciting new pressie to Crash. Then, when Nathan accidentally ruins the T-shirt, both Tracy and Crash's tempers reach frightening levels.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-06","episode_number":8,"episode_type":"standard","id":374288,"name":"No-One Quite Like Grampa","overview":"Jackie decides that it's finally time to rescue Grandpa, and enlists the help of her new pal Tracy. The girls sneak out of the Dumping Ground, and successfully get Grandpa back to his old house. Meanwhile, Louise is over to visit and Michael's fallen hard for her.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-12","episode_number":9,"episode_type":"standard","id":374286,"name":"Down to Earth","overview":"Tracy can't believe her luck when she wins tickets to a pop awards show. But as Tracy gets ready to leave for the big event, disaster strikes. She suddenly feels desperately unwell and collapses. Tracy comes round the next morning to discover that she's in hospital, and has had her appendix out. Tracy is furious with how everything has turned out, but cheers up when there's a surprise for her... Cam!","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-12","episode_number":10,"episode_type":"standard","id":374291,"name":"Nothing Happens Here","overview":"Tracy thinks it's about time Cam wrote a best seller, and reckons she knows exactly what the book should be about – her of course! Tracy isn't impressed when Cam decides that a book about all the kids in the Dumping Ground would be just the thing. Cam starts gathering stories but becomes increasingly exasperated by everyone's over-eagerness to help.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-19","episode_number":11,"episode_type":"standard","id":374297,"name":"The Tracy Beaker Club","overview":"Dolly, Hayley and Marco get a taste for trouble when they realise just how much fun being bad can be. Tracy thinks they're clueless and brags about all her famous scams – cheese sauce in wellies, running round the garden with the head care workers knickers on your head and eating a worm, to name a few! The little kids are in awe and decide to set up 'The Beaker Club'. However, The Beaker Club's actions nearly cost Dolly her soon-to-be foster family. When the foster family in question turn up at The Dumping Ground and the Club drop ketchup-and-flour bombs on their heads, not realising it's Dolly's soon-to-be foster family, their actions soon bite Dolly on the bum.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-19","episode_number":12,"episode_type":"standard","id":374295,"name":"Powercut","overview":"The Dumping Ground residents are thrown into chaos when there's a sudden power cut. Tracy and the other kids aren't impressed at the prospect of an evening with no TV, music, computers or cooking. Tracy decides to scare the pants off everyone by telling ghost stories.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-26","episode_number":13,"episode_type":"standard","id":374274,"name":"Just Desserts","overview":"Aspiring chef Bouncer takes a small step towards achieving his ambition, by getting a Saturday job in a bakery. Lol can't help feeling at a bit of a loss without his brother around. Meanwhile, Tracy is also feeling sidelined when she discovers that Cam's got herself a snooty literary agent, Zara.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-03-26","episode_number":14,"episode_type":"standard","id":374276,"name":"Mind Your Own Business","overview":"Michael and Crash come to blows when Elaine announces that a new kid Wilson is arriving, and one of them will have to share with him. Meanwhile, Tracy reckons it's about time Louise got her own back on her prankster boyfriend, Adam. All goes to plan until Tracy realises that she's got the wrong guy! Elaine is horrified to discover Wilson emerging from the cellar, covered in flour and rotten eggs. To Tracy's surprise, Wilson lies, saying he coated himself in them on purpose. Tracy appreciates Wilson's gesture, but will not admit to liking Wilson.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-02","episode_number":15,"episode_type":"standard","id":374285,"name":"I Am Not In Love","overview":"Tracy develops a crush on Wilson, but is loath to admit it. Tracy agrees to go with Wilson to visit his Mum in hospital. Tracy agrees, and on a day out with Cam, she can't stop talking about Wilson. Meanwhile, Duke and Shelley are led a merry dance by some amorous text messages. Lol and Crash are responsible, but when the game is up it looks like Tracy is going to get the blame. However, Wilson takes the blame thinking he is doing it for Tracy. When Tracy asks him why he did it, she finally admits her feelings, and they kiss. Unfortunately, Justine is watching from behind.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-02","episode_number":16,"episode_type":"standard","id":374284,"name":"Time Capsule","overview":"Tracy is in a foul mood – Wilson's left without saying goodbye and Justine is teasing her rotten about the kiss. Meanwhile, the other kids dig up a time capsule from the previous owners of the house. They attempt to put together a Dumping Ground time capsule of their own – preparing video diaries, recipes, collages and photographs. Note: In Tracy Beaker Returns, the capsule is found and at some point during Tracy's life she makes clues to the time capsule.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-09","episode_number":17,"episode_type":"standard","id":374287,"name":"Football Trial","overview":"Lol is fast turning into the next David Beckham, and Tracy is quick to notice. Before Lol knows it, Tracy is acting as his manager, has snuck him into a professional football ground demanding that the manager give him a trial. As he stands in awe of the vast stadium, Lol's dream is so close he can almost touch it.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-09","episode_number":18,"episode_type":"standard","id":374299,"name":"We Are Family","overview":"Everyone's intrigued by Bouncer's uncharacteristic behaviour – he's wearing after-shave, off his food and even buying flowers! Eventually it transpires that Bouncer has got himself a girlfriend. He's fallen for his co-worker Kelly, from the bakery. Fearing that Kelly will be put off by his unusual home life, Bouncer fibs that he's from an average 2.4 family.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-16","episode_number":19,"episode_type":"standard","id":374279,"name":"Be Prepared","overview":"Layla is determined to get enough cub scout badges to secure a place on the camping trip. Tracy and Jackie are put in charge of supervising her, but quickly fall out when Tracy suggests that it's time for some Beaker-style assistance. Refusing to cheat, Jackie and Layla struggle on without Tracy.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-16","episode_number":20,"episode_type":"standard","id":374292,"name":"Sufia The Silent","overview":"Tracy's nose is put out of joint when she's forced to share her room with a new arrival – non-English speaking Sufia. However, when Sufia finds herself on the receiving end of Michael's bullying, Tracy is quick to step in and come to her defence. Meanwhile Bouncer, Lol and Jackie get carried away with a game of football, and end up breaking a picture in the lounge, which results in a competition breaking out over the Dumping Ground.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-23","episode_number":21,"episode_type":"standard","id":374289,"name":"Babies Suck!","overview":"Justine is desperate for her Dad and Carrie to ask her home with them for good. However, when they cancel taking her out for the day, Justine begins to doubt that it'll ever happen. Justine fears the worst when she hears that Carrie is on her way round to speak to her. When Carrie arrives and announces that she's pregnant, Justine is certain that her dream will never come true.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-04-23","episode_number":22,"episode_type":"standard","id":374290,"name":"Exploited!","overview":"Everyone is in high spirits when the TV cameras arrive at the Dumping Ground, for the launch of Cam's book 'The Dumping Ground Kids'. Tracy tries to steal the limelight at every opportunity – convinced that she's the inspiration for the star of the book 'Trudy' – a tough no-nonsense kid who is queen of the scammers. But Tracy's in for a nasty surprise, when she finally reads the last chapter & discovers that Trudy is the only kid not to get fostered.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-05-07","episode_number":23,"episode_type":"standard","id":374296,"name":"Be Quiet","overview":"Sick of always being ignored, little Hayley decides that it's time she made her presence felt. Everyone is shocked to discover the normally quiet Hayley stomping her feet, banging saucepans and chucking underwear out of windows! Satisfied that she's made her point, Hayley is soon back to normal. Meanwhile, Tracy goes through the motions with three sets of hopeless potential foster parents on a trip to the science museum.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jake","credit_id":"5a4ed841c3a3683bc3004192","order":501,"adult":false,"gender":2,"id":189689,"known_for_department":"Acting","name":"Ryan Nelson","original_name":"Ryan Nelson","popularity":1.95,"profile_path":"/woIDWV0YzIXYj4oV2AI5Uyl5Mo6.jpg"}]},{"air_date":"2004-04-30","episode_number":24,"episode_type":"standard","id":374275,"name":"Dad Trouble","overview":"Tracy is determined to win Jake & his Dad Tom over. She realises that if she's going to impress them, then she needs to brush up on her skills at being around little brothers & dads. Taking advice from Justine, Tracy treats Tom as though he's a dog – throwing a ball for him to catch and rewarding him with treats.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jake","credit_id":"5a4ed841c3a3683bc3004192","order":501,"adult":false,"gender":2,"id":189689,"known_for_department":"Acting","name":"Ryan Nelson","original_name":"Ryan Nelson","popularity":1.95,"profile_path":"/woIDWV0YzIXYj4oV2AI5Uyl5Mo6.jpg"}]},{"air_date":"2004-04-30","episode_number":25,"episode_type":"standard","id":374293,"name":"The Big Race","overview":"Jackie is caught off guard when she gets a letter from her Grandpa telling her that they're both entered in a charity race tomorrow. Tracy gets busy signing up sponsors, whilst Crash helps Jackie to train for the big day. Meanwhile, Cam comes round to see Tracy in a desperate attempt to make amends. But Tracy is sticking to her guns and Cam finds herself out in the cold.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-05-07","episode_number":26,"episode_type":"finale","id":374283,"name":"Good As Gold","overview":"There's a BBQ party to celebrate Justine leaving. Jackie goes to collect Grandpa to join the party, and is devastated to discover that he is in a wheelchair. Marco dresses up as a magician for the party but can't seem to do anything magic, until he pinches Duke's flip-flops while he is asleep and sends them up high into the sky tied to helium balloons with Duke waking up in time to see what is happening and then tries to catch them back down (but fails to do so) while everyone else is looking on with laughter. Jackie is determined that her Grandpa will still be the fastest Grandpa in the land and soon gets him wheeling at top speed. As Justine heads off to begin her new life, Tracy has to face the fact that she's the last kid from the old Dumping Ground set to be left behind.","production_code":"","runtime":15,"season_number":3,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jake","credit_id":"5a4ed841c3a3683bc3004192","order":501,"adult":false,"gender":2,"id":189689,"known_for_department":"Acting","name":"Ryan Nelson","original_name":"Ryan Nelson","popularity":1.95,"profile_path":"/woIDWV0YzIXYj4oV2AI5Uyl5Mo6.jpg"}]}],"name":"Season 3","overview":"","id":16504,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"525785e119c29531db28fdff","air_date":"2004-10-05","episodes":[{"air_date":"2004-10-05","episode_number":1,"episode_type":"standard","id":374233,"name":"Return to Sender","overview":"Tracy's now living with Cam, and just around the corner at the new location of the Dumping Ground (from Stowey House to Cliffside) is the arrival of the Wellards. They guarantee it won't be a smooth move. But Tracy Beaker's taken back to save the day!","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-07","episode_number":2,"episode_type":"standard","id":374196,"name":"Bouncer vs. Lol","overview":"It's Bouncer's birthday, but he is not telling Lol he's leaving – so how will he react?","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-10","episode_number":3,"episode_type":"standard","id":374234,"name":"In With The Wellards","overview":"Tracy plans to go skateboarding with Jackie, but she has double-booked herself. She also unwittingly promised Cam she'd spend the day with her. Cam lays a guilt trip on her, so a reluctant Tracy cancels her day out with Jackie and lets Cam drag her off to an open day at the local Art Centre. The Wellards see an opportunity for mischief, and entice the dejected Jackie to steal the kids' files and burn them. Jackie gets caught, but she and Crash hatch a plot to pay them back. Meanwhile, Tracy enjoys herself more than she could ever have imagined.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-10","episode_number":4,"episode_type":"standard","id":374235,"name":"Meet The Parent","overview":"Cam's mother comes to stay, and she turns out not to be as bad as Tracy originally thought. Meanwhile, when Chantal laments the lack of real men at the Dumping Ground, Duke and Bouncer set out to prove they're good at all the things a stereotypical man is good at, but they get nowhere. Eventually, they set out to show Chantal that a real man is true to himself.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-17","episode_number":5,"episode_type":"standard","id":374197,"name":"Single White Female","overview":"It's time for fun & games as the kids try to get what they want from new careworker Kez.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-17","episode_number":6,"episode_type":"standard","id":374236,"name":"Can't Buy Me Love","overview":"Tracy and Crash do Cam's food shop, but break the shopping list Cam gave her and spend the shopping money for things Tracy wants, like about fifty boxes of turkey nuggets, and various gadgets. Meanwhile, at the dumping-ground, Layla comes up with her own money-making scam – doing other residents' homework for them (charging fifty pence a sheet). But when Roxy grasses Layla up to Sid, the game's up. And Layla has to clean Roxy's room as punishment.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-24","episode_number":7,"episode_type":"standard","id":374237,"name":"Life is a Cabaret","overview":"Tracy has a weird dream where the Dumping Ground kids behaviour has changed, everybody is singing in this episode, in a style not dissimilar to Chicago. Cam, playing a more-than-passable 'Velma Kelly'-type character as head careworker, has bottled the kids souls and spark, turning them into docile, obedient drones that do housework all day. Note: In this episode we revisit the old Dumping Ground kitchen from Stowey House","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-24","episode_number":8,"episode_type":"standard","id":374238,"name":"Temper, Temper!","overview":"Sid, in a badly conceived idea to compensate for the Dumping Ground having only two members of permanent staff, decides to install a small number of surveillance cameras, which Duke helps to set up, and Lol and Bouncer take mischievous exception to. Meanwhile, Crash, Jackie and Tracy have a master plan as they take nasty pranks from the Wellards in unusual good cheer. But after a while of inordinate kindness and tolerance (especially from Jackie), Chantal becomes emotional, suggesting she hasn't seen much of this in her life so far...","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-31","episode_number":9,"episode_type":"standard","id":374239,"name":"Love and War","overview":"Bouncer has feelings over careworker Jane but the Wellards try their hardest to foil his plans to show his affection. Meanwhile, Hayley suspects that Duke is plotting to poison all the kids with a batch of special soup, that includes a sinister ingredient!","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-07-31","episode_number":10,"episode_type":"standard","id":374240,"name":"Beam Me Up, Scottie","overview":"Hayley's gone to live with Mark and Helen, and Layla is upset because Hayley never told her she would be leaving that day. Meanwhile, Elaine has been pulling out all the stops to find a perfect foster family for Marco.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-07","episode_number":11,"episode_type":"standard","id":374198,"name":"Testing Times","overview":"An Inspector comes to the Dumping Ground and isn't pleased in what he sees at the start.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-07","episode_number":12,"episode_type":"standard","id":374241,"name":"Best of Enemies","overview":"Tracy bumps into her old Dumping Ground enemy, Justine Littlewood, and they later realise they've both been duped/bribed into helping Elaine portray herself as some sort of 'super-careworker' to a journalist at a hotel function. Meanwhile, Lol sets up a show like \"The Jeremy Kyle Show\" when Chantal tries on Crash's parents' wedding ring without his permission.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-14","episode_number":13,"episode_type":"standard","id":374200,"name":"The Finishing Line","overview":"Jackie's grandfather dies and she is having doubts about her future without him.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-14","episode_number":14,"episode_type":"standard","id":374199,"name":"Dear Dad","overview":"Rio and Crash fall out over a game, Rio finds out about Crash's dad and decides to make up lies about his father.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-21","episode_number":15,"episode_type":"standard","id":374201,"name":"Democracy","overview":"Duke is interested in a new job, and it's the battle of the sexes at the Dumping Ground, as the rulebook is out the window.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-21","episode_number":16,"episode_type":"standard","id":374242,"name":"The Snake","overview":"Rio's secret pet snake goes missing, but will he find it? Meanwhile, the Plakova boys try to restore Sid's sense of humour, not really to much avail. **WARNING** End scenes may prove scary for younger viewers...","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-28","episode_number":17,"episode_type":"standard","id":374202,"name":"Rebel Without a Clue","overview":"A new care worker arrives unannounced at the Dumping Ground – could she be better than Sid?","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-08-28","episode_number":18,"episode_type":"standard","id":374243,"name":"The Long Run","overview":"Jackie receives an important letter for a Sports Academy, but will she take it? Meanwhile, after seeing Tracy flash the cash, the rest of the Dumping Ground kids try to sweet-talk a couple from an old folks home into parting with their cash...","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-07","episode_number":19,"episode_type":"standard","id":374203,"name":"Independence Day","overview":"Bouncer moves ever closer to the big shift from Dumping Ground to Halfway House. Meanwhile, will new boy Wolfie settle in with the other kids, or even sleep in the house?","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-09","episode_number":20,"episode_type":"standard","id":374204,"name":"The Beaker Witch Project","overview":"Tracy Beaker's very own 'The Blair Witch Project'. Things go 'bump' in the night.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-14","episode_number":21,"episode_type":"standard","id":374244,"name":"Roxy the Rock","overview":"In a 'no grown-ups' episode, the challenge for Queen of the Dumping Ground begins. The only two contenders, Tracy and Roxy, battle out challenges for the title. Meanwhile, Chantal receives a letter and present from her dad as it's her birthday, while Lol and Bouncer try to get into the Guinness Book Of World Records for 'Standing On Your Head In The Airing Cupboard All Day'.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-11-16","episode_number":22,"episode_type":"standard","id":374245,"name":"We're off the Map Now","overview":"The kids at the Dumping Ground have planned to meet Tracy and Cam at Carters Woods for Jackie and Bouncers last day. At the end of this episode, a big surprise is waiting for Tracy and Cam.","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":23,"episode_type":"standard","id":374205,"name":"Parties With Pudsey (5)","overview":"","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":24,"episode_type":"standard","id":374206,"name":"Parties With Pudsey (3)","overview":"","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":25,"episode_type":"standard","id":374207,"name":"Parties With Pudsey (2)","overview":"","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":26,"episode_type":"standard","id":374208,"name":"Parties With Pudsey (1)","overview":"","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":null,"episode_number":28,"episode_type":"finale","id":374209,"name":"Parties With Pudsey (4)","overview":"","production_code":"","runtime":15,"season_number":4,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":16505,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"525785e119c29531db28fe0a","air_date":"2006-01-09","episodes":[{"air_date":"2006-01-09","episode_number":1,"episode_type":"standard","id":374246,"name":"Caring and Sharing","overview":"Life at the Dumping Ground continues without Tracy who is on holiday with Cam. However life isn't great at the Littlewood home. Justine is reminded of how badly her dad let her down in the past when she is forced to move out of her room to make way for her cousin John and his dog Bruce who are moving in with them. Justine returns to the DG where she hopes to find security, but gets more than she bargained for when she discovers she is sharing a room with new girl Rebecca.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525785e619c29531db290442","order":500,"adult":false,"gender":2,"id":1220545,"known_for_department":"Acting","name":"Antony Worrall Thompson","original_name":"Antony Worrall Thompson","popularity":2.63,"profile_path":"/nbiaMy5yBlrK7dis5gkrJhdx1Yg.jpg"}]},{"air_date":"2006-01-10","episode_number":2,"episode_type":"standard","id":374211,"name":"Too Many Crooks","overview":"Strange belongings are going missing in the DG. Who is the crook? Is it Lol who is trying to get used to life without Bouncer? Or Justine and Rebecca who would do anything to set the other up? Or Wolfie who looks like he's had enough and is packing a bag to leave the DG for good?","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-11","episode_number":3,"episode_type":"standard","id":374210,"name":"Chantal's Goodbye","overview":"Chantal leaves with her Dad, creating a huge split for the Wellard threesome. Elaine brokers a meeting between the stubborn Justine and her Dad - but Justine feels forced out by her cousin John and they get nowhere.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-12","episode_number":4,"episode_type":"standard","id":374247,"name":"Free Piggy","overview":"Elaine runs an Open Day at the DG. Roxy aims to cause havoc with her sidekick Rio, but he proves an unwilling partner - even donning a clean shirt to impress potential new parents. Layla and Wolfie try to free Mike's free-range pig! The day ends in chaos but nothing prepares them for the shock return of Tracy Beaker to the Dumping Ground. Tracy has decided that she can't live with Cam anymore because Cam wants her new boyfriend Gary to move in with them.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-16","episode_number":5,"episode_type":"standard","id":374212,"name":"Scary Milly","overview":"Something very weird is happening at the Dumping Ground - there is mysterious writing on the wall, toys coming to life and kids being locked up. Could it have anything to do with the new arrival Milly? Or is it the voodoo mask the boys have found in the attic?","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-17","episode_number":6,"episode_type":"standard","id":374214,"name":"Life Coach","overview":"Jackie returns to the DG apprantly injured. She doesn't seem very happy due to the arrival of her Grandpa's best friend, Flying Freddie Murpher and Tracy tries to find out what's wrong. Meanwhile Crash isn't very happy after receiving a letter from his dad.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-18","episode_number":7,"episode_type":"standard","id":374213,"name":"Frankelainestein","overview":"Elaine transforms herself into a chic, orderly professional woman. Ditsy Alice arrives at the DG and Bouncer offers to stand in as Marco's Mum on Mothering Sunday.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-19","episode_number":8,"episode_type":"standard","id":374248,"name":"Tracy's Fantasy","overview":"Tracy gets a knock to her head and life at the DG is turned on its head with the adults behaving as their charges would, for one whole day of havoc at the DG. Nothing is the same - even Milly has an attitude. Tracy gets more than she bargains for when she wakes up with a conscience about Cam.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-23","episode_number":9,"episode_type":"standard","id":374249,"name":"Cash Cows","overview":"When the kids find stacks of cheques made out to Wolfie, a major competition breaks out as the kids try to wheedle the cash out of him. When Wolfie finds out he's devastated but eventually decides to splash the cash on something fab for the DG. Bouncer starts inventing reasons for him to stay at the DG and help out - he's finding life at the halfway house a bit lonely.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-24","episode_number":10,"episode_type":"standard","id":374215,"name":"Telling Tales","overview":"Shelley returns to the DG and is dismayed at the bad behaviour going on. She insists that the kids spend the day thinking about their bad behaviour - boredom turns to fantasy as the kids imagine how they'd get their own back on the adults, as they star in their favourite films.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-25","episode_number":11,"episode_type":"standard","id":374217,"name":"A Dog's Life","overview":"Alice and Layla attempt to find a home for a stray dog, while Tracy writes an article on life at the DG that shows Cam just how much she enjoys living there. The kids are horrified when their dream foster parents decide to take the dog home instead of one of them.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-26","episode_number":12,"episode_type":"standard","id":374216,"name":"Whodunnit?","overview":"Someone has 'iced' poor Elaine. Shelley is furious and demands the culprit owns up - but no one does. The kids have an hour to work out 'whodunit'.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-30","episode_number":13,"episode_type":"standard","id":374250,"name":"Spare Dad","overview":"Crash has reluctantly agreed to meet his dad. After a bumpy start the reunion goes well - maybe his dad has changed after all. However his dad takes things a step too far when he starts dictating their future together. This is too much for Crash and he tells his dad as much. His dad is sad but proud of his son who has managed to take control of his life. Crash decides to stay at the DG for now but there is a glimmer of hope that their relationship isn't beyond repair.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-01-31","episode_number":14,"episode_type":"standard","id":374218,"name":"Operation Careworker","overview":"Shelley's brief time at the DG is up. The kids have to pull out all the stops when Shelley and Elaine interview for a new head careworker. But who is the ideal person for the job? Perhaps the answer has been under their noses all along.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-01","episode_number":15,"episode_type":"standard","id":374251,"name":"Bouncer's Kitchen","overview":"When Mike introduces Bouncer as the new DG chef, the kids are thrilled - until he turns Jamie Oliver on them and produces manky 'macrobiotic' health food. The lack of additives in their diet has a dramatic effect on their behaviour - Rio starts doing yoga which is more than Roxy can cope with.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-02","episode_number":16,"episode_type":"standard","id":374219,"name":"Love All","overview":"Elaine and Mike hold a valentine's party at the DG - Rebecca pulls out all the stops to ensure Crash takes her to the party instead of Justine. In doing so Rebecca reveals her true 'evil' side and her cover is blown in spectacular style. Milly and Marco play cupid - with mixed success!","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-06","episode_number":17,"episode_type":"standard","id":374220,"name":"Toddler In Town","overview":"When Mike bumps his head, Elaine has to take him to the hospital, leaving Justine in charge of the DG. Justine loves the sense of control until a toddler is dumped on the doorstep and she finds herself in charge of this errant ankle-biter.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-07","episode_number":18,"episode_type":"standard","id":374252,"name":"Two's A Crowd","overview":"It's time for Marco to leave the DG with his dream family - but how can he leave Milly behind? Justine's Dad brings her cousin John along to the guest day. Justine reacts badly at first, but then comes some way to accepting the situation. Meanwhile, someone is going around sabotaging Guest Day.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-08","episode_number":19,"episode_type":"standard","id":374253,"name":"Moving On","overview":"Just as Lol prepares to leave the DG for the halfway house, Tracy agrees to spend time with Cam and Gary and, to her surprise, they get on brilliantly... until Cam drops the bombshell that they're getting married - this is way too much for Tracy to handle and she wants nothing to do with the 'sordid' affair.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-02-09","episode_number":20,"episode_type":"finale","id":374254,"name":"Cam's Wedding","overview":"Cam is heartbroken that Tracy won't be a part of her special day, but thanks to Crash and Jackie's wise words Tracy finally sees the light. As she packs her bags to leave the Dumping Ground for good, a brand new version of Tracy Beaker (Amy Sneaker) arrives at the care home - same attitude, same actions! Life goes on regardless.","production_code":"","runtime":15,"season_number":5,"show_id":6353,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":16506,"poster_path":null,"season_number":5,"vote_average":0}}}