{"adult":false,"backdrop_path":"/d8gq52JOYJA5VEgp7QeDyM0YExX.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2015-08-18","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.history.com/shows/outlaw-chronicles-hells-angels","id":63754,"in_production":false,"languages":["en","fr"],"last_air_date":"2015-09-22","last_episode_to_air":{"id":1107264,"name":"Sonny vs. George","overview":"","vote_average":0,"vote_count":0,"air_date":"2015-09-22","episode_number":6,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":63754,"still_path":"/qcKtDevthT88wTjnH0wOLqJLcOF.jpg"},"name":"Outlaw Chronicles: Hells Angels","next_episode_to_air":null,"networks":[{"id":65,"logo_path":"/9fGgdJz17aBX7dOyfHJtsozB7bf.png","name":"History","origin_country":"US"}],"number_of_episodes":6,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Outlaw Chronicles: Hells Angels","overview":"The Hells Angels are the single most notorious motorcycle club in history. They’re also one of the most secretive organizations on the planet. Members are known to take revenge on each other for talking. Now, for the first time ever, a Hells Angels member will bare all the club’s secrets.  A former angel will come clean. He’ll tell the world about everything from initiation rites to murder for hire.","popularity":2.489,"poster_path":"/yhomZFVysXdrv8sC38tn8vUMRVe.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2015-08-18","episode_count":6,"id":69889,"name":"Season 1","overview":"","poster_path":"/twqwoS4eTnHNlH9KvQ3qLTGSsU.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"},{"english_name":"French","iso_639_1":"fr","name":"Français"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":7.333,"vote_count":3,"season_data":{"1":{"_id":"55dd3a79925141744b0010ac","air_date":"2015-08-18","episodes":[{"air_date":"2015-08-18","episode_number":1,"episode_type":"standard","id":1107261,"name":"The Angels Code","overview":"The Hells Angels are one of the most infamous organizations in the world, but what do we really know about them? Are they a vast criminal enterprise or just a group of free-spirited motorcycle enthusiasts? Do you really have to kill a man to join? Only a few people alive know the answers, and none have ever broken the club’s code of silence–until now. Former Hells Angels’ President George Christie, the man some call “the last American outlaw,” reveals the secret set of rules that govern admission and conduct in the Hells Angels. From the tests and humiliations a potential member must go through, to the strategies for avoiding the law, to the punishments meted out to anyone who betrays his brothers, Christie unwraps the untold saga of the most notorious American legends.","production_code":"","runtime":null,"season_number":1,"show_id":63754,"still_path":"/hiAoIdXP5F3TMCokOxDaSQtcK8T.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-08-25","episode_number":2,"episode_type":"standard","id":1101111,"name":"The Wild Life","overview":"What’s it like to party with the world’s most notorious motorcycle club, the Hells Angels? Former Angels president George Christie reveals for the first time the debauchery, delights and dangers that go into the club’s revelries. These are no-holds-barred accounts of outlaw fun at its most extreme, as Hells Angels reach for a thrill that can come only with women, alcohol, drugs and violence. Christie decodes how the colors of a member’s wing tattoos indicate bizarre sexual conquests, but how brothers and bikes always come first. We’ll see the carnage of the all-night runs to wild parties, the brutal mind games members play with each other, the deadly price paid by those who take it too far, and how drugs and alcohol fuel the frenzy. If you’re a Hells Angel, every party is a test of your ability to keep up–and if you don’t, you’ll find yourself fighting to stay alive.","production_code":"","runtime":null,"season_number":1,"show_id":63754,"still_path":"/fpTnVPhinIWHtMSzUdQfSAUKlzk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-01","episode_number":3,"episode_type":"standard","id":1107262,"name":"Making Money","overview":"From its humble origins as a ragtag collection of misfits and outlaws, the Hells Angels grew into a multimillion dollar empire. For the first time, a real insider (former Hells Angels President George Christie) reveals the means by which members lined their pockets. This episode starts in the psychedelic haze of the '60s and the discovery that there are big bucks to be made peddling hi-grade LSD to the booming drug culture. Expanding into manufacture and distribution of methamphetamine, some members of the Angels find themselves a prime target for attacks by rival gangs and law enforcement. Christie reveals how these Angels operated, their tricks for evading arrest and convictions, and the discipline they enforced to prevent infiltration, culminating in his own unprecedented attempt to make peace with rival motorcycle club The Outlaws--a move many consider a suicide mission.","production_code":"","runtime":null,"season_number":1,"show_id":63754,"still_path":"/mIb8BuFddbQ0GgqIX2yzlxxRKgv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-08","episode_number":4,"episode_type":"standard","id":1105212,"name":"At War","overview":"The Hells Angels are the world’s most notorious outlaw motorcycle clubs but they are not the world’s only outlaw motorcycle club. In the decades since the Angels’ formation many challengers have emerged, and one group in particular has threatened their status at the top: The Mongols. Why do Hells Angels and Mongols have such a bitter rivalry? Why have they spent the last 40 years fighting and even killing each other? Former Hells Angels leader George Christie reveals the inside story of the Hells Angels’ war with the Mongols. Beginning with an argument over a woman that escalates to betrayal and murder, Christie reveals treacherous maneuverings including highway shootings, bombing of enemy clubhouses and even attacks at biker funerals. It’s an intimate look behind the front lines of a conflict that has been raging across America for 40 years–and still rages on today.","production_code":"","runtime":null,"season_number":1,"show_id":63754,"still_path":"/qVR6qvNhd80oUvkmtKUYEStiFOb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-15","episode_number":5,"episode_type":"standard","id":1107263,"name":"Breaking the Law","overview":"The show looks at how federal authorities attempted to catch gang leaders includes a look at efforts to infiltrate the Angels and armed raids on clubhouses.","production_code":"","runtime":null,"season_number":1,"show_id":63754,"still_path":"/oCSjuRhK4LYwqTX2JyzJebzpJNa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-09-22","episode_number":6,"episode_type":"finale","id":1107264,"name":"Sonny vs. George","overview":"","production_code":"","runtime":null,"season_number":1,"show_id":63754,"still_path":"/qcKtDevthT88wTjnH0wOLqJLcOF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":69889,"poster_path":"/twqwoS4eTnHNlH9KvQ3qLTGSsU.jpg","season_number":1,"vote_average":0}}}