{"adult":false,"backdrop_path":"/j3v8vhRfpz2HEyIb2VPIkX7ZoDW.jpg","created_by":[],"episode_run_time":[45],"first_air_date":"2010-07-10","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.smithsonianchannel.com/shows/aerial-america/701","id":64162,"in_production":false,"languages":["en"],"last_air_date":"2021-12-20","last_episode_to_air":{"id":3404567,"name":"Dazzling Destinations","overview":"A scenic cross-country flight, from the mountains to the prairies and from sea to shining sea.","vote_average":0,"vote_count":0,"air_date":"2021-12-20","episode_number":8,"episode_type":"finale","production_code":"","runtime":45,"season_number":8,"show_id":64162,"still_path":null},"name":"Aerial America","next_episode_to_air":null,"networks":[{"id":658,"logo_path":"/meU2LRnHcSr0m0Upx5loxHWETqF.png","name":"Smithsonian Channel","origin_country":"US"}],"number_of_episodes":75,"number_of_seasons":8,"origin_country":["US"],"original_language":"en","original_name":"Aerial America","overview":"Take off on a thrilling flight across America. This epic series offers rare glimpses of our nation's most treasured landmarks, all seen from breathtaking heights. From busy cityscapes to quiet landscapes, we capture the history and the pageantry of our amazing country, which is as diverse as the people who occupy it.","popularity":10.706,"poster_path":"/jzkHX2e8BzQjUQkdV7MbGmOzr1u.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"US","name":"United States of America"}],"seasons":[{"air_date":null,"episode_count":0,"id":71381,"name":"Specials","overview":"","poster_path":"/kW1VyRUOfhzAKygvQE69ZrElHrY.jpg","season_number":0,"vote_average":0},{"air_date":"2010-07-10","episode_count":8,"id":71376,"name":"Season 1","overview":"","poster_path":"/a4CeQor8IJTymZGcX5UM35MZuW9.jpg","season_number":1,"vote_average":7.5},{"air_date":"2011-07-10","episode_count":10,"id":71382,"name":"Season 2","overview":"","poster_path":"/cvHErjHrwAuD2Bnezi5hDrQc4y7.jpg","season_number":2,"vote_average":0},{"air_date":"2012-01-08","episode_count":12,"id":71383,"name":"Season 3","overview":"","poster_path":"/wxxSjdscSv99XdXdbGozP1op3tH.jpg","season_number":3,"vote_average":0},{"air_date":"2013-07-14","episode_count":7,"id":71384,"name":"Season 4","overview":"","poster_path":"/78WNEV10MNHKtDHyu3SqZ5gNJS9.jpg","season_number":4,"vote_average":0},{"air_date":"2014-02-23","episode_count":11,"id":71385,"name":"Season 5","overview":"","poster_path":"/lxxFTonrHHqy3dd3NO6rsULWzon.jpg","season_number":5,"vote_average":0},{"air_date":"2015-04-26","episode_count":7,"id":71386,"name":"Season 6","overview":"","poster_path":"/1fj0DjzNW1EGfCVNfhHDTOQYAYj.jpg","season_number":6,"vote_average":0},{"air_date":"2016-04-24","episode_count":12,"id":77755,"name":"Season 7","overview":"","poster_path":"/maaPQn1RnbwKhMPANMbiS58lzYr.jpg","season_number":7,"vote_average":0},{"air_date":"2019-03-03","episode_count":8,"id":97870,"name":"Season 8","overview":"","poster_path":"/mOgaouL3ABAVuEeCf6LeA0U5cHu.jpg","season_number":8,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":5.8,"vote_count":4,"season_data":{"1":{"_id":"561f22ea92514171da001abd","air_date":"2010-07-10","episodes":[{"air_date":"2010-07-10","episode_number":1,"episode_type":"standard","id":1117984,"name":"California","overview":"The Pacific Coast Highway of California offers spectacular views while traveling along the edge of American culture. Buckle up for a non-stop flight over the mansion William Randolph Hearst built, the town Clint Eastwood governed and the farmland where Marilyn Monroe once held the title of Miss Artichoke. We soar over beaches and wine country, across Big Sur redwoods, under the Golden Gate Bridge and into the heart and soul of this magnificent state.","production_code":"","runtime":45,"season_number":1,"show_id":64162,"still_path":"/4WeqZ6hCE7VOR2eYHbEHJpGv0dt.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-17","episode_number":2,"episode_type":"standard","id":1120622,"name":"Hawaii","overview":"Join us on a non-stop journey by air over our nation's most exotic and breathtaking state. From lush green cliffs to black-sand beaches, from ancient ruins to modern city life, this aerial tour reveals the grandeur of the Aloha State. From Molokai to Maui, discover the stunning landscapes and astonishing stories of Hawaii's eight major islands without ever touching the ground.","production_code":"","runtime":45,"season_number":1,"show_id":64162,"still_path":"/t80XuyxqvM1O948nB88vW1XopHM.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-24","episode_number":3,"episode_type":"standard","id":1120625,"name":"Virginia","overview":"It's been called the New World and the Old Dominion. It is the birthplace of eight U.S. presidents, and the legend of Pocahontas. It's the site of Williamsburg, perhaps the most ambitious history lesson in America. Virginia proudly celebrates its past without losing its sense of fun. Join us as we travel across a diverse and rugged landscape into the realm of pirates, the source of myths and the heart of American democracy.","production_code":"","runtime":45,"season_number":1,"show_id":64162,"still_path":"/i0XDfepG7ZNySNFu9l1JG6ZKflV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-31","episode_number":4,"episode_type":"standard","id":1120628,"name":"Connecticut","overview":"From sleeping giants to Captain Kidd's buried treasure, Connecticut isn't as quaint as you think. Join us on an aerial journey across a state rich in Native American legends, colonial history, and good old New England charm. This is where Mark Twain created some of fiction's greatest characters and where Benedict Arnold committed America's greatest act of treason. Savor the state's coastal blue waters and mountains ablaze with autumn colors, from a bird's-eye view.","production_code":"","runtime":45,"season_number":1,"show_id":64162,"still_path":"/cJ14sEm2Sm0pX4zOQYsBXvvSmhf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-07","episode_number":5,"episode_type":"standard","id":1120630,"name":"Tennessee","overview":"Travel from the Great Smoky Mountains to the Grand Olde Opry, from Elvis Presley's Graceland Mansion to a legendary whiskey distillery, Tennessee tells the story of America's expansion west and all the celebration and sadness that came with it. Join us as we soar high above the Volunteer State, journeying over the majestic Appalachian Mountains and the mighty Mississippi River, to see its natural beauty - rugged, inviting and infused with the spirit of a nation.","production_code":"","runtime":45,"season_number":1,"show_id":64162,"still_path":"/rO8sG36WC8kfIkYaER6IlMkv26W.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-14","episode_number":6,"episode_type":"standard","id":1120632,"name":"Vermont","overview":"When Robert Frost penned \"The Road Not Taken,\" he was writing about Vermont, and his poem captures the state's unscathed beauty and independent spirit. This state of freethinking and green living attracts all sorts, from artists like Norman Rockwell and the von Trapp family, to nature enthusiasts drawn to its hiking trails, ski slopes and autumn foliage. This aerial tour over the Green Mountain State captures the beauty and history of a state that chose its own path.","production_code":"","runtime":45,"season_number":1,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-21","episode_number":7,"episode_type":"standard","id":1120633,"name":"Arkansas","overview":"Embark on a journey over the land where settlers' westward journeys began and Bonnie and Clyde's crime spree ended. The Natural State is rich with the stories of brave pioneers, notorious desperadoes, and hanging judges. It's a state with great rivers, great battles and great promise, and the birthplace of Johnny Cash, Maya Angelou and Bill Clinton. Delve into America's wild interior, from the Mississippi River bottomlands to towering mountain peaks.","production_code":"","runtime":45,"season_number":1,"show_id":64162,"still_path":"/jrTvY9j5JTeDQ7DDA81kmqc9Ikx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-28","episode_number":8,"episode_type":"finale","id":1120636,"name":"Rhode Island","overview":"This aerial journey is short on mileage but long on history. Known as the Ocean State, even though 60% of it is covered in woodland and parks, Rhode Island features 400 miles of tidal shorelines and is the sailing capital of the world. With an array of lighthouses and even more stories of rumrunners, pirates and captains of industry, this state represents our nation's progress and its excesses. See it from the sky and witness the East Coast?s tiny gleaming treasure.","production_code":"","runtime":45,"season_number":1,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":71376,"poster_path":"/a4CeQor8IJTymZGcX5UM35MZuW9.jpg","season_number":1,"vote_average":7.5},"2":{"_id":"561f8d1592514171cd0032eb","air_date":"2011-07-10","episodes":[{"air_date":"2011-07-10","episode_number":1,"episode_type":"standard","id":1120638,"name":"Maine","overview":"Take a journey across distant isles, down rugged shores, and into the great wilderness seafarers once called \"The Mainland.\" From Portland to Kennebunkport, Moosehead Lake to Casco Bay, this picturesque expedition offers a stunning bird's eye view of one of the most beautiful states on the Atlantic Coast. See why the Pine Tree State has attracted sailors, artists, presidents, and robber barons for centuries. Discover how Maine's storied past, rich resources, and varied cast of characters have helped shape not just the state, but the nation.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-17","episode_number":2,"episode_type":"standard","id":1120639,"name":"Oregon","overview":"Individualistic, eccentric and freethinking: a mix that's intrinsically \"Made in Oregon.\" These traits belong not just to the people of this diverse state, but also to the landscape itself. From Crater Lake to the High Cascades to the perilous Pacific coastline, this state is full of natural beauty. From Lewis and Clark's search for \"land's end\" to the thousands of emigrants who arrived via the Oregon Trail, the state has always attracted the adventurous type.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":"/8V2xnxV8yOPE3MWZaisHaRcxgJc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-24","episode_number":3,"episode_type":"standard","id":1120641,"name":"South Carolina","overview":"The true spirit and rich history of the South are encapsulated in this first-class journey across the Palmetto State. From Fort Sumter, where the first shots of The War Between the States rang out, to Sullivan Island, the Ellis Island of Slaves, to the cypress swamp where freedom fighter Francis Marion helped turn the tide of the Revolutionary War. Take flight on a journey that showcases American history, pristine beaches, colorful cities, and wild spaces.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":"/8sOql44hKO3pdiveJZSf59BZpXQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-31","episode_number":4,"episode_type":"standard","id":1120647,"name":"Massachusetts","overview":"Henry David Thoreau said of its shores: \"A man may stand here and put all of America behind him.\" In many ways, Massachusetts is America. The state is home to revolutionaries, a haven for artists, and the birthplace of education and higher learning. From the journeys of pilgrims to the ride of Paul Revere, from the witch trials of Salem to the Curse of the Bambino, we invite you on a flight spanning hundreds of years and just as many spectacular sights.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-07","episode_number":5,"episode_type":"standard","id":1120648,"name":"Georgia","overview":"Where the Appalachian Mountains end and a great Civil Rights leader's life began, Georgia is a state rich in natural wonders and history. This aerial tour of the Empire State of the South offers views of Atlanta's skyline, Augusta's legendary golf course, and the rugged barrier island coastline. From the South's most beloved piece of literature to the United State's \"most haunted cemetery,\" this is Georgia, as you've never seen it before.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":"/keJveDx4ic2ndW2Kq6xVmse9LVN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-14","episode_number":6,"episode_type":"standard","id":1120652,"name":"Washington","overview":"Washington is home to some of America's wildest spaces and also its most modern cities. The Evergreen State is a story of mirror opposites: a wet, mountainous, tree-covered west and a dry, flat, open east. It is home to high-tech industries and America's oldest Native American tribes. Experience all sides of Washington State, from thousands of feet in the air, and witness its conflicting worlds merging to form a land of remarkable beauty.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":"/aNpFpo0Ixk2miJuEFaPV6AqgjTB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-21","episode_number":7,"episode_type":"standard","id":1120655,"name":"New Hampshire","overview":"Soar over the most independent-minded state in the Union: New Hampshire. Amid its mountains, rivers, and colonial villages exists a community of people who take their motto of \"Live free or die\" to heart. From an infamous poet who favored the road less traveled, to the founders of both the industrial and fast food revolutions, this state is brimming with free thinkers. Discover the sights and stories of the Granite State, from Concord to White Mountain State Park and beyond.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-28","episode_number":8,"episode_type":"standard","id":1120659,"name":"Maryland & Delaware","overview":"Visit the birthplace of the Star Spangled Banner and explore the sites where Harriet Tubman, Babe Ruth and the DuPont family made their marks on American history. Maryland and Delaware are two small states of great historical significance. Highlighted by the great bays of the eastern seaboard: Chesapeake and Delaware, both states are defined by the legacies of their colonial pasts. This aerial journey reveals their giant stature in the history of America.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":"/yNA225ZX9vIsSZD3E9citznyAK7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-04","episode_number":9,"episode_type":"standard","id":1120660,"name":"North Carolina","overview":"North Carolina is home to mysteries, giant industries, and coastal beauty. It's where gold was first found in America, and where an entire colony of settlers vanished. A state where golf rules the land, NASCAR rules the road, and college basketball holds court over them all. It's where tobacco became king after the cotton industry went up in smoke, and where a 12-second flight sent shockwaves around the world. Experience the history of the Tar Heel State.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":"/nK5Gk5oceuo2mZNx20vMQ8IP8pX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-09-11","episode_number":10,"episode_type":"finale","id":1120661,"name":"New York","overview":"Take a memorable flight over a remarkable state, one rich with the stories of a nation that began long before European explorers discovered its mighty rivers. Explore New York's amazing beauty, from the roaring Niagara Falls to its stunning peaks and valleys, to a city full of abundant architectural heritage and infamous residents. Aerial New York tells the stories of expansive natural wonders, the city that never sleeps and the day we will never forget.","production_code":"","runtime":45,"season_number":2,"show_id":64162,"still_path":"/AuHKJ86JYyAAfEPky7LEtEMI7Cs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":71382,"poster_path":"/cvHErjHrwAuD2Bnezi5hDrQc4y7.jpg","season_number":2,"vote_average":0},"3":{"_id":"561f8d1692514171c50031ce","air_date":"2012-01-08","episodes":[{"air_date":"2012-01-08","episode_number":1,"episode_type":"standard","id":1120669,"name":"Louisiana","overview":"Visit the state where the Big Muddy comes to an end and the Big Easy comes to life. Louisiana is home to both great celebrations and great devastation. From cool jazz to hot cooking; from a vast paradise of wetlands to the giant industries endangering its fragile ecosystems, explore the stark contradictions of the Sugar State from soaring heights. Having survived natural and manmade disasters, Louisiana proves it has never lost its festive, fighting spirit.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":"/7gYgyhnwDOQLxWdpnsvTtDWaQmL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-15","episode_number":2,"episode_type":"standard","id":1120675,"name":"New Mexico","overview":"Georgia O'Keeffe once said, \"If you ever go to New Mexico, it will itch you for the rest of your life,\" and this aerial tour of the state will show you exactly why. Take flight over 121,000 square miles of timeless beauty and national treasures, from the Rio Grande, to adobe structures and dormant volcanoes. See what brought O'Keeffe to the Land of Enchantment, as well as Billy the Kid, the makers of the atomic bomb and perhaps even visitors from far away galaxies.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":"/eBzgMTM85QSYAez5ft7zwqVB1yg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-22","episode_number":3,"episode_type":"standard","id":1120677,"name":"Michigan","overview":"Michigan is a Midwestern powerhouse, where one man's assembly lines brought the automobile to America and another man's \"Hit Factory\" brought the Motown sound to the world. Named after the Native American term for \"big lake,\" Michigan is defined not only by the Great Lakes that shape it, but how its residents shaped America. Discover its diverse history and its visionaries who built empires, started unions, and helped win a World War.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-01-29","episode_number":4,"episode_type":"standard","id":1120679,"name":"Nevada","overview":"Nevada is known as a Wild West state that's still a little wild, but there's more to this ancient desert land than the City of Sin. This aerial tour highlights Nevada's vital role in the shaping of America, from the mines and ghost towns of its gold and silver rush, to its icon of American ingenuity: the Hoover Dam. Discover the highs and lows of Nevada's history, and the booms and busts that have defined it as the land of big builders and bigger dreamers.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-12","episode_number":5,"episode_type":"standard","id":1120680,"name":"Colorado","overview":"Get ready for a Rocky Mountain adventure over the state that boasts some of the highest peaks, tallest sand dunes and largest single-site brewery in America. Every year Colorado attracts music lovers, ski buffs, and sports fans drawn to its Red Rocks, Aspen slopes and the Broncos' Mile High Stadium. But it is also a state with a history, marked by war, a gold rush and legendary bank robberies. Through it all, Colorado remains a feast for the eyes.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":"/pdUMUAcICbtdzrq2PqDWaAxCccu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-04","episode_number":6,"episode_type":"standard","id":1120681,"name":"Mississippi","overview":"In Mississippi, culture and history run as deep as its mighty river. Soar over landmarks where Civil Rights movements were waged, Civil War battles were lost and the Blues were born. The Magnolia State is also a land of seductive landscapes and endless creativity, giving us literary geniuses such as William Faulkner and Tennessee Williams, plus musical legends Muddy Waters and Elvis. Take flight on this journey over a land of hospitality, beauty and complexity.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":"/pENby9syyEJbM98bOlPmj7G4dM4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-11","episode_number":7,"episode_type":"standard","id":1120683,"name":"Pennsylvania","overview":"This thrilling ride over the Keystone State takes you over large cities and across small towns, where tradition thrives, Nittany Lions roar, and freedom rings. It's where the first football game was played and the bloodiest Civil War battle was fought. Where American Independence began and America's westward expansion commenced. Whether you prefer cheese steak or chocolate, Andy Warhol or Rocky Balboa, this aerial tour of Pennsylvania has something for everyone!","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-12","episode_number":8,"episode_type":"standard","id":1120684,"name":"Florida","overview":"Explore the grassy waters, sandy shores, and intriguing history of Florida. From big orange groves to Little Havana, from launching rockets to hanging chads, the Sunshine State offers spectacular views and seminal moments that are uniquely its own. Soar over the metropolis of Miami and the spring break mecca: Panama City. This is a first-class Floridian vacation, and you have a window seat!","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":"/pwxOtH1ogjroohhkKDz9Y4MzrDl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-10-21","episode_number":9,"episode_type":"standard","id":1120687,"name":"Kansas","overview":"There's more to Kansas than its wide-open spaces and endless skies might indicate. It's where aviation pioneers took flight and civil rights heroes fought back. Where Laura Ingalls Wilder documented life on the prairie and a fictional young girl dreamed of a life \"Over the Rainbow.\" It's also home of the first battle of the Civil War and the ongoing collegiate basketball war between Wildcats and Jayhawks. Enjoy this soaring tour through the Sunflower State.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-04","episode_number":10,"episode_type":"standard","id":1120690,"name":"Alabama","overview":"Buckle up and \"Roll Tide\" as we journey over vast cotton fields, endless waters, storied football stadiums, and historical landmarks that collectively tell the tale of Sweet Home Alabama. Discover its rich history as we reveal the astronomical discoveries that helped us reach the moon and the civil rights victories that forged a path to equality for millions. The story of the Cotton State has as many dramatic turns as the tracks of the Talladega Superspeedway.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":"/wTKALomoAMWed0ljLzDRbbU55Mt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-11-18","episode_number":11,"episode_type":"standard","id":1120692,"name":"Oklahoma","overview":"Oklahoma is home to great tallgrass prairies, where herds of buffalo roam free and oil jacks gush black gold. Where the Trail of Tears ended and a mass exodus began 100 years later, prompted by a wave of dust. This flight over the Sooner State whisks you over the home of famous \"Okies\" Will Rogers, Brad Pitt, and Geronimo. Where native cultures have flourished for thousands of years and where countless hopeful settlers arrived for a shot at the American Dream.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":"/49sG0o1G7P7FuNNas9H49KaDqdn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-12-02","episode_number":12,"episode_type":"finale","id":1120694,"name":"Arizona","overview":"The Grand Canyon is one of the seven natural wonders of the world, but it's just one of many breathtaking marvels you'll find in Arizona. Explore the Copper State's remarkable history and its awe-inspiring landscapes, spectacular sunsets and infamous gunfights. From Tombstone to tent jails, from the Valley of the Sun to lost cities of gold, this aerial tour celebrates and studies a colorful state filled with equally colorful characters.","production_code":"","runtime":45,"season_number":3,"show_id":64162,"still_path":"/tdDCLhP7aYNj1tvzlgR4OgV3EuU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":71383,"poster_path":"/wxxSjdscSv99XdXdbGozP1op3tH.jpg","season_number":3,"vote_average":0},"4":{"_id":"561f8d17c3a3680e1d00349f","air_date":"2013-07-14","episodes":[{"air_date":"2013-07-14","episode_number":1,"episode_type":"standard","id":1120696,"name":"Amazing Destinations","overview":"From its Great Lakes to its Grand Canyon, its Rocky Mountain peaks to its Key West reefs, America is a land of amazing destinations. This adventure over the nation's most remarkable landscapes and landmarks captures her breathtaking beauty, while demonstrating how its sense of wonder has inspired countless artists, thinkers, and revolutionaries. Join us on this cross-country tour over iconic and unknown sights, and discover a side of America you've never seen before.","production_code":"","runtime":45,"season_number":4,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-21","episode_number":2,"episode_type":"standard","id":1120698,"name":"Montana","overview":"Big skies, big adventure, and big spirits: this is Montana. It's where fertile plains collide with the Rocky Mountains and the country's fastest land mammals run the grasslands known as the American Serengeti. It's also where Lewis and Clark faced towering stone obstacles and Custer faced an even more daunting foe. This aerial journey showcases the Treasure State's mountains and milestones, its legends and landmarks, all from spectacular heights.","production_code":"","runtime":45,"season_number":4,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-28","episode_number":3,"episode_type":"standard","id":1120702,"name":"Ohio","overview":"It's where the Wright brothers' visions of flight fully took off and where a young Neil Armstrong first dreamed of the Moon. Take flight over the Buckeye State and witness centuries of American history etched in its soil. From the Ohio River, where Revolutionary War veterans started life anew, to Marietta, where runaway slaves sought shelter, this aerial tour celebrates the state's spirit: built on freedom, sports, and rock and roll.","production_code":"","runtime":45,"season_number":4,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-04","episode_number":4,"episode_type":"standard","id":1120704,"name":"Minnesota","overview":"Soar over Minnesota, where the Mighty Mississippi begins and the blue Midwestern sky never ends. This aerial exploration of the North Star State whisks you across ancient glacial landscapes, iconic bodies of water, and the farm towns that have fed our county for over a century. From warring settlers and Indians, to battling flour titans, and from the massive Mall of America to the mythical Lake Wobegon, see how Minnesota is more than the \"Land of 10,000 Lakes.\"","production_code":"","runtime":45,"season_number":4,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-11","episode_number":5,"episode_type":"standard","id":1120706,"name":"Made in the U.S.A.","overview":"\"Made in the USA\" isn't just a label. It's a testament to American ingenuity and the pioneers and risk takers who have given us everything from jumbo jets to microchips, and ketchup to cornflakes. This cross-country journey celebrates the nation's crowning industrial achievements and the people behind them. Soar above Starbucks headquarters, Motown Records, Talladega Superspeedway, and more, exploring stories of inspiration, innovation, and invention.","production_code":"","runtime":45,"season_number":4,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-18","episode_number":6,"episode_type":"standard","id":1120707,"name":"West Virginia","overview":"West Virginia. It's where the Appalachian, Blue Ridge, and Allegheny Mountains converge, and where a fiercely independent spirit, forged during the Civil War, still lives today. From a legendary resort that hid a top-secret bunker to a futuristic facility exploring the mysteries of the universe, to thrill-seekers riding the Class-5 rapids and climbing its famous bluffs, this flight across the state's towering peaks reveals why John Denver called it \"almost heaven.\"","production_code":"","runtime":45,"season_number":4,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-25","episode_number":7,"episode_type":"finale","id":1120721,"name":"Beyond Hollywood","overview":"Virtually anywhere you go in America, Hollywood has already been there, telling a story and sharing it with the world. Join us on a coast-to-coast tour of countless locations made famous by Hollywood's greatest films. From the Manhattan skyline that Woody Allen romanticized to the steps at the Philadelphia Museum of Art that Rocky Balboa climbed, we bring you America as it's been captured and immortalized in film.","production_code":"","runtime":45,"season_number":4,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":71384,"poster_path":"/78WNEV10MNHKtDHyu3SqZ5gNJS9.jpg","season_number":4,"vote_average":0},"5":{"_id":"561f8d19c3a3680e20003495","air_date":"2014-02-23","episodes":[{"air_date":"2014-02-23","episode_number":1,"episode_type":"standard","id":1120722,"name":"Texas","overview":"To capture Texas, you need to go big, and this aerial exploration spans thousands of square miles to reveal the great sites of the Lone Star State. Witness its lush forests, forbidding deserts, and shimmering modern cities. High-altitude views of landmarks reveal a rich, complex past where bloody battles for independence began and where the era of American idealism ended one dark November day. From humble beginnings to boastful proclamations, see why \"everything's bigger in Texas.\"","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-02","episode_number":2,"episode_type":"standard","id":1120724,"name":"Idaho","overview":"Soar over a state with much more to offer than just potatoes! This state contains millions of acres of untamed land, great ancient spines of stone, and the deepest canyon in America. Idaho's past is as rich as its volcanic soil and this tour over the Gem State reveals unique visual treasures. From Hemingway's haven to Hell's Canyon, and from the world's first atomic city to the birth of the potato boom, discover the beauty and history of Idaho.","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-09","episode_number":3,"episode_type":"standard","id":1120725,"name":"Kentucky","overview":"Kentucky: home of young Abe Lincoln, old family feuds, and the most exciting two minutes in sports. This overhead exploration reveals the fertile stories of America's 15th state, from Daniel Boone's wilderness trail to the Country Music Highway, and from the legends of the Kentucky Derby to the secrets behind its beloved bourbon. With its rich history and breathtaking beauty, the Bluegrass State is a stunning, hard-won paradise, best viewed from high above.","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-16","episode_number":4,"episode_type":"standard","id":1120726,"name":"Utah","overview":"From the unearthly pinnacles of Arches National Park to the blinding white terrain of the Bonneville Salt Flats, Utah has an alien beauty that you must see to believe. It has a history uniquely its own, from the tragedy of the Donner Party to the arrival of Brigham Young, an American leader who built Mormonism into one of the most successful religions in the world. This journey over the Beehive State celebrates a land that offers endless surprises and possibilities.","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-23","episode_number":5,"episode_type":"standard","id":1120727,"name":"The Dakotas","overview":"Take in the soaring views above a state that inspired a future president, launched the country's first millionaire, and kept a dark, rich secret under its expansive prairies for centuries. This lofty journey over North Dakota highlights the Roughrider State's grand beauty, which healed a grieving Teddy Roosevelt and transformed him into a defender of America's wild land. Explore the state's booms and busts, from fur trade explosions to frontier battles to the thousands of oil wells that dot the land and house flaming vents that are visible from space.","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-30","episode_number":6,"episode_type":"standard","id":1120728,"name":"Wyoming","overview":"Soar over Wyoming and explore the fertile landscapes that first lured men like Jim Bridger out West in search of furs and game. Then visit the Cowboy State's famous towns and landmarks, from Jackson Hole to the Teton Mountains, and from the Sheridan Rodeo to the Continental Divide. Delve into its controversial past, including a shocking hate crime, a notorious mining operation, and a 19th-Century fight for women's rights that continues to inspire today.","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-06","episode_number":7,"episode_type":"standard","id":1120729,"name":"Nebraska","overview":"This is a land of bold landscapes and brave history. It?s where uninhabitable desert plains have been transformed into cornfields and cattle ranges that feed America. Soar above this agricultural powerhouse as we explore the Cornhusker State?s vast farms, towering spires, desolate badlands, and gleaming cities. We also celebrate Johnny Carson, Warren Buffet, Carhenge, the College World Series, and other great figures, landmarks, and pastimes that call Nebraska home.","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-13","episode_number":8,"episode_type":"standard","id":1120731,"name":"Best Small Towns","overview":"Smithsonian Magazine and Smithsonian Channel team up to take one of our signature series to even greater heights! Join us on a cross-country tour over our nation's most fascinating small towns, from Medora, North Dakota, where Teddy Roosevelt once sought solace, to Carmel, California, where Dirty Harry became mayor. This soaring journey shows the road less traveled is often the one best traveled, as only Aerial America can.","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-06","episode_number":9,"episode_type":"standard","id":1120732,"name":"Alaska's Fire and Ice","overview":"It's twice the size of Texas, features 16 of the 20 tallest mountains in the nation and is home to the biggest earthquake of the 20th century. Everything about Alaska is larger, tougher, and more extreme than any other state. This breathtaking two-part journey soars over its one-half million square miles of winter wonderland and shows why countless adventurers have come to the 49th State over the centuries in search of gold, silver, mountain-peak views, dog-sledding glory, and more.","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-07-06","episode_number":10,"episode_type":"standard","id":1120733,"name":"Alaska's Call of the Wild","overview":"For centuries, thousands of adventurers have answered Alaska's \"call of the wild,\" seeking thrills and fortunes in a state rife with postcard-perfect beauty... and lethal dangers. Take flight across ancient glaciers, rugged mountain ranges, primeval forests, and pristine waterways. Then discover how the state's unique charm has attracted bold visitors, from Russian fur traders to a young survivalist on a one-way trip \"into the wild\" to the thousands of dog sledders facing off in the \"Last Great Race on Earth!\"","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-09-10","episode_number":11,"episode_type":"finale","id":1120736,"name":"Wilderness","overview":"Some are vital sanctuaries for endangered species. Some can only be reached by plane. All are magnificent. These are the untamed pockets of the U.S. protected by the Wilderness Act of 1964. Take a cross-country flight over icy landscapes in Alaska's Denali, vast wetlands in Florida's Everglades, and over 100 million acres of badlands, deserts, and mountains where nature rules. Then learn how the nation's wildest places are tied to America's native history, its pioneering spirit, its extraordinary leaders, and its untouched beauty.","production_code":"","runtime":45,"season_number":5,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":71385,"poster_path":"/lxxFTonrHHqy3dd3NO6rsULWzon.jpg","season_number":5,"vote_average":0},"6":{"_id":"561f8d1dc3a3680e16002e72","air_date":"2015-04-26","episodes":[{"air_date":"2015-04-26","episode_number":1,"episode_type":"standard","id":1120737,"name":"Washington D.C.","overview":"Washington, DC, does not boast towering buildings, but its skyline still inspires awe through its history, purpose, and what happens inside its walls. Explore the Nation's Capital from above as we swoop over its monuments, memorials, historic neighborhoods, and beckoning waters. We celebrate a city of stately American symbols and turbulent history, including scandals, protests, assassinations, and battles that rocked it to its core. But through it all, D.C. has survived and thrived, proving itself a city worthy of the nation it represents.","production_code":"","runtime":45,"season_number":6,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-03","episode_number":2,"episode_type":"standard","id":1120738,"name":"Wisconsin","overview":"It's a state ruled by beer and dairy, a place full of wild, scenic beauty and bustling urban landscapes. This is Wisconsin, and this aerial tour celebrates the unique brew of dazzling landscapes, rich history, and contemporary culture that can only be found in the Badger State. Join us as we soar over colorful autumn forests, family-owned farms, the Door Peninsula and share stories of the ancient tribes, European settlers, and American icons who gave Wisconsin its one-of-a-kind identity.","production_code":"","runtime":45,"season_number":6,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-10","episode_number":3,"episode_type":"standard","id":1120739,"name":"New Jersey","overview":"New Jersey is one of America's 13 original states, and one of its most fascinating. It's where the nation's first industrial city was built, where some of Hollywood's biggest studios began, and where a brilliant inventor devised a way to light the world. We trace the Garden State's most dramatic historic moments, from Washington's fateful Delaware crossing to Hindenburg's fiery crash to Superstorm Sandy's furious attack. We also celebrate Jersey's quiet misty valleys, fields of plenty, miles of sunlit shores, and plucky, innovative spirit.","production_code":"","runtime":45,"season_number":6,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-17","episode_number":4,"episode_type":"standard","id":1120740,"name":"Indiana","overview":"\"Ladies and gentlemen, start your engines\" and prepare to be whisked away over Indiana's famous racetrack and the Golden Dome, vast cornfields and large quarries, and bustling metropolises and a city of ruins. Here in the Hoosier State, Abraham Lincoln became a man, basketball became an obsession, and the nation nearly doubled in one of the biggest land grabs in U.S. history. This aerial tour captures the beauty, spirit, and stories of Indiana as seen from above.","production_code":"","runtime":45,"season_number":6,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-24","episode_number":5,"episode_type":"standard","id":1120742,"name":"Iowa","overview":"It's appropriate that we'll be traversing the Hawkeye State from the air - and you can help us decide which of its great landmarks demand a bird's-eye view. Will the George M. Verity, one of the last surviving US steam-powered towboats, or the Sergeant Floyd monument make your list? It's sure to be an epic photo-essay over Iowa that will warm you to its charms. And when was the last time the words \"warm\" and \"Iowa\" were used in the same sentence?","production_code":"","runtime":45,"season_number":6,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-05-31","episode_number":6,"episode_type":"standard","id":1120743,"name":"Missouri","overview":"Destination \"Missouruh\" for our crew - and you can help by telling us what we should film there. While the Show-Me State is home to the tallest man-made monument in the US, don't ask us to fly through the Gateway Arch - we just can't get the permits. But there are plenty of other sights: from the Liberty Memorial, to the unique architectural features of the Christ Church Cathedral, all the way to the historic Arrow Rock State Park: tell us what tops your list!","production_code":"","runtime":45,"season_number":6,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-06-07","episode_number":7,"episode_type":"finale","id":1120755,"name":"Illinois","overview":"It's given us American icons as notorious as Al Capone and as heroic as Abraham Lincoln. It's where endless rows of corn blanket the fields and towering buildings touch the sky. The state of Illinois is full of awe-inspiring sights and captivating drama, and this aerial excursion explores it all. From the Great Fire of Chicago to the Great Migration that brought Muddy Waters and the blues up north, we visit the places and people that tell Illinois' powerful story.","production_code":"","runtime":45,"season_number":6,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":71386,"poster_path":"/1fj0DjzNW1EGfCVNfhHDTOQYAYj.jpg","season_number":6,"vote_average":0},"7":{"_id":"575e142cc3a3687f63000b51","air_date":"2016-04-24","episodes":[{"air_date":"2016-04-24","episode_number":1,"episode_type":"standard","id":1418793,"name":"On the Water","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-01","episode_number":2,"episode_type":"standard","id":1418794,"name":"Puerto Rico & U.S. Virgin Islands","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-08","episode_number":3,"episode_type":"standard","id":1418795,"name":"Natural Wonders","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-22","episode_number":4,"episode_type":"standard","id":1418797,"name":"The Great Plains","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-05-29","episode_number":5,"episode_type":"standard","id":1418798,"name":"Roadside Attractions","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-05","episode_number":6,"episode_type":"standard","id":1418799,"name":"Man-Made Marvels","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-12","episode_number":7,"episode_type":"standard","id":1199311,"name":"The South","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-19","episode_number":8,"episode_type":"standard","id":1418800,"name":"Trailblazers","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-06-26","episode_number":9,"episode_type":"standard","id":1418801,"name":"New England","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-03","episode_number":10,"episode_type":"standard","id":1418802,"name":"The Wild West","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-10","episode_number":11,"episode_type":"standard","id":1418803,"name":"Southern California","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-07-10","episode_number":12,"episode_type":"finale","id":1869374,"name":"Northern California","overview":"","production_code":"","runtime":45,"season_number":7,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":77755,"poster_path":"/maaPQn1RnbwKhMPANMbiS58lzYr.jpg","season_number":7,"vote_average":0},"8":{"_id":"5a5ac3399251413f62015f7f","air_date":"2019-03-03","episodes":[{"air_date":"2019-03-03","episode_number":1,"episode_type":"standard","id":1418804,"name":"New York City 24","overview":"","production_code":"","runtime":45,"season_number":8,"show_id":64162,"still_path":"/eXfzGOnL7tzpSRXuUJI1zDtR9Jz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-08","episode_number":2,"episode_type":"standard","id":2581633,"name":"Yellowstone","overview":"When you soar above Yellowstone, it's easy to see why it became the world's first national park in 1872. It's a place of staggering beauty and fragile creatures, of stunning granite peaks that pierce the sky and colorful springs that may hold secrets about the origins of life. This aerial voyage takes you over high elevation lakes, snaking canyons, sputtering hot geysers, and snow-covered landscapes. Explore Yellowstone's history of Native Americans, European explorers, and 10 million years of tectonic upheaval.","production_code":"","runtime":45,"season_number":8,"show_id":64162,"still_path":"/9eiFOtxDlrYXXKEAvKcayYYJ9TD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-15","episode_number":3,"episode_type":"standard","id":2581634,"name":"Boston 24","overview":"A breathtaking aerial tour over Boston explores its revolutionary acts, art, infrastructure, and ideals.","production_code":"","runtime":45,"season_number":8,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-22","episode_number":4,"episode_type":"standard","id":2581636,"name":"Dallas-Fort Worth 24","overview":"Fly over the fourth largest metropolis in the nation to discover how a simple trading post on the banks of Trinity River became the start of this great city in 1839. Discover the struggles, battles and lives lost in the battle for Texas to become independent from Mexico and how the United States government protected its new American settlers, living on the edge of the frontier, with an Army outpost named Fort-Worth.","production_code":"","runtime":45,"season_number":8,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-22","episode_number":5,"episode_type":"standard","id":2694864,"name":"Great Cities","overview":"Explore the awe-inspiring skyscrapers and dazzling public spaces of Americas great cities and meet the people who keep them running day and night. From Boston, New York, and Miami in the east to Las Vegas, San Francisco, Seattle, and L.A. in the west, and from Chicago in the north to Dallas-Fort Worth in the south, this is a cross-country metropolitan tour from breathtaking heights.","production_code":"","runtime":45,"season_number":8,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-06","episode_number":6,"episode_type":"standard","id":3404563,"name":"Coasts","overview":"A scenic cross-country flight, from the mountains to the prairies, and from sea to shining sea.","production_code":"","runtime":45,"season_number":8,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-13","episode_number":7,"episode_type":"standard","id":3404564,"name":"Outdoor Adventures","overview":"Grab your ticket for a scenic cross-country flight, from the mountains to the prairies, and from sea to shining sea.","production_code":"","runtime":45,"season_number":8,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-20","episode_number":8,"episode_type":"finale","id":3404567,"name":"Dazzling Destinations","overview":"A scenic cross-country flight, from the mountains to the prairies and from sea to shining sea.","production_code":"","runtime":45,"season_number":8,"show_id":64162,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 8","overview":"","id":97870,"poster_path":"/mOgaouL3ABAVuEeCf6LeA0U5cHu.jpg","season_number":8,"vote_average":0}}}