{"adult":false,"backdrop_path":"/gAVOUuz6M2HaNFld4SuZ0K6Ybv3.jpg","created_by":[{"id":1255682,"credit_id":"56f3e897925141351c000237","name":"Jeppe Gjervig Gram","gender":2,"profile_path":null},{"id":126774,"credit_id":"57e3bd4b9251411237004a0d","name":"Per Fly","gender":2,"profile_path":"/9JNKo8kz8b1pTIud0Dwsye0r8U.jpg"}],"episode_run_time":[60],"first_air_date":"2016-01-03","genres":[{"id":80,"name":"Crime"},{"id":18,"name":"Drama"}],"homepage":"","id":64726,"in_production":false,"languages":["en","da"],"last_air_date":"2019-03-10","last_episode_to_air":{"id":1725112,"name":"Episode 10","overview":"The season finale has Alf on a vicious hunt for Nicky before he escapes the country. Nicky must say goodbye to what is most precious to him and Anna receives an offer she cannot refuse. Alf and Nicky both realise that there are tragic consequences to their actions.","vote_average":10,"vote_count":1,"air_date":"2019-03-10","episode_number":10,"episode_type":"finale","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/qSxSxvGXIFQiwn9zyNAjXSBAdYe.jpg"},"name":"Follow the Money","next_episode_to_air":null,"networks":[{"id":391,"logo_path":"/7xOoWHdhdfYE0Pn9ilYLB1lenpC.png","name":"DR1","origin_country":"DK"}],"number_of_episodes":30,"number_of_seasons":3,"origin_country":["DK"],"original_language":"da","original_name":"Bedrag","overview":"'Follow the Money' is a crime drama that explores what happens to people who are corrupted by greed and ambition. The series shows viewers the complex world of economic crime that takes place in banks, the stock exchange, and in boardrooms.","popularity":21.877,"poster_path":"/naWMAOCPk2r5uq7TZZyNCgpL988.jpg","production_companies":[{"id":119,"logo_path":"/1di2gITGUZr730AMuMKiCrP90Vl.png","name":"DR","origin_country":"DK"}],"production_countries":[{"iso_3166_1":"DK","name":"Denmark"}],"seasons":[{"air_date":"2016-01-03","episode_count":10,"id":72836,"name":"Season 1","overview":"Danish crime thriller series set in the world of economic crime.","poster_path":"/dG47GLf2riII2bgvePXHjm8Bsig.jpg","season_number":1,"vote_average":8.4},{"air_date":"2016-09-25","episode_count":10,"id":80508,"name":"Season 2","overview":"","poster_path":"/fYTWhyRET7vGaRTcECNk95ClJlW.jpg","season_number":2,"vote_average":8},{"air_date":"2019-01-06","episode_count":10,"id":117116,"name":"Season 3","overview":"","poster_path":"/meN7rJXEFwygJNbZIi7laiyVXjY.jpg","season_number":3,"vote_average":8.8}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"},{"english_name":"Danish","iso_639_1":"da","name":"Dansk"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.9,"vote_count":44,"season_data":{"1":{"_id":"5675db1592514179e7003829","air_date":"2016-01-03","episodes":[{"air_date":"2016-01-03","episode_number":1,"episode_type":"standard","id":1148341,"name":"Episode 1","overview":"The researcher Mads called out to a washed ashore near a wind farm. Immediately similar case a banal accident, but the case draws threads far into Energreen - one of the largest and most successful energy companies. Listener Greens director is the charismatic Sander, and behind the scenes working hard the young jurist Claudia to advance in the company. The former car thief, mechanic Nicky, working on his wife's father workshop. He has put the crime behind him for boyfriends of guilt but his new colleague Bimse deadlines Nicky with the prospect of quick money.","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/zpqwNakXJ6lxVKOvgMoxi4y8W9b.jpg","vote_average":8.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2016-01-03","episode_number":2,"episode_type":"standard","id":1154536,"name":"Episode 2","overview":"Claudia is given new responsibilities at Energreen, starting with a case about insider trading that could damage the company. Mads enlists help from Alf at the fraud squad to find a connection between the deathat the wind farm and Alf's impression of Energreen as being a little too clever. At home, Mads is trying to keep his family and home running smoothly despite his wife's recent multiple sclerosis attack. Bimse and Nicky's car theft gives surprising results.","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/5fgrgbiT09JzjOPzaVgmVGATvm6.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2016-01-10","episode_number":3,"episode_type":"standard","id":1156389,"name":"Episode 3","overview":"Mads and Alf pursue leads to Energreen's missing traders. Claudia is questioned, but is quickly summoned to Abu Dhabi by Sander. He and the rest of Energreen's management are attending an important energyconference to attract major investors. Amid the sparkling luxury of the desert state, Claudia witnesses a new and revealing aspect of Sander's fascinating world and how he operates. Nicky and Bimse are afraid of getting caught and bury the money they found in the BMW. But all that cash is tempting. What's the harm in spending just a little of it?","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/4uww27ZFSRC3r4nmNk5e3bwscE4.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-01-17","episode_number":4,"episode_type":"standard","id":1158445,"name":"Episode 4","overview":"Mads and Alf interrogate Ulrik, the CFO of Energreen. But while Mads and Alf delve deeper into the company's secrets, serious developments are taking place in Mads's private life - Kristina has lied to herhusband. At Energreen, the management is hard at work trying to streamline the company before going public. Claudia is sent to Thullander Industries, a subsidiary, to make cutbacks and ends up in a sticky situation. Bimse is in trouble with some debts, and Nicky promises to help him.","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/sgKoCJu3hQP2VUfYtiqsg1JokQa.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-01-23","episode_number":5,"episode_type":"standard","id":1161335,"name":"Episode 5","overview":"Mia is approached by a whistleblower and focuses her energy on finding out the truth about Energreen. Sander and Mr Christensen worry that Mia's findings could jeopardise their listing on the stock exchange,and they plan to stop her with Claudia's help. Mads and Alf follow one of Mia's leads to Energreen's research facility in Poland, and Mads is glad to get away from his chaotic home life. Jan wants to help Nicky and Bimse out with the Serbs and introduces them to Erik, their new accountant.","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/4EX5he4A5eBPHCWforN1yfZu4uQ.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-01-31","episode_number":6,"episode_type":"standard","id":1166275,"name":"Episode 6","overview":"Despite Energreen's best attempts, Mia's article is published and puts the company on the spot as they try to find investors before going public. The article isn't Sander's only problem, since Nicky tries toblackmail him with the contents of the stolen iPad. Claudia is troubled with doubt about Sander. Mads and Alf are desperately looking for the whistleblower who was Mia's source.","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/pfYnvqAGSWseX1CP6nOZoSj6X0q.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-02-07","episode_number":7,"episode_type":"standard","id":1166276,"name":"Episode 7","overview":"Jens Kristian divulges Energreen's illegal setup to Mads and Alf, but it is not enough to prevent the company's big moment - the long-awaited listing on the stock exchange. Claudia sneaks away from Sander's bigday. She is shocked by what her son Bertram has witnessed. Erik needs medical attention, but Nicky and Bimse do not dare take him to hospital. Mads makes a decision about his home life.","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/gbYxutdOVmj7ppVFqv6lEluU42u.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"Andreas","credit_id":"58da1da5c3a3686d82006158","order":500,"adult":false,"gender":2,"id":1357455,"known_for_department":"Acting","name":"Elliott Crosset Hove","original_name":"Elliott Crosset Hove","popularity":1.553,"profile_path":"/dGBMaetF0JeyXpyp3cleyCgN46M.jpg"}]},{"air_date":"2016-02-14","episode_number":8,"episode_type":"standard","id":1166277,"name":"Episode 8","overview":"The minister of justice pressures the fraud squad to close the case against Energreen. However, what Jens Kristian tells them incriminates Claudia more than Sander. Bimse's emotions put him and Nicky on a collision course.","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/yl5xRzcppReSFLns0zgKe6ytE56.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-02-21","episode_number":9,"episode_type":"standard","id":1172248,"name":"Episode 9","overview":"Alf is guilt-ridden about Mia, but he snaps out of his self-pity when Mads makes an amazing discovery. Not only does Energreen have major accounting discrepancies, its coffers are also empty, and they can usethis to their advantage. Claudia has reached the same conclusion, but Sander insists on continuing his dangerous game and asks her to throw a spanner in the works and ruin the fraud squad's plans. Sander's henchman finds out where Nicky and Bimse got all their money and insists on getting it back - the Swede isn't a man you refuse.","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/FErJXRfqqM9ux3N4zJnSJVYZvz.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-02-28","episode_number":10,"episode_type":"finale","id":1172249,"name":"Episode 10","overview":"The media are shocked by Energreen's announcement, and Mads and Alf are busy searching for evidence to use against them. Claudia is at a crossroads in her life as she realises how serious the consequences couldbe for her. Nicky and Bimse hide from the Swede. Mads helps Kristina who is back in hospital, just like in 'the old days'.","production_code":"","runtime":60,"season_number":1,"show_id":64726,"still_path":"/9ZC26WpTJIbH2eVr2Uirs1htlBG.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Danish crime thriller series set in the world of economic crime.","id":72836,"poster_path":"/dG47GLf2riII2bgvePXHjm8Bsig.jpg","season_number":1,"vote_average":8.4},"2":{"_id":"57e7e474c3a3684743009e56","air_date":"2016-09-25","episodes":[{"air_date":"2016-09-25","episode_number":1,"episode_type":"standard","id":1226382,"name":"Episode 1","overview":"Mads and Alf at the fraud squad have not forgotten the crimes committed by Energreen and are still looking for a chance to arrest the CEO, Sander, who is missing. When a desperate man complains that his small carpentry business was forced into bankruptcy, the fraud squad delve into the practices of a major bank and uncover more than they expected. Claudia, a young lawyer, paid dearly for her involvement in Energreen. After serving 18 months in prison she's finally released - but to what? Ex-convict-turned-mechanic Nicky and his hapless friend Bimse now run their own garage, but Nicky has also been taken under the wing of the Swedish fixer, which comes at a high price.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/hCg2h4YtA7gnEBKhv5cE2NLWd6J.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-10-02","episode_number":2,"episode_type":"standard","id":1227026,"name":"Episode 2","overview":"The police have to give a statement about the dramatic events at Nova Bank, and Mads investigates the bank's involvement in the carpenter's bankruptcy. Meanwhile, he has unexpected news at home. Claudia starts her new job at Absalon Bank, but struggles with the long-distance relationship with her son. Tensions arise at the garage as Nicky spends more and more time on assignments for the Swede, and less time helping Bimse with their business.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/lOvjjsU2dbSmEAFtO33DjnFEafx.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-10-09","episode_number":3,"episode_type":"standard","id":1230165,"name":"Episode 3","overview":"Nicky and Bimse's friendship is tested when Bimse is questioned about the assault on a police officer. The fraud squad uncovers some unsavoury practices at Nova Bank, and Alf and Mads investigate a bank manager who is living well above his means. Claudia tries to get herself a contract of employment to satisfy her parole officer. Kristina and Mads have a big decision to make.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/kEtZblE990x20uk5OVpmhu1LXrD.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-10-15","episode_number":4,"episode_type":"standard","id":1232184,"name":"Episode 4","overview":"Mads and Alf unravel the corrupt practices at Nova Bank, not realising that their boss Nanna is reporting their findings to Nova's chairman, the very man they are trying to bring down. Amanda struggles with her demons as Absalon Bank faces a critical vote from its shareholders. The Swede tries to influence this vote and gives Nicky a dirty job to do.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/cjBjPdgmobRtHIudHSxMgvICKoy.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-10-23","episode_number":5,"episode_type":"standard","id":1233666,"name":"Episode 5","overview":"Mads and Alf, so far unable to pin any fraud on the chairman of Nova Bank, find a new lead and are able to bring him in for questioning. Nicky has an unexpected visit at the garage, straining his relationship with Bimse even further, but Nicky will soon have much bigger things to worry about. Amanda and Claudia realise that the only way to avoid Absalon Bank being taken over by Nova is to find another bank that is willing to buy them.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/9pYoqgUw5vSPZimDnhQUuROGtlF.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-10-30","episode_number":6,"episode_type":"standard","id":1266730,"name":"Episode 6","overview":"Nicky's assignment from Christiansen, to kidnap the granddaughter of his ex-colleague, proves troublesome and he desperately tries to cover his tracks. Alf and Mads get another lead in their case against Christiansen and think they can finally nail him. Amanda resorts to blackmail to keep control of her bank.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/5j1NAmZuiOWUkHfAazF6vOn5WTg.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-11-06","episode_number":7,"episode_type":"standard","id":1266731,"name":"Episode 7","overview":"After his failed assignment, Nicky has fallen out of favour with the Swede and is tipped over the edge when he can't get answers from him. At the Fraud Squad, Mads is more impatient than ever to get evidence against Christensen. Against his boss's advice, he heads over to Absalon Bank and sees something that will be important for the investigation - Claudia.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/dllfPlyjZJ0xfOLjaeBpwXjLN06.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-11-13","episode_number":8,"episode_type":"standard","id":1240124,"name":"Episode 8","overview":"Claudia is feeding the police information about Christensen, but fails to give them any concrete evidence. Mads and Alf press her to lure him into a trap. Their co-operation brings up the Energreen scandal again, and Claudia tells them what she knows about Sanders' escape route, information which puts them on the trail of the Swede. Meanwhile, the Swede meant what he said to Nicky who now reports directly to Christensen, while the Swede himself prepares his exit from the dirty games.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/4cBlYgPGumo5HHRELGdlYct4UJR.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-11-20","episode_number":9,"episode_type":"standard","id":1241652,"name":"Episode 9","overview":"Mads waits nervously in the hospital not realising there is also trouble at home. His pregnant wife Kristina is woken by a noise in the dark as Nicky has broken into their home to retrieve the evidence against Christensen. Absalon is on the verge of bankruptcy, and the siblings Amanda and Simon are fighting to save their bank. Claudia will stop at nothing to get revenge on Christensen, even if it means betraying the people who trust her. The Swede turns up at the garage, desperately looking for Nicky - but finds Bimse.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/h1NS0FoiYgEqLlXNGJutlvrOgo9.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-11-27","episode_number":10,"episode_type":"finale","id":1243551,"name":"Episode 10","overview":"Alf has rumbled Christensen's plan - a huge attack on the Danish krone. He and Mads try to stop it, but the attack is already underway and threatens to bring the whole country's economy to its knees. Claudia has sold Steen to the police to get revenge on Christensen, but it's still not enough to trap the unscrupulous businessman. Amanda struggles to prove that Simon is not complicit in Christensen's crimes.","production_code":"","runtime":60,"season_number":2,"show_id":64726,"still_path":"/tpsiCHJJWzT7nb8BLPI0UYSjV64.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":80508,"poster_path":"/fYTWhyRET7vGaRTcECNk95ClJlW.jpg","season_number":2,"vote_average":8},"3":{"_id":"5c44d8469251410e0c4ce461","air_date":"2019-01-06","episodes":[{"air_date":"2019-01-06","episode_number":1,"episode_type":"standard","id":1678195,"name":"Episode 1","overview":"Two years have passed since we last saw Nicky and Alf, which we follow into the third season against the organized hash crime money cycle. PTSD-affected Alf has got a new job in the police's expert group; Task Force Nørrebro, while Nicky has gone from being P's handrail to being in the industry as big smugglers. He also runs a functional laundering machine through a juice bar and dreams of a large house on the Spanish coastline. Alf dreams of his colleague Isa, but life rarely goes as planned. Nicky gets a folder with some information that reveals an unpleasant truth about his son, and Alf must keep secret his relationship with Isa as he is to lead a case of a mysterious find in a basement.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2019-01-13","episode_number":2,"episode_type":"standard","id":1678196,"name":"Episode 2","overview":"A meaningful job is just what the bank adviser, Anna, hopes to achieve in Kredit Nord, where she works, but when a young colleague overtakes her inside and the family is on the verge of economic collapse, Anna has difficulty accepting her fate. Alf only cares about his work, while it is the women of his life who care about him. He himself suggests pills to work together on everyday life and group D in Task Force Nørrebro. Nicky is highly respected in his professional world, but he is privately tricked into meeting with the ex-girlfriend Lina after 2 years. His family is split and his son pays the price.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/1totjBQ6dKznxdHmSTT5SOXcUFM.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2019-01-20","episode_number":3,"episode_type":"standard","id":1678197,"name":"Episode 3","overview":"After a violent confrontation at home, Anna asks Nicky for help. She continues to organise Nicky's banking businesses while he tries to re-establish his relationship with Milas. Meanwhile, Nicky meets again with Sahar and is intrigued by her.\n\nAlf starts monitoring Nicky's apartment, but does not find what he was expecting. Frustrated, and struggling with insomnia and PTSD, he makes some quick, and bad, decisions, which will have fatal consequences for innocent people.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/ioVWPYZmKhnc99TrT67oVieJveW.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2019-01-27","episode_number":4,"episode_type":"standard","id":1697453,"name":"Episode 4","overview":"Anna working for Nicky, laundering the money from his drug dealing through her job at the bank, and meets with potential lawyers from Dubai. Alf suspects that Nicky is involved in the basement deaths, and is the link to the mysterious Marco. However, Alf's boss wants him to focus on the drug smuggler they have in custody instead. The chief police inspector starts to show an interest in Alf's work in Task Force Nørrebro, which does not go down well with Storm. Nicky meets his son, Milas, for the first time in two years, visiting him at his foster family's home under the supervision of a social worker.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/25gQyUAdKtjiNGoqGJd70eiudSd.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2019-02-03","episode_number":5,"episode_type":"standard","id":1697455,"name":"Episode 5","overview":"After a violent confrontation at home, Anna asks Nicky for help. She continues to organise Nicky's banking businesses while he tries to re-establish his relationship with Milas. Meanwhile, Nicky meets again with Sahar and is intrigued by her.\n\nAlf starts monitoring Nicky's apartment, but does not find what he was expecting. Frustrated, and struggling with insomnia and PTSD, he makes some quick, and bad, decisions, which will have fatal consequences for innocent people.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/tcFD5nS2YTLEUwIeMYhMxixMfho.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2019-02-10","episode_number":6,"episode_type":"standard","id":1715107,"name":"Episode 6","overview":"Alf and the Nørrebro police try to recover after the shooting. He confronts Nicky, and starts a series of raids against the drug dealers to find evidence against him and Marco. But the Chief Police Inspector has other plans for the investigation. Nicky wants to hand over his business to his partner, Lala, to focus on a normal life with his son, Milas. After an unexpected visit from the auditors, Anna is confronted by her new boss, Nete, but she gets the last word.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/filQftOVVAmQHerWxJyNRbTiQXP.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2019-02-17","episode_number":7,"episode_type":"standard","id":1715108,"name":"Episode 7","overview":"When Anna finds out that Nete has plans to co-operate with the police, she tries to put a stop to it. Nicky and Lala get off on the wrong foot when Lala starts taking over both Nicky’s businesses and the access to Marco.  At the police station, Alf is confronted by his colleague, Stine, about his substance abuse and the mysterious shift of course in the Nicky and Marco case. Meanwhile, Alf continues to be pressured by the chief police inspector to follow a hidden agenda.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/53C7ujulFpPQ5DBzDs1IHZPl5nT.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2019-02-24","episode_number":8,"episode_type":"standard","id":1715109,"name":"Episode 8","overview":"Alf’s decision to go against the chief police inspector’s orders following a murder has severe consequences for the Nørrebro Task Force. Marco’s true identity is revealed and Nicky is now forced to deal with his business arrangement with Lala. Alf is on the trail of Anna, investigating her as a possible connection to Nicky, when her husband suddenly comes to her rescue.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/iLdZO3VbuV8uzAVxHSorkspXMaB.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2019-03-03","episode_number":9,"episode_type":"standard","id":1720529,"name":"Episode 9","overview":"Sahar saves Nicky’s life after Lala’s attack. Alf and Stine hunt the wounded Nicky, but find that he is one step ahead of them. Anna realises that Nicky can no longer help her when her family is sought out by Lala and his criminal partners. Nicky seeks a way out. The chief police inspector interferes with Alf’s investigation.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/2fLZHBBKKwEKXUtDLHgQEcuF8tp.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2019-03-10","episode_number":10,"episode_type":"finale","id":1725112,"name":"Episode 10","overview":"The season finale has Alf on a vicious hunt for Nicky before he escapes the country. Nicky must say goodbye to what is most precious to him and Anna receives an offer she cannot refuse. Alf and Nicky both realise that there are tragic consequences to their actions.","production_code":"","runtime":60,"season_number":3,"show_id":64726,"still_path":"/qSxSxvGXIFQiwn9zyNAjXSBAdYe.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":117116,"poster_path":"/meN7rJXEFwygJNbZIi7laiyVXjY.jpg","season_number":3,"vote_average":8.8}}}