{"adult":false,"backdrop_path":"/4KoA7zY4MaF7sdGWCsnOjnHamcX.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2010-02-01","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":64807,"in_production":false,"languages":["en"],"last_air_date":"2011-06-14","last_episode_to_air":{"id":1262590,"name":"Lawrence of Arabia","overview":"We reveal an ambitious archaeological project in Southern Jordan, which is providing startling new evidence. The Great Arab Revolt Project (GARP) is one of the only archaeological investigations of a battlefield on this scale anywhere in the world. While the archaeological trace of Lawrence and the Bedouin guerrilla fighters is by its very nature incredibly scarce, the military structures of their opponents, the Ottoman Turks, are all too evident. The structures and scars from this battle are visible across the desert, in particular around the city of Ma’an, a key Hejaz station. On-the-ground analysis of surviving defences begins to reveal the style of warfare played out in this military arena.","vote_average":0,"vote_count":0,"air_date":"2011-06-14","episode_number":13,"episode_type":"finale","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/fuJHvkBAAexpbkzFi2OTqxDLkH0.jpg"},"name":"Mystery Files","next_episode_to_air":null,"networks":[{"id":43,"logo_path":"/q9rPBG1rHbUjII1Qn98VG2v7cFa.png","name":"National Geographic","origin_country":"US"},{"id":658,"logo_path":"/meU2LRnHcSr0m0Upx5loxHWETqF.png","name":"Smithsonian Channel","origin_country":"US"},{"id":244,"logo_path":"/3s6YJSYXW9mtJwoszTVI1BHDNc6.png","name":"Investigation Discovery","origin_country":"US"}],"number_of_episodes":26,"number_of_seasons":2,"origin_country":["GB"],"original_language":"en","original_name":"Mystery Files","overview":"From the Legends of King Arthur and Robin Hood to the recent events of the Russian Revolution, history is full of fascinating and evocative unsolved mysteries. They have inspired, intrigued and often confounded us – but how much do we really know about them? And can we separate fact from fiction? In Mystery Files, the dust is blown off the case files of the world’s most famous and iconic mysteries in a dynamic series that asks, what is the truth behind the greatest stories ever told?","popularity":5.432,"poster_path":"/eEyktzLMQOuXmo7QQlXXqAXAFvQ.jpg","production_companies":[{"id":70997,"logo_path":null,"name":"Parthenon Entertainment","origin_country":"GB"}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"}],"seasons":[{"air_date":"2010-02-01","episode_count":13,"id":82519,"name":"Season 1","overview":"","poster_path":"/u1bpr3ZVtUHDZGbgeUZzBXiT4yw.jpg","season_number":1,"vote_average":0},{"air_date":"2011-06-06","episode_count":13,"id":73054,"name":"Season 2","overview":"","poster_path":"/1rSO2wtZzJLcnvVBcrmxO91LKC1.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":2,"vote_count":1,"season_data":{"1":{"_id":"5840ff3bc3a36865b3002fc7","air_date":"2010-02-01","episodes":[{"air_date":"2010-02-01","episode_number":1,"episode_type":"standard","id":1262563,"name":"Nostradamus","overview":"Michel de Nostradame, a 16th century astrology and seer, lived in Provence, Southern France. He wrote one of the most popular astrological books of all time, “The Prophecies”. This book contains 942 strange prophecies which foretell of bizarre events running far into the future. Since Nostradamus’ death, many people have attributed his predictions to major world events like the Great Fire of London, Hitler, Napoleon, the Atomic Bomb and the assassination of American President John F Kennedy. Such is the belief in Nostradamus’ popularity, he was even turned to soon after the terrorist attack on the World Trade Center on 11th September 2001.\n\nMystery Files undertakes to investigate the man behind these prophecies, to test his astrological skills and to reveal the secret of his prophetic powers. We call on leading experts like Ian Wilson - Nostradamus biographer, Peter Lemesurier - translator of his prophecies and historical investigator, Monica Azzolini – Renaissance Historian and Paul Wade – professional astrologer.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/loQNRKXrpfRqxeSVz8VCLri556a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-01","episode_number":2,"episode_type":"standard","id":1262567,"name":"Jack the Ripper","overview":"How do we get close to a killer the police haven't been able to identify for over 100 years? With the help of renowned British crime historians and authors Applying modern techniques and trawling the archives Mystery Files unearths new evidence to eliminate an age old suspect, and discovers a new likely candidate was right under the policemen's nose.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/c7IOOfEXC7A8aRcjSOsn4ySgUap.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-02","episode_number":3,"episode_type":"standard","id":1262564,"name":"Robin Hood","overview":"Robin Hood is one of the first super heroes. Stories of robbing the rich and giving to the poor are legend. Now evidence has been discovered to prove that Robin was a real person. Unpicking the folklore to separate fact from fiction, historians are exposing the man behind the myth. With new evidence culled from ancient manuscripts and historic sites this mysterious figure finally steps out of the shadows.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/aUiJhW5OLUGDSvRf7qbtq2W42U4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-02","episode_number":4,"episode_type":"standard","id":1262568,"name":"Royal Murder","overview":"One of Britain’s oldest unsolved mysteries, but what really happened to the Princes in the Tower? The two Princes were the sons of Edward IV and heir to the English throne who were allegedly murdered by their uncle, Richard III. But what real proof is there? We have two skeletons found in the Tower of London that are supposedly the remains of the princes, but their authenticity is highly disputed. Mystery Files re-opens the murder case and assesses whether Shakespeare’s evil, decrepit Richard III is nothing more than Tudor propaganda.\n\nWhen Princes Edward and Richard, heirs to the English throne, disappeared within the walls of the Tower of London in late June 1483, rumours soon began to circulate. They vanished while in the care of their Uncle Richard who was brother to the late King Edward IV and so would inherit the throne if it wasn’t for the princes, and as the news started to spread, cries of murder were heard across England. Their disappearance is shrouded in mystery but were they killed? And if so by who?","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/jO9sWhbTyedVyuhYeDvfa6a39cH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-03","episode_number":5,"episode_type":"standard","id":1262569,"name":"Rasputin","overview":"On December 16th 1916, Grigory Rasputin, self-styled faith healer and confident to the Tsar was fatally shot in the back of the head. His enemies fear that his hold over the Romanov family has gone too far.\n\nThis is the story of how a simple peasant rose through the ranks of Russian aristocracy to win the ear of the Tsar and Tsarina and essentially become one of the most powerful men in Russia. Unfortunately for him, his influence over the family would attract the attention of many enemies, ensure his fall from grace and ultimately lead to his grisly death.\n\nRasputin’s demise, according to history, centres around a group of Russian nobles, Vladimir Purishkevich, Felix Yusupov and Dmitri Pavlovich, who, in later years, all admitted to being involved in his assassination.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/yHqiofFfDqRMFvbfBgfExhYsFBF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-03","episode_number":6,"episode_type":"standard","id":1262571,"name":"Billy the Kid","overview":"It’s the late 1870s. One of the most infamous outlaws of the American Wild West is Billy the Kid… a teenage killer who terrorizes New Mexico. Legend tells us that he killed 21 men, one for each year of his life. For in 1881, at the age of 21, the Kid is gunned down by his one time friend and lawman Pat Garrett. But the real person behind this legend is very different. Who is The Kid?\n\nHenry McCarty, Henry Antrim, William H Bonney, The Kid. These are just some of the Kid’s names. He appears in the historical records at the age of 15, when he is caught stealing some clothes from a washing line. He had been orphaned, and found himself alone in the world. He escaped from jail and ended up in the town of Lincoln, New Mexico. It was here that he met English business man John Tunstall who gave the Kid- who had nothing- a job, a gun and a horse.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/1QnbHgBkkTwQ0ldSTRciLhi25gY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-04","episode_number":7,"episode_type":"standard","id":1262565,"name":"King Arthur","overview":"King Arthur- myth, legend or did he actually exist? According to the tales he reputedly led the defence of Britain from Saxon invaders in the early 6th century and throughout the ages, he has been recognised as the ultimate British hero, but whether or not he ever existed has always been hotly debated.\n\nModern day perceptions conjure up Romantic images of Arthur and see him reign from his castle at Camelot over a mighty court. As King of the Britons, he and his knights of the round table are the ultimate symbol of chivalry and honour bringing enlightenment to the dark ages.\n\nA legend that spans over centuries, not surprisingly Arthur has assumed many identities. The most definitive collection, Morte D’Arthur, was forged in the tower of London prison by Sir Thomas Mallory. A man awaiting trial for rape, murder and extortion. Mallory’s, ‘Morte D’Arthur,’ is the culmination of hundreds of years of storytelling about the famous king. It tells of Arthurs utopian empire, his brave knights in shining armour and of course the betrayal by his most valiant knight Sir Lancelot and his beautiful Queen Guinevere who have an illicit affair. The story concludes with Arthur being mortally wounded in battle by his scheming nephew Mordred before being taken off to the magical Isle of Avalon, where he rests in an eternal sleep until his country needs a saviour.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/i5ig6v1VL83oYtR4GLekCGjT0lS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-05","episode_number":8,"episode_type":"standard","id":1262572,"name":"Leonardo da Vinci","overview":"The Renaissance was the greatest flowering of art, mathematics, technology, architecture and astronomy the world has ever known. And at the centre of this new age, was the multi-talented artist and inventor, Leonardo da Vinci, the ultimate Renaissance man.\n\nLong credited as the inventor of such futuristic machines as the tank and the helicopter, new evidence seems to suggest that Leonardo may not have not have been the originator of these groundbreaking ideas after all.\n\nIn this episode of Mystery Files, a team of Renaissance and Leonardo experts investigate the truth to the claims that Leonardo was a genius inventor, and use science to prove that he really was probably the greatest artist to have ever lived.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/aDcaGpPg9C6EPzHjzDjukHS0C4B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-08","episode_number":9,"episode_type":"standard","id":1262573,"name":"Abraham Lincoln","overview":"Abraham Lincoln. The man who rises from obscurity to become the 16th American President and arguably it’s finest. But on April 15th 1865 he becomes the first US President to be assassinated, leading to the creation of a legend that obscures his true personality.\n\nExperts Michael Burlingame, James McPherson and Harold Holzer investigate Lincoln, exploring his less well-known early life and how it drives his later actions. He grows up on the American frontier and has a poor rural upbringing - a far cry from the glory of the White House. Our experts reveal Lincoln’s strong dislike of this agricultural lifestyle and his overwhelming ambition to get out, to move up and escape his father’s legacy. At every spare opportunity Lincoln read books - he was one of the greatest autodidacts of his age, for he had greater ambitions than those of his father. He became a Politician and soon after a lawyer as well.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/7p1hEe5LdQfTyG5B3RTArRvEVp9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-09","episode_number":10,"episode_type":"standard","id":1262574,"name":"Cleopatra","overview":"Cleopatra was Born into a dangerous, scary and violent world where everyone believed the dead lived, gods walked amongst us and magic really worked. In this uncertain world, the main instruments of politics were exile or murder, conquest and war. She succeeded the Egyptian throne at the age of 18 and was forced into a world of intrigue, treachery, conspiracy and assassination. Life expectancy of a ruler of Egypt was short and highly likely to end in murder.\n\nOutside her kingdom, the Roman Empire had expanded more in the last decades than ever before. Their ruthless and invincible army had conquered the known world from Scotland to the foothills of the Himalayas. They now had their sights on Egypt – with its bounty of grain, exotic treasures, slaves and gold. How did a teenage girl manage to retain her throne, and her life, against invaders from without, and enemies within, far longer and with far greater success than anyone might have reasonably expected? And not only achieve this, but exert control and influence over two of the most powerful rulers of her generation, Julius Caesar and Marc Antony?","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/caGfrMMTacxRlsecqHspL19irhw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-10","episode_number":11,"episode_type":"standard","id":1262575,"name":"Man in the Iron Mask","overview":"In 17th century France, King Louis XIV is perhaps the most powerful man on earth. Known as the Sun King, his court at Versailles is magnificent – the heart of Europe’s wealthiest nation.\n\nHowever, he is in constant fear of the threat to his throne posed by his twin brother. Louis orders for an iron mask to be cast and placed on his brothers’ head. His brother is threatened with death if he dares to remove the mask. Ever since, historians have argued over the truth behind the story of this unfortunate individual. For two hundred and fifty years, the questions have remained unanswered.\n\nIn this episode of Mystery Files, a team of investigators try to find the truth. Visiting the darkest dungeons of imperial France, using modern scientific experiments, and researching long forgotten document, they build a compelling and scandalous account of true story behind the myth of the Man in the Iron Mask.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/hvXM3wXCGoSzucxSPlKxR8AfglC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-11","episode_number":12,"episode_type":"standard","id":1262576,"name":"The Romanovs","overview":"At the beginning of the twentieth century, the Romanov family are at the heart of Russian life. Tsar Nicholas has been on the throne since 1894, married to a German-born princess, Tsarina Alexandra, and with five beautiful children, Olga, Tatiana, Anastasia, Marie and Alexei, they are seen as the perfect royal family. But by 1917, they are overthrown in a Bolshevik coup amidst the Russian revolution, taken prisoner and brutally executed by a communist firing squad.\n\nFor more than ninety years the whereabouts of their bodies was unknown until a team of archaeologists uncovered a grave in some dense forest near Ekaterinburg. In 1991, after DNA testing and a sample retrieved from Prince Andrew, a relative of the Romanovs, scientists confirmed the authenticity of the bones.\n\nAside from this important breakthrough, it was also discovered that two of the bodies were missing from the grave, fuelling the already common speculation that two of them may have survived, namely Alexis and Anastasia who amassed numerous impersonators over the years adding to the mystery already surrounding the tragedy.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/1tRxlW5KrJhDdtKwghkJVJKnc1W.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-02-12","episode_number":13,"episode_type":"finale","id":1262577,"name":"Joan of Arc","overview":"Joan of Arc is one of the patron saints of France and a national and international icon; a young girl who lived in the earl 1400s in rural north eastern France. Her legend states that she hears the voice of God and embarks on a holy crusade to free France from English oppression. These actions finally lead to her downfall as she is captured, tried and burned alive as a heretic in 1431, aged just 19. Through modern psychological and historical investigation, Mystery Files reveals how such a young girl managed to overcome the hardships and obstacles to achieve so much.\n\nJoan grows up in a rural peasant household but her life changes dramatically when she claims at the age of 13 to hear voices inside her head. Psychologist Miguel Farias studies the historical accounts of Joan’s life and believes the voices could be thoughts buried deep in her unconscious mind. Joan’s belief in these voices is so strong that she undertakes an extraordinary mission.","production_code":"","runtime":null,"season_number":1,"show_id":64807,"still_path":"/de9zPFhzQ9AFNmGqZGb3wh8v5Ab.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":82519,"poster_path":"/u1bpr3ZVtUHDZGbgeUZzBXiT4yw.jpg","season_number":1,"vote_average":0},"2":{"_id":"56807c64c3a368227b004552","air_date":"2011-06-06","episodes":[{"air_date":"2011-06-06","episode_number":1,"episode_type":"standard","id":1262580,"name":"The Birth of Christ","overview":"In fact only two of the four accounts of the life of Christ in the New Testament, the Gospel of Luke and the Gospel of Matthew, tell of his birth. These Infancy Gospels, as they are known, both agree that Jesus was born in Bethlehem and today pilgrims and tourists mill in their thousands around the Church of the Nativity built upon the supposed site of Christ’s entry into the world, just as they have for centuries. But only Luke mentions the Census and the journey from Nazareth. Neither mentions the ox or the ass. The visitors from the east are nowhere referred to as Kings and nor is it mentioned that there are three of them.\n\nBoth Gospels mention King Herod, but his dates do not correspond with the dates of a possible Roman census under the Governor Quirinus mentioned in Luke, which came ten years after Herod the Great’s death. And what census, then or now, would take you away from your main residence to be counted in a town which you or your ancestors have long since left?\n\nWe reveal that even though we assume that Joseph is present at the birth of Christ, this is not mentioned in any of the gospels. In fact according to purification laws outlined in the Temple Scroll and in the book of Leviticus, under Jewish law the only people that may have been present at the birth would in fact have been women.\n\nWith help from leading academics, archaeologists and Jewish and Christian theologians, we visit many of the locations mentioned in the Gospels to place the birth of Christ in its historical, cultural and Jewish and early Christian contexts and piece together the real story of The Nativity.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/2VbmhJ51Nu584S2WN5xerMnzRDy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-06","episode_number":2,"episode_type":"standard","id":1150288,"name":"Hitler","overview":"This programme analyzes the very latest neurological research into Shell Shock and trauma, it retraces Hitler’s time as a frontline soldier, and examines the medical history of Hitler’s gas poisoning and his period at a psychiatric wartime hospital that the Nazi Party later tried to cover-up; and it explores an American top-secret report from 1943 to discover how Hitler’s war experiences led to him suffering what some historians believe to be an extreme psychological disorder, Hysterical Blindness, known today as Conversion Disorder.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/2C8B4B2kWoz33EfSkJCxtPrlXJq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-07","episode_number":3,"episode_type":"standard","id":1262578,"name":"Marco Polo","overview":"We reveal that despite the book suggesting he spent 20 years in the court of the Chinese emperor, there is no mention of Marco in Chinese records. Marco Polo’s last will and testament remains unsigned and even the inventory of his possessions made on his death has question marks hanging over it.\n\nOur experts examine all the best evidence. Did Marco Polo, or any European, travel so far into China so long ago? Are the famous tales really based on Marco Polo’s travels? And did a man named Marco Polo even exist?","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/p2ldd63rYJ176DfDzruWFyEZxry.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-07","episode_number":4,"episode_type":"standard","id":1262579,"name":"Alexander the Great","overview":"After his death, his body became one of the most sacred objects in history. Pilgrims, from the common man to the most powerful emperors, visited and knelt before the remains of their god-King. And then in the space of a generation, all trace of his tomb simply disappeared. What happened to Alexander’s body? Was it destroyed by a tsunami? Did Christians intent on stamping out all trace of other religions destroy it? Or, as one historian believes, does it still exist, renamed and venerated as a saint in one of the most glorious Christian basilicas in the world? With no archaeological evidence indicating the location of the lost tomb we are forced to examine ancient eyewitness accounts of people who visited the tomb and place it in Alexandria.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/j4D18wGHPBTgRkv6vyj1cTOGrUv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-08","episode_number":5,"episode_type":"standard","id":1262581,"name":"Taj Mahal","overview":"Throughout the seventeenth Century several European travelers visit the Taj Mahal. Many of these explorers later publish lengthy volumes of their adventures. Only 10 years after the emperor’s death, the French traveller, Jean Baptiste Tavernier, publishes a travelogue of his adventures in India, mentioning an uncompleted mausoleum across the river from the Taj Mahal. The story spreads and other writers across the centuries state it as fact.\n\nIn the mid-1990s, excavators’ uncover the remnants of a garden are found with the exact dimensions to that of the garden of the Taj Mahal. Black stones are also found. Are these the remains of the Taj Mahal’s fabled sister building?","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/ePfU3p1z4zutBsIRqnltcMEXsmN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-08","episode_number":6,"episode_type":"standard","id":1262582,"name":"Isaac Newton","overview":"Newton was convinced that he alone had been given a gift to unravel the mysteries of the Universe, whether through science, religion or alchemy, and maintained an unrivaled cloak of secrecy over all three.\n\nBut there must have been something that Newton was especially desperate to keep secret - taking it with him to the Grave. He burned boxfuls of papers just weeks before his death. What could he have been so desperate to destroy?\n\nModern psychiatrists now suggest that this act, along with many of his other characteristics were driven by Asperger’s Syndrome and that in fact, he was the most classic case of Asperger’s Syndrome in history.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/kS30FPWJjXmelyVp92TJQEgBQe4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-09","episode_number":7,"episode_type":"standard","id":1262583,"name":"Saladin","overview":"Through the accounts and diaries of Saladin’s closest advisers, the mysteries of the period are uncovered. Saladin’s fear at the imminent arrival of Richard and the opening of the Third Crusade, his indecision at the Siege of Acre and his failure to ensure the safe release of 3000 Muslim prisoners all paint a picture of a more complex man. Debunking many of the myths of the Crusades, and showing how the war changed both Saladin and Richard the Lionheart, leading them both to question the massive death toll of the conflict. In Saladin’s last days in Damascus, his spirit sapped by war, and of his last words, a denunciation of blood-shed.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/vmJBR7SCDPXXo95TqlnAHpRwtC9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-09","episode_number":8,"episode_type":"standard","id":1262584,"name":"Captain Kidd","overview":"His conviction may not be unjust but it is perhaps unfair and certainly unlucky. Kidd’s actions at sea clearly made the full use of the legal grey area that privateering occupied, an area that many men took advantage of, and most without feeling the full force of the Old Bailey tightening around their necks.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/iWFRNEmQaCaqaJRwNDqgb94CPKo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-10","episode_number":9,"episode_type":"standard","id":1262585,"name":"Pope Joan","overview":"In Rome today is the street known as Vicus Papissa, ‘the street of the woman pope’. In that avenue is an alcove in which it is said an image of Joan once stood, in memory of the spot where she gave birth. The street runs between St Peter’s and the Lateran to the Coliseum and was part of the processional route of all popes in Rome until the 13th Century, when it was suddenly redirected away from the location of Joan’s legendary procession. Some scholars believe that the official route was changed so that the new pope wouldn’t have to pass the notorious site.\n\nNo contemporary 9th century accounts of a female pope exist, but with no conclusive proof to the contrary, the possibility remains that a talented woman could have risen to become Bishop of Rome? The words of the first writer to account for Joan, Jean de Mailly, resound even more loudly today than they did centuries ago; next to his story of Joan, he wrote the words, ‘to be verified’.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/3gu5tRLhormejO0QUSqTCVLUa3g.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-01-10","episode_number":10,"episode_type":"standard","id":1262586,"name":"Sitting Bull","overview":"In 1890 newspaper headlines read “Custer’s murderer is dead”. The papers tell of the killing of the man who stood in the way of civilisation. Such is the legend of Sitting Bull: the great chief who defied the US authorities and led the American Indians in the biggest massacre of US soldiers throughout the fight for the west.\n\nBut this is just one of the myths that have built up around the Battle of Little Bighorn. The battle wasn’t part of an American Indian offensive, but a response to aggression from the US Government. Custer’s men lost thanks to the greater Indian firepower and their guerrilla tactics. Most extraordinary of all, Sitting Bull didn’t murder Custer…he didn’t even take part in the battle. He stayed with the women and children, guiding them to safety.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/4loy5P436qtdppL7PYuABjrTLjJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-13","episode_number":11,"episode_type":"standard","id":1262587,"name":"The Virgin Queen","overview":"Did Dudley and Elizabeth conspire to murder his wife so that they could be together?\n\nBy piecing together the staircase in question using old evidence, modern crime scene investigation sheds new light on the age old mystery and suggests that Amy did not die accidentally.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/gznGDnNI8oH2FDgQVWKGObGUk95.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-13","episode_number":12,"episode_type":"standard","id":1262588,"name":"Zorro","overview":"Decades earlier, a popular writer in Mexico, Riva Palacio, was writing stories with a character called El Zorro, and a character called Guillen Lampart. Much of Palacio’s work was published in New York in 1908, where it could have partly inspired Johnston McCulley. Palacio’s fictional character of Lampart was based on meticulous research in to the real-life crime story of Guillen Lombardo from two hundred years earlier, when Mexico was a colony of Spain, and the Catholic world was in the grip of the Inquisition. Modern-day research in to the Inquisitions records reveals an intriguing fact; Lombardo was not Mexican, he was not even Spanish, he was Irish, and his real name was William Lamport. Posing as an aristocrat by day, Lamport was in fact a spy on a mission for the King of Spain. When he arrived in Mexico City he set about starting a revolution to liberate the local Indians from the tyranny of corrupt Spanish rulers. His actions got him arrested by the Inquisition who put him on trial, and from whose prison he made a breakout that would become legend. This programme examines the personal papers of Lamport, it reveals long-hidden reports from the Mexico archives, and investigates the daring prison escape, to open the Mystery Files on Zorro.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/1JhAejgeuLCet8GkPZqaHbTreiX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-14","episode_number":13,"episode_type":"finale","id":1262590,"name":"Lawrence of Arabia","overview":"We reveal an ambitious archaeological project in Southern Jordan, which is providing startling new evidence. The Great Arab Revolt Project (GARP) is one of the only archaeological investigations of a battlefield on this scale anywhere in the world. While the archaeological trace of Lawrence and the Bedouin guerrilla fighters is by its very nature incredibly scarce, the military structures of their opponents, the Ottoman Turks, are all too evident. The structures and scars from this battle are visible across the desert, in particular around the city of Ma’an, a key Hejaz station. On-the-ground analysis of surviving defences begins to reveal the style of warfare played out in this military arena.","production_code":"","runtime":null,"season_number":2,"show_id":64807,"still_path":"/fuJHvkBAAexpbkzFi2OTqxDLkH0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":73054,"poster_path":"/1rSO2wtZzJLcnvVBcrmxO91LKC1.jpg","season_number":2,"vote_average":0}}}