{
    "adult": false,
    "backdrop_path": "/5bRuhvFDAntqzw8LTJZmgDBjrdV.jpg",
    "created_by": [],
    "episode_run_time": [
        47
    ],
    "first_air_date": "2013-12-29",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        },
        {
            "id": 10759,
            "name": "Action & Adventure"
        }
    ],
    "homepage": "https://www.channel4.com/programmes/speed-with-guy-martin",
    "id": 64972,
    "in_production": false,
    "languages": [
        "en"
    ],
    "last_air_date": "2016-10-02",
    "last_episode_to_air": {
        "id": 1228454,
        "name": "Human-Powered Boat",
        "overview": "Guy Martin attempts to beat the speed record for a human-powered boat, with help from Olympic legends Sir Chris Hoy and Sir Ben Ainslie",
        "vote_average": 5,
        "vote_count": 1,
        "air_date": "2016-10-02",
        "episode_number": 3,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 47,
        "season_number": 3,
        "show_id": 64972,
        "still_path": "/vGzkpegoXOiOxlMaNwTLnL9r9sm.jpg"
    },
    "name": "Speed with Guy Martin",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 26,
            "logo_path": "/hbifXPpM55B1fL5wPo7t72vzN78.png",
            "name": "Channel 4",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 11,
    "number_of_seasons": 3,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Speed with Guy Martin",
    "overview": "Motorcycle racer and mechanic Guy Martin undertakes a series of speed-based challenges, exploring the boundaries of physics and learning about the science of speed.",
    "popularity": 14.68,
    "poster_path": "/xNDb1WB3TCTqAMjVJa5JHunx1f.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2016-03-17",
            "episode_count": 4,
            "id": 75393,
            "name": "Specials",
            "overview": "Guy Martin loves pushing the boundaries of speed in search of a buzz. He claims that nothing can match the adrenaline rush he gets when he's racing on public roads around the Isle of Man TT course at 200mph. Now he wants to see if he can find anything that can give him the same kick. In this series, he creates four-speed based challenges, exploring the boundaries of physics, learning about the science of speed, and getting his hands dirty in a range of unique engineering projects.",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2013-12-29",
            "episode_count": 4,
            "id": 73267,
            "name": "Series 1",
            "overview": "",
            "poster_path": "/1IWiDX6k8qdq2Me4CUVVcP36rIH.jpg",
            "season_number": 1,
            "vote_average": 8
        },
        {
            "air_date": "2014-10-26",
            "episode_count": 4,
            "id": 92871,
            "name": "Series 2",
            "overview": "",
            "poster_path": "/YG2v8wPkajYdhXJn60rD6Ei4ob.jpg",
            "season_number": 2,
            "vote_average": 7.3
        },
        {
            "air_date": "2016-09-03",
            "episode_count": 3,
            "id": 79895,
            "name": "Series 3",
            "overview": "",
            "poster_path": "/i5EjiWULdYgq3ZwnUKwcZ4q9sv6.jpg",
            "season_number": 3,
            "vote_average": 6
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Ended",
    "tagline": "How to make things go really fast",
    "type": "Documentary",
    "vote_average": 8,
    "vote_count": 5,
    "season_data": {
        "1": {
            "_id": "56868c18c3a36860e901f515",
            "air_date": "2013-12-29",
            "episodes": [
                {
                    "air_date": "2013-12-29",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1151920,
                    "name": "Britain's Fastest Cyclist",
                    "overview": "Guy attempts, with the help of slipstreaming, to break the British record for outright speed on a bicycle: an incredible 110mph. Guy recruits an unlikely team made up of a truck racer, an Olympic gold medallist, a bicycle builder and a design engineer more used to working on next-generation military aircraft. Together they work out how to modify a 1000-horsepower racing lorry to create a large enough slipstream for Guy to cycle in, and build a unique bicycle gearing system capable of triple-figure speeds. With help from British Olympic track cyclist Laura Trott, Guy undergoes a relentless training regime to get fit enough for the record attempt. As he lines up at Pendine Sands in Wales - the scene of Sir Malcolm Campbell's historic land speed record attempts in Bluebird - it is without question the most dangerous thing this Isle of Man TT racer has ever done.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 1,
                    "show_id": 64972,
                    "still_path": "/zk8T6fwXVg1CWinBkojfYYtkW9J.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-05",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1367354,
                    "name": "Hydroplaning Bike",
                    "overview": "Guy attempts to set the world record for riding a motorcycle on the surface of water. With the help of a Cambridge professor and a team of marine engineers, Guy's stunt hinges on Sir Isaac Newton's Third Law of Motion: that every action has an equal and opposite reaction. If he can maintain enough speed on his bike, the 250-year-old theory says he should be able to achieve the seemingly impossible: to ride on water. The team master the engineering on the back wheel and the extra fittings on the bike to enable it to skim across the surface of a lake. Crashing is inevitable, so Guy endures a rigorous training schedule, trying to escape underwater from a submersion rig and then conducting a series of dizzying trial runs, hitting the water at 30mph head first. The final record attempt takes place at Bala Lake in Snowdonia - which is so deep a 10-storey building could be submerged in it - with Guy surrounded by an army of rescue teams and emergency divers.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 1,
                    "show_id": 64972,
                    "still_path": "/ce8Wya2i5f3N7s0I345NQTSxceW.jpg",
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-12",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1367355,
                    "name": "Human Powered Aircraft",
                    "overview": "Guy is on a mission to do the seemingly impossible: fly using muscle power alone. He wants to build the world's fastest human powered aircraft: a plane without an engine that Guy will cycle into the air. He heads to Southampton University where, on 9 November 1961, Derek Piggot became the first man to fly under his own power. Forty two years later, Guy is ready to break into the history books with another team from the university. They've got seven months to build a plane from scratch and equip Guy with the skill, power and endurance to pilot it. He begins by learning how to fly a glider with stunt pilot Guy Westgate. He also visits a velodrome to measure his cycling power output and embarks on a programme of intense physical training. Finally, Guy is ready to put his plane to the test against the UK's leading engineers in the Icarus Cup, where he sets out to pilot the fastest ever human powered aircraft.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 1,
                    "show_id": 64972,
                    "still_path": "/2KclAymNnXCX88q1krGdKkgns0r.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-19",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 1367356,
                    "name": "World's Fastest Toboggan",
                    "overview": "Guy sets out to break the record for the world's fastest gravity powered sled. With the help of top sports science engineers, athletes and experts in composite engineering, Guy builds a toboggan to ride on the unforgiving slopes of the Pyrenees as he attempts to claim the record from a group of thrill-seeking Germans who set it three years earlier. Guy experiences his first taste of going blisteringly fast on ice, at the famous Cresta Run in St Moritz, before a crack team of engineers from Sheffield Hallam University help him build a prototype toboggan. Then the fastest woman to ever to have ridden a skeleton bob, Amy Williams, gives him some tips on flying head-first down the 180-metre slope. He also races a drag bike at Santa Pod raceway, to help him master precision steering using his body weight alone, and also to help him find a way of stopping the sled safely, using a bespoke parachute system. Guy tries to break the record at Grandvalira in Andorra on the speed ski slope Pista Riberal. Despite the danger, Guy will hopefully steer himself into the record books.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 1,
                    "show_id": 64972,
                    "still_path": "/v9LvhUaJoFmnWmr6K9hhmzK3i2G.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Series 1",
            "overview": "",
            "id": 73267,
            "poster_path": "/1IWiDX6k8qdq2Me4CUVVcP36rIH.jpg",
            "season_number": 1,
            "vote_average": 8
        },
        "2": {
            "_id": "59be65b7925141353d0290e3",
            "air_date": "2014-10-26",
            "episodes": [
                {
                    "air_date": "2014-10-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1367357,
                    "name": "Tandem",
                    "overview": "Guy gets back on a bike to see how far it's possible to cycle during 24 hours of non-stop pedalling. With the help of bicycle brainiacs Miles Kingsbury and Mike Burrows, the man who designed Chris Boardman's gold medal-winning Lotus bike from the 1992 Barcelona Olympics, he builds a revolutionary tandem and pairs up with his friend, endurance expert Jason Miles, to see how far they can push their bodies at the Extreme Environments Laboratory at the University of Portsmouth. In the build-up to the final record attempt at the historic Goodwood Motor Circuit, Guy also learns about the science of cooking for athletes with the Head of Nutrition at Team Sky, Nigel Mitchell, who instructs Guy to lose five kilos of weight and recommends a new diet regime. Guy also works out the best ways of relieving himself on the move to save vital seconds. As the day approaches for the record attempt, news reaches the team that Hurricane Bertha is approaching.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 2,
                    "show_id": 64972,
                    "still_path": "/uhWUAfFDzEe6V6SgS1T7xbjtJrE.jpg",
                    "vote_average": 7,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-02",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1367359,
                    "name": "Pike's Peak",
                    "overview": "Guy visits the USA, where he hopes to win at one of America's oldest races: the Pike's Peak International Hill Climb. In this annual contest, known as The Race to the Clouds, riders compete against the clock on a gruelling mountainside track that finishes over 4000 metres above sea level. To learn the unique skills required in hill climb racing, Guy heads to the birthplace of the sport: Shelsley Walsh hill climb in Worcestershire. Racing up the course in an F1-style car, he realises that sheer horsepower and driving precision are vital. However, in the thin air of Pike's Peak, Guy's body and bike will be desperately short of oxygen, which could seriously affect his performance. As well as trying to add more power to his homemade bike, Guy takes a high-altitude fitness test in a hypoxic chamber. He soon realises how much harder his body will have to work and how the high altitude will affect his brain and cognitive performance; crucial when he has to remember the 150-plus bends in the road and avoid driving over a cliff! After six months' preparation and a two-day road trip across America, Guy's success depends not just on how well he's tuned his bike and body, but on his own abilities as a racer",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 2,
                    "show_id": 64972,
                    "still_path": "/cErsWV5cwEho4uJuQp6UEekbgTY.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-09",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1367360,
                    "name": "Hovercraft",
                    "overview": "The motorcycle racer leaves his comfort zone as he attempts to set a world speed record for a hovercraft. These machines are notoriously difficult to control, so to learn the basic skills needed he's put through his paces by Royal Marines in a military training operation. To achieve his goal, Guy will need to stay over 86mph for a kilometre, but at these speeds, because of the hovercraft's inherent instability, even the most experienced pilots can lose control - and the worsening weather makes things that much more challenging",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 2,
                    "show_id": 64972,
                    "still_path": "/iQZcfvwf5lIpbUEHPdwqb9xH6od.jpg",
                    "vote_average": 6,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-11-16",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 1367362,
                    "name": "Gravity Racer",
                    "overview": "In the last episode of the new series, Guy Martin attempts to build and race the world's fastest soapbox racer, creating a unique design, with help from expert designers and bobsled racers, and training with the Team GB women's bobsled pair.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 2,
                    "show_id": 64972,
                    "still_path": "/5fVCsKvXk1oXSo35JfWzru35Z30.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Series 2",
            "overview": "",
            "id": 92871,
            "poster_path": "/YG2v8wPkajYdhXJn60rD6Ei4ob.jpg",
            "season_number": 2,
            "vote_average": 7.3
        },
        "3": {
            "_id": "57cdb555925141755b001945",
            "air_date": "2016-09-03",
            "episodes": [
                {
                    "air_date": "2016-09-04",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1220579,
                    "name": "Transit Van",
                    "overview": "Guy will attempt to break the speed record for a Transit Van. The record currently stands at impressive 174mph. But ever the optimist, Guy wants to reach the 200mph barrier in a souped-up Transit.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 3,
                    "show_id": 64972,
                    "still_path": "/1DHCklMBwsdsgvU10V8fKMbHMR8.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-09-25",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1228455,
                    "name": "Pedal-Powered Airship",
                    "overview": "Guy tries to cross the English channel on a human-powered airship. His transport takes the form of a bicycle held aloft by a helium balloon the size of a bus, with the pedals driving two propellers. He puts the machine to the test in Bedfordshire's historic Cardington Hangars, where some of the world's biggest flying machines were created, and seeks some military advice on surviving crash landings.",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 3,
                    "show_id": 64972,
                    "still_path": "/kfQ5aIBu59Nx3RIKYsXEwIk0PjF.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-02",
                    "episode_number": 3,
                    "episode_type": "finale",
                    "id": 1228454,
                    "name": "Human-Powered Boat",
                    "overview": "Guy Martin attempts to beat the speed record for a human-powered boat, with help from Olympic legends Sir Chris Hoy and Sir Ben Ainslie",
                    "production_code": "",
                    "runtime": 47,
                    "season_number": 3,
                    "show_id": 64972,
                    "still_path": "/vGzkpegoXOiOxlMaNwTLnL9r9sm.jpg",
                    "vote_average": 5,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Series 3",
            "overview": "",
            "id": 79895,
            "poster_path": "/i5EjiWULdYgq3ZwnUKwcZ4q9sv6.jpg",
            "season_number": 3,
            "vote_average": 6
        }
    }
}