{
    "adult": false,
    "backdrop_path": null,
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2014-01-19",
    "genres": [],
    "homepage": "",
    "id": 65015,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2016-03-31",
    "last_episode_to_air": {
        "id": 3259293,
        "name": "Jack The Giant Killer; Last Emperor of Mexico; Saving Britain's Art",
        "overview": "A heart-shaped stone at St Michael's Mount in Cornwall, England, pays tribute to \"Jack the Giant Killer\", a young farmer's son who took on a gigantic 18-foot fearsome foe who terrorized towns and villages across the land. Chapultepec Castle in Mexico City, Mexico, becomes the home of Maximilian I when he is deceived by his ally, France's Napoleon III, who forcefully got the Mexican people to appoint the Austrian archduke as their emperor. Penrhyn Castle in Bangor, Wales became the hiding place of Britain's most prized art collection to avoid the Blitz during World War II when director of the National Gallery, Kenneth Clark and his assistant Martin Davies stored the paintings there.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2016-03-31",
        "episode_number": 13,
        "episode_type": "finale",
        "production_code": "",
        "runtime": null,
        "season_number": 3,
        "show_id": 65015,
        "still_path": null
    },
    "name": "Castle Secrets & Legends",
    "next_episode_to_air": null,
    "networks": [],
    "number_of_episodes": 31,
    "number_of_seasons": 3,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "Castle Secrets & Legends",
    "overview": "Behind the gates of the world's most impressive castles, manor houses and mansions are secrets waiting to be revealed. See these amazing structures in all their glory and hear the remarkable, mysterious and bizarre tales tied to the rich and powerful who once resided there. From a German castle where a real life Dr. Frankenstein tried to breathe life into the dead to the magnificent Highclere Castle, which is now the setting for Downton Abbey, but was once the home of an English lord who unearthed King Tut's tomb, these stories will captivate and amaze. Go inside the castles, manors and mansions with our behind-the-scenes photos, and watch exclusive video of the stories and secrets hidden in their history. The first season of Mysteries at the Castle aired under the name 'Castles, Secrets and Legends'.",
    "popularity": 0.602,
    "poster_path": "/qqRCLoeI14v0E8DREzuRzgBR6Vx.jpg",
    "production_companies": [
        {
            "id": 57099,
            "logo_path": "/17wDGCSsPxVhuFGxCF6KALV8g6F.png",
            "name": "Optomen Productions",
            "origin_country": "US"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "US",
            "name": "United States of America"
        },
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2014-01-19",
            "episode_count": 5,
            "id": 73317,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2015-01-02",
            "episode_count": 13,
            "id": 214199,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2016-01-08",
            "episode_count": 13,
            "id": 214200,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "5686b75a9251414ecb01134b",
            "air_date": "2014-01-19",
            "episodes": [
                {
                    "air_date": "2014-01-19",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1152014,
                    "name": "Real Frankenstein, Mummy Curse, Man in the Iron Mask",
                    "overview": "The Tower of London in London, England, built in 1066 as a royal residence is where the crown jewels are securely kept until an attempt by Irish rebel Thomas Blood who tried to steal the regalia in 1671. The Morris-Jumel Mansion in New York City is still home of the ghost of Eliza Jumel who is believed to have let her wine merchant husband die by bleeding to death in their home in 1832. The Château de Miolans, an impenetrable bastion in St. Pierre d’Albigny in the South of France is where the French aristocrat-turned writer Marquis de Sade was imprisoned after an out of control party in 1772 landed him an attempted murder charge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-01-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3259239,
                    "name": "Crown Jewels Heist; Marquis de Sade; Enigma of Kaspar Hauser",
                    "overview": "In the series premiere, a scandalous affair between a British government minister, a showgirl, and a Soviet spy begins at Cliveden House in Taplow, England. Frankenstein Castle, now in ruins on a rocky hilltop in Darmstadt, Germany is the home of scientist, Johann Konrad Dippel who conducted experiments to bring the dead back to life and was the inspiration behind Mary Shelley's Frankenstein.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-09",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3259259,
                    "name": "Hound of the Baskervilles; Lord Gordon-Gordon; Escape from Colditz",
                    "overview": "Cromer Hall, a British manor house on a moor inspired Sir Arthur Conan Doyle to write his classic novel, The Hound of the Baskervilles of his Sherlock Holmes stories. When Scottish aristocrat Lord Gordon-Gordon gets a share in the Erie Railroad, it results in a scandal from a scheme by Wall Street robber baron Jay Gould, and owner of a castle known as Lyndhurst in Tarrytown, New York",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-16",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3259262,
                    "name": "The Tichborne Claimant; Washington Resurrection; Loch Ness Hoax",
                    "overview": "Castello di Malaspina in Fosdinovo, Italy becomes a tomb for Bianca Malaspina, an albino girl who defied her noble parents when she fell in love with a stable boy, causing them to brick her up alive in the dungeon. Upton House in Poole, England was a part of an inheritance dispute when a man from Wagga Wagga, Australia, claimed to be English aristocrat Roger Tichborne, the family's sole heir who drowned in a shipwreck 10 years prior. On Friday the 13th, December 1799, George Washington falls ill, and after doctors try to treat him with bloodletting, he passes away the next day in his home, Mount Vernon in Mount Vernon, Virginia, however, Dr. William Thornton proposes a radical procedure to reanimate him.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2014-02-23",
                    "episode_number": 5,
                    "episode_type": "finale",
                    "id": 3259263,
                    "name": "The Black Dinner; Voynich Manuscript; Seward Attack",
                    "overview": "In 1440, the boy king, James II takes revenge on the rebellious Earl of Douglas for wanting his throne by inviting him to a banquet at Edinburgh Castle in Edinburgh, Scotland, later known as the \"Black Dinner\", inspiring one of the most brutal scenes in the Game of Thrones. When a wealthy widow of railroad millionaire Mark Hopkins falls ill and dies after marrying Edward Searles, the designer of Searles Castle in Great Barrington, Massachusetts, the community believes he poisoned her for money. Gradara Castle in Gradara, Italy was at the center of two warring families—the Malatestas and the Polentas—who married off their beautiful daughter Francesca to the ugly Giovanni Malatesta, starting a tragic tale of love between her and his brother, Paolo.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 73317,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "615a7af169eb90002a28a864",
            "air_date": "2015-01-02",
            "episodes": [
                {
                    "air_date": "2015-01-02",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3259264,
                    "name": "Dracula; Queen and the Mistress; King Arthur",
                    "overview": "After impaling his Turkish enemies at Bran Castle in Bran, Romania, the bloodthirsty prince, Vlad III (aka Vlad the Impaler) inspires Bram Stoker's Dracula, one of the most notorious characters in modern literature. Glastonbury Abbey in Glastonbury, England was once the setting of the mythical tale of King Arthur and the legendary love triangle of Sir Lancelot and Guinevere. When an ailing U.S. Army medic is pronounced dead from meningitis, he makes a miraculous recovery, and doctors use his blood for a cure, inspiring him to live a long life building his dream home, Loveland Castle in Loveland, Ohio.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-09",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3259265,
                    "name": "Henry 8th; Bannerman's Castle Curse; Mechanical Turk Hoax",
                    "overview": "King Henry VIII's uncontrollable obsession to retain his reign by producing a male heir with his three wives paves the way for a tale of tragedy taking place at Hampton Court Palace near Surrey, England. Carlisle Castle in Carlisle, England was home to King William II, who's suspicious death led many to believe he was murdered by Walter Tirel, a possible assassin hired by his younger brother Henry I to ascend the throne. Schönbrunn Palace in Vienna, Austria becomes the showplace of inventor Wolfgang von Kempelen's creation \"The Turk\", a chess-playing automaton made for Empress Maria Theresa.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-16",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3259267,
                    "name": "Faust; Pirate Queen; First Versailles",
                    "overview": "Alchemist-astrologer Johannes Faust's desire for knowledge leads him into a pact with the devil with his demon Mephistopheles at Waardenburg Castle in Waardenburg, Netherlands. Rockfleet Castle, a strategic stronghold in Newport, County Mayo, Ireland becomes the center of Pirate queen Grace O'Malley and powerful chieftain Richard Burke who clash in a tale of passion, betrayal, and later, love. During the English Civil War, captured King Charles I plans an escape from at Carisbrooke Castle in Carisbrooke on the Isle of Wight, England.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-23",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3259268,
                    "name": "Green Lady; Count of Monte Cristo; Robin Hood",
                    "overview": "Trapped in a loveless marriage, Charlotte de Breze seeks affection by having a secret affair, but when her brutal husband Jacques de Breze finds out, it results her vengeful ghost at the Château de Brissac in Loire Valley, France. After toy production is banned for the holidays during World War I, A. C. Gilbert becomes \"the man who saved Christmas\" with his invention of the Erector Set, inspiring the design of his home, Maraldene Mansion in New Haven, Connecticut.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-01-30",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3259270,
                    "name": "House That Saved a King; Joan of Arc; Hamilton Sex Scandal",
                    "overview": "In 1651, Moseley Old Hall near Staffordshire, England,becomes the hiding place of the future King Charles II who escaped Parliamentary forces during the English Civil War. The heroic story of German officer Claus von Stauffenberg, who came up with a plot to assassinate Adolf Hitler during World War II started at his birthplace inside Jettingen Castle in Jettingen-Scheppach, Germany.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-06",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3259271,
                    "name": "Royal Baccarat Scandal; Soleste and Moroello; Franz Ferdinand",
                    "overview": "Playboy prince, Edward VII was embroiled in a scandal while playing an illegal game of baccarat at Tranby Croft near Hull, England, that almost cost him the throne. The legend of Moroello and Soleste, a heartbreaking tale of ill-fated love and its haunting aftermath plays out behind the walls of Bardi Castle in Bardi, Italy. Artstetten Castle's crypt in Artstetten, Austria becomes the final resting place of Austria-Hungary's, Archduke Franz Ferdinand when his motorcade takes a fateful wrong turn into global disaster, and he and his wife, Sophie are assassinated by Black Hand member, Gavrilo Princip. When longshoreman union leader Harry Bridges starts a city-wide strike in 1934, it makes California Governor's Mansion in Sacramento a reminder of the labor movement.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-13",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3259272,
                    "name": "Book Chest; Miracle of Anne Greene; Hemingway's Last Cent",
                    "overview": "The prison at Oxford Castle in Oxford, England, was where lowly servant, Anne Greene overcame a shocking injustice by her employer and returned from the dead after being hanged in 1650. When his young son was diagnosed with rheumatoid arthritis, Italian immigrant Candido Jacuzzi's innovation of the Jacuzzi tub help eased his pain and funded the Jacuzzi Family Home in Sonoma, California. When philosopher Hugo Grotius is imprisoned for life after writing controversial papers on Arminianism, he stages an escape from the Netherlands' Loevestein Castle near Poederoijen.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-20",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3259273,
                    "name": "Book Thief; Bigamist Dutchess; Patent-ly Absurd",
                    "overview": "A book thief pulls off an incredible heist that unfolds at the mountaintop retreat of Mont Sainte-Odile Abbey in the Vosges Mountains of France. York Castle in York, England was where infamous highwayman Dick Turpin was incarnated after being caught in a manhunt that ended his long crime spree. After Elizabeth Chudleigh, Duchess of Kingston is charged with bigamy by marrying in her youth Augustus Hervey, 3rd Earl of Bristol and then Evelyn Pierrepont, 2nd Duke of Kingston-upon-Hull, her rags to riches story ends in scandal, exiling her from Thoresby Hall in Nottinghamshire, England.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-02-27",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3259274,
                    "name": "Martin Luther Kidnapping; Witches of Belvoir; Secret Queen",
                    "overview": "After the Earl of Rutland's two sons die at their family estate, Belvoir Castle near Grantham, England, he believes they were cursed by the Witches of Belvoir. When the Catholic Church arrests revolutionary monk Martin Luther, his protestant supporters rescue him and escape to Wartburg Castle in Eisenach, Germany",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-03-06",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 3259275,
                    "name": "The Real Beauty and the Beast; Birdman of Scotland; Master of Disguise",
                    "overview": "The Château de Blois in Blois, France was the boyhood home of a \"monster\", who with his wife, inspired one of the most famous fairy tales of all time, Beauty and the Beast. As the most wanted man, Confederate States Secretary of State Judah P. Benjamin sparks a chase across America, seeking refuge at the Gamble Mansion in Ellenton, Florida.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-03-13",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 3259276,
                    "name": "Irish Art Heist; Dickens Affair; Prince of Porcelain",
                    "overview": "Russborough House in County Wicklow, Ireland becomes the scene for one of the biggest art heists in the world when members of the IRA, including English radical Rose Dugdale stole 19 paintings from owner Alfred Lane Beit in 1974. The story of sizzling stage star Josephine Baker's mission to free France from Nazi occupation during World War II all started at her home, Château des Milandes in Périgord, France. Literary titan Charles Dickens conceals an illicit affair with 18-year-old actress Ellen Ternan, giving in to temptation on the grounds of Château d'Hardelot in Condette, France",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-03-20",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 3259277,
                    "name": "Making of an Artist; Secret Sonar; Fairy Flag",
                    "overview": "Wealthy widow Mary Eleanor Bowes falls prey to a scheme by fraudster Andrew Robinson Stoney who plotted marriage to steal her fortune at Glamis Castle in Glamis, Scotland. Lonely outcast-tuned-famous painter Henri de Toulouse-Lautrec changes the art world forever and it all began at his childhood home, Château du Bosc in Aveyron, France",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-03-27",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 3259279,
                    "name": "Battle to Cross the Channel; Royal Matchmaker; Boettcher Kidnapping",
                    "overview": "Château de Maillebois in Maillebois, France, was the launch pad for a contest between French aviators, Louis Blériot and Hubert Latham to be the first pilot to cross the English Channel. When his beloved Elizabeth Bowes-Lyon refuses his marriage proposals, the lovelorn Prince Albert has a secret cupid in Margaret Greville inside her estate, Polesden Lacey in Great Bookham, England. A kidnapping of a millionaire carried out by Verne Sankey, America's first public enemy #1 is connected to Boettcher Mansion in Golden, Colorado. When mathematician Émilie du Châtelet loses her fortune playing a high-stakes card game at Château de Fontainebleau in Fontainebleau, France, she creates a contract to pay it back.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 214199,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "615a7c32b1f68d009251f2dd",
            "air_date": "2016-01-08",
            "episodes": [
                {
                    "air_date": "2016-01-08",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3259280,
                    "name": "The Diamond Necklace Affair; Topless Duel; Abseiling Escape",
                    "overview": "Don learns of the Affair of the Diamond Necklace started by an 18th-century con artist named Jeanne de Valois-Saint-Rémy that involved Marie Antoinette and the greedy Cardinal Rohan in France's Château de Versailles. Discovers Kynžvart Castle in Czech Republic was the setting of a bare-chested duel between two hot-headed socialites—Princess Pauline Metternich vs. Countess Anastasia Kielmannsegg. Visits Königstein Fortress, where imprisoned French general, Henri Giraud once made a daring escape to freedom during World War II. Explores the secrets behind Harry Houdini's estate hidden in Hollywood Hills, California.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-15",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3259281,
                    "name": "Fall of the Knights Templar; Resurrecting Sherlock; Weeping Stones Curse",
                    "overview": "With evidence from the Chinon Parchment, Don examines the origins of Friday the 13th at Paris' La Conciergerie when King Philip IV of France falsely accused and arrested the Knights Templar, causing their downfall. Arthur Conan Doyle revives his iconic character Sherlock Holmes through actor William Gillette who resurrects the sleuth on the stage and dedicates his home Gillette Castle in East Haddam, Connecticut to the detective",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-22",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3259282,
                    "name": "Good King Wenceslas; Prison Painter; Butlers's Secret",
                    "overview": "Prague Castle in Prague, Czech Republic, was the setting of a bitter rivalry that came to a head when the peaceful king Wenceslaus I was slayed by his brother Boleslav the Cruel to overtake the throne. A prison during the French Revolution, Palais du Luxembourg in Paris, France was where artist Jacques-Louis David was imprisoned for his involvement in the Reign of Terror, leading to his masterpiece The Intervention of the Sabine Women, earning his freedom",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-01-29",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3259283,
                    "name": "The Brothers Grimm; Savior of Fort Jefferson; Missing Head of State",
                    "overview": "Philippsruhe Castle in Hanau, Germany, honors the work of Jacob and Wilhelm Grimm, who became the legendary storytellers, Brothers Grimm after revising crude folk tales into children-friendly fairy tales. When Fort Jefferson at Dry Tortugas National Park in Florida suffers a yellow fever epidemic, inmate Samuel Mudd, a doctor accused of playing a part in Abraham Lincoln’s assassination, redeems himself by saving 270 people from the disease. Château de Pau in Pau, France, the birthplace of King Henry IV, recalls the life of a benevolent monarch and the quest to find his missing mummified head.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-05",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3259284,
                    "name": "Betrayal of William Wallace; Casanova's Greatest Love; Astronomical Whodunnit",
                    "overview": "The legend of Scottish rebel William Wallace comes to an end when he is captured by English King Edward I at Chillingham Castle in Northumberland, England. Duchcov Chateau in Duchcov, Czech Republic is where the great seducer Giacomo Casanova spent his last days after losing his love for a married Frenchwoman. Kronborg Castle in Helsingør, Denmark once served as an observatory to astronomer Tycho Brahe who's sudden illness leading to his death was solved over 400 years later.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3259285,
                    "name": "Queen Victoria Assassination Attempt; Lucky Lindy; Affair of the Poisons",
                    "overview": "Kensington Palace in London, England, Queen Victoria's birthplace, is celebrated for the brave monarch's help in baiting her assailant to his arrest after an assassination attempt. The Knight family, who created their dream home Vikingsholm in Tahoma, California, sets a place in aviation history by funding Charles Lindbergh's 1927 non-stop solo flight across the Atlantic",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-19",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3259286,
                    "name": "Prince's Plight; Mad King Ludwig; Falling for Love",
                    "overview": "After escaping from Dunstaffnage Castle in Oban, Scotland, Bonnie Prince Charles Edward Stuart flees the country with help from his supporter Flora MacDonald who disguised him as an Irish maid. After being in debt by building fairy tale castles, the eccentric King Ludwig II is forced out of his beloved Neuschwanstein Castle in Schwangau, Germany when he is deemed mad by psychiatrist Dr. Bernhard von Gudden. Dunrobin Castle in Golspie, Scotland becomes haunted by the ghost of Lady Margaret, the Earl of Sutherland's daughter after she fell to her death from a tower in order to be with her true love, a stable boy",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-25",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3259287,
                    "name": "Pink Diamond Heist; Bloody Baron; Samlesbury Witches",
                    "overview": "In 1926, Château de Chantilly in Chantilly, France becomes the scene of a heist where robbers made off with its pink diamond called Le Grand Condé, but was recovered by a hungry chambermaid as she bit into the burglars' apple. Castello di Roccascalegna in Roccascalegna, Italy, once the home of cruel baron, Corvo de Corvis, now haunts the castle after suffering a violent death when he renewed the medieval law jus primae noctis; virgin brides must submit to him on their first night. Samlesbury Hall in Samlesbury, England stands as a grim reminder of the Samlesbury witches trial when a Catholic priest who lived there had a girl accuse three women of witchcraft after they switched to Protestantism.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-03",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3259288,
                    "name": "Deadliest Chess Game; Gustav III Assassination; Shot in the Heart",
                    "overview": "After marrying the Countess of Ross to get lands and a title, Alexander Stewart, \"The Wolf of Badenoch\" pillages his way across the country, that even the Devil takes notice of his evil, and challenges him to play a deadly game of chess (presented by Dr Leo Ruickbie).[25] Gustav III's Pavilion in Solna, Sweden becomes the final resting place of the beloved King Gustav III after nobleman Jacob Johan Anckarström is so angered by the monarch's progressive liberal reforms that he assassinates him at a masquerade ball. Mount Helena in Rolling Fork, Mississippi was once home to a young woman named Helen who lost her fiancé Henry in a duel a week before their wedding and buried him on the same day",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-10",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 3259290,
                    "name": "Savior of Flamenco; Murderous Mathelda; The Bickerstaff Hoax",
                    "overview": "After a stabbing that destroyed his career as a young man, elderly flamenco vocalist Diego Bermúdez Cala gets a second chance to sing on stage during a contest inside the Alhambra in Granada, Spain. Castello di Poppi in Poppi, Italy, is haunted by the murderous Matilda, Count Guidi's gorgeous wife, who after luring men to her bed chamber, sent them on their way through a deadly trap door. Moor Park in Farnham, England was home to author Jonathan Swift who's satire in his almanac under pseudonym Isaac Bickerstaff, predicted John Partridge's death after the astrologer caused a mass panic by faking a fever epidemic",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-17",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 3259291,
                    "name": "Aussie Adam & Eve; Corpse Queen; Voyage of the Clermont",
                    "overview": "After sentenced to death for thievery, doomed lovers, Henry Kable and Susannah Holmes are imprisoned at Norwich Castle in Norwich, England, but gets deported and transforms the penal colony of Australia. Quinta das Lágrimas in Coimbra, Portugal holds the legend of forbidden royal love between Prince Pedro and Inês de Castro, who after being slain on King Alonso IV's orders, her body was put on the throne by her beloved. Engineer Robert Fulton changed the way of long-distance travel when he built the first steamboat Clermont, named after his financier Robert Livingston's home Clermont Mansion in Germantown, New York.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-24",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 3259292,
                    "name": "Witchfinder General; Isabella and Ferdinand; Poisoned Rice",
                    "overview": "Colchester Castle in Colchester, England, was where witch hunter Matthew Hopkins imprisoned and tortured several falsely accused witches in its dungeon. Alcázar de los Reyes Cristianos in Córdoba, Spain stands as a reminder of teenage heirs Princess Isabella and Prince Ferdinand who pursued their dreams of uniting the five kingdoms into one nation. Nichols-Rice-Cherry House in Houston, Texas was once the home of the aging William Rice who was schemed by his butler and a conniving lawyer to fake the millionaire's will and take his fortune to fund a university in his name.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-31",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 3259293,
                    "name": "Jack The Giant Killer; Last Emperor of Mexico; Saving Britain's Art",
                    "overview": "A heart-shaped stone at St Michael's Mount in Cornwall, England, pays tribute to \"Jack the Giant Killer\", a young farmer's son who took on a gigantic 18-foot fearsome foe who terrorized towns and villages across the land. Chapultepec Castle in Mexico City, Mexico, becomes the home of Maximilian I when he is deceived by his ally, France's Napoleon III, who forcefully got the Mexican people to appoint the Austrian archduke as their emperor. Penrhyn Castle in Bangor, Wales became the hiding place of Britain's most prized art collection to avoid the Blitz during World War II when director of the National Gallery, Kenneth Clark and his assistant Martin Davies stored the paintings there.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 65015,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 214200,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    }
}