{
    "adult": false,
    "backdrop_path": "/jjuQPsQd8u3sMjTShEqf24IJuDT.jpg",
    "created_by": [],
    "episode_run_time": [
        65
    ],
    "first_air_date": "2016-03-15",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "",
    "id": 66156,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2020-09-22",
    "last_episode_to_air": {
        "id": 2748921,
        "name": "A Quarantine Courtship",
        "overview": "The Duggars get creative with celebrating Abbie's birthday while maintaining social distancing; Jinger and Jeremy share a happy surprise with the family over video chat; someone announces they have entered a courtship.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2020-09-22",
        "episode_number": 12,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 65,
        "season_number": 10,
        "show_id": 66156,
        "still_path": null
    },
    "name": "Counting On",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 84,
            "logo_path": "/6GRfZSrYh9D6C88n9kWlyrySB2l.png",
            "name": "TLC",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 90,
    "number_of_seasons": 10,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "Counting On",
    "overview": "Follow the next generation of Duggars as they celebrate some of life’s milestone moments, including the realities of growing up and raising their own families.",
    "popularity": 5.152,
    "poster_path": "/3xx6uMfvihfXTMFXJfMQl512vi0.jpg",
    "production_companies": [
        {
            "id": 73506,
            "logo_path": "/zadkCZxbrVcz4pLJtgBTRtk8u0k.png",
            "name": "Figure 8 Films",
            "origin_country": "US"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "US",
            "name": "United States of America"
        }
    ],
    "seasons": [
        {
            "air_date": "2015-02-13",
            "episode_count": 43,
            "id": 76499,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2016-03-14",
            "episode_count": 8,
            "id": 76081,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2016-08-22",
            "episode_count": 13,
            "id": 79487,
            "name": "Season 2",
            "overview": "There's big news for the Duggar family: Jinger is courting! Throughout the second season, Jinger and former professional soccer player Jeremy Vuolo experience all the exciting firsts of a new, budding courtship. The other older Duggar siblings are ready to leave the lows of the past year behind them and look forward to new and exciting highs. Jill and Derick are returning to Arkansas after a year of balancing mission work and raising their 1 1/2 year-old son in Central America. It is an exciting and busy time for Ben and Jessa with a new baby and possible plans for adoption, while Ben simultaneously organizes a football camp with ex-NFL players to mentor kids. Joy, Jedidiah and Jeremiah are also reaching a milestone with high school graduation rapidly approaching. And could John David, Joseph and Josiah be seeking future-Mrs. Duggars?",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2017-01-16",
            "episode_count": 7,
            "id": 84248,
            "name": "Season 3",
            "overview": "With less than three months until Jinger and Jeremy's wedding and more than 1,000 guests in attendance, the planning could not be done without Duggar-style teamwork. This exciting third season follows the journey from the altar to their honeymoon down under in a special two-hour wedding event. But as wedding bells begin to ring, the realization that Jinger is moving far away from home to start her new life with Jeremy leaves the family with bittersweet feelings.\n\nWhile all eyes are on the wedding, Jessa and Ben prepare to welcome the newest member of the Seewald family to the world.  As Jessa and Ben prepare for this next journey, Jill and Derick reveal a little surprise of their own. To top it all off, Joy has entered into a new courtship with long-time friend, Austin and enjoys the perks of an official relationship, including chaperoned dates and side hugs.",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2017-06-11",
            "episode_count": 8,
            "id": 89332,
            "name": "Season 4",
            "overview": "Jessa and Ben expand their young family with an adorable newborn and experience all the joys and challenges that come with raising two small children. Viewers will see Jill and Derick say goodbye to return to Central America, but not before they make a big announcement to baby Israel and the rest of the family. Jinger and Jeremy adjust to life as newlyweds in a new city far away from Jinger's hometown in Arkansas. And the excitement doesn't end with the older sisters... it's Joy's turn now! Viewers will see how Joy's boyfriend Austin Forsyth and the rest of the family get along and their road to the aisle. But Joy is not the only sibling to find new love as yet another Duggar announces a new courtship. As everyone is getting older and starting their own families, there is always something new with this ever-growing family!",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2017-09-10",
            "episode_count": 7,
            "id": 92225,
            "name": "Season 5",
            "overview": "",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2018-02-25",
            "episode_count": 6,
            "id": 93477,
            "name": "Season 6",
            "overview": "The season kicks off with newlyweds Joy and Austin flying off to their romantic honeymoon in Switzerland! The happy couple will experience exciting, new activities such as hang gliding, skiing, and making chocolate. Back in Arkansas, Joe and Kendra start making arrangements for their big day! Anticipation and jitters are felt all around as the preparations come together. Meanwhile in Laredo, Jinger and Jeremy move out of their apartment and into their first house! It's a family effort to get them all moved in and settled, as Jana and Jessa travel down to Texas to help them organize and decorate their new space. Then, once the honeymoon is over, Joy and Austin finally return home and settle into married life. Never a dull moment in Arkansas, however, as the couple has another big announcement to share with the whole family. With everyone growing up, there is always something new and exciting just around the corner!",
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2018-07-29",
            "episode_count": 12,
            "id": 106851,
            "name": "Season 7",
            "overview": "Fans saw the news break this past weekend when Josiah and Lauren tied the knot, and now they get to see how everything played out in the quick turn premiere! Immediately after witnessing the couple's recent nuptials, viewers will travel back in time to see their courtship beginnings, as well as take a trip to Greece for Joe and Kendra's honeymoon. The new episodes will also feature Joe and Kendra's pregnancy, from beginning to birth; Joy and Austin finishing up their house while preparing for the birth of their first son; and Jinger and Jeremy letting the family in on some big baby news of their own. Meanwhile, Jessa and Ben have plenty to celebrate with an anniversary and little Henry's very first birthday! Each couple has a lot going on, but in between these exciting moments they never forget the irreplaceable bond and support of their siblings!",
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        {
            "air_date": "2019-02-10",
            "episode_count": 7,
            "id": 107136,
            "name": "Season 8",
            "overview": "Jinger and Jeremy prepare to welcome their first child, a baby girl, but as the due date approaches, Jinger nervously recalls her sisters' long labors and big babies. Then, once back home in Laredo with their beautiful Felicity, Jinger and Jeremy must learn how to navigate being new parents.\n\nMeanwhile, John David and Abbie are beginning a new chapter of their lives. As the couple settles on a date for their nuptials in just a few short months, they enlist the seasoned help of Jana and family friend, Laura, who begin to coordinate the event for 1,000 guests.  Then, Josiah and Lauren are the epitome of newlyweds as they go chaperone-free during a romantic honeymoon in Austria, where they tour iconic sights from The Sound of Music.\n\nJessa and Ben, Joe and Kendra, Joy and Austin and all of the Duggars are busier than ever with new babies, new milestones and new plans for the future. It's anyone's guess who will make the next big announcement in this big family!",
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        },
        {
            "air_date": "2019-10-14",
            "episode_count": 10,
            "id": 118718,
            "name": "Season 9",
            "overview": "",
            "poster_path": null,
            "season_number": 9,
            "vote_average": 0
        },
        {
            "air_date": "2020-07-06",
            "episode_count": 12,
            "id": 134176,
            "name": "Season 10",
            "overview": "Jinger, Jeremy and Felicity have officially left Texas and are moving to their new home in Los Angeles. After a few additional stops along the way, they finally arrive and are thrilled to start this new chapter. Meanwhile, back at home, John David and Abbie get creative with their first-ever gender reveal!\n\nThroughout the season, the Duggar children continue to come into their own, with many family units continuing to grow, and there could even be a surprise courtship announcement: John David & Abbie and Josiah & Lauren welcome their first babies, while Joe & Kendra give birth to their second baby.\n\nJinger, Jeremy and daughter Felicity warm up to their new LA lifestyle by taking on new activities such as swimming lessons, high-end shopping and even skateboarding.",
            "poster_path": null,
            "season_number": 10,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Reality",
    "vote_average": 7.4,
    "vote_count": 9,
    "season_data": {
        "1": {
            "_id": "5703b49cc3a36822cc001255",
            "air_date": "2016-03-14",
            "episodes": [
                {
                    "air_date": "2016-03-15",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1185806,
                    "name": "At Home & Away",
                    "overview": "Jessa and Ben navigate life as a family of three with their new baby; Jill and Derick settle into their home in Central America; Jessa enlists her sisters to help prepare a fall feast for the whole family.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-22",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1185811,
                    "name": "Date Nights & Bright Lights",
                    "overview": "Jana and Jessa embark on a lighting project while the rest of the family travels to Central America; Jessa and Ben go on their first date since Spurgeon was born.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-29",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1185813,
                    "name": "Jinger Flips",
                    "overview": "Jessa goes out for coffee with Jana and Anna, leaving Ben in charge of Spurgeon; Jinger buys a car at auction; Jana starts a new project with her brothers; Jill and Derick introduce Israel to their love of pickles.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-05",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1184217,
                    "name": "Surprise!",
                    "overview": "The siblings continue building the tree house, which gets bigger and bigger; Joy and Sierra secretly plan a surprise baby shower; Jill and Derick have surprise guests in Central America.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 66156,
                    "still_path": "/bKsNzEvdmT4yg2u3K1ZPOoBlUZp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-12",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1185267,
                    "name": "Ben Drops Beats",
                    "overview": "Work on the tree house continues, but cold weather hampers the family's efforts. Meanwhile, Ben and Jessa go to St. Louis to meet with Christian rapper Flame, and inspiration sends Ben into the recording booth.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-19",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1185793,
                    "name": "Girls Hit the Road",
                    "overview": "The girls hit the road for a weekend getaway, but encounter an unexpected detour on the way to their destination. Meanwhile, the tree house is ready for a big unveiling after weeks of work.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-26",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1189014,
                    "name": "Family Reunion",
                    "overview": "Jessa, Ben and Spurgeon travel to Central America to visit Jill, Derick and Israel.  As they prepare for the trip, they travel down memory lane, revisiting Jessa's milestone moments, from engagement to motherhood, that have led to this emotional reunion.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-05-03",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1189185,
                    "name": "Israel Meets Spurgeon",
                    "overview": "Jessa and Ben experience what life is like in a foreign country with a young son; Jill and Derick remember their beginnings together in Nepal and the adventures that have led them to Central America.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 1,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 76081,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "57bcb0a3c3a3682eac00ba55",
            "air_date": "2016-08-22",
            "episodes": [
                {
                    "air_date": "2016-08-23",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1216825,
                    "name": "A Courtship Begins",
                    "overview": "In the Season 2 premiere, mission work continues for Jill and Derick in Central America; Jessa and Ben talk about their growing family; and Jinger shares big news about her future.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-08-30",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1217328,
                    "name": "It's Official!",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-09-06",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1220576,
                    "name": "Duggars in the Wild",
                    "overview": "Wilderness training continues for the Duggar siblings following a frightening encounter with a nocturnal visitor. Meanwhile, Jill and Derick celebrate their second anniversary; and Jessa and Ben are amazed by how fast Spurgeon is growing.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-09-13",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1222666,
                    "name": "Meet the Parents",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-09-20",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1224766,
                    "name": "A Big Surprise",
                    "overview": "Jeremy takes a secret trip to Arkansas, where he and Ben browse for engagement rings before surprising Jinger. Later, Jessa and Ben introduce rapper Flame to the Duggar clan.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-09-27",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1224767,
                    "name": "The Big Event",
                    "overview": "Ben hosts a football camp for kids with help from some former NFL players. Meanwhile, Jana sets out to redecorate the guesthouse for Jill and Derick when they come home from Central America; and Jinger and Jeremy plan a trip to New York City.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-04",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1230600,
                    "name": "Guys' Guide to Courting",
                    "overview": "Jinger and Jeremy go on a whirlwind trip to see his family and friends; a look back at past Duggar courtships, with tips from the guys for a successful relationship.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-11",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1230601,
                    "name": "Proposal in the City",
                    "overview": "Jinger, Michelle, Jessa, Ben and Spurgeon meet Jeremy's family and friends while visiting his old stomping grounds, culminating with an important question he wants to ask Jinger.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-18",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1232706,
                    "name": "Jessa's Announcement",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-25",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1234178,
                    "name": "The After Show",
                    "overview": "The family comes together to relive some of the most memorable moments from season two, and a surprise guest makes an appearance.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-01",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1237854,
                    "name": "Duggars at the Altar",
                    "overview": "A look back at the Duggar daughter marriages, when Jill and Jessa walked down the aisle just months apart.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-08",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1237852,
                    "name": "Courting Jinger",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-15",
                    "episode_number": 13,
                    "episode_type": "finale",
                    "id": 1684509,
                    "name": "Jinger's Wedding",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 2,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "There's big news for the Duggar family: Jinger is courting! Throughout the second season, Jinger and former professional soccer player Jeremy Vuolo experience all the exciting firsts of a new, budding courtship. The other older Duggar siblings are ready to leave the lows of the past year behind them and look forward to new and exciting highs. Jill and Derick are returning to Arkansas after a year of balancing mission work and raising their 1 1/2 year-old son in Central America. It is an exciting and busy time for Ben and Jessa with a new baby and possible plans for adoption, while Ben simultaneously organizes a football camp with ex-NFL players to mentor kids. Joy, Jedidiah and Jeremiah are also reaching a milestone with high school graduation rapidly approaching. And could John David, Joseph and Josiah be seeking future-Mrs. Duggars?",
            "id": 79487,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "588513df9251410460023cf7",
            "air_date": "2017-01-16",
            "episodes": [
                {
                    "air_date": "2017-01-16",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1259572,
                    "name": "The Jinger Gown",
                    "overview": "Jinger said yes to marrying Jeremy and now it's time to start planning for the big day, which is just 3 months away! The family takes a trip to DC to find Jinger's perfect dress. But with more options than imagined, will she find the dress of her dreams?",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-23",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1259573,
                    "name": "Could It be Twins?",
                    "overview": "Jessa and Ben listen to the heartbeat of Baby #2, which makes them wonder if it's twins. They travel to see friend Flame in concert, and Ben takes center stage. Jinger continues with wedding planning and finalizes important details.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-30",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1262417,
                    "name": "Bachelor Pad Makeover",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1265550,
                    "name": "The Bachelor Party",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-13",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1273719,
                    "name": "All About Jinger",
                    "overview": "Jinger packs for her move to Texas, which includes a surprise gift from her family, before she, Jeremy and Jed drive to her future home; the siblings take a trip down memory lane by remembering Jinger through the years.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-20",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1273720,
                    "name": "The Big Day",
                    "overview": "After months of planning, Jinger's wedding day has arrived and the final details, from dress fittings to surprise decorations, are put into place as family and friends come together to celebrate the new Mr. and Mrs. Vuolo.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-27",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 1278930,
                    "name": "A Honeymoon and a Courtship",
                    "overview": "Jinger and Jeremy have said \"I do,\" and now the newlyweds finally get to enjoy some alone time. Mr. and Mrs. Vuolo head down under for their honeymoon in Australia. Meanwhile, back in Arkansas, another Duggar enters a courtship.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "With less than three months until Jinger and Jeremy's wedding and more than 1,000 guests in attendance, the planning could not be done without Duggar-style teamwork. This exciting third season follows the journey from the altar to their honeymoon down under in a special two-hour wedding event. But as wedding bells begin to ring, the realization that Jinger is moving far away from home to start her new life with Jeremy leaves the family with bittersweet feelings.\n\nWhile all eyes are on the wedding, Jessa and Ben prepare to welcome the newest member of the Seewald family to the world.  As Jessa and Ben prepare for this next journey, Jill and Derick reveal a little surprise of their own. To top it all off, Joy has entered into a new courtship with long-time friend, Austin and enjoys the perks of an official relationship, including chaperoned dates and side hugs.",
            "id": 84248,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "593d9341c3a3680f67022bea",
            "air_date": "2017-06-11",
            "episodes": [
                {
                    "air_date": "2017-06-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1327462,
                    "name": "Joy's Wedding",
                    "overview": "Joy and Austin's wedding day is finally here; a first look at this exciting and emotional event, with Joy walking down the aisle to become Mrs. Austin Forsyth; another Duggar has a surprise that leaves guests shocked.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 4,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-06-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1328357,
                    "name": "Triple Date Night",
                    "overview": "Ben, Derick and Austin enjoy an afternoon at a trampoline park while Jessa, Jill and Joy shop for the perfect date night outfit. Jill and Derick share some big news with Israel. Meanwhile in Laredo, Jinger and Jeremy settle into married life.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 4,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-06-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1330342,
                    "name": "Spurgeon's First Birthday",
                    "overview": "Joy and Austin work together on a house flipping project; the family celebrates Spurgeon's first birthday; in Laredo, things heat up in the kitchen with Jinger and Jeremy",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 4,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-06-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1332395,
                    "name": "A New Baby",
                    "overview": "As Jessa's due date inches closer, family and friends help the Seewalds prepare for the new baby. Joy and Austin continue working on their house flipping project, and Austin asks Jim Bob an important question. Later, Jessa and Ben welcome their 2nd child.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 4,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-07-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1334136,
                    "name": "A Boy or Girl for Jill?",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 4,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-07-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1336960,
                    "name": "Joy Gets Engaged",
                    "overview": "Jinger makes a care package for the family back in Arkansas. Meanwhile, the Dillards prepare to return to Central America; Austin has an important question for Joy; and Joe asks for permission to enter a courtship with Kendra.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 4,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-07-17",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1337869,
                    "name": "The After Show, Part 1",
                    "overview": "Host Daphne Oz digs a little deeper into some of the season's biggest moments, from courtships and weddings to babies.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 4,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-07-24",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1341053,
                    "name": "The After Show Part 2",
                    "overview": "Host Daphne Oz gets the Duggars’ reactions to some of the biggest moments of the season; the couples square off in a fun game of “The Couples Showdown”; a special guest or two show up.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 4,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "Jessa and Ben expand their young family with an adorable newborn and experience all the joys and challenges that come with raising two small children. Viewers will see Jill and Derick say goodbye to return to Central America, but not before they make a big announcement to baby Israel and the rest of the family. Jinger and Jeremy adjust to life as newlyweds in a new city far away from Jinger's hometown in Arkansas. And the excitement doesn't end with the older sisters... it's Joy's turn now! Viewers will see how Joy's boyfriend Austin Forsyth and the rest of the family get along and their road to the aisle. But Joy is not the only sibling to find new love as yet another Duggar announces a new courtship. As everyone is getting older and starting their own families, there is always something new with this ever-growing family!",
            "id": 89332,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "59aa1dfc92514107af004a92",
            "air_date": "2017-09-10",
            "episodes": [
                {
                    "air_date": "2017-09-11",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1359419,
                    "name": "A New Courtship",
                    "overview": "The Seewalds and the Vuolos meet up in San Antonio and take a stroll down memory lane; Joy begins her wedding planning with a walkthrough of the venue; the Dillards get settled in Central America; Joe asks Kendra an important question.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 5,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-18",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1367855,
                    "name": "Let Them Eat Cake",
                    "overview": "Wedding planning continues as Joy shops for bridesmaids dresses and tastes cakes with Austin; Joe and Kendra enjoy a rollerblading date; the Vuolos take a cooking class together; renovations begin on Joy and Austin's house.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 5,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-25",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1367856,
                    "name": "Finding Joy's Dress",
                    "overview": "Joy travels to Kentucky to find her perfect wedding dress, but with so many options, the overwhelmed bride has to make some big decisions; Austin and Joe enjoy some bonding time with their future father-in-laws; Israel celebrates his second birthday.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 5,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-02",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1375151,
                    "name": "Joy and Austin's Camping Trip",
                    "overview": "Joy and Kendra visit a salon to get some hairstyle ideas for Joy's wedding; Joy and Austin celebrate their bachelor and bachelorette weekend with a fun camping trip; Jinger and Jeremy do some shopping for Joy and Austin's rehearsal dinner.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 5,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-09",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1378658,
                    "name": "Tomboy Joy",
                    "overview": "Joy and Austin's wedding day is coming up fast, so her siblings prepare some special gifts for the happy couple while taking a trip down memory lane remembering Joy through the years.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 5,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-16",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1380973,
                    "name": "Joy and Austin Tie the Knot",
                    "overview": "Joy's wedding day arrives after months of planning, and the final touches are added as family and friends come together to celebrate the new Mr. and Mrs. Forsyth.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 5,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-10-23",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 1382914,
                    "name": "Joseph's Wedding",
                    "overview": "The day has finally arrived for Joe and Kendra to get married, and Kendra walks down the aisle to become Mrs. Joseph Duggar; a few surprises may be in store for the happy couple.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 5,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "",
            "id": 92225,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "59d056dbc3a368790400f12d",
            "air_date": "2018-02-25",
            "episodes": [
                {
                    "air_date": "2018-02-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1443243,
                    "name": "In Love in Switzerland",
                    "overview": "Joy and Austin have said I do, and now Mr. and Mrs. Forsyth finally get to enjoy some alone time in Switzerland. .",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 6,
                    "show_id": 66156,
                    "still_path": "/aLdxl7DaHfDRIDUzrEtYFunNU4p.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2748875,
                    "name": "The Vuolos Buy a House",
                    "overview": "The siblings help Jinger and Jeremy move into their new house.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 6,
                    "show_id": 66156,
                    "still_path": "/meY6jxMMKP5TMP3TzuEsFUfZqGT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-26",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1443246,
                    "name": "Spurgeon's First Haircut",
                    "overview": "Jeremy and Jinger continue to put their stamp on their new home; Joe and Kendra pick out the groomsmen's outfits; Jessa and Ben finally give Spurgeon a haircut; and Joy and Austin try to make the most of their less-than-ideal living situation.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 6,
                    "show_id": 66156,
                    "still_path": "/bUSmEXVVXVy4nloDPGY2iLGfP8q.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-12",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1373609,
                    "name": "Kendra's Birthday Surprise",
                    "overview": "",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 6,
                    "show_id": 66156,
                    "still_path": "/iDSuKbX0yA16UUz5SPBjEMOGlEK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-19",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1460675,
                    "name": "A New Bundle of Joy",
                    "overview": "Joy and Austin have big news to share with the family.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 6,
                    "show_id": 66156,
                    "still_path": "/tGECnp7JiyN8AdobAawfNNiR5MS.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-26",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 1460676,
                    "name": "Joe and Kendra Say I Do",
                    "overview": "The time has finally come for Joe and Kendra to say I do; there are emotional moments with family and friends as they prepare for their wedding day; when the ceremony begins, a few surprises and mishaps make sure it's a day they won't forget.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 6,
                    "show_id": 66156,
                    "still_path": "/z79uTsz2QgEIAxDhVeCrUxx6kI1.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 6",
            "overview": "The season kicks off with newlyweds Joy and Austin flying off to their romantic honeymoon in Switzerland! The happy couple will experience exciting, new activities such as hang gliding, skiing, and making chocolate. Back in Arkansas, Joe and Kendra start making arrangements for their big day! Anticipation and jitters are felt all around as the preparations come together. Meanwhile in Laredo, Jinger and Jeremy move out of their apartment and into their first house! It's a family effort to get them all moved in and settled, as Jana and Jessa travel down to Texas to help them organize and decorate their new space. Then, once the honeymoon is over, Joy and Austin finally return home and settle into married life. Never a dull moment in Arkansas, however, as the couple has another big announcement to share with the whole family. With everyone growing up, there is always something new and exciting just around the corner!",
            "id": 93477,
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "_id": "5b57619e0e0a2673ca03ac19",
            "air_date": "2018-07-29",
            "episodes": [
                {
                    "air_date": "2018-07-30",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1534473,
                    "name": "It's All Greek to Me!",
                    "overview": "In this first look at Josiah and Lauren's wedding, the bride and groom say their \"I do's\" and have their first kiss. Meanwhile, Joe and Kendra go on their honeymoon in Greece.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-06",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1548020,
                    "name": "Make Room for Baby",
                    "overview": "Joy and Austin check in on Baby Forsyth at their midwife appointment. In Laredo, Jinger and Jeremy go window shopping for a new piano. Joe and Kendra move into their new home and have a special reveal for the family.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-06",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1548022,
                    "name": "Unexpected",
                    "overview": "Newly-expectant parents Joe & Kendra check up on their baby. The little girls record an album in Nashville. Josiah takes Lauren's siblings out for ice cream. While visiting Jeremy's parents at a charity gala, he & Jinger reveal some unexpected news.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-13",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1548024,
                    "name": "Jinger and Jeremy's Secret",
                    "overview": "Jinger and Jeremy are ready for their first baby’s arrival, and she heads to the hospital, but when progress is slow, there’s worry she might have to have a C-section.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-20",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1684520,
                    "name": "An Explosive Reveal",
                    "overview": "Jinger and Jeremy celebrate their first anniversary, and Jeremy has a very special surprise for her. Josiah is ready to take the next step and hopes for Lauren’s dad’s blessing. Later, Joe and Kendra reveal the gender of their baby in a very explosive way.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-27",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1684521,
                    "name": "Josiah Pops the Question",
                    "overview": "Josiah travels to Georgia to propose to Lauren; Jinger and Jeremy’s friends come for a visit, and the expecting couple has a trial run at parenthood.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-09-03",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1684522,
                    "name": "A Birth-Day and a Birthday",
                    "overview": "The three pregnant sisters are reunited for a big family birthday. Later, Joy goes into labor, and after 20 hours, she is transported to the hospital for an emergency C-section.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-09-10",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1684523,
                    "name": "Thrift Store Date Night",
                    "overview": "Three couples go on a thrift store date night and choose outfits for their partners to wear, but with a small budget and a big sense of humor, someone may end up with a fashion faux pas. Then, new mom Joy and pregnant Kendra have a joint Sip & See party.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-09-17",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1684524,
                    "name": "Lauren Finds Her Dress",
                    "overview": "The Duggars celebrate Jana and John David’s 28th birthday with a family ski trip. Meanwhile, Jinger and Jeremy tour a birth center and find out the gender of their baby; and Lauren goes shopping for the perfect wedding gown.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-09-24",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1684525,
                    "name": "Jinger's Double Surprise",
                    "overview": "Jinger and Jeremy throw a gender reveal party for the family and the family has a surprise of their own for Jinger; Josiah and Lauren celebrate their upcoming wedding with a game of giant foosball; and Joe and Kendra welcome their baby boy.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-09-24",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1684526,
                    "name": "Kendra Has a Baby",
                    "overview": "Jessa, Joe, Joy and their spouses throw a “Dinner Around the World” potluck and cook dishes from their honeymoon destinations. Josiah & Lauren celebrate their upcoming wedding with a game of giant foosball. Later, Joe & Kendra welcome their baby boy!",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-01",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 2748882,
                    "name": "Josiah & Lauren's Wedding",
                    "overview": "It’s Josiah and Lauren’s wedding day, and the happy couple is eager to walk down the aisle and finally share their first kiss. But with Josiah being the family prankster and the brothers out for revenge, the couple are in for some shenanigans.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 7,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 7",
            "overview": "Fans saw the news break this past weekend when Josiah and Lauren tied the knot, and now they get to see how everything played out in the quick turn premiere! Immediately after witnessing the couple's recent nuptials, viewers will travel back in time to see their courtship beginnings, as well as take a trip to Greece for Joe and Kendra's honeymoon. The new episodes will also feature Joe and Kendra's pregnancy, from beginning to birth; Joy and Austin finishing up their house while preparing for the birth of their first son; and Jinger and Jeremy letting the family in on some big baby news of their own. Meanwhile, Jessa and Ben have plenty to celebrate with an anniversary and little Henry's very first birthday! Each couple has a lot going on, but in between these exciting moments they never forget the irreplaceable bond and support of their siblings!",
            "id": 106851,
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        "8": {
            "_id": "5b61c0ab925141406401535a",
            "air_date": "2019-02-10",
            "episodes": [
                {
                    "air_date": "2019-02-11",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2748889,
                    "name": "Love Is in the Air",
                    "overview": "With the due date near, Jinger and Jeremy get ready to meet baby Vuolo; John whisks Abbie away on a surprise trip to ask for her hand in marriage; Jinger's labor takes an unexpected turn.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 8,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-18",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2748890,
                    "name": "Jinger Has a Baby",
                    "overview": "The hills are alive for Josiah and Lauren as they go on their Austrian honeymoon; while there, they re-enact scenes from \"The Sound of Music\" and visit with a local family; Jinger worries she won't have the smooth labor she was hoping for.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 8,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-25",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2748891,
                    "name": "Sleepless in Laredo",
                    "overview": "Jinger and Jeremy get a dose of reality as they adjust to life as new parents; Ben tutors the Duggar kids and they must use their math skills to cook a meal for 40 people; later at dinner, one couple makes a special announcement.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 8,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-04",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2748892,
                    "name": "Love and Loss",
                    "overview": "Jessa, Lauren, Kendra and Jana pair off with some of the little kids and go head to head to create a groom's cake for John and Abbie's wedding; Josiah and Lauren's worlds are shaken up when they reveal some tragic news.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 8,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-11",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2748893,
                    "name": "The Abbie Gown",
                    "overview": "In Laredo, Jeremy is on daddy duty as Jinger runs errands. Meanwhile, John & Abbie's wedding is just around the corner! John and the boys partake in a thrilling competition while Abbie tries on wedding dresses. Will Abbie be able to find \"the one?\"",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 8,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-18",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2748894,
                    "name": "To Grandmother's House We Go",
                    "overview": "John David and Abbie fly to the Philippines for a mission trip weeks before their wedding; Jinger and Jeremy travel up north so Felicity can meet her great-grandparents; while there, they get a surprise from some very unexpected guests.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 8,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-25",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 2748895,
                    "name": "A Bachelor No More",
                    "overview": "John and Abbie's wedding is finally here and everyone is in full wedding-mode as they get ready for the big day; at the altar, the bride and groom share their first kiss in an unexpected way; a family member has a very special announcement.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 8,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 8",
            "overview": "Jinger and Jeremy prepare to welcome their first child, a baby girl, but as the due date approaches, Jinger nervously recalls her sisters' long labors and big babies. Then, once back home in Laredo with their beautiful Felicity, Jinger and Jeremy must learn how to navigate being new parents.\n\nMeanwhile, John David and Abbie are beginning a new chapter of their lives. As the couple settles on a date for their nuptials in just a few short months, they enlist the seasoned help of Jana and family friend, Laura, who begin to coordinate the event for 1,000 guests.  Then, Josiah and Lauren are the epitome of newlyweds as they go chaperone-free during a romantic honeymoon in Austria, where they tour iconic sights from The Sound of Music.\n\nJessa and Ben, Joe and Kendra, Joy and Austin and all of the Duggars are busier than ever with new babies, new milestones and new plans for the future. It's anyone's guess who will make the next big announcement in this big family!",
            "id": 107136,
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        },
        "9": {
            "_id": "5c61cc7e0e0a266dac9634dd",
            "air_date": "2019-10-14",
            "episodes": [
                {
                    "air_date": "2019-10-15",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2748896,
                    "name": "Who's the Most Romantic?",
                    "overview": "The couples compete to see who can come up with the most-romantic date.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-10-22",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2748897,
                    "name": "The Vuolos Take LA",
                    "overview": "Jinger and Jeremy explore LA, and the Duggar boys go on a road trip.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-10-29",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2748898,
                    "name": "Count Your Blessings",
                    "overview": "Jinger visits Grandma Duggar. Lauren opens up about grief and depression.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-05",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2748899,
                    "name": "Kendra's Got a Secret",
                    "overview": "Kendra surprises Joe when she finds out she's expecting baby number 2!",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-12",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2748900,
                    "name": "The Great Duggar Campout",
                    "overview": "Jinger and Jeremy go house hunting in LA but with pricier real estate and small square footage, will they be able to find the perfect place? Meanwhile in Arkansas, the family is going camping. Later at dinner, one couple makes a special announcement.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-19",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2748901,
                    "name": "Baby Number Two, But Who?",
                    "overview": "Joe & Kendra visit Jinger & Jeremy in Texas, where they sample creepy, crawly appetizers. Jessa seeks help from a speech therapist as Henry struggles to learn new words. Joy & Austin surprise the family by announcing that they are expecting baby #2!",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-26",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2748902,
                    "name": "Marriage Bootcamp",
                    "overview": "Ginger & Jeremy decide to hold a yard sale before their big move to LA. They must put their haggling skills to work and try to sell as much as they can. Meanwhile, the married couples attend a marriage retreat where they focus on their relationships.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-03",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2748903,
                    "name": "Five Pregnancies and Counting",
                    "overview": "Five Duggars are pregnant! The ladies attend a garden party to celebrate. Ben & Jessa take a trip down memory lane five years after their engagement. Josiah & Lauren are concerned when their gender reveal balloon floats away. Jessa goes into labor.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-10",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2748904,
                    "name": "A Surprise Delivery",
                    "overview": "Jessa goes into labor two weeks before her due date and after the birth, they are faced with an emergency situation. Joe and Kendra find out the gender of their second baby with a smashing reveal. Then, another Duggar reveals she's expecting.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-17",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 2748905,
                    "name": "Grandma Duggar Remembered",
                    "overview": "The four pregnant Duggar girls and Jessa have a maternity photoshoot and a surprise guest reveals she's also expecting. Jinger and Jeremy prepare for their big move to LA but tragedy strikes when they get devastating news from back home.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 9,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 9",
            "overview": "",
            "id": 118718,
            "poster_path": null,
            "season_number": 9,
            "vote_average": 0
        },
        "10": {
            "_id": "5da62a9447721500135e1692",
            "air_date": "2020-07-06",
            "episodes": [
                {
                    "air_date": "2020-07-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2748906,
                    "name": "La La Land",
                    "overview": "Jinger and Jeremy are getting ready to start their new lives in LA.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-07-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2748907,
                    "name": "Beverly Hills Duggars",
                    "overview": "Jana and Jinger have sticker shock while shopping in Beverly Hills.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-07-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2748908,
                    "name": "A Duggar Bachelor Pad",
                    "overview": "Jessa and Ben go on their first road trip with three kids; some of the Duggars go to the Bahamas to help after a hurricane; Jed and Jere show off their bachelor pad; the family competes in a corn maze race.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-07-28",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2748909,
                    "name": "The Duggar Dash",
                    "overview": "It's hard to decide which Duggar is the most competitive, so they decide to put it to a test; the family splits into four teams and Michelle sends them on an exciting race around town.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-04",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2748910,
                    "name": "A Baby Girl for Joe and Kendra",
                    "overview": "Jeremy takes a skateboarding lesson with ex-pro skateboarder Brian Sumner. Will he learn to shred or play it safe? Later, Kendra goes into labour. As contractions intensify quickly, her birth team worries that her doctor might not arrive in time.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-11",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2748911,
                    "name": "A Beautiful Miracle",
                    "overview": "Lauren goes into labor 11 days before her due date; she and Josiah can’t wait to meet their baby; Jinger and Jeremy join Family Fun Night in Arkansas via video chat, where they share a special surprise.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-18",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2748913,
                    "name": "Highs and Lows",
                    "overview": "Jinger and Jeremy share the sad news that they have miscarried their baby; in Arkansas, Ben has second thoughts as he undergoes eye surgery; Jeremy throws Jinger a surprise party filled with some unexpected guests and a special gift.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-08-25",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2748915,
                    "name": "Best Duggar Christmas Pageant",
                    "overview": "Jana and Jessa organize a Christmas pageant, and the whole family pitches in to pull it off, including Jim Bob, who has a very special role; Jinger and Jeremy cut down their first live Christmas tree together.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-01",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2748917,
                    "name": "Meet Gracie Duggar",
                    "overview": "John David goes from bachelor till the rapture to dad; he prepares for the arrival of his first child by making a video for Abbie; Abbie goes into labor, but it’s deemed a false alarm; after laboring overnight, she and John meet their daughter.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-08",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2748918,
                    "name": "From Snow to Sand",
                    "overview": "Jinger and Jeremy take advantage of all California has to offer when they take friends on a snow to sand adventure. Back in Arkansas, the guys throw John a Dad-chelor party to welcome him to fatherhood. Then, Joy and Austin share exciting news.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-15",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2748920,
                    "name": "Jana's Secret Garden",
                    "overview": "Jana does so much for the family that they want to surprise her with something she's wanted for a long time; John, Abbie and baby Gracie keep Jana distracted in Tennessee while the rest of the family hustles to pull off this big surprise.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-09-22",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 2748921,
                    "name": "A Quarantine Courtship",
                    "overview": "The Duggars get creative with celebrating Abbie's birthday while maintaining social distancing; Jinger and Jeremy share a happy surprise with the family over video chat; someone announces they have entered a courtship.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 10,
                    "show_id": 66156,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 10",
            "overview": "Jinger, Jeremy and Felicity have officially left Texas and are moving to their new home in Los Angeles. After a few additional stops along the way, they finally arrive and are thrilled to start this new chapter. Meanwhile, back at home, John David and Abbie get creative with their first-ever gender reveal!\n\nThroughout the season, the Duggar children continue to come into their own, with many family units continuing to grow, and there could even be a surprise courtship announcement: John David & Abbie and Josiah & Lauren welcome their first babies, while Joe & Kendra give birth to their second baby.\n\nJinger, Jeremy and daughter Felicity warm up to their new LA lifestyle by taking on new activities such as swimming lessons, high-end shopping and even skateboarding.",
            "id": 134176,
            "poster_path": null,
            "season_number": 10,
            "vote_average": 0
        }
    }
}