{"adult":false,"backdrop_path":"/eKu4zq639EeSVGu5xWPPHKzju66.jpg","created_by":[{"id":1473938,"credit_id":"64109171c390c500f6ffe026","name":"Yuyuko Takemiya","gender":1,"profile_path":null}],"episode_run_time":[24],"first_air_date":"2013-10-03","genres":[{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"},{"id":18,"name":"Drama"}],"homepage":"http://golden-time.jp","id":67389,"in_production":false,"languages":["ja"],"last_air_date":"2014-03-27","last_episode_to_air":{"id":1213386,"name":"Golden Time","overview":"Upon losing his recent memories, Banri returns to his hometown. After fiddling with the notes he made for himself prior to the return of his former memories, Banri opens his e-mail account and discovers that someone has been sending e-mails to Kōko under his name. Linda and Banri seem to have returned to their easy friendship, with Linda spending Christmas with the Tada family. He contemplates Linda's reply to his feelings and the happenings that occurred between them since his accident. Kōko arrives at Banri's home. Banri first mistakes her for Chinami. Kōko hands Banri a DVD and his cracked mirror case, which Banri sees as Kōko's belonging and returns it to her. After asking for directions for the bridge where Banri fell, Kōko leaves and Banri finally remembers Kōko after finding her mirror case alongside his notes. As a result, Banri goes after Kōko to the bridge where he meets his conflicted former self. The latter then cross the bridge after Linda appears and gives her reply to his feelings with a \"Yes\" and hands Banri the ring he had dropped at the bridge days before. Afterwards, Banri embraces Kōko and the two recall their promise: that as long as they remember one another, the two will stay together for the rest of their lives. They profess their love for one another and Banri presents his ring to Kōko, which she gladly accepts. Meanwhile, it's revealed that Nijigen was responsible for sending spam e-mails as Banri and motivated Kōko to go after him. Taking advantage of Kōko's motivation, Chinami edited the recording Banri made of himself and burned it to a DVD, which she asked Kōko to deliver to Banri. While watching his recording, Banri thanks Kōko for being by his side. Banri later returns to Tokyo and attends university with his friends. His relationship with Kōko is still intact. Mitsuo and Linda are shown flirting while Kōko and Banri kiss with Kōko wearing the ring Banri gave her.\n\n(Source: Wikipedia)","vote_average":0,"vote_count":0,"air_date":"2014-03-27","episode_number":24,"episode_type":"finale","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/7sFLwueuBZf713YCdmcRcZ62C7L.jpg"},"name":"Golden Time","next_episode_to_air":null,"networks":[{"id":94,"logo_path":"/7RNXnyiMbjgqtPAjja13wchcrGI.png","name":"MBS","origin_country":"JP"}],"number_of_episodes":24,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"ゴールデンタイム","overview":"Banri Tada is a freshman at a Tokyo law school. After an accident, he suffers severe memory loss. Despite the incident, he befriends fellow freshman, Mitsuo Yanagisawa, which leads him to the beautiful, yet obsessive, Kouko Kaga.","popularity":27.848,"poster_path":"/heCpefPuxekDMofvR6juY2cCew6.jpg","production_companies":[{"id":11884,"logo_path":"/tHzHPSKdmLT5zCdqFbcmHzZvRIc.png","name":"J.C.STAFF","origin_country":"JP"},{"id":14899,"logo_path":null,"name":"Starchild Records","origin_country":"JP"},{"id":5751,"logo_path":"/ex1dPOOB27kWLhhhh9gsngxBRLI.png","name":"GENCO","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"2013-10-03","episode_count":24,"id":79178,"name":"Golden Time","overview":"Banri Tada is a newly admitted student at a private law school in Tokyo. However, due to an accident, he lost all of his memories. During his freshman orientation, he encounters another freshman from the same school, Mitsuo Yanagisawa, and they hit it off at once. Without any memory of each other, their lives become more and more intertwined as if set by the hands of fate. But what is their fate, and will it lead to happiness or another memory to forget…\n\n(Source: Crunchyroll)","poster_path":"/vm0jpIstSc9cQcD2BxBvtPKaHrS.jpg","season_number":1,"vote_average":6}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.604,"vote_count":512,"season_data":{"1":{"_id":"57aaf77ec3a368082f00053b","air_date":"2013-10-03","episodes":[{"air_date":"2013-10-03","episode_number":1,"episode_type":"standard","id":1213362,"name":"Spring Time","overview":"Banri Tada, a freshman law student at a Tokyo university ended up arriving late for his entrance ceremony. Not knowing how to get to the university, he discreetly followed two other students, and meets Mitsuo Yanagisawa, another freshman, who quickly befriended him. As they made their way to their orientation, they were greeted by a beautiful young woman, who presented Mitsuo with a bouquet of roses and then proceeded to smack him with them before leaving. Mitsuo later explained that the woman was Kouko Kaga, his childhood friend, and arranged fiancé, whom he had run away from as he does not reciprocate her feelings. After orientation, Banri and Mitsuo learn that Kouko was also a student at their university, much to Mitsuo's horror. She became acquainted with Banri during a shared class, and he soon became smitten. After class, Banri met and befriended freshman Chinami Oka and Linda, a second year student and member of the Japanese Festival Culture Research Club. On his way home, he once again runs into Kouko, who used his phone to locate Mitsuo, but upon returning it, he noticed the phone number for a hospital, causing him to remember a time when he was on a bridge and was seemingly run over by a motorbike.  (Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/xWnUHvv5sCZtrP9TAyZ8blOedYq.jpg","vote_average":6,"vote_count":1,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a2933a5330040d38f85","adult":false,"gender":2,"id":1851212,"known_for_department":"Directing","name":"Sega Kajii","original_name":"Sega Kajii","popularity":1.029,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"629492be09ed8f125551dfe9","adult":false,"gender":0,"id":1851215,"known_for_department":"Directing","name":"Riki Fukushima","original_name":"Riki Fukushima","popularity":1.186,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"637d29cba5743d009c1d4ea9","adult":false,"gender":0,"id":3201040,"known_for_department":"Visual Effects","name":"Mika Inoue","original_name":"Mika Inoue","popularity":0.917,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-10-10","episode_number":2,"episode_type":"standard","id":1213363,"name":"Lonely Girl","overview":"Banri has a dream of himself, apparently injured, fleeing from a hospital, but upon awakening cannot remember any more than that. Arriving at the university gate, he meets Kouko, who is waiting for Mitsuo, and the two talk some more. He notices that Kouko seems lonely without Mitsuo. Later that night, he tells Mitsuo about Kouko, but Mitsuo brushes it off, saying Kouko is just acting to get Banri to bring her to him. To brighten the mood, Mitsuo invites Banri to the Film Club's welcoming party, where club member Chinami got Mitsuo to join. The party was soon crashed however by the Tea Club's party, who drag Banri off to join in their festivities. He meets a new friend Takaya Satō, nicknamed Nijigen. The next day, Banri notices that Kouko has still not made any friends, and encourages her to join a club. Another student overhears them and invites the two to a café to tell them about her club, which lasts until dark. She invites them on her club's overnight trip to see if they would be willing to join. Still wanting to help Kouko, Banri decides to accompany Kouko when she agrees to go.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/tAcsYKKLNwWfkVvtev7EYVVC0Bz.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"615b18b6dcb6a3008bce4ca9","adult":true,"gender":2,"id":1778077,"known_for_department":"Directing","name":"Masato Kitagawa","original_name":"Masato Kitagawa","popularity":0.6,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-10-17","episode_number":3,"episode_type":"standard","id":1213364,"name":"Night Escape","overview":"On the day of the scheduled club trip, Banri meets with Kōko and Nijigen, who is also invited. When the club members arrives to pick up the attendants, Banri becomes suspicious of them when he notices they all wear a similar pendant, and more so when they bring the group to a remote location. The club then reveals itself as a cult who wishes for Banri's group to join them. Banri convinces them to let the others go, when he tells them that he suffered an accident after high school that gave him amnesia of everything from before starting college, and that they could help him. As the others leave, Kōko decides to stay with Banri, and the two ultimately escape and hide in the woods. As they hide, Banri and Kōko bond by getting to know more about one another. Kōko reveals she was actually a nice person, and only acts stuck up around Mitsuo due to her feelings for him, while also confessing that she really was just using her friendship with Banri to get closer to Mitsuo. Banri in turn reveals that his story about having amnesia was not a lie, and that he feels that his family and friends want the current him to disappear and have the old him return. While he sympathizes with their wishes, he does not want to lose his current self. When the pair hear the cult members looking for them, they flee further into the woods, until they are found by Linda.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/6GaZm8yk2kWIMSZrE9a9ojU207a.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a848d22fc0058c2191e","adult":false,"gender":2,"id":2050220,"known_for_department":"Directing","name":"Yoshikata Nitta","original_name":"Yoshikata Nitta","popularity":0.6,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-10-24","episode_number":4,"episode_type":"standard","id":1213365,"name":"Blackout","overview":"After Linda finds them, she explains that she was out on a club retreat with the Festival Club, and brings Banri and Kōko to their campsite. After returning, Banri is greeted by Nijigen, Mitsuo, and Chinami, who are all relieved to know they are alright. Later during a break, Banri, Mitsuo, and Chinami get together to talk, but they are interrupted by Kōko, who begins to berate and belittle Chinami, causing Mitsuo to leave with Chinami and leaving Banri to comfort a remorseful Kōko. After class, the pair once again encounters Linda, who invites them to participate in one of the Festival Club's dance rehearsals. Banri decides to join, while Kōko considers the idea. Later that night, Mitsuo tells Banri he will settle things with Kōko, because he wants to pursue a relationship with Chinami, and the next day Mitsuo flatly rebuffs Kōko's affection in front of Banri. Kōko asks Mitsuo if their time together meant nothing to him, and Mitsuo replies that while he treasures their time together, he only sees her as a childhood friend. Kōko angrily yells at him to forget their history, driving Mitsuo away. Kōko yells at him to disappear, but realizes her words are hurtful to Banri, causing her to continuously apologize in tears. After a few hours, Kōko and Banri are invited by a girl called Nana (most likely a reference to Nana Osaki from the manga and anime NANA) to her concert. Kōko goes to vent her frustration, but is thrown out, and spends the night at Banri's apartment. Kōko reveals she needs him, while Banri confesses his love for her. After she leaves, she texts Banri, encouraging him to not forget about his lost memories, which motivates him to return to his home in Shizuoka, where he finds a scrapbook containing pictures of himself and Linda in high school together.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/h0tS0TcyMUrdLqqqs1Sstymf6nO.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"608799b2f9475b003f2decc4","adult":false,"gender":2,"id":1609344,"known_for_department":"Directing","name":"Makoto Sokuza","original_name":"Makoto Sokuza","popularity":3.606,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"640ab07e9dee58008568c026","adult":false,"gender":2,"id":3161714,"known_for_department":"Visual Effects","name":"Yuji Takagi","original_name":"Yuji Takagi","popularity":1.146,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-10-31","episode_number":5,"episode_type":"standard","id":1213366,"name":"Body and Soul","overview":"After finding the photo of him and Linda, Banri runs to the bridge where the accident that caused his amnesia occurred to remember more, but cannot. The spirit of the eighteen-year-old Banri Tada watches him, and explains that the fall caused his eighteen-year-old spirit, and all his memories, to leave his body, and that he cannot be seen or heard by the current Banri. After returning to school, Banri meets Kōko, who gives him a mirror that matches hers to commemorate their friendship. The next day, Banri and Mitsuo run into Kōko, who begins to act overly cheerful and dramatic about her friendship with Banri. Linda, who is helping Kōko register for classes, soon joins them and meets Mitsuo, while later inquiring about Kōko and Banri's joining the Festival Club. Kōko answers that both of them will join, while Banri wonders why Linda has not mentioned that she knows him from before. At their first dance rehearsal, Kōko demonstrates she cannot dance, which causes her to be depressed and cry. After calming down, she apologizes to Banri for her behavior, and confesses that she is still recovering from being dumped by Mitsuo, but he reassures her it is fine, and reaffirms their friendship by using the mirror she gave him. That night, Banri recalls the memory from when he escaped the hospital; he had seen a flashing light from his window, and when he snuck out to see what it was, he discovered it was Linda. As the two talk, she reveals that she was the one who inspired Banri to come to Tokyo. Banri wonders why Linda has not mentioned any of this to him, and the spirit of Banri laments that he cannot tell the current Banri how important Linda was to him.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/eBPX5KmxKXw3DjMlet98L9NvjDJ.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"6087998b2c6b7b002a711b84","adult":false,"gender":2,"id":1742101,"known_for_department":"Directing","name":"Hiromichi Matano","original_name":"Hiromichi Matano","popularity":1.679,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"64addce03e2ec8014f4a147c","adult":false,"gender":2,"id":4157957,"known_for_department":"Directing","name":"Takashi Yamazaki","original_name":"Takashi Yamazaki","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-11-07","episode_number":6,"episode_type":"standard","id":1213367,"name":"Yes No","overview":"In a dream, Banri remembers that after his love confession to Linda, she agreed to tell him her response the following night on the bridge where Banri would have his accident. Kōko notices Banri's unusual behavior around Linda, but when she questions him, he denies that anything is wrong. Chinami finds the two and invites them to a party, but Kōko declines out of dislike for Chinami, but this does not dissuade Chinami, who explains to Banri that she likes Kōko. Banri convinces Kōko to attend, alongside Mitsuo and Nijigen, but Kōko and Mitsuo end up arguing about Chinami, which ends with Mitsuo confessing to Chinami, and her turning him down. On their way home, Banri decides to end his friendship with Kōko, due to her lasting infatuation for Mitsuo, and despite Kōko's objections, he leaves her. The next day, Linda notices the tense atmosphere between the two, but when she inquires about it, Banri confronts her about not telling him that they previously knew each other. Linda explains that she said nothing out of fear of confusing him and driving him away, while also admitting her guilt in feeling that she had caused Banri's accident by not responding to his confession sooner. Afterwards, Kōko meets up with Banri to learn what happened, but he takes off running due to the revelation that Linda might have reciprocated his feelings years ago, and how her answer would have affected his life. Before he can wonder if having the same accident would let him do things over again, Kōko manages to catch up to Banri and tells him not leave her, confessing that she loves him.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/lIVVk0rTlbUBs3lWMOXBrHJxKZP.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a6984448e007931c024","adult":false,"gender":2,"id":2393222,"known_for_department":"Directing","name":"Tomohiro Matsukawa","original_name":"Tomohiro Matsukawa","popularity":0.728,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-11-15","episode_number":7,"episode_type":"standard","id":1213368,"name":"Masquerade","overview":"Kōko tells Banri that she loves him, but before he can respond Kōko is arrested for stealing a bike that she used to catch up to Banri. At the police station, Kōko is cleared of any charges, and after explaining the reason behind her sudden confession, Banri reciprocates and the two officially become a couple. The next day, Kōko openly expresses her love for Banri as they walk to school, and their relationship is met with disbelief from Nijigen, and mild surprise from Mitsuo, who has dyed his hair blonde out of depression from being rejected. When Chinami comes to greet them Mitsuo flees, and Chinami says that he has been avoiding her, while explaining the reason she rejected him was because his confession was made in public. Linda soon appears, and Banri flees, noting that he has been avoiding Linda since their last conversation, despite her constant attempts to speak with him again. As time passes, Banri and Kōko enjoy their time as a couple, but Banri continues to ignore Linda, which upsets her, and causes Nana to take notice. One day, Banri is called back to his apartment because of a plumbing leak, but when he arrives he meets Nana again, who reveals that she is his neighbor, and that she faked the leak to get him to meet with Linda. Back in Banri's apartment, he apologizes for his behavior, and the two rekindle their friendship, just as Banri gets a call from Kōko who worries that Mitsuo might be in trouble.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/yLTNHTUv3PXT789fVseJX9sIfFO.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"6087997684448e007931bedb","adult":false,"gender":2,"id":1493759,"known_for_department":"Directing","name":"Hideaki Nakano","original_name":"Hideaki Nakano","popularity":2.217,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-11-22","episode_number":8,"episode_type":"standard","id":1213369,"name":"Reset","overview":"In a flashback, Banri overhears Linda saying she does not see him as a lover, causing him to ignore her for days. She then apologizes, saying she did not mean what she said. Banri forgives her and the spirit of Banri reminisces that was when things changed between the two and left him wondering if Linda did like him. Banri goes to check on Mitsuo after a call from Kōko, and finds him depressed due to telling Chinami to stay away from him due to rumors about her rejecting him. Deciding to cheer him up, Banri, Nijigen, and Kōko take Mitsuo to an amusement park, but when Chinami calls, Kōko also invites her, to reconcile her and Mitsuo. Kōko and Banri meet Chinami at the station, where after some banter between the two women, they get along and the group spends the whole day at the park, with Mitsuo and Chinami making up. Afterwards they all spend the night at Banri's apartment, but while everyone sleeps, Banri texts Linda, who was next door, and they meet on the balcony. After reminiscing about their old relationship, Banri asks Linda what her feelings for him were in the past, and she responds that she only saw him as a friend. While seemingly accepting this, Banri blacks out for a moment and yells his desire to go back to that time, shocking them both. Linda passes off his sudden outburst and goes back inside, but the spirit of Banri reaffirms his love and desire to be with Linda, but notes he cannot leave the current Banri without disappearing.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/lHnPnoGUeUonoFi2nqC6uAyEOEw.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a2933a5330040d38f85","adult":false,"gender":2,"id":1851212,"known_for_department":"Directing","name":"Sega Kajii","original_name":"Sega Kajii","popularity":1.029,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"637d29cba5743d009c1d4ea9","adult":false,"gender":0,"id":3201040,"known_for_department":"Visual Effects","name":"Mika Inoue","original_name":"Mika Inoue","popularity":0.917,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-11-28","episode_number":9,"episode_type":"standard","id":1213370,"name":"With You Again","overview":"Kōko suddenly falls ill and does not come to school for several days. When she does return, Banri notices she is dejected, but she denies anything is wrong, until she breaks down in tears and relays to Banri her fears that he might one day leave her. Banri reassures her he will not, and the spirit of Banri, who was observing, comments on a similar situation between him and Linda. In a flashback to the summer of their third year in high school, Linda tells Banri that she learned that her brother's fiancé was having an affair, and gets him to help her expose it. When the two photograph the affair, Linda has a change of heart and deletes all the photos, and instead confronts her brother's fiancé and tells her she will keep it secret, but to never let it happen again. Afterwards, Barni vehemently voices his disapproval of her decision, but apologizes when he notices how troubled she is by her own deceit. Banri comforts Linda by saying she is not alone, and he will bear the lie she knows with her, and will always find her and be there for her, but he fails to reassure her when she asks. In the present time, Banri and Linda meet and talk, where Banri mentions Kōko is sick again, while Linda mentions her family and brother. When Banri shows he does not remember she had a brother, a saddened Linda leaves, but not before she uses the words he used to comfort her in the past to encourage him to be there for Kōko. The spirit of Banri who witnessed this, regrets that he did not confess his true feelings for Linda in the moment she sought reassurance from him, and notes that it is too late for them. However the next morning, the spirit of Banri awakens to find himself back inside his physical body.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/r4jcul1t9pAhRSCkT9rGqVTUi4S.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"608799f5b6abc4007849d268","adult":false,"gender":2,"id":2382146,"known_for_department":"Directing","name":"Osamu Honma","original_name":"Osamu Honma","popularity":1.654,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-12-05","episode_number":10,"episode_type":"standard","id":1213371,"name":"In the Mirror","overview":"Ghost Banri, having awakened back in his physical body, feels the urge to see Linda. He slips and falls, hitting his chin on the floor. He returns to being \"new\" Banri, and sees in the mirror Kōko gave him that he has cut his chin. Despite not being a serious injury, Banri feels ill. He discovers the hidden picture of Linda and himself is missing. He tries to go to the hospital by himself, but Nana finds him and takes him there. On the way home he tells Nana that he had the wrong idea about her, and that she is actually really nice. She listens with her usual cool attitude. Once home, she passes him off to a waiting Linda, who accuses her of beating up Banri. Nana tells Linda that she only helped him, and leaves Linda and Banri by themselves. Linda takes care of Banri for a while, feeding him water and medicine. Banri reflects on the conflicting emotions he experiences about Linda and Kōko. Kōko arrives with a bouquet of roses and accuses Banri of cheating because he's alone in his apartment with Linda. Banri and Linda are taken aback until Kōko reveals she's kidding, tossing the roses aside. 2D-kun and Mitsuo arrive and jokingly argue over who caught the bouquet and will get married first. Kōko assures everyone present that she was really kidding, and that she knows that Banri would never cheat on her. She goes a little over the top about the subject, and gets chided by Linda who tells her to cut it out. Kōko, in turn, chides Banri for not telling her that Nana lived next door, but forgives him anyway. She also thanks Linda for taking care of Banri, but Mitsuo suspects she is not being honest about her true feelings. They begin to argue, but Linda stops them for Banri's sake. Kōko admits that having another woman take care of him before she could get there did make her a little jealous. Linda admits that Nana took care of him first. Everyone discusses summer vacation plans, and decide to go to the beach together. Later that night, Banri awakens and finds Kōko still there and watching over him. Kōko apologizes for not taking care of him properly and making a fuss when he was not feeling well. She becomes depressed, telling Banri that she could never be a good girlfriend. Banri gives her an assuring hug, and asks if she's not entirely over her own cold yet. She assures him that she couldn't have come and seen him if that were the case. She admits that she wanted to go to the beach only with him, and asks if he will take her when he's better. She further states that \"it doesn't have to be Paris\", referring to her ideal \"first time\" location. Banri promises that he will take her once summer vacation arrives.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/wCPiDQe1ff44tbHqp6d3yoOIu2D.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a97435abd0029c4c8fb","adult":false,"gender":2,"id":1579862,"known_for_department":"Directing","name":"Yoshitaka Koyama","original_name":"Yoshitaka Koyama","popularity":1.894,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-12-12","episode_number":11,"episode_type":"standard","id":1213372,"name":"Trouble Party","overview":"Banri and Kōko ride the train and discuss Kōko's new Festival Club nickname \"RoboGirl\", so named because she looks like a robot when she dances.They look forward to the Awa dance festival and the beach trip they have planned. Banri worries about whether Kōko is the one who took the photo of Linda and him from his apartment. They meet up with the rest of the Festival Club, and discuss the preparations needed before the festival. Afterwards Banri speaks with the upperclassmen and asks for advice about his beach trip with Kōko. When they find out that Banri only intends to take her by train for a day trip, they tell him that a classy girl like Kōko won't be happy with the low-budget, simple trip he has planned. They advise him to get a job and make some money. Later Kōko tells him that she doesn't want him to get a job because it would mean they wouldn't get to see each other much. Kōko offers to pay for both of them on their trip. She tells him that she wants to spend as much time with him as she can, and admits that she worries about what he's doing when they're not together. She says that she knows she is awkward, overbearing, and annoying, but says she's learning to hold back. Kōko then tells Banri that she wishes she could shrink him down so that she can keep him with her in her bag for safety. Oka-chan walks up and says hello, then announces that she is on her way to her part time job. Oka-chan advises Banri that her employer is looking for more people, so they follow her to the upscale cafe where she works. Kōko, though, forbids Banri from working. Banri visits Nana to pay her back for cab fare and bring her cookies. Upon finding out Banri needs money, Nana invites him to be a waiter at a weekend party. She also insists he bring Mitsuo with him. Mitsuo resists the idea until the Tea Club tries to recruit them for questionable employment. On the night of the party Banri tells Mitsuo that Kōko had wanted to come over, but that he told her he had to work on a report. At the party, Banri finds himself dressed as a maid. The party host offers Mitsuo an extra 10,000 yen to wear nothing but a flesh-colored Speedo, which he accepts. While waiting on party-goers, Banri sees that Linda is also working at the party dressed as a devil girl. Meanwhile, Kōko is unable to contact Banri as he is not carrying his phone with him at the party.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/dNPh1bEZGT5ygptQVGFmF0ovJ4v.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"6087998b2c6b7b002a711b84","adult":false,"gender":2,"id":1742101,"known_for_department":"Directing","name":"Hiromichi Matano","original_name":"Hiromichi Matano","popularity":1.679,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2013-12-19","episode_number":12,"episode_type":"standard","id":1213373,"name":"Don't Look Back","overview":"Banri Tada is enjoying working as a waiter at the party, along with Nana, Mitsuo and Linda. Meanwhile, Kōko has texted Banri numerous times and is becoming concerned that he hasn't answered. Some of the guests see Banri and Linda together and insist on taking their picture. The two of them get carried away and strike several provocative poses just as Kōko, who has come looking for Banri, arrives. Incensed, she throws a drink in Banri's face and slaps him. Linda tries to apologize but Nana stops her and Banri takes Kōko away to the fitting room. Unable to talk for long as he is still on the job, he gives her the key to his place and tells her to wait for him there. Kōko leaves and Banri continues working but is concerned about his relationship. Once the party is over and they receive their pay Banri tells Mitsuo that his salary might have lost its usefulness. On his way home Banri checks his phone and is shocked to discover that Kōko has been texting him all day. He hurries home to a dark apartment and is relieved to find Kōko waiting for him. The couple apologize to one another and Kōko returns the picture of Banri and Linda, much to his surprise. He admits that they were former classmates and he had been in love with her. He then goes on to tell Kōko that his feelings for Linda return sometimes in flashes. Kōko hugs him in response and says that all she want is for Banri not to remember the past, with Banri understanding and so the couple reconcile. The next morning, Banri tells Linda that he wants to talk with her. Beside the river, he asks if she loved the old Banri; she replies that she only thought of him as a friend. Banri then tries to rip the picture of them together, with the ghost of the old Banri looking on and saying no. He drops the picture, which Linda then picks up. Banri gets to his feet and tells her to pretend that they are just strangers, as he wants to cut ties with the past. Linda realizes that Kōko is bothered by her being a part of his past life and says she understands and that they are doing the right thing. She then rips the picture into pieces, surprising Banri. The next morning, Kōko and Banri take a picture together, forming new memories for just the two of them.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/9NSFBlErzBf0NziFmTrUIOD5qoG.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60e344b8b3f6f5002c456a8d","adult":false,"gender":0,"id":1851215,"known_for_department":"Directing","name":"Riki Fukushima","original_name":"Riki Fukushima","popularity":1.186,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"629492be09ed8f125551dfe9","adult":false,"gender":0,"id":1851215,"known_for_department":"Directing","name":"Riki Fukushima","original_name":"Riki Fukushima","popularity":1.186,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2014-01-09","episode_number":13,"episode_type":"standard","id":1213374,"name":"Summer Has Come","overview":"As Ghost Banri watches, Banri dreams about when he was in the hospital and met with Linda (whom he didn't remember at the time), and about the message he was supposed to \"pass along to her friend\". Later, the Festival Club gathers at the Awa dance festival and prepares to perform. Almost everyone is in a jovial mood, but Kōko is experiencing severe stage fright. She tries to run to the restroom, but Linda points out that she's been there about thirty times, and that her urge to urinate is a result of her nervous condition. The festival is about to start, so the other club members start to abandon Kōko where she sits. Linda then suggests they teach the first years about \"that\". \"That\" turns out to be the club performing a special dance as they circle around Kōko and Banri. Banri joins the circle, and soon Kōko does too. With everyone now ready, they successfully perform in the festival. Afterwards, Kōko and Banri enjoy the festival together and get ready to watch the fireworks. Ghost Banri watches nearby, lamenting that he still loves Linda and that Banri has rejected the feelings he left behind. He vows to become an evil spirit and curse Banri with unhappiness. It suddenly starts to rain, forcing Kōko and Banri to seek shelter. Later, Banri receives word that the Festival Club's camp has been cancelled. He reflects on how his summer activities have so far been cancelled or interrupted. He sees Kōko get out of a cab in front of his building, so he waits by the elevator to surprise her. As the doors open he does a \"peek-a-boo\" greeting. The occupant, however, turns out to be Nana, who punches him in the face and leaves him lying on the floor. Kōko (who ran up the stairs) arrives and announces she is going to make yakisoba for him. Banri is excited, but Kōko insists that he sit blindfolded with his hands in his pockets while she cooks. It turns out she is only feigning cooking, having actually brought pre-prepared yakisoba with her. The blindfold slips, allowing Banri to see what is really going on. Kōko is embarrassed, and insists it was all a joke. Later, on an evening walk, she admits that her family’s maid prepared the Yakisoba. They stop and sit in a park where they discuss Kōko possibly enrolling in culinary school and her family’s upcoming vacation to Barcelona. Kōko tries to kiss Banri, but he pulls back and walks away. Later, he wishes he could ask Kōko to not to go to Barcelona and stay with him. He sadly wonders if Kōko will leave him someday. A nearby Ghost Banri vows to make him even unhappier\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/ehHKyPT2sxHtkBCr0CmPX2i2NNL.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"608799b2f9475b003f2decc4","adult":false,"gender":2,"id":1609344,"known_for_department":"Directing","name":"Makoto Sokuza","original_name":"Makoto Sokuza","popularity":3.606,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"64addce03e2ec8014f4a147c","adult":false,"gender":2,"id":4157957,"known_for_department":"Directing","name":"Takashi Yamazaki","original_name":"Takashi Yamazaki","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-01-16","episode_number":14,"episode_type":"standard","id":1213375,"name":"Ladies Talk","overview":"2D-kun calls Banri and tells him that he heard Banri was lonely. He offers to hang out, but Banri already has plans with Kōko. As they discuss their wish to hang out with Mitsuo (who has been too busy lately), Kōko arrives and overhears the conversation. She is suspicious until Banri hands over the phone and she discovers it is 2D-kun to whom Banri is speaking. Finding out that Mitsuo may have a girlfriend, she formulates a plan to determine her identity and enlists Banri's and 2D-kun's help. They start by watching Oka-chan’s house, thinking that she is the most likely candidate. Oka-chan discovers them, though, so Banri tells her they were just visiting her. To their surprise she tells them she’s free to hang out, and when asked she admits that she’s not seeing anyone and that she hasn't seen Mitsuo since summer vacation started. Oka-chan invites them in, where they observe that the house is empty except for Oka-chan’s room. She explains that her family has moved away and that she will live alone while she finishes college. Kōko admits that she’s jealous of Oka-chan. Oka-chan replies that she is worried about living on her own for the first time. They reaffirm their decision to go to the beach together. They all go to the place the Film Club hangs out, but before they get there they observe Mitsuo and Linda walk in together as if on a date. To allow Mitsuo and Linda some privacy they decide to go somewhere else. Later Kōko arrives at Oka-chan’s house with a bag full of swimsuits. The two of them try the swimsuits on, and discuss Kōko’s and Banri’s relationship, and Kōko tells about Banri resisting her kiss in the park. She admits that she never feels they are “in the mood” when she and Banri are alone in his apartment. Oka-chan points out that Banri probably resists because he wants to show Kōko how much he really cares for her. Kōko tells Oka-chan that she wishes she could spend more time with Banri at his apartment. She admits that she questions whether Banri really loves her and is afraid he will disappear someday. She wonders if Banri is trying to find himself and if he does so if will he leave her. Kōko then states that the next two swimsuits she pulls out of her bag will be what she and Oka-chan will wear to the beach. They turn out to be school swimsuits. Oka-chan likes the idea and films them while wearing the swimsuits. Later in Banri’s apartment, Mitsuo and Banri discuss their swimwear choices as well. Mitsuo wishes he could have invited Linda and wonders where her hometown is located. Banri lies and says he doesn't know.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/kcQ1qRm9SY9xfJ21EUUm1UaZEjv.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"608799f5b6abc4007849d268","adult":false,"gender":2,"id":2382146,"known_for_department":"Directing","name":"Osamu Honma","original_name":"Osamu Honma","popularity":1.654,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2014-01-23","episode_number":15,"episode_type":"standard","id":1213376,"name":"Accident Beach","overview":"On the day of the trip to the beach, the group encounters several mishaps on the journey. It starts off with Kōko and Banri meeting Nijigen at the wrong place, and delays in picking up Chinami and Mitsuo. Heavy traffic slows their exit from the city. It rains despite contrary forecasts. The group arrives in the middle of a rainstorm. Needing to use the restroom, Kōko gets out of the car in her swimsuit, and the rest of the group follows. The rain stops and the group enjoys their beach day. With Nijigen feeling exhausted, Kōko instead drives the car back home. Along the way, Banri falls asleep despite trying his best efforts to remain awake. Shortly afterword, Kōko becomes tired and falls asleep at the wheel. Moments before the car swerves out of control, Banri wakes up and hits the brakes, causing the car to come to a complete stop after colliding with the guard rail.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/vXv4AE9XqPEvu2Gw7W5cXuqczUx.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"608799d40c271000579daa40","adult":false,"gender":1,"id":2135289,"known_for_department":"Directing","name":"Masako Sato","original_name":"Masako Sato","popularity":1.96,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2014-01-30","episode_number":16,"episode_type":"standard","id":1213377,"name":"Wake-up Call","overview":"The accident gives Chinami a bloody lip, dents the car's bumper, and damages the guard rail. The group is escorted back to the city by the police. Upon arrival, Kōko gets slapped by her father, and the trip to Barcelona is cancelled. On the next day, Banri, Mitsuo, Chinami, and Nijigen meet with all of them taking responsibility. Banri feels the most at-fault for not keeping Kōko awake. Banri goes to Kōko's home to talk with her, finding Kōko unwilling to get out of bed. The accident reminds Kōko that she has acted immaturely despite being an adult. Banri tells Kōko that despite needing to grow up she needs to remain true to herself. Kōko tells Banri about a dream she had where she was riding in a car with Banri and at a place where they are told to stop the car, Kōko gets off and the car drives away, which makes her believe that if Banri should regain his memories that he would fall in love with Linda instead of her. Kōko's father enters her room and orders Banri to cook some ramen, while Kōko returns to bed.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/aDIz5mRQNO035Eb144Dmq3AT3Ji.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a2933a5330040d38f85","adult":false,"gender":2,"id":1851212,"known_for_department":"Directing","name":"Sega Kajii","original_name":"Sega Kajii","popularity":1.029,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"637d29cba5743d009c1d4ea9","adult":false,"gender":0,"id":3201040,"known_for_department":"Visual Effects","name":"Mika Inoue","original_name":"Mika Inoue","popularity":0.917,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2014-02-06","episode_number":17,"episode_type":"standard","id":1213378,"name":"Return to Yesterday","overview":"Banri arrives at the Golden Time restaurant where the Festival Club is setting up for a gathering at the Fireworks Extravaganza and the club members are strangely welcoming and eerily nice, which sets Banri on edge. He figures out that they are trying to comfort him after his and Kōko's supposed breakup. But when Kōko arrives they clear up the confusion, only to create a new misunderstanding with former fourth year members. Linda also arrives late and Linda, Kōko and Banri discuss the accident. Banri asks about how she knew about it since she was out of town, but Linda answers vaguely. Linda then asks if Banri will be going home and he says he will, so Linda brings up that there will be a class reunion and wonders if Banri will come. After Kōko makes the decision for him, Kōko and Banri talk about how Banri is ready to face his past after their frank fight earlier, and Kōko admits that her love for Banri has grown more after that fight, and encourages him to return home. The next day Banri is on a train home. Meanwhile, Chinami had invited Kōko to help her unpack, and invites Kōko to stay overnight, but while Kōko denies that she was there to help and will not stay, she relents. Chinami then reveals how she respects how amazing her love for Banri is. Elsewhere, at the club where Linda works, Mitsuo and Linda talk while she cleans and Mitsuo asks if telling her about the accident was a bad thing. Mitsuo then discovers that Linda will also be gone like Banri will be, and then sees her train tickets going to the same place as Banri, but when he presses her a bit about it and tries to playfully flirt, Linda storms off. The next day, 2D, Kōko and Mitsuo are enjoying a treat at a cafe and Mitsuo and 2D discuss what they think they know about Banri's true situation with his amnesia. When Mitsuo asks Kōko about it she deflects the question and focuses on other things, leaving Mitsuo to brood on this new-found knowledge.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/xIbvPgwBO26Q6kvgJRaRV0dGuWt.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"6087998b2c6b7b002a711b84","adult":false,"gender":2,"id":1742101,"known_for_department":"Directing","name":"Hiromichi Matano","original_name":"Hiromichi Matano","popularity":1.679,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2014-02-13","episode_number":18,"episode_type":"standard","id":1213379,"name":"My Hometown","overview":"Kōko enters Banri's apartment alone after going through his mail because she misses him so much. After throwing a tantrum and sniffing Banri's pillow, she tries to get a hold of herself by doing The Exorcist. Nana catches her in the act, then suggest that Kōko do that during Nana's next show, but Kōko refuses. Kōko then tackles Nana in a stranglehold, trying to get Nana to not tell Banri that she went into Banri's room and did what she did while he wasn't there. Kōko agrees to do anything else to help, and Nana takes her up on her offer, using her as the guinea pig for another idea for Nana's act. Meanwhile, at the Banri home, Linda and her brother show up to go to the class reunion. During the drive, Linda spots the mirror Kōko gave to Banri, and determines that Banri is very nervous. At the high school, Banri becomes so nervous about not having his memories that he won't move, so Linda tricks him to into entering. They arrive and everyone puts on a red or blue shirt with nametags to play a dodgeball game rematch when Banri's team beat Linda's team on a hotly disputed technicality. After Linda uses the same technicality to win the game, the class catches up at the party with many of his classmates warmly welcoming him despite his not remembering any of them. They then start relating stories of the old Banri, much to his embarrassment. When their sensei arrives and relates another characteristic of old Banri, Banri feels even worse, but soon after taking pictures with former classmates he feels better. Later that night, Linda and Banri talk on the way home and how Linda is happy that Banri has finally accepted his situation despite all the friction between them, as well as how Linda has come to accept their situation as well. Banri then goes to take a picture of the bridge where he fell, then experiences a vision of the accident. He tries to save the ghost Banri but ghost Banri forces himself to fall, and new Banri drops his mirror and breaks it, wondering if his memories are returning.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/qPr92EUMgwnre2DfwfsTc48cLSL.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"6196c755af58cb0091b1a21e","adult":false,"gender":2,"id":2390133,"known_for_department":"Visual Effects","name":"Koji Ogawa","original_name":"Koji Ogawa","popularity":1.428,"profile_path":null},{"job":"Animation Director","department":"Visual Effects","credit_id":"6196c77a2811a10043ba7c43","adult":false,"gender":0,"id":1375831,"known_for_department":"Visual Effects","name":"Yumi Nakayama","original_name":"Yumi Nakayama","popularity":1.4,"profile_path":null},{"job":"Animation Director","department":"Visual Effects","credit_id":"6196c77fabdafc00657973b5","adult":false,"gender":2,"id":2798963,"known_for_department":"Visual Effects","name":"Shigenori Taniguchi","original_name":"Shigenori Taniguchi","popularity":2.656,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"64addce03e2ec8014f4a147c","adult":false,"gender":2,"id":4157957,"known_for_department":"Directing","name":"Takashi Yamazaki","original_name":"Takashi Yamazaki","popularity":0.6,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"64addce33e2ec8010dada68b","adult":false,"gender":2,"id":4157957,"known_for_department":"Directing","name":"Takashi Yamazaki","original_name":"Takashi Yamazaki","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-02-20","episode_number":19,"episode_type":"standard","id":1213380,"name":"Night in Paris","overview":"Banri discusses the event of ghost Banri falling from the bridge with a doctor, who can do nothing more than provide a sedative for him. On the train ride back to Tokyo, Banri remembers how ghost Banri tried to take over his body before and now wonders why ghost Banri has given up. When Banri returns to Tokyo, he recalls how his mother gave him her ring from her youth to give to his girlfriend, but Kōko and the others meet him before he can think more on it. That night they have a return home dinner for Banri, and he notices that Chinami has cut her hair. Mitsuo then asks Kōko and Banri a favor to film the Festival Club in a ploy to get closer to Linda. Later Banri and Mitsuo talk about how they knew about Mitsuo and Linda, and Mitsuo confronts Banri about his past with Linda, but while Banri considers answering him honestly, Mitsuo backs off. Back at Banri's apartment with only Banri and Kōko, Banri apologizes to Kōko for breaking their friendship mirror, then considers the impact of giving Kōko his mother's ring. Before he can do anything, Kōko gives him a piece of art she made for him, then tells him she's wants their \"Night in Paris\" right now. But several things get in the way, and nothing ends up happening. Kōko realizes that she can be herself with him and realizes that Banri is definitely in love with her now. Much later, Mitsuo gets permission to film the Festival Club, but Linda is unhappy and Mitsuo never gets a chance to talk with Linda. Afterwards, Linda indicates that she wants to talk with Banri and Kōko goes to distract Mitsuo in the meantime. Linda and Banri argue about Mitsuo coming to the club, and they end up discussing it calmly later on. Linda reveals their dinners together, but also how she's been unable to simply accept Mitsuo's interest in her and has been keeping her distance from him, which is why they had this argument. While they talk, Chinami arrives to talk to Banri about his friendliness with Linda and how it's inappropriate.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/r235kN2j0tu26PM8lrjRWw1zqXB.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a97435abd0029c4c8fb","adult":false,"gender":2,"id":1579862,"known_for_department":"Directing","name":"Yoshitaka Koyama","original_name":"Yoshitaka Koyama","popularity":1.894,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2014-02-27","episode_number":20,"episode_type":"standard","id":1213381,"name":"His Chasm","overview":"After Chinami admonishes Banri for being too friendly with Linda because she's the girl Mitsuo likes, Banri catches up with Kōko to share everything that happened. Kōko and Banri talk about Chinami, and they both realize that they are ok with their former likes liking others. Banri then considers giving Kōko his mother's ring as the moment is perfect, but realizes he didn't bring it. Back at his apartment, Banri considers when he can give the ring to Kōko and wonders who he can talk to about it. In the morning on the way to school, Banri runs into Nana and tries to talk to her during the train ride. He realizes she isn't in the mood to talk about anything and then she falls asleep on Banri. At the school, 2D, Kōko and Banri talk about Mitsuo's strategy to keep filming the festival club. When Mitsuo and Chinami arrive, Chinami convinces Kōko to go with her to get Belgian chocolate. Mitsuo, 2D and Banri discuss Mitsuo's failure to get any closer to Linda. Mitsuo points out that Koshino seems to be protecting Linda from Mitsuo, but they realize class is about to begin and hurry away. After class, Banri meets Kōko. They go to the Woodstock Cafe, where they talk about their immediate future, both happy about the pleasantness of their days lately. At school the next day, while Banri is considering how to give Kōko his mother's ring, he is accosted by the Tea Club girls who discover his plan and make him extremely nervous about it before trying to recruit him again. Kōko arrives for them to go to Festival Club practice. Banri and Kōko see how fourth year Koshino seems to be protecting Linda from Mitsuo. Later, at the train station, Banri and Kōko talk about everything. At the performance, Mitsuo renews his focus of filming the Festival Club, while Linda points out that Kōko isn't nervous as she tries to help the fourth years. During the performance, Banri has a mental break as his past self reasserts itself and he freaks out and runs away. Linda and Kōko go after him. Linda finds him later as Banri tries to figure out what's happened to him. When Linda brings up Kōko, his new self returns, but now Banri fears that old Banri is going to take him over again.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/rZ4eITQg06HYJ4Ob5scSeYu8cVM.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"608799b2f9475b003f2decc4","adult":false,"gender":2,"id":1609344,"known_for_department":"Directing","name":"Makoto Sokuza","original_name":"Makoto Sokuza","popularity":3.606,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"64addce03e2ec8014f4a147c","adult":false,"gender":2,"id":4157957,"known_for_department":"Directing","name":"Takashi Yamazaki","original_name":"Takashi Yamazaki","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-03-06","episode_number":21,"episode_type":"standard","id":1213383,"name":"I'll Be Back","overview":"After the incident at the Awa dance festival, Banri fears losing himself as his memories from before his accident return. Kōko tries to comfort Banri by having dinner with their friends at his apartment as he plans to tell them about his background and other recent troubles. Things go sour when Barni tries to invite Chinami but agreed to come nonetheless. At Banri's apartment, Chinami arrives earlier as planned as she plans to have a serious conversation with Banri before the others arrive. Chinami confesses that she felt relieved after seeing Banri being friendly with Linda as she was in love with Mitsuo and felt regret when she changed her appearance after cutting most of her hair. Following her outburst, Chinami asks Banri to film her in her dejected state. As Banri intends to tell Chinami about her past with Linda, Banri is possessed by his former self and begins calling out for Linda. He storms out his apartment but not before telling Linda and the others to not tell Kokō that his memories are returning, not realizing that Chinmai was filming the conversation. Kōko refuses to accept the ring Banri had presented to her and seemingly ended their relationship.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/1Sl8d2UlrabBVgi1iqqZW78FIf.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a2933a5330040d38f85","adult":false,"gender":2,"id":1851212,"known_for_department":"Directing","name":"Sega Kajii","original_name":"Sega Kajii","popularity":1.029,"profile_path":null},{"job":"Key Animation","department":"Visual Effects","credit_id":"637d29cba5743d009c1d4ea9","adult":false,"gender":0,"id":3201040,"known_for_department":"Visual Effects","name":"Mika Inoue","original_name":"Mika Inoue","popularity":0.917,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2014-03-13","episode_number":22,"episode_type":"standard","id":1213384,"name":"Paradise Lost","overview":"Stunned by Kōko's words, Banri waits for Kōko where she had rejected him, hoping Kōko would come back. Hours pass and Banri meets Kōko's father, who drives Banri home. Along the way, Banri deduces that Kōko may already had knowledge of Banri taking anti-anxiety medications and asks her father about the diagnosis that leads to its prescription. Later Banri encounters Nana. Banri confides in her about his recent dilemma. The next day, encouraged by Nana's words, Banri plans to confront Kōko. Afterwards, Banri meets Kōko, seemingly acting the same whenever the two interact. However, after meeting their friends, Kōko nonchalantly declares that she and Banri are broken up, much to the shock and bewilderment of Banri and the others. After Kōko lashes out, Chinami tells Banri that Kōko may have seen the clip of Banri's anxiety attack. Staying optimistic, Banri later informs Linda and the president of the Festival club of his breakup with Kōko. Banri and Linda argue. Banri reveals to Mitsuo his past relationship with Linda and apologizes for not telling him. Kōko then appears as she hands down a letter of resignation from the club to its president until Banri cuts her off, causing her to leave with Banri calling out to Kōko.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/7gswLJ4EmP9np3s1EjpzFW9b2WO.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a6984448e007931c024","adult":false,"gender":2,"id":2393222,"known_for_department":"Directing","name":"Tomohiro Matsukawa","original_name":"Tomohiro Matsukawa","popularity":0.728,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]},{"air_date":"2014-03-20","episode_number":23,"episode_type":"standard","id":1213385,"name":"Last Smile","overview":"Banri confronts Kōko; Kōko explains the reason why she decided to resign from the Festival Club is due to Banri's unwillingness to be in the same place as her. Banri reveals to Kōko that his memories from before his accident are returning and he would eventually return to his former self; his memories since the accident will disappear. After Banri thanks Kōko for all they'd shared together, the two agree to become friends with Kōko revoking her resignation from the club. Kōko promises Banri that she will stay by his side as long as he doesn't forget her. Afterwards, Banri tries to patch things up with Mitsuo, who had not contacted him since he revealed to Mitsuo his past with Linda. Meanwhile, with their school festival fast approaching, Banri's condition worsens, much to Kōko's fright. Nijigen, bewildered by his friends actions and is feeling left out of what's happening, intends to have a get-together to revive their friendship. Banri suffers another memory break and runs away — calling out desperately for Linda. After returning to his senses, Banri plans to return to his hometown, feeling certain that his memories and former self will return. During their school festival, the festival club receives support from the private school committee thanks to Mitsuo. Meanwhile, Banri reconciles with Mitsuo. During the Awa dance performance, Banri narrates how moments and feelings are born and later die. Afterwards, Banri states that he indeed returned to his former self with his memories since his accident now lost.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/At73rbq4ie2hWD2hZCZCoUg4R8b.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Director","department":"Directing","credit_id":"60879a97435abd0029c4c8fb","adult":false,"gender":2,"id":1579862,"known_for_department":"Directing","name":"Yoshitaka Koyama","original_name":"Yoshitaka Koyama","popularity":1.894,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"64addce03e2ec8014f4a147c","adult":false,"gender":2,"id":4157957,"known_for_department":"Directing","name":"Takashi Yamazaki","original_name":"Takashi Yamazaki","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-03-27","episode_number":24,"episode_type":"finale","id":1213386,"name":"Golden Time","overview":"Upon losing his recent memories, Banri returns to his hometown. After fiddling with the notes he made for himself prior to the return of his former memories, Banri opens his e-mail account and discovers that someone has been sending e-mails to Kōko under his name. Linda and Banri seem to have returned to their easy friendship, with Linda spending Christmas with the Tada family. He contemplates Linda's reply to his feelings and the happenings that occurred between them since his accident. Kōko arrives at Banri's home. Banri first mistakes her for Chinami. Kōko hands Banri a DVD and his cracked mirror case, which Banri sees as Kōko's belonging and returns it to her. After asking for directions for the bridge where Banri fell, Kōko leaves and Banri finally remembers Kōko after finding her mirror case alongside his notes. As a result, Banri goes after Kōko to the bridge where he meets his conflicted former self. The latter then cross the bridge after Linda appears and gives her reply to his feelings with a \"Yes\" and hands Banri the ring he had dropped at the bridge days before. Afterwards, Banri embraces Kōko and the two recall their promise: that as long as they remember one another, the two will stay together for the rest of their lives. They profess their love for one another and Banri presents his ring to Kōko, which she gladly accepts. Meanwhile, it's revealed that Nijigen was responsible for sending spam e-mails as Banri and motivated Kōko to go after him. Taking advantage of Kōko's motivation, Chinami edited the recording Banri made of himself and burned it to a DVD, which she asked Kōko to deliver to Banri. While watching his recording, Banri thanks Kōko for being by his side. Banri later returns to Tokyo and attends university with his friends. His relationship with Kōko is still intact. Mitsuo and Linda are shown flirting while Kōko and Banri kiss with Kōko wearing the ring Banri gave her.\n\n(Source: Wikipedia)","production_code":"","runtime":24,"season_number":1,"show_id":67389,"still_path":"/7sFLwueuBZf713YCdmcRcZ62C7L.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"608798c52da846006e404eb2","adult":false,"gender":2,"id":1257198,"known_for_department":"Writing","name":"Fumihiko Shimo","original_name":"Fumihiko Shimo","popularity":2.964,"profile_path":"/lMnYd3D9TaiS3LPuum35Yk2gQVK.jpg"},{"job":"Key Animation","department":"Visual Effects","credit_id":"64addd1866a0d3011d7d14b5","adult":false,"gender":2,"id":4157957,"known_for_department":"Directing","name":"Takashi Yamazaki","original_name":"Takashi Yamazaki","popularity":0.6,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"57aafc20c3a36878a3000af8","adult":false,"gender":1,"id":1664196,"known_for_department":"Directing","name":"Chiaki Kon","original_name":"Chiaki Kon","popularity":2.688,"profile_path":"/fkOcEMPrOMVhPx6YCsPC6hDCEEj.jpg"}],"guest_stars":[]}],"name":"Golden Time","overview":"Banri Tada is a newly admitted student at a private law school in Tokyo. However, due to an accident, he lost all of his memories. During his freshman orientation, he encounters another freshman from the same school, Mitsuo Yanagisawa, and they hit it off at once. Without any memory of each other, their lives become more and more intertwined as if set by the hands of fate. But what is their fate, and will it lead to happiness or another memory to forget…\n\n(Source: Crunchyroll)","id":79178,"poster_path":"/vm0jpIstSc9cQcD2BxBvtPKaHrS.jpg","season_number":1,"vote_average":6}}}