{"adult":false,"backdrop_path":"/nQauIs0rYMtjZa86IHgZt98X4Kr.jpg","created_by":[],"episode_run_time":[30],"first_air_date":"2007-09-22","genres":[],"homepage":"http://www.grandstar.tv/","id":6750,"in_production":false,"languages":[],"last_air_date":"2008-03-15","last_episode_to_air":{"id":380660,"name":"Chapter XXVI","overview":"Cal learns the full truth about his parentage. Despite the urgency of the situation, the Renewers debate when to fire the canon.","vote_average":0,"vote_count":0,"air_date":"2008-03-15","episode_number":26,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null},"name":"Grand Star","next_episode_to_air":null,"networks":[{"id":170,"logo_path":"/l0TrgNyJsY0yV1hTggk9eWDtV5I.png","name":"Space","origin_country":"CA"}],"number_of_episodes":26,"number_of_seasons":1,"origin_country":["CA"],"original_language":"en","original_name":"Grand Star","overview":"Grand Star, called La Compagnie des Glaces in France is a Canadian French Belgian Co-production science fiction television series playing on Space and A-Channel as of September 2007.\n\nSet in an apocalyptic future 100 years after a cataclysmic nuclear explosion on the Moon sends the Earth into a new Ice Age, the show revolves around the interactions between a small community of Earth survivors and the returning descendants of colonists who escaped Earth in advance of the disaster. The series is adapted from a series of novels called La Compagnie des glaces by Georges-Jean Arnaud.\n\nA multiplayer strategy game based on the universe of the TV series was launched in 2007. In the game, players face each other and use their trains to gather money for the control of energy sources.\n\nA French video game named Transarctica was also based on the novel series and haphazardly translated into English.\n\nThe first novel in the series was translated in 2010 under the title The Ice Company by Jean-Marc Lofficier & Randy Lofficier ISBN 978-1-935558-31-6","popularity":4.296,"poster_path":"/lougpEutZsjwMx8mJe7xWWpaPFE.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2007-09-22","episode_count":26,"id":17012,"name":"Season 1","overview":"","poster_path":"/hK2uptIoFp4onzInig9z39Wc36f.jpg","season_number":1,"vote_average":0}],"spoken_languages":[],"status":"Ended","tagline":"","type":"Scripted","vote_average":1,"vote_count":1,"season_data":{"1":{"_id":"5257880c760ee36aaa64ec2c","air_date":"2007-09-22","episodes":[{"air_date":"2007-09-22","episode_number":1,"episode_type":"standard","id":380631,"name":"Chapter I","overview":"We meet Cal, Kurt and Suki. A strange beam of light illuminates Cal; he doesn't know what to make of it and hides in the train trying to figure out what actually happened. He discovers he has strange powers. We meet Ma Ker, one of the Sun Renewers, when Cal and Kurt discover the site of a massacre. Despite the great risk, they take her back to Grand Star Station.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-09-29","episode_number":2,"episode_type":"standard","id":380632,"name":"Chapter II","overview":"Cal, Kurt and Cal's father Liam hide Ma Ker from Damien as they nurse her back to health. Ma Ker tells Cal that he is an important individual and has a duty to the rest of the world. As this happens, Cal and Suki discover they have a mutual attraction for each other, although neither will admit it to the other. With the Pointsmen closing in on them, Liam escapes from Grand Star and takes Ma Ker to a safe place.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-10-06","episode_number":3,"episode_type":"standard","id":380633,"name":"Chapter III","overview":"Cal and Liam search for geothermic sources. There is a major accident which forces Cal to remove his gloves despite the -80° C temperature, but he suffers no frost bite at all. Both are puzzled by this. \n\nCal, Kurt and Suki go to a remote fishing station to meet Ma Ker and learn more about Cal’s past. Meanwhile, Liam is tortured by Damien when the Pointsmen become suspicious of him. \n\nAt the fishing station, Cal, Kurt and Suki are taken hostage by Jonah’s parents who suspect the trio of spying for the Pointsmen. Cal uses his powers to enable the three of them to escape and for the first time his friends start to wonder if there might be something unusual about him.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Yana","credit_id":"5db36d3fd40d4c0014f89866","order":500,"adult":false,"gender":1,"id":180970,"known_for_department":"Acting","name":"Sarah Pratt","original_name":"Sarah Pratt","popularity":9.689,"profile_path":"/pjBBtQ5G7UmveVOVBt58yoqPMj2.jpg"}]},{"air_date":"2007-10-13","episode_number":4,"episode_type":"standard","id":380634,"name":"Chapter IV","overview":"Suki goes to the underworld and discovers old videotapes in what appears to be a television station vault. She shares her precious discovery with Cal, but he is upset by the risks she continually takes to help him. Frustrated by Cal’s reaction, Suki accepts Damien’s offer of a diner date. \n\nKurt and Cal go to the underworld, in an attempt to discover more about humanity’s past. While dining with Damien, Suki overhears that Cal and Kurt are in danger. She leaves her date abruptly to go help them. \n\nLater, the three friends screen the tapes and see scenes of beaches and forests and other natural wonders. The images are of such great beauty that the trio realize the earth before the great freeze was not only habitable but a paradise compared to the world they now inhabit.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Yana","credit_id":"5db36d3fd40d4c0014f89866","order":500,"adult":false,"gender":1,"id":180970,"known_for_department":"Acting","name":"Sarah Pratt","original_name":"Sarah Pratt","popularity":9.689,"profile_path":"/pjBBtQ5G7UmveVOVBt58yoqPMj2.jpg"}]},{"air_date":"2007-10-20","episode_number":5,"episode_type":"standard","id":380635,"name":"Chapter V","overview":"After Kurt‘s ID cards are discovered in the underworld, he is forced to choose between being arrested or joining the Pointsmen Academy. Over Cal's objections, he chooses the latter but promises to put it to good use. \n\nAs Kurt adapts to life as a Pointsmen he discovers that he actually likes it. He is a natural and enjoys being judged for his own accomplishments. In fact, he enjoys it so much that even after his mother petitions the Council to let Kurt out of the Academy, he chooses to stay. \n\nLiam convinces Cal to attend the Governor's Ball. Liam needs to prove his loyalty to the Council since the Pointsmen are increasingly suspicious of Cal. Cal agrees to go. He meets Kurt at the ball and realizes that Kurt has chosen the Pointsmen over his quest. \n\nCal and Suki kiss for the first time.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-10-27","episode_number":6,"episode_type":"standard","id":380637,"name":"Chapter VI","overview":"In the Pointsmen Academy train, brainwashing is used to make students forget their past and accept every aspect of the Pointsmen philosophy. Damien manipulates Kurt into destroying some famous artefacts to prove his loyalty to the Academy. \n\nCal and Suki are determined to find Kurt. On his way to the Academy train, Cal encounters a Man of the Cold. Cal joins the man in his refuge where he meets others of the group. Back on the Academy train, Cal convinces Kurt to leave and return to Grand Star. As they board the Ice Fox, they find Suki half frozen in the vehicle. \n\nKurt tells Palidor of Damien’s brainwashing methods; Palidor sanctions Damien.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-03","episode_number":7,"episode_type":"standard","id":380639,"name":"Chapter VII","overview":"Zel, a Man of the Cold, is captured. He is put on trial for a murder he did not commit. In a brief meeting with Zel, Cal realizes he has telepathic power. \n\nLiam seems to know Zel and takes on the challenge of defending him. Despite Liam's best efforts, Zel is convicted and sentenced to death. \n\nCal believes the verdict and sentence is unjust and helps Zel escape; in doing so he discovers that he and Zel may have more in common than he ever imagined..","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-10","episode_number":8,"episode_type":"standard","id":380640,"name":"Chapter VIII","overview":"Liam defies the authorities by driving the Pacific into a forbidden zone to meet the Renewer’s leader. Liam informs them that Palidor plans to shut down Grand Star, and asks their permission to reveal a geothermic source required for the construction of a new station. 30,000 people will die if this new station is not built in time. The Renewers refuse his request. \n\nLiam goes back and tries to convince Palidor to delay his plan; Palidor refuses. \n\nSuki is upset with Cal’s reaction towards her feelings. Liam and Tara are also having trouble communicating. Suki makes a final attempt to patch up things with Cal. Regretfully, she decides to go her own way.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-17","episode_number":9,"episode_type":"standard","id":380641,"name":"Chapter IX","overview":"Jonah shows up at Grand Star and pleads with Cal to find his parents who have been taken away by the Pointsmen. Cal feels guilty; he and Kurt try to find out what happened to them. \n\nAt Grand Star, power cuts are becoming more frequent. Palidor orders Damien to find out who is behind the power failures. \n\nLiam tries to convince Tara to vote against Palidor's proposal to evacuate Grand Star. Meanwhile Jonah falls under the spell of life on Grand Star, particularly the underworld and the black market. \n\nSuki’s attempt to get information on the whereabouts of Jonah’s parents is fruitful.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-11-24","episode_number":10,"episode_type":"standard","id":380642,"name":"Chapter X","overview":"Cal regains Suki’s trust. \n\nExploiting Kurt’s relationship with the younger Pointsmen, he and Cal enter the Prison Train. Jonah realizes how much he enjoys his new-found freedom and decides never to return to his village. Everyone tries to convince him otherwise. When his parents are finally released from prison, they blame Cal for their son’s decision. \n\nLiam worries that something may happen to him. Tara assures him that should anything happen to him, she will always be there for Cal. Palidor’s evacuation proposal is passed, but by very slim margin. He orders Damien to find out who his real opponents are.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Yana","credit_id":"5db36d3fd40d4c0014f89866","order":500,"adult":false,"gender":1,"id":180970,"known_for_department":"Acting","name":"Sarah Pratt","original_name":"Sarah Pratt","popularity":9.689,"profile_path":"/pjBBtQ5G7UmveVOVBt58yoqPMj2.jpg"}]},{"air_date":"2007-12-01","episode_number":11,"episode_type":"standard","id":380643,"name":"Chapter XI","overview":"After a ten year absence, Kurt's father Marcus returns to Grand Star. Kurt is troubled by his unexpected arrival. Palidor mandates his friend Marcus to investigate and identify his opponents on the Council during an evening organized by Damien at the Cabaret. Marcus initiates conversations with influential individuals about the sun, energy et cetera and then his assistants, wearing surveillance cameras, transmit the conversations directly to Palidor’s office. Cal and Kurt uncover his game and force Marcus to denounce Palidor. Because of his actions, Marcus decides to escape to the underworld.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-08","episode_number":12,"episode_type":"standard","id":380644,"name":"Chapter XII","overview":"The Cabaret is to leave Grand Star but Suki wants to stay behind with Cal. However Angelus, Suki’s owner, forces her to take care of a pair of orphans he recently acquired and out of concern for the young girls Suki decides she has to remain with the Cabaret. Damien is aware of Suki’s imminent departure, and asks Cal to convince her to stay. \n\nThe Pointsmen are on Marcus's trail. Marcus’s assistants beg Tara to help Marcus who is hiding in the underworld; Tara refuses. Kurt decides to help his father escape over the protests of his mother. \n\nAfter considering Damien’s offer, Cal enlists Damien's help to find a home for the two orphans so Suki will stay, and help Marcus escape.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-15","episode_number":13,"episode_type":"standard","id":380645,"name":"Chapter XIII","overview":"Grand Star is becoming a more and more expensive place to live, and life is becoming less and less pleasant. There are more power outages and shortages; necessities such as heat and light are scarce. Word spreads through the general population that life in Grand Star will change soon. \n\nSuki and Cal share a moment of tenderness, but she wants to explore her newfound freedom and does not want to rush into anything, and so she leaves for the underworld. In the underworld, Suki finds Jonah and his new friend Margot who are preparing to cut power to Grand Star. Suki hesitantly decides to join them. \n\nCal feels rejected by Suki’s sudden need for freedom; he does not know how to protect her without hurting her feelings. \n\nFollowing the suggestions of a Man of the Cold, Cal uses his powers to create a diversion which allows Margot’s plan to succeed. Later, Suki finds out about Cal’s involvement in the mission.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-22","episode_number":14,"episode_type":"standard","id":380647,"name":"Chapter XIV","overview":"Cal secretly leaves Grand Star in search of answers about his past. Everyone is worried about his disappearance. Through Yana, Jonah’s mother, Cal meets some People of the Cold and obtains valuable information about the Renewers. Cal is now convinced of their existence and is determined to take up their cause. \n\nPalidor throws an extravagant party which Margo and Kurt crash; they believe such an abundance of food should be shared with the underprivileged. \n\nCal’s outdoor suit is stolen. He crosses the icy landscape where Nara finds him in an early state of hypothermia. She carries him to her hut.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-12-29","episode_number":15,"episode_type":"standard","id":380648,"name":"Chapter XV","overview":"While a storm rages outsides Grand Star, Liam continues to worry about his son's whereabouts.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Yana","credit_id":"5db36d3fd40d4c0014f89866","order":500,"adult":false,"gender":1,"id":180970,"known_for_department":"Acting","name":"Sarah Pratt","original_name":"Sarah Pratt","popularity":9.689,"profile_path":"/pjBBtQ5G7UmveVOVBt58yoqPMj2.jpg"}]},{"air_date":"2008-01-05","episode_number":16,"episode_type":"standard","id":380649,"name":"Chapter XVI","overview":"There is turmoil in Grand Star when Palidor decides to evacuate the station and use a lottery to select those who get to leave for the safety of the new station.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-12","episode_number":17,"episode_type":"standard","id":380650,"name":"Chapter XVII","overview":"The Renewers are determined to blow up the new station despite the risk of death for millions of innocent people. Liam is determined to intervene.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-19","episode_number":18,"episode_type":"standard","id":380651,"name":"Chapter XVIII","overview":"Palidor learns of the existence of the Polar Station and its geothermal resources. He sends Damien and Cal to convince the people of Polar Station to share their energy.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-01-26","episode_number":19,"episode_type":"standard","id":380652,"name":"Chapter XIX","overview":"Damien is captured by the People of the Cold and put on trial. Cal learns more about his past.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-02","episode_number":20,"episode_type":"standard","id":380653,"name":"Chapter XX","overview":"Suki tells the Council about the lives of the youth in Grand Star. Cal recounts his personal experiences.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-09","episode_number":21,"episode_type":"standard","id":380655,"name":"Chapter XXI","overview":"Cal learns a hidden truth about his father which he believes may have motivated Palidor to have Liam killed.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-16","episode_number":22,"episode_type":"standard","id":380656,"name":"Chapter XXII","overview":"Palidor selects Nara as the unwilling gene donor for his experiment.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-02-23","episode_number":23,"episode_type":"standard","id":380657,"name":"Chapter XXIII","overview":"Cal and his friends take desperate measures to discover Liam's whereabouts.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-01","episode_number":24,"episode_type":"standard","id":380658,"name":"Chapter XXIV","overview":"Damien offers Suki a deal: her testimony about Palidor’s mental illness in exchange for Liam’s freedom.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-08","episode_number":25,"episode_type":"standard","id":380659,"name":"Chapter XXV","overview":"Palidor's leadership is challenged. Cal has valuable information for the Renewers.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-15","episode_number":26,"episode_type":"finale","id":380660,"name":"Chapter XXVI","overview":"Cal learns the full truth about his parentage. Despite the urgency of the situation, the Renewers debate when to fire the canon.","production_code":"","runtime":30,"season_number":1,"show_id":6750,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":17012,"poster_path":"/hK2uptIoFp4onzInig9z39Wc36f.jpg","season_number":1,"vote_average":0}}}