{"adult":false,"backdrop_path":"/oATjBlJIxSfpEcKA1KVUrsWTZpl.jpg","created_by":[{"id":3949705,"credit_id":"641429bbb4224241ac5ecfa3","name":"BitterSweet","gender":0,"profile_path":"/5Q60hoAzuImBkF0xH06RxlYjlIO.jpg"}],"episode_run_time":[45],"first_air_date":"2016-08-20","genres":[{"id":18,"name":"Drama"}],"homepage":"https://web.archive.org/web/20190830150145/http://gmm25.com/program/detail/sotusstheseries","id":67506,"in_production":false,"languages":["th"],"last_air_date":"2018-03-10","last_episode_to_air":{"id":1543975,"name":"Episode 13","overview":"","vote_average":0,"vote_count":0,"air_date":"2018-03-10","episode_number":13,"episode_type":"standard","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/7lXseRJBqz97bB33rdk2mc8CQI3.jpg"},"name":"SOTUS","next_episode_to_air":null,"networks":[{"id":247,"logo_path":"/9Ga8A5QegQmiSVHp4hyusfMfpVk.png","name":"YouTube","origin_country":""},{"id":1671,"logo_path":"/eBK2WsrRlpmLpyoeR09I6fDRJie.png","name":"LINE TV","origin_country":"TH"},{"id":1784,"logo_path":"/cxBpog9yHJTIclmGsojZC7tqwlH.png","name":"ONE 31","origin_country":"TH"}],"number_of_episodes":28,"number_of_seasons":2,"origin_country":["TH"],"original_language":"th","original_name":"โซตัสเอสเดอะซีรีส์","overview":"Freshmen students are practically powerless to complain or resist any orders given by their seniors. Arthit was seemingly unstoppable, until Kongpob stood up against the abuses by the former. Continual encounters between the two developed from animosity to something much more affectionate.","popularity":11.861,"poster_path":"/AkHBuIhXKTllmReKonkfacjbNLJ.jpg","production_companies":[{"id":139247,"logo_path":"/zX5hXwBnYkGpB99x1rtLYyszoFZ.png","name":"GMMTV","origin_country":"TH"},{"id":149997,"logo_path":"/l5QY6IhG9M4iNJusu2L6tJLWgN1.png","name":"ONE31","origin_country":"TH"}],"production_countries":[{"iso_3166_1":"TH","name":"Thailand"}],"seasons":[{"air_date":"2016-08-20","episode_count":15,"id":79414,"name":"Season 1","overview":"The \"Gear\" is the symbol of the Faculty of Engineering. It's part of a system of cogwheels which power and run a device. If one gear fails, the device stops working. In order to get this gear, all engineering freshmen must first undergo the SOTUS (Seniority, Order, Tradition, Unity, and Spirit) system. Third year senior student, Arthit is the head hazer who leads the hazing team in disciplining the freshmen students by following the code of the SOTUS system. His methods were misunderstood by the students as a form of abusing his power as head hazer when in fact all he wanted is for the freshmen to get to know their seniors, rely on them when they need to and vice versa. Arthit was seemingly unstoppable, until Kongphop stood up against him. This initially resulted in a strained relationship between Kongphop and Arthit. However, continuous encounters between the two helped transform their relationship into something much more affectionate.","poster_path":"/9PYsSvGchuGDAAZ6zirKE3iECI1.jpg","season_number":1,"vote_average":0},{"air_date":"2017-12-10","episode_count":13,"id":89458,"name":"Season 2","overview":"Fast forward 2 years later, Kongpob is now the head hazer in his faculty, while Arthit works at the Ocean Electric Company. During Kongpob's final year, he needs to find an internship company, and requests to work alongside Arthit over his family's company, which unbeknownst to Arthit. After an outing with the company, tensions rise between the two, and both will have to decide their future. Will Arthit and Kongpob remain as a couple?","poster_path":"/zQRgG9M8MGxXt32L5rtalVlwPDs.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"Thai","iso_639_1":"th","name":"ภาษาไทย"}],"status":"Ended","tagline":"A secret that dares to tell anyone  how much we love each other.","type":"Scripted","vote_average":6.5,"vote_count":27,"season_data":{"1":{"_id":"57b90de09251413f570022e4","air_date":"2016-08-20","episodes":[{"air_date":"2016-08-20","episode_number":1,"episode_type":"standard","id":1216359,"name":"Episode 1","overview":"The happy atmosphere of the freshmen orientation was quickly cut short after a group of 3rd year seniors led by Arthit barge in to explain its faculty rule and the SOTUS system. terrified the freshmen on their very first day, after Arthit and his gang spoke rudely. Kongpob who is the first to stand out amongst his peers was quickly targeted to several punishments hauled by Arthit for requesting to extend a task involving the freshmen in collecting 1,000 signatures within a week, including one involving him standing on top of a table and shout \"I Like Men\" and finding 10 guys to be his boyfriend. During the first meeting with the 3rd year seniors, Kongpob was once again the target victim after the latter failed to answer how many students were there in their cohort and were further quizzed on how is he able to do get hold of the gear badge. but Kongpob answered that he would make Arthit his lover, then he would be able to get hold of the badge. During the next meeting, Kongpob was once again a victim, and to everyone's surprise Kongpob agrees to a 54 lap run, after 54 of their peers failed to show up at the meeting, since he gave his to Arthit, and required some to be replace, the 54 hearts was replaced just in time. But Kongpob was stopped by one of the sophomore during his 7th lap, and Arthit belittle Kongpob by saying he does not practice what he preach.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/791EVTob3NC9vEIJzytQcw1S1kj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-08-27","episode_number":2,"episode_type":"standard","id":1217580,"name":"Episode 2","overview":"The sophomores and the 3rd year seniors gathered to discuss on how to further improve their relationship with the freshmen. Arthit and his gang challenged Kongpob, Em, Oak and Tew to a liquor fight, making them drunk in the process. Prem displeasure of Wad's for not greeting the senior caused a tension between the two. Causing the 4th year seniors to step in. May's name tag was torn by Arthit after Kongpob failed to answer Arthit's question. Resulting Kongpob passing his name tag to May, and cause Arthit to be unhappy. Meanwhile Kongpob receives a new name tag at his locker (presumably given by Arthit) the next day. Casualties were seen during the freshmen meeting where one of Kongpob peers fainted and Em injuring his ankle. Arthit then belittle Kongpob that he will not win in the Mr & Miss Faculty competition and passed Kongpob and Em some fruits, after Kongpob helped Em to the sick bay. Kongpob discovers that Arthit and his gang was disciplined by the 4th year seniors in the middle of the night after Em accidentally left his notes at the classroom and needs to go retrieve it. Kongpob surprised Arthit and said that his fierce face was cute making the former both happy and angry.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/2ZdNKGh0Yef5weEPrpCUgLC3M2E.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-03","episode_number":3,"episode_type":"standard","id":1217874,"name":"Episode 3","overview":"Kongpob was punished by Arthit for being a hero after the former tried to replace the sophomore in the cheerleading. And quizzed Arthit on his true intentions on why he kept on punishing him. Arthit dismissed the claim that Kongpob have a crush on him. Kongpob met up with the now sophomore Bem who carries the ID number 0062 by passing him some of the old notes that she has. Tew became the designated candidate to help the 3rd year seniors after the meeting was pushed forward, since Kongpob couldn't make it due to him already committed to the Mr & Miss Faculty competition. Kongpob was then informed by 3rd year senior Minnie that Arthit were disciplined for abusing his powers on the freshmen. Knowing that Kongpob couldn't take chilies, Arthit made Kongpob in reciting a poem and eating a plate of rice full of chilies at the eatery, after Kongpob teased Arthit on his beverage preference (which was strawberry milk). But was surprised to find out that Arthit has paid for both of his meal and his drink. Kongpob then requested for a strawberry milk.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/xBkGlOrWUsWeWOTFpkBIk1we1VH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-10","episode_number":4,"episode_type":"standard","id":1220146,"name":"Episode 4","overview":"Wad joins Em and Kongpob in the basketball competition after an altercation between him and Prem. Em finally has his personal time with May after May's face was stained with paint after doing a piece of artwork for the upcoming competition, which Em offers to clean. The engineering faculty wins it's basketball tournament after Kongpob replaces a teammate at the final minutes. Kongpob made a prize deal with Arthit if the latter wins the upcoming Mr & Miss Faculty competition, after Kongpob informs Arthit that they have made it to the finals.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/2sal4ePk9z6ZQfOgkO5Y1IHERza.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-17","episode_number":5,"episode_type":"standard","id":1220147,"name":"Episode 5","overview":"Praepailin wins the Popular Vote, while Kongpob became both the overall champion and the Popular Vote winner in the Mr & Miss Faculty competition, a first for the event since its beginning since the seniors years. Kongpob told Arthit that he would hold off the prize thought once he needs it someday, since both of them had made the deal earlier on. During the party May asked Em questions about Kongpob. The 4th year seniors congratulated the freshmen on a job well done and punished Arthit and his gang for abusing their powers, Arthit then performs 100 sets each of 3 different punishment with his peers, including a 54 lap run which Arthit requested to be done by himself.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/cFYFagVKbM1wJguOBARE2Krl6Hk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-09-24","episode_number":6,"episode_type":"standard","id":1226013,"name":"Episode 6","overview":"Kongpob bumped into Bem his sophomore senior at the library after the discussion between Oak, Em and Kongpob was cut short. During the night, Kongpob receives a phone call that Arthit is still out running under the rain after grabbing some food. Kongpob rushed to the track on his scooter and attempts to stop Arthit, but was scolded by Arthit and Knot. Seating at the bench feeling worried, he joined May, Praepailin and Ma-prang in observing on how Arthit's punishment unfolds. Cheers were heard at the sidelines as Arthit finishes his final lap, but trips just yards away, but he manages to finish it nonetheless. Arthit was then carried back to his dorm drenched, leaving a sadden Kongpob. The next day, Arthit receives a call from the 4th year senior and Prem helped Arthit to get some food, as the ill Arthit whom is resting, but passed the food and Arthit's favorite strawberry milk to Kongpob as he needs to rush off to meet the school's advisor to discuss the freshmen's outing. Kongpob surprised Arthit at his dorm, and helps him with his medications and ironing his clothes, which Arthit forbids him in doing, as Kongpob was collecting Arthit's clothes, he catches a glimpse to his own room and wonders how it's like to be in Arthit's room. Prem rescued Wad after he was outnumbered by the losers team from the basketball competition. Knot informed the freshmen that all freshmen outing is cancelled with immediate effect. Oak and his gang was shocked to see Wad's injuries while Arthit and his gang discussed on how to improve the outing. Bem introduces Kongpob the seniors whom shares the same faculty ID but bumped onto Arthit whom joins the party, Kongpob also found out Arthit's nickname and his student ID (0206) and teased him.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/pf9Ea8uPTbRL0Cajux6O73c700w.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-01","episode_number":7,"episode_type":"standard","id":1228270,"name":"Episode 7","overview":"During the dinner meet up with Bem and Arthit, Kongpob shared to the team that originally he wanted to study Economics, but somehow his mother asked him to study Engineering instead, this caused Arthit to prepare his next launch of attacks toward Kongpob, however during the capture the flag crermony, Kongpob strategy worked as his quick thinking helped the freshmen capture the flag, including 1 inviting the 4th year senior to witness and to help them, and after capturing the flag, Arthit cried as he was moved by what Kongpob did during the 5th and last stage of the event.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/h6AXfGsRsdhg1plkLMZLcOdXqEX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-08","episode_number":8,"episode_type":"standard","id":1229642,"name":"Episode 8","overview":"Wad tries to skip a ceremony, but was stopped by the seniors, Prem apologizes to Wad for being rude previously. The club advisor endorses the approval of the beach activity after Arthit explanation. The freshmen join the seniors at the beach after the capture the flag ceremony, Kongpob continues to challenge Arthit, and was told to cool off in the sea, but was later saved by Arthit who was worried that the latter had drowned. Kongpob and his friends celebrated the event by drinking alcohol, but was found out by Arthit whom left angrily. During a skit, Arthit childed the actors for reenacting a scene of Arthit pulling Kongpob shirt from Day 1, later a video of confessions lit the room and the freshmen participate in the Walk the Bridge activity, whom all received the gear badge by their 4th year senior. Kongpob gave his gear badge to Arthit but was given a cup of beer in return at the beach.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/qBuUF9KBDgKPd4Iza4dAKGAt0sZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-19","episode_number":9,"episode_type":"standard","id":1241422,"name":"Episode 9","overview":"While at the beach, Kongpob gave Arthit his gear badge to take care, which sparked some anger from Arthit, Kongpob told Arthit to check with Dear what the meaning is, and also asked for the prize bet which Arthit lost to Kongpob, in returning asking Arthit for his number. Aim and May bonded while having a stroll along the beach. When Arthit asked Dear the true meaning of the gear badge, he was almost choked to death. While on the way back to the campus, Kongpob continued to teased Arthit in buying him his favorite strawberry milk. The next day Arthit met up with Kongpob to help Kongpob in getting a birthday gift for his niece, who is just 3 years old. Kongpob shared some of his family background to Arthit, and accidentally bumped into Namtarn, Arthit's first crush and long time friend since high school. Both later checked into a noodle house where Arthit again switches his meal with Kongpob (with good reasons). And Arthit went to have a haircut, which later shocked Kongpob, with the hairdresser teasing that both are a couple.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/iq4Jt00XS5t3IcqsWhv6PNFBCi9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-26","episode_number":10,"episode_type":"standard","id":1241866,"name":"Episode 10","overview":"Arthit and Kong returned to the dorm after their first date, Kongpob forgot to return a document belonging to Arthit and called him, however the call was cut short when Kong heard there sounds to be an emergency coming from Arthit's dorm and rushes over. Kong then helps Arthit to clean up the room, and suggest to Arthit to stay over at his dorm that night, after which Arthit moves over to Kong's room. When Arthit reaches Kong's dorm, Kong gets Arthit supper and even his favorite pink milk, he realizes that his room is just the opposite of Kong, and chided Kong for not telling him, and even asked Kong whether he has feelings for him. Kong suppressed his feelings for Arthit, but during their sleep, Kong chanced the opportunity to confess his true feelings for Arthit, however Arthit wasn't asleep. During day break, Arthit wakes up, and chatted with Kong for a while, and heads to the restroom, and reminded himself to be firm, and just when he comes out, Kong handed him a cup of water, and accidentally smashes it, as Arthit wasn't focusing well. Kong answers to a call, but somehow Arthit rushes out. At the dorm, Kong tried to call Arthit, but the latter just won't answer, and hence decided to WhatsApp him, but their conversation did not continue long, and Kong rushes to find Arthit, but bumped into Preapailin, May and Ma-prang. And Kong even rushed off during a conversation with Aim. Kong bumped onto Knott and the gang, but they do not know where Arthit is, and when Arthit joins them at their table for their homework session, he had trouble concentration and even took longer time to answer a questionaire given by his juniors (whom is going around asking for surveys). Kong went to find Arthit at the computer room, and out of sudden treated Kong with no respect, when Kong did not hand over his notes to him, which left on Kong's dorm freezer the night before.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/fiSlmrcY6btYlChNvkZCf2DhVoS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-03","episode_number":11,"episode_type":"standard","id":1243845,"name":"Episode 11","overview":"Arthit started to ignore Kongpob, when the latter attempts to return the notes to him, and Arthit was scolded by Knott for ignoring Kongpob. Namtarn meets up with Arthit for relationship advice and informs him that Joy their mutual friend likes Kongpob. Upon hearing this, Arthit heart sank, but Arthit revealed lots of information to Namtarn about Kongpob. Namtarn was surprised that Arthit knew so much about Kongpob. To help settle some ease with Kongpob, Arthit decides to give Kongpob a call, since he has been calling him the entire day, but their conversation was cut short when Kongpob addressed about his feelings to his senior for the second time, leading them tearing up in their separate rooms. Unable to stand the stress, Kongpob then removed the white thread tied by Arthit during the \"Capture the Flag\" ceremony from his wrist. May receives a call from Ma-prang, and the duo went ahead on their gossip session. The next day, Kongpob prepares for school, but he was listless, this was noticed by Arthit. Kongpob enters the cheer room but scenes of him and Arthit lit up the room.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/mmM47x1uzuWHCqK3ODZ8EpZR0Yd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-10","episode_number":12,"episode_type":"standard","id":1244525,"name":"Episode 12","overview":"At the library, Kongpob receives a call from P'Bem, when his mind is wavered, until Em wakes him up, after the call, Kongpob bumps onto Knott, then passed him Arthit notes. Preapailin, May and Ma-prang having a discussion nearby. Oak disturbs Em, while Kongpob helps May to pick up a book. Kongpob leaves, while Oak was abit upset. Prem met up with Arthit, while somehow Prem notices that Arthit is emotionally down, Knott then passes his notes back to Arthit, even Knott notices and talked about the recent changes of Arthit, Arthit feels that his drink is abit not good. Em talks to Kongpob while Oak is playing his soccer. the discussion between the 2 is about who likes who. While the boys play their soccer, their ball knocked down May whom is on her bicycle, Kongpob rushed to her aid and bring her to the nurses station on May's bike, making May very happy. While at the hospital, Kong helps May by applying an ice pack over her swollen foot, however while standing May loses her balance, while Kong catches her. May then confessed her feelings for Kong, while Em listens the conversation outside the room, Kong rejects May, telling her that he already has someone in mind (Arthit), making May very upset, May leaves the room dejected, while Em watches on with a sad look. May removes her bangles from her hand with Em sitting beside her, May cries. Em confesses his feelings for May. After their confiding with each other, May finally lit with a smile. Arthit returns to his dorm after a long day, and catches a glimpse of his photo with Namtarn and Kongpob room which is opposite of his, and lastly the gear Kong passed to Arthit for safekeeping (a flashback showing Kong handling his gear to Arthit). Kong buys strawberry milk at the drinks stall, and bumps onto Arthit, he then offers Arthit the last glass of the pink milk.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/P6JwKUWt3LRM9LYhE2cnadT4NW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-17","episode_number":13,"episode_type":"standard","id":1248024,"name":"Episode 13","overview":"Arthit and his group of hazers gathered at the library to revise for their exams, and discussed on how to get to Tum and Phone's wedding the next day. The next day, Knott picked Arthit and Bem picks Kongpob to the wedding, Bem shares that she used to date Bright, who is a senior and Arthit's friend, which kinda surprised Kongpob. Upon reaching the wedding ceremony, Kongpob discovers Arthit being uncomfortable, and tells him to be himself and not give him any more hope. When the wedding is over, Arthit went to find Tum and gave him the wedding greeting card that he and Kongpob picked up a week ago, and asked Tum for relationship advises. When Arthit knows what he wants, he rushed out to find Kongpob, and tells him that he is hungry and wanted Kongpob to follow him to get some food, leaving Kongpob confused on this sudden movement. After the meal, both walked to a nearby bridge, where Arthit quizzes Kongpob on all his weaknesses and asked him whether or not he would still like to be with him, and when Kongpob replied with a positive answer, Arthit pulled Kongpob and both engaged with a kiss, giving Kongpob the answer that he has been longing for. Next day, Kongpob shocked Arthit that he wanted to be the head hazer, after knowing that their faculty had the least amount of failures and had the highest scores. That night, Arthit ordered Kongpob's favorite iced coffee and egg omelette with ground pork rice, while Kongpob ordered Arthit's favorite pink milk.\n\nNote: This marks the end of the actual novel by BitterSweet.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/lFeSKv9qB75cJ4x2teQHYpJeIsO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-24","episode_number":14,"episode_type":"standard","id":1249808,"name":"Episode 14","overview":"Special Chapter 1: While meeting at the school, Bright plan of letting the freshmen buying a gift was dashed as Prem reveals everything, and Arthit asked Kongpob out for a date. During the date, Kongpob was informed by Arthit that Phone is 2 months pregnant and has no idea what to get for her and Tum, their senior and later Kongpob shared that he wishes to have s son if he were to get married. Kongpob and Arthit later bumped onto Preapailin, but Arthit starts to get jealous, and wonders if his relationship with Kongpob will not help Kongpob in getting the son that he longs for, besides that Preapailin is pretty. Back at school, Kongpob was brushed off by Arthit after the latter dropped a pen, and Bright erotic behavior continues. During their meet up, Knott noticed that Arthit mind was elsewhere and asked him for the reason, and Arthit shares with Knott on his relationship issues with Kongpob while Knott listens. During the \"Thank The Seniors\" party, Arthit brought gifts for everyone and helped Kongpob in removing the white thread and replaced with the couple brown bracelet, while Kongpob gave Arthit a handwritten letter, later the 2 informs everyone that they are an item now. Kongpob and Arthit later confessed to each other and have their second kiss and also cleared any doubts on who loves Preapailin, which Kongpob told Arthit about her being a lesbian. Back at Kongpob's dorm, Kongpob told the forgotten Arthit that the 2 met the year before, when Kongpob whom is graduated from high school is about to select the field for the University, and met Arthit who explain on the stuffs at Industrial Engineering, which makes Kongpob decision on choosing Industrial Engineering over Economics, which Kongpob wanted to choose originally.","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/k3Futyy9ph9PDAGjHoEgb3QAEK3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-31","episode_number":15,"episode_type":"finale","id":1249809,"name":"Episode 15","overview":"Special Chapter 2: 2 years ago, Arthit and his gang went for their first cheer activity, and was stunned by the attitude given by Tum, later Arthit was scolded by Tum to go bow a tree for not being attentive, and Knott tries to protect Arthit and out of anger wanted to punch Tum, but was controlled by Arthit. 3 hours later while walking back to his dorm, Tum notices Arthit and feels that he could be his successor after having a chat with him. In the current time, Arthit asked Kongpob on his intentions on being the head hazer 2 years later, which Kongpob nodded with agreement. 2 years later, Kongpob climbs to the role of the head hazer, with Em, Tew, Wad, Oak and Dee as his assistants, and Kongpob taught the new freshmen the faculty song and his punishments impressed the fellow freshmen and Arthit praised Kongpob on the strategy that worked out for him, and said that the attendance rate was the best of so many years. Arthit went back to collect his transcript and met up with his club advisor, and asked Arthit to pass a message to Kongpob to advise the freshmen to be on time for their cheer meetings. After their dinner, Kongpob manages to keep Arthit to stay with him for the night, and ends with the meaning of SOTUS (Story Of True love between US).","production_code":"","runtime":45,"season_number":1,"show_id":67506,"still_path":"/iIfCHz3zi4VAWrTs6upBQGqgoWO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"The \"Gear\" is the symbol of the Faculty of Engineering. It's part of a system of cogwheels which power and run a device. If one gear fails, the device stops working. In order to get this gear, all engineering freshmen must first undergo the SOTUS (Seniority, Order, Tradition, Unity, and Spirit) system. Third year senior student, Arthit is the head hazer who leads the hazing team in disciplining the freshmen students by following the code of the SOTUS system. His methods were misunderstood by the students as a form of abusing his power as head hazer when in fact all he wanted is for the freshmen to get to know their seniors, rely on them when they need to and vice versa. Arthit was seemingly unstoppable, until Kongphop stood up against him. This initially resulted in a strained relationship between Kongphop and Arthit. However, continuous encounters between the two helped transform their relationship into something much more affectionate.","id":79414,"poster_path":"/9PYsSvGchuGDAAZ6zirKE3iECI1.jpg","season_number":1,"vote_average":0},"2":{"_id":"593fdb1ac3a368149d000213","air_date":"2017-12-10","episodes":[{"air_date":"2017-12-09","episode_number":1,"episode_type":"standard","id":1403323,"name":"Episode 1","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/k112CE9EgCLTUKx0Xnev7QmerG2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-16","episode_number":2,"episode_type":"standard","id":1403324,"name":"Episode 2","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/yKHJZrr373VnyNgCKZLZwRoYawu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-23","episode_number":3,"episode_type":"standard","id":1403325,"name":"Episode 3","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/fuOZCr5MpaHSoDHzlFPL8GuLuv5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-06","episode_number":4,"episode_type":"standard","id":1403326,"name":"Episode 4","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/kCKWUAciUgyi60ptnX5Wyk5DOti.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-13","episode_number":5,"episode_type":"standard","id":1403327,"name":"Episode 5","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/vrppT3un7USezY86e9WOfYy5rs3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-20","episode_number":6,"episode_type":"standard","id":1403328,"name":"Episode 6","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/37yIo35IG4Iq6mE8LeNTCptltpE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-27","episode_number":7,"episode_type":"standard","id":1403329,"name":"Episode 7","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/radt2ORzx7fgZW4slEHRhOwU01J.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-02-03","episode_number":8,"episode_type":"standard","id":1403330,"name":"Episode 8","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/uQF025DI2Ku6QjOGacu7t6tVrCy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-02-10","episode_number":9,"episode_type":"standard","id":1403331,"name":"Episode 9","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/oUGS8AOT2ztBksfLqzaZTFCXca8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-02-17","episode_number":10,"episode_type":"standard","id":1403332,"name":"Episode 10","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/eVUZnnb9r5fJqmOzqVoHYtm7iPN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-02-24","episode_number":11,"episode_type":"standard","id":1543972,"name":"Episode 11","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/deRTKjplelQCp5J7qT4ofxeXezp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-03","episode_number":12,"episode_type":"standard","id":1543974,"name":"Episode 12","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/semrMQQANUzgjqWVAG9rtLIJaiv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-10","episode_number":13,"episode_type":"standard","id":1543975,"name":"Episode 13","overview":"","production_code":"","runtime":45,"season_number":2,"show_id":67506,"still_path":"/7lXseRJBqz97bB33rdk2mc8CQI3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"Fast forward 2 years later, Kongpob is now the head hazer in his faculty, while Arthit works at the Ocean Electric Company. During Kongpob's final year, he needs to find an internship company, and requests to work alongside Arthit over his family's company, which unbeknownst to Arthit. After an outing with the company, tensions rise between the two, and both will have to decide their future. Will Arthit and Kongpob remain as a couple?","id":89458,"poster_path":"/zQRgG9M8MGxXt32L5rtalVlwPDs.jpg","season_number":2,"vote_average":0}}}