{"adult":false,"backdrop_path":"/44ddp3wBfuCClYnLMAY24eN5XPh.jpg","created_by":[{"id":1424645,"credit_id":"54d7536c92514153b5002346","name":"Bevan Lee","gender":0,"profile_path":null}],"episode_run_time":[60,42],"first_air_date":"2008-08-26","genres":[{"id":18,"name":"Drama"},{"id":35,"name":"Comedy"}],"homepage":"http://au.tv.yahoo.com/b/packed-to-the-rafters/","id":6754,"in_production":false,"languages":["en"],"last_air_date":"2013-07-02","last_episode_to_air":{"id":380887,"name":"Packing Up the Rafters","overview":"The Rafters begin the emotional task of packing up their beloved family home. But is moving into a small, unappealing rental townhouse their only option? Dave suggests they put their stuff in storage and take Ruby and go travelling instead. Nathan and Ben think it's a great idea, but Julie won't hear of it, unwilling to leave Ted. An impromptu party is organised, with everyone gathered to farewell the house. Even Rachel and Jake make a special appearance. During the party, Ted gives Julie a priceless emotional gift, allowing her to move on. Family and friends gather to farewell the Rafters, presenting them with a moving video tribute organized by Carbo. It is obvious they will be sadly missed — but everyone is rightfully excited about the possibilities the future holds.","vote_average":0,"vote_count":0,"air_date":"2013-07-02","episode_number":12,"episode_type":"finale","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/g4GvN2HmknoWRMaDPWaX6eIA7YN.jpg"},"name":"Packed to the Rafters","next_episode_to_air":null,"networks":[{"id":118,"logo_path":"/83L2wF8tM76nUQHzOBOBAGlPQVP.png","name":"Seven Network","origin_country":"AU"}],"number_of_episodes":122,"number_of_seasons":6,"origin_country":["AU"],"original_language":"en","original_name":"Packed to the Rafters","overview":"Packed to the Rafters is an Australian family-oriented television series which premiered on the Seven Network on Tuesday 26 August 2008 at 8:30 pm. The show has continued on Tuesdays in this timeslot for its entire run. The drama series features a mix of lighthearted comedy woven through the plot. It revolves around the Rafter family facing work pressures and life issues, whilst also tackling serious social issues. The Logie award winning series was the highest rating to screen on the Seven Network in 2008, and the show has consistently been among the top 5 shows of the year throughout its run in Australia.\n\nIt was announced in TV Week that the sixth season of Packed to the Rafters would be the last, with Hugh Sheridan stating: \"It's emotional letting go of Rafters – for all of us. It was such an amazing chapter in Aussie TV. I'm really proud we all came back together to send it off.\" The two-hour series finale of Rafters aired on 2 July 2013, which saw the return of Hugh Sheridan, Jessica Marais, Ryan Corr, Jessica McNamee and James Stewart. Rebecca Gibney said, \"The cast, writers and producers have always said that we wanted to keep Rafters as one of the most-watched shows on TV. If we ever felt like we were losing too many cast members, we needed to end it on a high. We can say season six winds up an aspect of the Rafter family and there is a sense of finality to it.\"","popularity":80.127,"poster_path":"/ux0DKkr9MFJzdAxYyigRwxyRUm8.jpg","production_companies":[{"id":14604,"logo_path":"/nayCQwYiu9QfYn1IprLuo48d8q5.png","name":"Spectrum Films","origin_country":"AU"}],"production_countries":[{"iso_3166_1":"AU","name":"Australia"}],"seasons":[{"air_date":null,"episode_count":1,"id":17018,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2008-08-26","episode_count":22,"id":17014,"name":"Season 1","overview":"The first season of Packed to the Rafters, an Australian drama television series, began airing on 26 August 2008 on the Seven Network. The season concluded on 24 March 2009 after 22 episodes. The first season aired Tuesdays at 8:30 pm in Australia and averaged 1,904,364 viewers. The season was released on DVD as a six disc set under the title of Packed to the Rafters: The Complete Season 1 on 2 December 2009.\n\nThe first season begins as Julie and Dave Rafter are over the moon when their last remaining child finally leaves home. But what happens when the rest of the family suddenly returns to the next? Less than 48 hours after their middle son Ben moves himself next door, all dreams of freedom are put on hold as one by one their youngest son Nathan and his princess wife Sammy, their troubled eldest daughter Rachel, and Julie's emotionally vulnerable father Ted all return to the family home. Plenty of drama, lots of laughs and a few tears ensue as the Rafters must learn to live under the same roof once again.","poster_path":"/xE0wDLlfCAzonHntvWbWaSvZuy3.jpg","season_number":1,"vote_average":7},{"air_date":"2009-06-30","episode_count":22,"id":17015,"name":"Season 2","overview":"The second season of Packed to the Rafters, an Australian drama television series, began airing on 30 June 2009 on the Seven Network. The season concluded on 24 November 2009 after 22 episodes. The second season aired Tuesdays at 8:30 pm in Australia and averaged 1,881,000 viewers. The season was released on DVD as a six disc set under the title of Packed to the Rafters: The Complete Season 2 on 3 November 2010.\n\nThe second season follows Julie and Dave Rafter through comic highs and soul-searching lows as they prepare for the unplanned but no-less welcome addition to their family of their new baby. We also explore the heart warming arrival into the Rafters world of Dave's birth mother Chel, opening in the process the door to further family revelations. We follow the tumultuous upheavals in the lives of all three Rafter children. Rachel embarks on a promising if-at-first feisty relationship with the cute young electrician who's begun working with her dad. Ben continues his determined pursuit of housemate Melissa's hand in marriage. Nathan, in seeking new career challenges in the music business, struggles to resist strong temptations that may well signal the end of his young marriage.","poster_path":"/4Zs31ohC4R65g8Lu0rCayUkWPPh.jpg","season_number":2,"vote_average":7.1},{"air_date":"2010-06-29","episode_count":22,"id":17016,"name":"Season 3","overview":"The third season of Packed to the Rafters, an Australian drama television series, began airing on 29 June 2010 on the Seven Network. The season concluded on 16 November 2010 after 22 episodes. The third season aired Tuesdays at 8:30 pm in Australia and averaged 1,894,000 viewers. The season was released on DVD as a six disc set under the title of Packed to the Rafters: The Complete Season 3 on 20 April 2011.\n\nThe third season follows the Rafters as they adjust to life with a new baby and face their toughest test yet, the sudden and tragic loss of a loved one. For Julie and Dave, there's the financial stress of being a one-income family, the sense of being pulled in a hundred directions by the needs of their adult children, and the strain placed on their marriage as the stress and exhaustion of caring for a baby takes hold. Rachel, the eldest Rafter child, struggles to find balance between her high-flying new job and her relationship with Jake; Ben, recently and blissfully married to Melissa, is trying for kids until a heartbreaking accident shatters his world; and Nathan is agonisingly estranged and ultimately divorced from his wife Sammy. Add to the mix, new family members Coby and Dave's father, Tom, and life for the Rafters has never been more packed.","poster_path":"/syraQL0lIMliQKKcDkL031tiW6v.jpg","season_number":3,"vote_average":7.3},{"air_date":"2011-02-08","episode_count":22,"id":17017,"name":"Season 4","overview":"The fourth season of Packed to the Rafters, an Australian drama television series, began on 8 February 2011 on the Seven Network. The season concluded on 20 March 2012 after 22 episodes.\n\nSeason four traces the family's fortunes as they attempt to rebuild their lives in the aftermath of Melissa's death. Strong family bonds ensure that traumatised Ben receives warm support as he takes his first steps back into the work-force. Slowly he learns to smile again, embracing a newfound interest in gardening and a growing friendship with his boss's daughter Emma, which might hold the promise of something more. There are further love issues in the Karandonis household, with Carbo and Retta choosing to elope rather than face the comic extravagance of a Karandonis wedding. Julie and Dave, meanwhile, are forced to deal with the consequences for Rachel and Jake of a dangerous accusation flung at him by a drunken woman on a rugby weekend away. Rachel's feelings for Jake are tested to the limit, especially when her boss throws into the confusing mix the chance of a lifetime to work in New York. The Rafters also wrestle with the unexpected arrival of new family members, not the least being the release from prison of Dave's father, Tom. Tom's never quite predictable manipulations ultimately force Dave to take a heart-breaking stand, and cause him to initially misjudge the intentions of his half-brother, Matt. Julie meanwhile finds a new best friend in Donna, though their initial exchanges are hilariously unpromising. Meanwhile Nathan is searching for new direction in his life and his desire to travel forces Julie and Dave to undertake some soul-searching of their own. Ted is also keen to find a greater purpose, mentoring a troubled twelve-year-old boy.","poster_path":"/nrdWk3UgtOMGpZbCCRwUZtPq7FJ.jpg","season_number":4,"vote_average":7.2},{"air_date":"2012-04-17","episode_count":22,"id":17019,"name":"Season 5","overview":"The fifth season of Packed to the Rafters, an Australian drama television series premiered on 17 April 2012 on the Seven Network. 22 episodes have been ordered for Season five. The Seven network put the series on hiatus again on June 19, 2012 after 10 episodes, despite previously promising that viewers would see a full season run. The show returned on 29 January 2013 with episode 11, accompanied by an increase in viewers compared to previous episodes of the season.","poster_path":"/nKNmz6nVaVJ26ZFIVqSDqKAHxv7.jpg","season_number":5,"vote_average":0},{"air_date":"2013-04-23","episode_count":12,"id":17020,"name":"Season 6","overview":"The sixth and final season of Packed to the Rafters, an Australian television drama series, premiered on 23 April 2013 on the Seven Network. The series will be made up of 12 episodes. The reduction of episodes is due to the series making way for Winners & Losers later in the year.","poster_path":null,"season_number":6,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.8,"vote_count":6,"season_data":{"1":{"_id":"5257880f760ee36aaa64ee84","air_date":"2008-08-26","episodes":[{"air_date":"2008-08-26","episode_number":1,"episode_type":"standard","id":380671,"name":"Pilot","overview":"Happily married couple, Julie and Dave Rafter are over the moon when Ben, their last child, finally decides to leave home. After raising three kids, the couple are free! It's a chance for them to do what they want, when they want and on their own terms. However, less than 48 hours after Ben moves next door, all dreams of freedom are completely upended — their three kids think being with their parents is a lot more comfortable than being out on their own, and they're returning with the same sure instinct of homing pigeons.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/vnHWYvXj3lclKun9Hv3mmUrkfcX.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"","credit_id":"5257880f760ee36aaa64ef04","order":500,"adult":false,"gender":2,"id":61907,"known_for_department":"Acting","name":"Luke Pegler","original_name":"Luke Pegler","popularity":7.545,"profile_path":"/syTzL6tzJCJLhMB6CRCUULHGfKj.jpg"},{"character":"","credit_id":"52578811760ee36aaa64ef2d","order":504,"adult":false,"gender":2,"id":1240236,"known_for_department":"Acting","name":"George Houvardas","original_name":"George Houvardas","popularity":2.684,"profile_path":"/f2ok0a31rpPKqwB21Vt3nSdMmzI.jpg"},{"character":"","credit_id":"52578811760ee36aaa64ef53","order":506,"adult":false,"gender":2,"id":1228886,"known_for_department":"Acting","name":"Justin Rosniak","original_name":"Justin Rosniak","popularity":5.481,"profile_path":"/359s2PNiiSzTg6lUaYC8GpB4bBj.jpg"},{"character":"","credit_id":"52578811760ee36aaa64ef79","order":507,"adult":false,"gender":2,"id":94793,"known_for_department":"Acting","name":"Roy Billing","original_name":"Roy Billing","popularity":2.693,"profile_path":"/aG6gpPbgG2pp9usJgQRRMFUV3BB.jpg"}]},{"air_date":"2008-09-02","episode_number":2,"episode_type":"standard","id":380684,"name":"Playing a Googly","overview":"An unemployed Dave struggles to regain his manhood and position in the family, landing himself in hospital.\n\nWhen life keeps bowling Dave a series of problematic googlies, the question becomes: how will he play them?\n\nAn overprotective Dave breaks a promise to his daughter and is brutally attacked.\n\nRachel struggles with the aftermath of leaving her abusive boyfriend Daniel — and her own secret turmoil.\n\nNarrated by Dave, this episode focuses on Dave dealing with the reality of sudden employment and a house that has been unexpectedly inundated with family members — each bringing with them a dark secret. He processes it all through a cricketing metaphor — that of the googly — that devious curve-ball that life can throw at you, catching you off-guard.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/9aVgsT9ClrtN5mcWFuMEVDwkhb7.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"","credit_id":"5257880f760ee36aaa64ef04","order":500,"adult":false,"gender":2,"id":61907,"known_for_department":"Acting","name":"Luke Pegler","original_name":"Luke Pegler","popularity":7.545,"profile_path":"/syTzL6tzJCJLhMB6CRCUULHGfKj.jpg"},{"character":"","credit_id":"52578811760ee36aaa64ef2d","order":504,"adult":false,"gender":2,"id":1240236,"known_for_department":"Acting","name":"George Houvardas","original_name":"George Houvardas","popularity":2.684,"profile_path":"/f2ok0a31rpPKqwB21Vt3nSdMmzI.jpg"},{"character":"","credit_id":"52578811760ee36aaa64ef53","order":506,"adult":false,"gender":2,"id":1228886,"known_for_department":"Acting","name":"Justin Rosniak","original_name":"Justin Rosniak","popularity":5.481,"profile_path":"/359s2PNiiSzTg6lUaYC8GpB4bBj.jpg"},{"character":"","credit_id":"52578811760ee36aaa64ef79","order":507,"adult":false,"gender":2,"id":94793,"known_for_department":"Acting","name":"Roy Billing","original_name":"Roy Billing","popularity":2.693,"profile_path":"/aG6gpPbgG2pp9usJgQRRMFUV3BB.jpg"}]},{"air_date":"2008-09-09","episode_number":3,"episode_type":"standard","id":380688,"name":"She Ain't Heavy","overview":"Rachel's growing alcohol dependence sends her family over the edge. Her careless actions could spell the end for one of them.\n\nJulie desperately brings the family together for a therapeutic barbecue but simmering tensions erupt.\n\nBen finds himself the unlikely counsellor to both his sister and grandfather Ted as they confront traumatic turning points in their lives.\n\nWhen Ted's humiliating secret is discovered by Rachel, she unwittingly sets him on a path to self-destruction.\n\nNarrated by the Rafters' middle child, Ben, tonight's episode focuses on the dramatic and comic repercussions of his move towards independence and responsibility; and the on-going tension for Julie and Dave as they deal with the dark secrets of their family.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/54668jjableKdEjwzhtDZ6GC60O.jpg","vote_average":7,"vote_count":1,"crew":[{"department":"Writing","job":"Writer","credit_id":"52578811760ee36aaa64efed","adult":false,"gender":1,"id":1218773,"known_for_department":"Acting","name":"Marieke Hardy","original_name":"Marieke Hardy","popularity":1.453,"profile_path":"/urPx6Tq7dYZYhF57Il6nUfg3wOo.jpg"},{"department":"Directing","job":"Director","credit_id":"52578811760ee36aaa64f015","adult":false,"gender":2,"id":1219620,"known_for_department":"Directing","name":"Pino Amenta","original_name":"Pino Amenta","popularity":0.983,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257880f760ee36aaa64ef04","order":500,"adult":false,"gender":2,"id":61907,"known_for_department":"Acting","name":"Luke Pegler","original_name":"Luke Pegler","popularity":7.545,"profile_path":"/syTzL6tzJCJLhMB6CRCUULHGfKj.jpg"},{"character":"","credit_id":"52578811760ee36aaa64ef2d","order":504,"adult":false,"gender":2,"id":1240236,"known_for_department":"Acting","name":"George Houvardas","original_name":"George Houvardas","popularity":2.684,"profile_path":"/f2ok0a31rpPKqwB21Vt3nSdMmzI.jpg"}]},{"air_date":"2008-09-16","episode_number":4,"episode_type":"standard","id":380703,"name":"How Did We Get Here?","overview":"Sammy and Nathan's marriage is in crisis when she can no longer bear keeping the secret reason for their move into the Rafter home. This leaves Nathan with no option but to count on the family he's always taken for granted.\n\nRelating the story of how he met beloved wife Sammy, Nathan is forced to face his feelings of worthlessness as a son, husband and provider.\n\nIn revisiting the evolution of his relationship with Sammy, Nathan takes us to his wedding day — both the happiest and saddest day of his life, as a beloved family member collapses. \n\nWealthy princess Sammy faces obstacles at every turn as she struggles to fit into crowded, suburban life with the Rafter family.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/k2lMSuVrDizPMsFMJFq25ueqWRE.jpg","vote_average":7,"vote_count":1,"crew":[{"department":"Directing","job":"Director","credit_id":"52578811760ee36aaa64f015","adult":false,"gender":2,"id":1219620,"known_for_department":"Directing","name":"Pino Amenta","original_name":"Pino Amenta","popularity":0.983,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5257880f760ee36aaa64ef04","order":500,"adult":false,"gender":2,"id":61907,"known_for_department":"Acting","name":"Luke Pegler","original_name":"Luke Pegler","popularity":7.545,"profile_path":"/syTzL6tzJCJLhMB6CRCUULHGfKj.jpg"},{"character":"","credit_id":"52578812760ee36aaa64f127","order":501,"adult":false,"gender":1,"id":69774,"known_for_department":"Acting","name":"Sophie Cook","original_name":"Sophie Cook","popularity":1.92,"profile_path":null},{"character":"","credit_id":"52578812760ee36aaa64f14d","order":505,"adult":false,"gender":2,"id":56449,"known_for_department":"Acting","name":"Jerome Ehlers","original_name":"Jerome Ehlers","popularity":3.748,"profile_path":"/hTnininCfjbQpyRECW5WJaPHCeo.jpg"}]},{"air_date":"2008-09-23","episode_number":5,"episode_type":"standard","id":380701,"name":"Lines of Communication","overview":"Ben finds himself in uncomfortable possession of a devastating secret which could blow his family apart, and with Dave's freelance career failing to take off, Julie makes a tough decision which tests the strength of their marriage.\n\nJulie is starting to feel the financial strain of the family's new living arrangements as Dave struggles to find work. Tempers flare when Dave buys a new van they can't afford without telling her. Eager to ease their money woes, Julie tells Dave a white lie she later regrets.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/pKOMpDJupZpcPzRuBuiDsAhZmwG.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"","credit_id":"5257880f760ee36aaa64ef04","order":500,"adult":false,"gender":2,"id":61907,"known_for_department":"Acting","name":"Luke Pegler","original_name":"Luke Pegler","popularity":7.545,"profile_path":"/syTzL6tzJCJLhMB6CRCUULHGfKj.jpg"},{"character":"","credit_id":"52578811760ee36aaa64ef2d","order":504,"adult":false,"gender":2,"id":1240236,"known_for_department":"Acting","name":"George Houvardas","original_name":"George Houvardas","popularity":2.684,"profile_path":"/f2ok0a31rpPKqwB21Vt3nSdMmzI.jpg"},{"character":"","credit_id":"52578811760ee36aaa64ef53","order":506,"adult":false,"gender":2,"id":1228886,"known_for_department":"Acting","name":"Justin Rosniak","original_name":"Justin Rosniak","popularity":5.481,"profile_path":"/359s2PNiiSzTg6lUaYC8GpB4bBj.jpg"}]},{"air_date":"2008-09-30","episode_number":6,"episode_type":"standard","id":380694,"name":"Facing Demons","overview":"Rachel faces up to her shameful past. In flashbacks, she tells how she met, fell in love and eventually left Daniel, the man responsible for emailing their private video.\n\nTed decides to move back home but what is he hiding?\n\nNarrated from the perspective of the Rafters eldest child Rachel, this episode focuses on the aftermath of her sex video and its repercussions on her and her family.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/eHX48KCvo6340lrYYpztIWZ0n2I.jpg","vote_average":7,"vote_count":1,"crew":[{"department":"Writing","job":"Writer","credit_id":"52578811760ee36aaa64efed","adult":false,"gender":1,"id":1218773,"known_for_department":"Acting","name":"Marieke Hardy","original_name":"Marieke Hardy","popularity":1.453,"profile_path":"/urPx6Tq7dYZYhF57Il6nUfg3wOo.jpg"}],"guest_stars":[]},{"air_date":"2008-10-07","episode_number":7,"episode_type":"standard","id":380699,"name":"Self Made Man","overview":"Nathan's world is turned upside down as Julie and Dave make a splash at his father-in-law's 50th birthday party.\n\nNathan learns a valuable lesson about wealth and happiness when the life he has and the life he wants collide.\n\nDetermined to teach Nathan a lesson about family loyalty, Rachel sets out to humiliate him by dating his rich and snobby best friend.\n\nNarrated from the perspective of Nathan, the episode deals with the journey towards Nathan's epiphany that he's not so different to the rest of his family and that isn't a bad thing.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/gQtrd11gGJ6vGkhMOmbgpKIOaWt.jpg","vote_average":7,"vote_count":1,"crew":[{"department":"Directing","job":"Director","credit_id":"52578811760ee36aaa64f015","adult":false,"gender":2,"id":1219620,"known_for_department":"Directing","name":"Pino Amenta","original_name":"Pino Amenta","popularity":0.983,"profile_path":null}],"guest_stars":[]},{"air_date":"2008-10-14","episode_number":8,"episode_type":"standard","id":380695,"name":"Taking the Lead","overview":"Ben's world is turned upside down after a drunken one-night stand. Dave must face up to the secrets of his past while Carbo strikes up a surprising friendship with unexpectedly romantic results.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/7wo0lPeA6Stkef2zowTQOVKXbQJ.jpg","vote_average":7,"vote_count":1,"crew":[{"department":"Writing","job":"Writer","credit_id":"52578811760ee36aaa64efed","adult":false,"gender":1,"id":1218773,"known_for_department":"Acting","name":"Marieke Hardy","original_name":"Marieke Hardy","popularity":1.453,"profile_path":"/urPx6Tq7dYZYhF57Il6nUfg3wOo.jpg"}],"guest_stars":[]},{"air_date":"2008-10-21","episode_number":9,"episode_type":"standard","id":380696,"name":"Suburban Boy","overview":"Dave reconnects with his foster brother, '80s rock star Steve Wilson, leading to an offer he can't refuse. Meanwhile, after a risky gamble with his boss's money, Nathan races the clock to save his job. Then, Carbo declares his feelings for Chrissy, but will she return them?","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/9ilB0juavBbUo3ARtf3zYA4wLM6.jpg","vote_average":7,"vote_count":1,"crew":[{"department":"Directing","job":"Director","credit_id":"52578811760ee36aaa64f015","adult":false,"gender":2,"id":1219620,"known_for_department":"Directing","name":"Pino Amenta","original_name":"Pino Amenta","popularity":0.983,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"52578811760ee36aaa64f0a7","order":503,"adult":false,"gender":0,"id":1221580,"known_for_department":"Acting","name":"Krystal Forscutt","original_name":"Krystal Forscutt","popularity":1.62,"profile_path":null}]},{"air_date":"2008-10-28","episode_number":10,"episode_type":"standard","id":380693,"name":"All in the Planning","overview":"Rachel is faced with a terrible decision. Ben gets the wrong idea when he stumbles upon a secret in Melissa's handbag. Sammy is offered the possibility of a glamorous job in London — but will she leave Nathan behind?","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/garf8uq6h4v5ausZIl2uzxZWHUJ.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-11-04","episode_number":11,"episode_type":"standard","id":380692,"name":"Away From It All","overview":"Julie forces her dispirited family to the beach for a restorative weekend away — leading to everyone feeling restored but Julie herself. Ted receives advice from beyond the grave. Melissa's life is in danger when she goes into sudden anaphylactic shock during a Rafter BBQ. Romance beckons for Rachel — but is she ready to embrace it?","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/mK0E1Ve88v6Yxlk8YEaerttaHx7.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-11-11","episode_number":12,"episode_type":"standard","id":380706,"name":"Removing the Block","overview":"Ted steps back into the weird and wonderful world of dating. His journey begins when, encouraged by Louise's letter to the future, he attends a meeting of Friend Finders — a social networking group for people over 50. His first experience is bewildering and he finds himself cast as 'fresh flesh' — especially by two very different women, Helen and Marjorie. But is the newly widowed Ted ready for anything romantic?\n\nRachel embraces a macrobiotic lifestyle with disastrous results; and Julie lets her hair down for a night of pre-Christmas clubbing.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/9mRb3dwYBoqgOuSPfvYZz04NlyY.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-11-18","episode_number":13,"episode_type":"standard","id":380705,"name":"Smile Through the Pain","overview":"Dave reluctantly bonds with Warney and discovers the beginnings of a surprising friendship. Meanwhile, Julie cramps Rachel's style when she signs up for the same yoga class.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/xQgYTQ0plvkafl5yDrPaT6sKyLB.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2008-11-25","episode_number":14,"episode_type":"standard","id":380707,"name":"A Mother's Radar","overview":"Following on from last weeks adventure in the car, Sammy and Nathan decide to organise some time for themselves with a romantic rendezvous. Julie's predictions about Rachel's true desire to pursue an interest in yoga are proven correct when her relationship with her hot yoga teacher is exposed to the family. But it is not to soon before Julie realises that her mother's radar is not always on track.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/qG3HfrL4tXXl0maNYRyqWCXZpl2.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-02-03","episode_number":15,"episode_type":"standard","id":380708,"name":"Natural Justice","overview":"Being on the electoral roll has its advantages; some may argue but voting being one. And others say it's not a good thing at all, as they don't want to be called up for jury duty. In this, the first episode of Season 2, Ben Rafter thinks jury duty sounds just fine and he approaches it with a willing attitude. Whilst doing jury duty he meets a Massage Therapist named Kat, who has a rather refreshing perspective on life, love and everything else. Meanwhile the beginnings of Dave's business comes up with a huge hurdle – he has too much work! In fact Dave is struggling so badly under the weight of so much work that until he gets a helping hand he cannot cope","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/9fonX45Mu2cbtklgQpHyoDWnAP3.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-02-10","episode_number":16,"episode_type":"standard","id":380709,"name":"Having It All","overview":"This week sees Rachel still trying to find her life's path. With much direction and focus she starts a new chapter in her life. Meanwhile, since finding a new business partner, Dave's life should have been made much easier – shouldn't it? Things just aren't going smoothly and instead it's all a bit of a struggle.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/jBzcsRxy5EAyGoVaTzil0Vu2V0T.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-02-17","episode_number":17,"episode_type":"standard","id":380710,"name":"Changes","overview":"Dads and their daughters have a very special relationship. In fact, most Dad's like to think that their precious daughters are \"Daddy's Little Girl\". So when Dave learns that Rachel is dating an old cricket mate of his from years ago, he is naturally concerned for Rachel's welfare. This new man in Rachel's life is about the same age as Dave and has two teenage sons who are very close to Rachel's own age. Melissa and Chrissy are still very suspicious of Kat. And the both of them are trying to work out Kat's motivation for the trouble she is causing between all of the housemates. And once again Ted ventures into the world of dating with some not so predictable results.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/cFoq41r9jWPnIapBtvIGzVGn61i.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-02-24","episode_number":18,"episode_type":"standard","id":380711,"name":"House of Cards","overview":"What do you get when you mix too much alcohol with sex? A one night stand! It would almost be crazy, or somehow forgettable if it wasn't our favourite Rafter involved. That's right - It's Ben! Maybe there's some residual stress left over after the robbery and he still has not dealt with it honestly? Maybe he was truly so intoxicated that he didn't know what he was doing? Who knows? But no excuse can take away the act. So once again Ben faces a gut wrenching dilemma, but this time its one of his own making. This week sees Dave keen to spice up his marriage, so he organises a rather romantic rendezvous with Julie. Whereas at the other end of the spectrum Sammy and Nathan's marriage hits a \"rocky patch\" when Nathan discovers Sammy has been lying to him. Just another week in the Rafter household really.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/pzGfgA6cQcZNenL56FBvVOXHoCn.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-03-03","episode_number":19,"episode_type":"standard","id":380712,"name":"Over the Moon","overview":"This week Rachel is blown away by Rob's idea of \"Happy Families\". His idea is a bit over the top, but not in a bad way really. With a bit of help from Dad, Ben challenges fate to give him one last chance to redeem himself with Mel. In the end honesty seems to be the best policy, and asking for a second chance may just work. Plus Carbo's parents drop in for a visit to see how things are going with the house and the neighbourhood. This makes for some interesting times, especially when they catch Carbo and Chrissy kissing as they pull into the driveway. Meanwhile, Julie reaches some startling conclusions about the state of her health and believes it is fast becoming an issue. I think grabbing the chainsaw and threatening Carbo's parents with it gives that bit away! This week's episode sees big changes that bring tears, broken hearts and a shock announcement","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/csKW3BzljqldBfEVtH1XxYNj8km.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-03-10","episode_number":20,"episode_type":"standard","id":380713,"name":"Losing the Touch","overview":"\"Once upon a time in Dave's Magic Castle.\" All should be well in the world of King Dave, but with Queen Julie heading into menopause, the Rafter household is a bit tumultuous. Julie fears that her ability to dispense sound wisdom to family and friends, is severly impeeded by her hormonal fluctuations. Sammy returns from New York with many more bags than she left with, and Julie fears that Sammy's spending may cause problems between her and Nathan. Sammy then advises Julie that the money she has spent on gifts for the family, came from her mother as an early birthday present. Once again Julie worries! Meanwhile, Ben makes up his mind to declare his love for Melissa on national television, and comic results ensue. Life is always full when it is \"Packed to the Rafters\".","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/lpjnJp9cRcgNb9nrRWB01hlSqU0.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-03-17","episode_number":21,"episode_type":"standard","id":380714,"name":"What a Difference a Year Makes","overview":"What a difference a year makes! It has been a year in TV land according to the Packed to the Rafters show, and therefore two special anniversaries are marked in the lives of the Rafter family. The first one is that of Nathan and Sammy's marriage. The second anniversary is that of the death of Louise, Ted's wife and Julie's mother.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/o971PqhvNTtQYPdMZC9Yc11TCpJ.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-03-24","episode_number":22,"episode_type":"finale","id":380715,"name":"Don't Know What You've Got 'Til It's Gone","overview":"Last week saw a huge surprise bestowed on Dave and Julie. With three grown up kids, and the youngest being born 21 years ago, just how will Dave and Julie cope? What with the nappies, school runs and the lack of sleep and time; let alone the actual delivery? Dave and Julie have some serious life changing decisions to make, that not only have ramifications for themselves as individuals and a couple, but may shake the very foundation of the family.","production_code":"","runtime":null,"season_number":1,"show_id":6754,"still_path":"/sLTu8yxEvKfimO4453Qq3cmmIRY.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"The first season of Packed to the Rafters, an Australian drama television series, began airing on 26 August 2008 on the Seven Network. The season concluded on 24 March 2009 after 22 episodes. The first season aired Tuesdays at 8:30 pm in Australia and averaged 1,904,364 viewers. The season was released on DVD as a six disc set under the title of Packed to the Rafters: The Complete Season 1 on 2 December 2009.\n\nThe first season begins as Julie and Dave Rafter are over the moon when their last remaining child finally leaves home. But what happens when the rest of the family suddenly returns to the next? Less than 48 hours after their middle son Ben moves himself next door, all dreams of freedom are put on hold as one by one their youngest son Nathan and his princess wife Sammy, their troubled eldest daughter Rachel, and Julie's emotionally vulnerable father Ted all return to the family home. Plenty of drama, lots of laughs and a few tears ensue as the Rafters must learn to live under the same roof once again.","id":17014,"poster_path":"/xE0wDLlfCAzonHntvWbWaSvZuy3.jpg","season_number":1,"vote_average":7},"2":{"_id":"5257880f760ee36aaa64ee95","air_date":"2009-06-30","episodes":[{"air_date":"2009-06-30","episode_number":1,"episode_type":"standard","id":380721,"name":"Look into My Eyes","overview":"This episode sees the return of Packed to the Rafters for its second season on Australian television. Decisions still need to be made from where they left off at the end of Season One. And Ben and Mel may or may not have a relationship. So I suppose many questions will be answered over the next few episodes. In this episode we see Julie once again worried about the safety of her family. It seems she visits a psychic and some very troubling forecasts about the future of the Rafter family are made. Now normally this would not bother Julie, but as each of these predictions come true, Julie becomes increasingly concerned.","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/kRur683Uc9ZsiMVJmeDC19lVNv.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-07-07","episode_number":2,"episode_type":"standard","id":380723,"name":"Dodging the Issue","overview":"Dave and Julie’s relationship comes under strain as Dave struggles with a series of betrayals.\n\nJulie is convinced that Warney is ripping off Dave’s business. But Dave is positive his mate is doing no such thing. Warney is able to explain away any discrepancies – and Dave’s loyalty to him is strengthened when he discovers they shared similar childhoods – Warney was adopted too.\n\nMeanwhile, Nathan’s easy working relationship with his father is tested when they do a job for Tim Connelly, a real estate agent who Nathan once interviewed with. Nathan’s work ethic impresses Tim and he surprises Nathan by offering him a job. Dave knows he should be thrilled for his son but he can’t help feeling betrayed and abandoned.\n\nBen and Melissa are tentatively dating, but the arrival of a handsome new doctor – Luke Hanson sets Ben on a destructively jealous path. Melissa’s furious reaction makes Ben determined to win her back by becoming what she wants – an athletic, successful man. But his plans are cut short when he suffers what seems to be a heart attack. \n\nBen’s emergency plus Dave’s feelings of abandonment force Dave to face up to his childhood. Deserted by his parents and adopted out at a young age, Julie suggests to Dave it’s time he discovers the truth about his past. But is he ready to find out?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/prc5NtyKj8fcJGHT21zqk1jUEFP.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-07-14","episode_number":3,"episode_type":"standard","id":380724,"name":"Living by the List","overview":"Rachel gets back into the dating game.\n\nEncouraged by her best friend Libby, Rachel reluctantly agrees to be set up on a blind date. After they literally run into a gorgeous, crude rugby player – Jake – at the park, Rachel is even more determined to date the perfect man, and gives Libby an impossible checklist of necessary qualities her date must possess.\n\nLibby comes up with the goods in the form of handsome, successful, well travelled Marcus but the date is a disaster. Rachel’s mood isn’t helped by constantly running into the crude Jake.\n\nUndeterred, Libby tries again with the charming, fun and cute Ritchie – but he comes with his own set of issues. It’s a case of third time lucky when Libby persuades Rachel to date one more guy – Max – who turns out to be short, overweight…and fascinating. However, Rachel gets a shock when Max turns her down gently – he only wants to date girls with red hair!\n\nRealising that she is being taught a lesson, Rachel decides to embrace whatever the universe offers her – no more lists. But the last thing she expects to discover is that Jake is Dave’s new electrician. What is the universe offering Rachel and will she take it?\n\nBen’s determined to win the job of manager at the boat club. He goes to the interview and meets Fergus, his rival for the position. Derek their boss gives them a challenge – one slow night each to turn a decent profit. Who’ll get the job?\n\nNathan has started his new job as a suburban real estate agent. However, he’s stunned when his boss Tim relegates him to a very junior role. All his attempts to prove himself fall on dead ears – so Nathan decides to take a gamble on a client without telling Tim. Will Nathan blow it?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/m6xupYQCwtqDN5Vga35WUYqolVs.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-07-21","episode_number":4,"episode_type":"standard","id":380716,"name":"Glittering Prizes","overview":"Steve Wilson makes Nathan an unexpected offer.\n\nNathan’s life is finally back on track. He’s on the verge of pushing through a major sales coup and his boss Tim raises the possibility of a future partnership in the business. \n\nHowever, a spanner is thrown in the works when Dave’s ex-bandmate and close friend Steve Wilson returns from touring to announce that he’s launching a new publishing and composing division of his label with a party to which all the Rafters are invited.\n\nThe party is a glamour-affair of champagne and celebrities like Kate Ceberano, David Campbell and So You Think You Can Dance’s RHYS BOBRIDGE. During the festivities, Layla - Steve’s attractive and dynamic new business-partner and girlfriend - takes an intense interest in Nathan. She and Steve approach Nathan to join their new venture in a sales capacity.\n\nBoth Dave and Sammy express reservations. Steve’s company has not yet opened for business and nobody knows whether it will succeed. Nathan is forced to choose between the glamour of the music industry and the security of real estate – what will he decide?\n\nNathan flirts with Layla, which puts a strain on his and Sammy's relationship Nathan is impressed with Steve's attr\n\nNathan flirts with Layla, Steve's attractive new business-partner and girlfriend Layla\n\nRachel meanwhile continues to rise to the bait of Jake’s brazen teasing flirtation. Julie strongly suspects Rachel is protesting too much when Rachel accuses him of being a Neanderthal bogan. This character analysis Jake challengingly puts to the test when he crashes a market research group Rachel and her colleagues have organised for a men’s body spray. Will she interestedfall for his rough charms?\n\nBen meanwhile runs into Melissa and her new boyfriend Luke at the movies. She admits to missing him but wants to be just friends. Ben refuses, giving Melissa an ultimatum – it’s all or nothing for him. Who will Melissa choose? Will it be enough to bring them back together?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/zG73mkSdG3zBxW4ca1As5oigj7Q.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-07-28","episode_number":5,"episode_type":"standard","id":380718,"name":"Brave New World","overview":"Painful memories surface for Dave as he and Julie confront the potentially heartbreaking results of tests on their unborn child.\n\nPregnant late in life, the chances of Julie and Dave’s child having Down Syndrome are already high – but the results of preliminary ultrasound indicates those chances are even higher. Although they must wait for blood tests to confirm, Julie and Dave find themselves contemplating a likely future as parents of a child with a disability. Julie, though rattled, reminds Dave they have already made their decision about the baby – as far as she’s concerned, they’re having the child, no matter what. \n\nJulie wants to start researching Down Syndrome so they can plan for the future. But Dave’s response stuns her. He doesn’t want to research anything until the results are confirmed - and worse of all, he’s not sure they should have the child if it turns out to have the disability. \n\nAs his marriage comes under strain, Dave is forced to examine his reasons for not wanting the child. He digs into previously buried memories – and finally realises that his reaction to the baby is based on fear...fear that his child will suffer the same rejection and isolation Dave suffered as a child. \n\nNathan begins his first day at Steve Wilson’s music firm. Excited by the glamour of the music industry, Nathan is on a constant high – and Sammy can’t help feeling slightly jealous. Her feelings aren’t helped when Nathan’s new job proves to involve late nights and offering lonely hears advice to his needy new colleague, Steve’s girlfriend Layla.\n\nCarbo falls into a surprising physical relationship with a lonely customer, married 40ish cougar Toni – but may have bitten off more than he can chew when Toni starts stalking him.","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/ehq1OiRVc9LTzMEmaKcn43GJhAc.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-08-04","episode_number":6,"episode_type":"standard","id":380720,"name":"Little Arrows","overview":"Ted’s burgeoning relationship with Marjorie appears to be going romantic gangbusters until he meets her daughter Susannah and her pregnant partner Abby, who’ve left the Gold Coast to live with her.\n\nConservative Ted is taken aback when he discovers the couple’s baby has been fathered by Susannah’s brother. Ted is however determined to try to be friends – but Susannah rejects every attempt. The situation is made more difficult when Ted decides that Susannah is taking her mother for granted. When he makes the mistake of sharing his concerns with Marjorie, Marjorie not unnaturally sides with her daughter. Will their blossoming relationship be over before it’s even had the chance to begin?\n\nAttempting to get back on the horse after his breakup with Melissa, Ben gives into the flirtation of a young woman Elly, at the boatclub. However when they go back to the Karandonis house, Elly passes out. Ben and Carbo rush her to hospital where she recovers – but accuses Ben of spiking her drink. How will Ben prove his innocence?\n\nRachel is determined to hate gorgeous tradie Jake - but the true colours of her interest emerge when they are inadvertently locked together in a building site overnight... and temptation proves too much to resist","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/amZ13T2JktWBTUDjXh4SI8OpkMx.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-08-11","episode_number":7,"episode_type":"standard","id":380726,"name":"Belonging","overview":"Trish returns from Europe, seemingly in high spirits, and invites the entire Rafter family to lunch at an exclusive restaurant. When her daughter Sammy wonders who exactly is paying the bills, Trish waves off Sammy’s concerns - she’s meeting with estranged husband Tony tomorrow to sort out finances. To her shock, Sammy realises that Trish hopes she will get back with Tony. \n\nSammy goes along to their meeting for moral support. To Trish’s surprise, Tony fails to show, sending instead his lawyer, Simon Radic. Trish’s hopes of reconciliation are destroyed, as are her credit cards, when Simon cuts them in half as per Tony’s instructions. Sammy brings a devastated Trish to the Rafter house – the only sanctuary she knows – where Trish has a mental collapse.\n\nBen is struggling with his recent break-up with Melissa. Despite having insisted they can’t be just friends, Ben is missing her desperately. To his surprise, Melissa turns up unexpectedly at the Karandonis house with her bags – but is she back for good?\n\nMeanwhile, Rachel is fighting her attraction to Jake after their night of passion. A night watching rugby brings out the competitive streak in both of them – and Rachel can’t help but give in again to Jake’s charms. But is there romance on the cards?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/jkklojFqJUP5NmbQA0ijfF9MBoq.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-08-18","episode_number":8,"episode_type":"standard","id":380727,"name":"What's in a Name?","overview":"The stray mutt which Ben and Melissa found a week ago still has no name, despite all their efforts. If Carbo has his way, the dog may not be around long enough to need a name. After barking all day and night and chewing his mum’s shoes, Carbo delivers an ultimatum to his housemates – find the dog’s owner or it’s off to the pound.\n\nMeanwhile, the dog seems to have developed an obsession with Dave. Dave’s instinct is to back away from the dog’s affection – but it’s the all night howling which triggers a deeply subconscious reaction in Dave. He begins to have a recurring dream – one he had many times as a child – of a dog barking and scratching at a closed door. But is it just a dream or a distant and traumatic memory from his own childhood?\n\nA week into Trish’s stay in the Rafter house, Julie pleads with her boss Don to give Trish a job. He agrees but the plan backfires when Trish spends more time flirting with Don than she does working. Worse still, Trish unthinkingly reveals Julie’s pregnancy – information Julie was deliberately withholding.\n\nJake is determined to show Rachel they could be in a relationship which is more than physical. Rachel isn’t convinced but agrees to go along to Ladies Day at his rugby club. Plunging headfirst into Jake’s world, will Rachel like what she sees?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/g7n7DnupZ4q6wNl6d79T7VJsc4m.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"Chynna","credit_id":"5eaf3bffedeb43001fc7f399","order":510,"adult":false,"gender":1,"id":2624611,"known_for_department":"Acting","name":"Shannon Dooley","original_name":"Shannon Dooley","popularity":1.4,"profile_path":"/tO7QO2oUHKyrnZxlkWkgDPskO6d.jpg"}]},{"air_date":"2009-08-25","episode_number":9,"episode_type":"standard","id":380728,"name":"Naked Visions","overview":"Ben’s troubles begin when he inadvertently stumbles on Rachel taking artistic pregnancy photos of a naked Julie. Given the mainly positive reactions to the photos, Julie decides to celebrate her changing body by putting an enormous copy of a nude photo smack bang in the middle of the lounge-room. \n\nDave’s growing attachment to Ben and Melissa’s dog continues to puzzle those around him. Only Julie knows the truth: the dog has provoked the recollection of a traumatic incident in his past. So when the dog is badly injured in a car accident, Dave breaks down in front of Ben. However the dog proves not to be the only link to his past when Dave’s original birth certificate finally arrives – is Dave ready for the answers he’s been seeking? \n\nRachel and Jake take their newfound relationship a step further when Jake shares a family dinner with the Rafters. \n\nTed and Dave assume that Jake won’t be able to cope with the naked photo of Julie – but Jake scores himself major brownie points by admiring the artwork. Encouraged by his maturity, Rachel tells Jakes some home truths about her past – including her sex tape. Will it scare him off?\n\nMeanwhile, Ben’s relationship with Melissa is put to the test when a series of misunderstandings causes him to think she is cheating on him. Her anger and betrayal prompts Ben to take a good hard look at their relationship. The result? To propose marriage. But does Melissa want to marry Ben?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/1LZa6fJr6CYguCncNZnOK70FuHd.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-09-01","episode_number":10,"episode_type":"standard","id":380747,"name":"Ready to Catch You","overview":"Dave has finally opened his original birth certificate. Inside is the name of his birth mother, but his birth father is ‘unknown’. Encouraged by Julie, Dave tells the rest of the family. Buoyed by their enthusiasm to find out more, Dave fills in an online profile for an organisation which brings adopted parents and children together. Initially thrilled when the organisation finds his mother, Dave is devastated when they reveal she doesn’t want to see him. But is the door closed forever?\n\nMeanwhile, Rachel invites herself to Jake’s place for lunch to meet his family, keen to take the next step in their relationship. But all her expectations are challenged by Jake’s cheeky brother Alex, who has cerebral palsy, and their mother Grace, who takes an instant dislike to Rachel. \n\nThings go from bad to worse between Rachel and Grace when Jake is injured in a workplace accident. When Rachel dashes to his side, Grace finally lets loose, telling Rachel to leave her son alone.\n\nNathan is slowly being pulled into the darker side of the music business. After kicking yet more goals for the company, Layla suggests they celebrate with cocaine. Nathan resists initially, then gives in – what harm can a few lines do","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/ozJlGDtwQv77XJrMPLkcRzfcxiV.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-09-08","episode_number":11,"episode_type":"standard","id":380745,"name":"Power Play","overview":"After turning up at the Rafter house and disappearing without so much as a word, Rachel 'Chel' Warne uses an electrical ruse to lure Dave to the shop where she is working. Although the meeting is awkward, Dave invites her to lunch the next day. The whole family is nervous about the encounter, but Chel soon charms them all - apart from Dave. Will the pain of his past prevent him from embracing a future with his mother?\n\nJake and Rachel's worlds collide when Jake invites himself to her launch of 'Rampant', a men's body spray. Jake feels like a fish out of water at the launch, but when the sound system blows, who else can save the day but an electrician?\n\nHowever, Rachel and Jake's romantic night together at a hotel is interrupted by a phone call from Jake's overprotective mum Grace, trying to emotionally blackmail him into coming home early. Rachel has had enough and confronts Grace... which Jake witnesses. Whose side will Jake be forced to take?\n\nNarrated by: Rachel Rafter","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/toxJc1SaRknAgNGWk0ICCU4EW8O.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-09-15","episode_number":12,"episode_type":"standard","id":380743,"name":"Out of Left Field","overview":"Carbo’s mother Rita arrives from Lesbos to stay for six weeks with Artemis, the 18 year old daughter of her best friend. Despite Ben and Melissa’s insinuations that this may be a romantic set-up, Carbo sees Artie like a little sister. \n\nHowever she’s hardly the innocent young girl Rita seems to think she is. At a trip to the beach, she hooks up with Dane, a guy she has met on Facebook. With Rita breathing down his neck, Carbo alienates the rebellious Artemis with his attempts to curb her wild behaviour. But despite acting like a big brother, a quick, innocent kiss between them leaves Carbo floored by a rush of romantic feelings. Was this Rita’s plan all along?\n\nMeanwhile, Sammy has to interview two young professionals for her first feature writing assignment. To her surprise, Nathan, eager to play the supportive husband, suggests she contact her former flame Owen. Is Nathan hiding his guilt over a cocaine-fuelled kiss with Layla? And when Sammy interviews Layla too, will the truth slip out?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/sti9Fidi0BOj2QKSZEycZcmD8Pv.jpg","vote_average":7,"vote_count":1,"crew":[{"department":"Directing","job":"Director","credit_id":"52578814760ee36aaa64f3fe","adult":false,"gender":2,"id":1228895,"known_for_department":"Directing","name":"Kevin Carlin","original_name":"Kevin Carlin","popularity":1.824,"profile_path":null}],"guest_stars":[]},{"air_date":"2009-09-22","episode_number":13,"episode_type":"standard","id":380729,"name":"Blurring the Lines","overview":"A shame-faced Nathan wakes up from an erotic dream initially about Sammy who then turns into Layla.\n\nSammy’s father Tony is facing the first hearing of his trial tomorrow, and she has to go along as moral support for her mother Trish. She’s given a boost when Nathan insists he’ll take the day off work and accompany her– a seemingly generous act, although he’s really doing it as much to avoid Layla after their cocaine-fuelled kiss as to help his wife. \n\nAfter the first hearing, Nathan is called back to work, where Layla notices his fixation on her – so she subtly strokes the flames. This leads to Nathan having another erotic dream – and when he guiltily ‘takes care’ of his urge in the bathroom, Sammy catches him out. Having previously refused sex with her, Sammy is understandably concerned.\n\nNathan waves off her worries, determined to keep himself under control – until Layla makes a brazen suggestion. She knows he’s interested, his work is being affected – so why not sleep together? Nathan is shocked. What will he do now his fantasy has the chance to become reality?\n\nOver at the Karandonis house, Artie is preparing for her first day of work at the boat club with Ben. Carbo, who’s aware of his romantic feelings for her, is happy with her choice of job – after all, how much trouble can she get into under the watchful eye of Ben? But he hasn’t met her co-worker Lexi, a cheeky young trouble maker, yet. The pair strike up a friendship and it isn’t long before Lexi leads Artie astray much to Carbo’s dismay.\n\nChrissy finds herself having a surprising and unwelcome fantasy of her own... about Dave. And an unexpected romance blossoms between Warney and Trish.","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/5k1aRbDkxxlV780WLKOw6k5Vtsh.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"Lexi","credit_id":"63b6d21e8ee49c00a1809508","order":516,"adult":false,"gender":1,"id":145247,"known_for_department":"Acting","name":"Phoebe Tonkin","original_name":"Phoebe Tonkin","popularity":21.519,"profile_path":"/kCqD4tiXfSdZ5eGvMcYy9mP4BfI.jpg"}]},{"air_date":"2009-09-29","episode_number":14,"episode_type":"standard","id":380741,"name":"First Instinct","overview":"The Rafters throw a surprise party for Chel, who's shocked and delighted as the family yells 'surprise.' She is swept up in the family history and moved by the love shown to her. But clouds are gathering.\n\nRachel and Ted notice worrying marks on Chel's arm. Are they damage veins? Or trackmarks? Rachel takes the news to Dave and Julie, who debate the causes. Surely Chel can’t be a junkie? But they admit they don't know herwell. Dave confronts Chel, who reacts badly to the interrogations. Eventually she reveals the shocking truth.\n\nJulie reacts the most strongly to the news. She doesn’t want Chel in her house any more. This puts her at odds with everyone, especially Dave and Rachel.\n\nNathan is stricken with guilt over his fling with Layla and manages to lose his wedding ring during the birthday barbecue. He searches for it desperately and lies to Sammy about it. \n\nNext door, Ben and Melissa are stricken with food poisoning. Their marathon bout of vomiting brings them even closer together. But will it end in Melissa finally accepting Ben's marriage proposal? \n\nCarbo works hard to fan the flames of his relationship with Artie. But he strikes out. Arties decides her mother has orchestrated the whole thing with Carbo, and, in an act of defiance, agrees to go out with Gavin a shy country singer from the Boat Club.","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/129WABqDpol4xhLGqYCRcIBEs1f.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"Lexi","credit_id":"63b6d21e8ee49c00a1809508","order":516,"adult":false,"gender":1,"id":145247,"known_for_department":"Acting","name":"Phoebe Tonkin","original_name":"Phoebe Tonkin","popularity":21.519,"profile_path":"/kCqD4tiXfSdZ5eGvMcYy9mP4BfI.jpg"}]},{"air_date":"2009-10-06","episode_number":15,"episode_type":"standard","id":380730,"name":"It's My Party","overview":"Dave is determined to give Ben and Melissa the engagement party that he and Julie never had. But his focus is sidetracked by the accidental discovery that Chel’s increasingly regular hospital visits are in fact to the Renal Ward. Melissa surmises that Chel’s kidneys might be failing after more than 20 years on HIV medication. Dave confides in Julie his willingness to be tested as a potential donor.\n\nMelissa is disappointed when her mother calls, explaining that has father has an important board meeting and can’t make the party. However, when Dermott, Melissa’s older, womanising brother arrives, he breaks the news that Melissa’s father had no such meeting. Her dad cynically believes she will once more get cold feet and that the wedding will never happen. \n\nMelissa is crushed. Seeing her devastation, Ben tells Dave she might not be attending the party. A stand-off ensues. Ben accuses Dave of being more concerned with his own party agenda than with what he and Melissa might want. Melissa finally breaks the impasse and agrees to go.\n\nHowever, at the party, Dave is unable to resist telling Chel about his decision to test as a donor. He think she will be delighted but she disappears from the party…and their lives, without leaving any contact details.\n\nNathan is nervous when he hears Steve Wilson is returning from overseas to attend the engagement party. Having slept with Layla, Nathan is terrified that Steve, and more importantly, Sammy could find out.","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/t87qvhbQnb3t5RrwtOQBzXsx5jm.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-10-13","episode_number":16,"episode_type":"standard","id":380731,"name":"Mr Fix-It","overview":"Now that Julie and Dave are expecting their fourth child, Ted makes plans to withdraw from his superfund and invest in a new unit. Nathan has been calling and texting Sammy hoping for the chance to explain his infidelity. However, she's not answering him. Ted takes a tough love approach, telling Nathan that if he isn't willing to put everything on the line to get Sammy back, then maybe Nathan doesn't love Sammy enough. Dave has been searching for Chel since she ran from the engagement party, with no luck. She has left town with no forwarding address. Ted gallops to the rescue, persuading Melissa to find out which hospital Chel is now going to for her dialysis.","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/eoa1wc2tlFHWM58N3SAlI21YUrc.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-10-20","episode_number":17,"episode_type":"standard","id":380732,"name":"Putting the House in Order","overview":"On her last day at work Julie quizzes psychic tea lady Bonnie about the troubling prediction she’d made months earlier. Bonnie still senses a divorce but now she’s sensing something more. It has to do with Julie’s husband Dave. \n\nJulie is concerned that Chrissy seems to be avoiding her. Then Chrissy drops a bombshell. She says she’s leaving not just her job with Dave, but the state, for some new guy she’s met from Queensland. Julie is stunned and has a nagging doubt that Chrissy is not giving her the full story. \n\nBut when Julie reflects on Chrissy’s actions, she realises the confronting truth of the matter: there is only one man Chrissy would not confide in her about – and that is Dave. Has Chrissy fallen in love with her best friend’s husband?\n\nRachel spies Sammy having lunch with her ex Owen, and becomes concerned. She enlists Jake to help persuade Sammy to attend his club’s fundraiser day, figuring she can ask Nathan as well. Will her plan to get the warring pair back together work?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/zh8AWVYboSihEpz5SszB6rQV8lf.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-10-27","episode_number":18,"episode_type":"standard","id":380734,"name":"Space Junk","overview":"When a bunch of flowers arrive for her at work with no card, Rachel assumes Jake must’ve sent them. However, she soon discovers that they are from her ex-boyfriend, meth addict Daniel. Now clean and sober, he has been rehired by CBM Advertising to produce a TV ad for men’s cologne Rampant using Jake as the star.\n\nBut when Jake arrives late on the ad shoot, having brought his brother Alex along, the client complaints to Daniel. Daniel agrees to sort it out and speaks down to Alex. Unfortunately, Jake overhears and quits not only the shoot but the whole campaign.\n\nA row breaks out, and Jake ends up hitting Daniel in front of the whole crew. Deeply embarrassed and shocked, Rachel sides with Daniel. As the pair work late into the night to salvage footage from the day’s shoot, a stunned Rachel finds herself feeling attracted to Daniel. Will it spell the end for her and Jake?\n\nMeanwhile, Sammy has just moved back into the Rafter house. She and Nathan are back on track – in every way except physical intimacy. As the Rafters go away for a few days to give the couple some alone time together, Chel takes Nathan aside and gives him some capsules of medical marijuana, believing it will help he and Sammy relax. Dave is furious when he finds out. Is this the final straw for the newfound mother and son?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/z7mzaDEJS1eMuRULUHUGopT5L5d.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-11-03","episode_number":19,"episode_type":"standard","id":380736,"name":"A Small, Traditional Affair","overview":"Ben begins to bow under pressure as his wedding day fast approaches, thanks to a chance meeting with Kat and the arrival of Melissa’s overbearing parents.\n\nAt the bucks night, Ben is having a fantastic time until the stripper Carbo has organised arrives. It turns out to be Kat, the woman he slept with and who came between him and Melissa. She questions why Melissa would want to marry someone who’s just the manager of a Boat Club – something that, deep down, Ben has often wondered himself.\n\nBen is shaken by her words. His feeling of pressure increases with the surprise early arrival of Melissa parents, Linda and Pat. It becomes increasingly clear that Pat thinks Ben isn’t good enough for his daughter – he has no ambition, no drive, no plans for the future. \n\nBen panics and, on the morning of their wedding day, disappears. The Rafters throw themselves into finding Ben and hiding the news from Melissa. Will they be able to track him down before the bride finds out?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/6OI8qzavLdmijE9K8iQlghJfgqG.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-11-10","episode_number":20,"episode_type":"standard","id":380738,"name":"Only a Heartbeat Away","overview":"Ben and Melissa's honeymoon takes an unexpected turn. At the five-star resort they're staying at, they meet another couple, Adrian and Nicole, and hit it off. They become new besties. There might even be a new job in it for Ben. But there's more than meets the eye with this friendly duo. Dave is very aware that Chel is keeping her distance since the wedding. Chel insists they're fine but Dave feels like his mum is a stranger. Julie, who's under strict bed rest after her collapse on the wedding, suggests he try harder. He does by turning up in Ted's place to take Chel to her dialysis treatment. She initially refuses but backs down. At the hospital, she opens up abut his father Tom Jenkins. She admits she doesn't even know where he's buried. Dave decides to do some investigative work to find his father's grave, and with the help of Nathan, makes a shocking discovery.","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/w2RwIMhvIodZs44IsNBzrmRQyTQ.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-11-17","episode_number":21,"episode_type":"standard","id":380739,"name":"Unlimited Options","overview":"Nathan has decided he has no possible job options left. But in a way he feels liberated – he’s free to consider impossible options. The world opens up to him again – he’ll become an event manager, or a personal trainer! Sammy is trying to be supportive but it’s wearing her out. \n\nDetermined to do something useful, Nathan secretly tracks down an address for Dave’s father, Tom Jenkins, and drives into the country to suss him out. He meets his cousin, Coby, who seems to be a rough-head compo cheat. He also learns that his grandfather Tom is a notorious local crook, doing time in jail for car rebirthing. Nathan is rocked by the murky gene pool they all share. Is it any wonder his life seems to be falling to pieces?\n\nJulie is still effectively confined to bed, and Rachel is feeling the pressure organising a baby shower that will be fun for Julie and her friends. To complicate matters Chrissy texts to warn she won’t be coming, but sends her love. Rachel can’t understand how Julie’s best friend can miss the party. Julie is clearly hurt, but makes excuses for Chrissy, knowing the real reason she’s kept away. \n\nWarney is in a funk over Trish and is worse company than usual. Ben and Melissa want him out. Carbo appeals to Sammy – is there any chance she can help get Warney and Trish back together? Sammy can’t think of anything worse, except perhaps the relationship her mother is in now, with her aging rich boss, Andrew Malouf.","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/vqgQCB5uul7UrUswAN9l7kJ5Mr0.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2009-11-24","episode_number":22,"episode_type":"finale","id":380740,"name":"Nativity Play","overview":"Julie faces her greatest challenge yet – the birth of her fourth and final child without husband Dave at her side.\n\nAfter Dave leaves for his vasectomy, Julie begins to have contractions, and though she thinks they’re probably Braxton Hicks, Melissa and Ben insist on getting her to a hospital. \n\nOnce in hospital, Julie’s obstetrician Sandra Marsh observes that the signs of labour have disappeared – but now that Julie is in hospital, she’s not allowed to leave until she gives birth. Julie reluctantly gives in – and tells Ben not to worry Dave as he will undoubtedly call them once his procedure is over. \n\nHowever Julie’s labour pains start up again – this time for real. Ben leaves frantic voice messages for Dave, realising they don’t know the name of the clinic where his vasectomy is taking place. Will Dave make it to the hospital in time?\n\nMeanwhile, Jake invites her to lunch with his family – at his mother’s Grace’s insistence. When Rachel expresses surprise, Jake admits that he has told Grace that she is going to be in his life long term. Rachel is taken aback – what kind of commitment is Jake talking about? However, the family lunch takes a dark turn when Jake begins to fit, collapsing on the floor.\n\nMeanwhile, Nathan surprises Sammy with a cheque for $14,000. He took some spare chips back to the casino and won – enough for them to pay off the remainder of their debt and put down bond on an apartment. They’re finally able to move out of the Rafter house. Despite their good fortune, Nathan can’t help but think what he and Sammy could do if they had more money – maybe even put down a deposit on a place. So instead of taking the cheque to the bank…Nathan heads back to the casino. Will he come up trumps or lose the lot?","production_code":"","runtime":null,"season_number":2,"show_id":6754,"still_path":"/2HrwNQwCPQE6ZAO1K6JfLblWb5v.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"The second season of Packed to the Rafters, an Australian drama television series, began airing on 30 June 2009 on the Seven Network. The season concluded on 24 November 2009 after 22 episodes. The second season aired Tuesdays at 8:30 pm in Australia and averaged 1,881,000 viewers. The season was released on DVD as a six disc set under the title of Packed to the Rafters: The Complete Season 2 on 3 November 2010.\n\nThe second season follows Julie and Dave Rafter through comic highs and soul-searching lows as they prepare for the unplanned but no-less welcome addition to their family of their new baby. We also explore the heart warming arrival into the Rafters world of Dave's birth mother Chel, opening in the process the door to further family revelations. We follow the tumultuous upheavals in the lives of all three Rafter children. Rachel embarks on a promising if-at-first feisty relationship with the cute young electrician who's begun working with her dad. Ben continues his determined pursuit of housemate Melissa's hand in marriage. Nathan, in seeking new career challenges in the music business, struggles to resist strong temptations that may well signal the end of his young marriage.","id":17015,"poster_path":"/4Zs31ohC4R65g8Lu0rCayUkWPPh.jpg","season_number":2,"vote_average":7.1},"3":{"_id":"5257880f760ee36aaa64eea3","air_date":"2010-06-29","episodes":[{"air_date":"2010-06-29","episode_number":1,"episode_type":"standard","id":380749,"name":"The Blank Page","overview":"Julie recovers in hospital after the birth of baby Ruby, ruminating on how life is like a blank page at birth, while her adult children experience how blotted that page can become.\n\nLearning that Sammy has left him and determined to salvage his marriage, Nathan tries to track her down, only to discover she seems to have left for London. All fired-up to jump on a plane, he’s finally dissuaded by the arrival of Trish returning Sammy’s wedding rings. Trying to salvage something from the wreckage, Nathan starts decorating his room as a nursery, and announces his intention to move next door to make a new start.\n\nJake has another fit but he and supportive Rachel must wait for a third before epilepsy is confirmed.\n\nDave joins the modern world of facebook and Carbo becomes a YouTube sensation with his cheeky wa-wa-wincha thumbs-up.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/5bx5sxiCuBcBAy1pe4Az5rKUKtD.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-06-29","episode_number":2,"episode_type":"standard","id":380751,"name":"Saturday Night, Sunday Morning","overview":"Julie's confidence as a mum takes a beating when baby Ruby resists Julie's attempts to breastfeed. Exhausted by lack of sleep, Julie eventually admits defeat - and in doing so, discovers surrender can lead to breakthrough.\n\nNewly single Nathan hits the town with Carbo, and Ben can't help feeling on the outer. It becomes apparent heartbroken Nathan is merely going through the motions and the brothers reconnect over consolation drinks.\n\nJake's confronted by the dating scene too when his mum begins seeing someone, forcing Rachel to give him a serve for his over-protectiveness. Mel's loyalty is tested when she runs into Sammy, who begs her not to tell Nathan she's still in town","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/rmgIY0vB6gCGF6ednq1WvgyH47Z.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-06","episode_number":3,"episode_type":"standard","id":380757,"name":"To Tell Or Not To Tell","overview":"Dave's dilemma over whether to reveal that his birth-father is alive leads to a roadtrip to meet his mysterious other family.\n\nWith all seemingly at peace in the Rafter house, Dave wrestles whether to tell mother Chel that the love of her life, his father Tom Jennings is alive. With Julie's advice to tread carefully ringing in his ears, Dave decides to make up his own mind on the mysterious Jennings. With Nathan's constant partying weighing on Dave's mind, he decides to kill two birds with one stone and drags his son on a roadtrip to Coolong.\n\nMelissa is finding Sammy's secret increasingly difficult to keep from Ben. Ben jumps to the conclusion that he has done something wrong and a reluctant Melissa tells him the truth - Sammy is in Sydney. Ben immediately decides to tell Nathan, but Melissa insists he keep her secret, leading to the first serious fight of their marriage.\n\nRachel becomes the green-eyed monster when Jake's client, an attractive housewife, seems to be coming on to him. Rachel embarrasses herself by behaving like the kind of jealous girlfriend she swore she would never be, to Jake's frustration. Can Julie's wise words about being a tradie's wife smooth over their relationship woes?\n\nMeanwhile, Dave's trip to Coolong seems fruitless - until he runs into nephew Coby Jennings at the local service station. Despite Nathan's negativity, Dave takes a liking to Coby - and resolves to tell Chel the truth.\n\nBut suspicious Coby has a surprise of his own, as we see him scribbling down the rego of Nathan's vehicle. Will Coby discover their true identity and connection?\n\nNathan returns reinvigorated from the road trip, determined to mend his self-destructive partying ways and put Sammy's ghost to rest. Will Ben defy Melissa's wishes and tell his brother the truth?","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/4OEVjdXtM4P8UA5ecsOx1B1ODdS.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-13","episode_number":4,"episode_type":"standard","id":380775,"name":"A Good Husband","overview":"Love is in the air, with Ben plagued with unexpected doubts about his ability in the sack, while a miscommunication between Dave and Julie in the bedroom department sends her into a frenzy of frustration.\n\nBen's basking in the joys of married life when he hears those words every husband dreads - 'not tonight dear, I've got a headache'. Terrified the honeymoon is over, he embarks on a mission to sweep Melissa off her feet. But all of his attempts at rekindling romance are thwarted by Melissa's concern for Sammy, who seems to be spiralling deeper into depression.\n\nWhen Ben shelves his plans to come to Sammy's rescue, Melissa's reminded how amazing her husband is, and his compassion acts as the aphrodisiac he's been searching for. They hurry for the bedroom, only to find Carbo has organised a retro romantic surprise of his own - with unexpected results!\n\nMeanwhile Dave struggles with a sexual issue of a different kind - an embarrassing 'stirring' downstairs while on a job at the boat club. It's the result of months of enforced celibacy due to the new baby, coupled with a photo shoot of swimwear models. Julie's more than keen to resume intimacy but Dave seems strangely reticent. To Dave's embarrassment, Julie shares her frustration during a public outburst at a family luncheon, fuelled by a half- glass of wine. After a series of misunderstandings, Dave finally throws Julie on the bed in a rush of red-blooded abandon - the rest of the house can buy earplugs!\n\nWhile Ben and Dave grapple with the concept of being a good husband, Jake's wrestling with the idea of being a good son. He finally meets Grace's new boyfriend, Doug, and is determined to dislike him from the outset. Needing to escape the situation, Jake comes up with a surprising solution - one that delights Rachel!","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/dgSIkzlsuDIwp8qaW4h4ZOeM5oa.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-20","episode_number":5,"episode_type":"standard","id":380759,"name":"The Invisible Man","overview":"Ted struggles with feeling old and worthless after a girl gang attack and the death of a neighbour.\n\nReturning from a movie, Ted and Chel become involved in a teenage girl gang's vendetta. In the melee, Chel falls heavily and Ted rushes her to hospital. Kidney damage has occurred and Chel's dialysis is upped to three times a week. Ashamed he couldn't protect Chel, and feeling marginalised by the world, Ted begins to retreat into himself.\n\nMelissa discovers someone has been using her toothbrush. Already feeling marginalised in the house full of men and lacking in privacy, this is the last straw. She tracks down the culprit - Carbo who reveals he thinks of toothbrushes as common property. Nathan's sympathy and gift of a new toothbrush only makes Melissa feel worse about keeping Sammy's secret. But when Nathan receives separation papers, will Melissa and Ben risk hurting him further by telling him the truth?\n\nDave raises the spectre of kidney donation. With Julie's tentative blessing, he lays it on the line with Chel. To his surprise, she accepts his offer to test for compatibility - she wants to see baby Ruby grow up.\n\nMeanwhile, Ted and Julie become concerned at the quiet absence of neighbour Mrs Luscombe. A simple visit turns to horror as they discover Mrs Luscombe has died. To Ted, this is another example of the world marginalising the elderly - and he resolves to make a difference through a seniors self defence class and a phone tree, reclaiming his sense of self.\n\nCarbo's internet fame jumps to a new level when he begins receiving sexy gifts from a secret admirer.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/fs2fUhoWrGRrHmRSk7B4wyjJSZR.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-07-27","episode_number":6,"episode_type":"standard","id":380752,"name":"Home Matters","overview":"Rachel's dream of moving in with Jake is thrown into jeopardy by the unexpected return of Alex.\n\nRachel's forced to deal with the fallout when Alex reacts badly to the many changes that have taken place in the Barton household in his absence. Feeling increasingly on the outer, Alex's issues erupt at drinks at the Rafter house, leaving Grace and Jake humiliated and the Rafters reeling.\n\nJake is too angry with Alex to repair the situation and it's left to Rachel to restore peace. She discovers the truth about Alex's misery, and the realisation of how much he needs his older brother forces her to reassess her own house-hunting plans. But exactly how far is Rachel willing to go for the sake of Barton family unity?\n\nMeanwhile Nathan has been roped into helping Chel with her tax. Although her records are in a complete mess, they do have a good time, and in a discussion about attitudes to life he admits that he doesn't like himself very much and blames himself for the break up with Sammy. Chel's take on life gives him food for thought, and Nathan makes a surprising life-changing decision. But his grand intentions are quashed when Julie and Dave fail to share his enthusiasm.\n\nMeanwhile Melissa and Ben are trying to find ways of making the Karandonis house more like home, and decide to replace one of Carbo's ornaments with something more to their own taste.\n\nCarbo, fresh off the back of a disastrous encounter with a woman he assumed was his internet romance, reacts badly to having his home messed with. And things go from bad to worse when he finally meets his real internet lover, only to discover that his misadventure could potentially lead to time in jail...","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/dCH3NoMKnCD7vWZ9psGVJJVuWsv.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-08-03","episode_number":7,"episode_type":"standard","id":380781,"name":"Simple Needs","overview":"Julie is forced to expand her inevitable focus on the needs of her new baby to include the more complex needs of the other members of her family.\n\nJulie has been uncharacteristically disconnected from the daily ups and downs of her family, focussing entirely on baby Ruby. But when Dave reveals the crushing news that he has been rejected as a kidney donor, Julie forces herself to re-engage – especially when she discovers the medical reasons why Dave has been rejected.\n\nNathan has his own crushing news to deal with when Ben and Melissa reveal that wife Sammy never went to London and is ready and strong enough now to reconnect with the Rafters, and meet baby Ruby, all the while conceding that there is no future for her and Nathan. Initially angry at the deception, Nathan has his own secret – he has taken the first steps towards testing as a potential kidney donor, against his parents' – and Chel's – express wishes. The maturity and sensitivity he ultimately shows in dealing with Sammy's request, and his stoic acceptance that their marriage really is over, makes Julie rethink her position, and she convinces Chel that she will not stand in the way of her adult son taking the next step towards donation.\n\nRachel is struggling with deep-buried jealousy towards baby sister Ruby taking all their parents' attention. An amused Jake calls her on it – and despite her denials, the truth rises. Rachel has always been Daddy's Princess – his little girl – and as much as it's ridiculous, she can't help but regret no longer having an exclusive claim to the title.\n\nWhen Carbo's attempts to discourage his teenage stalker Georgia fail, he panics over the potentially serious consequences of their internet flirtation – especially if the police get involved. With nowhere else to turn, Ben brings in the big guns, asking for Julie's help in persuading Georgia that this relationship can never be.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/wQukZglqXxLWTs4ccIvp5IKdu9g.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-08-10","episode_number":8,"episode_type":"standard","id":380770,"name":"Rites of Passage","overview":"Nathan is forced to question his motives for wanting to donate a kidney, triggering a crisis of confidence. Will he be able to put his demons to rest and in doing so, save Chel's life?\n\nAlthough he passes all the physical tests, Nathan is thrown into doubt when the transplant co-ordinator seeks answers on his true motivations for donating a kidney to Chel. When Sammy praises Nathan over the transplant, his feeling of pride seems only to confirm he is donating his kidney for self-serving reasons. While Ben and Rachel have no doubt Nathan is made of the right stuff, their younger brother can't seem to find the words to convince the co-ordinator or himself and he's terrified his failure will spell the end for Chel.\n\nWith Chel's health on the decline, Julie and Dave decide there's no time like the present to hold Ruby's Naming Day ceremony. After a disastrous interview with a comically self-absorbed celebrant, the Rafters plans instead a much more laid-back gathering at the park and ask Rachel, Ben and Nathan to be Ruby's guardians. Baby Ruby's welcomed to the world by those that love and care for her. And perhaps something in the speech Dave makes gives Nathan the answer he's been looking for.\n\nMeanwhile, there are problems at the Barton house, with Alex struggling to accept his mother's new relationship. Alex goes out on a bender and when Grace returns from her date and finds Alex still gone, she flies into a panic. She and Jake lock horns over the whole issue, with Grace feeling that she should be more mindful of Alex's feelings and Jake insisting that she's entitled to live her life. Jake decides it's time both he and his brother stood on their own two feet and comes to a surprising solution to their joint need to cut the apron strings.\n\nCarbo struggles with his own rite of passage when he discovers some grey hairs – and not just on his head!","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/O7ruJ0O9JoshtLNwCgcGE3TIpN.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-08-17","episode_number":9,"episode_type":"standard","id":380754,"name":"The Price of Parenthood","overview":"Someone's watching the Rafter House - and the surprise culprit leads to Dave and Nathan meeting Dave's dad Tom in prison for the first time.\n\nThere's a strange noise in the night and Dave, feeling protective of his brood, gets up to investigate. It appears his misgivings are justified when he finds the living room doors left open. Exhausted Julie can't remember if she shut the doors and Dave feels uncomfortable about the perceived threat. Julie is also ill at ease - spending all her time with Ruby is leaving her desperate for adult conversation. Realising his daughter's suffering from cabin fever, Ted suggests she do something for herself and Ruby - join a mothers' group.\n\nDave pops round to visit Chel after his run. Wanting to put her affairs in order and lay to rest some demons before the transplant, Chel admits that she's reconsidering meeting Tom in prison. The revelation gives Dave himself pause for thought.\n\nMeanwhile, Carbo's stalker Georgia tells Julie that a man was watching their house. In light of Dave's concerns the previous night, Julie decides to play it safe and calls the police. However, with no evidence of a break-in, and no definitive description of the man in question, Julie's left feeling somewhat silly. Georgia refuses to give up and eventually gets a photo of the man in question to the Rafters - and they're shocked to realise none other than Coby Jennings has been scoping their house.\n\nDave's first instinct is to bury his head in the sand but a series of unexpected events conspire to propel Dave, with Nathan as support, to visit his father in prison for the first time. Will facing his father give Dave the answers he's always wanted? And Chel the closure she needs?\n\nMeanwhile, Rachel is shocked to find that Jake and Alex's domestic standards in their new bachelor pad are far from ideal, forcing her to make an ultimatum - unless Jake lifts his game, she's not stepping foot in his house","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/7gAwQCTSL6uWF6VDnGO9kFAQgKW.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-08-24","episode_number":10,"episode_type":"standard","id":380783,"name":"Out of the Comfort Zone","overview":"Ben is forced to step outside his comfort zone when a moral stand clashes with workplace politics.\n\nBen's troubles begin when Melissa reveals she isn't keen on starting a family for years - partially because they can't afford kids. Determined to prove himself as a potential father, Ben asks boss Derek for a pay rise but is turned down. What's worse is being forced to discipline Lexi, friend and employee. Already having trouble giving her a written warning, with Derek on his back, Ben is forced to fire Lexi when she once again arrives late for a shift. However, she reveals her sister is in hospital - and soft hearted Ben agrees to talk to Derek.\n\nBen's aims are thwarted when Ted recognises Derek's daughter Hayley as the leader of the girl gang who assaulted him and Chel. Ted confronts Derek with the unpalatable truth - and is deeply insulted when Derek dismisses him. Unable to let it go, Ted contacts the police, leading to Derek playing personal tit-for-tat and kicking Friend Finders out of the boat club - and ordering Ben to do his dirty work. Torn between keeping his job and standing up for what's morally right, what will Ben decide?\n\nJulie steps out of her comfort zone too by joining a local mother's group. Despite Dave's reassurances that the group will be full of normal mothers, all Julie's fears come true when she is welcomed as a senior mum to the group by Stephanie, a young, trim, and highly competitive mother. Despite herself, Julie is drawn into Stephanie's competitive world. However, the presence of Hamish, a charming stay at home dad, helps bring Julie back to earth and politely resolve matters with neurotic Stephanie.\n\nAfter Rachel's refusal to stay at Jake's untidy house, he has been sleeping every night at the Rafter place. The comical Mexican standoff seems destined to continue forever and Jake realises he has to change tack. He jumps at the chance to babysit Ruby, a plan forming to erode Rachel's resistance. However, his plans go awry when Rachel is called into work and Ruby won't stop screaming. Desperate, he hands Ruby to Ben and Melissa - who prove to be more than capable. In fact, Melissa has finally become clucky, and throws away her contraceptive pills - she's ready to have kids if he is.\n\nJulie and Dave meanwhile return home none the wiser and ask Rachel and Jake to babysit again on the weekend. To Jake's delight, Rachel capitulates - better Jake's house than constant babysitting duty.\n\nResisting the negative impression Tom Jennings gave Dave in the previous episode, Nathan decides to give him a second chance, and asks Dave's permission to see him. Dave refuses, citing Tom's boorish dismissiveness of Chel, but Nathan is inspired by Ben's new-found ability to stand up for himself and politely informs Dave that he will visit Tom against Dave's wishes.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/8SsVg9lZ1k1W5Iw6S5ulDq19b2e.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"Lexi","credit_id":"63b6d21e8ee49c00a1809508","order":516,"adult":false,"gender":1,"id":145247,"known_for_department":"Acting","name":"Phoebe Tonkin","original_name":"Phoebe Tonkin","popularity":21.519,"profile_path":"/kCqD4tiXfSdZ5eGvMcYy9mP4BfI.jpg"}]},{"air_date":"2010-08-31","episode_number":11,"episode_type":"standard","id":380762,"name":"Lessons in Happiness","overview":"Rachel rides the ups and downs of happiness, struggling to find it in the frenetic pace of life. But will her choices have future repercussions for her relationship with her family and Jake?\n\nAt the start of the episode, Rachel's on a high given her graphic designs have just scored CBM a major new client. But then things take a downward turn when an anonymous office worker farts in the crowded lift. To make matters worse, all her hard work comes to naught when CBM fails to hold the client.\n\nRachel's fortunes once again change for the better when she's called in for a secret interview with Paul Morgan at the more prestigious EMB agency - a global player and competitor to CBM. But Rachel is sure she bombed out at the interview and things seemingly go from bad to worse when her boss calls her into his office for a talk, having heard she met with Paul. But instead of being fired, Rachel's offered a promotion to Creative Director - and then is offered the same position at EMB!\n\nRachel's not sure what to do, and turns to Julie for advice. Tension arises when Rachel perceives her mother's reservations as a lack of support. But when Jake has a medical emergency, Rachel's given a painful reminder of what's important in life.\n\nMeanwhile Ben and Melissa are happy with their decision to have a baby and are all over each other at any opportunity - much to Nathan's and Carbo's chagrin. Over the moon at the prospect of a grandchild, Julie unwittingly puts pressure on them by giving them a cook book. Ben and Melissa each try preparing something from the book and both attempts are disasters. But these culinary setbacks are nothing compared to the problems that arise (or don't arise!) every time Ben and Melissa try to have baby-making sex. How can Ben and Melissa relieve the pressure and rediscover the fun of sex without the pressure to conceive?","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/q464rsm3XxQBYZzdePXxKEm4hjy.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-09-07","episode_number":12,"episode_type":"standard","id":380756,"name":"Moments of Truth","overview":"Nathan faces a life-changing moment of truth - the operation to donate a kidney to beloved grandmother Chel.\n\nWith only three days to go until the transplant procedure, Chel's need to put her affairs in order inspires Nathan to write letters to his family, in case he does not survive the operation. However when it comes to writing to grandfather Tom, Nathan struggles to find the words - and resolves to visit him in prison against Dave's wishes.\n\nMeanwhile, Ben reacts badly to Nathan's letter writing scheme - anxiety and concern for his brother manifesting as irritation. Melissa calls Ben on this behaviour, and Ben makes his peace with Nathan before the big operation.\n\nDespite his fears, the operation proves successful for Nathan and Chel - and he asks Ben to destroy the letters he wrote for the family - but not before Rachel sneakily reads hers and is deeply touched by the sentiment. Dave likewise is touched by the revelation of flowers sent from Tom for Nathan and Chel - and he vows to give his father a second chance.\n\nMeanwhile Carbo's \"twitching\" date with Solar Panel agent Amy proves to be a disaster. Undaunted he vows to continue the hunt for a wife.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/ggpcGyrcSqc3KXdNQX1mJiQXOAk.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-09-14","episode_number":13,"episode_type":"standard","id":380748,"name":"Live and Let Live","overview":"Julie explores the principle of \"live and let live\" as she and others struggle to implement the philosophy in various areas of their lives.\n\nA possum has taken up residence in the Rafter roof, keeping the family up at night with its nocturnal activities. Julie finds herself caught between gung-ho Ted, keen to move the blighter on, and softy Rachel, who reminds everyone that the possum was actually here before they were. Julie's more interested in the idea of \"sleep and let sleep\" and finds her intolerance towards the unwanted guest increases in direct response to her sleep deprivation.\n\nMeanwhile, Nathan and Chel are both enjoying a new lease of life, despite still being in hospital. Freed of dialysis, Chel's ready to embrace life to the full, and Nathan encourages her to go travelling again when she's fully recovered. But Ted reacts strongly to Chel's plans, only to get a scalding dose of \"live and let live\" from irate Nathan.\n\nChel's newfound energy and willingness to start afresh encourage Dave to examine his unfinished business with his father. He visits Tom in prison, taking Julie and Ruby along to meet him. Julie is thrown by the experience and she and Tom get off on the wrong foot. Her suspicions aren't helped when Tom asks a favour of Dave, asking him to check out any employment opportunities for grandson Coby. When Jake offers his resignation, feeling like a burden on the business, Dave comes up with a surprising solution - one that not only serves Tom's requests, resolves Jake's issues, but gives Coby a chance at a job working with Dave as Jake's driver. Julie is forced to put aside her suspicions for now.\n\nMeanwhile, Rachel is enjoying the last few days of freedom before starting her new job at EMB. But her heart sinks when she's asked to come up with a few ideas for a new account prior to starting work - for another men's deodorant! Suffering major brain-freeze, Rachel procrastinates by badgering Dave to arrange a visit to meet Tom, dragging Ben along for the ride. She finds the experience deeply troubling. But can she overcome her discomfort to use the insight into prison life to her advantage?\n\nStill searching for \"The One\", Carbo is excited about his date with Erin. But there's some serious crossed wires in play, with Carbo unaware he's been actually been set up with Erin's gay flatmate - the ultimate test in 'live and let live'!","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/pinciIwBCNucD70JHYzYOGFEQhf.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-09-21","episode_number":14,"episode_type":"standard","id":380760,"name":"Know Yourself","overview":"Dave struggles with unfamiliar emotions that threaten to engulf the easy-going father and husband he has always been.\n\nDave Rafter prides himself on being easy going and uncomplicated. He knows himself and life is going well - or so he thought. In rapid succession, life teaches him that no human ever has total control of things - and Dave's easy going ability to roll with the punches starts to fail him.\n\nHe assumes Chel will stay with them to convalesce after her operation, but instead she's heading north to Ballina, to stay with an old friend. Nathan assumes the guest room Dave has prepared for Chel is for him and rejects the imagined offer. Rachel gets emotional about not being able to spend the night with Jake - and Dave takes it personally, thinking that yet another of his children doesn't want to sleep under his roof. Rebuff three. And then his beloved Ruby starts suffering separation anxiety and only wants her mother. It's enough to make Dave feel redundant in his own home.\n\nRachel is trying to settle into her new job at EMB agency but her first day proves disconcertingly frustrating when the scheduled conference with boss Paul Morgan fails to eventuate and she is left all day to her own devices. New colleague Liam seems friendly on the surface but when he supplies her the wrong time for an important meeting the next day, is he friend or foe? And can Rachel really fulfill the demands of her new position?\n\nCarbo's wife-hunting on internet dating sites brings immediate success in the form of Loretta. It's love at first sight, despite warnings from Ben and Melissa that things are moving way too fast.\n\nHaving secured a job in Dave's business, Coby is behaving suspiciously. Does he have a secret agenda and will this come as another blow to Dave if and when he finds out?","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/gol4e7Drs9FrsT3lE3Lt8ua6lvX.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-09-28","episode_number":15,"episode_type":"standard","id":380780,"name":"Don't Go There !","overview":"Ben begins to feel like the victim in a horror film who always goes where the audience knows he shouldn't as he begins to question Melissa's commitment to being a parent. Don't go there!\n\nWhen Melissa feels queasy during dinner, Ben immediately assumes she is pregnant and is beside himself with excitement. But Melissa seems hesitant and confused by the possibility, putting off using the pregnancy test kit until the morning and rebuffing Ben's attempts to open up about her feelings.\n\nNext door there's little rest and relaxation for Dave who is working extra long hours, saving up for a holiday to Fiji. But his plans cop a setback when an unexpected tax bill lobs on the doorstep.\n\nRachel marches off to an important pitch meeting buoyed by Jake's encouragement.\n\nInexplicably, the client rejects all of Rachel's ideas. What she hasn't yet realised is that oily colleague Liam is sabotaging her efforts. Will Rachel unmask Liam's duplicity? Or will he get the better of her?\n\nMeanwhile, Carbo's diet of horror movies has primed him for his own supernatural encounter, and he becomes convinced Mrs. Luscombe's sad, empty house is haunted. His nervous reaction is gold for Nathan who mercilessly revs Carbo up. But the final reveal of \"the ghost\" next door takes everyone by surprise!\n\nCarbo's relationship with Retta continues to bloom, and he hosts a dinner party in an effort to bond her with his housemates. After a painfully hilarious evening, the night ends with a startling announcement from the lovesick pair – one that sends Ben into meltdown.\n\nTo top it all off, Carbo's mum rings with news that plunges the whole household into uncertainty about the future – she is selling the Karandonis house!","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/6OMJO8zl9oGa2cznZfh2yfSmhB6.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-10-04","episode_number":16,"episode_type":"standard","id":380784,"name":"When Worlds Collide","overview":"Rachel's relationship with Jake is pushed to breaking point when her work and personal lives collide.\n\nFor Rachel, work is a world of pain. Colleague Liam is undercutting her at every turn, and Rachel doesn't know how to counter it. After some advice from Medusa, Rachel manages a temporary victory over him - but Liam turns the tables by schmoozing the client around to his idea. But the worst part? Her conflict with Liam is starting to affect her relationship with Jake, who advises her to be direct and take charge.\n\nDave's money and work woes are stressing him out, so Julie offers to help the business by doing accounts, freeing Nathan up to do some light labouring. Busy Julie has a lot on her mind - especially when Ruby decides to stop breastfeeding - and she can't help making mistakes. Calls are missed, bookings lost - and Dave finally explodes, leading him to realise he and Julie need to work as a team to keep the business - and the family - working.\n\nCarbo has failed to talk his mother out of selling the house. As real estate agent Penny Malory and potential buyers rock around, Carbo puts on a desperate show, hoping to scare everyone away, but even Coby's bogan antics fail to discourage one couple, determined to buy. Will the happy Karandonis household be split apart - or will a last appeal to family history and sentiment win the day?\n\nWhen bathroom fittings go missing from their work-site, Coby pleads with Nathan to believe he is innocent. Nathan learns that Coby has trouble with reading and writing. He offers to help him out, and it seems their relationship is at last improving.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/sXp6o0MTPk0s4wxXBv362VCFHHZ.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-10-12","episode_number":17,"episode_type":"standard","id":380778,"name":"Spark of Life","overview":"Ted returns from with renewed spark from a rejuvenating break, only to find all is not well with his family.\n\nDue to work and money pressures, Julie and Dave are snapping at each other and Julie seeks respite in light conversation with Hamish, one of her friends from mothers' group. Concerned by Julie's fond talk of Hamish and Dave's solitary midnight visits to his shed, Ted reminds Dave not to forget the important things in life. Next morning, Dave acts on Ted's advice, and he and Julie set off together for a much-needed afternoon off.\n\nBut their time together is cut short by a call from the police, investigating a second robbery at Dave's work-site. Although Dave is not accused of anything, the coincidence persuades his builder boss to let him go, and Dave takes his pent-up frustration out on Coby, pretty much accusing him of being the thief on the basis of Ted's revelation that Coby's been lying about where he's been living.\n\nNathan, however, is able to assure Dave that Coby was hanging at the Karandonis house with him the previous night. But alone with Coby, Nathan can't help but wonder whether Coby's arrival with beers was merely to create an alibi. His lack of trust, and Coby's growing guilt, cause Coby to lash out - will the Rafters ever give him a break?\n\nHowever, just as Hamish declares his feelings for Julie, both she, and Coby, are given a timely wake-up call. Dave, working too hard, micro-sleeps at the wheel of his van. Shaken by Dave's near-miss, Coby visits Tom in prison to tell him he no longer wants to exploit the Rafters' goodwill. However, Tom isn't going to let Coby off the hook that easily and turns up the heat. Will Coby buckle to Tom's will?\n\nMeanwhile, to the consternation of his flatmates, Carbo is totally besotted by the irrepressible Retta and valiantly trying to go along with her no-sex rule. Driven spare by their comic antics, Ben takes Carbo aside and tells him he has to make a decision about their future together. Carbo agrees and relieved Ben assumes he's going to end the relationship. However, to Ben's dismay, Carbo decides to take things in an unexpected direction!","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/9oweSxOQxM400Scx1Z31rXEAdDK.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-10-19","episode_number":18,"episode_type":"standard","id":380777,"name":"Between the Covers","overview":"A wild night in Kings Cross teaches Nathan not to judge a book by its cover.\n\nNathan's journey begins with a surprising revelation - he's enjoying reading \"Pride and Prejudice.\" The novel's themes resonate with him when he makes the mistake of judging Coby's new living arrangements. Nathan builds bridges by inviting Coby for a night out in Kings Cross - and is surprised when Coby proves to be naive when it comes to life in the big city.\n\nNathan's assumptions are challenged again when Coby meets a flirty, rocker-chick Laura - who turns out to drive a Porsche, owned by her rich daddy, and gives Coby a luxury watch before a night of passion. But the biggest surprise of all for Nathan is the discovery that he's actually becoming good mates with his cousin Coby - a truly significant step forward.\n\nCarbo is making big plans for his proposal to Retta, but Ben is determined to intervene, believing an engagement is only a means to circumvent their pact of celibacy. However, when all tactics to discourage Carbo fail, it's Retta who steps in, having intuited what Carbo's planning and decided that if he's prepared to contemplate a proposal then that's a good enough declaration of his trustworthiness for her.\n\nAfter Carbo overcomes an embarrassing first hurdle, the whole household is forced to endure the couple's belated and enthusiastic consummation of their love.\n\nRachel's deal with Liam to stop playing games and join forces seems to be working, even if their pitch ideas for a sports drink aren't. Forced to cancel a fancy dinner with Jake, Rachel is stunned when he turns up at EMB agency with takeaway - a peace offering to Liam.\n\nThe night goes well, with Jake even pitching a sports drink idea - until Rachel takes the conciliatory mood too far and confides Jake's epilepsy. Later, after a blazing row, Jake defiantly and against doctor's orders drives off in his ute - is it over for the young lovers?","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/g9vit0v4C0ewPp4tnUexqc6Cf4f.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-10-26","episode_number":19,"episode_type":"standard","id":380772,"name":"Breathe","overview":"Rachel takes a crash course in remembering to breathe as she juggles a toxic workplace and an estranged boyfriend. Something's got to give...\n\nDesperate to see each other, Jake arrives in the middle of the night with a gift for Rachel. But once again their issues flare and they fight bitterly. Jake storms off, leaving the gift in the front yard. Keen to put the tension with Liam behind her, Rachel works tirelessly to work one of Liam's ideas up and make it presentable. But when the pitch falls flat, instead of backing Rachel up as planned, Liam shows his true colours once again and kicks teamwork to the kerb.\n\nRachel's life seems to be out of control. Finally opening the present Jake bought her, Rachel realises that Jake truly respects her ambitions, and that she's misjudged him. It spurs her on to bring up the lack of team support with her boss, Paul. Paul dismisses Rachel's concerns, suggesting she focus on the positive and move on. Suddenly Rachel realises she has a choice. Will love triumph? Or is it too late to salvage her relationship?\n\nDave too is taking a crash course in remembering to stop and breathe. A welcome distraction arrives when Julie wins a phone-in radio competition - tickets to see Eric Clapton in concert, plus all expenses paid overnight accommodation at a very ritzy hotel. But Dave can't seem to fully enjoy it, finally admitting to Julie he's been suffering from a nagging but inexplicable malaise. Julie's worried for her husband. Could Dave be suffering from depression?\n\nMeanwhile, Melissa and Ben are still trying, unsuccessfully, to conceive. Retta inadvertently fuels Ben's anxiety by questioning his fertility. He manages to persuade Melissa to pull a favour at work to get his sperm tested and the situation is fraught with comic embarrassment for both of them. Will Ben's \"swimmers\" come up gold?\n\nAlso tonight, Nathan finds a way to help Coby face the challenge of learning to write. In the process, Coby reveals some of his deeply guarded past.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/nXEBUgibrlgDG7TudKuqQ6kUgiS.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-11-02","episode_number":20,"episode_type":"standard","id":380764,"name":"Perfect Bubble","overview":"Certain perfect bubbles in the Rafter world all burst in the most unexpected and confronting ways.\n\nNewly unemployed Rachel is seeing the world in a new light - as her oyster. But first what she'd love more than anything is a holiday with Jake. Unbeknownst to her, Jake takes the hint and organises time off - but before he can spring the surprise, Rachel gets a phone call from former boss Paul Morgan offering her job back with better perks and more money.\n\nFor Rachel, the choice is simple - but for Jake, it's a disappointing slap in the face. The world isn't their oyster, it's Rachel's. If their relationship is going to survive, she needs to start considering his future, too.\n\nStill resisting any suggestion of depression, Dave throws himself into normality, suggesting a Rafter family dinner and offering Coby an apprenticeship, which Coby is hesitant but touched to accept.\n\nHowever, when it's revealed that the police have finally arrested a fence connected to the site robberies, Coby is forced to face the fact that his involvement will soon be disclosed and the truth and his self-hate emerge drunkenly over dinner. Dave explodes with anger, even scaring Julie with his unhinged vehemence.\n\nAs Coby tries to own his guilt by turning himself into the police, Dave is forced to confront his own truth - he has a real problem, possibly the depression Julie has mentioned. But is he willing he do anything about it?\n\nAfter proving his \"swimmers\" are perfectly sound, Ben is even more determined to start a family with beloved wife Melissa, but his world is about to be turned upside down.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/u1xvp6AH4TNoI58L7SEkJUcct0o.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-11-09","episode_number":21,"episode_type":"standard","id":380765,"name":"Rest In Peace","overview":"The Rafter family say an emotional farewell to Melissa.\n\nDave is determined to shelve his own battle with depression, but as tensions build, he finds himself exploding inappropriately in anger.\n\nJulie convinces Dave to go to counselling while Chel, who has not been around to witness the changes in him, returns home to comfort her son.\n\nTom has a second agenda, and despite Coby's attempt to keep him at arm's length, Coby realises he can't escape his grandfather's reach that easily.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/kt1ugDs8bLPAey4SbbDxFQq9veg.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2010-11-16","episode_number":22,"episode_type":"finale","id":380774,"name":"One Day At A Time","overview":"With Christmas and Ruby's first birthday fast approaching, the Rafter family struggle to get back on track.\n\nDave is struggling with his own demons. Julie gently convinces him to give therapy another try. Finally able to find the words his therapist's been pushing for, it seems that Dave might finally be starting to address some of his issues.\n\nAnd then when the whole family gathers for Ruby's first birthday and she takes a first tentative step, it seems all could be coming right in the Rafter world.\n\nJulie discovers that Coby's apprenticeship papers have arrived. In the spirit of moving on, the Rafters feel that life is too short to hold grudges.\n\nDave speaks to Coby, who promises never to let them down again and Dave renews his offer of an apprenticeship to a grateful nephew.","production_code":"","runtime":null,"season_number":3,"show_id":6754,"still_path":"/nrWGZlyI8SAe7iQbT0fchlRKJJz.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"The third season of Packed to the Rafters, an Australian drama television series, began airing on 29 June 2010 on the Seven Network. The season concluded on 16 November 2010 after 22 episodes. The third season aired Tuesdays at 8:30 pm in Australia and averaged 1,894,000 viewers. The season was released on DVD as a six disc set under the title of Packed to the Rafters: The Complete Season 3 on 20 April 2011.\n\nThe third season follows the Rafters as they adjust to life with a new baby and face their toughest test yet, the sudden and tragic loss of a loved one. For Julie and Dave, there's the financial stress of being a one-income family, the sense of being pulled in a hundred directions by the needs of their adult children, and the strain placed on their marriage as the stress and exhaustion of caring for a baby takes hold. Rachel, the eldest Rafter child, struggles to find balance between her high-flying new job and her relationship with Jake; Ben, recently and blissfully married to Melissa, is trying for kids until a heartbreaking accident shatters his world; and Nathan is agonisingly estranged and ultimately divorced from his wife Sammy. Add to the mix, new family members Coby and Dave's father, Tom, and life for the Rafters has never been more packed.","id":17016,"poster_path":"/syraQL0lIMliQKKcDkL031tiW6v.jpg","season_number":3,"vote_average":7.3},"4":{"_id":"5257880f760ee36aaa64eebd","air_date":"2011-02-08","episodes":[{"air_date":"2011-02-08","episode_number":1,"episode_type":"standard","id":380787,"name":"What Lies Beneath","overview":"It's been three months since Ben and Nathan left on their road trip around Australia. Bearded and tanned, Ben returns without Nathan and smooths over his family's concern with a plausible excuse. He believes that if he wants to fit back in with his family, he has to be the fun loving guy he was before Melissa died.\n\nAt home much has happened. Coby has moved in with Jake and started his apprenticeship with Dave. Ruby has started walking and the house has been baby-proofed. Carbo and Retta's engagement party is fast approaching but it's the anticipated arrival of Rita – and what she'll say about the new relationship – which is causing nervous diarrhoea for Carbo and dry-retching for Retta.\n\nAs the family and the Karandonis clan celebrate his return, Ben is upbeat. Even the sight of the cheque for Mel's life insurance doesn't seem to faze him – but a visit back to his old room in the Karandonis house proves how much emotion he's really hiding. Unwilling to worry his family, Ben manages to seamlessly manipulate Rachel into offering her room, happy to stay more permanently with Jake and Coby. But will Ben be able to fool his mother Julie?","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/xK8FuTppNPGIRpQkWkOOKunLYYb.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-02-15","episode_number":2,"episode_type":"standard","id":380788,"name":"In With The New","overview":"It's a time for new beginnings as Dave learns the truth about underlying tensions between Ben and the recently returned Nathan and urges his sons to start afresh.\n\nAs Council Clean-Up Days looms Dave gets the clean-out bug, chucking stuff out from the big and small sheds. He's distracted, however, by Nathan's return from the big road trip. Dave soon picks up on an underlying tension between Nathan and Ben, although neither brother is willing to admit to it. Nathan and Ben have a private talk, alluding to serious issues that took place on the road trip. Ben assures him he's a changed man since he came home and Nathan wants to believe him. But when Dave presses Ben for more information, a defensive Ben nearly steps into the path of an oncoming car. What happened on the road trip and why has it affected both brothers so badly?\n\nJake and Coby head off for a rugby weekend and Rachel is left to enjoy the house alone. She can't help herself and launches into a major rearrangement of furniture to suit her taste. But when she finds the key to Coby's garage, her curiosity gets the better of her and taking a peek inside, is shocked by what she finds there. What is Coby hiding and will he be able to forgive Rachel for violating his privacy?\n\nCarbo meanwhile, is playing the supportive son as Rita, still shaken by her marriage breakup, puts Carbo and Retta to work tossing out all of Theo's possessions. She rallies for a short time, hoping Theo might come back to her, and asks Carbo and Retta to bring Theo's belongings back in again. But when, in a fit of sudden rage, she demands everything be tossed out once more, a physically and emotionally exhausted Carbo decides enough is enough - he's got to put his foot down and call an end to Rita's to-ing and fro-ing. But how?","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/3zje9RbnGVqU3J9e7ewMolJhG2X.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"Jodi Webb","credit_id":"621e4ccf2b8a43004455c14d","order":514,"adult":false,"gender":1,"id":235416,"known_for_department":"Acting","name":"Sarah Snook","original_name":"Sarah Snook","popularity":25.891,"profile_path":"/lvijjedN2HWyaH9DTxNXQ1qv5K9.jpg"}]},{"air_date":"2011-02-22","episode_number":3,"episode_type":"standard","id":380785,"name":"Careful What You Wish For","overview":"Rachel wrestles with the potentially relationship-wrecking pitfalls of getting everything you want - particularly when truth is number one on the wish-list.\n\nGuilt-ridden about invading Coby's private garage space, Rachel compounds her sin by inadvertently offering his artwork as part of an advertising campaign. Under the pump from pushy boss Paul (MARTIN LYNES), Rachel is forced to admit to Coby the truth - she's seen his art. Feeling betrayed, Coby immediately sets about destroying it as Rachel understands how deeply she's hurt him. Hiding his hurt behind forced party-mode, Coby organises an impromptu birthday bash for himself, inviting the Rafter regulars and his bogan mates from Coolong and generally regressing all around. But Rachel suspects Coby's act is actually a mask for his pain. Will she ever be able to regain his trust again?\n\nRachel's also having honesty issues with Jake, who's being vague about his reasons for quitting rugby. Things come to a head at Coby's party, when the police come to take Jake away for questioning. Upon his return, Jake reveals he's been charged with attempted sexual assault, strongly asserting his innocence. Rachel is reeling. Why would Jake have kept the dramatic events of his rugby weekend a secret so long? And how can their relationship survive such a grievous breach of trust?\n\nMeanwhile, Carbo and Retta continue to suffer as Rita (DINA PANOZZO) descends further into loneliness, driving her neighbours mad with dirge-like Greek folk music. Nathan can't bear it, spending the majority of his time complaining to Dave and Julie about his living conditions. At wit's end, Retta turns to Julie for advice, unwittingly sending Rita on a brief foray into the world of internet dating - much to Carbo's horror. Eventually a heart to heart with Julie helps Rita move beyond her impasse and relative peace returns to the Karandonis house.\n\nA vacancy at the local child care centre sends Ruby's baby-sitters Ben and Ted into a spin, and they become locked in a comic competition to prove their baby-sitting worth. Julie's torn, and Dave reminds his wife she's always wanted more time on their hands - but is this another case of being 'careful what you wish for...'?","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/iJcOXmAUUvJyTXg8RzXDfXtaHSI.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-03-01","episode_number":4,"episode_type":"standard","id":380786,"name":"Other People's Eyes","overview":"The aftermath of Jake's ill-fated rugby weekend is fully felt as Julie realises how much perception and misperception can affect the lives of her family and friends.\n\nRachel is determined to support Jake in light of his charges of attempted sexual assault - if only he'd let her. Jake has gone to ground, reeling from the momentary doubt he felt he saw in Rachel's eyes. And when Rachel forces him to talk to her, assuring him of her love and belief, it's clear that Rachel, unlike resigned Jake, is unlikely to wait patiently for a court to reach its verdict. When it comes to light that it is in fact Camel who is truly to blame - not only for the charges but also for not sticking up for Jake - a furious Rachel goes to confront him. But is she only making the situation worse for Jake?\n\nRachel's woes are compounded when her boss, Paul Morgan (guest star MARTIN LYNES) tells her he expects her to deliver a contract signed by Coby as the main artist for their new alcopop campaign. However, Coby can't be shaken from his perception that Rachel showing his work without permission is an unforgivable betrayal of trust. Paul makes it clear that the client won't take no for an answer. With a major campaign and now her job on the line, can Rachel convince Coby to change his mind?\n\nTed meanwhile reveals to Julie that he's developed a crush on a beautiful Chinese woman, Mai (guest star ANNETTE SHUN WAH) who teaches Tai Chi in the park every morning. Feeling simultaneously like an old fool and a teenage boy, his attraction to her has been fuelled by her daily smile and wave to him. But when he reveals he's been learning Cantonese in an attempt to forge a connection with Mai, we see how powerful his crush is. Will Mai respond to Ted's advances, or has he set himself up for a fall?\n\nWhen Julie bites the \"child care\" bullet and goes to check the place out before enrolling Ruby, she is surprised to find Hamish at the centre. His son Jack has been enrolled five days a week since Hamish's marriage broke up. Despite the awkwardness of their last meeting, Julie's heart goes out to him as he reveals he has lost his custody case thanks to a judge whose perception of the world is that children belong with their mothers. Overwhelmed by the unfairness of life towards good men - Ted, Jake, Hamish - Julie can't help but feel that sometimes, despite your best intentions, you can't change people's perceptions","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/f33r8UZxZB3NMCKYlFZnHL3wZaD.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-03-08","episode_number":5,"episode_type":"standard","id":380789,"name":"The Taste of Freedom","overview":"Nathan examines what it means to be free as he receives potentially upsetting news - his divorce from Sammy is final.\n\nThe Rafter family have all witnessed Nathan's heartbreak over the end of the marriage and there is reasonable concern that Nathan could suffer an emotional setback over this. However Nathan takes this potential hurdle and turns it into a springboard for a new and better tomorrow. He successfully packs up the remnants of his time with Sammy, cuts himself free from some family ties, and launches himself into a new business, a new attitude, a new future.\n\nJake and Rachel have been skirting around each other for days, both of them unsure how to bridge the divide that's grown between them. Finally they reach out to each other and reaffirm their love, but secretly both of them are afraid love might not be enough.\n\nCoby is also grappling with the issue of freedom as the day of his sentencing hearing arrives. Having promised to vouch for Coby in court, Dave is initially casually confident that the kid will get a slap on the wrists and that will be the end of it. Julie unwittingly rocks Dave's confidence and he becomes genuinely worried that Coby could be locked up. Can Dave overcome his fear and make a real difference in Coby's life?\n\n.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/gMm4aZjtyCjKQGFvjTOJZcMsmNk.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[{"character":"Waitress","credit_id":"5eb197a5bf0f63001e7f4214","order":511,"adult":false,"gender":1,"id":2626574,"known_for_department":"Acting","name":"Hayley Gia Hughes","original_name":"Hayley Gia Hughes","popularity":0.62,"profile_path":"/uddBI51XZYilS3ZZU9ZnsbP18EZ.jpg"}]},{"air_date":"2011-03-15","episode_number":6,"episode_type":"standard","id":380791,"name":"The Dollhouse","overview":"Nathan doesn't have much luck getting attention for his Parts Exchange website, so he makes up some flyers to distribute around the town, with Ben's help - help Ben is all too willing to give when he realises Nathan's business name \"Parts Exchange\" reads as \"Part Sex Change\" when run together as a domain name.\n\nNathan is bemused when he receives dodgy emails and phone calls and when he finally realises his mistake, is comically furious with Ben for letting him embarrass himself.\n\nJake risks everything by returning to the scene of the alleged attempted rape to confront Jodi (SARAH SNOOK), hoping he can convince her he is innocent of the charge. Has Jake made the right decision, or will the confrontation land him in more hot water?","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/5zVl1GgDJ95i8Kss1ZOKvClfu58.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[{"character":"Jodi Webb","credit_id":"621e4ccf2b8a43004455c14d","order":514,"adult":false,"gender":1,"id":235416,"known_for_department":"Acting","name":"Sarah Snook","original_name":"Sarah Snook","popularity":25.891,"profile_path":"/lvijjedN2HWyaH9DTxNXQ1qv5K9.jpg"}]},{"air_date":"2011-08-23","episode_number":7,"episode_type":"standard","id":380790,"name":"Sweet Sorrow","overview":"Rachel's doubts are intensified as she visits Jake to invite him to her farewell dinner. One thing leads to another and the invitation inevitably turns into a moment of good-bye passion. With Rachel now confused, Nathan convinces her she's made the right decision and she'll regret it forever if she doesn't go. Dave's father, Tom, announces his parole has come through and he's looking forward to spending more time with the family. Rachel tearfully farewells her family and sets off overseas, but Jake takes off in pursuit, determined to catch her, resulting in an emotional roadside exchange between the two lovers.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/fPmYiaNbVVc7FUlvXdw435KhAlk.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-08-30","episode_number":8,"episode_type":"standard","id":380794,"name":"The Male Communication Handbook","overview":"Dave relishes finally having a relationship with his dad, Tom, despite Julie's reservations about her recently paroled father-in-law. Julie raises concerns that Tom may not have reformed his crooked ways. Next door there is tension in the air between the boys, stemming from Carbo's hurt feelings at having not been asked to be a part of Nathan's fledgling car spares business. Meanwhile, Jake and Coby are surprised by the sudden reappearance of Alex, returned from New Zealand. Alex is cagey about what happened overseas, leaving Jake wondering what really happened over in New Zealand.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/xBJ2tePiItExAAIapbzIuwQPuTU.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-09-06","episode_number":9,"episode_type":"standard","id":380793,"name":"From Little Things","overview":"The comic rivalry between Ted and Tom continues. Ted's convinced Tom isn't looking for work at all, instead sneaking off to spend time with an unknown lady friend.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/cAMAhplThw8M6pXMzAgezkmQZhy.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-09-13","episode_number":10,"episode_type":"standard","id":380796,"name":"Big Kids","overview":"Julie finds herself out of her comfort zone when she attends a burlesque dance class with new friend Donna. Dave comes across some lingerie that Julie has bought for her performance, but when she doesn't wear it, he is left feeling jealous and insecure about her relationship with Hamish. Meanwhile, Ted is avoiding house guest Tom at every opportunity, and makes it clear to Nathan he doesn't trust Tom at all. Then, Nathan sees Tom entering a pub when he's supposed to be working, and finds himself in a tricky predicament when Tom denies having been there.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/h9tuy6A0LdI3ERXLQQO1weCguz5.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-09-20","episode_number":11,"episode_type":"standard","id":380797,"name":"Swimming in the Gene Pool","overview":"Grace tells her sons Jake and Alex that she's engaged, and both boys are happy for her until they find out that she has never actually divorced their father. Things become complicated when Grace meets with her ex-husband, as Alex is adamant he never wants to see his father again but Jake's curiosity is restless. Tom is recovering in hospital when he gets a visit from his granddaughter, Bree, but Coby is less than thrilled with the arrival of his feisty sister. Tom encourages them to make amends, but Coby struggles to mend bridges with his sister.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/ShcfgeYSEuiNP3CZu47NlO4cBl.jpg","vote_average":7,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2011-10-04","episode_number":12,"episode_type":"standard","id":380803,"name":"You've Got To Have Friends","overview":"Julie's new friendship with Donna is tested when she discovers that Donna suffers from OCD","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/dxrDV784OfccGENxlWlMTEUx3g4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-11","episode_number":13,"episode_type":"standard","id":380802,"name":"Tipping Point","overview":"Dave leaps at the chance when his successful friend Warney, offers him a shot at the contract for a big office rewiring job. Ben is encouraged by Tom to consider opening up his own bar and Tom offers to help him organise the finances, but Coby immediately becomes suspicious of Tom's motives. Retta begins to feel the pressure of wedding preparations, but things get worse when Carbo brings his livewire cousin Voula, in to help. Meanwhile, Jake trys to hide his attraction to Bree in front of Alex.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/rAKrTBU4fnIFTnAcuePG8KQ0yXP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-10-18","episode_number":14,"episode_type":"standard","id":380799,"name":"Trust Issues","overview":"Ben opens up to Emma about Melissa's death, and the cathartic experience enables him to finally get some closure.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/17bcJfp8K38tXgX4BaxupB4byMv.jpg","vote_average":0,"vote_count":0,"crew":[{"department":"Directing","job":"Director","credit_id":"52578815760ee36aaa64f6f4","adult":false,"gender":2,"id":97589,"known_for_department":"Directing","name":"Steve Jodrell","original_name":"Steve Jodrell","popularity":1.988,"profile_path":null}],"guest_stars":[]},{"air_date":"2011-10-25","episode_number":15,"episode_type":"standard","id":380805,"name":"Risky Business","overview":"Ben initiates a night on the town with the boys, and everyone is impressed by the up-market nightclub who's owner is courting Ben as a potential investor in his next business venture, causing alarm bells to immediately sound for Nathan. Meanwhile, Carbo and Retta reassess their own sex but a return to the club prompts them to take their own risks, which, funnily enough, become a little too public","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/5Ra6tHs1RVZFH9yC0XpWXK1hwqE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-14","episode_number":16,"episode_type":"standard","id":380806,"name":"Second Chance","overview":"Everybody is up in arms about Tom's disappearance with the insurance money. Coby is particularly gutted, secretly blaming himself for not being honest with the Rafters about Tom's part in the worksite robberies.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/8X7NU9RlEJScAyEbXrWJhrBdZ3k.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-14","episode_number":17,"episode_type":"standard","id":380812,"name":"Small World","overview":"Coby is particularly gutted, secretly blaming himself for not being honest with the Rafters about Tom's part in the worksite robberies.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/jG6CTsXOT62aDyS30i1Pog6IHN8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-21","episode_number":18,"episode_type":"standard","id":380809,"name":"Sign of the Times","overview":"Dave's increasingly exhausted as the demands of his new job take their toll, and for the first time in his life he forgets his anniversary. Julie convinces Dave that his exhaustion is a sign...","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/4J2iQjIV5x01hgoucZxCPcRuQ8w.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-02-28","episode_number":19,"episode_type":"standard","id":380810,"name":"Leap of Faith","overview":"Ted resolves to take a leap of faith and seize life with both hands. But as his best-laid plans are put to waste, is his leap destined to become a stumble? Ben agrees to go to the movies with Emma, but asks Nathan and Coby to join them to relieve the pressure of the evening feeling like a date; however, Coby's terrible cinema etiquette and embarrassing antics causes Ben to eject the boys. Now all alone, will Ben and Emma finally succumb to their brewing feelings? Meanwhile, Dave is struggling to take his own leap of faith and accept his brother Matt.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/c0rmhMcDGUDkRqz6GipzunmRkvY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Instructor","credit_id":"62ac3c323009aa03ceac6bb1","order":515,"adult":false,"gender":2,"id":2125335,"known_for_department":"Acting","name":"Daniel Nemes","original_name":"Daniel Nemes","popularity":2.2,"profile_path":"/phtSIB7J8LOyr0dl9BZbrhUE9g1.jpg"}]},{"air_date":"2012-03-06","episode_number":20,"episode_type":"standard","id":380807,"name":"Butterfly's Wings","overview":"Dave and Julie discover how one inexplicable chain of events can almost end in disaster. Dave is alone with Ruby when he gets a call requiring his presence back on site. With no babysitter, Dave takes Ruby with him and enlists Coby to look after her. For a brief moment Coby takes his eyes off Ruby and she wanders into the building site. Panic sets in when Dave discovers she's locked herself in a room with a dangerous drop. Will they get to her before it's too late? Meanwhile, Ben is doing his best to take things slowly with Emma, but Carbo makes his disapproval known after having witnessed Ben and Emma's kiss.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/nXyqEMADOXKWTHL5BzSU4NHYRha.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-03-13","episode_number":21,"episode_type":"standard","id":380813,"name":"Sleepwalking","overview":"When Carbo begins sleepwalking due to wedding stress, Ben must truly become the Best Man and save the day - but in the process realises he's been sleepwalking himself by ignoring his true feelings for Emma.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/camlRElKJdAzSrk5kKrzzBofj9s.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Helen","credit_id":"5eb89db7cc277c00216edb7d","order":512,"adult":false,"gender":1,"id":2633793,"known_for_department":"Acting","name":"Catherine van der Rijt","original_name":"Catherine van der Rijt","popularity":0.6,"profile_path":"/kejHieRMlom23oU1o1bfxI62bvT.jpg"}]},{"air_date":"2012-03-20","episode_number":22,"episode_type":"finale","id":380815,"name":"Endings and Beginnings","overview":"Ben and Emma are both nervously looking forward to their first date. When Carbo and Retta return from the honeymoon from hell, Ben and Emma head out to a restaurant and enjoy a perfect evening.","production_code":"","runtime":null,"season_number":4,"show_id":6754,"still_path":"/wAFk9DjvWyfNAz30FgVx49GPUe5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"The fourth season of Packed to the Rafters, an Australian drama television series, began on 8 February 2011 on the Seven Network. The season concluded on 20 March 2012 after 22 episodes.\n\nSeason four traces the family's fortunes as they attempt to rebuild their lives in the aftermath of Melissa's death. Strong family bonds ensure that traumatised Ben receives warm support as he takes his first steps back into the work-force. Slowly he learns to smile again, embracing a newfound interest in gardening and a growing friendship with his boss's daughter Emma, which might hold the promise of something more. There are further love issues in the Karandonis household, with Carbo and Retta choosing to elope rather than face the comic extravagance of a Karandonis wedding. Julie and Dave, meanwhile, are forced to deal with the consequences for Rachel and Jake of a dangerous accusation flung at him by a drunken woman on a rugby weekend away. Rachel's feelings for Jake are tested to the limit, especially when her boss throws into the confusing mix the chance of a lifetime to work in New York. The Rafters also wrestle with the unexpected arrival of new family members, not the least being the release from prison of Dave's father, Tom. Tom's never quite predictable manipulations ultimately force Dave to take a heart-breaking stand, and cause him to initially misjudge the intentions of his half-brother, Matt. Julie meanwhile finds a new best friend in Donna, though their initial exchanges are hilariously unpromising. Meanwhile Nathan is searching for new direction in his life and his desire to travel forces Julie and Dave to undertake some soul-searching of their own. Ted is also keen to find a greater purpose, mentoring a troubled twelve-year-old boy.","id":17017,"poster_path":"/nrdWk3UgtOMGpZbCCRwUZtPq7FJ.jpg","season_number":4,"vote_average":7.2},"5":{"_id":"5257880f760ee36aaa64eed9","air_date":"2012-04-17","episodes":[{"air_date":"2012-04-17","episode_number":1,"episode_type":"standard","id":380819,"name":"Answering the Call","overview":"Julie receives a surprise invitation from the charming editor of a local paper Adam Goodman - an offer that will ultimately send her into uncharted waters but is she ready to say yes? After interviewing two male sparkies, Dave is stunned when an attractive woman arrives for the interview. Coby arrives home from overseas, having cut short his trip, only to discover in his absence that Matt has moved into the house with Jake. Meanwhile, Ted continues to bond with Cooper. But a disturbing encounter jeopardises not only their relationship, but Teds reputation. Meanwhile, Emma takes tentative steps to claim more of a place for herself in her relationship with Ben, and is relieved when he finally removes his wedding ring. But how much has Ben really moved on?","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/1a4IS2BpQWzQzCf2bL7JDIgywea.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-04-24","episode_number":2,"episode_type":"standard","id":380818,"name":"Great Expectations","overview":"With an expanding business, new premises and a new employee, Dave has high hopes indeed. But it seems what Dave considers chivalry, Frankie considers sexism. Coby too is having trouble adjusting to his new workmate. But is his disapproval masking deeper feelings? Despite his increasingly close relationship with Emma, Ben still hasnt invited her to stay the night - another bridge to cross in his grieving process for Mel. But an unexpected event helps to give him a push.But in the morning Ben doesnt feel the peace he was hoping for, prompting him to come up with a new solution.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/lkU9NoVoDSRT8GoeQ24veKoyI9d.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-01","episode_number":3,"episode_type":"standard","id":380821,"name":"The Power of Words","overview":"Its Valentines Day, and matters of the heart are front and centre. Ben and Emma try to dodge the pressure by doing a shift at the Boat Club. Donna is still carrying a candle for Ted and Julie is unimpressed when Ben encourages Donna to invite Ted to a romantic dinner. It gets off to a rocky start, with Ted turning up at the wrong venue, but Ben rushes to the rescue - and Emma's even more smitten than before. But pressure returns in spades when those three little words are uttered - and someone misses the moment to reciprocate. Meanwhile, Matt decides to play a joke on his flatmates by surprising them both with anonymous Valentines Day cards.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/z1ospBwgKHjkaztkV1E2fPVjU7H.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-08","episode_number":4,"episode_type":"standard","id":380823,"name":"The Things We Do For Love","overview":"Oblivious to the knowing smiles of Dave and Jake, Coby finds himself falling for Frankie","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/7o32WBuoRWL1RtBXqMVVU5XnVOv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-15","episode_number":5,"episode_type":"standard","id":380822,"name":"Judgement Day","overview":"When Jake receives a surprise phone call from his estranged father, he is unable to forgive him for abandoning his family","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/jkbASZuc9WpHLxOEg2Ufxl7u1Nk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jim Barton","credit_id":"60992fbf965220003c3e39c3","order":513,"adult":false,"gender":2,"id":62753,"known_for_department":"Acting","name":"Andy Anderson","original_name":"Andy Anderson","popularity":0.84,"profile_path":"/tT8SFuHto1Mb4Ncam3Rxe8AUZcn.jpg"}]},{"air_date":"2012-05-22","episode_number":6,"episode_type":"standard","id":380844,"name":"Secret Fears","overview":"Dave struggles with his secret fear that his relationship with Jake is permanently damaged and that Julie's relationship with Adam might turn out to be more than just professional.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/fCUCvhaP7WpcnZWKdsQNiF0HY6p.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-05-29","episode_number":7,"episode_type":"standard","id":380825,"name":"The Great Escape","overview":"Ben is being driven quietly crazy by the baby-obsessed Carbo and Retta. Feeling edged out of the world they are creating, Emma suggests that the two of them get out of town for a few days, a large step forward in their relationship for Ben. But once you've found escape, the trouble comes returning from it. After being romantically shunned by Frankie, Coby does his best to avoid her at work. However, when the awkwardness becomes too much to bear, Frankie makes a proposal. Meanwhile, Julie begins life as the 'new kid' at the local newspaper and her new lease on life inspires Dave to move forward with his own business plans, leading to frustrations between the couple. Will venturing into a new future drive a wedge between Dave and Julie?","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/cf6G72PtNS8FrIUgwuFgnsSx7gX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52578817760ee36aaa64f86a","order":502,"adult":false,"gender":0,"id":1240237,"known_for_department":"Acting","name":"John O'Hare","original_name":"John O'Hare","popularity":0.98,"profile_path":null}]},{"air_date":"2012-06-05","episode_number":8,"episode_type":"standard","id":380845,"name":"UnWritten Rules","overview":"When the rules of relationships are broken, who decides the punishment?","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/nbQIHyFk4pOjNju0ALuaE3nkR2x.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-12","episode_number":9,"episode_type":"standard","id":380847,"name":"A Kiss Is Just A Kiss","overview":"Following an awkward moment, Frankie announces she's going to quit and with a niggling feeling of guilt, Julie tells Dave about Adam's visit.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/aUpDgEgJKK6VNQqdoJDSvAMkjuz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-19","episode_number":10,"episode_type":"standard","id":380849,"name":"Letting Go","overview":"Tension remains high in the Rafter house as Julie and Dave struggle to forgive each other. Ted is caught in the middle and is sick of having to hide the real reason behind their squabbles from Ben.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/lP2ZE9ijaTSjxzm6XyBXfKznjaO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Teen","credit_id":"5a4edc6c0e0a26576e00447c","order":509,"adult":false,"gender":2,"id":1377552,"known_for_department":"Acting","name":"Christian Antidormi","original_name":"Christian Antidormi","popularity":3.202,"profile_path":"/llOH8JKET0bmae1dCn5yCwTYmFe.jpg"}]},{"air_date":"2013-01-29","episode_number":11,"episode_type":"standard","id":380850,"name":"The Right Time","overview":"For Ben, it finally feels like the right time to move on from Mel and start a new chapter with Emma, beginning with the purchase of their country cottage. Emma is prepared to put aside her misgivings about the rapid pace at which this is all happening and she and Ben excitedly book an appointment with the bank to set up a loan. But when Ben lends his support to Carbo and Retta by taking them to the hospital for an ultrasound appointment, he begins to reminisce about Mel and the surprising intensity of his feelings throws Ben into a tailspin.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/wneYWSbYtg5b5laO6zoMMoNeBvX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-05","episode_number":12,"episode_type":"standard","id":380852,"name":"Life's Surprises","overview":"Julie thinks about life's surprises after she receives two big ones. Nathan returns back home unannounced and is taken out by the elated family for a noisy family lunch. Nathan has big news and drops not just one, but two bombshells. Ben knows he's not over Mel and needs time to heal.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/1fBiUCttVDiFRPIknH7nd8sqjEx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-12","episode_number":13,"episode_type":"standard","id":380854,"name":"Filling the Void","overview":"Julie tries to find ways to fill the void left by her absent kids, while the calamitous return of Alex sees Jake’s life fuller than ever before...","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/rygGbpjYsdvfcctBalS7P2Y20Ly.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-12","episode_number":14,"episode_type":"standard","id":380851,"name":"Bad Habits","overview":"Dave bets Julie that she can't refrain from giving advice.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/inSxpLFJl7cEQ2CaFwuC3LBP2Ht.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-19","episode_number":15,"episode_type":"standard","id":380855,"name":"Moment Of Clarity","overview":"In light of his ongoing tests, Ted isn't sure whether he should reveal his health concerns to his family. When he suffers a mild stroke he resolves to keep the tests to himself.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/lGPiAI84gtWYEF5cXiely1APOkJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jim Barton","credit_id":"60992fbf965220003c3e39c3","order":513,"adult":false,"gender":2,"id":62753,"known_for_department":"Acting","name":"Andy Anderson","original_name":"Andy Anderson","popularity":0.84,"profile_path":"/tT8SFuHto1Mb4Ncam3Rxe8AUZcn.jpg"}]},{"air_date":"2013-02-25","episode_number":16,"episode_type":"standard","id":380857,"name":"Displacement","overview":"Julie is in denial about Ted's health and Dave carefully voices his concerns but Julie doesn't want to discuss it. Meanwhile, Jake is still having issues with Alex who's partying too hard.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/c2isImjcurOYo2Usc1wEZ9CXymQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jim Barton","credit_id":"60992fbf965220003c3e39c3","order":513,"adult":false,"gender":2,"id":62753,"known_for_department":"Acting","name":"Andy Anderson","original_name":"Andy Anderson","popularity":0.84,"profile_path":"/tT8SFuHto1Mb4Ncam3Rxe8AUZcn.jpg"}]},{"air_date":"2013-03-05","episode_number":17,"episode_type":"standard","id":380860,"name":"Keeping Step","overview":"Julie feels at odds with both Ted and Dave over the severity of Ted's condition - and falling back into step is going to be easier said than done. Meanwhile, despite having rejected Coby's initial interest in her, Frankie is finally letting her guard down.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/c4rKBqoKmpnoq088DbzCGgAmhUb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-12","episode_number":18,"episode_type":"standard","id":380858,"name":"That Heady Rush","overview":"Frankie is caught up in that heady rush a new relationship brings. She seems to be coping pretty well. But can she contain the tsunami that is Coby? Dave is riding a heady rush of his own when Duncan offers the Rafter Electrical team a big contract. But celebratory drinks take a sour turn, and Frankie's forced to rebuff a drunken pass. She assumes it's over and done with. Little does she know, the moment will come back to haunt her.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/ckoWEmRkctSPwqKw7sLnwLXkeL2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-19","episode_number":19,"episode_type":"standard","id":380861,"name":"Got What It Takes","overview":"Dave is determined to take his business to the next level, beginning with his new contract with Duncan. But when Duncan's wandering eye puts him on a collision course with Coby, does Dave have what it takes to stop the impact? Meanwhile, Frankie's not impressed with Coby's seeming lack of maturity, starting with his inability to let go of his rage over Duncan's pass at her.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/gMXaD03rkf2FmaK9OGA4k3mC4eV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-26","episode_number":20,"episode_type":"standard","id":380863,"name":"Weathering the Storm","overview":"Torrential rain and bad luck descends as Jake realises the old adage is true: it never rains but it pours.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/gg9Hg4sbKFA8Jq4BBA44WTPrRcu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-09","episode_number":21,"episode_type":"standard","id":380864,"name":"Free to Choose","overview":"Hours have passed since Coby took off and he's not answering his phone. Dave is feeling privately guilty over having not stopped Coby from leaving when he had the chance. So when he learns that a drunken Coby recently accosted Duncan and tried to get him to drop the assault charges, he calls the troops into action. But time is short, as now they aren't the only ones looking for Coby — the police now have a warrant for his arrest.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/wrfojQ1d1sqr5pyDiYW4YMBVK5x.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Jim Barton","credit_id":"60992fbf965220003c3e39c3","order":513,"adult":false,"gender":2,"id":62753,"known_for_department":"Acting","name":"Andy Anderson","original_name":"Andy Anderson","popularity":0.84,"profile_path":"/tT8SFuHto1Mb4Ncam3Rxe8AUZcn.jpg"}]},{"air_date":"2013-04-16","episode_number":22,"episode_type":"finale","id":380866,"name":"Rewriting History","overview":"As Dave and Julie's 30th wedding anniversary approaches, thoughts naturally turn to family and history. But Julie's view of the past is rocked by a surprise admission from Ted. Meanwhile, Julie also assumes their celebration will be a small affair, but little does she realise, Ben and Nathan have returned for the occasion! Coby is finding it hard to adjust to life in Remand, hiding his pain behind a veneer of black humour.","production_code":"","runtime":null,"season_number":5,"show_id":6754,"still_path":"/WiIdVIKzk26PqcnQ4QX6eI0Nyt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"The fifth season of Packed to the Rafters, an Australian drama television series premiered on 17 April 2012 on the Seven Network. 22 episodes have been ordered for Season five. The Seven network put the series on hiatus again on June 19, 2012 after 10 episodes, despite previously promising that viewers would see a full season run. The show returned on 29 January 2013 with episode 11, accompanied by an increase in viewers compared to previous episodes of the season.","id":17019,"poster_path":"/nKNmz6nVaVJ26ZFIVqSDqKAHxv7.jpg","season_number":5,"vote_average":0},"6":{"_id":"5257880f760ee36aaa64eee7","air_date":"2013-04-23","episodes":[{"air_date":"2013-04-23","episode_number":1,"episode_type":"standard","id":380877,"name":"High Hopes","overview":"Julie has high hopes as she prepares for Nathan's homecoming - but Ted's worsening condition threatens to burst her bubble.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/6Ulqtz2PWakSLAfQN4aEFFwkWf9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-04-30","episode_number":2,"episode_type":"standard","id":380878,"name":"First Time for Everything","overview":"Nathan is working hard to build a solid base for Saskia and Edward in Australia and accepts a job offer despite its obvious shortfalls. Saskia is excited to be joining him but little does Nathan know, for the first time in their married life, Saskia is keeping something from him. Meanwhile, Emma is quietly giddy at the prospect of her blossoming romance with Craig.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/blm7QSNXFCcxMuS1IgDtBns5IgC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-07","episode_number":3,"episode_type":"standard","id":380882,"name":"Setting Limits","overview":"When new employee Buzz brings his wayward son Jackson onto site, Dave begins to suspect his good nature is being taken advantage of. Meanwhile, Donna is mortified when she learns that both she and Emma have been played by Craig. Donna tries to avoid telling Emma, but she can't hide the truth forever, setting up an impending confrontation like no other.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/31Ml6WEIefyI7mlCyVvdJw1XFRq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-14","episode_number":4,"episode_type":"standard","id":380867,"name":"Secret Women's Business","overview":"Having found a place to rent, Nathan's done all he can to prepare for his wife and baby's arrival. But when he gets to the airport, all the planning in the world could not prepare him for what he finds.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/hy5pv2LK3FniwRTfb4jzRHGJdEe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-21","episode_number":5,"episode_type":"standard","id":380869,"name":"Reality Checks","overview":"An exhausted Nathan arrives in London looking for Saskia and baby Edward, desperate to find out why his wife never arrived in Sydney as planned and the answer changes his life forever.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/jhh8JoThlaTwFoju7tjHbGSlQ7Z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-05-28","episode_number":6,"episode_type":"standard","id":380870,"name":"Manning Up","overview":"Ted continues to drift between present day and his memories of the past, forcing both him and his family to come to terms with their new reality. Meanwhile, Julie's grateful for the distraction of helping sleep-deprived Nathan, who's floundering as a single dad with a tough sales job. But Julie's gentle intrusions bother Nathan, who wants to parent his own way.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/xqRLBHBUAo5D3GzqMaSL0ai6Jk8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-04","episode_number":7,"episode_type":"standard","id":380884,"name":"Taking Stock","overview":"Carbo is happy with where his life is and all he wants for his birthday is a romantic night with Retta - just the two of them.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/pNztr5BB2qgW8UAtGr6FegQa2Ja.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-11","episode_number":8,"episode_type":"standard","id":380886,"name":"Damage Control","overview":"Dave's enduring belief that nothing is beyond repair is put to the test when a crisis envelops the Rafter family. Frankie visits Coby in prison and after some initial awkwardness, they fall back into their usual, easy banter. But any hope Frankie has about their future is sidelined when she discovers that someone else has feelings for her. Having had no contact from Buzz, Emma is left wondering if she know that Buzz is actually paralysed by his feelings for Emma.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/iQ6zQYrhCWb8STiakpcVaDFjej7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Ice Cream Vendor","credit_id":"5525abc2c3a36857ae000140","order":508,"adult":false,"gender":2,"id":1451740,"known_for_department":"Acting","name":"Christian Manon","original_name":"Christian Manon","popularity":2.435,"profile_path":"/8Q2frzg8EQQEVqebV0GLZO7vDcp.jpg"}]},{"air_date":"2013-06-18","episode_number":9,"episode_type":"standard","id":380873,"name":"Role Reversals","overview":"Ted is forced to acknowledge that he's becoming a danger to himself and others.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/sCz5yOD1lVDYaA2OXaCOHIAd0mC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-06-25","episode_number":10,"episode_type":"standard","id":380872,"name":"Head vs Heart","overview":"It's a matter of head versus heart as Julie and Dave wrestle with their decision to sell their beloved family home.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/y74sGDbrWnEKLUF9ReVROvjVY1v.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-02","episode_number":11,"episode_type":"standard","id":380875,"name":"Centre of the Universe","overview":"Friends and family gather to say farewell to everyone's favourite family. But before they say goodbye, some familiar faces reappear and the news of a pregnancy is extra cause for celebration.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-02","episode_number":12,"episode_type":"finale","id":380887,"name":"Packing Up the Rafters","overview":"The Rafters begin the emotional task of packing up their beloved family home. But is moving into a small, unappealing rental townhouse their only option? Dave suggests they put their stuff in storage and take Ruby and go travelling instead. Nathan and Ben think it's a great idea, but Julie won't hear of it, unwilling to leave Ted. An impromptu party is organised, with everyone gathered to farewell the house. Even Rachel and Jake make a special appearance. During the party, Ted gives Julie a priceless emotional gift, allowing her to move on. Family and friends gather to farewell the Rafters, presenting them with a moving video tribute organized by Carbo. It is obvious they will be sadly missed — but everyone is rightfully excited about the possibilities the future holds.","production_code":"","runtime":null,"season_number":6,"show_id":6754,"still_path":"/g4GvN2HmknoWRMaDPWaX6eIA7YN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"The sixth and final season of Packed to the Rafters, an Australian television drama series, premiered on 23 April 2013 on the Seven Network. The series will be made up of 12 episodes. The reduction of episodes is due to the series making way for Winners & Losers later in the year.","id":17020,"poster_path":null,"season_number":6,"vote_average":0}}}