{
    "adult": false,
    "backdrop_path": "/7IDS60eOqkBTMiCCowNpGHaooBs.jpg",
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2016-09-20",
    "genres": [],
    "homepage": "http://www.bbc.co.uk/programmes/b07xpl85",
    "id": 68020,
    "in_production": false,
    "languages": [
        "en"
    ],
    "last_air_date": "2016-11-01",
    "last_episode_to_air": {
        "id": 3353728,
        "name": "Episode 7",
        "overview": "",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2016-11-01",
        "episode_number": 7,
        "episode_type": "finale",
        "production_code": "",
        "runtime": null,
        "season_number": 1,
        "show_id": 68020,
        "still_path": null
    },
    "name": "Morgana Robinson's The Agency",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 332,
            "logo_path": "/7HVPn1p2w1nC5oRKBehXVHpss7e.png",
            "name": "BBC Two",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 7,
    "number_of_seasons": 1,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Morgana Robinson's The Agency",
    "overview": "Comedy vehicle designed to showcase the dazzling impersonations of Morgana Robinson. In this seven-part show, Morgana plays the entire celebrity roster of leading talent agent Vincent Mann (of Mann Management). In a groundbreaking move, Vincent has allowed a documentary crew into his agency and given them access to the likes of Miranda Hart, Natalie Cassidy, Russell Brand, Joanna Lumley, Gregg Wallace, Mel & Sue, Danny Dyer and Adele (all of whom are played by Morgana).",
    "popularity": 4.566,
    "poster_path": "/eujRx9ZTaKcX2WuGzY4GmfbBmbv.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2016-09-20",
            "episode_count": 7,
            "id": 80537,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Ended",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 6.5,
    "vote_count": 2,
    "season_data": {
        "1": {
            "_id": "57e9287f9251416888002bb2",
            "air_date": "2016-09-20",
            "episodes": [
                {
                    "air_date": "2016-09-20",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1226738,
                    "name": "Episode 1",
                    "overview": "In this first episode, we are introduced to talent agent Vincent as he deals with Miranda Hart's burning desire to be taken more seriously as an actor and Danny Dyer's diversification into children's literature. Meanwhile, Natalie Cassidy is building up to the National Television Awards and Gregg Wallace is launching a new range of sauces.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68020,
                    "still_path": "/sgCkj4J8jFTRDOTiuoQWzBH5Oz5.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-03",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1228790,
                    "name": "Episode 2",
                    "overview": "In this second episode of The Agency, Vincent receives news of a huge audition for EastEnders star Natalie Cassidy opposite a Hollywood A-lister. For Natalie this is a dream come true but with her dad unwilling to look after himself, Natalie must come up with a faultless plan for dad before she can get to the casting. Meanwhile, Joanna Lumley is haemorrhaging the budget while on her travelogues. With this in mind, Vincent has concocted a solution by keeping Jo Jo's far-flung travels much closer to home. Also in this episode, we meet pop star Cheryl Cole and the new love(s) in her life and Danny Dyer is up for an unlikely but flattering award.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68020,
                    "still_path": "/6DD8DRRFFboSdpmGcoRH3ofWlCY.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-10",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1228791,
                    "name": "Episode 3",
                    "overview": "In this week's episode, we follow Vincent's assistant Rachel as she chaperones global megastar (and relentless chatterbox) Adele through a press junket for her latest album. Back at Mann Management, Vincent is dealing with a terrified Danny Dyer, who has been the victim of a cyber crime. Worried that some 'sensitive' material might be leaked, Vincent suggests that Danny might want to pursue a 'political cause' to create some positive PR. Unfortunately this backfires when Danny misinterprets Vincent's advice to get involved with the badger cull. Meanwhile, Natalie Cassidy is attempting to give something back to the community by setting up a fame school and teaching local kids everything she knows about show business.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68020,
                    "still_path": "/gWLc5hvSnDkNScc1vzlc49J5zox.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-17",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1232491,
                    "name": "Episode 4",
                    "overview": "In this episode, Miranda Hart takes part in a warts-and-all documentary about the police force in a further attempt to be taken more seriously. However, things take a turn for the worse when her unit are called to tense civil disturbance. At Mann Management, Vincent is fielding calls from Fearne Cotton, who sees television show ideas everywhere she looks. Meanwhile, Danny Dyer is suffering from an unusual health complaint that he has mysteriously picked up while spending time alone in his man shed and Natalie Cassidy is planning a big night out at Jason's karaoke.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68020,
                    "still_path": "/iYydgWDMTRxMIrOrmMP18fGraTR.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-24",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1234100,
                    "name": "Episode 5",
                    "overview": "One-off Natalie Cassidy special of the comedy impressions show. Natalie receives a call from her agent Vincent, who has some potentially troubling news. He's heard from a 'soap insider' that EastEnders could be killing off a much-loved character but doesn't yet know who. Natalie has a new contract but is unable to print it off and secure her future because her dad has corrupted the laptop trying to win free iPads online. Natalie wants to get the computer fixed, but the virus it is now carrying is relentlessly ordering online shopping deliveries. Things aren't looking good for Natalie, but there is some silver lining in the shape of the shopping delivery van man who turns out to be a former lover from school. Meanwhile, Nat's sister Cat is having some photos taken in the garage by a semi-professional photographer in the hope of getting some catalogue modelling work. However, when the photographers intentions become questionable, Natalie has to step in.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68020,
                    "still_path": "/A74s7u8PdX4Lo4UERlX41HrcRI8.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-10-31",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1236255,
                    "name": "Episode 6",
                    "overview": "In this episode of The Agency, Vincent has some potentially career-changing news for Miranda Hart - an audition for a part in Game of Thrones. Miranda is thrilled with the opportunity of such a 'serious' role but must suppress her slapstick instincts in order to land the part.\n\nMeanwhile, Vincent has also delivered an interesting gig for Danny Dyer - guest hosting Time Team. This has mixed results, particularly for the archaeologists under his leadership. Elsewhere, Natalie Cassidy is pursuing her dream to host The One Show, which includes her staking out a yoga class in pursuit of Alex Jones and rehearsing in the lounge with dad. Meanwhile, Rachel, Vincent's assistant, is given the tricky assignment of delivering Joanna Lumley to a yogurt commercial.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68020,
                    "still_path": "/42Rh6KMuvy68CDATbsH4bQAf9s6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-11-01",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 3353728,
                    "name": "Episode 7",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68020,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 80537,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    }
}