{
    "adult": false,
    "backdrop_path": "/4EeTsC8lQz32HvPHeJZXNt4u9j1.jpg",
    "created_by": [
        {
            "id": 1695290,
            "credit_id": "58033c729251413ecc004376",
            "name": "Julia Bradbury",
            "original_name": "Julia Bradbury",
            "gender": 1,
            "profile_path": "/4iastyuILLNaRPXGHpeofIIlLI4.jpg"
        }
    ],
    "episode_run_time": [],
    "first_air_date": "2016-02-19",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        },
        {
            "id": 10751,
            "name": "Family"
        }
    ],
    "homepage": "",
    "id": 68305,
    "in_production": true,
    "languages": [],
    "last_air_date": "2017-02-10",
    "last_episode_to_air": {
        "id": 3287311,
        "name": "Laxey, Isle of Man",
        "overview": "The expert walker visits the Isle of Man, where her favourite island walk has it all - an ancient Manx river glen, the world's biggest mining waterwheel and a climb that culminates with spectacular views of England, Scotland and Ireland. With steam trains and electric trams on the TT island famous for Thomas the Tank Engine, her latest trek promises to be action-packed. Last in the series",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2017-02-10",
        "episode_number": 6,
        "episode_type": "finale",
        "production_code": "",
        "runtime": null,
        "season_number": 2,
        "show_id": 68305,
        "still_path": null
    },
    "name": "Best Walks with a View with Julia Bradbury",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 9,
            "logo_path": "/oz9pjTHnBUmlju8OkaTymhKbh6C.png",
            "name": "ITV1",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 14,
    "number_of_seasons": 2,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Best Walks with a View with Julia Bradbury",
    "overview": "Julia Bradbury chooses her favourite countryside treks that anyone can do, any time of the day.",
    "popularity": 1.944,
    "poster_path": "/alYdnycfFMP5r8tdo6UOHtONjAb.jpg",
    "production_companies": [
        {
            "id": 102649,
            "logo_path": null,
            "name": "Outdoor Productions",
            "origin_country": ""
        },
        {
            "id": 106647,
            "logo_path": null,
            "name": "Oh Matron! Productions",
            "origin_country": ""
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2016-02-19",
            "episode_count": 8,
            "id": 81149,
            "name": "Season 1",
            "overview": "Expert walker Julia Bradbury has spent years wandering Britain’s countryside discovering some of its most beautiful and spectacular landscapes. In this series, Julia chooses her favourite, most accessible family treks in search of the perfect walk with a view which anyone can do in a lovely morning or afternoon ramble.",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 9
        },
        {
            "air_date": "2017-01-06",
            "episode_count": 6,
            "id": 215954,
            "name": "Season 2",
            "overview": "Julia Bradbury presents a programme celebrating her favourite walking routes around Britain. In each episode Bradbury explores a different area, taking viewers along little-known paths that reveal beautiful landscapes and great spots to have a picnic or grab some food. The walks chosen are family-friendly and accessible for everyone to enjoy. Routes include a coastal walk along the Menai Straits in Anglesey, across rugged terrain via Castle Crag in the Lake District and a scenic path with a view of Dorset's Jurassic Coast.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    ],
    "spoken_languages": [],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 8,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "58033a44c3a3687504003d53",
            "air_date": "2016-02-19",
            "episodes": [
                {
                    "air_date": "2016-02-19",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1232065,
                    "name": "Anglesey: The Coastal Walk",
                    "overview": "Heading out beside the Menai Straits overlooking Snowdonia, Julia’s costal walk uncovers the birth place of Land-Rover and ends on the romantic Llanddwyn Island, home of Wales’s own female St Valentine and a lighthouse cove with stunning sea views.  Teetering on the North Wales Coast, Julia traces the coastal waters of the Menai Straits, helping to save lobsters and meeting local mussel and oyster pickers, getting to taste them in a sunset beach picnic at the climax of her walk.  On route, Julia also seeks out the lost prototype of the first ever Land-rover which locals believe maybe buried in the Anglesey sand-dunes where its inventor first put it through trials almost 70 years ago. After a paddle in the sea, she discovers why Prince William and Kate have a soft spot for the romantic St Llanddwyn Island, home to the Welsh St Valentine in a setting so spectacular that it reminds Julia of New Zealand’s South Island.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-26",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1232066,
                    "name": "The Lake District: The Borrowdale Walk",
                    "overview": "Julia completes the Borrowdale Walk in the Lake District.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-04",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1232067,
                    "name": "Golden Cap, Dorset",
                    "overview": "Julia takes part in the Golden Cap walk in Dorset.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-11",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1232068,
                    "name": "The High Cup Walk, Cumbria",
                    "overview": "Hidden beneath the hulking great Pennines, Julia sets off from the ancient village of Dufton in search of one of Britain’s best kept secrets – the Grand Canyon of the North, a magnificent hanging glaciated valley, that’s been 500 million years in the making.  A true highlight of the Pennine Way, it was described by walking legend, Alfred Wainwright, as a ‘natural wonder’ and ‘unforgettable sight’.  Along her route, Julia meets a family of Olympic rake makers, learns about the notorious Helm wind – the only British wind deemed worthy of a name - and meets Mike Hartley, the current record holder of the Pennine Way, who ran the whopping 268 miles in under three days!  It’s then on to High Cup Nick, at the top the impressive glaciated valley, with mesmerizing views over High Cup Gill. With over 16 million people visiting the nearby Lake District each year, and just 6000 getting up to High Cup - the Grand Canyon of the North is a very well-kept secret.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-18",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1232069,
                    "name": "The South Downs - The Seven Sisters Walk",
                    "overview": "In East Sussex, the expert walker sets off from the village of East Dean, as she explores one of the longest undeveloped coastlines on the south coast - one that is disappearing at an erosion rate of almost one meter a year. During her three-hour walk Julia discovers the area's rich social history at seaside settlement Birling Gap, learns of the mystery of Sherlock Holmes' retirement, and hears how a lighthouse had to be shifted 17 metres back from the cliff edge.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-01",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1232070,
                    "name": "Yorkshire Dales, The Malham Cove Walk",
                    "overview": "Heading off on a round-trip walk from Malham village, Julia takes in the magical Janet’s Foss waterfall, the awe-inspiring Gordale Scar and the stunning limestone pavement at Malham Cove, with its spectacular views across the Yorkshire Dales.  A hub for both the adventurous and creative alike, the Malhamdale landscape has been an inspiration for so many – from the likes of J. R.R. Tolkien to influential master painter JMW Turner – not to mention Harry Potter and a few other Hollywood Blockbusters!  This walk sees Julia explore what makes Malham so memorable – from its traditional hay meadows and lush green dales, to the high drama of its ancient limestone marvels - including the spectacular crescent-shaped cliff of Malham Cove; a former giant waterfall and true highlight for people taking on the much longer Pennine Way trail.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-08",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1232071,
                    "name": "Cotswolds: The Cleeve Hill Walk",
                    "overview": "Julia travels to the Cotswolds, near Cheltenham, to uncover some of the finest views in the south of England. Starting in Winchcombe, the ‘jewel in the Cotswold Crown’, Julia takes up the many walking trails on offer to discover an ancient burial mound, historic castle and spectacular views from the top of Cleeve Hill - the highest point in Gloucestershire.  Heading out of Winchcombe, a village famous for its walking trails, Julia explores the historic Sudeley castle – home to the last of Henry VIII’s six wives. She soon finds herself atop of Belas Knap, an ancient Neolithic barrow that contained the remains of at least 38 human skeletons.  Following along the Cotswold Way, she reaches the climax of the walk, Cleeve Hill Common, an unusual setting that sees sheep and walkers happily sharing the landscape with a century-old golf course. But the Common offers them all extraordinary views, sweeping along the valley of the Severn Estuary and across to Wales to the distant Brecon Beacons - a satisfying six-mile walk.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-15",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1232072,
                    "name": "The Peak District: The Kinder Scout Walk",
                    "overview": "Julia comes home to her Peak District roots, exploring the first five miles of The Pennine Way, where she began walking as a young girl. Her route takes in the spiritual home of popular walking as she heads up to Kinder Scout on the moor-tops – the setting for the famous 1932 mass trespass.  Heading off from the Derbyshire village of Edale, Julia joins the long history of walkers to ascend the Kinder Plateau, a place so integral to the creation of Britain’s very first National Trail over 50 years ago. On route, she catches up with her dad and discovers other surprising locals - including an ancient wood-bowl maker and the hard-working mountain rescue team who keep us all safe on the wild, misty moors.  It’s a walk in honour of those who helped open up the countryside and turned Britain into the walking paradise of the world. As Julia reaches the top of the moors the staggering views across the Edale Valley make it all worthwhile.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "Expert walker Julia Bradbury has spent years wandering Britain’s countryside discovering some of its most beautiful and spectacular landscapes. In this series, Julia chooses her favourite, most accessible family treks in search of the perfect walk with a view which anyone can do in a lovely morning or afternoon ramble.",
            "id": 81149,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 9
        },
        "2": {
            "_id": "616b078e53866e0093cb9eef",
            "air_date": "2017-01-06",
            "episodes": [
                {
                    "air_date": "2017-01-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3287305,
                    "name": "Coasts: Old Harry Rocks, Dorset",
                    "overview": "Julia begins by heading to one of the most famous landmarks on the Jurassic Coast - Old Harry Rocks in Dorset, which boasts spectacular views towards the Isle of Wight and of the offshore chalk stacks, good opportunities for bird and butterfly watching and a rich variety of wild flowers in spring and summer. There are also miles of golden sandy beaches and a dramatic vista of the bay.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-13",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3287306,
                    "name": "Fells: Pen-Y-Ghent, Yorkshire Dales",
                    "overview": "At 694 metres in height, Pen-y-ghent is the smallest fell on the Yorkshire Three Peaks Challenge, but the dramatic summit affords far-reaching views above the Dales, with plenty of surprises en route. The peak lies 3km east of Horton in Ribblesdale and the Pennine Way links the summit to the village. As Julia reveals, the route is around 5km in length, as the Way curves initially to the north before turning east to reach the summit.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-20",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3287307,
                    "name": "Lakes: Loch Lomond, Scotland",
                    "overview": "Julia’s walk offers one of the most outstanding views over Loch Lomond – at 24 miles long, it’s the largest loch in Scotland by surface area. Picking up the West Highland Way, she hugs the bonnie banks through to the little village of Balmaha on the eastern side of the Loch, and takes a quick boat trip to the ancient Lomond isle of Inchcailloch, with magnificent views across the water and out to the surrounding fells. She finishes with a well-deserved Loch Lomond ice cream on her return.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3287309,
                    "name": "Countryside: Sandstone Trail, Cheshire",
                    "overview": "North-West England’s most popular mid-distance walk, the Sandstone Trail offers a vast array of attractions en route - from celebrity wedding favourite: Peckforton Castle; to the medieval fortification of Beeston Castle. Julia takes in the rolling countryside pastures and panoramic views over the Cheshire plains and Liverpool. It’s a popular route for dog-walking and sports – from the local Tough-Team race, to one of the top board and bike tracks in the country, not to mention the intrepid 4x4 off road experience at Peckforton – Julia packs it all in.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3287310,
                    "name": "Rivers: Watersmeet, Exmoor, Devon",
                    "overview": "A hidden treasure on the Exmoor coast, Julia’s walk sets off from the picturesque harbour-town of Lynmouth and meanders under the tree-green canopy of water-rapids following the East Lyn River and the Hoar Oak River, merging together at the stunning Watersmeet National Trust café – the perfect spot for a hard-earned cream-tea.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-10",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 3287311,
                    "name": "Laxey, Isle of Man",
                    "overview": "The expert walker visits the Isle of Man, where her favourite island walk has it all - an ancient Manx river glen, the world's biggest mining waterwheel and a climb that culminates with spectacular views of England, Scotland and Ireland. With steam trains and electric trams on the TT island famous for Thomas the Tank Engine, her latest trek promises to be action-packed. Last in the series",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 68305,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "Julia Bradbury presents a programme celebrating her favourite walking routes around Britain. In each episode Bradbury explores a different area, taking viewers along little-known paths that reveal beautiful landscapes and great spots to have a picnic or grab some food. The walks chosen are family-friendly and accessible for everyone to enjoy. Routes include a coastal walk along the Menai Straits in Anglesey, across rugged terrain via Castle Crag in the Lake District and a scenic path with a view of Dorset's Jurassic Coast.",
            "id": 215954,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    }
}