{"adult":false,"backdrop_path":"/vtvTrmtWD6JF6UEHtiwDD0jHQp0.jpg","created_by":[],"episode_run_time":[35],"first_air_date":"2016-10-24","genres":[{"id":80,"name":"Crime"},{"id":18,"name":"Drama"},{"id":9648,"name":"Mystery"}],"homepage":"","id":68342,"in_production":false,"languages":["zh"],"last_air_date":"2016-12-12","last_episode_to_air":{"id":1241480,"name":"Without the Lion, the Snail only has a Shell","overview":"Zhao Lang sees Xu Xu's signal and picks her up. They follow breadcrumbs of the drawing left by Ji Bai. At the Mekong River Ji Bai collapses.  Xu Xu shoots Xiao Lu in the arm before she can kill Ji Bai. Ji Bai goes into a coma. Director Zhan and the border patrol capture Po and Xiao Lu. During Zhao Han and Yao Meng's wedding, Ji Bai arrives to propose to Xu Xu and return Yao Meng’s resignation letter.","vote_average":0,"vote_count":0,"air_date":"2016-12-12","episode_number":21,"episode_type":"finale","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/zqZCJL6GtzTDTbk5s0MgFHhF5ZE.jpg"},"name":"When a Snail Falls in Love","next_episode_to_air":null,"networks":[{"id":1056,"logo_path":"/neufSFU0ZrXxA3c0JRNpuNXzLdx.png","name":"Dragon TV","origin_country":"CN"},{"id":2007,"logo_path":"/uBCIoV9AUGIdfXTrtJ6CRIxOZF6.png","name":"Tencent Video","origin_country":"CN"}],"number_of_episodes":21,"number_of_seasons":1,"origin_country":["CN"],"original_language":"zh","original_name":"如果蜗牛有爱情","overview":"Detective Ji Bai and new criminal profiler Xu Xu may seem like an awkward teacher-student pair at first glance, yet they are actually the best partners in the police force, solving one crime after another. Ji Bai slowly falls in love with Xu Xu, yet she is a girl who is as slow as a snail when it comes to love. Just as Xu Xu starts to reciprocate Ji Bai's feelings, the dormant \"Angel's Killer\" reappears.","popularity":11.01,"poster_path":"/7e2FLcsjeIvqtUxVY6O696jA4v5.jpg","production_companies":[],"production_countries":[{"iso_3166_1":"CN","name":"China"}],"seasons":[{"air_date":"2016-10-24","episode_count":21,"id":81216,"name":"Season 1","overview":"","poster_path":"/9nVnGRK8xcdQXkBS4AMkCL74RjB.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Mandarin","iso_639_1":"zh","name":"普通话"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.7,"vote_count":12,"season_data":{"1":{"_id":"5806852ec3a3684d4e009eb5","air_date":"2016-10-24","episodes":[{"air_date":"2016-10-24","episode_number":1,"episode_type":"standard","id":1232788,"name":"New Interns","overview":"Ji Bai goes to Myanmar to obtain a pipe that belonged to Ye Zixi's father.  Two new female intern police officers are assigned to the Violent Crimes Unit. Yao Meng is strong, confident and the Public Security University pentathlon champion. Xu Xu is small and frail and was assigned the Director and the Psychology Institute to act as a profiler.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/gmdulPBJf2GkRSSEBImhHIzBy3O.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-24","episode_number":2,"episode_type":"standard","id":1232789,"name":"Kidnapped","overview":"The Violent Crimes Unit's first assignment involves a case where cutters marked with the Ye Corporation logo were hidden in a park and children were hurt. Zhang Shiyong, the president of Ye Corp hardware was kidnapped. The ransom money is prepared and taken to the airport for the exchange.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/nxVRMY5MFqhaNqQGrxQwC6umuji.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-24","episode_number":3,"episode_type":"standard","id":1232790,"name":"Evidence vs Speculation","overview":"XuXu is taken hostage by Yang Yu but Ji Bai is able to save her. During interrogation of Yang Yu, the kidnapper, Xu Xu determines that he was determined to kill Shiyong anyway. Attempting to convince Ji Bai of her theories, Xu Xu becomes exasperated. Ji Bai demands evidence and not just speculation, instructs her in correct investigative procedures, finds fault with her assumptions and admonishes her.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/iFEsDoKuDbnytbFLn1cB7KZb0Tq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-31","episode_number":4,"episode_type":"standard","id":1233884,"name":"Grounds for Dismissal","overview":"Zhao Han stands up for Xu Xu but Ji Bai tells him if she doesn’t qualify for her fitness exam in 3 months, both of them will be dismissed from the team. Yao Meng works with Xu Xu to get her into shape. Ye Corp shows a marked decrease in profits causing major concerns. Xu Xu questions Yang Yu and Ye Zixi further because she believes the kidnapping case is more complex than originally thought.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/dHZV6UZWbrTXQ9azM2yYXBVEAcZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-31","episode_number":5,"episode_type":"standard","id":1233885,"name":"Xu Xu's Mistake","overview":"Xu Xu and Yao Meng find conflicting data in the statements while investigating the scene. Ji Bai finds links to human trafficking while watching camera footage. Ye Corp's sensitive information is leaked.  Xu Xu discloses that Yao Meng is concerned about Ji Bai's feelings and becomes distressed when she realizes she hurt Yao Meng. Ji Bai thinks she may be teachable. The team is called to the murder of a missing mute girl.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/iMcjjwkw2ARH8oowUeTSzqGbXtM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-10-31","episode_number":6,"episode_type":"standard","id":1233886,"name":"The Raid","overview":"Both Xu Xu and Yao Meng are excited when Ji Bai decides to teach them both. However, Xu Xu must still pass the fitness test. Xu Xu comes to the conclusion that Ye Zixi is involved in the kidnapping scandal. The team raids the hideout of Ma Rongrong’s murderer. They capture him, Chen Yong, and another trafficker, Guan Nam. Yao Meng gets cut while apprehending Guan Nam.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/4pGp8qFaIzaGkZ1bQlWZKlCjG52.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-07","episode_number":7,"episode_type":"standard","id":1236076,"name":"Zixi's Death","overview":"When Ji Bai responds to Zixi’s plea for help, he finds her dead.  Xu Xu is called in to assist. Xu Xu's theory that Zixi and Shiyong were having an affair is reinforced. Yao Meng and Zhao Han continue to interrogate the two human trafficking perpetrators. Ye Corp stocks continue to plummet. The Ye family is questioned about the incidents. Ji Bai tries to control his emotions but Xu Xu knows he is under stress.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/ibAlZxEDgcxPeOFy9q6TpXfuVNw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-07","episode_number":8,"episode_type":"standard","id":1236077,"name":"Interrogation","overview":"Shiyong is questioned about his alibi for the time of murder. Phone evidence indicates someone is framing him. Ji Bai finds out that Ye Corp lost 2 billion in their overseas accounts. Ye Qiao is called in for questioning. Xu Xu accompanies Ji Bai when he takes a smoke break. She asks to be in charge of his lighter so she can determine when he reaching his emotional limit.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/dqDuvjf9UYKYu0TQKKXih0XE465.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-07","episode_number":9,"episode_type":"standard","id":1236078,"name":"Xu Xu's Story","overview":"Ye Qiao confesses to killing Ye Zixi. Ji Bai is deeply affected by Zixi’s death and Ye Qiao’ confession.  He turns his lighter over to Xu Xu. Xu Xu discusses her childhood with Ji Bai. The evidence and statements are troubling Xu Xu so she decides to reenact the murder. Yao Meng also realizes something is wrong and seeks Zhao Han’s help.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/8yZ9QVoC8RYEIDRQi8IEvKdqqt3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-14","episode_number":10,"episode_type":"standard","id":1241469,"name":"The Suspected Murderer","overview":"Xu Xu is startled when Ji Bai arrives. Working together they realize Ye Qiao is covering up for someone. Lanyuan and Zhishan show up to perform ceremonial rites. Lanyuan and Ziqiang are brought in for questioning. After seeing his father at the police station Ziqiang draws a knife and attacks the officers. Ji Bai is cut while saving Xu Xu. They compare notes on who the suspected murderer is.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/qJBZGyZZh2AlWdyqB2Pm5RVk8gH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-14","episode_number":11,"episode_type":"standard","id":1241470,"name":"The Real Culprit","overview":"Evidence proves Zixi’s death was manipulated and she was stabbed while semi-conscious. Ziqiang confesses but Ji Bai doesn't believe she is smart enough to manipulate the murder. Further interrogation proves that Ziqiang did push Zixi over the rail but that she didn’t die from it.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/3KLPFWBhcXFRzl39vTeRIbYDKR3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-14","episode_number":12,"episode_type":"standard","id":1241471,"name":"The Snail Falls In Love","overview":"Ye Lanyuan discovers the company was used in drug smuggling. Xu Xu realizes she is in love with Ji Bai when Yao Meng tells her the snail has fallen in love with the lion.  Guan Nam and Yao Meng infiltrate the trafficking group. Yao Meng and Zhao Han’s friendship grows. Xu Xu and Ji Bai pose as a couple which makes her self conscious. Ji Bai jokingly says there is no gender difference for a monster.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/6cjrZ2AIPSlhvTqnxmHs4CwuqNe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-21","episode_number":13,"episode_type":"standard","id":1241472,"name":"The Sting","overview":"Director Zhan’s informant tells him the Golden Python is on the move. Zhao Han lets Yao Meng know his concern for her. Xu Xu nags Ji Bai about drinking coffee before sleeping. Zhan shares his concerns about the sting with Ji Bai. The raids on the drug and human trafficking groups are completed. The sting captures Brother Lu but not Lu Ge. The captives are transferred to a hospital for screening.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/2AoVnkRsGkG22jqxDUsln1VAjjl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-21","episode_number":14,"episode_type":"standard","id":1241473,"name":"Disarray","overview":"The captive wearing high heels troubles Xu Xu. Yao Meng and Zhao Han take the captives to the hospital. Room search evidence convinces Xu Xu the woman is Lu Ge. Lu Ge kills a girl and escapes. Yao Meng catches up to Lu Ge who has a nurse with a knife at her throat. Disregarding procedures Yao Meng drops her gun. Lu Ge kills the nurse, stabs Yao Meng and shoots Zhao Han. Ji Bai goes before a disciplinary board.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/czEPQVOCKYwtqnz2Gd068l7UzIJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-21","episode_number":15,"episode_type":"standard","id":1241474,"name":"Putting Yourself in the Face of Danger","overview":"Yao Meng reproaches herself for what happened to the nurse and Zhao Han. Xu Xu confesses it is her fault for her condition. The disciplinary board decides the interns can remain in the force. Ji Bai’s team is assigned as a Special Investigative team to work with Myanmar's military forces to bring down the Jin Dug group. Yao Meng experiences PTSD upon return to work. Xu Xu qualifies to be a member of the Special Team.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/9db4jBMSiHNctyS7hPUt74PtBTh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-28","episode_number":16,"episode_type":"standard","id":1241475,"name":"Joining Forces","overview":"The team joins Tisa’s force. Ji Bai enjoys the company of his little monster. He wants to see her drawings but she refuses. Xu Xu is totally enamored with him. Ziqiang commits suicide after leaving a note detailing his involvement with Zhishan. Zhao Han and Yao Meng grow closer. The team's search for the Jin Dun group begins at Wood Bar Village. (Jin Dun, Lu Ge and Golden Python form the Golden Armor coalition.)","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/4Of7OAnLinrIp47T5xwXkpxrbxL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-28","episode_number":17,"episode_type":"standard","id":1241476,"name":"The Hideout","overview":"Gangsters beat up village informants but Hou Zi tracks them to the Big Millionaire Casino. They beat up local store owner Zhou Cheng Bo but the team arrives in time to help. Yao Meng finds Shiyong brutalized and dead. Ji Bai goes to visit Cheng Bo. An informant delivers the casino plans to Xu Xu. A bomb explodes at Cheng Bo’s store.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/4U5SQCMr4lAg1xPHKnBi0Ns3j19.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-05","episode_number":18,"episode_type":"standard","id":1241477,"name":"The Bust","overview":"Ji Bai and Cheng Bo are missing. A local reports 2 people getting beat up. Xu Xu goes to the Big Millionaire Casino to locate them. Xu Xu’s identity is exposed and she attempts to flee. The team arrives in time to save her. Tisa’s forces bust the casino operation. Ji Bai and Xu Xu capture Hu Shishan.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/7z9TlkkEt0YiX9S3KUVuFQ8ZpgC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-05","episode_number":19,"episode_type":"standard","id":1241478,"name":"What Kind of Man is General Po?","overview":"While Xu Xu was dressing his wounds Ji Bai ask Xu Xu if that could be considered blind worship and teases her about her drawings. When Xu Xu goes to get General Po’s approval to transfer Zhishan back to China she is shocked to find he is cruel. Other Major Crimes Division teams captured all of the Jun Din/Lu Ge group members except Jun Din and Zhao Xiao Lu (Lu Ge). Apparently she had received advanced warning.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/7rCXFWwmwx0YDkD9xdSvdqt3YOR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-12","episode_number":20,"episode_type":"standard","id":1241479,"name":"Blindsided","overview":"Jin Din is caught by Director Zhan. Xu Xu informs him that General Po is the Golden Python. Xu Xu is taken into custody. Xiao Lu/Lu Ge is Po’s girlfriend and on the train. Ji Bai is hit, the team members revolt and they take over the train. Po decides to escape to Laos and decouples the rear cars. Jue Wen orders that Po be taken into custody. Ji Bai forces Xu Xu off the train so she can get help. Ji Bai is shot by Xiao Lu.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/kx8decnsE3qqucvAulYgMmBwv5w.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-12-12","episode_number":21,"episode_type":"finale","id":1241480,"name":"Without the Lion, the Snail only has a Shell","overview":"Zhao Lang sees Xu Xu's signal and picks her up. They follow breadcrumbs of the drawing left by Ji Bai. At the Mekong River Ji Bai collapses.  Xu Xu shoots Xiao Lu in the arm before she can kill Ji Bai. Ji Bai goes into a coma. Director Zhan and the border patrol capture Po and Xiao Lu. During Zhao Han and Yao Meng's wedding, Ji Bai arrives to propose to Xu Xu and return Yao Meng’s resignation letter.","production_code":"","runtime":35,"season_number":1,"show_id":68342,"still_path":"/zqZCJL6GtzTDTbk5s0MgFHhF5ZE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":81216,"poster_path":"/9nVnGRK8xcdQXkBS4AMkCL74RjB.jpg","season_number":1,"vote_average":0}}}