{"adult":false,"backdrop_path":"/9o9PqA3qQYANHot40BJ1Ww5wFfA.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2013-07-06","genres":[{"id":16,"name":"Animation"},{"id":10762,"name":"Kids"}],"homepage":"","id":68801,"in_production":false,"languages":["en"],"last_air_date":"2014-05-27","last_episode_to_air":{"id":1243658,"name":"For the Love of Cake","overview":"The Annual Dessert Contest is around the corner and this year, Ylva decides to make her special Myrthus Cake to retain the trophy in Flake. But Baltak, spying on her, gives the same idea to Morag, his wife. The only problem is that Myrthus is hard to find and only grows on one island south of Flake. A race starts between Halvar and Baltak to get to the Myrthus first, and only Vic will be able to prevent traps and cheats along the way.","vote_average":0,"vote_count":0,"air_date":"2014-05-27","episode_number":78,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/4YXIUeUTBjdaheYoRP08pAH1KHu.jpg"},"name":"Vic the Viking","next_episode_to_air":null,"networks":[{"id":38,"logo_path":"/gHAm9zYjSX8IAJWuy2s4Du6onuo.png","name":"Network Ten","origin_country":"AU"}],"number_of_episodes":78,"number_of_seasons":1,"origin_country":["AU","FR"],"original_language":"en","original_name":"Vic the Viking","overview":"Welcome on board the drakkar to sail the seas and share the adventures of our Viking crew. In his home village of Flake or coming alongside far and unknown lands, you will share unique adventures with Vicky.","popularity":7.016,"poster_path":"/ecERSCarOYd8NKzYbv2cUt2LDRc.jpg","production_companies":[{"id":51863,"logo_path":"/qkh0kHmfKanKxoi4hlL8BeU7SRm.png","name":"Studio 100 Animation","origin_country":"FR"}],"production_countries":[],"seasons":[{"air_date":"2013-07-06","episode_count":78,"id":82214,"name":"Season 1","overview":"","poster_path":"/5EY4WUIogwjSXjwSWkMad9IZTIQ.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.7,"vote_count":3,"season_data":{"1":{"_id":"583426eb9251416d1f0023f9","air_date":"2013-07-06","episodes":[{"air_date":"2013-07-06","episode_number":1,"episode_type":"standard","id":1243586,"name":"Almost Treasure Island","overview":"An old shipwrecked sailor is the accomplice and bait for a group of pirates, who use the tempting prospect of a fabulous treasure to lure sailors in order to seize their riches more easily. Our Vikings fall into the trap, but Vic and Ulme use their talents as puppeteers to scare the brigands of the seas and send them packing.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/1Cr60ySQ7ssg7WNvTkxRxi8QhUM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-06","episode_number":2,"episode_type":"standard","id":1243583,"name":"Thor's Thunder","overview":"The drakkar runs aground on a reef in the fog! When they call for help, the Vikings only draw the attention of Sven and his men, who steal their cargo. Vic manages to recover the goods by making it appear like the pirates have been cursed. To do this, he uses bamboo sticks (bartered with a Chinese merchant during their last stop) that are actually filled in with gunpowder (kind of crafted firecrackers). These are loud enough to sound like the god Thor's thunder, and also explode with an unbelievable show of fireworks.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/lZCsZSNrth6Kn5F9qT48RAjKCju.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-13","episode_number":3,"episode_type":"standard","id":1243585,"name":"Grist for the Mill","overview":"Halvar, his men and the drakkar are kidnapped by Sven! In order to catch up with them, Vic whips up some kite-surfing gear with a board and burlap bags. With Snorre and Tjure, he manages to get his father's drakkar back. Since the sail is ripped, Vic has the idea of making it move by building two large paddle wheels built with the help of Tjure, the crew's carpenter, and Snorre. Astounded by this boat with wheels, Sven's men take their eyes off of their prisoners and don't see Vic climb on board and cut the prisoners' ropes. The prisoners take the opportunity to attack and Vic helps them imprison their kidnappers by trapping them in the middle of the paddle wheels.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/g6P5GglAIQl9oGrGMdWMRdbn2xR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-13","episode_number":4,"episode_type":"standard","id":1243584,"name":"The Magic Lantern","overview":"In order to scare away tax collectors sent by Eric the Greedy, Vic invents a magic lantern (from flat pieces of translucent stones painted by Ulme and mirrors that focus the sun's light). He uses this to project \"monsters\" at the entrance to a cave (where the villagers have hidden all their wealth), frightening the tax collectors away.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/qOEJDjyoJduXVML2BKdvlAO9VFB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-20","episode_number":5,"episode_type":"standard","id":1243582,"name":"Shooting Star","overview":"Drawn to a shooting star that has fallen on an ice field, Halvar and his men are convinced they have found a fabulous treasure. Sven the Terrible, who is also floating in the neighborhood, has the same thought. But the heavenly debris turns out to be nothing more than ugly, charred stones. Certainly not jewels worthy of taking home to Ylva! Only Vic understands the magnetic value of the meteorite stones: he first uses them as a compass to find their way back to the drakkar, then again as magnets when Sven the Terrible tries to attack and reclaim his \"treasure\"","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/49QFrEtLIv3ECzNbRACMryv9Cam.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-20","episode_number":6,"episode_type":"standard","id":1243587,"name":"The Highest Viking","overview":"Gilby challenges Vic: whoever can reach the highest point on the drakkar will accompany the Vikings on this year's expedition. With his scrawny arms, Vic has no chance. Unless he freely interprets the rules. In fact, there are no restrictions about how to climb. Vic will build special shoes with crampons before realizing that, by making the drakkar list, the mast will become a nearly horizontal pole, much easier to climb!","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/rov2NTBHYrG7K0XELYgIFkS2HrV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-27","episode_number":7,"episode_type":"standard","id":1242349,"name":"The Wind that'll Tear the Horns Off a Viking","overview":"Hungry and immobilized by lack of wind, Halvar's ship has to approach the island of the crazy wind queen, desperate for supplies. She dreams of marrying the wind god and uses a giant, dragon-shaped wind machine to raise a storm which blows ships away. Wickie realizes the unnatural wind blows only in one stream and circumvents it with an improvised kite, to trick the queen.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/vRCIs8KuFaemtxAfZ1SkeuEul3I.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-27","episode_number":8,"episode_type":"standard","id":1243599,"name":"Knock on Wood","overview":"A series of messages sent by a damsel in distress are floating wooden bottles. They are calls for help from a damsel in distress... a damsel who is offering a reward to anyone who will rescue her. Vic identifies the wood from the bottles as Bird Cherry. The crew are reluctant to go, but Halvar, in an incredible show of strength, flattens a table with his bare hands. This settles the crew, and they set out for Bird Cherry Island. On the way, Vic realizes that Halvar's show of strength was the result of a infestation of wood-eating worms! The damsel tied to the only tree on the island looks familiar. It is Pox wearing a wig! Halvar tries to turn the drakkar around, but there is Sven's ship, blocking their path. Halvar challenges him to a trial of strength. Vic rubs his nose. What are they going to do?","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/g4EHoKUcuSjgbKkpT7gWSpaczbW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-03","episode_number":9,"episode_type":"standard","id":1243600,"name":"Trials of Halvar","overview":"On a trip to Britain Halvar and his men are captured by fierce Celtic women warriors who accuse them of plundering their kingdom. For once, Halvar is innocent but the Britons insist that he must prove his innocence by undergoing four trials by ordeal. Only after Halvar has successfully passed through trials involving earth, wind, fire and water can he and the Vikings be freed. Thankfully Vic's experience at making the drakkar sea-worthy has given him lots of ideas on how to outwit the Britons.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/34XmeAllydzgZAz1kLn3PDr8WND.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-03","episode_number":10,"episode_type":"standard","id":1243601,"name":"The Monster","overview":"The Vikings sail home through Scottish Waters after a successful voyage. They happily celebrate until night falls when talk of monsters generates fear amongst the Vikings. As a thunderstorm closes in, the ghostly light causes the Vikings to mistake a shipwreck for the hideous monster and they throw 'the monster' all of their food. As morning approaches, they are now starving and have nothing to eat. They will need to take go ashore if they don't want to starve to death but this means they must sail close to where they last saw Sven who they know will try to take everything that they have collected on their journey. Vic has an idea! They will disguise the Drakkar as a sea monster! Sven and the pirates are petrified and much like our Vikings, throw their food at the 'sea monster' while trying to escape.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/oml7phiSDlhnnBrQWNHHWAMLNcD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-10","episode_number":11,"episode_type":"standard","id":1243588,"name":"Dagda's Cauldron","overview":"Our Vikings are captured because Faxe has stolen and eaten an Icelandic Viking clan's sausage stash. The Icelanders, thinking the Vikings are bearing treasure from their expedition, hold them ransom. Vic convinces them they have Dagda's Cauldron, a sort of cornucopia that contains an unending supply of food... But the Icelanders discover this trick because of Faxe again and Vic has the idea of using a geyser's pressure to escape and reach their drakkar.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/eYYyY4so7cjfUhHJfh07Jc39Qtz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-10","episode_number":12,"episode_type":"standard","id":1243610,"name":"Beware of the Wolf","overview":"Vic and his friends are in the forest when Faxe finds a wolf cub. Soon after, a couple of angry wolves attack them and force them into a cave: against Vic's advice, Faxe has taken the wolf cub with him. Vic convinces Faxe to give the cub back to its mother. Meanwhile, Halvar, worried about his son's delay, tries to find him in the forest. When he sees Vic in danger, he gets ready to fight the wolves. Vic uses the cave echo to frighten the wolf mother, giving him time to rescue the cub and release it back to its mother.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/cBqZsIPhg9AyQQl7FVXWilHJ9YT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-17","episode_number":13,"episode_type":"standard","id":1243603,"name":"Shape Shifting","overview":"When a runic shape appears on the side of Halvar's face, Urobe convinces everyone that he has been visited by the Gods, and soon the whole village thinks that he has the power to take the shape of any animal or person. Halvar disappears, and a duck takes his place as captain of the ship. To avoid disaster, Vic has to pretend to be Halvar, and restore his father to his rightful position of captain.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/jw6hF4Yn9pJSbOyfUn11sC9GxiV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-17","episode_number":14,"episode_type":"standard","id":1243602,"name":"Judgement of Thor","overview":"When Halvar's crew arrives on Thor's island, their incompetent druid Urobe misreads the inscription on the sacred oak and tells the others to cut it down. The three mighty druids who guard the island furiously condemns them to death. Wickie thinks up how to make it seem the god himself protects them.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/hjmOzy54e26siEaUMRE28YkRHBo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-24","episode_number":15,"episode_type":"standard","id":1243604,"name":"Good Luck Charm","overview":"Halvar is convinced that he is cursed with bad luck. He can't catch any fish, things fall on him, and he gets struck by lightning. It's the wrong time to be suffering from a crisis of confidence, because three Viking warriors are traveling to Flake to challenge his leadership. Vic and the other villagers try to cheer him up but nothing works. Finally, Vic stage manages the finding of a coin, and a series of events that convince Halvar that his luck has returned, and he fights the challengers and retains his status as chief.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/9YEARqO7m1oWCOO6qCUxXgBDaB0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-24","episode_number":16,"episode_type":"standard","id":1243589,"name":"Son of Tjure","overview":"A neighboring village's strongest man beats Halvar in arm-wrestling, so he dares him to full wrestling, but the rival raises the stakes to the loser's village's entire gold treasure. As if that weren't bad enough, Tjure's newborn son keeps everyone awake all night.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/asasIO9Gdu8Vl0CIJMogpQE981X.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-31","episode_number":17,"episode_type":"standard","id":1243611,"name":"Faxe and the Whale","overview":"After a whale is rescued from beaching itself by Faxe, it starts to follow Faxe everywhere. When the whale's infatuation and its taste for playing peekaboo start to be dangerous for the drakkar (it bumps into the drakkar), Vic has the idea to lead the whale to a larger pod, with which it can make friends. On their way back, they see Sven and the Pirates on their way to kill the whales. With Faxe's help, Vic uses the whale's taste for peekaboo to defeat Sven.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/hlzHuC3aqZmR5TSwm0t6tM7K1qU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-31","episode_number":18,"episode_type":"standard","id":1243615,"name":"Shallow Waters","overview":"As they storm a castle's treasure room, the Vikings run into Sven and his Pirates. When the Treasure Guard (a Giant) comes back and find them, Sven and Halvar have to pair up to escape with some loot. As they're sailing away with shallow waters ahead, the Vikings are trapped by Sven, who wants their share of the treasure. Halvar wants to fight but Vic has an idea. The Vikings give their share of the treasure, which overloads Sven's ship and leaves the drakkar lighter. The drakkar crosses the shallow waters, when Sven founders on the reef. With his ship immobilized, Sven is vulnerable when the Guard chases them on his boat and has no choice but to give up his treasure.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/l9AhGEwIx56TVpUh0o5iAT4794p.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-07","episode_number":19,"episode_type":"standard","id":1243590,"name":"Snorre Soaps Up","overview":"It's spring and time for the annual fertility festival in honor of the god Freyr. The women however refuse to participate until the dirtiest young Viking takes a bath, which all Halvar's men revile. Fake bathing fails, but druid Rube digs up a novelty he once received from a Gallic colleague, called soap, but he ignores how it works. Playing with it, Wickie finds out and tricks the smelly knave into cleansing.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/hNtWVIPskqTqttlpJkpXX26OMO4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-07","episode_number":20,"episode_type":"standard","id":1243593,"name":"Taken","overview":"Pirate Sven manages to kidnap Wickie and demands that Halvar delivers Flake village's entire treasure as ransom. The headman isn't prepared to give up either, but fails to trick the exchange. Wickie must think up a sneakier way out.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/8TUD41SMztgTN9xEkPL4QuGavYN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-14","episode_number":21,"episode_type":"standard","id":1243617,"name":"Ylva in Charge","overview":"The village is out of supplies, but Halvar is too sick too lead a voyage. Druid Urobe stands in as captain, but is quite happy to leave the decisions to the headman's wife, who came along to shop. Due to improbable luck and naive impudence, they get the slippery better of Sven's pirated during a raid.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/fdRZcNG85htO9dx9mEd60L5x1zT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-14","episode_number":22,"episode_type":"standard","id":1243592,"name":"Stardust","overview":"Druid Urobe is powerless when giant Faxe believes to be a dog, but a traveling druid offers an instant cure. He soon establishes himself as popular seer, whom the villagers shower with 'gifts' to obtain encouraging predictions. Only Wickie smells a rat and finds out he's abusing hypnosis and eager to cash in, so the cunning knave sets a treasure trap.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/gCDe09U7qXb2QKWMpL659hpfGoB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-21","episode_number":23,"episode_type":"standard","id":1243614,"name":"Free Ylvi","overview":"When Ylvi is captured by Pox to become a maid on Sven's ship, Vic and the Vikings rush to rescue her. While the drakkar catches up with the Pirates, Ylvi creates arguments aboard Sven's ship (she's way too young to be a maid!), and proves she can be a mischievous girl when needed. When the Vikings catch up, Sven thinks he's got the upper hand as he threatens to throw Ylvi overboard. But Vic creates flippers and snorkels and swims near the Pirates' ship to rescue Ylvi as she is dropped in the ocean.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/juAUgnwxBe9yPxKG1eS9f0v7cnk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-21","episode_number":24,"episode_type":"standard","id":1243616,"name":"The Tunnel","overview":"Looking for a treasure, the Vikings enter a tunnel system full of traps. Even with Vic's clever ideas, they soon get lost in the tunnel, right before escaping death when a large rock ball rolls towards them. Soon after, they think they found the way to the treasure room, only to be caught in a maze. But the biggest trap of all is the one protecting the treasure room itself, and Vic will need Ulme's musical talents to get them all out of trouble, with the treasure.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/gRPKLAFdfs5WCAxYElxmWmlOThZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-28","episode_number":25,"episode_type":"standard","id":1243591,"name":"Captain Gilby","overview":"The kids of Flake commandeer the drakkar under Gilby's lead and hoist the anchor. Vic tries to convince him to surrender the command to him, but Gilby won't listen, even though he doesn't know beans about navigation! The drakkar gets ever further from the coast. Overcome by sea-sickness, Gilby finally abandons the command to Vic under pressure from the other children. Vic manages to round up two trained seals and sends them in search of a whale to rescue them. The whale pushes the drakkar back to Flake, bringing the children home safe and sound.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/auG6PknvW74ZIN6f7AaA6M0enm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-28","episode_number":26,"episode_type":"standard","id":1243620,"name":"Andalusia","overview":"Halvar goes raid Andalusia, in Southern Spain. It's actually where bulls are raised for the arena, fierce enough to scare even Vikings. The crew gets mixed up in a conflict between a nasty hacienda owner with bully goons and a noble local whose champion bull Toro those stole.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/l2POYqeP7f0TFk4YJZsm1tQXE5N.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"606835859ca75900409675b9","adult":false,"gender":0,"id":1610628,"known_for_department":"Writing","name":"Sam Meikle","original_name":"Sam Meikle","popularity":1.945,"profile_path":null}],"guest_stars":[]},{"air_date":"2013-10-05","episode_number":27,"episode_type":"standard","id":1243605,"name":"The Invisible Treasure","overview":"When the spoiled, bored king passes Flake village, he's attracted by the smell of Hilva's home-baked cake and orders the cook conscripted for his palace kitchen. When Halvar objects, the king orders him jailed. The empty village treasury chest seems useless to buy her back, but inspires Wickie to conjure a way out. He pretends it contains an invisible armor, which renders the wearer invincible, just what the weakling king wants to become the greatest Viking warrior. The ploy works hilariously well.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/u9OhtuMXoYkmU0srzlUJGuUYfeF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-05","episode_number":28,"episode_type":"standard","id":1243619,"name":"The Canal","overview":"Back from an expedition with a fully loaded cargo, the Vikings decide to use a shortcut through a Danish canal, without paying the toll for it. They are caught and soon they either have to sail back or pay all their loot. Halvar decides to go back, only to face the prospect of a huge storm if he takes the long way home. When they come back to the canal and its toll, Vic tricks the Dane into believing the Vikings have been attacked and ransacked, when he actually hid their treasures under the drakkar.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/b72hwLDpksxITCt6M7QnIJHOAKf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-12","episode_number":29,"episode_type":"standard","id":1243612,"name":"Stink Bug Attack","overview":"Sven's pirate crew raids Flake while the Viking men are hunting and plans to abducts their wives. Wickie sees that and seduces them to enjoy their cooking, then sneaks off to warn Halvar's party. Their half-cocked attack fails as Sven puts a knife to Hilva's throat, so the men are captured too and must hand o er all treasures. Wickie fields the only weapon he found in the forest: stinker beetles, which he launches by rope-stretched springy tree.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/JYkTdj7ejUJiTBOLE6OloBESdF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-12","episode_number":30,"episode_type":"standard","id":1243623,"name":"A True Viking","overview":"It's time for Wickie to pass the Vikings's local initiation rite, the quest for Erci's jeweled shield. Halvar and some cahoots stage it to seems dangerous but remain safe enough for his smart but frail son. However the bumblers' plans all go wrong, so father and son prove more valor then intended.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/xtsAxJDWgfjTjUqMZLoLolc30yY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-19","episode_number":31,"episode_type":"standard","id":1243595,"name":"Gorm's Seagull","overview":"Halvar has to face a new challenge to prove he's the right chief for the village. Urobe says he has to make landed a seagull on his helmet. But with Gorm around, it's quite impossible! While the poor Viking tries to get away and leaves his chief win, the seagull keeps landing on Gorm's helmet. Seagulls are doing their nest at this time of the year which gives a bright idea to Vic but it still doesn't work. Gorm will have to scare the seagull away so it can feel safer on Halvar's side.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/kGnTaO0PmwzDpicC8BPmKB5hyuN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-19","episode_number":32,"episode_type":"standard","id":1243606,"name":"Chicken Pox","overview":"Wickie has to miss a voyage to due chickenpox, but is recovered enough to play outside already. Halvar's ship is overpowered by Sven's pirates, but they can send a message for help home by pigeon. Helped by seals, he sneakily finds and boards the ship, liberates the men and uses his ghastly salve to fake a zombie infection.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/szhRIQqOOM20Lj8xlw3Wm8gfzkq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-26","episode_number":33,"episode_type":"standard","id":1243618,"name":"Victory Dance","overview":"In Ireland, Halvar and his men make fun of a dance-off duel between two Irishmen, a local custom. Unimpressed, the local Chief, Fergus, challenges Halvar, who accepts. But when he realizes he will have to dance, Halvar freezes from stage fright. This is another insult for the Irishmen, who put the Vikings in a dungeon. Thanks to Vic, they escape the dungeon, only to get caught again. Vic challenges Fergus into a dance-off for their freedom. He wins using arrowheads on the flint slab to create sparks and the first real tap dance ever.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/tcn46uUlRABGUKcR1S5AI399FUD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-26","episode_number":34,"episode_type":"standard","id":1243594,"name":"The Forgotten Treasure","overview":"Each year, our brave Vikings have to plough the field so they can have enough vegetables and cereal. Unfortunately, Halvar is not ready to do so and rather like to go pillaging. Women are not happy and have blocked the drakkar on shore. Vic tries to plough the field with the drakkar's anchor but it stays stuck in the ground. He discovers the forgotten treasure of Flake hidden between some roots. Vic sows coins in the field so the Vikings have now a great pleasure ploughing! Ylva's happy and lets his husband go pillaging for Vic's relief.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/tgFkqBrY2vUqRVsYfO7NcnN4qU9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-02","episode_number":35,"episode_type":"standard","id":1243613,"name":"The Hammer in the Stone","overview":"Tjure's hammer has been hit by lightning and is stuck in a big rock. Everyone thinks it's Thor's hammer and a big argument starts with Schlake, the neighboring village, as the hammer in the stone is exactly in the middle between the two villages, who claim Thor's blessing. A competition starts to free the hammer from the stone, and Halvar is about to lose when Vic uses hot and cold water on the stone to crack it and help his father free the hammer.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/sbJSpemgrcbPG4HQ2wnQ3O1PZPL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-02","episode_number":36,"episode_type":"standard","id":1243596,"name":"The Cavern of Frozen Words","overview":"Halvar and his men discover a mysterious cavern where Sven and his pirates hide their loot. This cavern has kept all the words Sven and his men exchanged during the last winter. When the pirates arrive to the cavern, the clever Vikings pretend to be invisible and with the words released from their frozen bubbles, the pirates soon get scared. Halvar can have his loot back!","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/fG3myJ9IsuI0qLwcctGece3VgVX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-09","episode_number":37,"episode_type":"standard","id":1243621,"name":"Druid Needs a Ride","overview":"Fat Flaxe is flattened by stomachache and druid Urobe can't cure him, so the ship brings him to his old mentor's island. They are received by an impostor, who convinces Halvar a cure can only be made from seaweed from another island. While the men gather that, he overpowers the skeleton crew, including Wickie, who must hastily prevent the ship from being stolen.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/8hvGvDHVqUULYkiwZ1A3Z32Zjfc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-09","episode_number":38,"episode_type":"standard","id":1243598,"name":"The Sparkling Race","overview":"His ship being past by and nearly keeling-over due to a rich man's much big, faster ship, Halar can't resists a braggart dare. Now his crew must win and earn three barrels of gold or forfeit their 'antique' ship. That looks hopeless, but when the race already seems lost, Wicki invents a jet-like propulsion.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/9yEtcb1gL0jAbsH7vT0AmSC4t7f.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-16","episode_number":39,"episode_type":"standard","id":1243607,"name":"Siren Song","overview":"Halvar's treasure-loaded ship is robbed by Sven's pirates. Vic thinks up a way to lure his ship to a dangerous cliff by dressing up Tjure as a mermaid.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/RcSjOKgiOz8vZlKl4UjsvnZGvi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-11-16","episode_number":40,"episode_type":"standard","id":1243624,"name":"Castaways","overview":"Rascals pack leader Gilby plans to humiliate physically weaker Wickie by daring him to a wide jump, but ends up the wet looser as Wickie invents pole jumping. Thure's cousin and his wife visit to show their newborn baby, but get shipwrecked on the local rocks. To out-stage Wickie, the rascal pole-jumps to their rescue, but that proves hard even for all the village men, until Wickie devises and improves a pulley system.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/3uPnveEEAaItm9jtOcFZ5ZRoaKO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-05","episode_number":41,"episode_type":"standard","id":1243628,"name":"He’s My Son","overview":"Ulme is kidnapped by Sven who quickly regrets his catch (he's noisy and nobody is interested to get him back). Vic claims he wants to exchange Ulme against their new loot. Sven is thrilled and accept. Vic manages to get Ulme back and fool Sven with a fake treasure.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/8WQgr9VlPALauTZDc3e5Dt3ZFXO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-05","episode_number":42,"episode_type":"standard","id":1243622,"name":"Silent Night","overview":"Halvar and his crew expected raiding the island of dreams would be easy, but the rich golden loot is protected by the resident order's sleep-inducing chants. After Halvar is caught sneaking into the treasury, Wickie can barely get a single chance to have them released: showing the stars to the order's superior, who is always fast asleep at night.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/5LwKIYJyHs01p1dxrAFeJLppehn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-12","episode_number":43,"episode_type":"standard","id":1243642,"name":"Topsy Turvy","overview":"After a battle on an ice bank, Halvar and Sven bump into each other on the head and their personalities change.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/1jSYPcJDpDd6wMeh2oISwzp6Wst.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-12","episode_number":44,"episode_type":"standard","id":1243597,"name":"Dance with the Wolf","overview":"Old druid Urobe is declared winner of Flake's annual most courageous Viking contest. Jealous, rascal urchin Gilby dares Wickie to spend the night in the wolves-infested wood. After trying to have the wolf scare Wickie away, he ends up teaming up and sharing the credit for trapping it.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/dc8qtLgNc4rOF7mBvi04sNwlD6Q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-19","episode_number":45,"episode_type":"standard","id":1243608,"name":"Bear Up","overview":"Flake is terrorized by a bear who wandered in from the forest, so Halvar tries to take everyone out until the monster is away, however that happened. Bard Ulme discovers, being left behind, that the bear is fascinated and appeased by his lyre songs, which the Vikings all loath. So Halvar must eat humble pie and beg him to save the village by leading the bear back to the Woods, especially since Tjure's preteen son Eric is still at home. Wickie insists he must be granted a fitting wish.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/68x1nfQx8TL0LIyR3XIVXabWzTK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-19","episode_number":46,"episode_type":"standard","id":1243630,"name":"The War of the Berries","overview":"Halvar takes the children of Flake with their teacher, Mrs Flart, on an island for a field trip. On the island, two teams are made for the children to compete and bring back a flag from the top of the island and a bucket full of berries. Gibly is with Mrs Flart's team and Vic and Ylvi are with Halvar's team. But soon, the picking of berries turns into a game of Viking-style paint ball, and each child hit by berry juice is eliminated. The last standing are Gilby and Vic. Vic wins after Gilby tries to cheat as much as he can.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/wvGXXCkh9IF9kJeOjxZJQNj5ElZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-03-26","episode_number":47,"episode_type":"standard","id":1243627,"name":"The Thief Among Us","overview":"When gear disappears from Shlake's drakkar, Baltak accuses Halvar of theft. Halvar denies it, but Baltak is convinced, especially discovering that Halvar \"found\" new gear for his drakkar, in fact the stolen goods from Shlake. Vic tries to defuse things and must find the real thief to exonerate his father. He is stunned to discover that it's Baltak's pregnant wife, Morqg, desperate to keep him near for the birth of their baby.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/mVoaKa9EQhmb6Ao64joy9ZxCRkL.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"606835859ca75900409675b9","adult":false,"gender":0,"id":1610628,"known_for_department":"Writing","name":"Sam Meikle","original_name":"Sam Meikle","popularity":1.945,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-03-26","episode_number":48,"episode_type":"standard","id":1243626,"name":"Trojan Snorre","overview":"On a distant island, the Vikings are refueling when Tjure and Snorre have their biggest argument yet and Snorre decides to leave. But soon he disappears and Vic and his friends decide to go after him. They are surprised to find him amongst a tribe of people with a lisp, who think he is their new king. When they try to rescue him, the Vikings are defeated. Vic understands that the second in charge plans to harm Snorre to take his place. Tjure then creates a Trojan horse (in the shape of the new king Snorre) to enter the fortress and save Snorre before he gets injured.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/l7RtkVufDMbKRJSwPx43vlElodI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-02","episode_number":49,"episode_type":"standard","id":1243655,"name":"Trouble in Flake","overview":"Vic and the Vikings arrive back in Flake to find the women enraged against a lazy Tjure, who didn't help them in any chores while his friends went on expedition. Soon it's a war between the men and women of Flake, and only Vic will be able to reunite them without bruising any ego.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/s8oYgFpjKH2KXNPB4J1QAW5bTEk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-02","episode_number":50,"episode_type":"standard","id":1243629,"name":"Resort Island","overview":"The Vikings discover the true meaning of the saying \"there is nothing like a free lunch\" when, enjoying a well deserved rest in a hot spring \"spa resort\" in Iceland, they realise they have been conned by the owners of the place. To make them reveal where they have hidden the stolen Vikings loot, Vic will find a way to con the con artists.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/awKhxssecBf5CZPNNmIvzu7jHe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-09","episode_number":51,"episode_type":"standard","id":1243609,"name":"The Julbock","overview":"Vic makes sure that the children of Flake have a happy winter festival by outwitting a nocturnal impostor intent on stealing their presents...","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/cFCaK9f20p5E5dN8w3YBhhqFEMk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-09","episode_number":52,"episode_type":"standard","id":1243625,"name":"Arabian Nights","overview":"During a trip in Tunisia, Vic and the Vikings meet Sabu, the Caliph, who has been tricked out of his throne by his Vizier Harun. They will help him get his throne back, putting themselves in danger in the process. Paraphrasing the tale of Aladdin, Vic will use the powers of a genie in a lamp to defeat Harun.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/4QyYLEdFXcGziGUdKedMcsfze7Y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-19","episode_number":53,"episode_type":"standard","id":1243654,"name":"Use Your Loaf","overview":"Waiting for his brother Hlaford, who's coming for a visit, Halvar goes and fetches him on boat, ignoring his brother is actually coming on foot through the woods. Hlaford, a Viking warrior with a fearsome reputation, turns out to now be a peaceful baker. When Flake is attacked by Ivar the Ruthless, Hlaford's nemesis, Vic saves the day by building a 'skjaldborg' or 'shield wall' from burnt bread loaves to repel the attack.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/bXhUuRwS0KNGOS59yixIOBMktob.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-19","episode_number":54,"episode_type":"standard","id":1243639,"name":"Bamboo Surprirse","overview":"Sailing home from China, the Flake Vikings see a dragon. Rushing to get the mythical creature, they realize the dragon is in fact a costume, worn by the villagers to scare away a real monster that is terrorizing them. Village elder, Junjie, believes they're cursed by his son Qi's refusal to learn their traditional ways. Frustrated by the old ways, Qi is determined to prove there are no such things as monsters. Vic will help Qi uncover the mystery and will capture the \"spirit\", in fact a wounded panda. Junjie will see how his son was right and he will trust him from then on.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/rTrLvrXIZiEtgwhDu4nJcGQOwK4.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"606835859ca75900409675b9","adult":false,"gender":0,"id":1610628,"known_for_department":"Writing","name":"Sam Meikle","original_name":"Sam Meikle","popularity":1.945,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-04-19","episode_number":55,"episode_type":"standard","id":1243637,"name":"Strangers in a Strange Land (1)","overview":"After a tornado takes the drakkar away, it lands in China, where Vic and the Vikings meet a young girl, Mingzhu, and her uncle Quan, whose rice is eaten by ducks that got lost in the storm too. But the Vikings have more urgent problems than that; a Chinese General arrests them for invasion and wants to know their secret to make the drakkar fly. Vic will have to find a way to escape the General, and free the ducks at the same time! Zith Mingzhu's kites; the drakkar flies away above the Great Wall of China... until a rain of arrows tears the kites apart.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/iWZ7NSqP4WJ7cWMyE01mcl7ZKpa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-19","episode_number":56,"episode_type":"standard","id":1243638,"name":"Strangers in a Strange Land (2)","overview":"Having being shot down from the sky above the Great Wall of China, the Vikings have to find a way to reach the ocean. Their plan is thwarted when the General catches up with them and takes them to the Signal Tower as he wants to know their secret to fly, as he always wanted to fly himself. Vic will give him his first \"parasail\" experience and will get the Vikings to be released and on their way.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/noMhXLuBMRiIma0OMZP6xlrWwQ3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-20","episode_number":57,"episode_type":"standard","id":1243631,"name":"Up the River","overview":"Travelling along the Dnieper River in Eastern Europe to get a new sword, reputably invincible, for Halvar, who broke his own, the Vikings think they find the real deal around a statue of Angantyr, the king of the Goths. But when they come back to their drakkar, it drifts away downstream. To catch up with it, they borrow horses from local farmers. The situation aggravates when the drakkar drifts away to a waterfall. Vic must find a way to save the Vikings' drakkar.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/c68iYbEqxTZ6FtVfyJKgnIMGBrC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-20","episode_number":58,"episode_type":"standard","id":1243632,"name":"The Invincible Sword","overview":"Looking for the magical sword Tyrfing, Halvar and Vic discover that the gem in their possession acts like a GPS locator. As they locate the sword, an evil Warlord plans to let them gather the sword then steal it from them.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/5Nn0otl5g10E5fLi6uwuQ3c3x2T.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-04-20","episode_number":59,"episode_type":"standard","id":1243633,"name":"Back to Flake","overview":"Halvar and the Vikings are on their way back to Flake, Halvar delighted to have his invincible sword, when they come face to face with Sven. Halvar wants his revenge after Sven broke his sword, but Vic warns him about the danger of such a battle, even with an invincible sword. Despite Vic's recommendations, Halvar attacks Sven, but soon finds himself in a dire situation, that only Vic can save him from.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/cwcKccpAqT5XmpxTWHvwjd5BL08.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-15","episode_number":60,"episode_type":"standard","id":1243634,"name":"Loki the Trickster God","overview":"It's the Balder-festival in Flake and the Vikings are performing a play telling the story of Balder and her demise by Loki, the trickster god who was jealous of her. An incursion into the Norse mythology where Vic plays Thor and Halvar is Odin as they defeat the evil plans of Loki, played by Gilby.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/9sGZncpHKuXDmPjMtBue3ly6aN7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-16","episode_number":61,"episode_type":"standard","id":1243635,"name":"Stronger Together","overview":"Ork and his Berserkers rob the villages of Flake and Shlake. Vic thinks the Vikings need to stand unite if they want victory over Ork. But with Halvar's and Baltak's pride, it's going to be complicated! Vic manages to reunite both village against the Bersekers for a fine naval battle!","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/yv6vs51t7Cs1SdrdEDXU1XyYH6M.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-16","episode_number":62,"episode_type":"standard","id":1243636,"name":"License to Sail","overview":"While Vic is at the helm of the drakkar, the Vikings are stopped by the Dane (seen in The Canal), who has now moved over to sea traffic control. Well, Vic doesn't have his drakkar driving licence! The drakkar will be impounded if Vic doesn't pass his driving test. Although Vic passes the theory test without much trouble, he fails the practical test because of Halvar! The Dane takes the helm of the drakkar... only to get it stuck accidentally in an ice maze. Will they end up as ice cubes? It's only thanks to Vic's ingenuity that they pull through and that, finally, he gets his licence.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/319HDGcnH1jU3pYPG0StsqT349X.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-18","episode_number":63,"episode_type":"standard","id":1243640,"name":"Princess Badoura","overview":"The Vikings are passing through an Arabian desert on their way back to the coast when they come to the rescue of a Princess on an out of control camel. The Princess soon escapes, taking Vic with her. When the princess' Governess reaches Halvar and his men, she pair up with them to get the princess back before a sandstorm falls on them. Vic and the princess find shelter in a cave during the sandstorm, and then the Princess takes Vic to her final destination; a storytelling festival where she can hear all the tales from her country. When Halvar and the Governess find them, they are all happy and the Governess understands that the Princess needs some freedom.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/8qTVuk151Ddzq4TF1dDhFjbtaiG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-19","episode_number":64,"episode_type":"standard","id":1243641,"name":"The Kraken","overview":"Fishing for Giant Clams and in search of a Giant Pearl for Ylva, the Vikings face an underwater monster, the Kraken (in fact a Giant Squid), which prevents them to collect the Clams and the Pearl. Vic will have to find a way to lure the Kraken away and eventually find the Giant Pearl for Ylva.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/nr02WJgrr1Lzn12rY6EYFL2J8Z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-20","episode_number":65,"episode_type":"standard","id":1243643,"name":"Ooops a Daisy","overview":"Preparing a gift for Vic's birthday, Ylvi and Ylva end up stranded on a ledge in the middle of a cliff. With his father and crew on an expedition, Vic will have to find a solution to help his mother and cousin without the strength of the men. He will create a trampoline to save them.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/jVaQz9ncQhUlHlyFgpLn3QDPOi2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-20","episode_number":66,"episode_type":"standard","id":1243644,"name":"The Olympic Games","overview":"Vic and the Vikings participate in the Olympic Games organized this year in Spain and hosted by their friend Rodrigo (from \"Andalusia\"). The Games are the occasion to meet tribes our Vikings haven't seen for a long time, and to have a healthy competition, from which Halvar wants to come out victorious.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/1QXftXzzedYbiThQDJy7MU9ny4H.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"606835859ca75900409675b9","adult":false,"gender":0,"id":1610628,"known_for_department":"Writing","name":"Sam Meikle","original_name":"Sam Meikle","popularity":1.945,"profile_path":null}],"guest_stars":[]},{"air_date":"2014-05-21","episode_number":67,"episode_type":"standard","id":1243645,"name":"Cow Express","overview":"On his way back to Flake, Halvar loses the ring he plans to give Ylva for their anniversary... in a cow's stomach! the crew doesn't have a choice but to take the cow with them and hope to get the ring once it poops. The travel with the cow is an expedition in itself, but back in Flake, they also have to hide the cow from Ylva, who thinks it's a very unusual (and rather lame) anniversary present. As the banquet is about to start and the ring hasn't reappeared yet, Vic has to work his genius to get the cow to \"deliver her package\".","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/iUuXjQPSCgYuqrBXEoeNMmEu4GA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-21","episode_number":68,"episode_type":"standard","id":1243646,"name":"Mushroom Picking","overview":"In the woods to pick mushroom for their mother, Vic, Gilby and Ylvi cross the river they know they're not allowed to. When they are caught into heavy rain, which makes the river grow, they can't cross it anymore. It would be fine for them to wait if they didn't upset a bear in a cave, which is now on their toe. They hide up a tree and Vic has to invent a \"flying fox\" to get them out of there and back to the village.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/iEHr1N4MItQQf5v5NyUdFkDxq6x.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-22","episode_number":69,"episode_type":"standard","id":1243647,"name":"It’s Not What You Sink","overview":"After his ship has sunk, Sven is rescued by the Vikings, following the Seafarers' Code. But as soon as the Pirates are on board, they overpower the Vikings and take their drakkar. They leave them on an island, and start to sail; away, but Vic finds a way to lure them back on the island and get the drakkar back.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/8pdqRjbRLVtssHP9eRZDMV28tRm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-22","episode_number":70,"episode_type":"standard","id":1243648,"name":"Gilby the Pirate","overview":"While the Vikings prepare the drakkar for an expedition, Sven plans to steal their loaded drakkar. But when Gilby, frustrated not to be a Viking, offers Sven some more supplies, Sven fools Gilby into making him believe he can become a Pirate. Vic and Halvar will have to get on board the stolen drakkar to get their supplies back and to save Gilby.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/tn6lVirLg3MA6L0ZQ2aUTV26xM2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-23","episode_number":71,"episode_type":"standard","id":1243649,"name":"Being a Leprechaun","overview":"In Ireland, the Vikings meet Puck, who looks for his friend Bernard, lost in the woods. They decide to help him (Urobe and Halvar thinking he's a Leprechaun) but are startled when they realise Bernard is a bear and Puck a juggler dressed as a Leprechaun. But having a bear in Irish woods can be hazardous, and Vic will have to save his new friends from the king's guards.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/irpcRPrHmtKpMSIR2wnGyXhlTO4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-23","episode_number":72,"episode_type":"standard","id":1243650,"name":"Mistaken Eye-dentity","overview":"The King of Sweden visits Flake unexpectedly and accuses Halvar of stealing his jeweled scepter - and he has an eyewitness - himself! It's up to Vic to discover why the king thinks that he saw Halvar take his scepter, and prove to him that Halvar is innocent... and of course not hurt the King's feelings in the process.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/zXeoLj8lBShWBiNRIpgE5TH4anC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-24","episode_number":73,"episode_type":"standard","id":1243651,"name":"Moby Vic","overview":"The Vikings are sailing home when Halvar decides to let Faxe take over the steering for a while. A whale appears and Faxe involves the drakkar in a game of chasey with the whale but in all the excitement he accidentally chases it towards shallow waters. The whale becomes stuck between two rocks and as the tide goes down, it becomes beached. When the Vikings aren't strong enough to move it Vicky comes up with a solution that you couldn't even dream of.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/raVjv3mQchdxPX2bwze1C3XDMF8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-24","episode_number":74,"episode_type":"standard","id":1243652,"name":"Grandpa Olaf","overview":"Near Greenland, Vic finds a man frozen in an iceberg : Olaf, Halvar's grandfather. But when they thaw him, Grandpa Olaf wakes up and wants to defeat the Giant that froze his companions and stole his drakkar and treasure. Halvar agrees, hoping to get part of that treasure as a reward. Vic will have to find a solution to defeat the mean Giant, and will give him a taste of his own medicine.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/fVMqI6rmd3bJboCaQjMTTffyLRN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-25","episode_number":75,"episode_type":"standard","id":1243653,"name":"Who Let the Bear In?","overview":"The Vikings stop on the arctic coast and build an igloo style shelter when a blizzard heads for them. When they wake up the next morning, the ice sheet where they are drifts away from the mainland with the drakkar attached. All would be well if it wasn't for the polar bear stuck on the ice sheet with them!","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/iz5j7rRvp68EWHxCYFsFzNDYUGd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-26","episode_number":76,"episode_type":"standard","id":1243656,"name":"The Treehouse","overview":"As Ylvi is about to enjoy the new tree house Tjure made for her birthday, Gilby invades the place and holds it like a fort against Vic and Ylvi.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/zFtrJyYHYFRGkk6rX18nYoPe8RX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-27","episode_number":77,"episode_type":"standard","id":1243657,"name":"Summer Residence","overview":"The inhabitants of Flake are awaken at dawn by loud hammering noises: the king's foreman is requisitioning the village to build the new royal summer residence! The Vikings are faced with the possibility of eviction. To avoid a war between the villagers and the king's army, Vic sets out to convince the foreman that their village is a very inhospitable place, and thus get him to leave.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/iKw1KZaPPlld3JVb49R2zlNyeUz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2014-05-27","episode_number":78,"episode_type":"finale","id":1243658,"name":"For the Love of Cake","overview":"The Annual Dessert Contest is around the corner and this year, Ylva decides to make her special Myrthus Cake to retain the trophy in Flake. But Baltak, spying on her, gives the same idea to Morag, his wife. The only problem is that Myrthus is hard to find and only grows on one island south of Flake. A race starts between Halvar and Baltak to get to the Myrthus first, and only Vic will be able to prevent traps and cheats along the way.","production_code":"","runtime":null,"season_number":1,"show_id":68801,"still_path":"/4YXIUeUTBjdaheYoRP08pAH1KHu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":82214,"poster_path":"/5EY4WUIogwjSXjwSWkMad9IZTIQ.jpg","season_number":1,"vote_average":0}}}