{
    "adult": false,
    "backdrop_path": "/lCGha9flKXvmS4UZmyPb3U1ngN5.jpg",
    "created_by": [],
    "episode_run_time": [
        45,
        85
    ],
    "first_air_date": "2015-11-30",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "http://abc.go.com/shows/the-great-american-baking-show",
    "id": 69024,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2020-01-02",
    "last_episode_to_air": {
        "id": 2036571,
        "name": "Semi-Final and Final",
        "overview": "In the season finale, the judges present the four remaining bakers with their toughest challenges yet. One contestant is named \"America's Best Amateur Baker\".",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2020-01-02",
        "episode_number": 4,
        "episode_type": "finale",
        "production_code": "",
        "runtime": null,
        "season_number": 5,
        "show_id": 69024,
        "still_path": null
    },
    "name": "The Great American Baking Show",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 2,
            "logo_path": "/2uy2ZWcplrSObIyt4x0Y9rkG6qO.png",
            "name": "ABC",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 20,
    "number_of_seasons": 5,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "The Great American Baking Show",
    "overview": "A selection of America's best amateur bakers compete in a series of themed challenges and eliminations as they look to be crowned America's Best Amateur Baker.",
    "popularity": 5.335,
    "poster_path": "/aE43LdUHW97peoyO4hk0uPGTb.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "US",
            "name": "United States of America"
        }
    ],
    "seasons": [
        {
            "air_date": "2015-11-30",
            "episode_count": 4,
            "id": 114047,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2016-12-01",
            "episode_count": 8,
            "id": 82710,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2017-12-07",
            "episode_count": 1,
            "id": 96212,
            "name": "Season 3",
            "overview": "Only the Season 3 Premiere episode aired. On 13 December 2017, ABC canceled the remainder of the season following a scandal (not relating to the show itself or to the season) breaking involving judge Johnny Iuzzini.",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2018-12-06",
            "episode_count": 3,
            "id": 114036,
            "name": "Season 4: Holiday Edition",
            "overview": "Joining as host this season, Spice Girl and television personality Emma Bunton, alongside returning host Anthony 'Spice' Adams, will present bakers with weekly challenges. Each week, James Beard Award-winning pastry chef Sherry Yard and baker and best-selling cookbook author Paul Hollywood will taste and judge decadent and delicious treats while sharing advice and commentary.",
            "poster_path": "/ikiypCQXWD8MQUm1YnNF3EJ10nf.jpg",
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2019-12-12",
            "episode_count": 4,
            "id": 137991,
            "name": "Season 5: Holiday Edition",
            "overview": "Anthony 'Spice' Adams and Emma Bunton (the Spice Girls' 'Baby Spice') return as co-hosts, and Paul Hollywood and Sherry Yard return as judges.",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Reality",
    "vote_average": 6.2,
    "vote_count": 5,
    "season_data": {
        "1": {
            "_id": "5c0ab365925141479a049aaa",
            "air_date": "2015-11-30",
            "episodes": [
                {
                    "air_date": "2015-11-30",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1636818,
                    "name": "Cookie Week",
                    "overview": "This week’s challenge is all about Christmas cookies. Armed with only their skills, their imaginations and drive to win, these bakers compete in three challenges:  Signature Bake, showcasing their family recipes as they create two sets of cookies that are both delicious and unique; Technical Bake, a surprise recipe where they must demonstrate precision and technique; and finally, The Showstopper Bake, where the bakers are asked to create elaborate flavorful gingerbread houses.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-07",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1636861,
                    "name": "Cake Week",
                    "overview": "This week's Signature Bake is a traditional yule log. The Technical Bake features a surprise recipe based on judge Johnny Iuzzini's Italian heritage, and finally, The Showstopper Bake has the bakers bringing their unique take to holiday fruitcake while incorporating a \"Twelve Days of Christmas\" theme. With bold flavors such as rosemary almond cream, pumpkin spice Swiss roll and five golden rings carrot pineapple fruitcake, these bakers are bringing their A-game on \"The Great Holiday Baking Show\".",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-14",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1636863,
                    "name": "Pastry Week",
                    "overview": "This week’s Signature Bake finds the bakers making breakfast pastries, perfect for Christmas morning. The Technical Bake features one of judge Mary Berry’s most festive and fruity recipes. And the Showstopper finds the bakers building elaborate centerpieces from cream puffs and other puffed pastry pieces. The stakes are high in this episode as it will decide the three bakers who make it to the final. Some bakers will impress while others fold under pressure.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2015-12-21",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 1636864,
                    "name": "Final Week",
                    "overview": "It’s Final Week in the holiday tent as the remaining three bakers face off in their final three challenges, all hoping to be named the winner on “The Great Holiday Baking Show”.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 114047,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "584b603dc3a3683982004c16",
            "air_date": "2016-12-01",
            "episodes": [
                {
                    "air_date": "2016-12-01",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1246595,
                    "name": "Cake Week",
                    "overview": "For their very first Signature Bake, the bakers are tasked with making bundt cakes inspired by winter flavors. Next up, a Technical Challenge of Mary Berry's recipe for apple almond cake. And lastly, The Showstopper Bake has these bakers constructing fantastical multi-tiered holiday celebration cakes.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 69024,
                    "still_path": "/5ufYwtY3mfLyVUJvaq1hEMMKmBa.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-01",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1246599,
                    "name": "Cookie Week",
                    "overview": "In their Signature Challenge, the bakers tackle bar cookies, showcasing everything from compotes to crumbles. In the Technical, Johnny challenges the bakers with a cookie that must be baked twice – biscotti. Then, in the Showstopper Bake, the bakers build elaborate 3D Iced Cookie Scenes.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 69024,
                    "still_path": "/xuxzN60fmjB2AvYBvNEzQwPuVNF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1246600,
                    "name": "Bread Week",
                    "overview": "Beginning with the Signature Challenge set by Mary and Johnny, the bakers create a dozen perfectly sized dinner rolls incorporating unique flavors and spices, including those traditional to Portugal and India. Next up, The Technical Challenge, where the judges once again surprise the bakers – this time it's Johnny's Christmas Stollen, a traditional German Christmas fruit and nut bread. Finally, for their Showstopper Challenge, the competitors must create elaborate sculptures with bread. In the end, Mary and Johnny will decide which bakers create a masterpiece and which sculptors crack under the pressure.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-15",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1636883,
                    "name": "Pies and Tarts Week",
                    "overview": "First up, meringue pies. This week the bakers are whipping egg whites and lighting up their blowtorches to give their meringues toasted finishes, hoping their creations stand up – and out – to the judges. Next is the Technical Challenge, where Mary surprises the bakers with her recipe for Partridge in a Pear Tart. With no molds, the bakers must freeform their creations, and not everyone finds shape perfection. Finally, for their Showstopper Challenge, it's all about savory flavors with Hors D'oeuvre Tartlets. With ingredients like kimchi butter and southern grits, these bakers are going outside of the box to create delicious holiday treats.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-22",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1636884,
                    "name": "Chocolate Week",
                    "overview": "A celebration of chocolate. As one of Johnny Iuzzini's passions and specialties, the pressure is on to impress both Mary and Johnny. For their very first Signature Bake, the bakers are tasked with creating a dozen molten lava cakes where mere minutes in the oven can result in a cake whose center flows like hot magna or has no ooey-gooeyness at all. Next is the Technical Challenge, where Johnny gives the bakers one of the most difficult challenges to date, tasking them to create a perfect assortment of delicious and decadent truffles. Finally, for their Showstopper Challenge, it's a naked, layered mousse cake full of soft, silky layers of flavorful mousse, built upon a baked foundation and topped with elaborate chocolate decorations. In the end, not everyone's desserts will rise to the occasion, and another baker will be eliminated from the competition.  With only three bakers continuing on to the semifinals, the slightest difference will be the factor in who stays and who goes home.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-22",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1636885,
                    "name": "Custard and Meringue Week",
                    "overview": "In the bakers' Signature Challenge, they will tackle Crème Brûlée – a dozen perfectly silky custards hidden beneath a hard caramel topping with unique flavors like chestnut, apple, peanut, maple and fennel. In the Technical, Mary Berry shares one of her favorite dishes to ring in the New Year, the French dish, oeufs en neige – otherwise known as \"eggs in snow.\" For the Showstopper Challenge, the bakers will make 24 petite pavlovas, a baked meringue creation from Australia and New Zealand. Everyone is on pins and needles, as the bakers won't know if they've achieved the classic marshmallow center until their pavlovas are sliced open during judging. With only three bakers continuing on to the semifinals, the slightest difference will be the factor in who stays and who goes home.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-05",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1636886,
                    "name": "Patisserie Week",
                    "overview": "It's the semi-finals, and the bakers' stress levels are at an all-time high when they face three French pastry challenges and compete for a chance to make it to the final round. This week's Signature Challenge is all about precision as the bakers must make two-dozen Petit Four glacé-style mini cakes. The cakes may be small, but that just makes them that much harder to perfect. Next up, the Technical challenge, which throws the bakers for a loop when Johnny surprises them with a donut – the French Cruller. The bakers won't just need to master their dough; they'll also need to master the deep fryer. Then, in the Showstopper, it's Mille-Feuille, also known as the Napoleon. Layers of perfectly flakey puff pastry sandwiched with unique fillings. But getting it perfect in the short time frame will be difficult for all and the downfall for one.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-12",
                    "episode_number": 8,
                    "episode_type": "finale",
                    "id": 1636887,
                    "name": "Finals Week",
                    "overview": "This year's competition was bigger than ever, with twice as many weeks and twice as many challenges. Ten amateur bakers from across the country entered the tent, and now only two remain. The winner of this week will be named America's Best Amateur Baker. As always, the bakers will face three challenges: The Signature, The Technical and The Showstopper. But this week, the bakes will test the bakers' skills across a wide variety of disciplines. These are the most difficult challenges the bakers have faced so far, under the tightest time constraints, and, at this level, the judges will be looking at the tiniest of details, as they decide who walks away with the title. Family, friends and many familiar faces from the competition all gather for a large celebration party, where this year's winner of \"The Great American Baking Show\" will be announced.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 82710,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5a26b7700e0a264cca0ec79c",
            "air_date": "2017-12-07",
            "episodes": [
                {
                    "air_date": "2017-12-07",
                    "episode_number": 1,
                    "episode_type": "finale",
                    "id": 1401856,
                    "name": "Cake and Morning Treats Week",
                    "overview": "The Great American Baking Show showcases some of the nation's best bakers as they compete in a series of themed challenges and eliminations all hoping to be crowned America's Best Amateur Baker.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "Only the Season 3 Premiere episode aired. On 13 December 2017, ABC canceled the remainder of the season following a scandal (not relating to the show itself or to the season) breaking involving judge Johnny Iuzzini.",
            "id": 96212,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "5c0a801e0e0a2638c70419c4",
            "air_date": "2018-12-06",
            "episodes": [
                {
                    "air_date": "2018-12-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1636796,
                    "name": "Cake and Pastry Week",
                    "overview": "It’s a double dose of spice this holiday season as the most festive and friendliest competition on television premieres with slices of cake, and sweet and savory pastries.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 69024,
                    "still_path": "/y2HNpQ2fG1hlfLX07MEyo9LJUOF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-13",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1636858,
                    "name": "Cookie and Bread Week",
                    "overview": "This week, the bakers return to the tent to test their skills at making decadent and delicious cookies and breads.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 69024,
                    "still_path": "/fMxDXlvn2RXGCgnHvOaRJQKvj3J.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-12-20",
                    "episode_number": 3,
                    "episode_type": "finale",
                    "id": 1636859,
                    "name": "Semi-Final and Final",
                    "overview": "Five finalists remain in the tent as they face their final three bakes, all hoping to make it to the final round. With their toughest challenges ahead, like French custards and cakes, the heat is on where only one baker will be named America’s Best Amateur Baker.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 69024,
                    "still_path": "/lUMZbuU5YgNrkakXg7A1iSxhcxt.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4: Holiday Edition",
            "overview": "Joining as host this season, Spice Girl and television personality Emma Bunton, alongside returning host Anthony 'Spice' Adams, will present bakers with weekly challenges. Each week, James Beard Award-winning pastry chef Sherry Yard and baker and best-selling cookbook author Paul Hollywood will taste and judge decadent and delicious treats while sharing advice and commentary.",
            "id": 114036,
            "poster_path": "/ikiypCQXWD8MQUm1YnNF3EJ10nf.jpg",
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "5df28f2ed8d32900122a4523",
            "air_date": "2019-12-12",
            "episodes": [
                {
                    "air_date": "2019-12-12",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2013549,
                    "name": "Cake and Bread Week",
                    "overview": "In the Season 5 premiere, the bakers tackle sweet and savory cakes - including the surprise ingredient of olive oil - and baking bread.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-19",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2022643,
                    "name": "Spice and Dessert Week",
                    "overview": "The bakers create sweet and savory creations using spices, later create delicacies like cakes and cookies, including one of Paul Hollywood's toughest challenges yet.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-26",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2029246,
                    "name": "Pastry and Cookie Week",
                    "overview": "The six remaining bakers focus on flaky and flavorful pastries and holiday cookies.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-02",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 2036571,
                    "name": "Semi-Final and Final",
                    "overview": "In the season finale, the judges present the four remaining bakers with their toughest challenges yet. One contestant is named \"America's Best Amateur Baker\".",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 69024,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5: Holiday Edition",
            "overview": "Anthony 'Spice' Adams and Emma Bunton (the Spice Girls' 'Baby Spice') return as co-hosts, and Paul Hollywood and Sherry Yard return as judges.",
            "id": 137991,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        }
    }
}