{"adult":false,"backdrop_path":"/62boubqNbLJsAfYknqdJ0KxEe1Y.jpg","created_by":[{"id":87177,"credit_id":"52538fb019c29579402812ff","name":"Will Meugniot","gender":0,"profile_path":null},{"id":2437987,"credit_id":"5e76385e357c0000164f16fa","name":"Grahame Morris","gender":2,"profile_path":"/wVCmoeXIDrTntycc4vUGwyiEDro.jpg"},{"id":2573813,"credit_id":"635a4e5e6d97e6007d4097bf","name":"Jeff Segal","gender":0,"profile_path":null}],"episode_run_time":[30],"first_air_date":"1993-09-18","genres":[{"id":16,"name":"Animation"},{"id":10765,"name":"Sci-Fi & Fantasy"},{"id":10759,"name":"Action & Adventure"}],"homepage":"","id":699,"in_production":false,"languages":["en"],"last_air_date":"1994-05-01","last_episode_to_air":{"id":38571,"name":"Pirate's Ransom","overview":"Typhonus offers a treaty of friendship to the Pirates in exchange for Marsh and DeLeon. When Simbacca refuses Typhonus' forces attack, wounding and capturing Simbacca. The Pirates plan to capture Marsh and DeLeon to trade them for Simbacca. Instead the two capture Hallas and use him to fool Typhonus into thinking that the Pirates succeeded and now wish to make the prisoner exchange. Upon docking the three fight their way to Simbacca's cell and free him. They try to fight their way out, but get stalemated by Neo troops. Alec uses his e-frame to send a message from Simbacca to the Pirates telling them to attack. The attack, led by Jubail, is enough of a diversion to allow them to escape. Once they arrive back on Tethys Simbacca announces that the Pirates will enter the war on the side of the ExoFleet.","vote_average":0,"vote_count":0,"air_date":"1994-05-01","episode_number":3,"episode_type":"standard","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/w8UeYhlTMHaGrNvXccpwZBm7Xf2.jpg"},"name":"Exosquad","next_episode_to_air":null,"networks":[{"id":184,"logo_path":null,"name":"Syndication","origin_country":"US"}],"number_of_episodes":52,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"Exosquad","overview":"Sometime in the 22nd century, humans have fully terraformed and colonized Venus and Mars. The Neosapiens, an artificially engineered race created to be slaves for the Terrans, have turned against their masters and formed the Neosapien Order/Empire/Commonwealth. Under the rule of the calculating Governor General Phaeton, the Neosapiens have launched an invasion of Earth and Venus. The ExoFleet, the Homeworlds' space navy (in particular, Able Squad, a group of Exo-Frame pilots led by Lieutenant J.T. Marsh), fight against the invasion in an interplanetary war to protect the Terrans.","popularity":48.884,"poster_path":"/AnrESNGYTVsSZrT3Q5oJFgoNzSC.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"1993-09-18","episode_count":13,"id":2068,"name":"Season 1","overview":"","poster_path":"/gBsNvPBAANkAf1qru5MEx4F4diG.jpg","season_number":1,"vote_average":0},{"air_date":"1993-12-18","episode_count":39,"id":2069,"name":"Season 2","overview":"","poster_path":"/vvlG3SFtcCN3SDnP4qEr58N5miJ.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Scripted","vote_average":6.9,"vote_count":10,"season_data":{"1":{"_id":"52538faa19c2957940280d93","air_date":"1993-09-18","episodes":[{"air_date":"1993-09-18","episode_number":1,"episode_type":"standard","id":38559,"name":"Pirate Scourge (Fall of the Human Empire 1)","overview":"A series of raids on commerce vessels prompts the Earth Homeworlds' General Assembly to send the entire Exofleet to wipe out the pirates once and for all.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/pfGglRSmz8m0tKTpD2sL0Pktov5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-09-25","episode_number":2,"episode_type":"standard","id":38557,"name":"Seeds of Deception (Fall of the Human Empire 2)","overview":"The Exofleet pursue the pirates back to their base. Napier prevents an assassination attempt on governor Phaeton.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/28JqdTeihdfFKxJXxn1pUuA6fKf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-10-02","episode_number":3,"episode_type":"standard","id":38554,"name":"Hidden Terrors (Fall of the Human Empire 3)","overview":"Getting hammered by the pirate base's defenses, the Exofleet sends down Able Squad to take them out. The Martian finance minister discovers someone has been taking massive funds from the Neo-Sapian treasury.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/2vFS04ZsA39QgEAHJtVpraMrplV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-10-09","episode_number":4,"episode_type":"standard","id":38555,"name":"Blitzkrieg (Fall of the Human Empire 4)","overview":"The Exofleet races back from to Earth from Saturn, hoping to return in time to stop the Neo-Sapien attack. Marsh gets charged with mutiny when he disagrees with Captain Marcus' decision to split the fleet, sending the fastest ships ahead of the rest. Napier escapes from a work camp and tries to organize a small resistance cell.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/tYuAMP8Jg67DjTsDMeIX93uZNvz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-10-16","episode_number":5,"episode_type":"standard","id":38556,"name":"Resist! (Fall of the Human Empire 5)","overview":"Able Squad is stranded on Earth after distracting the Neo fleet, to allow the Exo-carriers to retreat. They make contact Napier's resistance, but get a cold greeting, as the Earthers blame them for leaving the planet unprotected.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/eF19tsTdzw8IgWnPrZJQ9cvJDnP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-10-23","episode_number":6,"episode_type":"standard","id":38558,"name":"Target: Earth (Veil of Doom 1)","overview":"After 1 year in the brig for insubordination, Able Squad is back in action. Marsh, Marsala and Deleon get the first mission - to return to Earth and disable the newly built planetary defense shield with the help of the Earth resistance. But when they're ambushed at the rendezvous point, people start suspecting there's a traitor in their midst.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/bX7VinnvUlvobK4tgB05mmcjK0j.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-10-30","episode_number":7,"episode_type":"standard","id":38561,"name":"A Traitor Among Us (Veil of Doom 2)","overview":"After hijacking a transmitter to warn Exofleet about the Venus Grav Shield, JT, Alec and Marsala try to get off Earth by sneaking aboard a prison transport. The rest of Able Squad is sent to Venus to locate the shield projector installations.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/jPrw8NTjXSpKbXbIuBZZYFbER5Z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-11-06","episode_number":8,"episode_type":"standard","id":38560,"name":"Scorched Venus (Veil of Doom 3)","overview":"Marsala takes control of the space tug and saves the container, crash landing on Venus instead. Nara goes off on her own to locate her family, while the others try to locate her thinking she was shot down.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/6bcTfUD6nHzzGDflxu5CpbHcnek.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-11-13","episode_number":9,"episode_type":"standard","id":38562,"name":"Sabotage (Veil of Doom 4)","overview":"Nara is reunited with her brother, James as Able Company attempts to deactivate the Graf Sheild surrounding Venus.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/ccJ6QzaPerWbzcL00oemPBL9G4l.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-11-20","episode_number":10,"episode_type":"standard","id":38563,"name":"Abandoned (Into the Heart of Darkness 1)","overview":"Captain Marcus is angered by Admiral Winfield's decision to not attempt to liberate Earth, which he perceives as cowardice. After sending Able Squad (minus Weston and Takagi) on a secret mission to Mars as a way of getting rid of Marsh and other Winfield supporters, Marcus mutinies with the support of at least one other captain and most of the Resolute's security forces. The mutiny succeeds, with Winfield and his supporters (including Weston and Takagi) being locked in the brig. Able Squad reaches Mars, and the episode ends with them fleeing pursuing Neo e-frames.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/auvLgjlJgeRr45pwYyzhqTdlUA1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-11-27","episode_number":11,"episode_type":"standard","id":38564,"name":"The Brood (Into the Heart of Darkness 2)","overview":"Able Squad continues to flee from Neo sapien e-frames on Mars, and eventually they find shelter in a cave. Captain Marcus orders the ExoFleet to set a course for Earth, so that they can liberate it. Phaeton knows that the ExoFleet cannot withstand the Neos combined strength, and so he orders the Mars Fleet to Earth to assist (which results in the Neo frames halting their pusuit of Able Squad). The fleets engage near Earth, and the Neo sapiens are clearly victorious, inflicting devastating losses on the ExoFleet, whose few remaining ships attempt a withdrawal. The only Neo losses occurs when Marcus destroys the Resolute in the vicinity of many Neo capital ships, which are also destroyed. While covertly searching the Neo sapien complex, Alec and Marsala find thousands of brood chambers. The episode ends with Marsala sounding an alarm which brings Neo guards (who capture the two), demanding to see Phaeton, and declaring that he will save his people.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/2UiTJwC1REboyA6KLB2kjTqQB9d.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-04","episode_number":12,"episode_type":"standard","id":38566,"name":"Betrayal (Into the Heart of Darkness 3)","overview":"The remnants of the ExoFleet escape and, once he has put down the mutiny, Admiral Winfield has the fleet set course for a return to Io. Marsala is taken to Phaeton, who is hesitant to believe that Marsala has changed sides. Marsala captures the rest of Able Squad, and Phaeton has Marsala conduct a brain scan of Marsh to determine if his defection is deception. When Marsala is given the opportunity to execute his fellow squad members he makes an impassioned speech regarding the plight of the Neo sapiens, but then turns against Phaeton. The rest of Able Squad rushes the guards and they take control of their location. At the end, Typhonus is sending troops to the area, giving orders to shoot to kill.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/ZNLsarUdgsyd3Vqb9PK7arBTvb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-11","episode_number":13,"episode_type":"finale","id":38565,"name":"Defying Olympus (Into the Heart of Darkness 4)","overview":"Able Squad escapes from the brood chamber with Phaeton as a hostage (a useless one, since Typhonus wouldn't mind him dead). Once outside Phaeton tries to resist and is shot, he then falls down the mountainside. Able Squad climbs up the mountain so they can destroy the brood chamber. They then realize they can accomplish this by flooding it with magma. Phaeton returns to try to stop them, but J.T. defeats him in an e-frame battle. The mountain then explodes, and Weston and Takagi arrive just in time to pick up their fellow squad members. The episode ends with a preview for next season with Marsh and Typhonus each receiving missions from their leaders.","production_code":"","runtime":30,"season_number":1,"show_id":699,"still_path":"/4GnPDPrILnuOtbzbc0aIS3fSnYc.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":2068,"poster_path":"/gBsNvPBAANkAf1qru5MEx4F4diG.jpg","season_number":1,"vote_average":0},"2":{"_id":"52538faa19c2957940280da6","air_date":"1993-12-18","episodes":[{"air_date":"1993-12-18","episode_number":1,"episode_type":"standard","id":38568,"name":"The Gathering","overview":"The resistance from Earth gathers at the base on IO.\n\nTyree the leader of the Australian resistance is introduced (he makes an impact later on)\n\nSean Napier is appointed as the head of Earth's resistance.  Most of the leaders agree to submit to the authority of the Exo-Fleet for the sake of liberating earth.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/kmL1Ilns4wRm82nH8esjIBgGTLl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-25","episode_number":2,"episode_type":"standard","id":38567,"name":"The Embassy","overview":"Marsh and DeLeon arrive on Tethys, and there are many pirates angry about the prospects of a treaty with the ExoFleet. Phaeton orders Typhonus to continue laying siege to Io with half his fleet, and proceed to Tethys with the other half to prevent an ExoFleet/Pirate alliance. Winfield discusses coordinated assaults with the resistance leaders, who seem less than receptive. Napier stands up for Winfield, which causes the others to support cooperation and choose Napier as commander of all of Earth's resistance. Marsh defeats Jubail in a duel that was to decide whether the Pirates would ally with the ExoFleet or not. But when Marsh refuses to kill Jubail, Simbacca decides the ExoFleet is too soft and would not make a good ally. Typhonus then arrives claiming to wish to discuss a treaty between the Neo sapien government and the Pirates.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/bnMTEf8bD9c2ANBWGSfumJLInUK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1994-05-01","episode_number":3,"episode_type":"standard","id":38571,"name":"Pirate's Ransom","overview":"Typhonus offers a treaty of friendship to the Pirates in exchange for Marsh and DeLeon. When Simbacca refuses Typhonus' forces attack, wounding and capturing Simbacca. The Pirates plan to capture Marsh and DeLeon to trade them for Simbacca. Instead the two capture Hallas and use him to fool Typhonus into thinking that the Pirates succeeded and now wish to make the prisoner exchange. Upon docking the three fight their way to Simbacca's cell and free him. They try to fight their way out, but get stalemated by Neo troops. Alec uses his e-frame to send a message from Simbacca to the Pirates telling them to attack. The attack, led by Jubail, is enough of a diversion to allow them to escape. Once they arrive back on Tethys Simbacca announces that the Pirates will enter the war on the side of the ExoFleet.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/w8UeYhlTMHaGrNvXccpwZBm7Xf2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":4,"episode_type":"standard","id":38572,"name":"Ultimate Weapon","overview":"As the Pirate fleet leaves for Io, Simbacca tells Marsh to teach some pirates to fly e-frames. J.T. objects, citing the fact that e-frames are too complicated to learn quickly. Despite this, the e-frames are sent to prevent some Neo scouts from reporting back to Sinope, which is the site of a Neo Fusion Pulse Cannon. When the Pirate fleet is within range of the cannon, it begins to pick off Pirate ships. Marsh, DeLeon, and Hallas succeed in destroying the cannon, saving the fleet, as well as Io.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/tCOA8F2zQU3ofclsl3pGx7pBPBo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":5,"episode_type":"standard","id":38573,"name":"Expendable","overview":"Torres is put in the brig for attacking Jubail, who agrees to drop the charges as repayment of his debt to Marsh (who spared his life in The Embassy). Barca learns that the GRAF shield is inoperative, and is discovered by Jubail as he tells Typhonus. In the struggle that ensues Barca kills Jubail, and tells the guards that arrive that Jubail was the spy. Typhonus orders an attack on unprotected Io, and the ExoFleet abandons the base. When Typhonus pursues them, a Pirate fleet from Chaos decloaks on the Neos' flank, and starts to do damage tto he Neo fleet. The Neo fleet returns to Mars, where Typhonus is executed for his incompetence.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/nkMbMQKOShbr7M7Ml0Hj5CBsEC0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":6,"episode_type":"standard","id":38569,"name":"Mindset","overview":"Marsh and Marsala coordinate with the Chicago resistance to free the imprisoned members of the Homeworlds Congress. Napier encounters Amanda Conner, his ex-wife, who is conducting interviews there.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/zk7HSQLflpFPsjAuzEjDJDrPIPH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":7,"episode_type":"standard","id":38570,"name":"The Last Man","overview":"A Jumptroop assault on Ceres results in the discovery of a new type of Neo, the Neo mega. It is captured and causes problems on the ship, until it is launched out a docking bay into outer space.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/ArDCCGi93agz3bcijMozTHj9yJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":8,"episode_type":"standard","id":38578,"name":"Dragon's Rock","overview":"After discovering that the resistance cell on Venus that they were supposed to deliver weapons to has been destroyed, Burns and Bronski are themselves captured. After a march with other captured Terrans, they arrive at a construction site, where Draconis is building a fortress he intends to use against Phaeton. The rest of Able Squad arrives to free Burns, Bronski, and the slave laborers, many of whom were in the resistance. The Venus resistance takes the large weapons stockpile and escapes.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/dexy1dmiwLKqQ3ESL3OiDoYlviL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":9,"episode_type":"standard","id":38577,"name":"Inner Dark","overview":"Barca convinces Hallas to assassinate Simbacca, but only a serious wounding results. As Able Squad searches for Hallas, Barca attempts to lay a trap for them, but it results in the discovery that the Pirates have been building a gigantic Exo-Carrier (christened the Resolute II). Marsh convinces a recovered Simbacca to spare the life of Hallas.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/ctH4Q3pV9EA37IVL4Waizb9MWiH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":10,"episode_type":"standard","id":38575,"name":"The Dogs of War","overview":"Torres arrives in Phaeton City to coordinate with the resistance there, with the objective being the capture of a Neo mega. Anticipating this, Shiva's Neo mega advisor, Lucullus, sets different traps for them. One of these allows the Resistance to capture Sulla, who can then transmit the location of Resistance headquarters. Upon receiving its location Shiva launches an attack which Lucullus believes to be premature. When Napier returns from a meeting with other Resistance leaders he is able to take advantage of his unnoticed approach from behind the Neos to help his own troops escape the Neo attack. For his failure to capture the members of the Resistance, Shiva is replaced by Livia as Commanding General of Earth Forces.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/uq5dNPok9RoD1WETaTNQaq0yXlT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":11,"episode_type":"standard","id":38574,"name":"The First Step","overview":"A replacement pilot, Yuri Stavrogan, preys on Kaz's hotshot tendencies, which results in his disobeying some of J.T.'s orders and causing tension between all three. The ExoFleet begins an assault on Mercury, and Yuri and Kaz make a point of trying to defeat Thrax, who is considered the best Neo pilot. The ExoFleet takes a Neo base on Mercury, but the Neo Commander Glycon launches a counterattack to draw in the ExoFleet e-frames so that Thrax and the Neo frames can attack the ExoFleet ships. The counterattack is foiled on the ground, but the Neo e-frames are able to attack the ExoFleet task force. Kaz, grounded by Marsh for disobeying orders, goes out to fight. He eventually finds himself in a dogfight with Thrax, and he loses when he gets blinded by the sun. Thinking that there has been enough destruction, Thrax chooses to spare his life.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/94jnUxFW5kGjWP3St0I9C52043A.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":12,"episode_type":"standard","id":38576,"name":"The Greatest Fear","overview":"Able Squad arrives on Venus with the mission of locating and estimating every Neo base and troop concentration on the planet, as a prelude to invasion. While investigating a secret research facility Torres and Bronski are discovered, and in the battle to retrieve them Marsala is captured. He is taken inside, and sees that the facility is for research related to AutoMutation Syndrome (apparently a Neo sapien version of cancer). To prevent Marsala from divulging ExoFleet plans for an invasion Marsh sets out to destroy the facility with Marsala inside. Nara is unwilling to let Marsala be killed, and she goes to rescue him. She manages to succeed before Marsh finishes demolishing the complex, and on their way out she and Marsala unwittingly capture an experimental subject that merged with the Neo mega Lysander.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/a0MVu4DUP93iR57MwdsCqKd0e9Z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":13,"episode_type":"standard","id":38580,"name":"Flesh Crawls","overview":"DeLeon and Weston are to take the captured Neo mega, Lysander, and a mutating agent back to the planet Chaos for examination. But what they believe to be Lysander is actually a melding of the Neo mega with a Neo sapien receiving experimental treatment for AutoMutation Syndrome. So during the flight back Lysander escapes and wreaks havoc on the Scavenger, killing various pirates, Captain Ryack included. The survivors abandon ship, leaving behind a overloading fusion pack to destroy the ship with the now mutated Neo aboard to be killed.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/kFIvVv84cxDoP8lZ2XXtvgMG1Qg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":14,"episode_type":"standard","id":38579,"name":"Behind the Shield","overview":"Sullust, Neo mega advisor to Draconis, sets a trap on Venus for the ExoFleet using the old GRAF station and a new one constructed by Enleal. Only aware of the one installation, Able Squad is sent to destroy the old station so that the approaching ExoFleet invasion force can launch its assault as planned. By the time they realize that the old station is a decoy, the new one as been activated. Unfortunately for the Neos it is useless against cloaked ships, and the ExoFleet is able to land its Jumptroops.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/vZoE1rJQoFEAm6WwvxcdPVDNmg1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":15,"episode_type":"standard","id":38581,"name":"Venus Rising","overview":"The ExoFleet is having success in its campaign on Venus. James Burns leads the Venus resistance in an attack on Vesta, and he is severly wounded by Draconus in the process. Knowing that the ExoFleet will take the city, Draconus orders Thrax to detonate a hydrogen bomb, but after much thought Thrax does not obliterate the city. Phaeton arrives with the Olympus Mons II to prepare a counterattack.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/dDFW9HonMWv8UGcSdRpJ6NwbsOA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":16,"episode_type":"standard","id":38585,"name":"Miracle","overview":"The ExoFleet has taken Venus, but the Neo sapien Fleet, with Phaeton in command, prepares to counterattack. Barca sabotages the Resolute II, putting them in a precarious position. With Marsala pretending to be a Neo soldier who carries information about Draconis' plot against Phaeton, Able Squad boards the Olympus Mons II and cripples it. Algernon has since patched together the Resolute II, which proceeds to finish off the Olympus Mons II. Draconis escapes, leaving behind Phaeton to be killed. When he returns to Earth with plans of ruling himself, he is met by the real Phaeton (the other was just a clone), who has him taken away, likely to be executed.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/mdTxKLcTXf3vg7DdJx8SI08Y4gE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":17,"episode_type":"standard","id":38586,"name":"Under the Skin","overview":"Phaeton's scientists have succeeded in creating a Neo sapien that looks like Alice Noretti, who was a member Able Squad when she was killed. Phaeton places her on a Terran worker transport, having learned that the Resistance plans to free the workers. Phaeton assumed (correctly) that she would be placed back with Marsh's squad, and since Marsh was a favorite of Winfield it would only be a matter of time before Noretti got the opportunity to assassinate Winfield. Meanwhile the Marsh/O'Reilly romance seems to progress, but is hindered by the arrival of Noretti. Marsala begins to notice clues that indicate Noretti is a Neo, but Marsh is in denial when Marsala shares his suspicions. Winfield decides to go to the Venusian surface to examine the situation and mingle with the troops, and of course expects to meet Marsh. Noretti acts, and has the opportunity to kill Winfield. But an identity crisis prevents her from doing so, for she embraces her Alice Noretti persona. She then tries to fight her way past various e-frames and jumptroops, but after getting hit by O'Reilly her e-frame crashes into the canyon wall, killing her.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/rh09rzbQDXb9U6lolQcT4vVrFN0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":18,"episode_type":"standard","id":38583,"name":"Ultimatum","overview":"Marsala is kidnapped by former members of the Venus resistance, who demand that all Neo sapiens, whether loyal to ExoFleet or not, be deported from the planet. James Burns, who has been fitted with prosthetics, decides to help his sister and try to rescue Marsala alone. He is able to infiltrate the kidnappers' ranks by pretending to be sympathetic to their cause, and later tries to sneak Marsala out. Some Neo sapien holdouts attack the encampment, and though James is able to save Marsala, it is at the cost of his own life.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/7j4p9y5drpXXdj2dPqVDUq6hDu8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":19,"episode_type":"standard","id":38584,"name":"Warrior Brood","overview":"Nick Tyree, leader of the Australian resistance, disobeys orders from Napier and the ExoFleet and proceeds with an uprising throughout Australia. Able Squad and Napier go to Australia to try to convince him to pull back before the Neo sapien counterattack. Whether Tyree would have or not is moot, since Phaeton's response arrives in short order. He unleashes new warriors, genetic mixes of Neo sapiens and different predator species. The resistance forces that are able withdraw to Canberra to make a stand there.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/nWz0IZGCtmeZOwUuxH5wGte8yqJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":20,"episode_type":"standard","id":38582,"name":"The Dream War","overview":"Torres, Bronski, and Takagi return to Canberra to provide air cover for a withdrawal attempt by the resistance. The attempt fails miserably, and they are forced to retreat back into the Parliament House. Weston stayed with DeLeon to try to fix his e-frame, and they come under attack by lizard Neo warriors. They escape to an aborigine camp, but are followed there. They lead the Neo warriors into a trap and destroy them with a rigged fusion pak. Napier escapes with Marsala in the cloaked e-frame.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/hsglYrIhR9GNqfCtvhtzS58jHXs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":21,"episode_type":"standard","id":38588,"name":"No Surrender","overview":"Napier escapes with Marsala. Despite his own objections, General Shiva complies with Phaeton's demand that he capture Marsh alive. Shiva offers to let everyone else within Parliament House go in exchange for Marsh, but Tyree refuses. The attack is launched and the resistance quickly loses ground. But Butler's company of jumptroops arrives, and they are able to capture Shiva. In exchange for his life, Shiva lets the surviving members of the Australian resistance go.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/fymUjAJjBblCW1HbsIfg5rkCpIM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":22,"episode_type":"standard","id":38587,"name":"Fire Ship","overview":"An attempt by the ExoFleet to covertly land e-frames on Mars to investigate a gigantic complex fails miserably, with most of the e-frames destroyed and pilots killed, because a spy tipped off the Neos to their arrival. That spy is Barca, who has Able Squad (the only survivors) captured, and proceeds to plot with Typhonus. The plan is to load a Neo ship, which Barca will claim to have captured, with explosives and then get it close enough to the Resolute II that it will be caught in the explosion. Hallas helps Able Squad escape, and the Neo ship destroys Barca's own ship rather than the Resolute II.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/oPvfEyxI7z7WVQ9cVKm8CYfUBwS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":23,"episode_type":"standard","id":38591,"name":"Martian Luck","overview":"The capture of Marduk, a Neo sapien who has supplied the ExoFleet with information, prompts Winfield to send two exosquads to Mars. Eventually Typhonus uses the spy as bait to ensnare the exosquads in a trap, but is not entirely successful. Torres gets shot down and rescued by some ExoScouts.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/jiXB9xRcpwOy3CmeHNxEDKnjJ7y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":24,"episode_type":"standard","id":38592,"name":"The Lost Patrol","overview":"Torres, believed dead by her fellow ExoTroopers, takes charge of the ExoScouts that found her. A few of them resent this, and while she tries to lead them all to her exosquad, they arrange for her to have an accident that they believe results in her death. The ExoScouts are then captured by a group of raptor Neo warriors, which had been dispatched by Typhonus in the hopes that the ExoScouts could reveal the location of the exosquads on Mars. But Torres is not dead, and she manages, one by one, to free the ExoScouts who then truly follow her. Meanwhile, Able Squad and the remainder of Baker Squad have arrived at the site of what they believe to be an underground Neo complex, but they discover that it is something far more unusual.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/5qBib9NzCng6FAfcpvEf2YzSw8R.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":25,"episode_type":"standard","id":38590,"name":"Call of the Unknown","overview":"Able Squad blasts its way into the alien complex, and is pursued inside by Typhonus and his troops. After a battle which is made more difficult by interior defenses, Able Squad escapes into a different section. Meanwhile the alien structure begins to grow out of the ground. After the exosquad has blasted its way out and come to the aid of the jumptroops with Professor Algernon, the spire begins emitting great energy waves.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/sRCN7ZJBC3aYUv1m8ruFdJXvph6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":26,"episode_type":"standard","id":38589,"name":"Heart of Mars","overview":"Both Marsh and Typhonus make seizing the alien technology their top priority. Both the ExoSquads and Neo frames make it to a central complex, and a battle follows. A fusion pack explosion in the core causes the alien complex to begin to self-destruct. Everyone tries to frantically escape, as the planet itself suffers from quakes and lava flows. Soon after the ExoTroopers and Torres with the ExoScouts escape, the planet Mars is destroyed in a gigantic explosion.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/vlxKQLafl7KSU0CbyQGYh29KN7B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":27,"episode_type":"standard","id":38594,"name":"Winged Fury","overview":"Marsh finds himself in New York, facing down a group of Neo-Warriors sent to hunt him down (you'd think he threw Phaeton off a mountain or something). He encounters the last cabbie in New York, Sidney.  Marsh eventually outwits the Neo-Warriors but the Torch on the Statue of Liberty is destroyed in the process.  Marsh makes his way to the Resistance, while Sidney stays in New York.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/zN6kcf4UJokajASfL0Vsb0gSoX6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":28,"episode_type":"standard","id":38597,"name":"The Night of the Traitor","overview":"Phaeton gives orders to Lucullus to begin work on a bunker underneath Phaeton City. Marsh attempts to rendezvous with Marsala and Felson in Maine, but realizes Turner's treachery and is able to escape the trap set by the Neos. The Neo megas claim Marsala's body, and take him to their base on Maniton Island, where they revive him. Galba and the others explain that they want him to kidnap Phaeton, for he will not surrender despite the fact that the Neo sapiens are losing the war. That way they can take charge and make peace. Marsala reluctantly agrees to their plan. Meanwhile Picasso has discovered that Phaeton is in the tunnels beneath the city. Once he notifies the Resistance they mount an operation, including Marsh, to go after Phaeton. Beneath Phaeton City, the Resistance attacks and Phaeton blames Lucullus and Gracchus. As Phaeton goes to join the battle he is ambushed by Marsala. Lucullus and Gracchus use the confusion to try and shift the blame for the Resistance assault on Livia. Phaeton is able to escape from Marsala by exiting his e-frame and utilizing the fact that the Auto Mutation Syndrome has somewhat liquefied his body to enter a sewer pipe only a few inches in diameter. As Marsala is leaving he comes across the Resistance in full retreat, and their chances of escape do not appear to be good. Marsala fires a few missiles to collapse the tunnel on the pursuing Neos. Lucullus and Gracchus, assuming that Phaeton is dead, begin to organize a purge. Phaeton arrives on the scene, however, and has them arrested instead.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/q8NVl8pan0xT2kkTcbQgKS8URv6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":29,"episode_type":"standard","id":38596,"name":"Trial by Combat","overview":"A combined E-frame/Jumptroop mission to Antarctica to destroy the Neo warrior breeding complex becomes a disaster, as apparently only Yuri Stavrogan survives. Professor Algernon has made modifications to Alec DeLeon's E-frame, which provides a closer link between pilot and E-frame. Able Squad gets sent to Antarctica to try to locate the breeding complex. While planting a sensor which was to be part of a network, Marsh gets captured by some Neo warriors. Galba tells him to pretend to be Takagi, since all Neo Sapien commanders have orders to hand Marsh over to Phaeton. To test the capabilities of a Neo Lord, Praetorius has one duel with Marsh, who he believes to be Takagi. Marsh tries to escape, and his E-frame somehow contacts Alec's, and so Able Squad is about to attempt to get him. But Marsh gets defeated by a Neo Lord, who forcibly removes him from his E-frame.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/1FvHlF1l6FSCaoltX1JD3uy7zJS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":30,"episode_type":"standard","id":38598,"name":"The Perfect Warrior","overview":"Galba pretends, for the sake of Praetorius, to conjecture that the ExoTrooper they have captured is in fact Marsh masquerading as Takagi to avoid being taken to Phaeton (which is true because he told Marsh to). Praetorius has the Neo Lord spare Marsh's life and taken to his cell. When Marsh is about to be taken to Phaeton, Galba helps him escape and get to Kaz's ExoFighter. He then contacts Able Squad, which is able to locate his position and proceeds to, along with Jumptroop Company Charlie, attack the brood complex. Marsh was since hunted down by Neo Lords inside the complex, but was able to escape though it meant abandoning the ExoFighter. He makes his way to the geothermal processing plant and is able to destroy it, thereby destroying all the developing Neo lords as well. He is rescued by Stavrogan and DeLeon, while a bitter Praetorius is left to ponder future plans.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/cszsFx2DCfC7oHzA66dzfZTERfi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":31,"episode_type":"standard","id":38593,"name":"The Price of Courage","overview":"Phaeton has Shiva take most of what remains of the Neo Sapien fleets to Venus in a final attempt to destroy the ExoFleet. With the Resolute II undergoing repairs, Admiral Winfield takes a large portion of the fleet towards Earth in an attempt to fool the Neo Sapiens into thinking an attack is imminent, and therefore withdraw to defend Earth. Shiva calls Winfield's bluff, and proceeds with an attack on the fleet at Venus. An E-frame assault on the Neo Fleet fails, but a follow-up by torpedo boats inflicts heavy damages on the Neo Fleet. Shiva then personally leads an e-frame assault, but is shot down and dies as the attack fails.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/eG36Gm1rlPsTflOpVWquEEFXNJW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":32,"episode_type":"standard","id":38595,"name":"Dark River","overview":"Marsh, Burns, and Marsala go to South America to retrieve a Terran geneticist named Ketzer, who the ExoFleet hopes will help them discover a weakness in the Neo lords. Although they destroy a Neo patrol they encounter, Draconis becomes aware of their presence in the rain forest. The three are then attacked by green humanoids, who succeed in capturing Nara. They take her to their village. She awakens with her arm hurting. Ketzer is there, for it was he who altered the natives, as well as himself. Ketzer notifies her comrades of her whereabouts, and they soon arrive. The Neos also pick up the signal, and Draconis is convinced by Medusa that he will be rewarded if he were to personally lead a successful attack. Medusa then reports to Livia that Draconis only serves for the sake of his own gain, not out of loyalty. Ketzer asks for the help of the ExoTroopers in attacking the nearby city Manaus. When they refuse he reveals that he has injected Nara with a retrovirus that will alter her DNA to make her like them, but has a compound that will prevent it if they help him. Just then the Neos launch an attack on the village, forcing both the villagers and the exotroopers to flee. Draconis is killed for disloyalty on Livia's order by a group Neo lords, ending Neo pursuit. Marsh tells Ketzer to recreate the compound that will cure Nara, but Ketzer says that he lied when he said there was a cure. Marsh wants to take Ketzer back to the ExoFleet, as were his orders, but Ketzer escapes when his altered humans distract the exotroopers with the possibility of an attack.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/pWdRripJu4GrweL6KwkWnQb0ut7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":33,"episode_type":"standard","id":38599,"name":"The Art of War","overview":"A mission to deliver explosives to Earth Resistance lands Bronski and Takagi in Alaska, where they meet up with the Chicago resistance. They must place the explosives on a train so that the base to which it is going will be destroyed. But when they discover some of the cars carry many of the world's greatest art creations, Hanley hesitates. So they steal the cars with the art, plant the explosives in the particle accelerator, and get the empty cars destroyed so the Neos will stop looking for them. The rest of the train makes it to Great Slave Lake in Canada, where it explodes the next day.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/y55xU0wC40bDlack0LksUZYlL7x.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":34,"episode_type":"standard","id":38604,"name":"One Small Step (The Fall of the Neosapien Empire 1)","overview":"ExoFleet jumptroops and E-frames land on the moon in an attempt to retake it from the Neo sapiens. But when Phaeton sends nearly every e-frame on Earth after the fleet itself, the e-frames invading the moon are recalled. DeLeon receives permission from Marsh to stay on the moon with the jumptroops to help them. Battles rage both on the moon and above it. DeLeon and O'Reilly battle Typhonus and kill him, but Alec is mortally wounded in the process. Before he dies he has O'Reilly help him use the black box from Typhonus' E-frame to appear to be Typhonus in a transmission to Phaeton, in which he tells him the Neo pilots are either surrendering or retreating. As punishment for such betrayal, Phaeton activates the self-destruct mechanism on all the Neo E-frames. The combination of this and Alec, as Typhonus, telling the Neo troops on the moon to surrender ends the battle. Afterwards, with Alec DeLeon dead, O'Reilly delivers DeLeon's E-frame black box to Maggie Weston.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/hDBXdzyflSyEVEqzjwOEMV7cW2m.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":35,"episode_type":"standard","id":38600,"name":"Fifth Column (The Fall of the Neosapien Empire 2)","overview":"Admiral Winfield has the Earthbound resistance cells all launch attacks at once, as a prelude to the ExoFleet's invasion. Napier's group succeeds in part because of help from the Terran workers at the factory they were attacking. These workers join the resistance in the tanks that they had built for an assault on Phaeton City. On the way they are met by Neo tanks, and a battle begins at Battle Creek. Before the ExoFleet attack Weston gives Alec's flight recorder to Algernon. Meanwhile Galba learns of Phaeton's doomsday device and tries to notify the resistance, which is unable to contact the ExoFleet before the invasion begins.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/7vMyuucGSklW42SjTNUxfck0AqN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":36,"episode_type":"standard","id":38602,"name":"The Last Jump (The Fall of the Neosapien Empire 3)","overview":"Able Squad and Charlie Company land in Washington D.C. to attack a Neo Lord breeding facility. Bronski gets shot down, but is able to escape his E-frame and joins Marsala in his. Winfield then recalls Able Squad, and wants them to depart immediately despite Marsh's objection that the jumptroops won't have proper cover. On the Resolute II Winfield tells them that he is sending them to locate Phaeton's doomsday device, and Algernon will go with them to determine the best way to destroy it. Bronski, with no E-frame, remains behind. Meanwhile Praetorius has prematurely released all his Neo Lords, so they have no wings and lack intelligence. But they cause immense trouble for the jumptroops, destroying their evac shuttle and forcing them to withdraw. Winfield lets Bronski take his personal shuttle to get them out, and he arrives just as it appeared as though the jumptroops last stand at the Washington Monument would fail.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/IiLXaQWBGjC3Z9Fbhhm3vBGsOE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":37,"episode_type":"standard","id":38601,"name":"A Night Before Doomsday (The Fall of the Neosapien Empire 4)","overview":"The shuttle carrying Charlie Company is shot down. The battle at Battle Creek between the resistance e-frames and captured tanks and a group of Neo tanks ends, with the resistance victorious. Livia orders Thrax to bring all of his troops from the Amazon to Phaeton City for a final stand, but he tells her that he intends to save as many Neo lives as possible, and plans to surrender to the ExoFleet. This prompts Phaeton to issue orders for a purge of all officers by the Neo lords. Seeing E-frames approaching, Thrax orders all his troops into the jungle. Once Thrax is captured and taken away, Ketzer attacks the Neo base and with only Medusa there has little trouble injecting her with something. Able Squad locates the complex where Phaeton's doomsday device was constructed, but finds that it is now gone. As they leave they are ambushed, and in the course of the battle Stavrogan is killed and Marsh captured. Marsh is then taken to Phaeton City and brought before Phaeton.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/guDZGDTWlaY50Ka9e9Ye5RajhlD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":38,"episode_type":"standard","id":38603,"name":"Abandon Hope (The Fall of the Neosapien Empire 5)","overview":"Phaeton tells the captive Marsh of his plans to destroy the world. To prevent this Winfield is sending a few ExoSquads into Chicago to go after Phaeton. O'Reilly fixes the jumptroopers shuttle so that the remainder of Charlie Company, along with Bronski, can also make it there. Despite Livia's protestations, Phaeton will not leave the city. When he attempts to activate the doomsday device, he finds it has been sabotaged and he knows it was Livia who did it. Able Squad battles their way through the tunnels beneath the city, and Nara, Marsala, and Takagi reach the main chamber just as Phaeton is about to flip the now functional switch to the doomsday device. A battle ensues which ends when Nara, at first instinctively using her strange powers to stop Phaeton, kills him.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/70BFkQlUTtNI9oz5FNw1SCS32rJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1993-12-18","episode_number":39,"episode_type":"finale","id":38605,"name":"Beyond Chaos","overview":"Around the world Neo Sapiens are surrendering, bringing the war to a close. Able Squad is performing this duty in South America with the assistance of Thrax. Elsewhere we see that Kaz is now a cadet at ExoFleet Academy, where Avery Butler is now commandant. One day Able Squad is ambushed by Ketzer and his group of genetically altered humans, but Able Squad drives them off. A month later finds Nara returning to Venus, and she attempts to tell Marsala of her feelings for him. But Marsala makes it clear that this cannot be. Nara then experiences another manifestation of her strange abilities. Meanwhile Galba informs Weston that he has made a new body for Alec DeLeon, and transferred his mind from his E-frame's black box into the new body. Marsala makes a moving speech to the Homeworlds Senate convincing them to create one last brood of Neo Sapiens, one that would have the ability to procreate naturally. When Napier goes to a Neo internment camp to announce this, an attempt is made on his life. It is thwarted, however, by a clone of Shiva. Algernon uses GRAF shield technology to reassemble the planet Mars. Winfield gives Marsh one more mission, helping the Pirates dismantle their base on Chaos. He meets Colleen O'Reilly, who tells him she isn't ready to leave the ExoFleet yet. At Chaos, Marsh witnesses a strange phenomenon that causes the planet Chaos to disappear, and it then joins one of three mysterious ships that is en route to the inner solar system.","production_code":"","runtime":30,"season_number":2,"show_id":699,"still_path":"/2wUXRFC56akcIufAWYYI5gryurX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":2069,"poster_path":"/vvlG3SFtcCN3SDnP4qEr58N5miJ.jpg","season_number":2,"vote_average":0}}}