{"adult":false,"backdrop_path":"/wooNuJT0aWzjg1iNTWRJMZtqoEc.jpg","created_by":[{"id":587933,"credit_id":"62cafa9d90b87e0758647be1","name":"Iginio Straffi","gender":0,"profile_path":"/w9m21TnSMGrkWDwrsq80IvTfqtp.jpg"}],"episode_run_time":[24],"first_air_date":"2016-11-04","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"}],"homepage":"https://www.netflix.com/br/title/80007778","id":69919,"in_production":false,"languages":["en"],"last_air_date":"2017-06-16","last_episode_to_air":{"id":1429355,"name":"Tinkerbell is Back","overview":"In the season finale, the Winx club fight along side Matt and Tinkerbell to foil the plans of Jim, better known as captain hook. Finally seeing the light, Tinkerbell reverts to her pure form and Matt winx the mermaids onto the side of the Winx. Jim turns the tree of life into a ship and begins to fly it to the world of nightmares to end all dreams forever. Luckily Smee ends up tackling Jim and moves the tree from damnation, unfortunately Jim falls from the ship and plummets into the portal of the world of Nightmares - never to be seen again.","vote_average":10,"vote_count":1,"air_date":"2017-06-16","episode_number":13,"episode_type":"finale","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null},"name":"World of Winx","next_episode_to_air":null,"networks":[{"id":213,"logo_path":"/wwemzKWzjKYJFfCeiB57q3r4Bcm.png","name":"Netflix","origin_country":""}],"number_of_episodes":26,"number_of_seasons":2,"origin_country":["IT","US"],"original_language":"en","original_name":"World of Winx","overview":"The Winx travel all over the world searching for talent for WOW. and preventing the mysterious talent thief from kidnapping them.","popularity":14.559,"poster_path":"/hN8sWJdSOK5rMBw5em9Vjz0SX8j.jpg","production_companies":[{"id":38411,"logo_path":"/c8YsHSKmHsmpHEyl0VtSZW6KvK5.png","name":"Rainbow","origin_country":"IT"}],"production_countries":[{"iso_3166_1":"IT","name":"Italy"}],"seasons":[{"air_date":"2016-11-04","episode_count":13,"id":84374,"name":"Season 1","overview":"","poster_path":"/bRc8T2cD1GK6NO2MjpO3Q7VN0yT.jpg","season_number":1,"vote_average":9.7},{"air_date":"2017-06-16","episode_count":13,"id":98956,"name":"Season 2","overview":"","poster_path":"/xKXGVGP0AkNaBkFtLPkBtKALXRA.jpg","season_number":2,"vote_average":9.5}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8,"vote_count":32,"season_data":{"1":{"_id":"588b663dc3a36818100194b4","air_date":"2016-11-04","episodes":[{"air_date":"2016-11-04","episode_number":1,"episode_type":"standard","id":1261005,"name":"The Talent Thief","overview":"After a failed attempt to nab the strangely elusive Talent Thief, the Winx select singing waitress Annabelle to be their show's first contestant.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":"/tlxqSGiGAl9pYaGr2FomSKBnCvX.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":2,"episode_type":"standard","id":1429331,"name":"New Powers","overview":"Bloom has a dream where she finds Annabelle in a forest. When they are called by Wow! to find another talent, the Winx split into two groups: Bloom, Flora and Tecna pretend to be sick so they can search for Annabelle, while Stella and Aisha have Musa dress up as their upcoming talent for their Wow! episode. At the Frutti Music Bar, Evans and Gomez interrogate Roxy about Annabelle and she warns the Winx. They regroup at the club dressing room that showcased Annabelle, and discover one of her earrings. But a mysterious portal transports them to where Annabelle is and they learn that they now have a new fairy transformation called Dreamix. Although they fight off some local monster spirits, Annabelle is unable to enter the portal back to Earth and is instead sent to another location.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":"/47uDxjkrcVdGpXMLFabGkplyAV2.jpg","vote_average":10,"vote_count":3,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":3,"episode_type":"standard","id":1429332,"name":"The Legend of the Crocodile Man","overview":"The Winx's next appearance on Wow! is interrupted by a report from New York City in which a crocodile monster (Crocodile Man) has been spotted near on a boat. Flora senses that a guy named Naoki is connected to this so the Winx girls head to Manhattan to find Naoki, who tries to escape from the girls but then finds himself being pursued by Crocodile Man. The Winx save Naoki and reveal to him that they are fairies.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":"/y53pYz9crtNAJlgElkEHs0ki1EK.jpg","vote_average":8.5,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":4,"episode_type":"standard","id":1429333,"name":"The Monster Under the City","overview":"The Winx have found a pocket watch that was dropped by Crocodile Man. They and Naoki try to capture Crocodile Man, but the latter proves to be very strong and elusive. The Winx discover that Crocodile Man is more interested in going after the watch than Naoki. Although Crocodile Man gets the watch and escapes through a portal, Tecna has placed a tracker inside that watch and they learn that Crococile Man has escaped into the World of Dreams.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":"/ZCvOv91KBN11RUXqdWUgt5BVGF.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":5,"episode_type":"standard","id":1429334,"name":"Stylist Wanted","overview":"Bloom contacts Annabelle and learns that she had found a similar pocket watch dropped by a guy who had broken into her apartment and then escaped. The Winx head to Paris to recruit a fashion design student named Sophie. Sophie is reluctant to join and dislikes Stella's style, so Stella suggests they have a contest to see who has the better style. During the contest, Stella encourages Sophie to design the dress of her dreams. Sophie is invited to have the Winx model her new design at a show. Crocodile Man kidnaps Sophie. Although they defeat Crocodile Man and rescue Sophie, they discover she is acting differently and Bloom gets a vision that the real Sophie is trapped in the world of dreams.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":"/9qlg4zNQ9YKICvwyG0bkTYZ7Oh0.jpg","vote_average":10,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":6,"episode_type":"standard","id":1429335,"name":"The Fashion Week","overview":"The Winx sneak into an exclusive fashion week party to look for the Sophie imposter. Bloom discovers the imposter is a shadow creature, but accidentally falls onto the party's cake, causing much embarrassment. The Winx return to the Paris fashion academy where they recruit office worker Nadine to try becoming a model. Nadine is invited by the fake Sophie to model, but the Winx confront Sophie and a bodyguard at the Eiffel Tower. As punishment for ditching the show, Ace has the Winx girls perform some activities that are not within their natural talents. Although Bloom surprises everyone with her singing, she accidentally knocks Ace's hairpiece off; Ace has had enough of Bloom's shenanigans and fires her.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":7,"episode_type":"standard","id":1429336,"name":"The Chef Contest","overview":"Ace sends a new girl named Lorelei to replace Bloom as a talent scout on the show. The Winx find their next talent prospect, an apprentice chef named Vincenzo who has been trying to make his own creations but refuses to listen to his boss Tony or anyone else for advice. The Winx pair up with each of the participants in the competition as their assistants, and eventually encourage and guide Tony to make the right kind of food that he has been dreaming of. Meanwhile, Bloom makes her way to Annabelle's apartment to try to find the watch, but notices Evans is tailing her so she hides from her. Evans eventually finds Bloom and brings her in for questioning.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":8,"episode_type":"standard","id":1429337,"name":"The Shaman","overview":"Detective Evans interrogates Bloom and reveals that she has the pocket watch that Bloom is looking for. Bloom tries to shake off Evans and Gomez with the help of Roxy and her dog Arthur while the other five Winx have to bring along Lorelei on the Winxmobile. Their next talent prospect is in Beijing: a kung-fu martial artist named Yu, but she has to face the Shaman in the finals. During the battle, Yu is kidnapped by the Shaman.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":9,"episode_type":"standard","id":1429338,"name":"Shattered Dreams","overview":"The Winx capture the Shaman, and learn that his master has been controlling the portals to kidnap the talent prospects. However, when Lorelei wants their attention, the Shaman escapes. The Winx head to London to find their next talent prospect: a girl named Madelyn who has been groomed to become a pianist but does not enjoy it. While some of the girls take care of Madelyn's family pugs, the others try to encourage her to follow her real dream. After some Sherlock Holmes-like searching, they find Madelyn in her tree-house and that her real desire is to play rock music on an electric guitar.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":10,"episode_type":"standard","id":1429339,"name":"Dangerous Waters","overview":"The Winx head to Santa Monica Pier on the direction of Lorelei's determination to lead the show. A new assistant, Smee, hypnotizes Ace into putting the girls in a parasurfing challenge race with a group of guys called the Sharks. Lorelei tries to follow but her boat breaks down and she is attacked by sharks (actually mind-controlled by Smee). To make things worse, the guy Sharks are actually zombie pirates. Although the Winx defeat the pirates, Lorelei discovers they are fairies and tries to tell Ace. However, Ace and the audience laugh at her, and Ace fires her from Wow! Meanwhile, Bloom and Roxy track down Evans and Gomez when Jim snatches the pocket-watch from them. They pursue Jim and recover the watch, but find it is broken.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":11,"episode_type":"standard","id":1429340,"name":"Shadows on the Snow","overview":"Jim offers Bloom and Roxy a chance to get the pocket watch repaired. Bloom accepts and goes with him to Switzerland to find the Watchmaker, despite Roxy's reservations. Evans and Gomez follow them. Meanwhile the other Winx head there to scout a girl named Silke who is trying to win a snowboard jumping competition. But they discover Silke has no competition-level talent for snowboarding.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":12,"episode_type":"standard","id":1429341,"name":"The Watchmaker","overview":"The Watchmaker refuses to see Bloom and Jim and locks himself in his home. Bloom and Jim fight Smee's zombie pirates, but are captured and sent through the portal. The other Winx discover that Silke's real talent is repairing mechanical watches and that she is the niece of the Watchmaker. They meet Evans and Gomez and find the pocket watch. After Silke disables the security system, the Watchmaker says he cannot repair the watch as it is magical and runs counter-clockwise, but Silke is able to fix it.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-04","episode_number":13,"episode_type":"finale","id":1429342,"name":"The Fall of the Queen","overview":"Bloom and Jim are brought to the Queen, who has masterminded the kidnappings of the kids and uses their talents for herself. The other Winx arrive but must navigate through the World of Dreams and battle the Shadow Creatures and the local plant life to get to the Queen, who is a formidable foe with her stolen abilities. Jim frees Bloom, who regains her power and together with the other Winx they defeat the Queen. They free the talents and make it back to the Wow! finale and Ace welcomes Bloom back. In the World of Dreams, Smee swears loyalty to Jim who is revealed to be Captain Hook turned young by the Queen, and who intends on re-conquering Neverland.","production_code":"","runtime":24,"season_number":1,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":84374,"poster_path":"/bRc8T2cD1GK6NO2MjpO3Q7VN0yT.jpg","season_number":1,"vote_average":9.7},"2":{"_id":"5a7ab7a69251411c520041a0","air_date":"2017-06-16","episodes":[{"air_date":"2017-06-16","episode_number":1,"episode_type":"standard","id":1429343,"name":"Neverland","overview":"In the inter-dimensional world of dreams, Jim and Smee continue to secretly conspire against the Queen while being stalked by shadow creatures. Back on Earth, Bloom, Tecna and Flora try to keep a performance by Annabelle, Louise, and the other Winx girls from being sabotaged. They meet a woman named Venomya who is a music critic. After driving her away, the Winx are suddenly whisked away to the dream world where they are tasked to help the spirit of the world of dreams. They receive evolved powers called Onyrix. They aid Jim and Smee against the shadow creatures. Jim explains the background of his situation: he is Captain Hook and the world of dreams is called Neverland. There was a hero named Peter Pan who left the world and the Queen (Tinkerbell) was so heartbroken she created a world of darkness. The Winx return to Earth where track down Peter Pan's friend Wendy Darling, who now runs an orphanage in London. One of the shadow monsters absorbs some of Bloom's essence, which Tinkerbell fashions into a dark creature called Vertigo.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":2,"episode_type":"standard","id":1429344,"name":"Peter Pan's Son","overview":"After finishing their joint tour with Annabelle and Louise, the Winx look over Peter's farewell letter to Wendy in which he asks her to look after their son Matt Barrie. In London, they look for Matt at the place where he worked, but he was fired. Meanwhile, Bloom is haunted repeatedly by illusions of a costumed woman named Vertigo. She is influenced to attack her friends, but is able to break free from the illusion and defeats Vertigo by accepting and embracing the dark parts of her self. But Tinkerbell is net yet done, as she calls forth the evil projection of Musa: Banshee.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":8,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":3,"episode_type":"standard","id":1429345,"name":"The Alligator Man","overview":"The Spirit of the World of Dreams summons the Winx Club and tells them someone close to them is in imminent danger. The Winx split into two groups: Flora, Aisha and Tecna go to the dream world while Stella, Bloom and Musa continue searching for Matt. Flora, Aisha and Tecna encounter and try to fight off Crocodile Man who had been going after Jim and Smee. The fairies notice that Crocodile Man isn't really attacking back but fleeing and then waiting for them to follow. They eventually learn that Crocodile Man has been leading them to a lair where his brother Alligator had been imprisoned. But when they try to free up, they discover the prison is actually a living magical creature which ends up absorbing them into its sticky goo. Meanwhile, Bloom, Stella and Musa determine that Jim's constellation map points to landmarks in Paris, so they head there to the brightest landmark of the Cathedral of Notre Dame. Musa splits from the others and succeeds in finding Matt, but she is suddenly attacked by Banshee.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":4,"episode_type":"standard","id":1429346,"name":"Mermaids on Earth","overview":"Aisha uses her water magic to free herself, Flora, Tecna, Crocodile Man, and Alligator Man. They tell Jim of their quest to bring back the Queen's light side as Tinker Bell by reuniting her with Peter Pan. Jim agrees, but has no knowledge of Pan's whereabouts either. Back in Paris, Musa is still being attacked by her nemesis Banshee. When Bloom and Stella arrive to support her. Musa realizes that the harmonious chimes of the bells of Notre Dame weaken Banshee, and she rings the bells to defeat Banshee. The Spirit of the World of Dreams summons the Winx and explains that three mermaids were enchanted by the Queen and have headed to Earth. The mermaids were found in Paris and have the ability to charm people.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":5,"episode_type":"standard","id":1429347,"name":"Fashion School Thrills","overview":"The Winx split up again on two missions. Stella, Tecna and Aisha track down Matt to the fashion school, while Bloom, Flora and Musa try to free Hook's pirates from the shadow creature's traps. At the fashion school, Stella encounters her nemesis, Obscura, who traps her in a world of isolation and has her re-live her innermost fears of being alone and verbally bullied by everyone.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":6,"episode_type":"standard","id":1429348,"name":"The Girl in the Stars","overview":"Bloom, Flora and Musa continue to battle the shadow creatures that have been holding Jim's pirate crew. Flora uses her plant powers to overwhelm the Queen's control of the area and the three Winx fairies then combine powers to free the pirates. Stella, Aisha and Tecna chase Matt's hooded abductor all over Paris. They are joined by the other Winx and the pirates, the last group at first just want to take it easy and rest, but later team up to help the Winx. When they tell Matt about their mission, Matt reveals that he has been looking for a girl of his dreams, but then Matt is suddenly teleported away.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":7,"episode_type":"standard","id":1429349,"name":"A Flower in the Snow","overview":"In the world of dreams, the Queen is approached by Matt, who recognizes her from the stars and that he had been searching for her his whole life. Entranced by her beauty, he promises to find the loveliest of flowers as proof of his enduring love for her. Refusing to let her weakness get the better of her, the Queen calls Flora's inner nemesis, Stoney, using the non-living material of stone. Flora and Matt work together to defeat her nemesis Stoney by using her own dark magic against her. Matt thanks Flora for helping him and joins the Winx Club as a friend. However, Aisha refuses to have his \"big ideas\" around and storms off. From a distance, she is watched by one of the Queen's shadow monsters.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":8,"episode_type":"standard","id":1429350,"name":"Tiger Lily","overview":"Despite Tiger Lily's visions of a heroic Matt, Aisha struggles with his warrior training, which is soon put to the test by the Queen's monsters.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":9,"episode_type":"standard","id":1429351,"name":"A Hero Will Come","overview":"After a battle with Aisha's innermost nemesis, Sinka, the Winx Club manage to reunite Matt and Wendy and go undercover to look for Peter Pan's mystical sword in the home of an art collector named Sebastian.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":10,"episode_type":"standard","id":1429352,"name":"Technomagic Trap","overview":"Tecna fights her inner nemesis, Virus, in the art vault. Armed with his father's mystical sword, a transformed Matt joins the Winx Club and Jim in the World of Dreams, ready to stand against the Queen.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":11,"episode_type":"standard","id":1429353,"name":"Jim's Revenge","overview":"As the Winx band deals with an onstage earthquake, Jim, Matt, and the pirate army try to beat back the shadow monsters and breach the Queen's wall.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":12,"episode_type":"standard","id":1429354,"name":"Old Friends and New Enemies","overview":"Faced with Jim's betrayal, Matt tries to flee by boat, but is waylaid by the three mermaids. On Earth, the banished Winx Club fairies, along with Roxy, battle Jim's pirate army.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":13,"episode_type":"finale","id":1429355,"name":"Tinkerbell is Back","overview":"In the season finale, the Winx club fight along side Matt and Tinkerbell to foil the plans of Jim, better known as captain hook. Finally seeing the light, Tinkerbell reverts to her pure form and Matt winx the mermaids onto the side of the Winx. Jim turns the tree of life into a ship and begins to fly it to the world of nightmares to end all dreams forever. Luckily Smee ends up tackling Jim and moves the tree from damnation, unfortunately Jim falls from the ship and plummets into the portal of the world of Nightmares - never to be seen again.","production_code":"","runtime":24,"season_number":2,"show_id":69919,"still_path":null,"vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":98956,"poster_path":"/xKXGVGP0AkNaBkFtLPkBtKALXRA.jpg","season_number":2,"vote_average":9.5}}}