{"adult":false,"backdrop_path":"/7f037sqeYsV7yjaNHyKE8NedEY0.jpg","created_by":[],"episode_run_time":[50],"first_air_date":"2002-05-12","genres":[{"id":99,"name":"Documentary"}],"homepage":"","id":70243,"in_production":false,"languages":["de"],"last_air_date":"2008-03-01","last_episode_to_air":{"id":1269251,"name":"The Pipeline Pioneer","overview":"In 1878, Byron Benson saw a pipeline as the only way to break the railroad's hold on transporting oil. But the war to build a steel pipeline for oil to the East Coast, fought for years with gritty determination both in courtrooms and in the political arena, at times erupted into physical violence.","vote_average":0,"vote_count":0,"air_date":"2008-03-01","episode_number":4,"episode_type":"finale","production_code":"","runtime":50,"season_number":4,"show_id":70243,"still_path":null},"name":"Mission X","next_episode_to_air":null,"networks":[{"id":31,"logo_path":"/2OHAgbf6QUj4cWjmFkFKu4jIsq1.png","name":"ZDF","origin_country":"DE"},{"id":662,"logo_path":"/6UIpEURdjnmcJPwgTDRzVRuwADr.png","name":"Arte","origin_country":"DE"}],"number_of_episodes":16,"number_of_seasons":4,"origin_country":["DE"],"original_language":"de","original_name":"Mission X","overview":"MISSION X tracks down the mysteries that triggered spectacular turning points in our history. Alert minds with the courage to go new and different ways, with ideas and a sense of adventure, created the remarkable turns of events that were responsible for making us what we are today.","popularity":3.346,"poster_path":"/sbkoFtI9FCAOc244e0PL7IxQ2Oy.jpg","production_companies":[{"id":72912,"logo_path":null,"name":"Axel Engstfeld Film","origin_country":""},{"id":72515,"logo_path":null,"name":"Engstfeld Filmproduktion GmbH (Köln)","origin_country":""},{"id":587,"logo_path":"/6UIpEURdjnmcJPwgTDRzVRuwADr.png","name":"ARTE","origin_country":"DE"}],"production_countries":[{"iso_3166_1":"DE","name":"Germany"}],"seasons":[{"air_date":"2002-05-12","episode_count":4,"id":85013,"name":"Season 1","overview":"","poster_path":"/1CofpdQhAfiwBPn3YNBeCCW39rQ.jpg","season_number":1,"vote_average":0},{"air_date":"2004-10-03","episode_count":4,"id":85014,"name":"Season 2","overview":"","poster_path":"/kQrDEX2GYY9SkXyEbxMVmV4qtn.jpg","season_number":2,"vote_average":0},{"air_date":"2006-10-08","episode_count":4,"id":85015,"name":"Season 3","overview":"","poster_path":"/3ogiD9n2zSPRZ0ZpCVeVeurCEVA.jpg","season_number":3,"vote_average":0},{"air_date":"2008-03-01","episode_count":4,"id":85016,"name":"Season 4","overview":"","poster_path":"/m8ospphrd41nVU8FTwp6GXNLfKk.jpg","season_number":4,"vote_average":0}],"spoken_languages":[{"english_name":"German","iso_639_1":"de","name":"Deutsch"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"58a22b0cc3a368600b00038b","air_date":"2002-05-12","episodes":[{"air_date":"2002-05-12","episode_number":1,"episode_type":"standard","id":1269235,"name":"Last Chance Trans-Atlantic","overview":"Connecting two continents underwater by cable marked the beginning of a new age. It was a story of near superhuman effort, daring and innovation. It was the vision of one man, who overcame adversity as he experienced the adventure of his life. The laying of the first transatlantic telegraph cable was a project full of fame and ambition, of defeat and ruin.\n\nThe year was 1857. A young New Yorker by the name of Cyrus Field had retreated from business life at the age of 30. He had already earned a fortune with his paper company. Now, he wanted to travel and enjoy the good things in life. Instead, his future took a different turn. An English engineer talked him into joining a very ambitious project: a telegraph line between Newfoundland and New York to speed up the exchange of news from Europe to America's business capital. Field agreed and came up with an even bolder plan: why not run the cable all the way across the Atlantic!\n\nA new age was dawning: steam ships, the railroad and the telegraph were all making the world smaller, but Europe and America were still more than a week's journey apart. To manufacture a cable of such immense length and then to stretch it along the seabed of the stormy North Atlantic was a challenge of shear awesome dimensions. Cyrus Field would end up spending 12 years of his life obsessed with this dream. Again and again, he drummed up enormous infusions of capital to finance his plan, he lobbied the English and American governments to support the project and convinced renowned scientists of his day - such as Morse, Faraday and Kelvin - to join the endeavor.\n\nWestern Union, however, a major American telegraph company, was developing its own plan to connect Europe and America and thus became a rival of the ambitious Cyrus Field and his New York-London Telegraph Company.\n\nField was confronted with repeated setbacks. On one occasion, ferocious seas tore the cable from a ship; another time, engineers ruined the line; and then the American Civil War stopped the project altogether. But on a spring day in 1866, the world's largest ship, Great Eastern, could be found anchored off the coast of Ireland. In its hold, some 8,000 tons of cable. It is Field's last chance. He had mortgaged his entire fortune.\n\nThe laying of the first transatlantic cable is one of the most exciting and dramatic stories in science. Ever since, the world has been 'wired'. The story unfolds before your eyes and Axel Engstfeld's camera. Today, a network of ocean cable connects the continents. Optic fiber cable allows 100 million telephone conversations simultaneously. But it would all have been unthinkable had it not been for the enterprising zeal, determination and innovative energy of Cyrus Field and his 'Victorian Internet'.","production_code":"","runtime":50,"season_number":1,"show_id":70243,"still_path":"/g90fxPUfpx2c0QKSsmJnFwm0COG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-19","episode_number":2,"episode_type":"standard","id":1269236,"name":"Decision Longitude","overview":"Knowing the precise coordinates of a ship is absolutely essential for a captain and his crew. It took centuries, however, before navigating the open seas lost its ominous and frightening character.\n\nColumbus, Da Gama or Drake - they all reached foreign shores more by accident than anything else. They knew how to determine what latitude they were at by checking the position of the sun, but the longitude could only be roughly calculated. The English called this method 'dead reckoning', and indeed, it was often fatal.\n\nThe year 1707 witnessed a tragedy. Off the southern coast of England, Admiral Shovell and his fleet were bearing down on the dreaded Scilly Islands in foggy weather. The ships were smashed to pieces on the murderous rocks. Two thousand seamen lost their lives. The government decided to act and decreed that a prize worth 20,000 pounds would be awarded to the man or woman who found a reliable method to precisely calculate longitude at sea.\n\nFor centuries, renowned scholars had tried and failed to find an answer - from Galileo to Isaac Newton. But no meaningful progress was made until an ordinary Scottish clockmaker came up with a trailblazing invention in the 18th century.\n\nAward-winning author Axel Engstfeld follows one of the most dramatic adventures of science which led to a turning point in the history of maritime navigation. It was a discovery of immense importance that would have consequences up to the present day.\n\nThe key to determining longitude - then as now - is: time! The royal astronomers looked to the stars for a solution, hoping some heavenly clock visible from anywhere in the world could help calculate a longitudinal position. Unfortunately, at sea this was an extremely complicated procedure.\n\nThe Scottish clockmaker John Harrison, on the other hand, put his faith in the precision of his chronometers. He decided to build a timepiece, the likes of which the world had never seen. In an age where clocks were considered accurate if they lost only a few minutes per day, Harrison built an instrument that lost only a few seconds per month! He was obsessed with the idea and spent his entire life working on ways to determine the exact longitude with the aid of precise chronometers on swaying ships in different climate zones.\n\nA relentless race began: famous scholars of the day versus a self-taught Scotsman, the king's established scientists against an eccentric tinkerer, erudite teachings espousing a logical universe up against a tiny, ticking timepiece. This race is dramatically depicted in Engstfeld's film. Re-enacted scenes are combined with footage from the original locations in England and the Caribbean. Ship voyages across a seething Atlantic and archive material intertwine to become a suspense-filled mosaic. An exact replica of Harrison's famous clock, the H1, was reconstructed especially for this film.\n\nThe world's most precise chronometer today can be found in the United States. At Falcon Airbase in Colorado, it synchronizes the satellites used for the Global Positioning System, GPS.\n\nThe search for a way to measure longitude proved to be one of the greatest adventures in seafaring history.","production_code":"","runtime":50,"season_number":1,"show_id":70243,"still_path":"/q0v1tsVakUrbHodcrHem6GW8t33.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-26","episode_number":3,"episode_type":"standard","id":1269238,"name":"Breakthrough at Cap Fear","overview":"Daring Portuguese seafarers journeyed into the unknown in the early 15th century. They sailed to regions that had previously been considered unreachable, even nonexistent. And they sailed on ships that were specially developed for this purpose.\n\nFor the Portuguese, the world in those days was flat. They knew Europe, North Africa and Asia Minor. The Atlantic, on the other hand, was an ocean of darkness. Cape Bojador on the West African coast, across from the Canary Islands, marked the end of the known world. Beyond was a realm of terrifying sea creatures. No seafarer had ever returned from there alive.\n\nDon Enrique, a Portuguese prince who found his way into the annals of history as Henry the Navigator, was obsessed with the idea to explore the unknown parts of Africa. He dreamt of fabulous wealth and sought allies in the fight against the despicable Moors. He dispatched expeditions to overcome Cape Fear. He founded a center of science in Sagres and brought the best cartographers, mathematicians, astronomers and navigators to his court. It was the beginning of a new age - the dawning of the modern era.\n\nIn 1434, one of his captains actually succeeded in sailing past the dreaded promontory, returning home alive to tell about it. The mission was probably more accidental than anything because the prevailing winds required pointing into the wind - something Portuguese ships of that day were incapable of doing. In order to sail further south it was necessary to design a completely new type of ship. In the years that followed, just such a ship was systematically developed under the aegis of Henry the Navigator. The lightweight ship, known as a caravel, became the workhorse of Portuguese and Spanish explorers.\n\nMuch like the space shuttles half a millennium later, the caravel carried a small crew squeezed into a tiny space, was packed full of food and water with no stove for warm meals and had no special sleeping quarters for those on board. But the caravel flung the door open to a new world. The first precise maps of the African coast ensued, but were kept secret when the first traces of gold were found. When the Portuguese explorers finally met up with the indigenous populations, history took a dramatic turn.\n\nDuring shooting for the documentary, Portuguese archeologists made a sensational discovery. Off the coast of Porto they found the exceptionally well-preserved remnants of a ship from the time of Henry the Navigator. Is this the first discovery of a caravel?\n\nWith this documentary, the German National Film Award holder, Axel Engstfeld, undertakes a journey through time. The film catapults us back to 15th century Europe with extravagant scenes. The impact of this pioneering era unfolds before our eyes, juxtaposed between historical fact and modern scientific methodology. In the course of just one generation humanity's view of the world was turned upside down with breathtaking speed, preparing the way for journeys to America by Columbus and to India by Vasco di Gama. But before them, stood the caravel and the Breakthrough at Cape Fear.","production_code":"","runtime":50,"season_number":1,"show_id":70243,"still_path":"/e2HfIQjyAaz4XEDaVNwaVZsvD4I.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-06-02","episode_number":4,"episode_type":"finale","id":1269239,"name":"The Empire attacks","overview":"For astrologers, the year 1588 stood under a bad sign. They predicted chaos and conflict around the world. And this prophesy was to become reality as the Spanish armada approached the English coast. 130 ships and 30,000 soldiers were preparing to invade the British Isles. The world's largest fleet against a handful of English ships captained by a few daring pirates. The battle raged for five days and nights until the Spanish succumbed. A new kind of canon played a significant role in their defeat.\n\nAt the time, the city of Innsbruck in Austria was Europe's gun-making center and the Löffler family were the Middle Ages version of the Krupps. The canons poured in the Löffler foundries were far superior to any others in range, power and precision. The method for forging these guns was a closely held secret.\n\nIn 1580, a man named Adam Dreyling fled to England. He had learned the art of making canons from his uncle, Hans Christoph Löffler, and now held the Habsburg's greatest state secret in his hands. Spies smuggled him to Venice and then to England, where his expertise was urgently needed.\n\nEngland's queen knew that war with Spain was unavoidable. For decades the conflict had been simmering between the protestant ruler and catholic Europe. Philip of Spain was bent on toppling her, whatever the cost. English admirals thought up a new strategy to confront the overpowering Spaniards.\n\nMathew Baker, a mathematician and shipbuilder, listens to the tales of successful pirates like Drake and Frobisher and builds small, fast and maneuverable ships equipped with long-range, precision canons to keep the Spaniards at bay. The guns made by Adam Dreyling could be the key.\n\nThe centerpiece of this film is a volatile mixture of world history on a grand scale and personal drama. The inventiveness and artistry of the foundry man from Tyrol is a small building block for England en route to becoming a globe-spanning empire.\n\nFilm-maker Axel Engstfeld follows the gun-making trail. At a foundry in Innsbruck he has the old 16th century canon cast in the old-fashioned method. The company, Gebrüder Grassmayr, is the world's leading foundry for casting bells. The family business is in its 14th generation, but hasn't cast any canons since the Thirty Years War. What made Dreyling's canons so superior? An experiment for the film and for the foundry.","production_code":"","runtime":50,"season_number":1,"show_id":70243,"still_path":"/uxSZ5HXYFMIeh6AM3lQ9OF5YRCQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":85013,"poster_path":"/1CofpdQhAfiwBPn3YNBeCCW39rQ.jpg","season_number":1,"vote_average":0},"2":{"_id":"58a22e33c3a3685f7c000560","air_date":"2004-10-03","episodes":[{"air_date":"2004-10-03","episode_number":1,"episode_type":"standard","id":1269240,"name":"Attack from the Deep","overview":"On the night of February 17, 1864, eight sailors take charge of an innovative wonder machine in Charleston harbor. Their task: to sink the Housatonic, a ship blockading the entrance to the Confederacy's most important Atlantic Ocean port. Their hope: to bring about a turning point for the southern states in the American Civil War. Their weapon: The Hunley, the first operable submarine in human history.\n\nThe bloody battle of fratricide, between the northern Union states and southern Confederacy, was in its third year. It was a war that cost more American lives than any other conflict - before or since. The general staff of President Abraham Lincoln wanted to strangle the rebellious south with a relentless naval blockade - its \"anaconda strategy\". The plan was to cut off the South from its vital routes of commerce, so that no cotton could be shipped to Europe in return for weapons and ammunition. The largely agricultural Confederacy would slowly bleed top death.\n\nOne successful southern businessman and plantation owner was well aware of the impending danger. Horace Hunley recognized that the murderous struggle on land would ultimately be decided at sea.\n\nHunley concocts a daring plan. He designs a submersible boat to break the blockade. It would carry a crew of eight, which had to climb aboard through two narrow towers. The ship weighed eight tons, was 12 meters long and only one meter in diameter. The submarine could be maneuvered by a horizontal diving plane and a vertical rudder. A propeller in the rear, hand-cranked by seven crew members, provided the necessary forward thrust, while the eighth man steered. The ship had ballast tanks to balance it and a metal keel that could be jettisoned. The \"Hunley\" was a primitive contraption, but with all the basic hallmarks of modern-day submarines. Still, the ship was destined to become an iron coffin for its inventor.\n\nDuring the night of February 17, 1864, the Hunley set out on its maiden raid and sank the Housatonic with a load of dynamite. Panic broke out in the Union fleet. But the Hunley never returned and its whereabouts remained a mystery.\n\n130 years later, marine archeologists discovered the wreck not far from the port of Charleston. When it was finally raised, scientists were surprised how advanced the submarine's design had been. Elaborate tests were performed to find out how and why the ship went down.\n\nMission X was at the scene when this time capsule from the American Civil War saw the light of day for the first time since that fateful night off the coast of South Carolina. One of the greatest archeological challenges of the 20th century, the newspapers wrote. Fascinating pictures document the project and the spectacular laboratory experiments conducted to unlock the mysteries of this maritime marvel - mysteries that amazed the international team of archeologists and shed new light on an incident that had a profound impact on the course of history.","production_code":"","runtime":50,"season_number":2,"show_id":70243,"still_path":"/xHO0IuYIewpg4JB0lavDRSHSnhA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-10","episode_number":2,"episode_type":"standard","id":1269241,"name":"War of Currents","overview":"When, in New York, William Kemmler, a man of German heritage, became the first person to be executed in the electric chair in 1890, it was not only the beginning for some of a dark chapter in the history of jurisprudence, but also the sorry climax of a struggle between two ingenious men for the most promising industrial market of the day. The confrontation between the inventor, Thomas Alva Edison, and the industrialist, George Westinghouse, would go down in history as the \"Electricity War\".\n\nElectricity was the magic word of the late 19th century. In initial attempts by Benjamin Franklin or Michael Faraday, and with the invention of electric impulses in telegraph technology, the spectrum of uses for electricity were growing continuously.\n\nAfter the World Exposition in Paris in 1881 and Edison's astonishing unveiling of the light bulb, new electric illumination systems became the hottest technological achievement around the globe and everybody wanted them. Electricity could replace steam to drive engines. It was a second industrial revolution.\n\nEverywhere in European and American cities power plants were sprouting up, based on Edison's design. But the limitations soon became evident. These utilities generated direct current, so it was only possible to supply energy to a small circle around the plant.\n\nWestinghouse recognized the problem right away. He invested his money into a few, large generating plants outside the cities that used higher voltage to transport the electricity over greater distances - something that was only feasible with alternating current.\n\nThe competition between these two alternative utility systems developed into a bitter fight. It began with defamatory statements and, from there, moved on to slander, espionage and court battles, finally coming to a head with the public electrocution of animals to demonstrate how dangerous the other's utility system was.\n\nMission X takes a closer look at the dramatic story of this bitter rivalry on which the standard for today's high voltage technology is based. And yet, in laboratories around the world, the next step in power generation is already being researched. In Munich, an international team of scientists is working on how to bring the sun's fire to Earth. Nuclear fusion, as it is called, is a super heated plasma fire of 100 million degrees which scientists hope will be the energy of the future. Innovative super conductors will then be able to transport the generated electricity over thousands of miles to any point on the globe with no loss of energy along the way.","production_code":"","runtime":50,"season_number":2,"show_id":70243,"still_path":"/5gFN4xdkGrvMPECx00vNHPMmIPr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-17","episode_number":3,"episode_type":"standard","id":1269242,"name":"Battle for the black Formula","overview":"It was the trial of the century. The year: 1851 - in Trenton, New Jersey. A bitter fight has erupted for the patent on a pioneering discovery. The newspapers and countless sensation seekers are following the spectacle.\n\nCharles Goodyear is fighting for the rights to his life's work: to be called the father of vulcanization. Is he the only one to have transformed natural latex into usable rubber?\n\nLatex was known ever since Columbus discovered the New World. Ca-hu-chu or Ca-ou-chuk was the name given to this milky substance from the rubber tree by the Indios of southern and central America. The word meant \"tears of the weeping tree.\" The Aztecs of Mexico played with rubber balls and burned small rubber figurines at religious ceremonies. The Spanish conquistadors impregnated their coats with the juice. But it took until the 19th century before a real rubber boom set in. In the harsh climates of North America, however, the material was difficult to use. In winter, in grew brittle from the cold and in the hot summers it became tough and sticky and lost its form.\n\nCharles Goodyear dedicated his life to taming this material. His search for the black formula would take decades. His family was burdened with endless privations. It was an odyssey that earned him the ridicule of society and numerous stints in debtor's prison. And when he finally achieved his goal, with the formula in hand, he had to defend his patent against the criminal machinations of greedy businessmen.\n\nGoodyear's recipe for rubber had a tremendous impact on civilization, comparable to the discoveries of how to convert iron to steel or crude oil to gasoline. Today's mobile society and its most valuable industry - auto manufacturing - would not be what it is now without this revolutionary invention.\n\nMission X examines the dramatic circumstances of Goodyear's life and re-enacts the experiments, step-by-step, that led to his trailblazing success. Without rubber, our modern age is unthinkable: airplane tires, for example, that in fractions of a second accelerate to 250 kilometers an hour and must withstand scorching heat up to 120 degrees centigrade. No other material on earth could take this kind of punishment. But it was Charles Goodyear's process of vulcanization that first gave latex the necessary properties.","production_code":"","runtime":50,"season_number":2,"show_id":70243,"still_path":"/cO0RpnyYL3ZwYzcZ8rVENor6tK7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2004-10-31","episode_number":4,"episode_type":"finale","id":1269243,"name":"Duel in the Dark","overview":"The uproar in Downing Street was considerable. Just a year after Hitler grabbed power, a new, stiff breeze was blowing across Europe and it was not good. Britain was in serious danger. The country's natural moat, the English Channel, no longer posed much of a barrier because of the new breed of faster, longer range aircraft. \"England is no longer an island,\" Britain's concerned political leaders were saying. The government of his majesty, King George, declared air defense its highest priority.\n\nIn this tense situation, the Scottish physicist, Watson Watt, came up with a revolutionary idea and set out to invent an air surveillance system using radio waves. His system would be able to identify airborne objects hundreds of miles away by night or day, rain or shine, fog or snow. His urgent task was to develop a shield against the growing signs in the 1930s that a new world war was imminent. Watt was convinced that his vision was unique.\n\nBut in not-so-far-off Germany, two young engineers were tirelessly working on the same trailblazing concept. The two self-taught young men, Paul Erbslöh and Hans Karl von Willisen, were hoping that their invention in future would prevent disasters like the sinking of the Titanic. Under the watchful eye of the German navy, they were close to developing a mobile radar system. They recognized too late in whose hands they had placed their fate and were overrun by the events of history.\n\n\"Duel in the Dark\" is the fascinating story of scientists unknown to each other competing to develop the world's first radar on the eve of a terrible confrontation. This is a story, full of drama, disappointing setbacks, technological achievement, espionage and patriotism.\n\nWhat began as a vision nurtured by a few individuals would revolutionize the art of war like no other invention before it. For the first time in history, military commanders could have early information in their hands about the movements of enemy troops and strategically re-deploy their own forces accordingly. A high-ranking general said: \"The atom bomb ended the war, but radar won it!\"\n\nUntil recently, nearly all the literature on radar gives credit to Watson Watt for inventing it, but based on completely new sources Mission X documents that radar was developed simultaneously in Britain and Germany. Here is a gripping, suspense-packed story about a previously neglected chapter in scientific history.\n\nToday, radar is more important than ever in our daily lives. Mission X provides a glimpse into what was once one of the best-kept secrets in Britain. \"Duel in the Dark\" goes behind the fence of one of the most heavily guarded military bases of the Royal Air Force, where no camera team has ever filmed before, to observe how an innovative radar wall along the coast of southern Spain tracks drug smugglers and illegal refugees. There are also breathtaking pictures from one of the world's most precise radar systems that can identify objects as small as two centimeters in diameter some 1,000 kilometers out in space.","production_code":"","runtime":50,"season_number":2,"show_id":70243,"still_path":"/96XNZm1MeHnd1Ja0avb2CYeAarD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":85014,"poster_path":"/kQrDEX2GYY9SkXyEbxMVmV4qtn.jpg","season_number":2,"vote_average":0},"3":{"_id":"58a22e3ac3a3686001000501","air_date":"2006-10-08","episodes":[{"air_date":"2006-10-08","episode_number":1,"episode_type":"standard","id":1269244,"name":"Episode 1","overview":"","production_code":"","runtime":50,"season_number":3,"show_id":70243,"still_path":"/wUBfENhCOEnOEGJ4ggPNvXhjV0a.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-15","episode_number":2,"episode_type":"standard","id":1269245,"name":"Episode 2","overview":"","production_code":"","runtime":50,"season_number":3,"show_id":70243,"still_path":"/ouL8yR3Wg5Iqt0MNqmy4vWrmYpJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-10-29","episode_number":3,"episode_type":"standard","id":1269246,"name":"Episode 3","overview":"","production_code":"","runtime":50,"season_number":3,"show_id":70243,"still_path":"/dK2u6ofMzv9PN7ZTfesVEtVljtN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2006-11-05","episode_number":4,"episode_type":"finale","id":1269247,"name":"Episode 4","overview":"","production_code":"","runtime":50,"season_number":3,"show_id":70243,"still_path":"/6sKJAIuQIySU2SYRlaa3Sudvpnl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":85015,"poster_path":"/3ogiD9n2zSPRZ0ZpCVeVeurCEVA.jpg","season_number":3,"vote_average":0},"4":{"_id":"58a22e46c3a3685f9a0004cc","air_date":"2008-03-01","episodes":[{"air_date":"2008-03-01","episode_number":1,"episode_type":"standard","id":1269248,"name":"Victory of the Steam Engine","overview":"In London, the heart of the British Empire, a contraption was patented on the 5th of January, 1769, that would change the world like no other device before or after -- the steam engine. But that is only the beginning of the dramatic story of James Watt and his invention...","production_code":"","runtime":50,"season_number":4,"show_id":70243,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-01","episode_number":2,"episode_type":"standard","id":1269249,"name":"The Power of the Propeller","overview":"Josef Ressel, looking at a corkscrew, had an idea of momentous proportions. A new way to pull a ship through water instead of the cumbersome paddlewheel. He invented the modern propeller in 1829, but why haven't we heard more about him since his invention affected all modern travel?","production_code":"","runtime":50,"season_number":4,"show_id":70243,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-01","episode_number":3,"episode_type":"standard","id":1269250,"name":"The Great Telephone Race","overview":"The story of Alexander Graham Bell's invention is a genuine “David vs. Goliath” story. It was a struggle by Bell against the spies and schemes of the most powerful corporation of his time, who did everything in their power to stop Bell’s telephone.","production_code":"","runtime":50,"season_number":4,"show_id":70243,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-03-01","episode_number":4,"episode_type":"finale","id":1269251,"name":"The Pipeline Pioneer","overview":"In 1878, Byron Benson saw a pipeline as the only way to break the railroad's hold on transporting oil. But the war to build a steel pipeline for oil to the East Coast, fought for years with gritty determination both in courtrooms and in the political arena, at times erupted into physical violence.","production_code":"","runtime":50,"season_number":4,"show_id":70243,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":85016,"poster_path":"/m8ospphrd41nVU8FTwp6GXNLfKk.jpg","season_number":4,"vote_average":0}}}