{"adult":false,"backdrop_path":"/jPXnW9emZ0tvuL0GbqVLv7YHQTJ.jpg","created_by":[],"episode_run_time":[24],"first_air_date":"2017-04-07","genres":[{"id":16,"name":"Animation"},{"id":35,"name":"Comedy"}],"homepage":"http://hinakonote.jp/","id":71006,"in_production":false,"languages":["ja"],"last_air_date":"2017-06-23","last_episode_to_air":{"id":1378444,"name":"The Place We Longed to Reach","overview":"Hinako is too cold to fall asleep, so she heads downstairs for a warm drink and notices a tasty smell coming from the coffee shop. Curiously, she peeks into the dark kitchen... and sees Mayuki stirring something in a large pot, chanting Chiaki's name like some sort of spell. Hinako timidly speaks up, and Mayuki's reaction makes it appear that she's hiding something. Unable to bring herself to question this strange behavior further, Hinako tells Kuina about what she saw.","vote_average":0,"vote_count":0,"air_date":"2017-06-23","episode_number":12,"episode_type":"finale","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/uxbBsbdgjZ76qZRoTZDAXjslmUy.jpg"},"name":"Hinako Note","next_episode_to_air":null,"networks":[{"id":173,"logo_path":"/fERjndErEpveJmQZccJbJDi93rj.png","name":"AT-X","origin_country":"JP"},{"id":614,"logo_path":"/hSdroyVthq3CynxTIIY7lnS8w1.png","name":"Tokyo MX","origin_country":"JP"}],"number_of_episodes":12,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"ひなこのーと","overview":"Born and raised in the countryside of Japan, Hinako \"Hina\" Sakuragi gets anxious easily when she talks to new people—so much so that she resembles a stiff scarecrow. To overcome this, Hina hopes to get involved in theater, inspired by a play she saw during her school's field trip. So, Hina moves into the Hitotose Manor in the bustling city of Tokyo to study at Fujiyama High School, aspiring to join the school's renowned theatre club.\n\nBut to Hina's dismay, she learns that Fujiyama High's theatre club has been on a lengthy hiatus. Having already come to Tokyo and enrolled in the school, Hina is at a loss for what to do next. Sensing her disappointment and eagerness to learn theatre, Chiaki Hagino, the landlady of Hitotose Manor, encourages Hina to create a troupe with the residents of Hitotose Manor as its members.\n\nThis story follows Hina as she begins a new life in Tokyo attending Fujiyama High while learning the ropes of theatre with the support of her friends along the way.","popularity":12.195,"poster_path":"/h5dev2xCgeJGvoLlf39mlSoqk2h.jpg","production_companies":[{"id":87086,"logo_path":"/eAjcgCH2cxuo0oEMqRwU3g0izTv.png","name":"Sony Music Communications","origin_country":"JP"},{"id":6954,"logo_path":null,"name":"Enterbrain","origin_country":"JP"},{"id":7967,"logo_path":"/4W9ByL6mMDn9UOHh8oGD36l3BnN.png","name":"Media Factory","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"2017-04-07","episode_count":12,"id":86825,"name":"Season 1","overview":"","poster_path":"/bjvJQztHUVoQPisjAnCc1ccrG4H.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.3,"vote_count":7,"season_data":{"1":{"_id":"58de9848c3a3687c4500e2a4","air_date":"2017-04-07","episodes":[{"air_date":"2017-04-07","episode_number":1,"episode_type":"standard","id":1297628,"name":"My Talent Is Being a Scarecrow","overview":"Sakuragi Hinako is a girl who freezes up like a scarecrow when in front of people. Because animals love her, she often worked as an actual scarecrow at her old home in the country, but now she's she decided to attend Fujimiya High School, which has a theater club she wants to join, in hopes of getting better at talking to people. So she left the countryside to move into Hitotose Manor in Tokyo, where she met its unusual but lovable residents, Kuina and Mayuki.","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/paItbe79wOIxyofIcybf2emHoLO.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Art Direction","department":"Art","credit_id":"607b53d266f2d200291d83e4","adult":false,"gender":2,"id":3056975,"known_for_department":"Art","name":"Takashi Honda","original_name":"Takashi Honda","popularity":1.214,"profile_path":null},{"job":"Art Designer","department":"Art","credit_id":"607b53d801b1ca005863c880","adult":false,"gender":2,"id":3056975,"known_for_department":"Art","name":"Takashi Honda","original_name":"Takashi Honda","popularity":1.214,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-04-14","episode_number":2,"episode_type":"standard","id":1303534,"name":"It Begins Here","overview":"Chiaki, the landlady of Hitotose Manor, gave Hinako the suggestion to start up a new theater troupe. While Hinako is busy worrying about whether she's actually capable of starting her own troupe, Chiaki asks her why she wants to go into theater, so she explains why she wanted to join the theater club. After hearing her reason, Chiaki tells her there's no plan yet for the Fujimiya High theater club to return, so maybe it would be best to start a new troupe. As they're discussing what sorts of productions they could put on, Kuina suggests making use of Hinako's popularity with animals by using real animals in their act...","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/pFWprKCiR58rAeRR75JKJng3pbK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-04-21","episode_number":3,"episode_type":"standard","id":1306002,"name":"Mistaken Friend","overview":"The Hitotose Troupe was finally formed, with the goal of someday performing in the famous theater Suzuran. Then the school term begins, and Hinako tries to introduce herself to her class, but as usual her nerves take over and she freezes up like a scarecrow again. As Hinako is feeling down, Chiaki shows up and hands her a flyer that the school's new theater society is handing out to recruit new members. Hinako is excited that theater has returned to the school, but then a classmate, Nakajima Yua, appears and demands to know Hinako's connection to Chiaki...","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/uR2Ua4VnuzsGjD4kMy3CXRwgpJs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-04-28","episode_number":4,"episode_type":"standard","id":1312007,"name":"Scarecrow Heroine","overview":"It's been about a month since the start of the school year, and the theater society is practicing as always when Hinako notices child in the room. Kuina comments that the child has been showing up for a few days. None of the other members seem to mind that there's a child among them; in fact, they all seem to be practicing harder than usual. Since the child is next to Chiaki, Hinako and Kuina wonder if she's a theater troupe relation, or perhaps even Chiaki's daughter. Finally, Yua can't stand to listen anymore and straightens them out.","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/A15y6XkO7uKrNKKgBaneZg5brrz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-05-05","episode_number":5,"episode_type":"standard","id":1313276,"name":"A Kind Girl Who Isn't Kind","overview":"Ruriko, the theater club advisor who's just returned from a theater trip in Europe, tells the club members that the script she wrote to demonstrate everything she learned in her travels will be the play they perform at the upcoming culture festival. She's chosen Hinako to play the heroine, but Hinako messes up everything she tries to do. Yua, who feels she's lost the leading role to a complete theater newbie, expresses her displeasure in no uncertain terms, but as she watches Hinako trying her hardest, she finds her opinions changing.","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/bjMw6zx3KiB2r2pN1MCMOcsXvg3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-05-12","episode_number":6,"episode_type":"standard","id":1347817,"name":"Maids, Ghosts, and the Stage of Dreams","overview":"Hinako's intense training under the exasperated Yua comes to an end, and the theater society is busy with wardrobe fittings for the culture festival that starts the next day. Mayuki helps with the costume fitting, and Hinako, Yua, Kuina, and all the other members begin to look more and more glamorous. While in their costumes, they end up doing an impromptu dress rehearsal, and Hinako is thrilled when she makes it through without messing up any lines for the first time. Yua reminds her that the actual performance is yet to come, and soon enough, the day of the culture festival arrives.","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/sCVSpKukULRtVuAHoM1zhfefn9t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-05-19","episode_number":7,"episode_type":"standard","id":1378439,"name":"The Lost Swimsuit","overview":"It's midsummer, and as the sun's rays grow stronger, the days grow so hot that they seem to burn the girls' skin. Hinako starts to worry when she sees Kuina plastered to her desk in deference to the heat. When Kuina asks why it's so hot, Hinako's answer is a profoundly simple \"Because it's summer.\" Kuina has to accept that answer... but then she rises from her seat as if some great idea has struck her. She says that hot summer days like these make her want to visit the ocean, and suggests that all the Hitotose girls and Yua-chan make a trip to the ocean together.","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/bpuI8KW7E8zTZfViDZCqzUoaBHH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-05-26","episode_number":8,"episode_type":"standard","id":1378440,"name":"Trying Too Hard","overview":"Hinako's first summer break as a high school student has begun. She's helping out at the used bookstore for that very reason, but when a customer comes in, her nervousness peaks and she freezes up like a scarecrow. When Chiaki and Mayuki return from an outing, Hinako takes a break to have tea with them, and then Yua pops in to lend Hinako some DVDs with her favorite small troupe performances as well as acting lessons. Hinako can't help but smile at Yua's kindness. The next day, as she's helping out at the coffee shop, Hinako collapses while serving a customer...","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/y8OuFDJD6ARSUpX18D3gWRvtsvh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-02","episode_number":9,"episode_type":"standard","id":1378441,"name":"We'll Have a Training Camp","overview":"One day, Hinako returns from school to find a letter from her mother. In it, her mother says she'd be visiting Tokyo to see Hinako acting. But Hinako is worried that she'll get nervous and freeze up like a scarecrow if she knows her mother is watching, not to mention she hasn't appeared on a stage since the culture festival. She even gets embarrassed just being seen working at the Hitotose coffee shop. Then she finds out about a stamp rally event planned in the shopping district, and she suggests having their troupe perform at Hitotose for it.","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/wxMT5MZ3dLJAtz0W8b8lPCCHc6x.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-09","episode_number":10,"episode_type":"standard","id":1378442,"name":"Pa-Pa-Parade","overview":"Kuina has completed the script for the Hitotose Troupe's first performance and is handing out copies to the other members. Chiaki's reaction after reading through it is positive, and everyone is happy to have all the details of the story in place. Mayuki is especially happy to finally have a chance to plan out everyone's costumes, and she immediately buys costumes for all the members to try. But then she learns that the \"dress parade\" normally happens after rehearsals have progressed to a certain point. Chiaki explains why it's too early to think about costumes, but Mayuki insists that they try them on...","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/2AWycI6Su9ywoJ9cZBz3lhz5zzg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":11,"episode_type":"standard","id":1378443,"name":"From One Year to the Next","overview":"One day in winter, as Christmas approaches, Mayuki wonders if the Hitotose girls can't put on some kind of event to draw customers to the coffee shop. Chiaki suggests that the troupe put on another play on Christmas Eve, and the girls quickly grow excited for their second public performance. Many ideas are shared, but they decide that since it'll be taking place on Christmas Eve, their play should be a Christmas story... and with that, the preparations begin.","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/e6jaEh6jdkw2fWTvA7RpGDV7Gcu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-23","episode_number":12,"episode_type":"finale","id":1378444,"name":"The Place We Longed to Reach","overview":"Hinako is too cold to fall asleep, so she heads downstairs for a warm drink and notices a tasty smell coming from the coffee shop. Curiously, she peeks into the dark kitchen... and sees Mayuki stirring something in a large pot, chanting Chiaki's name like some sort of spell. Hinako timidly speaks up, and Mayuki's reaction makes it appear that she's hiding something. Unable to bring herself to question this strange behavior further, Hinako tells Kuina about what she saw.","production_code":"","runtime":24,"season_number":1,"show_id":71006,"still_path":"/uxbBsbdgjZ76qZRoTZDAXjslmUy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":86825,"poster_path":"/bjvJQztHUVoQPisjAnCc1ccrG4H.jpg","season_number":1,"vote_average":0}}}