{"adult":false,"backdrop_path":null,"created_by":[{"id":1213141,"credit_id":"525789df760ee36aaa66d9c7","name":"Mark Cronin","profile_path":null},{"id":1220972,"credit_id":"525789df760ee36aaa66d9cd","name":"Cris Abrego","profile_path":null}],"episode_run_time":[60],"first_air_date":"2007-04-15","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.vh1.com/shows/series/charm_school/splash.jhtml","id":7135,"in_production":false,"languages":["en"],"last_air_date":"2007-07-08","last_episode_to_air":{"id":384569,"name":"Reunion Show","overview":"Cast mates return to reminisce about the season that was and give updates on what they've been doing since it ended.","vote_average":0,"vote_count":0,"air_date":"2007-07-08","episode_number":11,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null},"name":"Flavor of Love Girls: Charm School","next_episode_to_air":null,"networks":[{"id":158,"logo_path":"/w9oUxxUiXTC1O1MzJSvsMjQbgft.png","name":"VH1","origin_country":"US"}],"number_of_episodes":11,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Flavor of Love Girls: Charm School","overview":"Flavor of Love Girls: Charm School, known as Charm School: Flavor of Love Girls in Europe, is the first season of the VH1 reality show Charm School. It is a spin-off of Flavor of Love created by the producers of The Surreal Life and Flavor of Love spin-off I Love New York. It is hosted by comedian actress Mo'Nique, assisted by talent agency president Keith Lewis and magazine beauty director Mikki Taylor, and features thirteen contestants from the first two seasons of Flavor of Love, assigned the challenge of developing proper etiquette in a competition for $50,000 and the title of \"Charm School Queen.\" The show was recorded over 25 days in an Encino mansion during Fall 2006. Saaphyri Windsor was ultimately named Charm School Queen and was awarded the $50,000.","popularity":2.675,"poster_path":null,"production_companies":[],"production_countries":[],"seasons":[{"air_date":"2007-04-15","episode_count":11,"id":17339,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"525789df760ee36aaa66d8f1","air_date":"2007-04-15","episodes":[{"air_date":"2007-04-15","episode_number":1,"episode_type":"standard","id":384562,"name":"No Mo'Nicknames","overview":"Thirteen of the rudest Flavorettes are back -- returning from Flavor of Love season one comes Smiley the crier, Serious the model, Goldie the puker, Pumkin the spitter, Rain the screamer, and crazy Hottie; and from season two comes Saaphyri the fighter, Bootz the hater, ghetto talkin' Buckwild, plus-size Like Dat, balcony-busting Buckeey & Krazy, and Toasteee, the drunk girl who did porn.\n\nTheir first challenge, a demanding marine boot camp obstacle course teaches them the value of teamwork, and afterwords member of the losing team gets expelled.","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-04-22","episode_number":2,"episode_type":"standard","id":384563,"name":"Dirty Draws Done Dirt Cheap","overview":"This week the twelve remaining girls get trained in social grace, etiquette, and table manners. Special guest Andrew Firestone (of The Bachelor) tests the girls in a three round competition. The winner will assist him in presenting his new wine at his winery and be safe from being expelled. Before the contest even begins, one girl's dress goes missing -- there's a thief in the house! The plan works as the victim has a complete meltdown and blows it in the competition. But when the thief is revealed, she gets what's coming to her when her dirty laundry gets aired on national TV. While the winner of the etiquette test joins Andrew at the Firestone winery the next day, the rest of the girls must cook dinner for Mo'Nique using recipes from her cookbook. At dinner Mo gets the girls to air their issues about the dress thief as well as their personal issues with each other. With this much bad manners to choose from, who will Mo'Nique expel this week?","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-04-29","episode_number":3,"episode_type":"standard","id":384564,"name":"Big Titty Girl No-No","overview":"This week the eleven remaining girls learn about high fashion when they have to split into two teams and put on a fashion show. First, each team must assign each person's role: two dress designers, one girl to do hair, one to do make-up, and one girl to be the model. They are told to choose their roles wisely, but one team does everything but, seemingly assigning people to jobs they are least suited for. At the fashion show the judges are knocked out by one team, and horrified by the other. Slapped with a hearty dose of reality, members of the losing team start casting blame on each other. It's every woman for herself as they turn on each other to save themselves from getting expelled.","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-05-05","episode_number":4,"episode_type":"standard","id":384561,"name":"Master Debaters","overview":"This week the ten remaining girls learn about effective communication when they split into two teams for a formal debate. The catch is that there are five people on each team, but there's only room on a debate squad for four. Each team must bench one member, and that member will be vulnerable for expulsion even if their team wins the debate. Of course, no one wants to be benched, and one girl storms off when she gets out-voted. The girls surprise everyone with their reasoned, yet passionate, debate. When the debate coach declares the winner, his decision sparks a knock-down, drag-out shouting match between Mo and her students. After that scene, the girls need to blow off some steam so they make a stop at a local bar where they let loose and get wild. When one girl criticized another's behavior, everything they learned in debate class goes out the window, and soon fists are flying. At the expulsion ceremony that night, it's anyone guess who's going home.","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-05-13","episode_number":5,"episode_type":"standard","id":384571,"name":"Big Stink At Charm School","overview":"This week the nine remaining girls learn about business acumen in this Apprentice-style challenge where they split into three teams to see who can make the most money selling their custom-made perfume on the streets of Hollywood. Three of the girls are selected to be team CEO's, and they must fight between them to decide who is on their team. When one of the CEO's gets bullied by the other two, she's forced to take the two girls no one else wanted. The team who makes the most money will be safe from elimination, and the two CEO's of the losing teams will be automatically called to the carpet. Their strategies are varied: one team follows the adage \"sex sells,\" another team uses a merchandise giveaway to push their perfume product, and one team takes a half-hour bathroom break before getting started. After the competition, tensions remain high between two of the CEO's back at the house. One of them threatens to deliver a serious beat-down if she gets eliminated.","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-05-27","episode_number":6,"episode_type":"standard","id":384567,"name":"Give And Take","overview":"This week the eight remaining girls learn about generosity when Mo challenges them to give away their own clothes to a thrift store that benefits AIDS research. While some girls start packing up their designer clothes, tears fall when one girl realizes she don't have as much to give as the others. But when they all find out just what the thrift store is willing to take, and for how much, every team must reevaluate what they're willing to part with, including one girl's family heirloom. The winning team wins a shopping spree for new clothes. One of the losing teams is so bitter than they hatch a plot to get one of the girls eliminated -- they steal one girl's picture and plant it under another girl's bed. When the picture is discovered, fingers are pointed in many directions. At elimination, will Mo figure out who was really behind the picture theft, or will the patsy fall victim to the villain's plan?","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-06-03","episode_number":7,"episode_type":"standard","id":384570,"name":"It's Mo's Birthday And I'll Cry If I Want To","overview":"This week the six remaining girls learn the proper way to respond in a celebrity interview. Afterwards, the girls still want to get to the bottom of who stole the pictures. The picture thief inquisition soon turns into a full scale orgy of lies and backstabbing that even has guilty parties at each other's throats. The insanity culminates during a surprise birthday party for Mo'Nique, where Mo finds herself counseling two sobbing, guilt ridden girls. Will the picture thief confess and save herself? Will Mo'Nique send the thief packing? Or will another victim fall prey to this scheming rat at tonight's elimination?","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-06-10","episode_number":8,"episode_type":"standard","id":384566,"name":"Tore Up From The Floor Up","overview":"This week the five remaining girls learn about the four types of men to avoid in relationships: the Player (charismatic), the Professional (wealthy), the Pushover (sensitive), and the Parolee (high sexual aptitude). Who they should be looking for is the Urban Renaissance Man, the type of man who possesses all four qualities in equal measure. To test whether they can spot the Urban Renaissance Man, Mo'Nique arranges the first Charm School Prom, and invites seven eligible bachelors to the party. The girl who can pick out the one Urban Renaissance Man from the group that consists of Players, Professionals, Pushovers, and Parolees will be safe from elimination. The prom degenerates into drunken debauchery and disorderliness, and Mo can barely stand to watch. Later, when the girls must vote on who represented Charm School the best and worst at the prom, the girls start hatching strategies and making alliances. One girl is torn between two sides; her vote will control who is safe and who goes to the carpet. When the votes are tallied, one friendship is betrayed, and the girl who gets sent home, does not go quietly.","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-06-17","episode_number":9,"episode_type":"standard","id":384568,"name":"Charm School Secrets","overview":"A summary of the eight past episodes, plus bonus never-before seen clips. Mo'Nique ordering pizza and fried chicken for the thirteen girls. Brooke urinating in a water bottle on the bus after leaving the bar. Shay calls Brooke and Leilene out for not picking Becky and Saaphyri for the shopping spree at Forever 21, and Darra for being fake.","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-01","episode_number":10,"episode_type":"standard","id":384565,"name":"Ghettin' Phabulous","overview":"In the Charm School season finale, the final four girls compete in a game-show style Q&A to see who has learned the most throughout the season; the first girl to miss three questions will get knocked out of the competition. The catch is that each girl gets to decide who to ask their question to. Three girls quickly from a strategy to gang up on the fourth, and agree to ask all their questions to one girl, and someone is sent packing. Now down to three ladies, the next competition brings out the heart and tears when the girls have to give speeches on what it would mean to them to win the $50,000 prize. But only two can be chosen to continue. Those two finalists spend the next day dress shopping and getting makeovers for the final ceremony where Mo will determine which girl has changed the most during her time at Charm School. Only one them is awarded the $50,000 grand prize, but both finalists leave with gifts they did not expect.","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2007-07-08","episode_number":11,"episode_type":"finale","id":384569,"name":"Reunion Show","overview":"Cast mates return to reminisce about the season that was and give updates on what they've been doing since it ended.","production_code":"","runtime":60,"season_number":1,"show_id":7135,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":17339,"poster_path":null,"season_number":1,"vote_average":0}}}