{
    "adult": false,
    "backdrop_path": "/bPHjAKi0UxxMszmylKGZFopitBN.jpg",
    "created_by": [],
    "episode_run_time": [
        30
    ],
    "first_air_date": "2017-04-16",
    "genres": [],
    "homepage": "http://www.foodnetwork.com/shows/iron-chef-eats",
    "id": 71451,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2017-05-21",
    "last_episode_to_air": {
        "id": 1315136,
        "name": "Seafood Standouts",
        "overview": "The authorities at Iron Chef open up about the seafood that has them hooked! Iron Chef Geoffrey Zakarian dives into Lure Fishbar in New York City for the branzino and the sea urchin bucatini. Iron Chef Gauntlet competitor Jonathon Sawyer swims in seafood when he orders the low country seafood pilau and fried oysters at The Grocery in Charleston, S.C., while Iron Chef Gauntlet competitor Stephanie Izard craves the creamy clam chowder at the John Dory Oyster Bar in New York City. Meanwhile, Iron Chef winner Walter Royal heads to Brennan's in New Orleans when he wants the best gumbo and roasted oysters.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2017-05-21",
        "episode_number": 12,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 30,
        "season_number": 1,
        "show_id": 71451,
        "still_path": "/ukohEOElhXBVKW1usY9wxJhptr2.jpg"
    },
    "name": "Iron Chef Eats",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 143,
            "logo_path": "/tm2UclPxfamHyFuILLq4jNxsi8v.png",
            "name": "Food Network",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 12,
    "number_of_seasons": 1,
    "origin_country": [],
    "original_language": "en",
    "original_name": "Iron Chef Eats",
    "overview": "The stars from the world of Iron Chef are ready to share with viewers where they chow down on their days off from the kitchen. From the best pizza to great burgers and fried chicken galore, Iron Chef Eats will be a celebration of all the delicious and phenomenal foods that the best in the business crave.",
    "popularity": 0.3,
    "poster_path": "/pSCTVq8aRupMi84GramQqS58YWl.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2017-04-16",
            "episode_count": 12,
            "id": 87815,
            "name": "Season 1",
            "overview": "",
            "poster_path": "/dsZKeLJdP1zRhE5sJuUTMhnS54Y.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Reality",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "5900ab3d92514161aa00c8f9",
            "air_date": "2017-04-16",
            "episodes": [
                {
                    "air_date": "2017-04-16",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1308298,
                    "name": "Beloved Burgers",
                    "overview": "The folks from Iron Chef are sharing their favorite spots for the best burgers. In New York City, Iron Chef Alex Guarnaschelli prefers late night hotspot Sister Midnight in the East Village for their simple yet satisfying cheeseburgers and veggie burgers, while Iron Chef winner Madison Cowan can be found in midtown, rolling up his sleeves at Salvation Burger. Iron Chef Gauntlet competitor Sarah Grueneberg checks into RPM Steak in Chicago for their dry-aged steakburger, and Iron Chef winner Tim Love satisfies his burger cravings at Cafe No Se in Austin.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/rVWgxfHbsLhyv1WKK6IIIBHpEqW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1308325,
                    "name": "Lip-Smacking Barbecue",
                    "overview": "When it comes to barbecue, no one follows the smoke signals as quickly and hungrily as the folks from Iron Chef! Iron Chef Michael Symon chows down on chicken redneck tacos at Martin's Bar-B-Que Joint in Nashville, while Iron Chef winner Lee Anne Wong patiently waits hours in line at Franklin Barbecue in Austin. Iron Chef Gauntlet competitor Jonathon Sawyer swears by the smoked lamb belly and Korean sticky ribs at Hometown Bar-B-Que in Brooklyn, and Iron Chef winner Madison Cowan heads to Bludso's Bar and Que in Los Angeles for their lip-smacking ribs.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/bPHjAKi0UxxMszmylKGZFopitBN.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-23",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1308326,
                    "name": "Comfort Food",
                    "overview": "Nothing warms the heart, satisfies the soul and pleases the palate like comfort food! Iron Chef Bobby Flay's go-to comfort eats are the grilled lamb chops and sizzling shrimp at The Greek in New York, while Iron Chef Mario Batali dines on Tortellini en Brodo and Gramigna con Salsiccia at Osteria Morini when he wants to feel transported to Italy. Iron Chef winner Michael Psilakis gets his fill of comfort at Puckett's Grocery in Nashville with their meatloaf and their sweet potato pancakes layered with pulled pork. For Iron Chef winner Eric Greenspan, only a pastrami Reuben and bialy with salmon and cream cheese from Wise Sons in San Francisco can do the trick.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/5RWykbnP859YIPv6CVN3ZSHVmMC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-23",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1308327,
                    "name": "Pizza Perfection",
                    "overview": "Everyone loves pizza, and the folks from Iron Chef have their top picks when it comes to the best pies. Iron Chef Michael Symon loves Motorino in Brooklyn for their Brussels sprouts and marinara pies baked in a wood-burning oven. For authentic New York-style pizza, Iron Chef winner Tim Love joins the crowds at Home Slice Pizza in Austin for pepperoni and white pies. When it comes to deep dish, Iron Chef winner Ken Oringer stands by Chicago pizza institution Lou Malnati's and their sausage-packed classic pie. Finally, Iron Chef winner Brad Farmerie keeps it local in New York City by going to his favorite neighborhood spot, Speedy Romeo, for their St. Louie pie topped with sausage, salami and provel cheese.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/znOoNpkHR39TLcXIhbCvIL2yZaM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-30",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1308328,
                    "name": "Best Breakfasts",
                    "overview": "The folks from Iron Chef will happily hop out of bed if it means starting the day with their favorite breakfast! Iron Chef Geoffrey Zakarian dreams about the waffles and quiches at Balthazar in New York City. Iron Chef Gauntlet competitor Jonathon Sawyer kick starts his day at Dove's in Chicago with their Southern-inspired Mexican food. Iron Chef Gauntlet competitor Sarah Gruenberg greets the day with a savory bacon and egg sandwich and a slice of blueberry cornmeal cake at Huckleberry Bakery and Cafe in Santa Monica, Calif., while Iron Chef winner Brad Farmerie is a big fan of the fried chicken and hash at the Country Cat in Portland, Ore.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/c9lKYs9OggyjBOdVKujbjAHJBUH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-30",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1308329,
                    "name": "No Fork Needed",
                    "overview": "No fork, no knife, no problem -- the folks from Iron Chef can't wait to get their hands on these tasty bites! From crunchy falafel to crispy chicken schnitzel, Iron Chef Alex Guarnaschelli loves to cradle the sandwiches at Shaya in New Orleans. Iron Chef winner Ed Lee finds great satisfaction with the meat-filled tacos at Big Star in Chicago, while Iron Chef Gauntlet competitor Sarah Grueneberg prefers the burgers, chicken nuggets and fries at Trick Dog in San Francisco. Plus, Iron Chef winner Beau MacMillan devours deviled eggs, oysters and chicken wings at Tavern and Table in Charleston, S.C.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/mVL556O990YLGn2SZooNaXjIxEe.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1315128,
                    "name": "Piggin' Out",
                    "overview": "Favorite chefs from Iron Chef are giving the inside dish on where they go when they're craving porky deliciousness. For Iron Chef Mario Batali, it's the five-spice glazed pork belly sandwich at Num Pang in New York City, while Iron Chef winner Beau MacMillan is a big fan of The Publican in Chicago and their addictive spicy pork rinds. It's all about the muffaletta sandwich at Cochon Butcher in Nashville for Iron Chef winner Eric Greenspan. Then, in Los Angeles, Iron Chef winner Ed Lee raves about the Pork Toro and Larb Lanna at Thai restaurant Night + Market Song and Iron Chef winner Michael Psilakis loves the pork-laden Polpette pizza at Kettle Black.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/5Z94zXJFjpCLsVUL3hl2upTLi5A.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-07",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1315129,
                    "name": "Italian Favorites",
                    "overview": "The culinary masters from Iron Chef are sharing their favorite Italian eats. Iron Chef Geoffrey Zakarian loves the California-Italian inspired dishes at Spartina restaurant in Los Angeles, and Iron Chef Gauntlet competitor Stephanie Izard loves the wood-fired Diavolo and Vongole Bianco pizzas at Nostrana in Portland, Oregon. Iron Chef winner Lee Anne Wong finds pasta perfection at Domenica in New Orleans, while Iron Chef Bobby Flay swoons over the colorful plates of vegetables at Via Carota in New York City.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/uWmRDY5T8lNXcpKhtDGB7g7B3AH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-14",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1315132,
                    "name": "Sensational Sandwiches",
                    "overview": "The culinary authorities at Iron Chef are dishing on their all-time favorite sandwiches. Iron Chef Mario Batali indulges in summertime lobster rolls all year long at Pearl Oyster Bar and roasted cauliflower sandwiches at Num Pang in New York City. Iron Chef winner Ed Lee always makes Domilise's Po-Boys and Bar his first stop in New Orleans for their legendary fried oyster and roast beef po' boy sandwiches. Iron Chef winner Michael Psilakis prefers to start his day with the breakfast club and burrito sandwiches at the Oaks Gourmet Market in Los Angeles, while Iron Chef winner Ken Oringer satisfies his cravings with the meaty brisket and chicken sandwiches Mighty Quinn's Barbecue in New York City.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/jzulNc9EdbEmQTFsme7znhzRO3s.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-14",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1315133,
                    "name": "Meat Lovers",
                    "overview": "It's a cornucopia of meat to satisfy every carnivore! Iron Chef Bobby Flay dines on American classics at Wolfgang's Steakhouse in New York City, but Iron Chef Michael Symon skips the standard steakhouse and heads to Lewis Barbecue in Charleston, SC, when he's craving prime rib and beef ribs. Iron Chef winner Tim Love is addicted to the Pig's Ear Salad and Pork Leg Steak at the Purple Pig in Chicago, then Iron Chef winner Lee Anne Wong shares her love for the Argentinean-style grilled skirt steaks, short ribs and sausages at the Ox in Portland, Ore.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/pT19iSo5FThK5X5GaPDUmnZs6wk.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-21",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1315135,
                    "name": "Hot and Spicy",
                    "overview": "The folks at Iron Chef are turning up the heat with dynamite dishes that set their senses on fire! Iron Chef Alex Guarnaschelli torches her taste buds with the spicy meatball and pork carnitas tacos at Johnny Sanchez in New Orleans. Iron Chef Gauntlet competitor Stephanie Izard loves the spicy Indian dosas at Dosa on Fillmore in San Francisco. Iron Chef winner Brad Farmerie heads to Uncle Boon's in New York City for their green curry snails and spicy rotisserie chicken salad, while Iron Chef winner Viet Pham prefers to set his mouth ablaze with the Nashville-style hot chicken at Howlin' Rays in Los Angeles.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/du1xjqysT0D86HTELOPvYrghkTh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-21",
                    "episode_number": 12,
                    "episode_type": "finale",
                    "id": 1315136,
                    "name": "Seafood Standouts",
                    "overview": "The authorities at Iron Chef open up about the seafood that has them hooked! Iron Chef Geoffrey Zakarian dives into Lure Fishbar in New York City for the branzino and the sea urchin bucatini. Iron Chef Gauntlet competitor Jonathon Sawyer swims in seafood when he orders the low country seafood pilau and fried oysters at The Grocery in Charleston, S.C., while Iron Chef Gauntlet competitor Stephanie Izard craves the creamy clam chowder at the John Dory Oyster Bar in New York City. Meanwhile, Iron Chef winner Walter Royal heads to Brennan's in New Orleans when he wants the best gumbo and roasted oysters.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 71451,
                    "still_path": "/ukohEOElhXBVKW1usY9wxJhptr2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 87815,
            "poster_path": "/dsZKeLJdP1zRhE5sJuUTMhnS54Y.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    }
}