{"adult":false,"backdrop_path":"/vvJM0tUH5z7dHi1R8OMRUMl5OFz.jpg","created_by":[],"episode_run_time":[24],"first_air_date":"2014-10-17","genres":[{"id":16,"name":"Animation"},{"id":18,"name":"Drama"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"http://yuyuyu.tv","id":71493,"in_production":false,"languages":["ja"],"last_air_date":"2021-12-18","last_episode_to_air":{"id":3376811,"name":"Smile At You","overview":"The battle is over at long last. Now, the Hero Club must ask what comes next.","vote_average":0,"vote_count":0,"air_date":"2021-12-18","episode_number":12,"episode_type":"finale","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/cEHQfe6wN8TRZtzal3qbBZwknYH.jpg"},"name":"Yuki Yuna Is a Hero","next_episode_to_air":null,"networks":[{"id":94,"logo_path":"/7RNXnyiMbjgqtPAjja13wchcrGI.png","name":"MBS","origin_country":"JP"}],"number_of_episodes":36,"number_of_seasons":3,"origin_country":["JP"],"original_language":"ja","original_name":"結城友奈は勇者である","overview":"Yuna Yuki is an ordinary second-year middle school student. She gets up in the morning, gets ready for school, goes to classes, participates in club activities, and has fun with her friends. But there is one extraordinary thing about Yuki -- she belongs to the “Brave Hero Club.” What does the Brave Hero Club do? Who is the mysterious being called “Vertex?” Yuki Yuna and her friends’ story takes place in Year 300, Era of the Gods.","popularity":30.513,"poster_path":"/aGbQU8amYmscbNgprSuIKRfdZ8N.jpg","production_companies":[{"id":25504,"logo_path":"/sWnGpj6TF4BIo2tBrmF2NBI4IA9.png","name":"Studio Gokumi","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"2017-03-18","episode_count":20,"id":234026,"name":"Specials","overview":"","poster_path":"/A4cKHvszqMwoyJ32r7jhyI7dTia.jpg","season_number":0,"vote_average":0},{"air_date":"2014-10-17","episode_count":12,"id":87895,"name":"Yuki Yuna Is a Hero","overview":"In her everyday life, Yuuna Yuuki is a hero. As proof, she is in her middle school's Hero Club, where she does her best to help others and bring a smile to everyone's face.\n\nBut Yuuna, always up to any task, is about to become an even bigger hero. Mysterious destructive forces called Vertexes begin threatening the world she loves, and the Hero Club is called upon by a strange phone app to save it. Along with her best friend Mimori Tougou, as well as sisters Fuu and Itsuki Inubouzaki, they must transform into magical girls in order to battle the Vertexes.\n\nIn between studying and putting on shows for kids, Yuuna and the Hero Club must fight for the very existence of their world and face the harsh truths behind their own powers, all the while discovering what it truly means to be a hero.","poster_path":"/z6BTM4QGtGKNuXpwfKlWOFGMMvk.jpg","season_number":1,"vote_average":9},{"air_date":"2017-10-07","episode_count":12,"id":93761,"name":"Yuki Yuna Is a Hero: The Washio Sumi & The Hero Chapter","overview":"Season 2 consists of a prequel to the first season (Episodes 1-6) and follows up with the sequel (Episodes 7-x).\n\n**The Washio Sumi Chapter**\n\nIn the year 298 from the era of the gods, elementary school girls Sumi Washio, Sonoko Nogi, and Gin Minowa are tasked with an important mission. They are to become heroes and fight Vertex, a mysterious enemy that is attacking Shinju-sama, the god tree that protects Shikoku, the only area in the world that is still habitable. What they don't know, is that this fight will cost them more than they could have ever imagined.\n\n**The Hero Chapter**\n\nSequel of Yuuki Yuuna wa Yuusha de Aru.","poster_path":"/dV0g3ljRuV2PnxTMBb0zjlDEDyH.jpg","season_number":2,"vote_average":0},{"air_date":"2021-10-02","episode_count":12,"id":197715,"name":"Yuki Yuna Is a Hero: The Great Mankai Chapter","overview":"","poster_path":"/84gWzL63DXLOWOmrDaoSexmr8LY.jpg","season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.357,"vote_count":14,"season_data":{"1":{"_id":"5904f0e2c3a3684a7600f777","air_date":"2014-10-17","episodes":[{"air_date":"2014-10-17","episode_number":1,"episode_type":"standard","id":1309645,"name":"A Maiden's True Heart","overview":"Yuna Yuki, her best friend Mimori Togo, and sisters Fu and Itsuki Inubozaki, are all members of the Sanshu Middle School Hero Club, which is dedicated to helping those that request it via their website. During class one day, upon each receiving a strange 'forestize warning' message on their phones, the four girls find time has suddenly stopped around them before they are enveloped by a rainbow-colored light, soon finding themselves in a strange colorful forest.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/bskrTKeavVDXyqukBhe0y3coIcb.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-10-17","episode_number":2,"episode_type":"standard","id":1309664,"name":"Noble Thoughts","overview":"With the Vertex able to regenerate its wounds, Fu has Yuna and Itsuki perform a sealing ritual in order to expose its core. Working together, Fu and Yuna manage to destroy the core, defeating the Vertex and returning everyone to the real world. The next day, Fu explains that she was tasked by her organisation, the Taisha, to grant hero candidates the power to fight against the twelve Vertex that threaten Shinju. Mimori, frustrated that she couldn't help everyone during the battle, directs her anger at Fu for keeping things a secret from everyone, but Yuna manages to cheer up a little. The girls are soon brought into another battle as three more Vertex emerge, using combined attacks to keep them from performing the sealing ritual. When the Vertex start attacking Yuna, Mimori becomes determined to protect her and awakens her hero form, using long range attacks to provide support, and together they manage to defeat all three Vertex.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/x2YCJkTiYiH8GyTLqOtKvepaW3O.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-10-24","episode_number":3,"episode_type":"standard","id":1309665,"name":"Moral Poise","overview":"A month following their last encounter, the girls prepare to face off against the fifth Vertex, only for another hero named Karin Miyoshi to suddenly appear and defeat it single-handedly. The next day, Karin transfers into Yuna and Mimori's class, claiming herself to be a fully trained hero sent to supervise the newbies. She reluctantly joins the Hero Club, though is stubborn about becoming friends with the others. That weekend, as the girls plan to meet somewhere, Karin skips out on it, feeling she should not be led astray from her duty as a hero. Later that night, the girls show up at Karin's apartment, revealing they had planned to surprise her with a birthday party. At the end of the day, Karin is starting to get along with them.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/yNKEWkbRLAq2lNgGPjaszRWkdQF.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-10-31","episode_number":4,"episode_type":"standard","id":1309667,"name":"Shining Hearts","overview":"Itsuki, who gets nervous when singing in front of others, is anxious about an upcoming test, so the Hero Club decide to go to karaoke to help boost her confidence. Meanwhile, Fu is unnerved by a message from Taisha telling her to expect the worst. As she continues to struggle with her nerves, Itsuki thinks about the burden placed on Fu, who has been looking after her ever since their parents died. Later, as Fu laments getting Itsuki involved with the Vertex, Itsuki assures her that she feels happy being able to fight alongside her. On the day of her test, Itsuki finds a letter from everyone encouraging her to do her best, allowing her to sing with confidence and giving her a goal of becoming a singer. Soon afterwards, as Fu contemplates with worst case scenario, another forestization appears.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/ftPvfaEQIEq9XrWM8Gt4GZ6JfdJ.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-11-07","episode_number":5,"episode_type":"standard","id":1309670,"name":"Overcoming Adversity","overview":"Facing up against all seven of the remaining Vertex, the girls start to fight against the first one, only to be caught in a trap by another, who uses a loud bell to disable them. Itsuki manages to stop the bell, but then three Vertexes merge to form a single more powerful Vertex, proving resilient to their attacks. Not willing to give up, Fu and Mimori use their trump card, the Mankai form, to defeat the combined Vertex, while Itsuki uses her Mankai form to stop a smaller, faster Vertex from reaching Shinju. Fu then risks herself to buy time for the others to seal the remaining Vertex, whose core is discovered to be a massive one positioned in the stratosphere. Yuna and Mimori head to space together in order to fight against the core, using their Mankai forms to destroy it. Following the battle, Karin is relieved to find everyone alive and well and reports their victory to Taisha.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/pAruBsQgfVj3zaeTAwvAw6o0gXf.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-11-14","episode_number":6,"episode_type":"standard","id":1309671,"name":"In Anticipation of Tomorrow","overview":"After receiving checkups at the hospital following their battle against the Vertex, Fu is revealed to have lost some vision in her left eye while Itsuki has lost her voice, both of which they assume to be temporary symptoms caused by battle fatigue. However, upon discovering Yuna has also lost her sense of taste and that she herself has gone deaf in her left ear, Mimori fears that these symptoms could be a side-effect of the Mankai form and gets in touch with Fu about it. Meanwhile, Karin, who hasn't been affected since she didn't use the Mankai form, has been avoiding going to the clubroom, as she fears she no longer has any purpose now that the Vertex are gone. However, Yuna manages to find her and convince her that, even with no-one to fight, the Hero Club will still carry on like it always has. Touched by Yuna's friendship, Karin convinces Taisha to let her stay at Sanshu Middle School until graduation, while the girls make plans for summer break.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/z1BaZGJPqBF1vaqIbd8jiFlXrlv.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-11-21","episode_number":7,"episode_type":"standard","id":1309672,"name":"Idyllic Happiness","overview":"Taisha rewards the girls with an all-expenses-paid trip to a hot spring inn during their summer break. The girls enjoy a day on the beach, have a delicious meal, relax in the hot springs, and tell some ghost stories. The next morning, Mimori reminisces about a ribbon she was holding onto when she lost her memory in an accident and wonders if their battles are really over. After the group returns home, making plans for the culture festival on the way back, Fu is summoned to the clubroom where she discovers everyone's old transformation cellphones, as well as a new fairy for herself, with Taisha warning her that another attack is to be expected.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/uQAzneqJeRzjrEawVmCZtq4sI3h.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-11-28","episode_number":8,"episode_type":"standard","id":1309673,"name":"Blessings of the Gods","overview":"After Fu informs the others that their battle isn't over yet, with each girl besides Karin receiving an additional fairy, the girls soon come up against another forestization. Discovering the remaining Vertex, finding it to be overflowing with cores, Yuna quickly disposes of them using the power of her new fairy, causing some worry amongst her friends. When the forest disappears, Yuna and Mimori end up separated from the others, having been summoned by a hospitalized girl, who reveals herself to be a former hero named Sonoko Nogi. Sonoko reveals to them the secret of the Hero System, in which heroes permanently lose the use of a bodily function in exchange for the power granted by the Mankai form, further revealing that heroes are effectively sacrifices to Shinju who can never die. On top of the shock both girls feel upon hearing this, Mimori is also saddened as she seems to know Sonoko, but is unable to remember her.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/urkZhZ1WXqvytZ1gObSL4SQfqB4.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-12-05","episode_number":9,"episode_type":"standard","id":1309675,"name":"Those Who Know Grief","overview":"Yuna and Mimori relay what they've learned from Sonoko to Fu, who asks them not to tell Itsuki and Karin until they know for certain. Despite hearing from Itsuki's homeroom teacher how Itsuki has been suffering due to her missing voice, Fu remains in denial, hoping that things will eventually get better. The next day, however, Mimori reveals to Yuna and Fu that their fairies were actually created to prevent them from dying, even by suicide, proving that everything Sonoko said to them was true and that their symptoms are permanent. This leads Fu to become distressed, knowing that Itsuki's voice will never return and she will never achieve her dream of becoming a singer. Angered by having gotten everyone involved, Fu seeks to destroy the Taisha, even preparing to battle her way through Karin to this end. However, Yuna and Itsuki stop her from fighting, showing her they have no regrets joining the Hero Club.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/vN46Q8Bq4RjmoHUF9hRkxKLhbWN.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-12-12","episode_number":10,"episode_type":"standard","id":1309677,"name":"Bonds of Love","overview":"Mimori recalls the events following the loss of her memories, including her first meeting with Yuna and how they came to join the Hero Club. Having discovered her legs and memory were lost because of the Mankai form and that everything from her standard of living to moving near Yuna was arranged by Taisha, Mimori once again approaches Sonoko, who tells her the true nature of the world. Investigating a hidden barrier facing opposite the Shinju, Mimori goes inside to discover a hellish landscape filled with smaller Vertexes that are rebuilding the ones that were already defeated, dooming the heroes to continue battling until they become completely disabled. Not wanting the others to suffer like Sonoko did, Mimori believes the only solution is to destroy Shinju and blasts a hole in the barrier, unleashing several smaller Vertexes into the forest.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/mWfu34A4zKRiY5xCYgaevj7Tv0S.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-12-19","episode_number":11,"episode_type":"standard","id":1309679,"name":"Passion","overview":"Learning Mimori is at the center of the Vertex outbreak, Yuna and Karin chase after her into the barrier, learning what Mimori herself had learned. Before they can try to reason with Mimori, who believes destroying the Shinju is the only way to spare her friends from suffering, Yuna and Karin are forced to retreat from the Vertex.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/cnKJ3LYQmr2y63Qgpl4EWrWNr9k.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]},{"air_date":"2014-12-26","episode_number":12,"episode_type":"finale","id":1309681,"name":"Smile At You","overview":"Yuna is forced to fight against Mimori, who can't bear to lose her memories of everyone like she did with Sonoko, or be forgotten about herself. However, Yuna states her determined feelings to never forget about Mimori and manages to stop her. With the Vertex's final attack headed for Shinju, all of the girls, despite the afflictions caused by their Mankai forms, band together to block the attack, with Yuna delivering the final blow just in time, after which their fairies disappear, ending their role as heroes.","production_code":"","runtime":24,"season_number":1,"show_id":71493,"still_path":"/o9VN0ISidxuGqIuYDEhujWamocY.jpg","vote_average":9,"vote_count":2,"crew":[],"guest_stars":[]}],"name":"Yuki Yuna Is a Hero","overview":"In her everyday life, Yuuna Yuuki is a hero. As proof, she is in her middle school's Hero Club, where she does her best to help others and bring a smile to everyone's face.\n\nBut Yuuna, always up to any task, is about to become an even bigger hero. Mysterious destructive forces called Vertexes begin threatening the world she loves, and the Hero Club is called upon by a strange phone app to save it. Along with her best friend Mimori Tougou, as well as sisters Fuu and Itsuki Inubouzaki, they must transform into magical girls in order to battle the Vertexes.\n\nIn between studying and putting on shows for kids, Yuuna and the Hero Club must fight for the very existence of their world and face the harsh truths behind their own powers, all the while discovering what it truly means to be a hero.","id":87895,"poster_path":"/z6BTM4QGtGKNuXpwfKlWOFGMMvk.jpg","season_number":1,"vote_average":9},"2":{"_id":"59da163bc3a36861a303eb02","air_date":"2017-10-07","episodes":[{"air_date":"2017-10-07","episode_number":1,"episode_type":"standard","id":1377375,"name":"Sumi Washio","overview":"Era of the Gods, year 298, two years before \"Yuki Yuna is a Hero.\" Sumi Washio(6th grade) who was chosen by the Shinjyu, is a hero who protects the world alongside her classmates, Sonoko Nogi and Gin Minowa. It seems like Sonoko and Gin are trouble-makers because they could be idiotic or too energetic. Sumi is excited that she should lead the other two, but...","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/awmtZ7SG0GrMcGXN7jqwDn92ie.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"609b034a7a97ab0040ef5878","adult":false,"gender":2,"id":2922690,"known_for_department":"Directing","name":"Naotaka Hayashi","original_name":"Naotaka Hayashi","popularity":1.712,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"630f28d1ed2ac200827e94fc","adult":false,"gender":2,"id":2922690,"known_for_department":"Directing","name":"Naotaka Hayashi","original_name":"Naotaka Hayashi","popularity":1.712,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-10-14","episode_number":2,"episode_type":"standard","id":1476252,"name":"Friends","overview":"The hero team, Sumi Washio, Sonoko Nogi, and Gin Minowa, hasn't been able to unify because they haven't had much time to prepare. So, they decided to choose a leader and strengthen their unity by doing a training camp. Sumi saw herself as the leader, but the teacher, Ms. Aki appointed Sonoko as the leader...","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/hVkCxDkwBPkklzUrFNLO7DCE0df.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-21","episode_number":3,"episode_type":"standard","id":1476253,"name":"Everyday Life","overview":"The three girls, Sumi Washio, Sonoko Nogi, and Gin Minowa, who now has stronger unity, are working hard to fulfill their roles as heroes. It's part of their job to rest as well. Three of them started to fully enjoy their momentary break.","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/c5msm03OlKnc8ZPD3yYCwILhgrE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-10-28","episode_number":4,"episode_type":"standard","id":1476254,"name":"Soul","overview":"Sumi Washio, Sonoko Nogi, and Gin Minowa are going to their elementary school's class trip. The three of them are put in a crisis because of the Vertex's advanced action whom appeared as if to shatter their fun everyday life.","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/qeE3jRKBh7awzOIDsg1fXneXxUU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-04","episode_number":5,"episode_type":"standard","id":1476256,"name":"Goodbye","overview":"The Hero's system advances to prepare for the battle with the escalating enemy. However, that was too brutal for the girls in 6th grade to have to bear. Nevertheless, the girls work hard to fulfill their roles.","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/ziFcxwBqSpz06Kkpb9lerLD5ECG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-11","episode_number":6,"episode_type":"standard","id":1476258,"name":"Promise","overview":"Finally, the climactic battle has begun. The heroes are fulfilling their roles with full of new powers. The flowers bloomed beautifully. What kind of destiny would await them in the future...","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/ccdsAeZV2h5PaCuwHohUYTJbtif.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-11-25","episode_number":7,"episode_type":"standard","id":1476259,"name":"Spectacular Days","overview":"Yuna Yuki and the others at the Sanshu Middle School Hero Club work hard at their club activities, and spend their everyday life as usual.","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/4CXqFGOzkdOUKxtVLsx3mRTdp4l.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-02","episode_number":8,"episode_type":"standard","id":1476260,"name":"Important Memories","overview":"Yuna and the Hero Club work very hard.","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/k0D05WxEVB00HQDHc0RCCwJlC0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-09","episode_number":9,"episode_type":"standard","id":1476261,"name":"My Heart Hurts When I Think of You","overview":"Something surprising happens to the Hero Club again.","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/kgSxH2qiNDEag2lYw7weZsHdkb4.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"64061cd3021cee00b4ff70dd","adult":false,"gender":2,"id":2805827,"known_for_department":"Directing","name":"Toru Hamasaki","original_name":"Toru Hamasaki","popularity":0.728,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-12-16","episode_number":10,"episode_type":"standard","id":1476263,"name":"Unspoken Intentions","overview":"There was something written in a certain diary.","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/9dDolsVwUClIr9K7YoP1Czq9CPo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-12-23","episode_number":11,"episode_type":"standard","id":1476264,"name":"Incorruptible Heart","overview":"Yuna Yuki makes a major life decision.","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/8nRUov8SPiUfVBW9NqZjnOT5m7K.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-06","episode_number":12,"episode_type":"finale","id":1476265,"name":"Only You Can Make Me Happy","overview":"Heroes' screams echoed out into the heavens.","production_code":"","runtime":24,"season_number":2,"show_id":71493,"still_path":"/aCPZSmla9fDjnpKZvAMRwheHNk6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Yuki Yuna Is a Hero: The Washio Sumi & The Hero Chapter","overview":"Season 2 consists of a prequel to the first season (Episodes 1-6) and follows up with the sequel (Episodes 7-x).\n\n**The Washio Sumi Chapter**\n\nIn the year 298 from the era of the gods, elementary school girls Sumi Washio, Sonoko Nogi, and Gin Minowa are tasked with an important mission. They are to become heroes and fight Vertex, a mysterious enemy that is attacking Shinju-sama, the god tree that protects Shikoku, the only area in the world that is still habitable. What they don't know, is that this fight will cost them more than they could have ever imagined.\n\n**The Hero Chapter**\n\nSequel of Yuuki Yuuna wa Yuusha de Aru.","id":93761,"poster_path":"/dV0g3ljRuV2PnxTMBb0zjlDEDyH.jpg","season_number":2,"vote_average":0},"3":{"_id":"60b66eb4dd926a003f4c2104","air_date":"2021-10-02","episodes":[{"air_date":"2021-10-02","episode_number":1,"episode_type":"standard","id":3161457,"name":"Joyous Youth","overview":"The members of the Hero Club look forward to resuming their normal lives. And that means fun activities like band practice, karaoke, airsoft matches and camping trips!","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/uQzR4wAJ8toLx7KmvHwARjlrPZq.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"64061cd3021cee00b4ff70dd","adult":false,"gender":2,"id":2805827,"known_for_department":"Directing","name":"Toru Hamasaki","original_name":"Toru Hamasaki","popularity":0.728,"profile_path":null},{"job":"Storyboard Artist","department":"Art","credit_id":"64061d13392712007cb2aa83","adult":false,"gender":2,"id":2805827,"known_for_department":"Directing","name":"Toru Hamasaki","original_name":"Toru Hamasaki","popularity":0.728,"profile_path":null}],"guest_stars":[]},{"air_date":"2021-10-09","episode_number":2,"episode_type":"standard","id":3253791,"name":"I Offer You My Everything","overview":"Back in Divine Era Year 298, Taisha gathers a group of candidates. One of them will become the next hero, and Mebuki will ensure that it will be her.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/90jxZsas6zmUNtjFZnNuqHikRpo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-10-16","episode_number":3,"episode_type":"standard","id":3253792,"name":"Smallest Joys","overview":"The Sentinels have a dangerous task. Although Mebuki’s leadership has prevented fatalities, not everyone stays. Those who leave are replaced as if they were nothing but tools.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/wF0ZEcYNSt6zrNR5b9GH2g1UOvc.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"64062633021cee008471fe51","adult":false,"gender":0,"id":3496188,"known_for_department":"Visual Effects","name":"Tsubasa Tanaka","original_name":"Tsubasa Tanaka","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2021-10-23","episode_number":4,"episode_type":"standard","id":3256377,"name":"Oracle","overview":"The Sentinels do not have the powers of a hero, but they have each other. When the Vertex unexpectedly attack, Mebuki and her team face a battle unlike anything before.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/qIcMPISwotEqEF5eIP3DNA5IpPG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-10-30","episode_number":5,"episode_type":"standard","id":3256378,"name":"Brightness Unleashed","overview":"Sonoko’s family possessed The Hero Annals for generations. When she entrusts it to the Hero Club, they learn about the first heroes who defended humanity against the Vertex.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/4tDNNAR2c8p6PyTtR67dchN4sph.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"64062633021cee008471fe51","adult":false,"gender":0,"id":3496188,"known_for_department":"Visual Effects","name":"Tsubasa Tanaka","original_name":"Tsubasa Tanaka","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2021-11-06","episode_number":6,"episode_type":"standard","id":3256379,"name":"Ease My Fears","overview":"People are cruel, a fact Chikage is all too well aware of.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/iYj4L22AOJoQNNfvmeSqb6W1LlU.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"64061cd3021cee00b4ff70dd","adult":false,"gender":2,"id":2805827,"known_for_department":"Directing","name":"Toru Hamasaki","original_name":"Toru Hamasaki","popularity":0.728,"profile_path":null}],"guest_stars":[]},{"air_date":"2021-11-13","episode_number":7,"episode_type":"standard","id":3312363,"name":"You Will Never Be Forgotten","overview":"Two friends with different perspectives arrive at a crossroads, and conflict is inevitable. And when conflict occurs, consequences follow.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/ZEXD4I6UAMFXozoGzDV39wW8x7.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"636ac9162866fa007e4c41aa","adult":false,"gender":2,"id":1467473,"known_for_department":"Directing","name":"Akira Kato","original_name":"Akira Kato","popularity":0.699,"profile_path":null},{"job":"Animation Director","department":"Visual Effects","credit_id":"64062633021cee008471fe51","adult":false,"gender":0,"id":3496188,"known_for_department":"Visual Effects","name":"Tsubasa Tanaka","original_name":"Tsubasa Tanaka","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2021-11-20","episode_number":8,"episode_type":"standard","id":3312364,"name":"Eternal Vow","overview":"What does it mean to be a hero? Wakaba and Yuna are about to find out.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/50hTnPWEdFwB5nvX4GFc0pEvKP1.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-11-27","episode_number":9,"episode_type":"standard","id":3312365,"name":"True Friendship","overview":"Karin rages against the gods who cursed Yuna, but they don’t answer when she issues a challenge from beyond the barrier. Instead, she finds the Sentinels and an old rival.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/taMtodJ0Tyzwq67wggc3ekxtbjS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-04","episode_number":10,"episode_type":"standard","id":3312366,"name":"Power Born of Adversity","overview":"The Heroes begin their final mission, but they weren’t the only ones fighting that day. While they battled the enemy, the Sentinels were holding the line.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/51nZM3JfSazYMkZsA5lb3TPr6rq.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"64061cd3021cee00b4ff70dd","adult":false,"gender":2,"id":2805827,"known_for_department":"Directing","name":"Toru Hamasaki","original_name":"Toru Hamasaki","popularity":0.728,"profile_path":null}],"guest_stars":[]},{"air_date":"2021-12-11","episode_number":11,"episode_type":"standard","id":3356213,"name":"My Heart Burns","overview":"Togo will do anything to save Mimori, even if it means defying the will of the gods.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/XXQEHxDsbQsaML0ZTALo994bKT.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Animation Director","department":"Visual Effects","credit_id":"64062633021cee008471fe51","adult":false,"gender":0,"id":3496188,"known_for_department":"Visual Effects","name":"Tsubasa Tanaka","original_name":"Tsubasa Tanaka","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2021-12-18","episode_number":12,"episode_type":"finale","id":3376811,"name":"Smile At You","overview":"The battle is over at long last. Now, the Hero Club must ask what comes next.","production_code":"","runtime":24,"season_number":3,"show_id":71493,"still_path":"/cEHQfe6wN8TRZtzal3qbBZwknYH.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"64061cd3021cee00b4ff70dd","adult":false,"gender":2,"id":2805827,"known_for_department":"Directing","name":"Toru Hamasaki","original_name":"Toru Hamasaki","popularity":0.728,"profile_path":null}],"guest_stars":[]}],"name":"Yuki Yuna Is a Hero: The Great Mankai Chapter","overview":"","id":197715,"poster_path":"/84gWzL63DXLOWOmrDaoSexmr8LY.jpg","season_number":3,"vote_average":0}}}