{"adult":false,"backdrop_path":"/zJs0eK1e0SPOEonNGgTVptr5niN.jpg","created_by":[{"id":67075,"credit_id":"5b09f2350e0a260dad000044","name":"Sion Sono","gender":2,"profile_path":"/nuPRCFqZRmw8qYLfoLUxJPtcwjX.jpg"}],"episode_run_time":[40],"first_air_date":"2017-06-16","genres":[{"id":10765,"name":"Sci-Fi & Fantasy"},{"id":18,"name":"Drama"}],"homepage":"https://www.amazon.co.jp/dp/B07215J5M4","id":71495,"in_production":false,"languages":["ro","ja"],"last_air_date":"2017-06-16","last_episode_to_air":{"id":1329325,"name":"episode 9","overview":"Manami (Taketo Asao) who found a room where K (summer sail) who has been supplying blood for 15 years as the heart of Tokyo Vampire Hotel lies. K knew that Mana Mi was losing his memory, listening to the events in the hotel from Akari (Mr. Norikazu Mori). K such eyes awake such Manami. At that time, two detectives strayed at the hotel. He came following Cody (Shibukawa Kiyohiko) as a suspect of the murder case. I am amazed at the fact that the world has not been destroyed, but I try to believe that a cozy and coexisting prosperous hotel will last forever. I will give Akari the blood of ancient times that I robbed the Dracula clan and try to make it the heart of the hotel on behalf of K. That was the only way to keep happy time for both humans and the Korvin people. At the moment when the hotel dropped the blood of the Dracula clan into the mouth of the acari, and the hotel tried to obtain a new life, K appeared.","vote_average":0,"vote_count":0,"air_date":"2017-06-16","episode_number":10,"episode_type":"finale","production_code":"","runtime":30,"season_number":1,"show_id":71495,"still_path":"/h1JwtcmwLxcFN8vBThgYpZ0uGqo.jpg"},"name":"Tokyo Vampire Hotel","next_episode_to_air":null,"networks":[{"id":1024,"logo_path":"/ifhbNuuVnlwYy5oXA5VIb2YR8AZ.png","name":"Prime Video","origin_country":""}],"number_of_episodes":10,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"東京ヴァンパイアホテル","overview":"Manami suddenly encounters mass murder at a pub on her 22nd birthday as she is hunted down by two warring vampire clans, the Draculas and the Corvins. Manami is a child of prophecy who is meant to help the Draculas overcome their Corvin enemies who have driven them underground. Meanwhile, droves of young men and women are gathered at the Hotel Requiem by a Corvin named Yamada who informs them that the world is about to end, with this hotel being the only refuge.","popularity":10.862,"poster_path":"/aCEitKTGURE9yAowzCBfqrV5WLE.jpg","production_companies":[{"id":955,"logo_path":"/5xnXD3PJI1HqOJceSAKZ3fDqO1V.png","name":"Nikkatsu Corporation","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":null,"episode_count":3,"id":105630,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2017-06-16","episode_count":10,"id":87900,"name":"Season 1","overview":"","poster_path":"/bJUUk0AtVnCBZxM5twVAIDqK8du.jpg","season_number":1,"vote_average":10}],"spoken_languages":[{"english_name":"Romanian","iso_639_1":"ro","name":"Română"},{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.395,"vote_count":43,"season_data":{"1":{"_id":"5905a7eec3a3684a4e01aff2","air_date":"2017-06-16","episodes":[{"air_date":"2017-06-16","episode_number":1,"episode_type":"standard","id":1313739,"name":"episode 1","overview":"In the 16th century, the vampire legendary center Dracula clan was deeply buried deep under the Neo Vampire clan. The neo-vampire family was called the Corvin family and the earth was theirs. Time flies, 1999. At 9:09:00 on the day when the Grand Cross where the planets including the earth lined up in the solar system occurred, three children were born. The written prophecy states that these children will save the Dracula clan. Children who kept accumulating infinite power till the time to come was supposed to be 22 years old in 2021. Manami (Tetsuo Asaime) who will have a 22-year old birthday in three hours will meet a friend at Shinjuku. A strange woman, Giga (Nakagawa Shoko) came over and killed other than Manami one after another. A woman named K (summer sail) appeared to Manami who escaped alone and ordered, \"If you are lame, please do as I say.\" It was Yamada (Masunosuke Mitsushima) who claimed the Korubin who helped Manami escaping from K alone.","production_code":"","runtime":39,"season_number":1,"show_id":71495,"still_path":"/xfGXeEiG7AvTc6jF5xpnUUbeIyz.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":2,"episode_type":"standard","id":1329317,"name":"episode 2","overview":"A girl's past story. At first glance it is a very ordinary family, but always monitored by someone, parents have changed many times, mothers always care about the girls bleeding. K (Natsuho) and Noah, a college student who went to Transylvania in Romania, visited a ruins hotel operated by Vampire, who was preying on guests. I go to the depths of the underground that we are connected to the world as it is guided by the girl we met there. When you notice, K are brought to \"Hotel · Requiem\" like a palace filled with bright colors and light. In this hotel which is managed by the princess (Yuumi Adachi) which exists as the heart of the hotel, Elisabeth · Batori (Megumi Kagurazaka), a mysterious man · Yamada (Masunosuke Mitsushima), the prey, Noah, belongs to the Corbin tribe, the underground Dracula K who was abandoned at the heart becomes a Vampire family. And in 2021 the battle of two families was about to begin.","production_code":"","runtime":44,"season_number":1,"show_id":71495,"still_path":"/czu4Ektv2U0JYLznWxB31Xyl03q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":3,"episode_type":"standard","id":1329318,"name":"episode 3","overview":"\"Hotel · Requiem\" - This is a luxurious hotel where the Korvin tribes of the neo · vampire family who dominate the ground run against human beings. A nationwide contest tournament sponsored by Yamada will be held here, handed down by the princess whose lower part is connected to the hotel (Yuumi Adachi), Elisabeth · Batori (Megumi Kagurazaka), a mysterious man · Yamada (Masunosuke Mitsushima). Among them was the appearance of K (summer sail) secretly infiltrating. Manami (Tetsuo Asaime) brought to the hotel by the back of the ornate party is stabbed in the chest with a knife and when the old empress (Yumemo Adachi) suffocates suffering from the falling fresh blood, the empress wore young I will go. The empress who regained youth declares \"At the party tonight, the world ends\" at the party venue. It is said that only the chosen people in this hotel can survive. The time of the collapse of the world comes in front of the people who can hardly believe.","production_code":"","runtime":51,"season_number":1,"show_id":71495,"still_path":"/qo8pRxXBemzdmDuKSF3S515cmOM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":4,"episode_type":"standard","id":1329319,"name":"episode 4","overview":"The invitation of young men and women is obstinate, the true identity of a luxurious hotel called \"Hotel · Requiem\", a devil's house that forces life as livestock, it is the Tokyo Vampire Hotel that the Corvin's runs. The trapped men and women will fight handguns and swords to escape from this hotel, but the Korbin tribe will rise quickly no matter how much he knocks down, so the teeth do not stand out. K (Natsuho) secretly cooperates with Noah who once became a Korbinian tribe, bringing out Manami (Totate Asae) to a source of the Dracula clan deep underground. And the secret of Manami's birth is revealed. In 1999, one of the three children born at the same time on the day Grand Cross took place was Manami. However, the other two survived until the age of 22, as ancient blood came abnormally in the body, died while suffering, and committed suicide. K was a messenger sent to bring Manami here.","production_code":"","runtime":38,"season_number":1,"show_id":71495,"still_path":"/yOqcOyeGAFKLgdE8GlilSGehBtN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":5,"episode_type":"standard","id":1329320,"name":"episode 5","overview":"The Dracula clan who has been waiting for 22 years to come up with Manami (Totto Asaka) who grew up until 22 years of age among the three children having infinite power stood up by sucking the blood of Manami . The Dracula clan headed to Romania to defeat the evil Korvin people on the ground, Manami and K (Natsuhi) return to Tokyo Vampire Hotel again. Noah tells her hidden feelings to K who is about to leave Noah. At that time, at the Tokyo Vampire Hotel, Princess (Yumemo Adachi) died, Yamada (Masunosuke Mitsushima) was the Emperor. Meanwhile, the men and women trapped in the hotel began fighting against the employees of the hotel who cooperated with each other to hold the weapons and showed the true nature of Vampire to escape from here. K that arrived there bowed a fire at the shadow of the Korubin family, and they kicked one after another with a sword.","production_code":"","runtime":41,"season_number":1,"show_id":71495,"still_path":"/fxsSiFD5M6KWb8Q412vhCsIbkVH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":6,"episode_type":"standard","id":1329321,"name":"episode 6","overview":"Emperor Yamada (Masunosuke Mitsushima) who suppressed the man who tried to escape from the Tokyo Vampire Hotel will glimpse the outside world to people who do not believe the end of the world. It was Tokyo where the burning fire spread endlessly. Yamada asks for a submissive man seeking to have a couple in time and have sex. If it does not hold it tells that death is waiting, a man and a woman are tied together randomly. They are prospering human beings with supervision while watching with supervision, and there is no way to survive only to continue to provide blood to Yamada et al. Vampire Kolvin forever. Captured Manami (Taketo Aya) begins to arouse the original blood force as Elisabeth Bartley (Megumi Kagurazaka) and others sucked blood. K, on ​​the other hand, is drawn into the rift of the hotel wall. It was a human living hell whose people dropped out from hotel life were pushed in. Among them K knows the identity of Tokyo Vampire Hotel.","production_code":"","runtime":44,"season_number":1,"show_id":71495,"still_path":"/1QxpU0Qp08sNsP5WXttOmALDwKL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":7,"episode_type":"standard","id":1329322,"name":"episode 7","overview":"The last battle of the Colovin people and the people who caused the rebellion will come to an end. A fierce battle with a sword and a gun is held in various parts of the hotel. Yamada gave humans a blood festival with a machine gun, and Mana Mi who aroused and turned into a beast tore up the body of the Corbin tribe as a weapon with a sharply extended nail. Blood will also spur out from the walls of the hotel, and when the princess who is the hotel itself (Yumemo Adachi) begins to suffer, the princess is torn apart and K (summer sail) will survive. K who dyed the whole body with fresh blood, knocks down the Korubin one after another with the sword in hand, and changes the colorful hotel to the sea of ​​blood. In the meantime, surprising news arrives from the Dracula clan under K. K and Manami, K and Noah's love-hate, Empress Yuumi Adachi and Elisabeth · Batley's fate, Yamada's birth secret... all ends at the Tokyo Vampire Hotel. And Manami notices the secret of K.","production_code":"","runtime":43,"season_number":1,"show_id":71495,"still_path":"/6vdDaKITIXMxtMKS2tTRnpHRAVJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":8,"episode_type":"standard","id":1329323,"name":"episode 8.01","overview":"The surviving people and the Korbin tribe explore the way of coexistence and co-prosperity without knowing what will be the end after all. There are also cooks · Cody (Shibukawa Kiyohiko) who prepares people's meals. Manami (Taketa Asao) who returned to the human figure there appears, but I do not remember anything what happened. Fifteen years later, the former fight was like a lie, at the hotel humans and the Korubin were living a calm and shared life. Humans regularly donate blood and supply blood to the Kolvin tribe. It is K (summer sail) who plays the role of the hotel's heart on behalf of the princess. Akari (Norikazu Mori) born in this hotel also will be 14 years old soon. She does not know the outside world, she is the only human being born and raised in this hotel, has received love for both human beings and the Korbin tribe. However, there was a huge secret in this hotel that neither man nor the Korbin tribe knew.","production_code":"","runtime":30,"season_number":1,"show_id":71495,"still_path":"/z1YJulEff7xJ4EZKsbQ57WOSF7m.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":9,"episode_type":"standard","id":1329324,"name":"episode 8.02","overview":"When going out from the Tokyo Vampire Hotel, the world contaminated with radioactivity was supposed to be spreading. However, when the chef Cody (Shibukawa Kiyohiko) finished his work, when he went out to the city in the night of Tokyo where there was no change, he took a woman and brought him to the alley. Akari (Mr. Noriaki Mori), who is about to turn 14, is curious about the unseen world outside. Only she notices that the outside world is continuing and asks him to bring him out to Cody. Cody calls out as a birthday present to Akari, secretly leading out. Outside air touched for the first time in birth .... When Akari woke up, it was the lobby of the hotel. Is it a dream or a reality? Cody will soon disappear from the hotel. There is only a week left for food. If humans starve to death the blood supply to the Korubin family will also be blocked. And Manami (Takinobu Aoi) and K (Natsuho) were about to awake.","production_code":"","runtime":30,"season_number":1,"show_id":71495,"still_path":"/3x2wAelswCmZ4LMLAP5YH6GrPBT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-06-16","episode_number":10,"episode_type":"finale","id":1329325,"name":"episode 9","overview":"Manami (Taketo Asao) who found a room where K (summer sail) who has been supplying blood for 15 years as the heart of Tokyo Vampire Hotel lies. K knew that Mana Mi was losing his memory, listening to the events in the hotel from Akari (Mr. Norikazu Mori). K such eyes awake such Manami. At that time, two detectives strayed at the hotel. He came following Cody (Shibukawa Kiyohiko) as a suspect of the murder case. I am amazed at the fact that the world has not been destroyed, but I try to believe that a cozy and coexisting prosperous hotel will last forever. I will give Akari the blood of ancient times that I robbed the Dracula clan and try to make it the heart of the hotel on behalf of K. That was the only way to keep happy time for both humans and the Korvin people. At the moment when the hotel dropped the blood of the Dracula clan into the mouth of the acari, and the hotel tried to obtain a new life, K appeared.","production_code":"","runtime":30,"season_number":1,"show_id":71495,"still_path":"/h1JwtcmwLxcFN8vBThgYpZ0uGqo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":87900,"poster_path":"/bJUUk0AtVnCBZxM5twVAIDqK8du.jpg","season_number":1,"vote_average":10}}}