{"adult":false,"backdrop_path":"/pm48wx1hhswBZ7AzNtIem61DCBx.jpg","created_by":[],"episode_run_time":[24],"first_air_date":"1998-04-01","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"","id":72041,"in_production":false,"languages":["ja"],"last_air_date":"1998-09-30","last_episode_to_air":{"id":1324199,"name":"Hero... The Birth of a New Knight","overview":"The spirits are reaching the Lodoss mainland and begin killing the people there. King Etoh and a band of priests arrive to cast a protective light spell. Spark attempts to reach out to Neese but Kardis blocks him. In the spiritual plane, Naneel is confronted by Neese, her current reincarnation. Neese rejects Naneel and prays for Marfa to banish her, but this only strengthens Kardis. Spark is drawn into the spiritual plane and meets Neese and Naneel. He tells Neese he will never give up on her and he wants her the way she is. Neese then accepts Naneel into her and, as the Doorway, this act of benevolence surrounds the evil power and allows Marfa to descend. Marfa gives Spark a choice: Open the doorway allowing Marfa to be reborn and Lodoss can have eternal peace but Neese will be destroyed; or take back Neese and Lodoss will be as it was. He reasons that peace should be achieved by those who live there and opts to take back Neese. Neese is returned, Garrack is revived, and a new light shines over Marmo. Leylia collects Karla's circlet. At the celebrations, Parn is named the Knight of Lodoss and King Kashue finally awards Spark his knighthood.","vote_average":0,"vote_count":0,"air_date":"1998-09-30","episode_number":27,"episode_type":"finale","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/xliAqP9YSkybOQUDSfgz0i7lPL5.jpg"},"name":"Record of Lodoss War: Chronicles of the Heroic Knight","next_episode_to_air":null,"networks":[{"id":98,"logo_path":"/1oTje9uOhRcuLSAc8ERn0cnG51i.png","name":"TV Tokyo","origin_country":"JP"}],"number_of_episodes":27,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"ロードス島戦記 英雄騎士伝","overview":"Five years after the death of the Emperor of Marmo in the War of Heroes, Parn is now the Free Knight of Lodoss, he and his old allies now famous through the land. However, the Emperor's right-hand-man, Ashram, seeks the Scepter of Domination to re-unify Lodoss under his former leader's banner. Meanwhile, beyond his attempts at conquest lies a more sinister force beginning to set the stage for the resurrection of the goddess of death and destruction...","popularity":13.453,"poster_path":"/cC03MG5593IWXPUeKZAQX9qW3A1.jpg","production_companies":[{"id":3034,"logo_path":"/kGRavMqgyx4p2X4C96bjRCj50oI.png","name":"TV Tokyo","origin_country":"JP"},{"id":1194,"logo_path":"/dwkHaFLgtA7CUNbgKK0wB6bospu.png","name":"Kadokawa Shoten","origin_country":"JP"},{"id":4690,"logo_path":"/bQXkraSwoBDVd8xEAOkxGQLBB1S.png","name":"Anime International Company","origin_country":"JP"},{"id":528,"logo_path":"/fO3Aof3lXQclYpBByYC8aneTXwA.png","name":"Bandai Visual","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"1998-04-01","episode_count":27,"id":88978,"name":"Season 1","overview":"","poster_path":"/rvN94OBKuMr2OLVmZ1SXTc4Yirn.jpg","season_number":1,"vote_average":10}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.091,"vote_count":11,"season_data":{"1":{"_id":"59348455c3a3685a450253bb","air_date":"1998-04-01","episodes":[{"air_date":"1998-04-01","episode_number":1,"episode_type":"standard","id":1324167,"name":"The Free Knight... A New Legend Begins","overview":"Ashram arrives at the Temple of Marfa and demands to know about Bramd the ice dragon's treasure. The treasure is one of the Governor's Treasures, which Ashram seeks to take for himself. His goal is to acquire the treasures in order to fulfill his late master's wish by obtaining the Scepter of Domination. He reveals to Neese that he killed Bramd and she informs him the treasure was sold off and thus is not the treasure he is after. When Ashram leaves she sends a summons for Leylia, Slayn and their daughter Neese from Zaxon. Elsewhere, Shiris, Orson and a few other enforcers head to Zaxon to collect overdue taxes for Duke Raster. Cecil, a young sorcerer, protects the village, so Shiris draws him out into a trap. Deedlit and Parn save Cecil but Orson goes into a berserker rage when Parn defeats Shiris, only calming down as a result of Deedlit's spells. Slayn, Leylia and Neese arrive shortly afterwards informing Parn to go with them back to consult the elder Neese.","production_code":"1","runtime":24,"season_number":1,"show_id":72041,"still_path":"/7JOh0SLRVJTuU3DIeYeNLqIos5c.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"1998-04-08","episode_number":2,"episode_type":"standard","id":1324168,"name":"Dragon... The Guardian of the Lost History","overview":"While Orson is recovering from his battle with Parn, Leylia recalls the story of the fall of the magical kingdom of Kastuul. Following a failed experiment for the sorcerers to gain more powerful magicks, Kastuul was destroyed, leading the barbarians to revolt and destroy the city of Kuudo. Kuudo's governor, Saluvan, had dispatched his dragons all over Lodoss to guard his treasures so that one day the power of Kastuul could one day be revived. Another Kuudo noble, the sorceress Karla, is killed in the battle but is able to remain immortal by forever transferring her soul to others using the circlet on her head. Slayn recruits Parn, Cecil, and Deedlit to stop Ashram from collecting these treasures, and Shiris and Orson join them. They deduce where Ashram is heading next and head towards Flaim to recruit King Kashue. In Flaim itself, Ashram attempts to recruit Hobb the priest of Myrii, the god of war, to help him overthrow King Kashue in order to unite Lodoss.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/acHQrKufU7U0YjYDmDg47mJXZij.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-04-15","episode_number":3,"episode_type":"standard","id":1324169,"name":"King... The Long Sought Hero","overview":"The group arrives and meets with King Kashue in the capital, Blade, where there is a food shortage due to a large influx of refugees from Western Flaim. They are fleeing the feeding grounds of Shooting Star, the fire dragon, who has taken to attacking the area. Kashue's forces are preparing to kill Shooting Star to free the region to ease the food shortages. Parn offers to help but Slayn points out that Abram, the dragon of Blue Dragon Island, may also have the Scepter Of Domination and Ashram may be able to acquire it first. He suggests that Parn and Deedlit go with Kashue's army while the rest go to Blue Dragon Island, under the leadership of Orson as a way to help him overcome his berserker rages. Later that night Shiris dances with Parn making Deedlit jealous. Kashue introduces Parn to Spark and suggests that Parn one day becomes the king of Alanis and informs him that Etoh has become the king of Falis. Elsewhere Hobb and Ashram's party survey the damage in Western Flaim.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/tGqSvfdGN6yHvA7x7UcgQWCrNSO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-04-22","episode_number":4,"episode_type":"standard","id":1324170,"name":"Pirates... The Ship of Dark Ambitions","overview":"King Kashue's army rides out to battle Shooting Star, having discovered Hobb has joined Ashram, and Deedlit struggles with her feelings for Parn. In the waters around the port town of Raiden, Alhaib the pirate, under the employ of Ashram, has put a stop to the shipping. Ashram arrives to kill Abram with his group that includes the dark elf Astar and Groder, a sorcerer working for Wagnard. Wagnard also desires the Scepter Of Domination, as well as the Soul Crystal Ball, to resurrect the dark goddess Kardis. Hobb voices his suspicions about Groder to Ashram who is already suspicious of him, as well as the others as agents for other Marmo parties. Orson's group fails to get a ship in Raiden due to the pirate activity and so he decides they will remove the pirate threat, with the aid of Maar the bard, and then take their ship. Later that night Orson attempts to face his demons head on only to end up in a berserker rage. He nearly kills the sleeping Shiris but is only just able to stop himself. In Western Flaim, Shooting Star turns to attack Kashue's army.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/hMcZ97ZK439FhsYisREv2vYQr4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-04-29","episode_number":5,"episode_type":"standard","id":1324175,"name":"Demon Sword... The Power to Crush Souls","overview":"While Slayn and Leylia remain in Raiden, Orson and the others locate the pirate ship thanks to Maar and are astonished to find Ashram there. The group is defeated and captured by Ashram's band and Ashram's demon sword calms the spirit of anger behind Orson's berserker rage leading him to be captured as well. Back in Flaim, Shooting Star decimates King Kashue's army. When Kashue wounds the dragon, it vows to kill every last human in revenge. Realising the need for a powerful magic user Kashue decides to go to Raiden to recruit Slayn's help. Ashram sets sail for Blue Dragon Island taking Orson's group with them.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/uifm0QdP46SxFv59DdK7sQ2mkFl.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637c485f156cc700ca031a0c","adult":false,"gender":2,"id":1067794,"known_for_department":"Directing","name":"Hayato Date","original_name":"Hayato Date","popularity":5.715,"profile_path":"/4LEd4MXPgNzJVqf9C4GznaIMOgW.jpg"}],"guest_stars":[]},{"air_date":"1998-05-06","episode_number":6,"episode_type":"standard","id":1324176,"name":"Heart... Tears Reborn","overview":"Shiris develops a rivalry with Smeddy, who defeated her earlier. Ashram's ship arrives on Blue Dragon Island and Groder attempts to negotiate with Abram. He learns that the dragon does not guard the Sceptre Of Domination but does have the Soul Crystal Ball. He manipulates the dragon into fighting Ashram's group and, with the help of Hobb's incantation, they kill Abram with Orson as a witness, whose spirit of anger is weakened by the dragon's roar. The events with Ashram help Orson regain his emotions. Groder takes the Soul Crystal Ball and informs Wagnard of its acquisition but when he is ordered to bring it immediately to Wagnard he grows suspicious of him. On the journey back Maar escapes after using magic to put everyone including Orson's group to sleep and then steals the Soul Crystal Ball. Kashue's group arrive in Raiden and meet up with Leylia and Slayn and later with Maar. They defeat Alhaib's pirates and discover that Ashram has already departed for Fire Dragon Mountain. After rescuing Orson's group they witness Shooting Star burn Raiden to the ground. Deciding that stopping Ashram is more important, Kashue and the rest head after Ashram.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/aV7NqHyocqqoP3obNUlIqzCBL0K.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-05-13","episode_number":7,"episode_type":"standard","id":1324177,"name":"Death... A Gentle Heart Bequeathed","overview":"The group nearly catches up to Ashram. Whilst resting Orson declares his love for Shiris but since she's annoyed she defiantly states she loves Parn. After an argument she slaps Orson and storms off. When Shooting Star heads off to feed, Ashram and Hobb enter Fire Dragon Mountain leaving the rest to guard against Kashue's group. When the group arrives at the entrance to the mountain a fight ensues. Kashue follows Ashram while the rest battle the guards. Groder summons dragon tooth soldiers to aid them and a magical battle also ensues between the sorcerers. Deedlit battles Astar to a stalemate while Slayn and Cecil engages Groder. Leylia manages to kill Gaberra but Groder escapes. Once again Shiris is defeated by Smeddy and Orson is unable to enter a berserker rage having been cured. He begs the spirit of rage of make him strong again to protect Shiris and the spirit obliges. The berserk Orson cuts down Smeddy and Astar but is mortally wounded. Shiris sees he will die and asks him to strike her down so they can be together forever but he dies before he can kill her.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/rmENxxYFyTJnugh1rTAzUBdukxI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-05-20","episode_number":8,"episode_type":"standard","id":1324178,"name":"The Scepter of Domination... The Dream of a United Lodoss","overview":"Ashram reaches the chamber containing the Sceptre Of Domination, but Shooting Star returns due to the conditions of guarding the treasure. Kashue catches up to Ashram inside the mountain and proposes that they work together to defeat the dragon and duel afterwards for the treasure. Ashram agrees as Parn and the others arrive inside the chamber. Cecil, Deedlit, Leylia and Hobb all cast spells to protect them and the spells distract the dragon long enough for Ashram and Parn to stab Shooting Star in the head causing the dragon to fall into the lava. Ashram and Kashue duel and Kashue is the victor. A desperate Ashram grabs the sceptre but Parn knocks it out of his hands into the lava. Ashram realizes he cannot fulfill Emperor Beld's ambition and dives into the lava. The rest leave the chamber and head home with Lodoss safe from all threats.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/8EZsCmUkBI5U4VRrLj8ndHcr7qB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-05-27","episode_number":9,"episode_type":"standard","id":1324179,"name":"The Young Knight... Tested Strength","overview":"10 years have passed since the events at Fire Mountain. The elder Neese has since died but had revealed to Slayn that Leylia is actually the reincarnation of Queen Naneel, high priestess of Kardis. Spark is now older but fails to be named as a knight of Flaim. He requests that he joins King Kashue's forces in defeating Marmo's forces but is refused as Kashue wants him to think about things other than war if he is to become king of the flame tribe. Parn is also in Flaim for the banquet to ask Kashue for help in the fight against Marmo. Kashue promises aid once Duke Raster of Alania, who has just allied with the Marmo, is defeated. Meanwhile, outside the treasure house Spark is attacked within the castle walls by a dark elf.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/9q8YBHV5p0M01lt0N5Ub7BsWWXA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-06-03","episode_number":10,"episode_type":"standard","id":1324180,"name":"Recovery... A Mission Assigned","overview":"Spark realizes that he is outnumbered by the dark elves and so attempts to sound the alarm but is badly wounded. Parn hears the alarm but the dark elves have already escaped with the treasure, which was guarded by Slayn's magic spell, meaning that a more powerful sorcerer was behind the theft. Spark is healed by  Greevus, a priest of Myrii, while Slayn and King Kashue explain to Parn and Deedlit what was stolen. Wagnard is back and attempting to resurrect Kardis and needs the two keys and the Doorway to do so. The Soul Crystal Ball, one of the keys, was stolen by the dark elves and the other key is the Staff Of Life, kept at the temple of Falis in Valis. The doorway is a live sacrifice but has yet to be revealed. Kashue hires mercenaries Garrack and Leaf the half-elf as well as Greevus and Aldonova the wizard, all under Spark's command, to pursue the dark elves and retrieve the Soul Crystal Ball and deliver a dispatch to King Etoh of Valis. They set off after the dark elves oblivious that Neese is following them at a distance. Parn and Deedlit decide to return to Kanon.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/rdVGK6GMeWWYZ9UhcQos19Dv4p5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-06-10","episode_number":11,"episode_type":"standard","id":1324181,"name":"Light... A Girl Guided by the Gods","overview":"Randy and Ryna are being pursued by the dark elves and Randy is pierced by the elf magic. Parn's group reach the Southern fortress where the dark elves were spotted and they meet Ryna and a critically ill Randy. Garrack is suspicious of Ryna, wondering why the dark elves did not kill them off. Garrack's suspicions are answered when Greevus attempts to heal Randy but inadvertently sets off a magical trap. Out of Randy's body grows a gigantic multiple headed monster that attacks the fortress. Greevus deduces that to kill the monster they must kill Randy. The group struggle to fight it but eventually work together as a team, however Spark's hesitancy to kill Randy means it is now difficult to kill him. Neese defeats the monster with her magick, killing Randy. Ryna vows to avenge him by joining Spark's mission.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/9IPbnMIdqnyETgTu1CYRo5XI9VG.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637c485f156cc700ca031a0c","adult":false,"gender":2,"id":1067794,"known_for_department":"Directing","name":"Hayato Date","original_name":"Hayato Date","popularity":5.715,"profile_path":"/4LEd4MXPgNzJVqf9C4GznaIMOgW.jpg"}],"guest_stars":[]},{"air_date":"1998-06-17","episode_number":12,"episode_type":"standard","id":1324182,"name":"Sallying Forth... Pursuing a Dark Shadow","overview":"Cecil's forces in Zaxon are forced evacuate to Tarba when they are overrun by a sudden attack by Raster's forces as a new war ignites. Duke Raster has plans to rule over the whole of Lodoss. Spark's group arrive in Hiruto and Spark meets with Governor Randal. Spark gets frustrated that he cannot help in the war effort, but Randal tries to teach him about responsibilities. Meanwhile Garrack is still suspicious of Ryna's motivations but she allays his fears. She learns that Garrack is not a mercenary but a noble protecting Spark as he may be king of Flaim one day. When news of the dark elves being spotted reaches Hiruto, the group set out joined by Neese, who claims to follow Spark due to being led by her dark nightmare.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/jJQPZHUxiRM5o91WAxH3Evcaze7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-06-24","episode_number":13,"episode_type":"standard","id":1324183,"name":"Nightmare... The Creeping Dark Power","overview":"The group catches up to the dark elves and engage them. After a tough battle in which the dark elves are killed and Ryna is badly wounded, they discover that the dark elves sacrificed themselves as decoys and do not possess the Soul Crystal Ball. After heading back to Hiruto, Neese heals Ryna while the others rest and wait for news. When Ryna wakes she reveals to Spark that she is actually a thief. Disappointed he allows her to stay without turning her over to the authorities. Later that night, Neese's dream is invaded by Wagnard who reveals her to be the Doorway and she is caught by his magick. She lets out a scream that alerts the group and they enter her room to see her surrounded by a dark magical aura.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/40wTzDjQUOt9eaHpbe8y0uHc0V0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-07-01","episode_number":14,"episode_type":"standard","id":1324184,"name":"Doorway... The Truth Proclaimed","overview":"Spark and Greevus manage to save Neese from being taken away by the \"dark nightmare\". Aldonova reveals the truth about Neese and her dark nightmare: In order to resurrect Kardis, Wagnard needs her as the Doorway as she has Queen Naneel's blood whereas Leylia is no longer pure after having a child. He also reveals that Wagnard is in extreme pain when he uses dark magicks due to a curse and therefore will not try the same thing again any time soon. Using Ryna's knowledge as a thief to predict the plans of the courier carrying the Soul Crystal Ball, the group head to Valis. There they can protect the Staff of Life as well as deliver the dispatch to King Etoh and intercept the courier at the port of Roid in Valis. Elsewhere in Marmo-controlled Kanon, Parn with Deedlit and Maar meet with the Kanon free army led by Prince Reona and are welcomed by Hobb. Hobb informs them that Rabido, the Marmo governor of Kanon, is to be replaced. Outside the governor's residence, Rabido is observed by three dark figures: Ashram, Groder and Pirotess.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/dXjpBMlFEgcBtid04TqsEXf9fkf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-07-08","episode_number":15,"episode_type":"standard","id":1324185,"name":"An Old Enemy... Reunion with the Black Knight","overview":"Ashram, who was saved by Groder from the lava, confronts the egomaniacal Rabido. However he allows Rabido to head out to defeat the free army in order to totally conquer Kanon and remain as governor. Ashram does not reveal that he is the new governor. As insurance against the free army, Rabido uses the villagers as a shield and hostages to be executed should his forces lose. A spy informs Prince Reona of the hostage situation and so he sends Parn, Hobb, Deedlit and Maar to save them. Meanwhile the free army ambushes Rabido's Marmo army and Rabido is killed. Parn enters the village and is surprised to find it empty. Ashram has saved the villagers from Rabido's tyranny and they are now on their way to Rood which Marmo will defend heavily. He intends to unite all of Lodoss as before and so Parn fights him, with Pirotess preventing any interference. Ashram easily defeats Parn but refuses to kill him as he says that a king needs subjects and subjects need a king who protects them. But as he walks away he says that their battle will never be over.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/nQBkzABT6wljWcg6Zprk8Mjjxha.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-07-15","episode_number":16,"episode_type":"standard","id":1324186,"name":"The Holy City... Pursuing a Clue","overview":"Spark arrives at Valis and delivers the message to King Etoh. The message includes new orders for Spark to return to Flaim if he has failed to retrieve the Soul Crystal Ball. Aldonova helps console Spark by suggesting the group go sightseeing in Roid as cover for finding the courier before the evening banquet. Once there, Ryna's knowledge again comes in handy and she suggests heading to the taverns to spread a rumour about wanting to travel to Kanon, in Marmo territory, to find work as mercenaries. Eventually the strategy pays off and a group of men find them. However, they are undercover Valis soldiers who attack them for wanting to join Marmo. Aldonova and Leaf cast spells to help the group escape but they are separated. Spark is saved by a man calling himself Jay, who says he will transport them to Kanon.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/ypJfx6rXklDNGDNF5AzMwvdpaow.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-07-22","episode_number":17,"episode_type":"standard","id":1324188,"name":"Decision... An Option Compelled","overview":"In Western Lodoss, the kingdom of Moss is in the midst of a civil war. Duke Redrick, allied with now Queen Shiris, commands the Daragon Eyes dragon riders and the kingdom will soon be reunified. In Alania, King Kashue's army defeats Duke Raster's army and then lays siege to the capital, Alan. When Raster refuses to surrender Kashue knows that this drawn out siege will tie up his forces away from the war against Marmo. In Valis, Spark returns to the group and informs them about Jay. Garrack deduces that Jay commands a Marmo warship meaning that Valis will soon be attacked for the Staff Of Life. However Spark is worried that he may disappoint Kashue for refusing his orders to return and also anger Etoh due to the groups's activities earlier, create a crack between the Flaim-Valis alliance without having any solid evidence to back up his theory. Just as they leave to the banquet, they realize Neese has gone to the temple where the staff is kept. Immediately, Spark realizes the course of action to take and informs King Etoh of what has transpired. At that point flames are seen near the Temple Of Falis. The group rushes off to save Neese.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/8CJyL9W2pSFvHH9r5dgAbBO37XW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-07-29","episode_number":18,"episode_type":"standard","id":1324189,"name":"Mission... The Path One Follows","overview":"The group arrives near the temple and engages a small Marmo force. Spark goes to find Neese while Garrack and the others hold off the Marmo soldiers. Neese is unable to stop some dark elves from stealing the Staff Of Life when she encounters Jay. Not realizing she is the Doorway, they attack her only for her to be saved by Spark. After killing Jay, the Marmo flee having accomplished their mission and another dark nightmare appears to kidnap Neese. Spark, with the help of Garrack, Greevus and Aldonova, slows the dark nightmare enough for Neese to wake up and close the portal. Neese decides to go to Marmo to retrieve the keys and the others decide to join her. King Etoh gives the group a ship ride to Kanon. Karla is concerned about Wagnard resurrecting Kardis and confronts him about his intentions.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/qObgx8WIyzClwNtchx6yBPkrA8P.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637c485f156cc700ca031a0c","adult":false,"gender":2,"id":1067794,"known_for_department":"Directing","name":"Hayato Date","original_name":"Hayato Date","popularity":5.715,"profile_path":"/4LEd4MXPgNzJVqf9C4GznaIMOgW.jpg"}],"guest_stars":[]},{"air_date":"1998-08-05","episode_number":19,"episode_type":"standard","id":1324190,"name":"Reunion... In a Distant War-torn Land","overview":"The group arrive in Marmo-occupied Kanon and decide to head directly to Rood where they can organize transport to Marmo. Neese is eager to prove her use in a fight but Spark feels the need to protect her as his duty. As they travel they come across a scorched village and Neese is attacked by a monster but is saved by Spark. They determine that the monster was brought over from Marmo. At night they take refuge in a cave and Leaf is able to scavenge for food. Spark and Greevus are standing guard when the cave is surrounded by monsters and a Marmo soldier. Garrack, Ryna, Greevus and Leaf engage the monsters whilst Spark and Aldonova, followed by Neese, try to circle around. Due to their lack of knowledge of the area they become trapped. The soldier summons a large ogre to kill them but Neese casts a spell that saves them and allows Spark to kill it. Back near the cave they discover that the Marmo were transporting food to their frontline and they are interrupted by the Kanon free army. Proving they were sent by King Etoh, Parn makes an appearance.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/nVtc0hL3YlhGeFEnO82GXwhwPZv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-08-12","episode_number":20,"episode_type":"standard","id":1324191,"name":"Counterattack... The Stolen Last Hope","overview":"The group updates Parn about the situation regarding Neese and in turn he updates the group about the war. King Kashue has killed Duke Raster and Alania has fallen. King Etoh is leading a holy war to rid Valis of the Marmo and King Kashue has now mobilized his army towards Kanon. Spark leads an ambush by the free army on the Kanon supply lines but they are heavily defended. Having successfully carried out the ambush the free army hosts a banquet later that night. After Neese heals a small wound on Spark the others tease them about their growing feelings for each other. At the banquet Ryna and Leaf get Spark and Neese to spend even more time together. As they are sharing a tender moment alone, Wagnard himself appears and kidnaps Neese and now possesses all the components required to resurrect Kardis.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/y859XJzHuthgxaoPah240HbaXo7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-08-19","episode_number":21,"episode_type":"standard","id":1324192,"name":"A Vow... A Step Towards the Future","overview":"Spark is distraught as Neese is transported to Marmo and unable to escape. Wagnard reveals that his plan for Kardis is to destroy Lodoss so that he, as a necromancer, can have a kingdom of the dead to rule over. Parn leads the group and the free army to Rood to link up with Prince Reona's forces. Rood is heavily defended by Ashram and Reona charges Spark's group with the critical task of taking the city center, due to their abilities, while the free army takes out the strongholds defending the city. In Rood, reports of Karla's movements and sightings reaches Lord Ashram. He knows she is not there to help the free army and Groder informs him that the Marmo council has ordered that the Marmo in Rood will defend to the last man. Ashram is left suspicious of Wagnard's plans and orders Pirotess to assemble as many ships as she can.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/wZtG0yTz6zynDjNGPaJRKME59UB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-08-26","episode_number":22,"episode_type":"standard","id":1324193,"name":"Liberation... A Path Opened","overview":"The attack on Rood begins. Spark's team aims for the city center while the free army simultaneously attacks four strongholds around the city, preventing the Marmo army from consolidating. Ashram disobeys the Marmo council and orders Groder to evacuate the wounded onto the ships. Once the city center is secure, Parn and Deedlit head up to the governor's mansion to face Ashram but find only Pirotess. She is able to delay them long enough for Ashram and the Marmo to escape. He realizes that Lodoss will never accept them. As per his duty to look after his people, he leads them out to sea to a safe land once he picks up the others still on Marmo. After Rood has fallen, King Kashue arrives and signs a treaty with Prince Reona uniting all of Lodoss. He then charges Spark to go to Marmo and rescue Neese and prevent Kardis' resurrection. Wagnard begins the ceremony whilst an uneasy Karla decides to ensure the balance of power on Lodoss is maintained.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/hdLANuwTz6MJfYtnRgrbJBt4th1.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"6097134acf4b8b003fa1f54a","adult":false,"gender":2,"id":1433645,"known_for_department":"Directing","name":"Shigeki Awai","original_name":"Shigeki Awai","popularity":2.786,"profile_path":null}],"guest_stars":[]},{"air_date":"1998-09-02","episode_number":23,"episode_type":"standard","id":1324194,"name":"Landing... The Terrifying Dark Island","overview":"The group, along with Parn, Deedlit, Maar, Hobb, and Neese's parents arrive on Marmo and head towards Conquera, where the ceremony will take place. As they travel through the dark forest, the elves sense danger. Karla concludes that the group will disrupt the balance of power on Lodoss and decides to test them to see if they, as representatives of the light, are too strong. Maar and the warriors of the group get separated from the rest and are attacked by mud creatures sent by Karla. They are able to destroy them and return to help the others who are being attacked by gargoyles. Back on Lodoss, the main forces of Flaim, Kanon and Valis set out for Marmo, along with Queen Shiris who leads her dragon riders to support them. Unfortunately, Spark's group stumbles upon the final test: the awakened dragon Narse.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/hRuPJ2BdZI4MKJZa3DK3ZG0lLuh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-09-09","episode_number":24,"episode_type":"standard","id":1324195,"name":"The Witch... The One Who Maintains the Balance of Power","overview":"The group is unable to get around Narse, as the dragon is too powerful. Maar is about to be killed when Queen Shiris and the dragons riders of Highland appear. They engage the dragon allowing the group to press onwards to Conquera. Ashram prepares to move the Marmo citizens off the island to forge a new kingdom elsewhere away from Lodoss. Karla appears before the group and Spark learns of her nature. Karla offers them a choice: Sacrifice their lives and she will stop the resurrection of Kardis or they can choose to live and she will not stop it. Her reason is that by uniting Lodoss the balance of power is too far into the light and that darkness needs to be restored. Spark angrily refuses and they opt to save Lodoss with their own hands. Just as the dragon riders are about to be defeated Mycen appears and defeats Narse. The group approaches Conquera.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/kjSfDcxK0EdzOrs6FEuImiH7iME.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-09-16","episode_number":25,"episode_type":"standard","id":1324197,"name":"Decision... The Black Knight's Option","overview":"The resurrection is nearly complete. The group enters Conquera with Leylia using her senses to guide the group, but they are soon confronted by Ashram. Parn, Hobb, Deedlit, and Maar stay behind while an increasingly impatient Spark and the rest continue. Parn and Ashram engage in a swordfight as do Deedlit and Pirotess. Ashram explains his intentions of a safe home for the Marmo people. The reason behind the invasion was to escape their cursed island full of monsters and now Ashram intends to look for a safe place outside of Lodoss. They finish their fight and Ashram and Pirotess leave. Parn tells Hobb to follow his 'true hero' and Maar, looking to finish his ballad, joins him. The others reach a dead end but Garrack finds a secret staircase. At the bottom, they witness the near completion of the ceremony with Kardis having taken over Neese.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/wqIo9nShOgtrPec0sTfsUxwEzgj.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"637c485f156cc700ca031a0c","adult":false,"gender":2,"id":1067794,"known_for_department":"Directing","name":"Hayato Date","original_name":"Hayato Date","popularity":5.715,"profile_path":"/4LEd4MXPgNzJVqf9C4GznaIMOgW.jpg"},{"job":"Storyboard Artist","department":"Art","credit_id":"637c489ebb2602007fdd3881","adult":false,"gender":2,"id":1067794,"known_for_department":"Directing","name":"Hayato Date","original_name":"Hayato Date","popularity":5.715,"profile_path":"/4LEd4MXPgNzJVqf9C4GznaIMOgW.jpg"}],"guest_stars":[]},{"air_date":"1998-09-23","episode_number":26,"episode_type":"standard","id":1324198,"name":"Destruction... The Evil God Released","overview":"The ceremony is nearly complete; all that is required is to open the Doorway. The warriors attack Wagnard head-on but he casts dangerous spells that can kill in an instant. The magic users go around but are trapped by Karla. Slayn informs that they must remove Karla's circlet without killing her and Greevus warns that they must stop Wagnard from completing the final spell. Spark has calmed down and hatches a plan to use himself as a decoy with Garrack just behind him to deliver the final blow to Wagnard. Garrack charges just before Spark and sacrifices himself as the decoy allowing Spark to run Wagnard through, halting the spell. However, Karla was casting the same spell and Parn is too late in removing the circlet. The spell is finished, completing the resurrection ceremony. Magic spirits are released over Marmo and begin killing every living creature.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/qVRYUexx3md1aVymiVpoR1j8ULj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1998-09-30","episode_number":27,"episode_type":"finale","id":1324199,"name":"Hero... The Birth of a New Knight","overview":"The spirits are reaching the Lodoss mainland and begin killing the people there. King Etoh and a band of priests arrive to cast a protective light spell. Spark attempts to reach out to Neese but Kardis blocks him. In the spiritual plane, Naneel is confronted by Neese, her current reincarnation. Neese rejects Naneel and prays for Marfa to banish her, but this only strengthens Kardis. Spark is drawn into the spiritual plane and meets Neese and Naneel. He tells Neese he will never give up on her and he wants her the way she is. Neese then accepts Naneel into her and, as the Doorway, this act of benevolence surrounds the evil power and allows Marfa to descend. Marfa gives Spark a choice: Open the doorway allowing Marfa to be reborn and Lodoss can have eternal peace but Neese will be destroyed; or take back Neese and Lodoss will be as it was. He reasons that peace should be achieved by those who live there and opts to take back Neese. Neese is returned, Garrack is revived, and a new light shines over Marmo. Leylia collects Karla's circlet. At the celebrations, Parn is named the Knight of Lodoss and King Kashue finally awards Spark his knighthood.","production_code":"","runtime":24,"season_number":1,"show_id":72041,"still_path":"/xliAqP9YSkybOQUDSfgz0i7lPL5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":88978,"poster_path":"/rvN94OBKuMr2OLVmZ1SXTc4Yirn.jpg","season_number":1,"vote_average":10}}}