{
    "adult": false,
    "backdrop_path": "/6Qi3N4UMNpw5qMFYfq05KppupSC.jpg",
    "created_by": [],
    "episode_run_time": [],
    "first_air_date": "2017-01-30",
    "genres": [],
    "homepage": "",
    "id": 72356,
    "in_production": true,
    "languages": [],
    "last_air_date": "2024-01-30",
    "last_episode_to_air": {
        "id": 5078031,
        "name": "Episode 10",
        "overview": "",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2024-01-30",
        "episode_number": 10,
        "episode_type": "standard",
        "production_code": "",
        "runtime": 43,
        "season_number": 8,
        "show_id": 72356,
        "still_path": null
    },
    "name": "I Escaped To The Country",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 4,
            "logo_path": "/uJjcCg3O4DMEjM0xtno9OWFciRP.png",
            "name": "BBC One",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 80,
    "number_of_seasons": 8,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "I Escaped To The Country",
    "overview": "Series celebrating the house-buying success stories of people who went on to purchase a rural property they were introduced to on their original Escape to the Country journey.",
    "popularity": 4.217,
    "poster_path": "/ef9ZzS7hGPNEXDJOqY466dDWYTa.jpg",
    "production_companies": [
        {
            "id": 47773,
            "logo_path": "/d1mGbi5yBtaFr5lz8FO4UWMnsXx.png",
            "name": "Boundless",
            "origin_country": "GB"
        }
    ],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2017-01-30",
            "episode_count": 10,
            "id": 89547,
            "name": "Season 1",
            "overview": "",
            "poster_path": "/ef9ZzS7hGPNEXDJOqY466dDWYTa.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2018-01-02",
            "episode_count": 10,
            "id": 238457,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2018-11-05",
            "episode_count": 10,
            "id": 238489,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2020-01-06",
            "episode_count": 10,
            "id": 238490,
            "name": "Season 4",
            "overview": "",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2020-11-09",
            "episode_count": 10,
            "id": 207326,
            "name": "Season 5",
            "overview": "",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        {
            "air_date": "2022-01-03",
            "episode_count": 10,
            "id": 238455,
            "name": "Season 6",
            "overview": "",
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        {
            "air_date": "2022-10-24",
            "episode_count": 10,
            "id": 374397,
            "name": "Season 7",
            "overview": "",
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        {
            "air_date": "2024-01-02",
            "episode_count": 10,
            "id": 374398,
            "name": "Season 8",
            "overview": "",
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        }
    ],
    "spoken_languages": [],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "59427893c3a3686c0d00be91",
            "air_date": "2017-01-30",
            "episodes": [
                {
                    "air_date": "2017-01-30",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1329059,
                    "name": "Worcestershire/Dorset",
                    "overview": "Nicki Chapman is reunited with a couple she first met a few years ago when they were house hunting in the Worcestershire countryside and bought one of the properties they viewed together. Unfortunately, just weeks after moving in, their dream home was destroyed by a fire and they had to spend three years rebuilding it. Nicki now returns to see the complete transformation they have managed to achieve and how, in the aftermath of such turmoil, they are now enjoying life in their new country home. Later, Nicki also revisits a property-hunting couple she met in Dorset, whose new house in the heart of a village has opened doors into the thriving community.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-31",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1329062,
                    "name": "East Midlands",
                    "overview": "Nicki Chapman heads to Derbyshire's Peak District to revisit a house-hunting couple who have used their interior design flair to beautifully refurbish a property she first took them to and they ended up buying. After being impressed by their 'country house' inspired décor, she takes in the dramatic setting of the National Park, where her house hunters now enjoy walking and landscape photography. Later, Nicki crosses the border into Nottinghamshire and catches up with a retired teacher who has been loving life in her Escape cottage for the past few years. Nicki sees how her move has been a springboard to a new social life and allowed her to realise a long-harboured dream of owning a narrowboat.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-01",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1329063,
                    "name": "Wales",
                    "overview": "Jules Hudson catches up with house-hunting couples who have successfully made the leap to the Welsh countryside. First, he pays a visit to some of his most enthusiastic escapees, who bought one of the rural properties he showed them few years ago. As well as admiring how they have made their mark on their country home, Jules sees not only that ploughing their efforts into self-sufficiency keeps them fit, but also how swapping homemade produce with neighbours keeps their community spirit alive and well. Later, Jules drops in on a couple who, since their house search together, have had a lifestyle overhaul and are reaping the rewards of setting up their mountain biking and holiday let business.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-02",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1329064,
                    "name": "West Country",
                    "overview": "Nicki Chapman visits the West Country to be reunited with couples she helped make the momentous step of moving from town to country. Nicki catches up with her Wiltshire house buyers, now happily living in the character home they first saw together. She sees how volunteering in the local shop and forging ahead with new hobbies has put them at the heart of village life. Later, Nicki meets her property purchasers in Somerset, who had emotional reactions to all three houses she initially showed them. Nicki is impressed by how they have decorated the one they chose to buy. The house has also allowed them to grow their successful dog grooming business, now a popular port of call for canines in their local community.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-03",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1329065,
                    "name": "East of England",
                    "overview": "Alistair Appleton catches up with two house-hunting couples who made the successful leap of relocating from the city to the east of England countryside. First he revisits some of his Cambridgeshire house buyers, now happily living in the character home he first showed them. Besides holding down their new teaching jobs, they also organise a weekly village quiz night, which Alistair finds is extremely popular with the local community. Later, Alistair heads to north Lincolnshire to call on a couple who successfully bought their country home close to the family farm. He is impressed by how they have made their decorative mark on the living spaces and sees how excited they are at the prospect of bringing up their young family in such a relaxed rural setting.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-06",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1329066,
                    "name": "Cornwall",
                    "overview": "Nicki Chapman visits Cornwall to be reunited with a teacher she first met a few years ago, when the clock was ticking to find a perfect home before the new school term started. Nicki hears how she is loving life in the cottage they first saw together and explores the local beauty spots she enjoys after a busy school day.\n\nNicki also visits a retired couple she helped find a Cornish retreat after they made surprise changes to their property wishlist. Nicki sees how they have added their own personal touch to their new home, which gives them beautiful countryside on the doorstep for walks with their beloved dogs.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-07",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1329067,
                    "name": "Welsh Borders",
                    "overview": "Jules Hudson catches up with house hunters who left behind their hectic working lives in Brighton and relocated to Herefordshire. On their £300,000 budget, they successfully bought one of the homes they saw after a big rethink on their original property wishlist. Jules sees how their new home and the village location has had such a positive impact on their wellbeing and feeling part of local life.\n\nJules also drops in on some of his former house hunters who had a £365,000 budget and are now happily living in one of the houses he first showed them. He finds out why they are delighted to have made the lifestyle leap to rural Monmouthshire.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-08",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1329068,
                    "name": "North Yorkshire",
                    "overview": "Jonnie Irwin heads to North Yorkshire to be reunited with his former house hunters who, with their £850,000 budget, wanted to escape London to be closer to family and raise their own young children in the country. They acted decisively and bought one of the country properties Jonnie first showed them. Despite being in the early months of settling in, Jonnie finds them all in great spirits.\n\nTheir children love the great outdoors and are happy in their new school, and the parents are keen to get to grips with making home-grown produce. With that in mind, Jonnie takes them to Beningbrough Hall's community orchard, where they get a workout from squeezing freshly pressed apple juice.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-09",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1329069,
                    "name": "East Sussex",
                    "overview": "Jonnie Irwin revisits a couple he helped on their initial property search in Sussex. Jonnie returns to the house he showed them that they ultimately bought for under their £600,000 budget. The couple each had very strong ideas on what they wanted from their move to the country, with one of them determined to run a bed and breakfast from their new home. Building work is in progress, so Jonnie sees how their vision will provide accommodation for the business without intruding on their personal living space.\n\nAs well walking their new dog in the surrounding countryside, Jonnie and his house buyers visit one of the award-winning vineyards Sussex is home to. After harvesting grapes and eating more than a few, they sample the array of wines produced there.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-10",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1329070,
                    "name": "Norfolk",
                    "overview": "Alistair Appleton catches up with two couples whose property searches helped them make a successful leap to the Norfolk countryside. First he revisits some house buyers who had a £400,000 budget and are now loving life in the home they bought. Over a cup of tea in their kitchen, Alistair finds out what creative changes they have made to the interior and how much pleasure they have had discovering new country walks from their doorstep.\n\nAlistair then meets up with a married couple of musicians who, on their initial house hunt, had quickly cast aside their property criteria when they fell in love with one particular Norfolk village. Alistair tracks them down at that village's community shop, where they now volunteer, to find out what happened next.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 1,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 89547,
            "poster_path": "/ef9ZzS7hGPNEXDJOqY466dDWYTa.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "61d550f61b722c5dbb3e48b8",
            "air_date": "2018-01-02",
            "episodes": [
                {
                    "air_date": "2018-01-02",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3429534,
                    "name": "Suffolk/Kent",
                    "overview": "Jonnie Irwin revisits house buyers who haven't looked back since relocating to the countryside. His first stop is Suffolk, where he finds his the buyers happily immersed in keeping chickens and bees and taking their new dogs to the local dog agility club. Later, Jonnie heads to Kent and marvels at the new design and decor the escapees have added to their property, before heading to the beach close by where they enjoy regular moments together as a family.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-03",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3429536,
                    "name": "Dorset",
                    "overview": "Sonali Shah revisits the maritime county of Dorset to be reunited with her house hunters who had a £500,000 budget to retire to a property with coastal views and have set up home in one of the houses Sonali originally showed them. She discovers how they have put their own personal stamp on it and how it provides the writer's retreat one of them dreamed of. Sonali's house buyers also take her to Abbotsbury Swannery, one of their favourite Dorset beauty spots, as well as Bridport, where she drops in on a thriving local knitting group, a port of call for friendly chat over the clacking of needles.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-04",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3429541,
                    "name": "Devon/Somserset",
                    "overview": "Nicki Chapman is in the west country revisiting house buyers who have successfully made the leap to a new life in the country. First she catches up with an entrepreneurial couple who moved into their property in the Devon countryside. She discovers how they are managing to balance running a holiday-let business alongside their newly renovated family home. Later she heads to rural Somerset, where a couple has made some impressive architectural changes to their country property and are enjoying a busy retirement immersing themselves in village life.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-05",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3429542,
                    "name": "Norfolk/Cumbria",
                    "overview": "Alistair Appleton revisits house buyers who made their escapes to the country and radically changed their new properties and lifestyles in the process. First he heads to Norfolk, where he discovers his buyers are now committed owners of a cattery. He sees how, while business is booming, they are in the throes of completely supersizing the country home Alistair first showed them. Later he catches up with a house buyer in the Cumbrian countryside who has made her interior design mark in the property they first viewed together. Alistair is happy to learn how her escape from the city of Edinburgh sparked a career change, a flourishing new relationship and a passion for new country pursuits.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-08",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3429543,
                    "name": "Dorset/Derbyshire",
                    "overview": "Sonali Shah visits house buyers who moved to the country in Dorset and Derbyshire, catching up with a couple she helped to make the leap from a suburban town to the beautiful Dorset countryside. They have subsequently redressed their work-life balance and their vast, historic home has also become a rural getaway for visiting friends and family. The visit ends at the village pub, where one of them now works part-time serving the locals. Later, Sonali travels to Derbyshire where she is reunited with a buyer who moved to the county to be closer to her son and grandchildren. To experience a little of their country life, Sonali accompanies them on family outing to the National Tramway Museum in Crich.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-09",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3429544,
                    "name": "Herefordshire",
                    "overview": "Nicki Chapman returns to Herefordshire to catch up with her house-hunters, discovering how their plans of running holiday let business have come to fruition and how they've also become a firm port of call for the local wildlife. Whilst in the area, Nicki visits Ledbury Country Market and meets the committed food producers who are behind its ongoing success.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-10",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3429545,
                    "name": "Suffolk",
                    "overview": "Jonnie Irwin is reunited with his avid equestrian house hunters in Suffolk. Since buying the unassuming property Jonnie showed them, the couple have ploughed their efforts into dramatically transforming it to suit their needs. They now enjoy the freedom of keeping horses on their own land. Whilst in the county, Jonnie visits the coastal village of Dunwich, which over the centuries has been gradually taken by the sea.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-11",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3429546,
                    "name": "Somerset",
                    "overview": "Jules Hudson returns to rural Somerset to be reunited with a retired couple, now happily living in the character home they all first saw together. As well as seeing the impressive alterations they've made to their country home, Jules discovers how they have immersed themselves in community life, including returning to work as a local church minister. Jules also catches up with other house buyers, who despite a hectic working life and serious setbacks along the way, have managed to make their personal mark on the property they purchased.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-12",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3429547,
                    "name": "Welsh Border",
                    "overview": "Alistair Appleton revisits the Welsh Border region and is reunited with a house hunting couple who originally had a ú475,000 budget and serious ambitions to start a smallholding. Within just a few years of moving into one of the properties Alistair showed them, they've not only transformed parts of their new home, but are also making impressive strides towards self-sufficiency on their land. Whilst in the region, Alistair takes in the countryside and heritage of the Welshpool and Llanfair Light Railway.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-13",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 3429548,
                    "name": "Wiltshire",
                    "overview": "Jules Hudson is in the Wiltshire countryside catching up with his house buyers. First, he revisits a fun-loving couple who have made radical changes to their property and transformed the garden not only to house their tortoises, but also a miniature tank 'battleground'. Later, Jules meets up with a buyer who hadn't even viewed a property before she bought her Escape house. He discovers how her country home has allowed her to live the village 'high life' and meets all her new friends at a garden croquet party.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 2,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 238457,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "61d58061e194b0004144a0fd",
            "air_date": "2018-11-05",
            "episodes": [
                {
                    "air_date": "2018-11-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3430084,
                    "name": "Wye Valley",
                    "overview": "Jonnie Irwin visits the Wye Valley, where he is reunited with two of his house-buying couples. First he meets his recent escapees who snapped up the country home he showed them for their £650,000 budget. Jonnie discovers their plans for their hilltop property and their glamping business ambitions. Later, he catches up with his buyers from five years ago, who spent their £400,000 on one of the properties they viewed together. Jonnie is impressed by the decorative changes they have made and, while sitting for the community art group, sees the fulfilling lifestyle they are enjoying during retirement.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-06",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3430085,
                    "name": "Cornwall",
                    "overview": "Nicki Chapman heads to Cornwall to find out what happened next for some horse-loving house buyers who are now enjoying the freedom of having their horses on their own land and a better quality of life. First, Nicki catches up with a mother who invested her £450,000 budget in a Cornish character cottage for her children and plenty of acreage for their animals. Later, she drops in on a couple with an original budget of £350,000 who, since moving into their dream rural home with their horses seven years ago, are making country living pay for itself with a holiday let and a successful dog-grooming business.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-07",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3430086,
                    "name": "Carmarthenshire and Argyll",
                    "overview": "Jules Hudson's revisit journey takes him to two truly rural destinations - west Wales, and Argyll and Bute. First Jules is reunited with a horse-loving couple whose £450,000 budget secured them one of the houses he showed them. It has only been weeks since they moved into their new home, but Jules is impressed by how they have already embraced the good life. He then visits Argyll and Bute, where another couple of escapees invested £350,000 in a home with a view and have grand plans to add eco-features and terraces to make the most of their stunning surroundings.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-08",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3430087,
                    "name": "Herefordshire",
                    "overview": "Sonali Shah is reunited with a couple who she helped move from Bristol to an idyllic home in the Herefordshire countryside on a £500,000 budget. After reminiscing about the emotional highpoints of their hunt together, Sonali sees for herself how they have settled into their beautiful rural home and how being close to the River Wye has paved the way to more time enjoying the great outdoors on the bikes. Sonali also turns her hand to making dinner for everyone in the local pub, a weekly event which her escapees have embraced as a way catching up with new-found friends.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-09",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3430088,
                    "name": "Devon",
                    "overview": "Nicki Chapman goes on a revisit tour of Devon, where she catches up with two different buyers who fell in love with the properties they viewed on their house hunt. First, Nicki catches up with a buyer on a £300,000 budget who found her dream country home just in time to start her new job in Plymouth. Nicki admires the stylish alterations she has made and takes in the breathtaking coastal location, a great place to de-stress after a commute. Later, Nicki drops in on a buyer whose emotional house hunt on £340,000 resulted in her buying a perfect rural retreat close to family where she has now started a bold new life chapter.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3430089,
                    "name": "Cumbria",
                    "overview": "Jonnie Irwin is in Cumbria, where he catches up with two couples who found their perfect country homes during their property search. First, Jonnie reunites with a retired health professional couple with a £475,000 budget and sees how, since moving in 2012, they have redecorated their period home, are enjoying cultivating their large garden and are forging friendships in the community at the local pub. Later, Jonnie catches up with an ambitious couple who had £500,000 to spend, and sees how their character property has allowed them to begin realising their dream of starting a glamping business.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-13",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3430090,
                    "name": "Monmouthshire",
                    "overview": "Jules Hudson is in Monmouthshire revisiting one of his couples who were armed with a £500,000 budget and moved into one of the houses they all viewed together. He discovers how, since moving in 2010, they are loving life in their Welsh country property and are enjoying the benefits of their thriving community. Jules also heads to Abergavenny's indoor market with them and later marvels at his buyer's bowling skills, which have earned her a place in the county team.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-14",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3430091,
                    "name": "Devon and Shropshire",
                    "overview": "Alistair Appleton starts his journey in Devon and visits a mother and daughter who moved into their dream property back in 2013 after a lucky windfall boosted their budget to £620,000. He sees their how their country home is a perfect fit as a writer's retreat, a haven for horses and a space for two generations to live together in harmony. Later Alistair revisits his Shropshire house buyers who had a £500,000 budget and are now happily united in the property he showed them. After a difficult period of living apart for work, Alistair is relieved to find they have achieved their ideal work-life balance.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-15",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3430092,
                    "name": "Monmouthshire and Peak District",
                    "overview": "Sonali Shah revisits two of her house-buying couples who have recently settled into their country homes. First, she drops in on her escapees whose £230,000 budget afforded them their very first home together in the Monmouthshire countryside. She is surprised to see how it's all change in the property with the arrival of their baby and a new puppy. Sonali then heads to the Peak District to be reunited with a couple who now call one of the properties Sonali showed them for their £450,000 budget home. They also take in the dramatic splendour of the Ilam Park estate.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-16",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 3430093,
                    "name": "Northumberland",
                    "overview": "Alistair Appleton heads to Northumberland to revisit his buyers with a £475,000 budget who have moved into one of the houses he showed them. He discovers how their characterful home has allowed them to kick-start their holiday lettings business ambitions. As well as getting the inside track on the thriving tourist trade around Hadrian's Wall, Alistair and his escapees head to the Roman fort of Vindolanda, where excavations have revealed exciting archaeological discoveries.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 238489,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "61d5806e497560001c11bb52",
            "air_date": "2020-01-06",
            "episodes": [
                {
                    "air_date": "2020-01-06",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3430094,
                    "name": "Shropshire & Herefordshire",
                    "overview": "Jules Hudson heads to rural Shropshire to catch up with a couple who spent £425,000 on one of the houses they viewed during their property hunt. He sees for himself how they’ve made it their own and how it has opened doors to a healthier and happier lifestyle. He also revisits an intrepid buyer who spent £450,000 budget on a Herefordshire property and is impressed by how she has made a success of her work-life balance.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-07",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3430095,
                    "name": "East of England",
                    "overview": "Sonali Shah catches up with one escapee who was completely sold on one of the Suffolk houses from his property search and bagged it with his £490,000 budget. She is impressed by how he has transformed not just the property but also his lifestyle, working as a wildlife conservation volunteer. Sonali also revisits her couple who invested £700,000 in a beautiful family home in Cambridgeshire that delivers the quality of life they wanted for their young children, with countryside close by as well as a village community.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3430096,
                    "name": "The Highlands",
                    "overview": "Jules Hudson revisits two couples who moved the length of the UK chasing the views and wildlife of the Scottish Highlands. Jules heads close to Loch Ness and is stunned by what one couple have achieved with their stylish property. He also drops in on a nature-loving couple who bought a property in his line up that met their £325,000 budget. However, he soon discovers that when their family circumstances changed, they had to make a bold decision regarding their dream home.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-09",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3430097,
                    "name": "Isle of Wight",
                    "overview": "Jonnie Irwin revisits the beautiful Isle of Wight and is reunited with a house-hunting couple who originally had grand ambitions to carve out a new life for themselves and their youngest son whilst tapping into the island’s tourist trade. Eight years on from their original property search, Jonnie discovers that they have gone above and beyond their original plan, creating a magnificent new home and a successful, unique enterprise that supports the whole family. Away from the business side of things, they all take to the water on board the couple’s boat, where Jonnie experiences the simple and slower-paced pleasures of their island escape.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-10",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3430098,
                    "name": "Somerset & Shropshire",
                    "overview": "Jules Hudson travels to beautiful rural pockets in the counties of Somerset and Shropshire as he catches up with past house hunters who have opened doors to a better quality of life in the countryside. First, Jules calls in on a couple of rolling stones who are now living the country dream in Somerset in the beautiful, character property they snapped up on their house hunt in the summer of 2018. Then it's up to the wonderful Shropshire hills to meet a retired policeman who wanted to get as far away from the hustle and bustle of city life as possible. Jules discovers that his new life, in a gorgeous cottage with breathtaking views, would be nothing with the support of neighbours.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-13",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3430099,
                    "name": "Worcestershire and Gloucestershire",
                    "overview": "Jules Hudson catches up with some escapees who wasted no time in buying one of the beautiful country properties they viewed on their house-hunt and now call Worcestershire home. He’s wowed by the changes they’ve made to their new home and discovers how a more rural lifestyle is suiting them down to the ground. Jules then revisits one of his buyers who has made the leap from London to Gloucestershire and has used her interior design skills to create what she calls her first proper home. Jules also finds out how the local polo club is a place where she can kick back and enjoy good friendship and sporting fun.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-14",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3430100,
                    "name": "Cornwall and Norfolk",
                    "overview": "Sonali Shah revisits her house-buying couples and finds out what happened next after their Escape property hunts together. First, she catches up with her buyers in Cornwall who used their £350,000 budget to snap up one of the houses she showed them. She sees how they’re loving their new dream home and are embracing a healthy, happy lifestyle outdoors. Sonali also drops in on her equestrian escapees whom she’d helped on their Norfolk property hunt and discovers where they decided to buy with their £850,000 budget.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-15",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3430101,
                    "name": "South Wales",
                    "overview": "Jules Hudson revisits more house buyers who successfully moved to the country in South Wales. He discovers how a dynamic RAF couple bought one of the homes he showed them. To thank him, they put him through his paces with some daredevil outdoor antics. Jules then drops in on an escapee couple who overcame struggles in buying their perfect property but kept plenty of change from their £400,000 budget and now live in a stunning but unexpected location.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-16",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3430102,
                    "name": "Derbyshire & Shropshire",
                    "overview": "Ginny Buckley heads into the great British countryside to discover how rural retirement plans are panning out for two couples. First, she makes her way to Derbyshire's Peak District to meet a husband and wife who bought one of the beautiful properties they were introduced to on their 2018 Escape to the Country journey. They had high hopes for a garden with a pond, but Ginny finds out that pond life has now taken a back seat as they've welcomed a new member to the family. Later, she makes her way south to catch up with a fun-loving pair who originally planned to move to the Shropshire countryside. Ginny finds that their leap to the countryside may have landed them in a different spot, but it's still a far cry from their former lives in the city suburbs.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-01-17",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 3430103,
                    "name": "Somerset & Leicestershire",
                    "overview": "Jules Hudson revisits house buyers who have successfully established new lives in the countryside. First, he finds himself back in Somerset with a couple whose rural aspirations needed to accommodate their own needs, plus those of their parents. Visiting the day before a local beer and cider festival, he earns a brew by helping the neighbours set up for the event, but not before checking out the wonderful home he helped them to find. Later, Jules travels over towards the east of the country to meet a husband and wife at their impressive new home, where he discovers how their move away from a large urban town has helped strengthen family ties.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "",
            "id": 238490,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "6124d4263a96500046ee1dfc",
            "air_date": "2020-11-09",
            "episodes": [
                {
                    "air_date": "2020-11-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3429512,
                    "name": "Bedfordshire & Herefordshire",
                    "overview": "Sonali Shah finds out whether one couple succeeded in creating their own back-garden pub, and in Herefordshire she looks around a stunning renovation of a house from the 1700s.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3429513,
                    "name": "Staffordshire & Devon",
                    "overview": "Jules Hudson revisits a family of house-hunters who have made their Devon dream a reality whilst embarking on an epic restoration of a historic home.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3429514,
                    "name": "Dorset",
                    "overview": "Nicki Chapman catches up with past house-hunters who have found a better quality of life on the Dorset coast.\n\nEnglish",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-12",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3429515,
                    "name": "Devon",
                    "overview": "Jonnie Irwin catches up with the entrepreneurial couple whose grand aspirations involved accommodating a pack of alpacas, a grand piano and paying guests in a rural Devon home.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-13",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3429516,
                    "name": "Isle of Wight & South West Wales",
                    "overview": "Jules Hudson catches up with two sets of entrepreneurial house-hunters who had grand plans to make an income from their new homes in the countryside.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-16",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3429517,
                    "name": "North Yorkshire & Welsh Borders",
                    "overview": "Jules Hudson and Nicki Chapman visit former Escape to the Country house-hunters to find out what happened next with their planned country moves.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-17",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3429518,
                    "name": "Derbyshire & West Sussex",
                    "overview": "Jules Hudson heads into the great British countryside and Ginny Buckley is bound for the coast as they discover how grand plans to escape to the country have panned out for two couples.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-18",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3429519,
                    "name": "Wiltshire & Hampshire",
                    "overview": "Sonali Shah find out whether previous house-hunters found their dream homes. In Hampshire, she finds that one buyer has created the perfect setting for meditation.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-19",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3429520,
                    "name": "Norfolk",
                    "overview": "Jonnie Irwin revisits a couple who have found a new home and started a new business in the Norfolk countryside.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-11-20",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 3429521,
                    "name": "Welsh Borders & Devon",
                    "overview": "Nicki Chapman catches up with two sets of buyers whose rural aspirations were driven by a spirit of adventure, including two surfing enthusiasts who wanted to relocate to the Devon coast.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "",
            "id": 207326,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        },
        "6": {
            "_id": "61d54fa531644b41a9ad1658",
            "air_date": "2022-01-03",
            "episodes": [
                {
                    "air_date": "2022-01-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3429522,
                    "name": "Welsh Borders",
                    "overview": "Jules Hudson reunites with house hunters who turned their backs on city life in London and Bristol to make a move to the Welsh Borders.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": "/eOAxk7JOK335OIzMiURjagCqrEw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3429524,
                    "name": "Shropshire",
                    "overview": "Jonnie Irwin hears how a couple have completely rebuilt their home following a devastating fire that destroyed the beloved mystery house they bought in 2017.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-05",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3429525,
                    "name": "Dumfries and Galloway",
                    "overview": "Alistair Appleton is in the rural wilds of Scotland, catching up with house hunters who have carved out new lives in the beautiful countryside of Dumfries and Galloway.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3429526,
                    "name": "West Country",
                    "overview": "Nicki Chapman visits Somerset and Dorset, catching up with two couples who have found a better quality of life in the countryside.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-07",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3429527,
                    "name": "Isle of Arran and North Yorkshire",
                    "overview": "Alistair Appleton visits former Escape to the Country house hunters to find out what happened next with their planned rural moves.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-10",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3429528,
                    "name": "Gloucestershire",
                    "overview": "Jonnie Irwin visits past house hunters who relocated to Gloucestershire, including an entrepreneurial couple who have branched out from their original idea for a glamping business.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-11",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3429529,
                    "name": "Staffordshire and Hampshire",
                    "overview": "Sonali Shah retraces her steps with two sporty couples in the counties of Staffordshire and Hampshire, seeing how they have put their own stamp on their new rural homes.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-12",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3429530,
                    "name": "Suffolk and Shropshire",
                    "overview": "Jules Hudson reacquaints himself with a couple who, back in 2016, were seeking a new life in Shropshire. Five years later, they have finally found their perfect home - in a different county.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-13",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3429531,
                    "name": "Norfolk",
                    "overview": "Sonali Shah revisits two couples who relocated to Norfolk after appearing on Escape to the Country.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-01-14",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 3429532,
                    "name": "East Anglia",
                    "overview": "Seven years on from their property search together, Jonnie Irwin travels to East Anglia for a reunion with two former house hunters from London.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 6,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 6",
            "overview": "",
            "id": 238455,
            "poster_path": null,
            "season_number": 6,
            "vote_average": 0
        },
        "7": {
            "_id": "65a5c47b97a4e6012e4f28b1",
            "air_date": "2022-10-24",
            "episodes": [
                {
                    "air_date": "2022-10-24",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 5078043,
                    "name": "Devon",
                    "overview": "Nicki Chapman reunites with escapees who have made new lives for themselves in rural Devon.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/8DBdLGwyIwgvtl4GVLJ9XneNpYn.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-25",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 5078042,
                    "name": "Norfolk",
                    "overview": "Jules Hudson reunites with a family he met in 2021, finding that one of the houses he showed them, which they said was everything they didn’t want, has now become their perfect escape.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/bwP8b5IpN9J2HY44gIQrZlaAc0F.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-26",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 5078041,
                    "name": "Wiltshire",
                    "overview": "Denise Nurse and Alistair Appleton reunite with homebuyers they first met a decade ago.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/wCJEeCTBvyzJnHyV6iksY0VPzpG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-27",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 5078040,
                    "name": "Cotswolds and Shropshire",
                    "overview": "Nicki Chapman reconnects with past escapees in the Cotswolds and Shropshire, finding out what happened to a couple who wanted to open a cookery school in the countryside.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/jKLPEkvQKsONvFUcv3q7ba8hUR.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-28",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 5078039,
                    "name": "Welsh Marches and Devon",
                    "overview": "Sonali Shah retraces her steps in the Welsh Marches as she meets up with a pair of former escapees who are happily living their best lives in one of the fabulous properties she showed them in 2021.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/vYEGzSm5nXOMCY2pCysFRI8Ym7U.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-31",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 5078037,
                    "name": "Somerset",
                    "overview": "Briony May Williams and Sonali Shah catch up with two couples who wanted to relocate to Somerset in order to live closer to family.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/sgmxsBm3SJLuyM1pfTpTmVDej4L.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-01",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 5078033,
                    "name": "Scotland",
                    "overview": "Nicki Chapman catches up with escapees who found dream homes with spectacular views on Scotland’s west coast.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/b2vXeevbZJV0nVgp3Nkq2bsjiq6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-02",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 5078034,
                    "name": "South Wales",
                    "overview": "Alistair Appleton returns to Wales to catch up with two couples whose interests and hobbies helped them settle swiftly into their new communities.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/6u4RkeX20h6ZycPaqj07ofdPjOG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-03",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 5078035,
                    "name": "The Midlands",
                    "overview": "Jules Hudson and Steve Brown revisit former house-hunters in the Midlands. One couple's home is now a lovely Grade II listed barn conversion.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/yPEacT6kdF0HVqpmoG5FeF2vg33.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-11-04",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 5078036,
                    "name": "West Country",
                    "overview": "Sonali Shah heads for the West Country counties of Cornwall and Devon to catch up with former house-hunters who have settled there.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 7,
                    "show_id": 72356,
                    "still_path": "/p01popPO7Fr1D6uuKh9Wn3kw1Kr.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 7",
            "overview": "",
            "id": 374397,
            "poster_path": null,
            "season_number": 7,
            "vote_average": 0
        },
        "8": {
            "_id": "65a5c493f74f5f012868a436",
            "air_date": "2024-01-02",
            "episodes": [
                {
                    "air_date": "2024-01-02",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 5078006,
                    "name": "Devon and Hampshire",
                    "overview": "Nicki Chapman and Ginny Buckley reconnect with couples who fled the capital.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": "/5CsUIbr5ucjP5GUWN5I52sbzLaG.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-03",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 5078007,
                    "name": "Herefordshire Borders and North Wales",
                    "overview": "Alistair Appleton and Denise Nurse catch up with some adventurous women who have found fulfilment in the rural borderlands of Wales.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": "/nH34reQH7lvGH4lilmGtLCigRu7.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 5078008,
                    "name": "Derbyshire and Devon",
                    "overview": "Nicki Chapman makes the 200-mile journey from Derbyshire to Devon.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": "/3PEmduQKJ2iWoxF0j0x6fx07JVy.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-09",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 5078010,
                    "name": "West Wales and Yorkshire",
                    "overview": "Jules Hudson follows the unexpected journey of one couple and a homecoming for another.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": "/6wjWz0KsnuDO0O9LCV2vIII8Hmm.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-15",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 5078012,
                    "name": "Norfolk and Oxfordshire",
                    "overview": "Jules Hudson dives into the wondrous world of barn conversions in this special revisit.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": "/zqqNhW9MzkzLnDkPooEW8fSHm3x.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-16",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 5078017,
                    "name": "Argyll & Bute and Moray",
                    "overview": "Sonali Shah and Jules Hudson return to the Scottish Highlands.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": "/maQnLMYoBC6VhHfa2oxDdnF9wfw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-22",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 5078024,
                    "name": "Dorset and Wiltshire",
                    "overview": "Alistair Appleton is back to meet some accomplished athletes following their successful house-hunting challenges in the countryside.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-23",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 5078027,
                    "name": "Monmouthshire and Gloucestershire",
                    "overview": "Sonali Shah visits both sides of the Wales-England border, with one couple looking to get away from it all and the other wanting to get stuck in the thick of it.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-29",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 5078030,
                    "name": "Episode 9",
                    "overview": "",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-01-30",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 5078031,
                    "name": "Episode 10",
                    "overview": "",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 8,
                    "show_id": 72356,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 8",
            "overview": "",
            "id": 374398,
            "poster_path": null,
            "season_number": 8,
            "vote_average": 0
        }
    }
}