{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2015-10-11","genres":[{"id":10764,"name":"Reality"},{"id":99,"name":"Documentary"}],"homepage":"https://www.bbc.co.uk/programmes/p02d9xfp","id":72385,"in_production":false,"languages":[],"last_air_date":"2015-11-15","last_episode_to_air":{"id":2735585,"name":"Zambia","overview":"The three finalists face their sixth country and their final frontier - Zambia. Navigating the immense Zambezi River, the anglers fish alongside wild animals on land and in the murky water. They search the croc-infested waters for huge vundu catfish, fish local style from wobbly dugout canoes and try to catch Africa's equivalent to the piranha - the tiger fish. They must use everything they have learnt across their worldwide expedition as the judges will be looking for which one of them is the complete angler. Matt Hayes is joined by Charles Tembo, who has grown up on the banks of the Zambezi, whilst Ben Fogle is with the anglers every step of the way on their final journey. The fish here have adapted to survive in these dangerous waters. The anglers have just one week to prove they have the courage - and the skills - to do the same.","vote_average":0,"vote_count":0,"air_date":"2015-11-15","episode_number":6,"episode_type":"finale","production_code":"","runtime":60,"season_number":1,"show_id":72385,"still_path":null},"name":"Earth's Wildest Waters: The Big Fish","next_episode_to_air":null,"networks":[{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":6,"number_of_seasons":1,"origin_country":["GB"],"original_language":"en","original_name":"Earth's Wildest Waters: The Big Fish","overview":"A group of passionate anglers from the UK push their skills to the limit in six epic locations around the world. In each place, they face challenges for which they need to combine their own talents with local techniques to outwit the environment they find themselves in. The series explores the incredible world of fishing, looking at its variety of fish and their behaviour in distinct environments, and revealing surprising animals and stunning landscapes.","popularity":16.362,"poster_path":"/ffRVARzyD4MFDr1FFQwCfuOUaVl.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2015-10-11","episode_count":6,"id":89591,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0}],"spoken_languages":[],"status":"Ended","tagline":"","type":"Miniseries","vote_average":7,"vote_count":1,"season_data":{"1":{"_id":"59444f8c9251413fdd00202c","air_date":"2015-10-11","episodes":[{"air_date":"2015-10-11","episode_number":1,"episode_type":"standard","id":1329524,"name":"Iceland","overview":"Eight anglers embark on their first expedition to the wilderness of Iceland, where they brave extreme cold, wind and rain to fish in some of the most challenging conditions they have ever faced. In the north west, close to the Arctic Circle, the anglers fish from sea kayaks in the freezing fjord before learning to harvest cod using a traditional Icelandic technique. Further south, in a lake heated by volcanic vents, they fly-fish for some of the largest brown trout in the world. Matt Hayes is joined by local fishing expert Vala - she will help him judge which angler must leave the expedition whilst the rest journey on to the next location in their global expedition.","production_code":"","runtime":60,"season_number":1,"show_id":72385,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-18","episode_number":2,"episode_type":"standard","id":2735570,"name":"Cuba","overview":"The seven anglers leave the freezing cold of Iceland for the tropical heat of Cuba - but violent storms make conditions tough. In the salt flats a couple of hours south of Havana, they chase the ghostly bonefish, and in the Bay of Pigs they must fish Cuban-style - on simple tyre tube boats. Finally, on the Atlantic coast they are after giant tarpon - the silver king. Matt Hayes is joined by local fishing guide Lazaro to help him judge which angler leaves the expedition whilst the rest journey on to the next location in their global expedition.","production_code":"","runtime":60,"season_number":1,"show_id":72385,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-10-25","episode_number":3,"episode_type":"standard","id":2735571,"name":"Laos","overview":"The six anglers travel to their most remote destination yet - the mighty Mekong River in Laos. Here people fish for survival, not for sport. The anglers must battle the blistering heat and the ferocious currents of the widest rapids in the world. They will use traditional bamboo rods, throw themselves into the local way of throwing cast nets, and use all their own experience and sport fishing equipment to see if they can discover anything in the Mekong that the local methods cannot. Matt Hayes will be joined by Mr Mai, the headman of his village on Baan Hangkon Island, to judge which angler leaves the expedition whilst the rest journey on. The heat, the terrain and the simple equipment make this the toughest leg of the expedition yet.","production_code":"","runtime":60,"season_number":1,"show_id":72385,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-01","episode_number":4,"episode_type":"standard","id":2735573,"name":"Costa Rica","overview":"The five anglers head to Costa Rica to explore the Pacific Ocean and come face to face with some of the most incredible fish in the world. Fishing close to shore off the tip of the Osa Peninsula, the anglers seek out the fast and furious roosterfish and learn to lasso handlines like the locals in the rough surf, before heading offshore to seek the fastest fish in the world - the sailfish. The anglers have just one day to catch and tag this incredible fish, but things don't go quite according to plan.\n\nMatt Hayes adjudicates alongside local fishing expert Todd Staley, who has led the way in fish conservation in Costa Rica. Between them they must decide which angler to send home, whilst the rest make it through to the semi-final.","production_code":"","runtime":60,"season_number":1,"show_id":72385,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-08","episode_number":5,"episode_type":"standard","id":2735581,"name":"Canada","overview":"The four remaining anglers gear up for a semi-final of epic proportions, fishing for some of the biggest fish of their lives in British Columbia. Here, the whole ecosystem is driven by migrations of fish, so the anglers go on a journey of their own, fishing for Pacific salmon in the sea near Vancouver Island, fly-fishing for bull trout in the beautiful glacier-fed Upper Pitt River and taking on one of the legendary giants of the Fraser River - the white sturgeon. Matt Hayes will be joined by Yves Bisson, an expert Canadian fishing guide, to judge who goes through to the final.","production_code":"","runtime":60,"season_number":1,"show_id":72385,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-11-15","episode_number":6,"episode_type":"finale","id":2735585,"name":"Zambia","overview":"The three finalists face their sixth country and their final frontier - Zambia. Navigating the immense Zambezi River, the anglers fish alongside wild animals on land and in the murky water. They search the croc-infested waters for huge vundu catfish, fish local style from wobbly dugout canoes and try to catch Africa's equivalent to the piranha - the tiger fish. They must use everything they have learnt across their worldwide expedition as the judges will be looking for which one of them is the complete angler. Matt Hayes is joined by Charles Tembo, who has grown up on the banks of the Zambezi, whilst Ben Fogle is with the anglers every step of the way on their final journey. The fish here have adapted to survive in these dangerous waters. The anglers have just one week to prove they have the courage - and the skills - to do the same.","production_code":"","runtime":60,"season_number":1,"show_id":72385,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":89591,"poster_path":null,"season_number":1,"vote_average":0}}}