{"adult":false,"backdrop_path":"/2XSqGPAhIM2D6qvbSMC2iPvgmIW.jpg","created_by":[{"id":1299570,"credit_id":"583c0b0ec3a3687bb4009bca","name":"Michael Laurence","gender":2,"profile_path":null}],"episode_run_time":[60,90],"first_air_date":"1983-09-27","genres":[{"id":10766,"name":"Soap"},{"id":18,"name":"Drama"}],"homepage":"","id":727,"in_production":false,"languages":["en"],"last_air_date":"1986-06-06","last_episode_to_air":{"id":39610,"name":"Episode 22","overview":"The mystery man leaves a torn photo on a sleeping Stephanie's pillow. Jake and Jilly check out Revenge's form and Jilly urges Jake to forget the bet and leave now but he refuses. Jake tells Jilly a disqualification in the race would mean the other person won and Jilly gets an idea.\n\nDennis proposes to Cassie and he wants to borrow $60,000 from her to bet on the race to set up their future. Jilly takes the company payroll and prepares to leave on her own. At the airport she receives a phone call from the mystery man  who tells her we can still win this one. This prompts her to stay.\n\nJake and Stephanie sign a contract making the bet legal and Stephanie tells Jake she will have to redecorate the office when she wins. Dennis catches Jilly trying to drug Tara's Pride and when the police show up Jilly says she was asleep at the time.\n\nAfter Tara's Pride is moved Jilly offers Cassie $250,000 to tell her where the horse has been moved to.","vote_average":0,"vote_count":0,"air_date":"1986-06-06","episode_number":22,"episode_type":"finale","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null},"name":"Return to Eden","next_episode_to_air":null,"networks":[{"id":38,"logo_path":"/gHAm9zYjSX8IAJWuy2s4Du6onuo.png","name":"Network Ten","origin_country":"AU"}],"number_of_episodes":25,"number_of_seasons":2,"origin_country":["AU"],"original_language":"en","original_name":"Return to Eden","overview":"Stephanie Harper is rich but insecure 40 year old heiress with two failed marriages behind her. Stephanie believes that she has found true love with tennis pro Greg Marsden, but after the wedding, Greg promptly begins an affair with Stephanie’s best friend Jilly Stewart. Whilst on their honeymoon, Greg pushes Stephanie into a crocodile-infested swamp, and he and Jilly watch as she is apparently mauled to death. However, Stephanie miraculously survives and goes to an island clinic where she meets Dr. Dan Marshall, a brilliant plastic surgeon who uses his talents to repair her face and body. Using her new identity and fortune, she plots her revenge on Greg and Jilly and aims to take back what is rightfully hers.","popularity":14.605,"poster_path":"/c5tRlIwUgV5SRQLiM105D3hfegf.jpg","production_companies":[{"id":92748,"logo_path":null,"name":"Eden Productions Pty Ltd","origin_country":""}],"production_countries":[{"iso_3166_1":"AU","name":"Australia"}],"seasons":[{"air_date":"1983-09-27","episode_count":3,"id":2131,"name":"Season 1","overview":"Stephanie Harper, a rich twice divorced mother, marries handsome young Wimbledon Champ Greg Marsden. On their honeymoon in 'Eden', Greg, who has an affair with Stephanie's best friend Jilly Stewart, pushes Stephanie into a crocodile-infested river. Stephanie amazingly survives and begins to plots her revenge.","poster_path":"/87hGVOgj1ofIsyiGtHIj4D7WF8G.jpg","season_number":1,"vote_average":0},{"air_date":"1986-02-10","episode_count":22,"id":2132,"name":"Season 2","overview":"Seven years later, Stephanie Harper, Australia's richest woman, is happily married to her plastic surgeon husband. Her two children are now young adults, involved in the Harper 'empire' and in their own problems. The release of Jilly Stewart from prison starts a dramatic chain of events.","poster_path":"/g5wqGIIlENc0bTKsUnZivNQCf54.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.2,"vote_count":14,"season_data":{"1":{"_id":"525390dd19c295794028bf55","air_date":"1983-09-27","episodes":[{"air_date":"1983-09-27","episode_number":1,"episode_type":"standard","id":39588,"name":"Part 1","overview":"The central character in the show is Stephanie Harper, a rich heiress after her father passes away. As the series starts she has been divorced twice and is marrying Greg Marsden a champion tennis player several years her junior. Everyone except Stephanie can see that he is no good. He has been having an affair with Stephanie's best friend, Jilly Stewart. Whilst on their honeymoon at her family home Eden, Greg pushes Stephanie into a crocodile infested river. Everyone thinks she has perished but luckily she has escaped and is given a new body, face and name by plastic surgeon Dr Dan Marshall. She returns to Sydney as a changed woman, Tara Welles. There she discovers her two children, Dennis and Sarah, going to different boarding schools, and Greg and Jilly carrying on their affair in Stephanie's own mansion in town--but she does not let any of those people see her, nor get in touch with Bill McMaster, the EVP of the mining company she inherited. As this episode ends, she dresses as a fashion plate and walks boldly into the offices of a casting agency, challenging them to get her onto the cover of Vogue in six months.","production_code":"","runtime":null,"season_number":1,"show_id":727,"still_path":"/snpfrTRRsc3pZVVlL8NbMSiCJCO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1983-10-06","episode_number":2,"episode_type":"standard","id":39589,"name":"Part 2","overview":"Six months to the day after she boldly walked into the Joanna Randell Casting Agency, she is now Vogue's cover-girl sensation and has a very successful modeling career. Now she entices Greg Marsden, whom she meets at a charity match, to start dating her. But at the same time, Dan Marshall, in Sydney for a medical conference, has looked up his former patient and renewed their acquaintance. But Stephanie refuses Dan's advances and tells him (falsely) that she does not love him. For she has now enticed Greg Marsden to go to Eden with her--alone. Except that Stephanie calls Jilly and tells her shortly before her aeroplane leaves....","production_code":"","runtime":null,"season_number":1,"show_id":727,"still_path":"/jepUp52wIKFaBQl1SQzBHwKBGWy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1983-10-13","episode_number":3,"episode_type":"finale","id":39590,"name":"Part 3","overview":"Dan Marshall tracks down Stephanie, first by visiting Joanna Randell unannounced, then by visiting the Sydney house where he meets the two children, Sarah and Dennis. Stephanie, meanwhile, carefully drives Greg and Jilly to distraction until at last Greg tries to kill Jilly. Stephanie then reveals herself to them both. Greg tries at once to kill Stephanie, first by setting fire to a room in the main house at Eden, then in a swimming pool. But Jilly shoots him in the arm, making him bleed profusely. He then attempts to flee in an aeroplane. It crashes and he is killed. The next day the police arrive and arrest Jilly. The day following, another aeroplane lands--carrying Sarah, Dennis, and Dan.","production_code":"","runtime":null,"season_number":1,"show_id":727,"still_path":"/7j1ghIkNywgJLXuK1ZbUmtM0OLs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Stephanie Harper, a rich twice divorced mother, marries handsome young Wimbledon Champ Greg Marsden. On their honeymoon in 'Eden', Greg, who has an affair with Stephanie's best friend Jilly Stewart, pushes Stephanie into a crocodile-infested river. Stephanie amazingly survives and begins to plots her revenge.","id":2131,"poster_path":"/87hGVOgj1ofIsyiGtHIj4D7WF8G.jpg","season_number":1,"vote_average":0},"2":{"_id":"525390dd19c295794028bf65","air_date":"1986-02-10","episodes":[{"air_date":"1986-02-10","episode_number":1,"episode_type":"standard","id":39596,"name":"Episode 1","overview":"The series opens with Stephanie enjoying a relaxing swim with her husband Dan 7 years on from where the mini series ended. Stephanie discovers a box of old documents which could mean big changes in her life.\n\nJilly is released from prison after having served 7 years for Stephanie's attempted murder and the manslaughter of Greg. Jilly is taken to Eden where Stephanie announces the document states Jilly is her half sister. Stephanie tells her now they are half sisters she thinks she can forgive Jilly.\n\nBill McMaster tells Stephanie that a man called Jake Sanders is trying to take over Harper Mining. Stephanie offers Jilly $5, 000, 000 for her part of Max Harper's estate but Jilly is angered when Bill states she must sign a waver on any future claims. Jilly reluctantly signs.\n\nJilly goes to meet Jake and tells her she wants an alliance with him, as everything Stephanie owns is rightfully hers. Jake goes to visit a grave and it turns out he is Greg Marsden's brother.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390df19c295794028bfce","order":501,"adult":false,"gender":1,"id":187052,"known_for_department":"Acting","name":"Olivia Hamnett","original_name":"Olivia Hamnett","popularity":3.087,"profile_path":"/i1WHSoSushJA51t5tFWfFt5woio.jpg"}]},{"air_date":"1986-02-17","episode_number":2,"episode_type":"standard","id":39591,"name":"Episode 2","overview":"Stephanie is out riding when Jake turns up but Jake is no match on a horse for Stephanie. Jilly hears Dennis bad mouthing her and says she is moving out from Eden.\n\nJake shows up at Harper Mining and Stephanie tells him she has no intention of loosing the company. Phillip arranges for a prison friend of Jilly's called Olive to be released early. Stephanie agrees to give her daughter Sarah a job at Tara's and tells her son Dennis she knows he is in debt through gambling.\n\nBill's son Tom stars work at Harper Mining and Jake and Jilly set Dennis up so he is caught in a compromising position. Jilly is furious when Jake tells her he is not only going after Harper Mining but he has sets his sights on Stephanie too. Stephanie is having nightmares about the crocodile attack 7 years earlier.\n\nJilly meets Olive in a bar and gives her a gun and tells her to kill Stephanie. Olive shoots at Stephanie out riding and Stephanie's body lies motionless on the ground.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390df19c295794028bfce","order":501,"adult":false,"gender":1,"id":187052,"known_for_department":"Acting","name":"Olivia Hamnett","original_name":"Olivia Hamnett","popularity":3.087,"profile_path":"/i1WHSoSushJA51t5tFWfFt5woio.jpg"},{"character":"","credit_id":"525390df19c295794028bfe6","order":504,"adult":false,"gender":2,"id":75900,"known_for_department":"Acting","name":"John Lee","original_name":"John Lee","popularity":1.72,"profile_path":"/pl2InlMZlci4lIvL0P8YvhTgIPq.jpg"}]},{"air_date":"1986-02-24","episode_number":3,"episode_type":"standard","id":39593,"name":"Episode 3","overview":"Jake finds Stephanie's body and rushes her to the hospital where its revealed she will be OK. Jilly says she was with Phillip at the time of Stephanie's attempted murder. A recovered Stephanie reveals to the board that Jake now owns 18% of Harper Mining and another 2% would get him a place on the board.\n\nJilly and Stephanie agree to start over whilst all the time Jilly continues to plot against her.\n\nStephanie confronts Dennis after she discovers he has been using company funds to feed his gambling addiction and Dennis tells her she treats him more like an employee than a son. Dan gets jealous when Stephanie dances with Jake at a cooperate event. Olive arranges a crocodile to be put into Stephanie's swimming pool.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390df19c295794028bfce","order":501,"adult":false,"gender":1,"id":187052,"known_for_department":"Acting","name":"Olivia Hamnett","original_name":"Olivia Hamnett","popularity":3.087,"profile_path":"/i1WHSoSushJA51t5tFWfFt5woio.jpg"},{"character":"","credit_id":"525390df19c295794028bfe6","order":504,"adult":false,"gender":2,"id":75900,"known_for_department":"Acting","name":"John Lee","original_name":"John Lee","popularity":1.72,"profile_path":"/pl2InlMZlci4lIvL0P8YvhTgIPq.jpg"}]},{"air_date":"1986-03-03","episode_number":4,"episode_type":"standard","id":39592,"name":"Episode 4","overview":"Stephanie goes for a morning swim and comes face to face with the crocodile but Dan shoots it. Stephanie is left traumatized. Jilly is questioned by the police but as there is no evidence against her she is released. In Stephanie's absence Dennis tells the board he will be in charge of Harper Mining.\n\nRomance blossoms between Tom and Sarah.\n\nStephanie fully regresses back to the state she was after the crocodile attack 7 years a ago and sees a disfigured face in the mirror. When Dan arrives all he finds is a broken mirror and no Stephanie.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-03-10","episode_number":5,"episode_type":"standard","id":39594,"name":"Episode 5","overview":"Discovering Stephanie is mising Jilly finds her at Tara's and finds Stephanie thinks she is Tara Welles again. Jilly tells Jake Stephanie is in a bad way.\n\nStephanie agrees to undergo hynoptis to treat her trama and trys to strangle Jilly during it. This causes Stephanie to snap back into reality. Jilly warns Jake not to double cross her.\n\nDuring a dinner at Eden Jilly announces she is to marry Phillip again. During a midnight meeting at Harper Mining Jake pulls Stephanie close and kisses her but at the exact same moment Dan walks in.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390df19c295794028bfe6","order":504,"adult":false,"gender":2,"id":75900,"known_for_department":"Acting","name":"John Lee","original_name":"John Lee","popularity":1.72,"profile_path":"/pl2InlMZlci4lIvL0P8YvhTgIPq.jpg"}]},{"air_date":"1986-03-17","episode_number":6,"episode_type":"standard","id":39595,"name":"Episode 6","overview":"Dan rushes out and Stephanie throws a drink in Jake's face. Dan tells Sarah he thinks he is losing Stephanie. Stephanie agrees to have Jilly and Phillip's wedding at Eden. After the wedding Jilly runs straight into Jake's arms and gives him Stephanie's wedding gift to her a stash of Harper Mining shares.\n\nDan asks Stephanie to put him first and go on holiday with him and to meet him at the airport at 10 am the next day to which she agrees. Cassie alters the computer records for Jake so no one will know he got the extra shares from Jilly then announces he has enough shares for a seat on the board.\n\nThis new development causes Stephanie to miss the flight and Dan leaves alone. Jake asks the board who is in charge now!","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390df19c295794028bfe6","order":504,"adult":false,"gender":2,"id":75900,"known_for_department":"Acting","name":"John Lee","original_name":"John Lee","popularity":1.72,"profile_path":"/pl2InlMZlci4lIvL0P8YvhTgIPq.jpg"}]},{"air_date":"1986-03-17","episode_number":7,"episode_type":"standard","id":39600,"name":"Episode 7","overview":"The day arrives when Jake will be officially a board member and Jilly insists he must oust Stephanie right away. Jilly urges Stephanie to go after Dan.\n\nBill and Reena agonize over Tom dating Sarah, there is something Tom must know but Bill states Stephanie must know first. Dennis urges Stephanie to try and save her marriage to Dan and she agrees to go after him.  Jake tells Jilly he needs Stephanie to be away as long as possible and Jilly says she is sure she can arrange something. Dan and Stephanie enjoy a happy reunion.\n\nIn Stephanie's absence Jake calls an emergency board meeting, Stephanie will have to attend via the telephone but Olive cuts the line to the island where Dan and Stephanie are.\n\nStephanie rush to another phone line on the island but the fuel line to the boat has been cut and the boat explodes, in Stephanie's absence Jake is elected Chairman of Harper Mining.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390df19c295794028bfe6","order":504,"adult":false,"gender":2,"id":75900,"known_for_department":"Acting","name":"John Lee","original_name":"John Lee","popularity":1.72,"profile_path":"/pl2InlMZlci4lIvL0P8YvhTgIPq.jpg"}]},{"air_date":"1986-03-24","episode_number":8,"episode_type":"standard","id":39601,"name":"Episode 8","overview":"On hearing about the boat explosion Jake organizes a search. Bill forbids Tom from seeing Sarah anymore.\n\nJilly is fed up with Jake's obsession with Stephanie and pleads with him to allow her to run Tara's. Stephanie is found but there's still no sign of Dan. Olive tells Jilly that Stephanie's illegitimate son is still alive. Stephanie finds Dan alive and they return to Eden.\n\nJake gives control of Tara's to Cassie and an infuriated Jilly tells Cassie's boyfriend Dennis that she has also been seeing Jake.\n\nBill arrives at Eden to tell Stephanie that Tom is really her son and as hes about to tell her Tom and Sarah arrive to say they are engaged. Bill suffers a heart attack and as he lies on the floor he blurts out the truth.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390df19c295794028bfe6","order":504,"adult":false,"gender":2,"id":75900,"known_for_department":"Acting","name":"John Lee","original_name":"John Lee","popularity":1.72,"profile_path":"/pl2InlMZlci4lIvL0P8YvhTgIPq.jpg"}]},{"air_date":"1986-03-31","episode_number":9,"episode_type":"standard","id":39598,"name":"Episode 9","overview":"Bill is rushed to hospital and a heartbroken Sarah is forced to end her engagement. Jilly tells Jake of the latest news and demands her shares back in Harper Mining.  Dan tells Stephanie to be careful of Jilly as he thinks she is double crossing her. Jilly blames Cassie for everything that has gone wrong recently in Stephanie's life.\n\nStephanie confronts Jake and states she will regain control of her company again. She calls old friend Sheik Ahmal to enlist his help.  An angry Tom blames Stephanie for his split with Sarah.\n\nCassie decides to tell Phillip Jilly has been unfaithful. Dan asks Stephanie who Tom's father is but she refuses to say who it is. Sheik Ahmal arrives at Eden to help Stephanie.\n\nJake offers Stephanie the chance to join forces with him but when she refuses he says he will have her dismissed from the board. Dennis sides with Jake in the vote and Stephanie is dismissed.  Stephanie tells Sheik Ahmal he is Tom's father.\n\nJake and Jilly celebrate in Stephanie's office. Phili","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390df19c295794028bfe6","order":504,"adult":false,"gender":2,"id":75900,"known_for_department":"Acting","name":"John Lee","original_name":"John Lee","popularity":1.72,"profile_path":"/pl2InlMZlci4lIvL0P8YvhTgIPq.jpg"}]},{"air_date":"1986-04-07","episode_number":10,"episode_type":"standard","id":39602,"name":"Episode 10","overview":"Jilly finds Phillip's body and the courier receipt for the tape. She goes to Eden where she manages to retrieve the tape before anyone hears it. Jake's lawyer tells Jake he needs to control Jilly.\n\nJilly destroys the tape but at Phillip's funeral his niece Jessica shows up and tells Jilly Phillip sent her a copy. Jessica tells Jilly that unless Jilly sees her right everyone will hear the tape. Jessica had been burnt in a fire years earlier which she blamed Jilly for.\n\nStephanie lets Sheik Ahmal tell Tom he is his father and after Stephanie tells Tom she was forced to give him away right after looking into his blue eyes moments after his birth. Tom states his eyes are brown not blue which makes him think he is not Stephanie's son, he rushes off to tell Sarah. Sarah still refuses to believe they are not related.\n\nJake offers Stephanie one last chance of a 50 / 50 partnership which she refuses. Jilly and Cassie clash at Tara's both blaming each other for Phillip's death.\n\nSheik Ahmal tells St","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e119c295794028c0c4","order":502,"adult":false,"gender":2,"id":1219764,"known_for_department":"Acting","name":"Robin Ramsay","original_name":"Robin Ramsay","popularity":1.455,"profile_path":"/ykIxyXAjdTOZaEV53pWZ9bVSJtW.jpg"}]},{"air_date":"1986-04-14","episode_number":11,"episode_type":"standard","id":39599,"name":"Episode 11","overview":"Dan is angry when he reads a newspaper report stating Stephanie is prepared to risk everything to get Harper Mining back. Dennis, Sarah and Bill pledge their support to Stephanie and ofter her their shares in the company.\n\nStephanie and Jake prepare for a live TV debate and Jake proposes just before they go on air. Stephanie reminds Jake she is already married to Dan. During the debate Stephanie brings up the proposal and tells Jake she would never marry him and throws a jug of water over him.\n\nTom still refuses to believe he is Stephanie's son and decides to go to old Eden to see the house keeper of the time of his birth. Cassie offers her help to Stephanie in the battle with Jake. Dan is disappointed Stephanie is spending so much time trying to get back the company.\n\nJake is angry at being humiliated on TV and Jilly tells him Ahmal is Tom's father. As she leaves she hears Anton, Jake's lawyer, mention Jake's visits to the cemetery.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e119c295794028c0c4","order":502,"adult":false,"gender":2,"id":1219764,"known_for_department":"Acting","name":"Robin Ramsay","original_name":"Robin Ramsay","popularity":1.455,"profile_path":"/ykIxyXAjdTOZaEV53pWZ9bVSJtW.jpg"}]},{"air_date":"1986-04-21","episode_number":12,"episode_type":"standard","id":39606,"name":"Episode 12","overview":"Eden is forcibly put up for sale and the Harper's prepare to move out. Ahmal offers to buy it for Stephanie but she knows Dan could never accept it. Jilly comes to gloat, showing her true colors. Jake confirms to Stephanie that Jilly was in on the plan from the start. Having discovered Jake is Greg's brother Jilly forces Jake to give her a place on the board otherwise she will expose him.\n\nJilly goes back to Eden as the Harper's move out and Stephanie pushes her in the pool. Dan, Sarah and Dennis scrape some cash together to try and buy Eden at the auction but before the auction starts its announced a private bid has already been accepted, Jilly is announced as the new owner.\n\nOn information received from the housekeeper at old Eden Tom discovers from some nuns that Stephanie's baby was adopted before Bill and Reena adopted him from the orphanage meaning hes not Stephanie's son. Sarah meanwhile has been romancing Angelo.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e119c295794028c0c4","order":502,"adult":false,"gender":2,"id":1219764,"known_for_department":"Acting","name":"Robin Ramsay","original_name":"Robin Ramsay","popularity":1.455,"profile_path":"/ykIxyXAjdTOZaEV53pWZ9bVSJtW.jpg"}]},{"air_date":"1986-04-28","episode_number":13,"episode_type":"standard","id":39604,"name":"Episode 13","overview":"A mystery man swims out and rescues Stephanie. Her clothes are found on the beach and everyone presumes she has drowned. Jilly pays Olive off now she has no future use for her. Jake is furious when Jilly tells him Stephanie killed herself because she though Dan had slept with her and starts to strangle her. Jilly breaks free.\n\nStephanie appears walking on the beach, along with her rescuer Johnno. She had apparently rescued him, after he got in trouble trying to rescue her. She had only been trying to wash away all her troubles and not kill herself. Johnno suggests she should let people continue to think she is dead for a while and use it to get back at Jilly and Jake.\n\nTom rushes back to tell Sarah the news he's not her brother and is involved in a car accident. A mystery person substitutes Jilly's breakfast with a snake and it wriggles towards her.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-05-05","episode_number":14,"episode_type":"standard","id":39597,"name":"Episode 14","overview":"Olive conveniently shows up and saves Jilly's life. When the police arrive they can find no trace of the snake. Tom is in a coma and Sarah sits by his bed side hoping he will recover still not knowing they are not related.\n\nStephanie and Johhno go to stay at Dave Welles place who helped nurse Stephanie back to health 7 years ago and ponder their next move. Jilly manages to blackmail Jake into making her General Manager of the company.\n\nAnother snake turns up this time in Jilly's bed. Jessica recognizes it as non-poisonous and takes care of it. The police turn up again, but Jessica denies there was ever a snake, making Jilly look delusional. Jilly throws Jessica out of Eden and she goes to stay with the Harper's.\n\nA memorial service is held for Stephanie and Jake declares to Anton he is going to marry Jilly as it's the only way to control her. Dave tells Stephanie she cant hide way for ever. Sarah quits Tara's now Jilly is in charge but Jilly persuades Cassie to stay on.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e019c295794028c08a","order":500,"adult":false,"gender":2,"id":70753,"known_for_department":"Acting","name":"Bill Kerr","original_name":"Bill Kerr","popularity":4.128,"profile_path":"/aJ7t8clJBKwG50en67Owk36XdAC.jpg"}]},{"air_date":"1986-05-05","episode_number":15,"episode_type":"standard","id":39603,"name":"Episode 15","overview":"Dan operates on Jessica like he did on Stephanie 7 years earlier. Stephanie is shocked when Johnno tells her he is Tom's father making him not her son. Jake wants Jilly to get rid of Olive for good. Olive angers Jilly by surprising her whilst she is in the bath. She notes how convenient it is that no more snakes have turned up since she agreed to let Olive stay.\n\nAngelo proposes to Sarah. Jilly realizes how lonely she is and tries to get the Harper's's back in her life. Jessica wants nothing more to do with her but Sarah agrees to have her marriage to Angelo at Eden.\n\nDave is injured and Stephanie is forced to face her fears and swim across a crocodile infested river. After she makes it Dave reveals to her there are no crocodiles in that part of the river but Stephanie has faced her fears. A flying doctor is called in, and Dave insists he needs to go to hospital  which is just a plan to get Stephanie to leave and get back to living her life. He gives her  a small fortune of opals, which","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e019c295794028c08a","order":500,"adult":false,"gender":2,"id":70753,"known_for_department":"Acting","name":"Bill Kerr","original_name":"Bill Kerr","popularity":4.128,"profile_path":"/aJ7t8clJBKwG50en67Owk36XdAC.jpg"}]},{"air_date":"1986-05-12","episode_number":16,"episode_type":"standard","id":39605,"name":"Episode 16","overview":"Stephanie convinces Ahmal to let his sister Princess Talitha accompany her back to Australia so Stephanie can pose as her. Ahmal reluctantly agrees. Romance begins to blossom between Dan and Jessica. He sees in her what he first saw in Stephanie.\n\nWith the company in trouble Jake begs Bill to return as General Manager, he agrees so he can find evidence about Jake's illegal dealings. Stephanie returns to Australia and her disguise even fools Johnno.\n\nStephanie dressed as Talitha joins Ahmal in a business meeting with Jake and Jilly. Ahmal wants to buy a large area of cattle land through Sanders Mining. Jilly takes Talitha under her wing at Eden. Jilly trys to get rid of Olive and Olive grabs Jilly by the hair. Jake rescues her and gives Olive her marching orders. Stephanie is upset when she sees Dan and Jessica together. She has seen that look in his eyes before when he first fell in love with her.\n\nJake catches Olive trying to break into Eden with a snake, believing its just another harml","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":"/o1g8mTzBVDgA1Sc6K5ez00fMRn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e319c295794028c168","order":503,"adult":false,"gender":0,"id":1219765,"known_for_department":"Acting","name":"Tamasin Ramsay","original_name":"Tamasin Ramsay","popularity":1.388,"profile_path":null},{"character":"","credit_id":"525390e319c295794028c17c","order":505,"adult":false,"gender":1,"id":97949,"known_for_department":"Acting","name":"Terry Markwell","original_name":"Terry Markwell","popularity":6.066,"profile_path":"/p3Q6nUOYep389iwZ8slVFZbucTn.jpg"}]},{"air_date":"1986-05-12","episode_number":17,"episode_type":"standard","id":39609,"name":"Episode 17","overview":"Jake kills the snake with a gun and Jilly sends home all the servants for the day. They put the body in the boot of a car and drive it to the pier near Tara's. Cassie spots them moving the body into a boat and photographs them in the process.\n\nStephanie dressed as Talitha comes to stay at Eden and Jake recognizes something familiar about the Princess. Jilly takes the princess to Tara's and Cassie shows Jilly the photos and tells her that unless she gives her 50% ownership of Tara's she will go to the police. Jilly is furious when Jake agrees to Cassie's demands.\n\nSarah gives her blessing to Dan and Jessica's relationship. Johnno takes Bill to see Stephanie.  Jake unexpectedly shows up and recognizes her.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e319c295794028c17c","order":505,"adult":false,"gender":1,"id":97949,"known_for_department":"Acting","name":"Terry Markwell","original_name":"Terry Markwell","popularity":6.066,"profile_path":"/p3Q6nUOYep389iwZ8slVFZbucTn.jpg"}]},{"air_date":"1986-05-19","episode_number":18,"episode_type":"standard","id":39607,"name":"Episode 18","overview":"Stephanie races back to Eden with Jake in pursuit. When they reach Eden, Stephanie rushes to her room, where the real Princess is waiting. Jake insists the Princess is Stephanie, but only Jilly is allowed to see the Princess unveiled and can see it's not Stephanie. Jilly is furious with Jake's obsession with Stephanie and tells him he is jeopardizing the deal with Ahmal.\n\nStephanie tells Bill of the her plan to get Jake interested in buying the land Ahmal is after. Really the land is worthless. Bill manages to replace the real land survey report with a fake one.\n\nJake gives Jilly a race horse which she calls Revenge. A recovered Tom decides to return to New York now that Sarah is married. Johnno poses as an ex disgruntled employee of Ahmal and tells her the land is rich in oil. Jilly mortgages everything she owns to get a option on the land.\n\nSarah tells Tom he is the father of her unborn baby not Angelo and Tom then tells Sarah they are not related. Sarah faints in shock threatening the","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e319c295794028c168","order":503,"adult":false,"gender":0,"id":1219765,"known_for_department":"Acting","name":"Tamasin Ramsay","original_name":"Tamasin Ramsay","popularity":1.388,"profile_path":null},{"character":"","credit_id":"525390e319c295794028c17c","order":505,"adult":false,"gender":1,"id":97949,"known_for_department":"Acting","name":"Terry Markwell","original_name":"Terry Markwell","popularity":6.066,"profile_path":"/p3Q6nUOYep389iwZ8slVFZbucTn.jpg"}]},{"air_date":"1986-05-19","episode_number":19,"episode_type":"standard","id":39608,"name":"Episode 19","overview":"Jake tries to convince Jilly the land is worthless but Jilly refuses to believe him. Sarah will recover but Jake uses this by saying shes critically ill to try and flush Stephanie out in the open. It works and Stephanie sneaks into the hospital where she is reunited with Dennis and Sarah. Jake is watching the exits outside the hospital where he calls Jilly to join him. They are spotted by Johnno who manages to tell Stephanie and he manages to wheel her out on a stretcher right under their noses without her being seen.\n\nStephanie dressed as the princess goes to see for herself that Dan will be happy with Jessica. Jessica tells her that Stephanie's career always came first and that would never happen with her and that she could make Dan happy in a way Stephanie never could.\n\nCassie and Dennis put their differences behind them and realize they love each other. Tara's organizes a fashion show. Johnno tricks Jilly into finalizing the land deal early as the fashion show is going on, and Jilly","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e319c295794028c168","order":503,"adult":false,"gender":0,"id":1219765,"known_for_department":"Acting","name":"Tamasin Ramsay","original_name":"Tamasin Ramsay","popularity":1.388,"profile_path":null},{"character":"","credit_id":"525390e319c295794028c17c","order":505,"adult":false,"gender":1,"id":97949,"known_for_department":"Acting","name":"Terry Markwell","original_name":"Terry Markwell","popularity":6.066,"profile_path":"/p3Q6nUOYep389iwZ8slVFZbucTn.jpg"}]},{"air_date":"1986-05-26","episode_number":20,"episode_type":"standard","id":39612,"name":"Episode 20","overview":"Dan is furious everyone knew she was alive apart from him and that she turned to Ahmal for help. Jake tells a shaken Jilly she was never in Stephanie's league. Jilly tells Jake she will go to the police with Cassie's photographs unless he goes ahead and marries her. A still shaken Jilly sees a doctor.\n\nJake tells Stephanie he is still in love with her and Jilly confronts Stephanie. Johnno goes to see Tom but decides not to tell him he is his real father. Jake calls Jilly's bluff and tells her he would rather go to prison than marry her. She pulls a gun on him and Jake tells Anton to get rid of her. Jessica asks Stephanie to resolve things with Dan so they all know where they stand. They agree they have no future together but hope to remain friends.\n\nAnton spikes Jilly's drink with a sedative. Jilly receives news from the doctor she saw that she is pregnant. She calls Jake with the news. Anton continues with his plan and dumps a now sleepy Jilly in the swimming pool and holds her head und","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e319c295794028c168","order":503,"adult":false,"gender":0,"id":1219765,"known_for_department":"Acting","name":"Tamasin Ramsay","original_name":"Tamasin Ramsay","popularity":1.388,"profile_path":null}]},{"air_date":"1986-06-02","episode_number":21,"episode_type":"standard","id":39611,"name":"Episode 21","overview":"Jake rescues Jilly from the pool and revives her. When Jilly tells him Anton tried to drown her Jake tells her he's paid Anton off to get out of their lives. Jake tries one last time to persuade Stephanie to marry him but again she refuses. Dennis tells Jilly Jake is only marrying her as Stephanie wont have him. Stephanie's thoughts return to her son she gave up for adoption at 18 whilst a mystery person is watching her.\n\nJilly tells Jake they are going to siphon off all the company funds into a swiss bank account and leave the country. Jake tells Jilly he has entered her horse into the Melbourne Cup and if they stay awhile they could make a fortune. Jilly goes on a spending spree and tells Jake she wants the swiss bank account number as a wedding present. Jake and Jilly marry.\n\nStephanie offers Dan some money to open a clinic on the island they visited. Things go wrong between Sarah and Angelo when he takes up boxing again to try and support them. Sarah tearfully goes to see Tom and tel","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1986-06-06","episode_number":22,"episode_type":"finale","id":39610,"name":"Episode 22","overview":"The mystery man leaves a torn photo on a sleeping Stephanie's pillow. Jake and Jilly check out Revenge's form and Jilly urges Jake to forget the bet and leave now but he refuses. Jake tells Jilly a disqualification in the race would mean the other person won and Jilly gets an idea.\n\nDennis proposes to Cassie and he wants to borrow $60,000 from her to bet on the race to set up their future. Jilly takes the company payroll and prepares to leave on her own. At the airport she receives a phone call from the mystery man  who tells her we can still win this one. This prompts her to stay.\n\nJake and Stephanie sign a contract making the bet legal and Stephanie tells Jake she will have to redecorate the office when she wins. Dennis catches Jilly trying to drug Tara's Pride and when the police show up Jilly says she was asleep at the time.\n\nAfter Tara's Pride is moved Jilly offers Cassie $250,000 to tell her where the horse has been moved to.","production_code":"","runtime":null,"season_number":2,"show_id":727,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"525390e319c295794028c168","order":503,"adult":false,"gender":0,"id":1219765,"known_for_department":"Acting","name":"Tamasin Ramsay","original_name":"Tamasin Ramsay","popularity":1.388,"profile_path":null}]}],"name":"Season 2","overview":"Seven years later, Stephanie Harper, Australia's richest woman, is happily married to her plastic surgeon husband. Her two children are now young adults, involved in the Harper 'empire' and in their own problems. The release of Jilly Stewart from prison starts a dramatic chain of events.","id":2132,"poster_path":"/g5wqGIIlENc0bTKsUnZivNQCf54.jpg","season_number":2,"vote_average":0}}}