{"adult":false,"backdrop_path":"/AdDNOTvwkL2BdqXNng2iEIzpDeg.jpg","created_by":[{"id":1491429,"credit_id":"596721c892514121f011f012","name":"Karan Anshuman","gender":2,"profile_path":null}],"episode_run_time":[45],"first_air_date":"2017-07-10","genres":[{"id":18,"name":"Drama"}],"homepage":"https://www.amazon.co.uk/gp/video/detail/B073PHP5JK","id":72739,"in_production":false,"languages":["hi","en"],"last_air_date":"2021-12-03","last_episode_to_air":{"id":3375009,"name":"Cricket is the Winner","overview":"As India take on Pakistan in the final test, the gentleman's game is incinerated, giving rise to a new cricketing order from its ashes.","vote_average":0,"vote_count":0,"air_date":"2021-12-03","episode_number":10,"episode_type":"finale","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/tLisuhhEw4pDrapRFgHwiheFogD.jpg"},"name":"Inside Edge","next_episode_to_air":null,"networks":[{"id":1024,"logo_path":"/ifhbNuuVnlwYy5oXA5VIb2YR8AZ.png","name":"Prime Video","origin_country":""}],"number_of_episodes":30,"number_of_seasons":3,"origin_country":["IN"],"original_language":"hi","original_name":"Inside Edge","overview":"The story of the Mumbai Mavericks, a T20 cricket franchise playing in the Powerplay League. Set in a landscape of conflicting interests, where selfishness is almost a virtue, where sex, money, and power are mere means to an end, Inside Edge is a story that pulls no punches, minces no words, and takes no prisoners. Come witness the game behind the game.","popularity":5.341,"poster_path":"/pfGyOXhabq3CrjSLx7LJjCrWTHy.jpg","production_companies":[{"id":2934,"logo_path":"/bFoQPEgrOKeQWPBM0RIkfaR3etq.png","name":"Excel Entertainment","origin_country":"IN"},{"id":20580,"logo_path":"/oRR9EXVoKP9szDkVKlze5HVJS7g.png","name":"Amazon Studios","origin_country":"US"},{"id":67994,"logo_path":"/n5ejmdkQCWjSm9aUCMNQ8x4135o.png","name":"Sarke Studio","origin_country":"IN"}],"production_countries":[{"iso_3166_1":"IN","name":"India"}],"seasons":[{"air_date":"2017-07-10","episode_count":10,"id":90284,"name":"Season 1","overview":"Inside Edge is the story of the Mumbai Mavericks, a T20 cricket franchise playing in the Powerplay League. Set in a landscape of conflicting interests, where selfishness is almost a virtue, where sex, money, and power are mere means to an end, Inside Edge is a story that pulls no punches, minces no words, and takes no prisoners. Come witness the game behind the game.","poster_path":"/hiCroCRD7U00T8xHmQiyiEMx5zp.jpg","season_number":1,"vote_average":10},{"air_date":"2019-12-06","episode_count":10,"id":137516,"name":"Season 2","overview":"In the next edition of the PPL, a volatile Vayu Raghavan leads the Mumbai Mavericks to face their biggest adversary yet, the Arvind Vashisht-led Haryana Hurricanes. But they must also counter colossal scandals that’ll rock the world of cricket. In the sport’s upper echelons, Zarina Malik allies with Bhaisaab, but those in the shadows threaten to destroy the very game they seek to control.","poster_path":"/5gP5jz4YPDXb8N03pyqzvZVWZ83.jpg","season_number":2,"vote_average":0},{"air_date":"2021-12-03","episode_count":10,"id":219578,"name":"Season 3","overview":"Amidst the greatest show on earth: an India v/s Pakistan cricket series, the politics of Indian cricket is laid bare, its secrets unraveled and truths exposed. The stakes have never been higher, even as they are investigated for corruption, battle lines are drawn for TV rights, endorsement deals and the captaincy of the Indian team. But what is the limit to the price of power?","poster_path":"/aSAcGUsxoioRhA1P17PqVAj9hJd.jpg","season_number":3,"vote_average":8.3}],"spoken_languages":[{"english_name":"Hindi","iso_639_1":"hi","name":"हिन्दी"},{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.2,"vote_count":22,"season_data":{"1":{"_id":"5961f0a49251417904038c56","air_date":"2017-07-10","episodes":[{"air_date":"2017-07-10","episode_number":1,"episode_type":"standard","id":1336204,"name":"Powerplay","overview":"Zarina Malik, co- owner of the Mumbai Mavericks, races against time to find a new financial partner, or risk losing the team. Meanwhile the team has a young recruit who gets his first taste of the big, bad world of the PPL.","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/klAdlHSaCGiP8oZ3IrqOtg4pQQk.jpg","vote_average":10,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2017-07-10","episode_number":2,"episode_type":"standard","id":1336645,"name":"Bunny","overview":"Zarina realizes she's made a deal with the devil, while Prashant struggles to adapt to his new surroundings. Vayu finds himself on the brink, needing to make hard decisions in his career and relationships.","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/4G6VbDSbx3Fer6sTDRQztIxYnCR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-10","episode_number":3,"episode_type":"standard","id":1336646,"name":"Inner Circle","overview":"The team is in Chennai to take on their arch rivals, and the hosts and their fans are extremely hostile, with good reason. Meanwhile, a mysterious figure takes stock of the team.","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/zvnfhbcpGzPWYNVaDJlgeAixnFI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-10","episode_number":4,"episode_type":"standard","id":1336647,"name":"Wrong Foot","overview":"The team is at an endorsement shoot. Dhawan's master plan is close to becoming reality. Vayu makes headway with Meera; Arvind confronts problems closer to home.","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/3756eJUAljQccCxIqE8ukECWpia.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-10","episode_number":5,"episode_type":"standard","id":1336648,"name":"Away Game","overview":"A forgotten past comes back to haunt Coach Suri. Vayu can't deal with the pressure from the media. Meanwhile, Prashant has been practicing hard; will his efforts pay off?","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/kCgQO1D1KSCa0Ialpzq7C5lmYy7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-10","episode_number":6,"episode_type":"standard","id":1336650,"name":"Opening Bid","overview":"It's match day. Mavericks vs Hurricanes. Dhawan's grand plan is finally coming together. However, the smallest cog in the wheel can upset the best laid plans.","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/mAiiExZQyPZMTfyjsN8emR6FXBG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-10","episode_number":7,"episode_type":"standard","id":1336651,"name":"FoW","overview":"Things are coming to a head. Zarina, Arvind, Prashant, Vayu all face crises of their own. The pressure is too much, and something has to give.","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/3GgP21Eh8cyEkQrGHhK1s52YSGv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-10","episode_number":8,"episode_type":"standard","id":1336652,"name":"Corridor of Uncertainty","overview":"Dhawan goes into damage control mode as secrets start to spill out, but there is a silver lining for him.","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/mFz2XOOQzN9vM5b0tBeQ5AGXmVh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-10","episode_number":9,"episode_type":"standard","id":1336653,"name":"Hammer Price","overview":"Arvind's vulnerability triggers a chain reaction. An old friend shows up to advise Zarina. And can Vayu pull himself together at this crucial time?","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/vWvgqka0U8aawBIhHEKK8CkwZyh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-07-10","episode_number":10,"episode_type":"finale","id":1336654,"name":"Maximum","overview":"The finals of the PowerPlay League is here. But the question is of the larger game. Who will win?","production_code":"","runtime":45,"season_number":1,"show_id":72739,"still_path":"/xKiZCVDwHfDsyKx7NfYBDM26FCh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Inside Edge is the story of the Mumbai Mavericks, a T20 cricket franchise playing in the Powerplay League. Set in a landscape of conflicting interests, where selfishness is almost a virtue, where sex, money, and power are mere means to an end, Inside Edge is a story that pulls no punches, minces no words, and takes no prisoners. Come witness the game behind the game.","id":90284,"poster_path":"/hiCroCRD7U00T8xHmQiyiEMx5zp.jpg","season_number":1,"vote_average":10},"2":{"_id":"5de9ee9b3faba0001316fa73","air_date":"2019-12-06","episodes":[{"air_date":"2019-12-06","episode_number":1,"episode_type":"standard","id":2007715,"name":"Run Up","overview":"The PowerPlay League is around the corner and Bhaisaab steps out of the shadows and showcases the extent of his clout and control. But how many adversaries can he antagonize before karma comes full circle? Zarina's on top of her game as she sashays into her new film's launch party with Vayu on her arm. With Bhaisaab in her corner, the sky's the limit for her aspirations. Vayu has a chance encounter with Mantra, the new owner of the Mumbai Mavericks. Bhaisaab strikes an unofficial deal with the Home Minister, who wants to buy a PPL team but Ayesha Dewan attempts to throw a spanner in the works. Arvind, retired and grieving. in Jamaica, is approached by Handa in a final bid to beg him to return to the PPL as the Hurricanes' captain. Meanwhile Prashant is being haunted by ghosts of his past. As the teams go into auction-planning mode, the storm gathers.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/kr8ANHMDOxwqkgsYmIbfFOeNoJN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":2,"episode_type":"standard","id":2007716,"name":"Paddle Sweep","overview":"The PowerPlay League auctions are underway, the owners are competing tooth and nail to bag the best of the best. But it's the mind games that are trumping strategies. Zarina senses the Hurricanes' weakness and hits Handa right in his Achilles' heel. Vayu's stubbornness, however, turns out to be a roadblock in her foolproof plan. Zarina takes a tough stand for herself that results in a fall out with her producer. But she has a plan-B up her sleeve for her film. Vayu, trying hard to get Mantra's attention, is aggrieved when an old coach resurfaces in his life. There's a lot of toxic history to this relationship and Rohini is in the thick of it too. Back at the ICB, Bhaisaab establishes that he is the best man to be re-elected as President. Zarina is in awe of his vision and power. With preparations for the PPL on in full force and a thunderstorm on the horizon, an unavoidable course correction is imminent.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/ylTWZ2ARqsbsky0jBzILlbIyw4y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":3,"episode_type":"standard","id":2007717,"name":"Hawk-Eye","overview":"Bhaisaab attempts a novel approach to neutralize the Home Minister's threat, but it remains to be seen if the minister will bite and if the gamble will succeed. Vayu's old mentor harbors concerning news. But Rohini has a different take on it. Will the siblings agree on how to deal with it? Prashant is facing an acute loss of form with his psychological issues. He is no longer the efficacious pacer he used to be and his speed gun readings hide nothing from team management. He looks for Rohini's shoulder to lean on. Zarina learns that her enemy is far more influential than she imagined and she goes to the only place she knows to seek asylum. The Hurricanes gear up for their first match against the Mavericks and Handa's desperation and determination to win is evident. He'll go to any lengths, on and off the field, to ensure his underdog team doesn't take a beating.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/gsHVfK7P7wGe9wW2UVCZLbdxper.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":4,"episode_type":"standard","id":2007761,"name":"Doctored","overview":"After a surprising turn by Arvind in the opening game against the Mavericks, the players come under the scanner for using performance-enhancing drugs. Wolfgang Hummels, the new agent representing the Global Doping Prevention Authority, arrives in South Africa and makes it clear to the ICB chief that he isn't for sale. Vayu and Mantra's shared love for all things retro kindles a hitherto unseen chemistry. Meanwhile Prashant has a rather surprising, if awkward, interaction with a drunken cheerleader of his team. Back in Mumbai, Zarina is uncomfortable being away from the action. Instigated by Imtiaz, she rethinks her strategy of dealing with her commitments.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/kNCEWGGckIN89kYNB6mvarf1fLM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":5,"episode_type":"standard","id":2007769,"name":"Block Hole","overview":"The games are underway and the GDPA officer has bad news for Bhaisaab. As if an upright, anti-doping official harping wasn't enough, Bhaisaab must deal with an old nemesis lurking in the darkness, watching his every move. Arvind is torn between the cricket and his real motivation to return to the PPL. There's little progress on Rathore's investigation into the Suri murder case. Vayu has a showdown with the team management over team selection. He finds himself with no one in his corner, save for Mantra. The fissure between Rohini and Vayu widens when an emotionally charged Rohini makes a decision that Vayu warns her will have dire consequences. Love is in the air as two very different rendezvous play out - in the streets of Johannesburg and in the caves of the Cradle of Humankind - where reflections lead to critical decisions.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/hFLb00ens6NZfUJKL2mmao1Z8Km.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":6,"episode_type":"standard","id":2007776,"name":"Turn","overview":"Outmaneuvered, Bhaisaab's empire is on the verge of annihilation. Sworn enemies have taken him by surprise, causing him to retreat as they rejoice. But Bhaisaab's not one to go down without a fight, and as the cattle celebrate, a masterplan is being brewed on the backburner. Prashant, still haunted by the ghosts of his past, attempts to deal with them by running away from them. Only to realize that it did more harm than good to him and the one he loves. With Rohini absent, Vayu must go solo to conquer his demons. With a lot more than just his captaincy at stake, Vayu must pay a price to reclaim his lost glory, something he never believed he'd have to do.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/ksR3sSqpXvzIqm71Uu7FP7jXSo2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":7,"episode_type":"standard","id":2007783,"name":"Yo Yo","overview":"Arvind and Vayu strive to prove themselves as players and leaders, but blocking their path are their own teams' management. While Arvind uncovers a conspiracy that could potentially disrupt the Hurricanes' ambition of winning the league, Vayu attempts to make amends with his broken teammates. Rohini believes she has figured an audacious way to steer her team to victory. And she's going to stay the course. Zarina's indoctrination is complete and victory is within grasp for Bhaisaab. Zarina manipulates her players to strike on command and Bhaisaab makes arrangements for the upcoming elections. But making an appearance in the stadium is another puppeteer who shows them how it's done.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/eH2RQF8txWQ0liyTwDMTPOGvJvM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":8,"episode_type":"standard","id":2007794,"name":"Crossing The line","overview":"The stakes are high and it's a must-win situation for Arvind's floundering bits-and-pieces team. The rookies train hard as they prepare for the team's most important game yet. A loss here for the Hurricanes would mean taking the first flight home. The lines between reality and fiction blur out for Prashant as he deals with the ramifications of his past. His quest for closure forces him to venture into uncharted territory, only to end up confronting his most daunting fear. Zarina takes matters into her own hands on learning her darkest nightmares are true. In order to mitigate the situation, Bhaisaab must unleash his most ruthless avatar yet.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/aqMac5FpZtZ5U5b74998WqNijW7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":9,"episode_type":"standard","id":2007797,"name":"Four Slips And A Gully","overview":"A dark night in the gallows brings light to some. Former rivals make amends when coerced to face a common foe. A brief encounter with an old acquaintance pushes Arvind to make a decision with far-reaching consequences. Zarina takes necessary steps to ensure their plans don't go awry, only to demand her pound of flesh in return. The finals are underway and Bhaisaab's meticulous machinations are about to come undone.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/iVQDQNFd2H3exGkFREGVBblSkij.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-12-06","episode_number":10,"episode_type":"finale","id":2007799,"name":"Switch Hit","overview":"The cricketers battle it out on the field in a PPL final in which it's hard to pick favorites. With each passing ball the odds swing in favor of either team, leaving spectators in raptures. It's a game to remember not only for them, but for the players too as moments never experienced before in a field of cricket play out. The pressure off the field is high too, and Pritish's absence compels Zarina to pull the trigger in a winner-takes-all game. But it's Bhaisaab who belts out his sharpest blows in an all-or-nothing crusade to retain his dominion.","production_code":"","runtime":45,"season_number":2,"show_id":72739,"still_path":"/1MwIHxslFrwCiICgN1JU5gA9BOC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"In the next edition of the PPL, a volatile Vayu Raghavan leads the Mumbai Mavericks to face their biggest adversary yet, the Arvind Vashisht-led Haryana Hurricanes. But they must also counter colossal scandals that’ll rock the world of cricket. In the sport’s upper echelons, Zarina Malik allies with Bhaisaab, but those in the shadows threaten to destroy the very game they seek to control.","id":137516,"poster_path":"/5gP5jz4YPDXb8N03pyqzvZVWZ83.jpg","season_number":2,"vote_average":0},"3":{"_id":"619204e96ca9a000672df056","air_date":"2021-12-03","episodes":[{"air_date":"2021-12-03","episode_number":1,"episode_type":"standard","id":3338948,"name":"Domestic Games","overview":"The Roy Commission is set up to investigate corruption in cricket. In an all out war between Dhawan and Bhaisaab, Zarina Malik is pressured to pick a side.","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/lQoE5DuLs6IVL9v71402mYfXjUD.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[{"character":"Zarina Malik","credit_id":"5e3964eed1a8930018d00afc","order":3,"adult":false,"gender":1,"id":150471,"known_for_department":"Acting","name":"Richa Chadha","original_name":"Richa Chadha","popularity":7.665,"profile_path":"/cb15PLOeRNt7uxsiymjHfnJPm3i.jpg"},{"character":"Mantra Patil","credit_id":"5df0dee5ce4ddc00186352e3","order":6,"adult":false,"gender":1,"id":1450085,"known_for_department":"Acting","name":"Sapna Pabbi","original_name":"Sapna Pabbi","popularity":6.873,"profile_path":"/3tusqEh13FpHrCudYvBlny8dWmB.jpg"},{"character":"Vikrant Dhawan","credit_id":"596399f2c3a3680d590ce1e6","order":7,"adult":false,"gender":2,"id":85668,"known_for_department":"Acting","name":"Vivek Oberoi","original_name":"Vivek Oberoi","popularity":2.56,"profile_path":"/dX1qlcIOY3fgixRdgvMGbLy3DSY.jpg"},{"character":"Sudha Dhawan","credit_id":"602444389979d2003fe87822","order":8,"adult":false,"gender":0,"id":2972476,"known_for_department":"Acting","name":"Himanshi Choudhry","original_name":"Himanshi Choudhry","popularity":2.684,"profile_path":"/i4pSMYUq4C7fAcCRsv9t8IUrUg0.jpg"},{"character":"Vikrant Dhawan - 24 Year","credit_id":"61a99bada24c5000636a84ab","order":500,"adult":false,"gender":0,"id":3333450,"known_for_department":"Acting","name":"Akshay Sodhi","original_name":"Akshay Sodhi","popularity":0.6,"profile_path":null},{"character":"Bhau Patil","credit_id":"61a99c3d3dc313009188c5a3","order":501,"adult":false,"gender":0,"id":1770294,"known_for_department":"Acting","name":"Prasanna Ketkar","original_name":"Prasanna Ketkar","popularity":1.865,"profile_path":"/r7bWysIC7qK6Ssm1EGyuh6PDpC1.jpg"},{"character":"Faisal Hussain","credit_id":"61a99d8b97eab40029f2c7ee","order":502,"adult":false,"gender":0,"id":2295063,"known_for_department":"Acting","name":"Shubrajyoti Bharat","original_name":"Shubrajyoti Bharat","popularity":0.6,"profile_path":null},{"character":"Adesh Rangayan","credit_id":"61a99e42180dea009888b240","order":503,"adult":false,"gender":0,"id":3333475,"known_for_department":"Acting","name":"Mahesh shetty","original_name":"Mahesh shetty","popularity":0.98,"profile_path":null},{"character":"Bhatia","credit_id":"61a9a1d53dc313009188cf6c","order":504,"adult":false,"gender":0,"id":3333488,"known_for_department":"Acting","name":"Bharat Bhatia","original_name":"Bharat Bhatia","popularity":0.6,"profile_path":null},{"character":"Vikrant Dhawan's Mother","credit_id":"61a9a502e267de00277d9a48","order":505,"adult":false,"gender":0,"id":3333497,"known_for_department":"Acting","name":"Raina Ahluwalia","original_name":"Raina Ahluwalia","popularity":0.6,"profile_path":null},{"character":"Lawyer kothari","credit_id":"61a9a6687ecd2800962b7ac3","order":506,"adult":false,"gender":0,"id":3333503,"known_for_department":"Acting","name":"Micky Makhija","original_name":"Micky Makhija","popularity":0.6,"profile_path":null},{"character":"Lawyer Khemani","credit_id":"61a9a5e04a52f8008e23cddf","order":507,"adult":false,"gender":0,"id":3333501,"known_for_department":"Acting","name":"Vihaan Chaudhary","original_name":"Vihaan Chaudhary","popularity":0.772,"profile_path":null},{"character":"Kale","credit_id":"61a9a69d9a64350062aa47c4","order":508,"adult":false,"gender":0,"id":3333504,"known_for_department":"Acting","name":"Sunil Saraswat","original_name":"Sunil Saraswat","popularity":0.6,"profile_path":null},{"character":"Bhaisaab","credit_id":"61a99ca8d6819b008edbefcb","order":512,"adult":false,"gender":2,"id":123228,"known_for_department":"Acting","name":"Aamir Bashir","original_name":"Aamir Bashir","popularity":6.604,"profile_path":"/jWvHNzlDwbTyJaShBeXfIKl2QHU.jpg"},{"character":"Vayu Raghavan","credit_id":"61a9a1261f33190061cc9a6c","order":514,"adult":false,"gender":0,"id":1323156,"known_for_department":"Acting","name":"Tanuj Virwani","original_name":"Tanuj Virwani","popularity":2.941,"profile_path":"/ly2yRwLExCgVneH2rI3vheQ5rOh.jpg"},{"character":"Judge Roy","credit_id":"61a9a281383df2004596887c","order":516,"adult":false,"gender":2,"id":11861,"known_for_department":"Acting","name":"Dalip Tahil","original_name":"Dalip Tahil","popularity":3.135,"profile_path":"/4kgTd5aKh3IRxrJ7uG5h9mojb57.jpg"},{"character":"Girish Mukherjee","credit_id":"61a9a23e3dc313009188d007","order":521,"adult":false,"gender":0,"id":1408644,"known_for_department":"Acting","name":"Alekh Sangal","original_name":"Alekh Sangal","popularity":0.6,"profile_path":null}]},{"air_date":"2021-12-03","episode_number":2,"episode_type":"standard","id":3374994,"name":"Devil's Number","overview":"An insidious operation is underway to secure the TV broadcast rights in the auctions for the upcoming international series. A revelation from the past threatens to destroy the life that Vayu and Rohini have built.","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/qDZPydgVC2oAQtCngxZdIG0KWab.jpg","vote_average":8,"vote_count":1,"crew":[],"guest_stars":[{"character":"Rohini Raghavan","credit_id":"5df0dd28eda4b70013047542","order":5,"adult":false,"gender":1,"id":1421861,"known_for_department":"Acting","name":"Sayani Gupta","original_name":"Sayani Gupta","popularity":5.112,"profile_path":"/ZswP4g0UHDYvZLI2HlWzEcbvEN.jpg"},{"character":"Mantra Patil","credit_id":"5df0dee5ce4ddc00186352e3","order":6,"adult":false,"gender":1,"id":1450085,"known_for_department":"Acting","name":"Sapna Pabbi","original_name":"Sapna Pabbi","popularity":6.873,"profile_path":"/3tusqEh13FpHrCudYvBlny8dWmB.jpg"},{"character":"Vikrant Dhawan","credit_id":"596399f2c3a3680d590ce1e6","order":7,"adult":false,"gender":2,"id":85668,"known_for_department":"Acting","name":"Vivek Oberoi","original_name":"Vivek Oberoi","popularity":2.56,"profile_path":"/dX1qlcIOY3fgixRdgvMGbLy3DSY.jpg"},{"character":"Lawyer Khemani","credit_id":"61a9a5e04a52f8008e23cddf","order":507,"adult":false,"gender":0,"id":3333501,"known_for_department":"Acting","name":"Vihaan Chaudhary","original_name":"Vihaan Chaudhary","popularity":0.772,"profile_path":null},{"character":"Kale","credit_id":"61a9a69d9a64350062aa47c4","order":508,"adult":false,"gender":0,"id":3333504,"known_for_department":"Acting","name":"Sunil Saraswat","original_name":"Sunil Saraswat","popularity":0.6,"profile_path":null},{"character":"Basu (ICB Secretary)","credit_id":"61a9cbd91f33190061cccfc6","order":509,"adult":false,"gender":0,"id":1120775,"known_for_department":"Acting","name":"Avijit Dutt","original_name":"Avijit Dutt","popularity":1.91,"profile_path":"/5pNmHClvtaieNjTTrT4tjkWQYrw.jpg"},{"character":"Rajeshwar","credit_id":"61a9d458383df2004596bc80","order":510,"adult":false,"gender":0,"id":1751364,"known_for_department":"Acting","name":"Sushil Pandey","original_name":"Sushil Pandey","popularity":0.6,"profile_path":null},{"character":"Monica Modi","credit_id":"61a9d4907ecd28006883672f","order":511,"adult":false,"gender":1,"id":86885,"known_for_department":"Acting","name":"Shivani Tanksale","original_name":"Shivani Tanksale","popularity":5.447,"profile_path":"/pqTjmWTmYLgNMLp0vzDW3z6c8x7.jpg"},{"character":"Bhaisaab","credit_id":"61a99ca8d6819b008edbefcb","order":512,"adult":false,"gender":2,"id":123228,"known_for_department":"Acting","name":"Aamir Bashir","original_name":"Aamir Bashir","popularity":6.604,"profile_path":"/jWvHNzlDwbTyJaShBeXfIKl2QHU.jpg"},{"character":"Vayu Raghavan","credit_id":"61a9a1261f33190061cc9a6c","order":514,"adult":false,"gender":0,"id":1323156,"known_for_department":"Acting","name":"Tanuj Virwani","original_name":"Tanuj Virwani","popularity":2.941,"profile_path":"/ly2yRwLExCgVneH2rI3vheQ5rOh.jpg"},{"character":"Judge Roy","credit_id":"61a9a281383df2004596887c","order":516,"adult":false,"gender":2,"id":11861,"known_for_department":"Acting","name":"Dalip Tahil","original_name":"Dalip Tahil","popularity":3.135,"profile_path":"/4kgTd5aKh3IRxrJ7uG5h9mojb57.jpg"},{"character":"Rohit Shanbhag","credit_id":"61a9cd45383df200647f086a","order":519,"adult":false,"gender":2,"id":1342538,"known_for_department":"Acting","name":"Akshay Oberoi","original_name":"Akshay Oberoi","popularity":2.224,"profile_path":"/dsFqDJzSzUiKZpicmj05Iv1YbOs.jpg"},{"character":"Girish Mukherjee","credit_id":"61a9a23e3dc313009188d007","order":521,"adult":false,"gender":0,"id":1408644,"known_for_department":"Acting","name":"Alekh Sangal","original_name":"Alekh Sangal","popularity":0.6,"profile_path":null},{"character":"Allen Menezes","credit_id":"61a9ce75028420002dbd6a76","order":522,"adult":false,"gender":2,"id":2707475,"known_for_department":"Acting","name":"Ankur Rathee","original_name":"Ankur Rathee","popularity":5.866,"profile_path":"/5ZR7jiE4cGhaM6ZqBS6R7N7h5Q7.jpg"}]},{"air_date":"2021-12-03","episode_number":3,"episode_type":"standard","id":3374996,"name":"Captain's Knock","overview":"It's the finals of the Wadia Cup and the selectors must choose between Vayu and Rohit as captain of India. Mantra finds her raison d'etre, Rohini sinks deep into her quest of challenging the past.","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/1o4TCWi1L6PpbGzaEvEf8e7H0Gm.jpg","vote_average":9,"vote_count":1,"crew":[],"guest_stars":[{"character":"Rohini Raghavan","credit_id":"5df0dd28eda4b70013047542","order":5,"adult":false,"gender":1,"id":1421861,"known_for_department":"Acting","name":"Sayani Gupta","original_name":"Sayani Gupta","popularity":5.112,"profile_path":"/ZswP4g0UHDYvZLI2HlWzEcbvEN.jpg"},{"character":"Mantra Patil","credit_id":"5df0dee5ce4ddc00186352e3","order":6,"adult":false,"gender":1,"id":1450085,"known_for_department":"Acting","name":"Sapna Pabbi","original_name":"Sapna Pabbi","popularity":6.873,"profile_path":"/3tusqEh13FpHrCudYvBlny8dWmB.jpg"},{"character":"Vikrant Dhawan","credit_id":"596399f2c3a3680d590ce1e6","order":7,"adult":false,"gender":2,"id":85668,"known_for_department":"Acting","name":"Vivek Oberoi","original_name":"Vivek Oberoi","popularity":2.56,"profile_path":"/dX1qlcIOY3fgixRdgvMGbLy3DSY.jpg"},{"character":"Sudha Dhawan","credit_id":"602444389979d2003fe87822","order":8,"adult":false,"gender":0,"id":2972476,"known_for_department":"Acting","name":"Himanshi Choudhry","original_name":"Himanshi Choudhry","popularity":2.684,"profile_path":"/i4pSMYUq4C7fAcCRsv9t8IUrUg0.jpg"},{"character":"Bhaisaab","credit_id":"61a99ca8d6819b008edbefcb","order":512,"adult":false,"gender":2,"id":123228,"known_for_department":"Acting","name":"Aamir Bashir","original_name":"Aamir Bashir","popularity":6.604,"profile_path":"/jWvHNzlDwbTyJaShBeXfIKl2QHU.jpg"},{"character":"Vijay Subramanian","credit_id":"61aae0b1001bbd001977da95","order":513,"adult":false,"gender":0,"id":3334716,"known_for_department":"Acting","name":"Himanshu Kapil","original_name":"Himanshu Kapil","popularity":0.6,"profile_path":null},{"character":"Vayu Raghavan","credit_id":"61a9a1261f33190061cc9a6c","order":514,"adult":false,"gender":0,"id":1323156,"known_for_department":"Acting","name":"Tanuj Virwani","original_name":"Tanuj Virwani","popularity":2.941,"profile_path":"/ly2yRwLExCgVneH2rI3vheQ5rOh.jpg"},{"character":"Lawyer khemani","credit_id":"61aae157bf09d1004097b085","order":515,"adult":false,"gender":0,"id":3333501,"known_for_department":"Acting","name":"Vihaan Chaudhary","original_name":"Vihaan Chaudhary","popularity":0.772,"profile_path":null},{"character":"Judge Roy","credit_id":"61a9a281383df2004596887c","order":516,"adult":false,"gender":2,"id":11861,"known_for_department":"Acting","name":"Dalip Tahil","original_name":"Dalip Tahil","popularity":3.135,"profile_path":"/4kgTd5aKh3IRxrJ7uG5h9mojb57.jpg"},{"character":"Adesh Rangayan","credit_id":"61aae1ab0cd44600882ca1f2","order":517,"adult":false,"gender":0,"id":2377493,"known_for_department":"Acting","name":"Mahesh Shetty","original_name":"Mahesh Shetty","popularity":0.974,"profile_path":"/rGxhEDfDwBffOOiUyyIlTJztO0X.jpg"},{"character":"Home Minister/Faisal Hussain","credit_id":"61aae243ea3949005e69be1d","order":518,"adult":false,"gender":0,"id":1938680,"known_for_department":"Acting","name":"Subhrajyoti Barat","original_name":"Subhrajyoti Barat","popularity":0.6,"profile_path":null},{"character":"Rohit Shanbhag","credit_id":"61a9cd45383df200647f086a","order":519,"adult":false,"gender":2,"id":1342538,"known_for_department":"Acting","name":"Akshay Oberoi","original_name":"Akshay Oberoi","popularity":2.224,"profile_path":"/dsFqDJzSzUiKZpicmj05Iv1YbOs.jpg"},{"character":"Coach Azeem Khan","credit_id":"61aae589e54d5d009270c408","order":520,"adult":false,"gender":2,"id":1296867,"known_for_department":"Acting","name":"Ankur Vikal","original_name":"Ankur Vikal","popularity":2.777,"profile_path":"/bV4EkfFSyvDm2oYxjaZVcGdGV9C.jpg"},{"character":"Girish Mukherjee","credit_id":"61a9a23e3dc313009188d007","order":521,"adult":false,"gender":0,"id":1408644,"known_for_department":"Acting","name":"Alekh Sangal","original_name":"Alekh Sangal","popularity":0.6,"profile_path":null}]},{"air_date":"2021-12-03","episode_number":4,"episode_type":"standard","id":3374999,"name":"Take the Light","overview":"The Roy Commission comes to a surprising conclusion based on facts from an unexpected source. Vayu and Rohit battle it off the field in the arena of sponsorships.","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/wNipaa6Kf4lboZjNLfB5judipBu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Allen Menezes","credit_id":"61a9ce75028420002dbd6a76","order":522,"adult":false,"gender":2,"id":2707475,"known_for_department":"Acting","name":"Ankur Rathee","original_name":"Ankur Rathee","popularity":5.866,"profile_path":"/5ZR7jiE4cGhaM6ZqBS6R7N7h5Q7.jpg"}]},{"air_date":"2021-12-03","episode_number":5,"episode_type":"standard","id":3375001,"name":"Swing and a Miss","overview":"Mantra goes public with her campaign. Zarina is on the verge of true power, only to be challenged by an unexpected contender at the last minute. The Indian team resents its new rookie.","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/vtDhg6aJoXpkpuEJl4na2LTsWKt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-03","episode_number":6,"episode_type":"standard","id":3375003,"name":"Not Quite Cricket","overview":"It's the first test between India and Pakistan, and the best laid plans...","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/iD24hitK42d1M2tdzwxTb4WsOVz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Allen Menezes","credit_id":"61a9ce75028420002dbd6a76","order":522,"adult":false,"gender":2,"id":2707475,"known_for_department":"Acting","name":"Ankur Rathee","original_name":"Ankur Rathee","popularity":5.866,"profile_path":"/5ZR7jiE4cGhaM6ZqBS6R7N7h5Q7.jpg"}]},{"air_date":"2021-12-03","episode_number":7,"episode_type":"standard","id":3375005,"name":"Sticky Wicket","overview":"Mantra is pushed into the corner as she negotiates impossible odds. Match fixing rears its ugly head, but the stakes are a lot more than mere money this time. Imaad's stellar performance in the previous match results in his biggest nightmare coming to life.","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/Alxhfd0ywhtQA4ZAKV1O1lfoIA8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-03","episode_number":8,"episode_type":"standard","id":3375007,"name":"Test","overview":"The second game against Pakistan is a test in the truest sense, a crucible of interference from the outside as the powers that be activate a game behind the game. The players must battle the opposition on the field and outside of it.","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/gpSZCOym7jA7v3tFV9xMBlb28eB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2021-12-03","episode_number":9,"episode_type":"standard","id":3375008,"name":"Castled","overview":"It's time for scores to be settled. Victory at all costs: using compassion or subterfuge, using words or... bullets.","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/1fKmF0cNFFVM1vJrXX0FnLZCxOU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Allen Menezes","credit_id":"61a9ce75028420002dbd6a76","order":522,"adult":false,"gender":2,"id":2707475,"known_for_department":"Acting","name":"Ankur Rathee","original_name":"Ankur Rathee","popularity":5.866,"profile_path":"/5ZR7jiE4cGhaM6ZqBS6R7N7h5Q7.jpg"}]},{"air_date":"2021-12-03","episode_number":10,"episode_type":"finale","id":3375009,"name":"Cricket is the Winner","overview":"As India take on Pakistan in the final test, the gentleman's game is incinerated, giving rise to a new cricketing order from its ashes.","production_code":"","runtime":45,"season_number":3,"show_id":72739,"still_path":"/tLisuhhEw4pDrapRFgHwiheFogD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Allen Menezes","credit_id":"61a9ce75028420002dbd6a76","order":522,"adult":false,"gender":2,"id":2707475,"known_for_department":"Acting","name":"Ankur Rathee","original_name":"Ankur Rathee","popularity":5.866,"profile_path":"/5ZR7jiE4cGhaM6ZqBS6R7N7h5Q7.jpg"}]}],"name":"Season 3","overview":"Amidst the greatest show on earth: an India v/s Pakistan cricket series, the politics of Indian cricket is laid bare, its secrets unraveled and truths exposed. The stakes have never been higher, even as they are investigated for corruption, battle lines are drawn for TV rights, endorsement deals and the captaincy of the Indian team. But what is the limit to the price of power?","id":219578,"poster_path":"/aSAcGUsxoioRhA1P17PqVAj9hJd.jpg","season_number":3,"vote_average":8.3}}}