{
    "adult": false,
    "backdrop_path": "/qqKohg7wyVrIGQXzrE4bymiQBWV.jpg",
    "created_by": [],
    "episode_run_time": [
        59
    ],
    "first_air_date": "2016-12-07",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "http://www.bbc.co.uk/programmes/b084ztrw",
    "id": 74595,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2018-08-16",
    "last_episode_to_air": {
        "id": 1630640,
        "name": "Episode 4",
        "overview": "In this episode, the fixers take on three more challenges to change lives, including one of their toughest yet when they try to help a young boy with Tourette's to control his tics and behavioural issues.\n\n11-year-old Malachi lives with his mum and younger brother in Cornwall. Malachi has Tourette's Syndrome, a neurological condition characterised by involuntary movements and noises called tics. He also has Attention Deficit Hyperactivity Disorder and struggles with disruptive urges and violent outbursts. At school, he needs three support workers with him at all times. As Malachi gets older, his behaviour is increasingly difficult for mum Marie to manage and she is increasingly worried that if he doesn't find a way to control himself, he will end up in serious trouble. Electronics engineer Ryan White teams up with Zoe Laughlin, an expert in materials, to explore what they can do. But their first encounter with Malachi leaves them concerned that they may have taken on more than they can manage. Knowing more about the condition could help them work out what to do, so their next stop is Great Ormond Street Hospital in London to meet one of the world's leading experts in the field, Dr Tara Murphy.\n\nFour-year-old Jasper suffered complications after contracting hand, foot and mouth disease when he was one year old. He had a heart attack and a stroke in his spine which left him paralysed from the waist down. His parents have sought the best medical help they can get for their son, in the hope that he will one day be able to walk again, but so far he has only gained enough strength to be able to crawl. They are hoping that the team can come up with an invention that will enable Jasper to be upright and moving his legs, so that he can work on building the strength in his muscles and get used to being in a standing position. Technologist and designer Haiyan Jang takes up the challenge and enlists the help of inventor and engineer Yusuf Mohammed to help search for a solution. Whatever they create needs to safely hold him up in the right position and also keep his young brain engaged so that he enjoys using it.\n\n26-year-old Greg is determined to be as independent as possible, despite being paralysed from the neck down. He led an extremely active and social life before a car crash dramatically changed his life four years ago. Now he has no control of his body and can only move his head to operate devices like his wheelchair and computer. Home is an assisted-living apartment in Bristol where he receives help with everyday tasks but, in order to remain active, he makes an arduous journey into the city centre on his own every day in his electric wheelchair. This two-mile trip would be straightforward enough for most people, but for Greg it is fraught with difficulties. With no use of his hands he is unable to press buttons on road crossing boxes, he can't use his mobile phone without asking strangers to pick it up and dial the numbers, and he has to give shop assistants his credit card pin number and ask them to use it for him. Designer and engineer Ross Atkin and software expert Akram Hussein pair up to see if they can come up with a solution. If they can crack it, they could potentially change the lives of many more people with similar disabilities.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2018-08-16",
        "episode_number": 4,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 59,
        "season_number": 2,
        "show_id": 74595,
        "still_path": "/nYJSbXIHqcFBi13NCiydr0MxEeM.jpg"
    },
    "name": "The Big Life Fix",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 332,
            "logo_path": "/7HVPn1p2w1nC5oRKBehXVHpss7e.png",
            "name": "BBC Two",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 7,
    "number_of_seasons": 2,
    "origin_country": [],
    "original_language": "en",
    "original_name": "The Big Life Fix",
    "overview": "The UK's leading inventors create ingenious new solutions to every-day problems and build life-changing solutions for people in desperate need.",
    "popularity": 0.72,
    "poster_path": "/kgWWkFrCicAeCdd4HZkSqM9iW3k.jpg",
    "production_companies": [
        {
            "id": 112365,
            "logo_path": "/tNHrNHJeKkPQa9itpccf8e5iaQS.png",
            "name": "Studio Lambert",
            "origin_country": "GB"
        }
    ],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2017-11-12",
            "episode_count": 1,
            "id": 113531,
            "name": "Specials",
            "overview": "",
            "poster_path": null,
            "season_number": 0,
            "vote_average": 0
        },
        {
            "air_date": "2016-12-07",
            "episode_count": 3,
            "id": 94208,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2018-07-26",
            "episode_count": 4,
            "id": 113530,
            "name": "Inventing the Impossible",
            "overview": "Leading inventors to come up with life-changing ways to help people.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 7,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "59ea9016c3a368251800614e",
            "air_date": "2016-12-07",
            "episodes": [
                {
                    "air_date": "2016-12-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1382181,
                    "name": "Episode 1",
                    "overview": "The team of inventors are challenged to come up with solutions for three very different problems. They attempt to help a terminally ill photographer who can no longer use his hands to operate a camera. They try to bring cutting-edge communication to a remote Welsh village which has no internet access and an unreliable telephone connection. And they work to give some control back to a young designer who has Parkinson's disease and who has been unable to use a pen since developing tremors in her hands two years ago.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 1,
                    "show_id": 74595,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1382182,
                    "name": "Episode 2",
                    "overview": "The UK's leading inventors create ingenious new solutions to every-day problems and build life-changing solutions for people in desperate need. The team attempt to tackle one of the biggest rural crimes in the UK and work to find a way to build a BMX bicycle for a young boy who was born with no hands or feet. Meanwhile, in Peterborough, 57-year-old Graham is suffering from locked-in syndrome, meaning he is almost completely paralysed and unable to speak. Can the team come up with a way for him to have conversations with the medical team around him and, most importantly, his family and friends?",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 1,
                    "show_id": 74595,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-12-21",
                    "episode_number": 3,
                    "episode_type": "finale",
                    "id": 1382183,
                    "name": "Episode 3",
                    "overview": "The UK's leading inventors create ingenious new solutions to every-day problems and build life-changing solutions for people in desperate need. Mum of two Shamreen suffers from a degenerative condition which has left her with very limited vision, and she is struggling to get around in public with her two young sons. Seven-year-old Rosie had brain surgery as a baby and now wears a cumbersome medical helmet. She desperately wants the team to invent her a new helmet that will be less visible and help her fit in with her friends. And the team are challenged with coming up with a solution to help two teenage brothers with cystic fibrosis - a debilitating disease that severely affects their breathing.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 1,
                    "show_id": 74595,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 94208,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5c0072f10e0a26486a025873",
            "air_date": "2018-07-26",
            "episodes": [
                {
                    "air_date": "2018-07-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1630637,
                    "name": "Episode 1",
                    "overview": "A team of inventors attempt to change the lives of three inspiring people with very different problems.\n\nForty-year-old Graham was passionate about snowboarding until an accident dramatically changed his life. He was caught up in an avalanche and buried under the snow for half an hour before rescuers could dig him out. Now he is severely disabled, spending most of his time in a wheelchair, and with limited use of his arms and legs. But, despite all the trauma he has suffered, Graham dreams of one thing - getting back on the slopes and back on his snowboard again. Can award-winning engineer Yusuf Muhammed help make his wish come true? There are already a range of skis and snowboards adapted for the disabled, but none that meet Graham's ambition - to stand upright and control the board independently.\n\nAlexander lives with a rare genetic disorder that causes extreme sensitivity to the sun's ultraviolet rays. He is 10,000 times more sensitive to sun light than the average person. If he exposes his skin it immediately blisters and burns, and he has a very high chance of getting skin cancer. He lives at home with his parents and for the last 24 years he has spent his life avoiding going outside. When he does go out he has to cover every inch of his body, including wearing a homemade helmet and visor which are bulky and draw the attention of everyone who sees him. For materials expert Zoe Laughlin, it is a huge challenge. She needs to find a way to protect Alex's skin from the harmful rays which is lightweight and ventilating, whilst allowing him to go out in public without being stared at.\n\nKyle's ambition has always been to be a hairdresser, but he was born with a deformed hand that makes it impossible for him to hold hair while cutting or styling it. Determined not to give up on his dream he has enrolled at a hairdressing academy, but he has reached a point where his disability is stopping him from progressing any further, and he cannot complete the course. Engineer Jude Pullen needs to come up with a solution that will give Kyle the dexterity required to work as a professional hairstylist. And, in a world where appearances are everything, it is important that whatever he designs looks the part too.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 2,
                    "show_id": 74595,
                    "still_path": "/j8CuLvfPY5UmzpoAJBF0XcPWPX0.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-02",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1630638,
                    "name": "Episode 2",
                    "overview": "A team of inventors attempt to change the lives of three inspiring people with very different problems.\n\nFour-year-old William has a rare form of epilepsy which causes him to have multiple seizures, some of which are life-threatening. These seizures can happen at any time. With doctors unable to control them through medication, and no suitable seizure alarms, William's parents have to take it in turns to watch him around the clock. Lack of sleep and constant worry over the last four years has left them both desperate for help. Designer and technologist Haiyan Zhang bravely agrees to take on one of the most emotionally charged problems of the series. Can she come up with an invention that will help William's parents to monitor him and ease the pressure they're under?\n\n19-year-old Ian was born with cerebral palsy which has left him with no control of his body and an inability to speak. Since he was a child, he has loved sailing - an activity he used to enjoy with his dad before he was killed in a car accident three years ago. Now Ian goes out on the water with a friend who has fashioned a rudimentary system so that Ian can signal directions to him using his eyes. This allows him to have some involvement in navigating the boat, but what he really wants is to have complete control of the vessel. Engineer Ryan White and experience designer Ruby Steel team up to see if they can come up with a solution. If they're successful, it'll be the first time anyone has ever sailed a boat using just their eyes. They're hopeful that their idea to use the eye-gaze technology that Ian already uses to operate his computer will work if they hook it up to motors on the boat.\n\nSusan has multiple sclerosis and lives alone. She was diagnosed when she was 40 years old and, as the symptoms have worsened over the years, she has worked hard to maintain her independence. Carers visit her twice a day to help her get in and out of bed and perform basic tasks, and her daughters visit regularly, but for much of the day she is on her own. Her flat has been kitted out with a range of assistive technology, but most of it is not fit for purpose. She has a tablet computer which she struggles to operate due to tremors in her hands and a computerised system to operate the telephone and various electrical items, which are difficult to navigate and hard to read as her eyesight is failing. Ruby's initial thought is to use the latest smart technology so that Susan can operate systems using her voice. But like many older people, Susan is not familiar with this latest technology and knowing how to navigate it and what commands to use is incredibly confusing for her. Ruby needs to find a way to make smart technology more accessible for people like Susan. If she can crack it, she could help her to remain living in her own home, and potentially help thousands of other elderly and vulnerable people to avoid loneliness and continue living independently.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 2,
                    "show_id": 74595,
                    "still_path": "/l7YRKEuZBKquofD0HYmUpHfnIAu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-09",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1630639,
                    "name": "Episode 3",
                    "overview": "The team of inventors are challenged to come up with ways to change the lives of three more inspiring individuals who are facing difficulties in their everyday lives.\n\n12-year-old Pollyanna lost her leg in a horrific accident when she was just two years old. She was waiting at a bus stop with her mother and grandmother when a bus careered into them, killing her grandmother and seriously injuring her and her mother. In the last ten years she has had 21 operations and been fitted with more than 20 different prosthetic legs as she has grown up. Despite the challenges she has faced, Pollyanna has a determination not to let her disability hold her back from achieving her goals, including her dream of becoming a ballerina. But the ballet world is unforgiving and Pollyanna has been marked down in exams for being unable to do moves that would involve her missing leg, including going up on her toes - or demi-pointe. Engineer Yusuf Mohammed takes up the challenge to build her a prosthetic leg with the required movement in the foot.\n\n73-year-old Bobby was born with brittle bone disease which has gradually resulted in him losing his hearing. The nerve endings in his ears are too damaged to have a hearing aid and Bobby's friends have known him since before he went deaf so they have never learnt to communicate with him through sign language. Due to advancing age, his lip reading skills are in decline and he struggles to understand anyone other than his wife Linda. In social situations this means that she must stay by his side and try to relay conversations - an arduous task which makes socialising increasingly difficult. Technologist and software engineer Akram Hussein jumps at the chance to see if he can help Bobby re-join group conversations with his friends. And he is willing to go the extra mile - even getting his ears temporarily filled with silicone so that he can experience what life is like for Bobby.\n\nTobijah was paralysed from the chest down in a car accident. The accident severely damaged his spinal cord and the signals from his brain no longer reach the nerves in his hands. As a result, he is no longer able to open and close his fists or pick things up. Whilst recovering in hospital he met his partner Sam. They now have a three-year-old daughter, and Tobijah longs to be able to enjoy some of the everyday father and daughter activities that most able-bodied people take for granted. Before his accident he was a keen cook, so he would particularly love to be able to bake a cake with her and prepare meals for his family. Materials expert Zoe Laughlin works with Tobijah to try and find a way for him to take control in the kitchen. Together they manage to fashion some bespoke handles that will enable him to hold utensils, but if he is going to be able to cook anything from scratch she needs to come up with a way to give him back the fine motor skills needed to follow recipes, including the ability to pick up and crack open eggs.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 2,
                    "show_id": 74595,
                    "still_path": "/pygxsQUbLOdn8AhrQRjfJ4domMo.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-16",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 1630640,
                    "name": "Episode 4",
                    "overview": "In this episode, the fixers take on three more challenges to change lives, including one of their toughest yet when they try to help a young boy with Tourette's to control his tics and behavioural issues.\n\n11-year-old Malachi lives with his mum and younger brother in Cornwall. Malachi has Tourette's Syndrome, a neurological condition characterised by involuntary movements and noises called tics. He also has Attention Deficit Hyperactivity Disorder and struggles with disruptive urges and violent outbursts. At school, he needs three support workers with him at all times. As Malachi gets older, his behaviour is increasingly difficult for mum Marie to manage and she is increasingly worried that if he doesn't find a way to control himself, he will end up in serious trouble. Electronics engineer Ryan White teams up with Zoe Laughlin, an expert in materials, to explore what they can do. But their first encounter with Malachi leaves them concerned that they may have taken on more than they can manage. Knowing more about the condition could help them work out what to do, so their next stop is Great Ormond Street Hospital in London to meet one of the world's leading experts in the field, Dr Tara Murphy.\n\nFour-year-old Jasper suffered complications after contracting hand, foot and mouth disease when he was one year old. He had a heart attack and a stroke in his spine which left him paralysed from the waist down. His parents have sought the best medical help they can get for their son, in the hope that he will one day be able to walk again, but so far he has only gained enough strength to be able to crawl. They are hoping that the team can come up with an invention that will enable Jasper to be upright and moving his legs, so that he can work on building the strength in his muscles and get used to being in a standing position. Technologist and designer Haiyan Jang takes up the challenge and enlists the help of inventor and engineer Yusuf Mohammed to help search for a solution. Whatever they create needs to safely hold him up in the right position and also keep his young brain engaged so that he enjoys using it.\n\n26-year-old Greg is determined to be as independent as possible, despite being paralysed from the neck down. He led an extremely active and social life before a car crash dramatically changed his life four years ago. Now he has no control of his body and can only move his head to operate devices like his wheelchair and computer. Home is an assisted-living apartment in Bristol where he receives help with everyday tasks but, in order to remain active, he makes an arduous journey into the city centre on his own every day in his electric wheelchair. This two-mile trip would be straightforward enough for most people, but for Greg it is fraught with difficulties. With no use of his hands he is unable to press buttons on road crossing boxes, he can't use his mobile phone without asking strangers to pick it up and dial the numbers, and he has to give shop assistants his credit card pin number and ask them to use it for him. Designer and engineer Ross Atkin and software expert Akram Hussein pair up to see if they can come up with a solution. If they can crack it, they could potentially change the lives of many more people with similar disabilities.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 2,
                    "show_id": 74595,
                    "still_path": "/nYJSbXIHqcFBi13NCiydr0MxEeM.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Inventing the Impossible",
            "overview": "Leading inventors to come up with life-changing ways to help people.",
            "id": 113530,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    }
}