{"adult":false,"backdrop_path":"/sJTEU16mHWF0YYth8ZBJLsCgcua.jpg","created_by":[],"episode_run_time":[53],"first_air_date":"2016-11-14","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://soundbreaking.com/","id":74811,"in_production":false,"languages":["en"],"last_air_date":"2016-11-23","last_episode_to_air":{"id":1425146,"name":"I Am My Music","overview":"Shifts the focus away from the creation of music to the experience of listening to it, and to the formats that have shaped and ultimately defined that experience. From vinyl, cassette tape, CD, and MP3, each generation has had a piece of musical media to call its own– a way of listening that determines not only how and where we listen, but also the manner in which we collect, store, and share the music we love. What remains unchanged is the fundamental miracle of recorded music for the listener: the music we listen to becomes a pivotal part of who we are.","vote_average":0,"vote_count":0,"air_date":"2016-11-23","episode_number":8,"episode_type":"finale","production_code":"","runtime":53,"season_number":1,"show_id":74811,"still_path":"/vDsJQL9KUucy19A0l8FKqO4hAtC.jpg"},"name":"Soundbreaking","next_episode_to_air":null,"networks":[{"id":14,"logo_path":"/hp2Fs7AIdsMlEjiDUC1V8Ows2jM.png","name":"PBS","origin_country":"US"}],"number_of_episodes":8,"number_of_seasons":1,"origin_country":["US"],"original_language":"en","original_name":"Soundbreaking","overview":"Explore the art of music recording with a behind-the-scenes look at the birth of brand new sounds. Featuring more than 160 original interviews with some of the most celebrated recording artists of all time, Soundbreaking explores the nexus of cutting-edge technology and human artistry that has created the soundtrack of our lives.","popularity":1.979,"poster_path":"/p8Y2JWUn2I5woBsuAcLhNoqy5Zz.jpg","production_companies":[{"id":118901,"logo_path":null,"name":"Higher Ground","origin_country":""}],"production_countries":[],"seasons":[{"air_date":"2016-11-14","episode_count":8,"id":94665,"name":"Miniseries","overview":"","poster_path":"/f82LJEJbbyLvsnhWixRQxd9DQBm.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Miniseries","vote_average":7.2,"vote_count":8,"season_data":{"1":{"_id":"59f99ce6c3a3682d3d0111bf","air_date":"2016-11-14","episodes":[{"air_date":"2016-11-14","episode_number":1,"episode_type":"standard","id":1387672,"name":"The Art of Recording","overview":"Soundbreaking begins where a recording does––at the intersection of inspiration and execution. There stands the enigmatic figure of the record producer, the person charged with the critical task of both realizing an artist’s vision and capturing it for posterity. Profiling some of the most accomplished and revered producers in the recording industry, Episode One offers a study in contrasting styles and approaches. In the process, The Recording Artist underscores the way in which any music recording is the product of a delicate and infinitely variable balance between man and machine.","production_code":"","runtime":53,"season_number":1,"show_id":74811,"still_path":"/sJTEU16mHWF0YYth8ZBJLsCgcua.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-15","episode_number":2,"episode_type":"standard","id":1425133,"name":"Painting with Sound","overview":"\"Painting with Sound\" chronicles a watershed event in the history of music: the moment when the recording studio itself effectively became an instrument and gave rise to sounds that could never be reproduced live. Beginning with the advent of magnetic tape and multi-tracking technology, episode 2 charts the evolution of multi-track recording, and reveals how recording artists such as the Beatles, the Beach Boys and Pink Floyd used their imagination and ingenuity to transform the sound of popular music.","production_code":"","runtime":53,"season_number":1,"show_id":74811,"still_path":"/Atdk1XlZhDln1SzianaPUUad1xb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-16","episode_number":3,"episode_type":"standard","id":1425134,"name":"The Human Instrument","overview":"Celebrating the most powerful of all instruments--the human voice--the third episode of Soundbreaking surveys the range of ingredients that go into a perfect vocal track. At once the most fundamental component of a song and the most challenging to capture, the vocal track is the product of a complex collaboration between performer, producer, and sound engineer--a titrate of artistic commitment, compelling concept, and technical wizardry that, at its best, turns a lyric into the soul of the song. Featuring rare studio footage of some the world's most renowned vocalists--from blues divas to suave crooners to rock star screamers--the show considers the gamut of tricks and techniques that can both enhance and alter the human voice, and explores the ineffable emotional quality that makes a vocal track truly great.","production_code":"","runtime":53,"season_number":1,"show_id":74811,"still_path":"/zNhuQFj26sfqAeg2BrXnnOPSQMT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-17","episode_number":4,"episode_type":"standard","id":1425137,"name":"Going Electric","overview":"The fourth episode in our series tells the story of the most elemental force in recording--electricity--and the musical revolution it sparked. Highlighting the way in which electricity has been harnessed and channeled to create new and never-before-heard sounds, Going Electric traces both the chain reaction unleashed by the invention of the electric guitar and the evolution of synthesized music. From Delta blues to Chicago blues to The Rolling Stones and Jimi Hendrix, from Stevie Wonder and The Who to EDM, Episode Four looks at the process by which science and engineering becomes sound, and reveals the power of technology to continuously redefine what we mean when we say the word \"music.\"","production_code":"","runtime":53,"season_number":1,"show_id":74811,"still_path":"/nDZ10c6vdCSy0u7Gn9pzzCBymDj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-18","episode_number":5,"episode_type":"standard","id":1425140,"name":"Four on the Floor","overview":"If the vocal track is the heart of a song, the rhythm track--the beat--is its body. It is the sonic element that taps into the most primal part of us and makes us want to move. The Rhythm Track breaks the beat down, and examines the endless experimentation that has taken place in its core, the very bedrock of all music. Charting the progression of the beat from drum and bass to beatbox and beyond--from Little Richard and James Brown to disco and EDM--Episode Five listens in on the ongoing dialogue between dance floor and recording studio, and captures the ever-evolving process of building an irresistible beat.","production_code":"","runtime":53,"season_number":1,"show_id":74811,"still_path":"/kcw6zr854hCgXEyTbWid98LRsP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-21","episode_number":6,"episode_type":"standard","id":1425142,"name":"The World Is Yours","overview":"The sixth episode of Soundbreaking looks at a musical revolution that was not only inspired by recording but born from its history: the art of sampling--a kind of musical equivalent of Adam's rib. Beginning with the pioneers of hip hop (Afrika Bambaataa, Chuck D, Rick Rubin), the episode tracks the way in which the practice of borrowing fragments from existing records created a new genre--a potent musical form that emerged from the margins, up-ended the establishment, and set in motion a controversy over copyright that has yet to be resolved. As we survey the development of sampling and its multiple, varied incarnations over the years since, Episode Six explores the complex sonic landscapes which, by their very existence, pay tribute to the art of recording itself, and examines the eternally blurred line between theft and homage.","production_code":"","runtime":53,"season_number":1,"show_id":74811,"still_path":"/rdYWgco51PUYdJrsi0B9tjMssmH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-22","episode_number":7,"episode_type":"standard","id":1425143,"name":"Sound & Vision","overview":"The penultimate episode in our series proceeds from the once-preposterous notion that music is a visual art form. Chronicling the era in which MTV forged an indelible and inextricable link between recorded music and the newly emergent music video, Sound and Vision considers what it means to see music as well as hear it. Offering unprecedented exposure to artists with a knack for the form-- Michael Jackson, Madonna, Billy Idol, the Eurythmics--MTV turned singles into smash hits and musical performers into international celebrities. It also created new expectations of musical entertainment and imposed new burdens on recording artists. Tracking the music video from MTV to the internet, Episode Seven tells the story of how a one-time marketing tool became a powerful mediator between artist and audience, and illuminates the music video's role in the popular music of today.","production_code":"","runtime":53,"season_number":1,"show_id":74811,"still_path":"/fkrgAmmG0dkxeWTVrNccqPLZis9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2016-11-23","episode_number":8,"episode_type":"finale","id":1425146,"name":"I Am My Music","overview":"Shifts the focus away from the creation of music to the experience of listening to it, and to the formats that have shaped and ultimately defined that experience. From vinyl, cassette tape, CD, and MP3, each generation has had a piece of musical media to call its own– a way of listening that determines not only how and where we listen, but also the manner in which we collect, store, and share the music we love. What remains unchanged is the fundamental miracle of recorded music for the listener: the music we listen to becomes a pivotal part of who we are.","production_code":"","runtime":53,"season_number":1,"show_id":74811,"still_path":"/vDsJQL9KUucy19A0l8FKqO4hAtC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Miniseries","overview":"","id":94665,"poster_path":"/f82LJEJbbyLvsnhWixRQxd9DQBm.jpg","season_number":1,"vote_average":0}}}