{
    "adult": false,
    "backdrop_path": null,
    "created_by": [],
    "episode_run_time": [
        45
    ],
    "first_air_date": "2017-03-13",
    "genres": [],
    "homepage": "http://www.bbc.co.uk/programmes/b08jqbrr",
    "id": 75148,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2017-03-31",
    "last_episode_to_air": {
        "id": 1394710,
        "name": "Episode 15",
        "overview": "The Metropolitan Police try to identify a suspect accused of killing a man and shooting a policeman in Brazil back in November 1994. Detective Sergeant Pete Rance is working on another unusual case. The man he is looking for is wanted in connection with one of the most notorious match-fixing scandals in the history of cricket. And Martin Evans's incredible scam convinced dozens of people to invest in a dodgy ostrich farm. After going on the run to avoid prison, Evans reinvented himself as an international drug smuggler and is believed to have made more than £37 million. His flight from justice took him to Cyprus and South Africa, where he was eventually arrested. Evans was finally jailed for 21 years for fraud and drug trafficking. At a Johannesburg court, a judge ordered his extradition.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2017-03-31",
        "episode_number": 15,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 45,
        "season_number": 1,
        "show_id": 75148,
        "still_path": null
    },
    "name": "Fugitives",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 4,
            "logo_path": "/uJjcCg3O4DMEjM0xtno9OWFciRP.png",
            "name": "BBC One",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 15,
    "number_of_seasons": 1,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Fugitives",
    "overview": "Fugitives is a BBC series that follows the work of the Metropolitan Police's Extradition Unit, who have national responsibility for locating and arresting fugitives wanted worldwide, and gains exclusive access to the work of the International Crime Bureau at the National Crime Agency, who co-ordinate the search for British men and women on the run abroad and European offenders hiding out in the UK. The series also follows officers in West Yorkshire and central England, who track and arrest wanted foreign nationals from day to day.\n\nFilming with officers from the Spanish National Police's Fugitives Unit and Amsterdam's Serious and Organised Crime teams, the programme also tells the stories of how notorious British criminals were arrested abroad. Criminals like drug trafficker Mark Lilley, who was arrested in a safe room in a Spanish villa; armed robber Andrew Moran, who was caught as he relaxed by a pool in his luxury villa, and Sean Devalda who tried to hijack a cash delivery van. He was tracked down to a remote hideout by a Dutch SWAT team.",
    "popularity": 0.303,
    "poster_path": "/ev2q9LMqMZs3rz4taHbBE5Uswe7.jpg",
    "production_companies": [
        {
            "id": 4762,
            "logo_path": "/cey5EAFwOb7AfDOsQ4p4q5MixzX.png",
            "name": "BBC Cymru Wales",
            "origin_country": "GB"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2017-03-13",
            "episode_count": 15,
            "id": 95489,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "5a10de0a92514138f303f3dd",
            "air_date": "2017-03-13",
            "episodes": [
                {
                    "air_date": "2017-03-13",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1394696,
                    "name": "Episode 1",
                    "overview": "Mark Lilley, a dangerous gangster with a reputation for violence, has been on the run for 13 years. When a search of his luxury villa draws a blank, Inspector Olga Lizana from the Spanish National Police's Fugitives Unit is determined to find his secret hiding place. In 2016, the Metropolitan Police's Extradition Unit arrested over 500 foreign fugitives hiding out in the capital. A six-month search for a Polish murderer leads DS Pete Rance and his team to a flat in south west London. An arrest soon follows and the man, who kicked another to death, is sent back to prison in Poland. West Yorkshire Police have one of the busiest extradition teams in the country. PCs Dave Lockwood and Tom Allen are on the hunt for a man convicted for theft and assault in the Czech Republic. The criminal they are after thinks he has found the perfect place to dodge the law.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1394697,
                    "name": "Episode 2",
                    "overview": "The search for a member of a Salford gang leads the UK's National Crime Agency and detectives from Amsterdam police to a small village in the Netherlands. Once the wanted man has been sighted, a Dutch Swat team are called in to to arrest the British fugitive, who has been on the run for four years. In Leeds a grandmother with a history of dealing in amphetamines back home in Poland is shocked to discover that West Yorkshire police have tracked her down while she babysits her granddaughter. A UK-wide week-long operation targeting foreign criminals leads to the arrest of another Polish drug dealer on the run to escape a six-year jail sentence. And former undercover officer Peter Bleksley lifts the lid on what it is like to be a man in hiding.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1394698,
                    "name": "Episode 3",
                    "overview": "In London, the specialist officers from the Metropolitan Police's Extradition Unit have a difficult case. Can they identify and arrest a man accused of horrific crimes committed during the Gujarat massacre in India in 2002? He is now thought to be working behind the counter of a Hounslow newsagents. When the UK's National Crime Agency seize their biggest ever haul of cocaine, hidden in a lorry full of Argentinian beef, the international hunt for a major British drugs smuggler begins. He is tracked down thanks to the determination of Dutch undercover police. In Leeds, officers go on the hunt for a man accused of people-trafficking offences by the police in Portugal. And why did the 500 euro note disappear? A look at how the authorities are stamping down on criminals' reliance on ready cash.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-16",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1394699,
                    "name": "Episode 4",
                    "overview": "In Redditch, Worcestershire, it takes determined policing to track down an elusive Polish drug dealer who has already been sentenced to a total of 45 years behind bars back home. In the Netherlands, Amsterdam's Serious and Organised Crime team spend months tracking down two Liverpool gangsters who ran a campaign of terror from a prison cell. Their time on the run abroad comes to an end because their own mobile phones give them away. In West Yorkshire the search for a wanted man takes on an unexpected twist as PCs Dave Lockwood and Tom Allen discover a huge cannabis farm at an address linked to a fugitive. And the National Crime Agency launch an appeal in the Netherlands to help them track down some of the UK's most wanted.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-17",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1394700,
                    "name": "Episode 5",
                    "overview": "It is an early start for the Metropolitan Police's Extradition Team as they set out to find a vicious man with a history of assault and fraud who is hiding from the law. In Leeds, West Yorkshire Police track down a man who has made a new life for himself in the UK. He is arrested and taken before a judge, who makes a decision on his extradition to the Czech republic. And police in Amsterdam use their facial recognition skills to track down a notorious Merseyside criminal hiding out in their city. In London, the search for more super recognisers continues.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-20",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1394701,
                    "name": "Episode 6",
                    "overview": "For the past month officers Dave Lockwood and Tom Allen have been searching for a Polish man convicted of a series of increasingly violent robberies. The trail eventually leads them to a house which appears deserted - where a thorough search leads to an unexpected discovery. One shady character who thought he could escape to the sunshine was Manchester-born con-artist Tony Murphy. A fraudster with a taste for exotic and expensive foreign trips, Murphy got his hands on hundreds of thousands of pounds of cash and assets by lying through his teeth. He fled the UK in October 2012 to avoid a prison sentence, but when he opted for a luxury life in Spain, it was his daily routine that gave him away. In the West Midlands, Sergeant Ian Hands is searching for a wanted man, convicted of seven fraud offences in Poland back in 2005. An early morning call brings results.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-21",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1394702,
                    "name": "Episode 7",
                    "overview": "In Spain, Inspector Olga Lizana from the Spanish National Police's Extradition team is searching for fugitive Andrew Moran, who has been on the run for seven years. He escaped from a British courtroom, seven weeks into a trial for violent robbery. In Coventry, officers from West Midlands Police stage a dawn raid. They're searching for a Polish man who has already served six years in prison for murder. Now the Home Office wants him out of the UK. In London, the Extradition Unit at the Metropolitan Police are on a week-long operation. Today's target is a man convicted of producing and selling counterfeit CDs and DVDs back home in Poland. It's only a quarter to six in the morning, but DS Pete Rance and his team are already making an arrest.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-22",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1394703,
                    "name": "Episode 8",
                    "overview": "It's double trouble for officers Dave Lockwood and Tom Allen, as they go searching for two wanted men in one small West Yorkshire town. The first target is a Polish man wanted for crimes he committed home in Poland fifteen years ago, whilst the second is a Hungarian man convicted of a series of burglaries. In London, a helpful suspect introduces detectives to technology to overcome their language barrier. The man they've arrested only speaks Romanian, but on their way to custody he finds a way of making himself understood. And unlucky drugs courier Scott Coleman, who was first arrested after trying to sell drugs to an undercover policeman, is arrested by Dutch police after more than a decade on the run in Spain and the Netherlands.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-23",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1394704,
                    "name": "Episode 9",
                    "overview": "A series of dawn raids across London leads to the arrest of an elusive Portuguese woman wanted for forgery and embezzlement. When a Leeds teenager was almost beaten to death on camera, detectives in West Yorkshire struggled to find the man responsible. When they widened the seach, sharing the wanted man's DNA with forces across Europe, a swift arrest soon followed in Slovakia. And the Salford gang member who took part in an audacious armed attack on a prison van is tracked down by Spanish police, and arrested as he sits down to breakfast with his mates at a roadside cafe.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-24",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 1394705,
                    "name": "Episode 10",
                    "overview": "In London, Detective Sergeant Pete Rance from the Metropolitan Police's Extradition Unit leads a team serving European arrest warrants in the capital. Top of his list today is a man accused of a vicious murder back in Poland. Drug dealer Glen Madden fled the UK to hide on Amsterdam's busy streets. His photograph was circulated to a team of super-spotters in the Dutch capital. Within months the covert detectives, with a heightened ability to recognise faces, tracked him down. In Keighley, PC Tom Allen is determined to find a man accused of stealing and killing pigs back home in Hungary. And solving crime with social media - how the victim of one sexual predator used Facebook to track him down.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-27",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 1394706,
                    "name": "Episode 11",
                    "overview": "The Metropolitan Police's extradition team stage a double dawn raid as they search for two brothers on the run from the USA. Charged with the cultivation and supply of almost four kilograms of illegal hallucinogenic mushrooms back in 2009, the brothers fled the US while awaiting trial. West Yorkshire is home to one of the busiest extradition units in the UK. PCs Dave Lockwood and Tom Allen are out looking for a Polish man who is accused of theft and fraud. Every year the National Crime Agency and Crimestoppers run Operation Captura. Giant screens displaying wanted faces are displayed in popular tourist resorts in Spain. One of the operation's biggest success stories was the arrest of paedophile Michael McCartney, hours after his face was displayed on billboards and TV in Alicante.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-28",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 1394707,
                    "name": "Episode 12",
                    "overview": "Robert Knight was part of an organised gang of smugglers based in Birmingham. Back in early 2008, West Midlands Police were on their trail. But once they had seized a shipment of cocaine worth £300,000 at Heathrow, Knight went on the run. Intelligence from the National Crime Agency led to his arrest in a Spanish bar by Spain's leading fugitive hunter, Detective Olga Lizana. In east London, the Metropolitan Police's extradition team are on the hunt for a man with a history of domestic violence. And in Worcestershire, PCs Danny Evans and Karl Lacey have a long list of fugitives to find. Top of the list is a 33-year-old drug dealer who has already been sentenced to two years in prison back in Poland.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-29",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 1394708,
                    "name": "Episode 13",
                    "overview": "Noel Cunningham tried to steal more than a million pounds from a cash-in-transit van in Brixton, south London, over a decade ago. Six years after a violent escape, intelligence from the UK's National Crime Agency linked the armed robber to the Netherlands. In Amstelveen, on the outskirts of Amsterdam, a local policeman was sent the fugitive's mugshot. Thirty minutes later he spotted the fugitive in a bar and called for back-up. In London, DS Pete Rance and his team are faced with a challenge. A Turkish man convicted of death by dangerous driving should be going home. He is due to board a plane at Heathrow, but he is refusing to leave his flat. Will the officers manage to get him extradited?",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-30",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 1394709,
                    "name": "Episode 14",
                    "overview": "It is a tough shift for PC Dave Lockwood and his team in West Yorkshire, but they eventually track down a man facing a year in prison for a crime he committed more than ten years ago. The Met go in search of a violent robber with a history of going on the run. Sunny Cyprus is a notorious hideout for British fugitives, including one multimillion-pound fraudster who thought he was untouchable. Michael Voudouri laundered eleven and half million pounds through bank accounts and business transactions, but Scottish tax officers tracked him down to a villa in Cyprus.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-31",
                    "episode_number": 15,
                    "episode_type": "finale",
                    "id": 1394710,
                    "name": "Episode 15",
                    "overview": "The Metropolitan Police try to identify a suspect accused of killing a man and shooting a policeman in Brazil back in November 1994. Detective Sergeant Pete Rance is working on another unusual case. The man he is looking for is wanted in connection with one of the most notorious match-fixing scandals in the history of cricket. And Martin Evans's incredible scam convinced dozens of people to invest in a dodgy ostrich farm. After going on the run to avoid prison, Evans reinvented himself as an international drug smuggler and is believed to have made more than £37 million. His flight from justice took him to Cyprus and South Africa, where he was eventually arrested. Evans was finally jailed for 21 years for fraud and drug trafficking. At a Johannesburg court, a judge ordered his extradition.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 1,
                    "show_id": 75148,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 95489,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    }
}