{
    "adult": false,
    "backdrop_path": "/sqi2ZXaHRGQAxZDCFitKQjUS91P.jpg",
    "created_by": [],
    "episode_run_time": [
        21
    ],
    "first_air_date": "2017-12-14",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "http://www.foodnetwork.com/shows/the-grill-dads",
    "id": 76531,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2018-02-09",
    "last_episode_to_air": {
        "id": 1421417,
        "name": "Outrageous Mashed-Up Munchies",
        "overview": "The Grill Dads find out that outrageous food is more fun when it's a mash-up. First, they visit The Doughnut Lounge in Kansas City, Mo., where they whip up homemade doughnuts and pair them with crispy burnt ends from in-house smoked brisket to create a sweet and savory dessert that's too unique to miss. Then the Dads visit Albuquerque, N.M., to fry up a pastry called a Sopapilla that's stuffed with spicy beef and pork ribs. Finally, the Dads travel to Denver, Colo., to make a gorgeous pizza topped with the flavors of chicken parmesan.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2018-02-09",
        "episode_number": 10,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 21,
        "season_number": 1,
        "show_id": 76531,
        "still_path": null
    },
    "name": "The Grill Dads",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 143,
            "logo_path": "/tm2UclPxfamHyFuILLq4jNxsi8v.png",
            "name": "Food Network",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 10,
    "number_of_seasons": 1,
    "origin_country": [],
    "original_language": "en",
    "original_name": "The Grill Dads",
    "overview": "Hit the road with Mark and Ryan, BFF dads with a combined love of all things grilled, fried, creative and downright flavorful. They'll showcase some of the most-epic bites to leave you wanting more-and perhaps serve up a few dad jokes while they're at it.",
    "popularity": 0.357,
    "poster_path": "/fayfoJM6lSlNsc3eR3br9wn4jZT.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2017-12-14",
            "episode_count": 10,
            "id": 98180,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Reality",
    "vote_average": 6,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "5a63444b9251410b2d00bf94",
            "air_date": "2017-12-14",
            "episodes": [
                {
                    "air_date": "2017-12-14",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1421405,
                    "name": "Big Eats for the Kid at Heart",
                    "overview": "The Grill Dads kick off their delicious road adventure by going on the hunt for over-the-top versions of food their kids absolutely love. In Portland, Oregon, they find The Grilled Cheese Grill where everyone's favorite sammie is the star player. The Dads have had a thousand grilled cheeses, but they've never had one stuffed with a decadent burger. At Boise Fry Company, the Dads discover crispy French fries, bison poutine and fried mashed potato balls. Finally, the Dads travel to San Francisco's Bacon Bacon, where the bacon so good they say it twice. On tap are fried bacon mac and cheese balls, and a juicy chicken sandwich breaded with salty bacon dust.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-12-15",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1421406,
                    "name": "Frying Just Makes It Awesome",
                    "overview": "The road trip continues as the Grill Dads search the country for classic comfort dishes fried up into surprising and incredible meals. In San Francisco, they belly up to Capo's for the world's best fried deep-dish pizza. Then it's on to Seattle where Katsu Burger's Godzilla Attack is a katsu-style monster to devour. Finally, the Grill Dads visit Backstreet Grill in Albuquerque, New Mexico, for a fried duck burrito flavored with New Mexican chilies and served like a sushi roll.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-12-22",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1421407,
                    "name": "Mornings Are Better With Treats",
                    "overview": "The Grill Dads are on the hunt for over-the-top, incredible breakfast creations. The first stop is La Waffleria in Albuquerque, N.M., where the Dads take on a ranchero waffle made from scratch with blue corn, spiced up with local chilies and covered with smoky sauce. Next up, the Grill Dads bring the carnival to breakfast when they visit Straw in San Francisco, a funky hole in the wall with a circus theme serving up a sugary house-made Donut Breakfast sandwich and a Texas toast Croque Madame. Finally, the Grill Dads visit Denver, Colo., in search of a tender biscuit made from surprising ingredients and transformed into buttery French toast.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-12-29",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 1421408,
                    "name": "Not Your Ordinary Classics",
                    "overview": "Classic food with outrageous twists are on the menu as the Grill Dads continue their road trip adventure across America. First stop is Jackson, Wyo., where the Dads take on cheesy nachos by piling them high with tender elk meat braised to perfection and wash them down with an adult take on a classic root beer float made with stout beer. Next up, the Dads visit Kansas City, Mo., where the loaded baked potato is reimagined as bite-sized gnocchi. Finally, the Dads head to Portland, Ore., where Tilt takes the classic hamburger on vacation to Hawaii with their teriyaki Island Trucker burger. The Dads finish it off by baking a decadent peanut butter pie and turning it into a creamy milkshake.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-05",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 1421409,
                    "name": "Food Like A Cozy Hug",
                    "overview": "The Grill Dads travel to Minneapolis, Minn., where classic chicken pot pie is elevated into a 10,000 Lakes Pot Pie topped with a homemade, buttery puff pastry dough. Next, the Dads head to Austin, Texas, for a plate of homemade beef chili prepared at the Texas Chili Parlor and served underneath a decadent Mac and Cheese. Finally, the Dads travel to the heart of BBQ country, Kansas City, Mo., for a burnt end brisket bowl, smoked up for 15 hours and served on top of some of the best BBQ baked beans the Dads have ever witnessed.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-12",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 1421412,
                    "name": "Bigger, More Outrageous Meats",
                    "overview": "The Grill Dads head to Jackson, Wyo., for an insanely ginormous 40-ounce steak that's not for the faint of heart! Next, they visit The Swinery in Seattle, Wash., where they cure and fry up some house-made pork belly and bacon for a spectacular BLT sandwich. Finally, the Dads travel to Minneapolis, Minn., to Butcher and The Boar for their green chorizo served on top of black beans with cumin creme fraiche.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-19",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 1421413,
                    "name": "More of the Good Stuff, Please!",
                    "overview": "The Grill Dads' epic road trip continues as they head to the Saint Lawrence Gridiron in Boise, Idaho, for a house-rubbed 18-ounce beef rib that's braised and grilled to fall-off-the-bone perfection. Then the Dads go to Minneapolis, Minn., for a breakfast pizza fully loaded with surprising toppings and baked up on a Neapolitan crust. Finally, the Dads head to Denver, Colo., to try Chubby's Mexican Hamburger, a unique mashup burrito stuffed with seared ground beef and covered with green chili and chicharrons.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-01-26",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 1421414,
                    "name": "Flavor Big, Flavor Deep",
                    "overview": "The Grill Dads outrageous adventures in eating take them to Jackson, Wyo., to feast on a tender pork shank that's breaded and deep fried into crispy, juicy goodness. Then the Dads head to Austin, Texas, for a unique take on Pad Thai that's spiced with Thai flavors and served as tacos. Finally, the Dads discover a unique burrito made with Vietnamese beef noodle soup, the Phorrito, in Portland, Oregon.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-02",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 1421415,
                    "name": "I Didn't Know You Served That Here",
                    "overview": "The Grill Dads continue their road trip hunting for outrageous food in surprising places. First up is the Basque Market in Boise, Idaho, where they whip up a stunning Spanish rice seafood paella. Next, the Dads travel to Austin, Texas, to one of the most unique Chinese dumpling houses in the country, Wu Chow, where they help make Chicken Bao buns. Finally, the Dads visit Seattle, Wash., for some original paprika-spiced chicken wings that literally tower over any other chicken wing out there.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-09",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 1421417,
                    "name": "Outrageous Mashed-Up Munchies",
                    "overview": "The Grill Dads find out that outrageous food is more fun when it's a mash-up. First, they visit The Doughnut Lounge in Kansas City, Mo., where they whip up homemade doughnuts and pair them with crispy burnt ends from in-house smoked brisket to create a sweet and savory dessert that's too unique to miss. Then the Dads visit Albuquerque, N.M., to fry up a pastry called a Sopapilla that's stuffed with spicy beef and pork ribs. Finally, the Dads travel to Denver, Colo., to make a gorgeous pizza topped with the flavors of chicken parmesan.",
                    "production_code": "",
                    "runtime": 21,
                    "season_number": 1,
                    "show_id": 76531,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 98180,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        }
    }
}