{"adult":false,"backdrop_path":"/hbUjFKL6unOx9ZMRIygojphxQYj.jpg","created_by":[],"episode_run_time":[29],"first_air_date":"2016-02-01","genres":[{"id":99,"name":"Documentary"}],"homepage":"http://www.bbc.co.uk/programmes/b07mdvbd","id":76639,"in_production":false,"languages":["en"],"last_air_date":"2020-03-28","last_episode_to_air":{"id":1681669,"name":"Edmonton to Jasper","overview":"Michael Portillo continues west through the Canadian Prairie on his thousand-mile rail journey from Winnipeg, Manitoba, to Jasper, Alberta. Following his 1899 Appleton’s guide, Michael explores a glossy, glassy, oil-rich Edmonton, second city of Alberta. On the banks of the North Saskatchewan River, he travels three centuries back in time to experience the life of les voyageurs, who travelled huge distances within Canada by foot and canoe to trade fur with indigenous people.\n\nMichael admires Edmonton’s early 20th-century heritage streetcars, preserved by the Radial Railway Society, and seizes the chance to drive one across a spectacular high-level bridge over the North Saskatchewan River.\n\nEdmonton prides itself on its modern light rail system, offering rapid transit to 80 million passengers per year. Michael hears how this growing city plans to keep pace. His journey across Canada’s vast open spaces reaches a dramatic scenic conclusion in the Rocky Mountains.","vote_average":0,"vote_count":0,"air_date":"2020-03-28","episode_number":10,"episode_type":"standard","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/ovn9Xem6pc7WnRMSygZfb5PNK8B.jpg"},"name":"Great American Railroad Journeys","next_episode_to_air":null,"networks":[{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":75,"number_of_seasons":4,"origin_country":["GB"],"original_language":"en","original_name":"Great American Railroad Journeys","overview":"Michael Portillo crosses the Atlantic to ride the railroads of America, armed with Appleton's General Guide to the United States, published in 1879.","popularity":7.689,"poster_path":"/hJZhzcAi5D5ZOBz8r6ur0cx46qu.jpg","production_companies":[{"id":26554,"logo_path":"/8KCY7SFDapSTQhEVH6jQMaabCmV.png","name":"FremantleMedia","origin_country":"GB"}],"production_countries":[{"iso_3166_1":"GB","name":"United Kingdom"}],"seasons":[{"air_date":"2016-07-25","episode_count":28,"id":130558,"name":"Specials","overview":"All Series was repeated later in the year in a revised schedule (described as \"Reversions\") which combined and re-edited two episodes of the original broadcasts to create a series of 1-hour episodes; as all series consisted of fifteen 30-minute episodes, the \"Brooklyn to Montauk\" (SE01) episode was revised as an extended version that included additional content not seen in the original broadcast schedule. The Series 1 DVD contains only the original fifteen episodes.","poster_path":"/ePwiyF5TQFSEE4AuwPnE0q7jlah.jpg","season_number":0,"vote_average":0},{"air_date":"2016-02-01","episode_count":15,"id":98420,"name":"Series 1","overview":"","poster_path":"/4RJ5QbxhTqm5dNl2lQInJNvsKn5.jpg","season_number":1,"vote_average":0},{"air_date":"2017-01-23","episode_count":20,"id":98459,"name":"Series 2","overview":"","poster_path":"/lZJ7HpM01g2iuBE5WwDR9A3YZTg.jpg","season_number":2,"vote_average":0},{"air_date":"2018-01-22","episode_count":20,"id":98460,"name":"Series 3","overview":"","poster_path":"/55ud1GuwPbQQva8SgbmxhJXGZaJ.jpg","season_number":3,"vote_average":0},{"air_date":"2020-01-25","episode_count":20,"id":117442,"name":"Series 4","overview":"","poster_path":"/i4i3qKXBr94smiAGOMT3pbqm4QE.jpg","season_number":4,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Documentary","vote_average":9,"vote_count":1,"season_data":{"1":{"_id":"5a697d3fc3a3685a7d00b494","air_date":"2016-02-01","episodes":[{"air_date":"2016-02-01","episode_number":1,"episode_type":"standard","id":1423668,"name":"Manhattan: Grand Central to Broadway","overview":"Michael begins his American odyssey in New York City. Starting at Grand Central Terminal, the 'gateway to the nation', he boards the Manhattan subway system, the busiest rail transit system in the US. His first stop is the Rockefeller Centre, where he gets a bird's eye view of Manhattan Island and learns how about the technology which enabled the city to build up. Portillo heads to the Financial District, where, over a Lobster Newberg, he finds out how the dodgy political dealings of the era's famous industrialists earned them the nickname 'Robber Barons'. He observes their better side at the Metropolitan Museum of Art as he learns that philanthropy helped the city's burgeoning art scene, before finishing his journey midtown, among the bright lights of Broadway.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/gSPVVh5LbEQLaZq5hc4NrccaW1n.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d581d6a4bc38b611b260ddb","adult":false,"gender":2,"id":13110,"known_for_department":"Directing","name":"Tom Richardson","original_name":"Tom Richardson","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-02","episode_number":2,"episode_type":"standard","id":1423677,"name":"Manhattan: Lower East Side to World Trade Center","overview":"Michael continues his American journey in Manhattan's Lower East Side, where he narrowly avoids a scrap with an historic gang of New York and visits the grim tenement buildings where thousands of the city's immigrants lived and worked. In the West Side, Michael discovers how a once lethal run of track has been transformed into a public park, raised above the city streets. Forsaking the rails for a ferry, Michael heads for Ellis Island, where some 12 million immigrants entered America. Michael is given a privileged tour of the gleaming new transport hub under construction close to the site of Ground Zero.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/yk7oBh9xmra9lu8yPHe7XM6d2EO.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d581d6a4bc38b611b260ddb","adult":false,"gender":2,"id":13110,"known_for_department":"Directing","name":"Tom Richardson","original_name":"Tom Richardson","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-03","episode_number":3,"episode_type":"standard","id":1423678,"name":"Brooklyn to Montauk","overview":"From Manhattan, Michael follows his Appleton's Guide east, travelling on the Long Island Railroad. He begins in Brooklyn, where he learns the incredible story behind the world's first steel suspension bridge. Divided by a common language, Michael struggles to order a pizza before continuing to Queens and the site of an ambitious engineering project that will transform New York City's rail network. Moving east through Long Island, he visits one of the country's most decadent mansions, owned by an oil tycoon known as Mr Monopoly, where he gets into a flap dancing the Charleston, before ending his journey on Long Island's eastern most tip at New York's first lighthouse.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/eYIlyLWz0X4xIFAYf7FO90Cgcix.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d581d6a4bc38b611b260ddb","adult":false,"gender":2,"id":13110,"known_for_department":"Directing","name":"Tom Richardson","original_name":"Tom Richardson","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-04","episode_number":4,"episode_type":"standard","id":1423679,"name":"New York City to Garrison","overview":"Michael follows America's mighty Hudson River north, riding on the United States' national rail carrier service, Amtrak. He learns from Amtrak's police chief about some of the nation's most infamous train robbers, then upriver at Tarrytown, he is spooked by the stories of one of America's greatest writers, Washington Irving, author of Sleepy Hollow. On the east bank of the Hudson, he stops at Garrison, site of many guerrilla battles during the Wars of Independence, where he hears about the greatest turncoat in American history and learns about the many famous military leaders who trained at West Point.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/haMhyQmRsHDbG1RDokrwsMJGkkP.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d581d6a4bc38b611b260ddb","adult":false,"gender":2,"id":13110,"known_for_department":"Directing","name":"Tom Richardson","original_name":"Tom Richardson","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-05","episode_number":5,"episode_type":"standard","id":1423680,"name":"Poughkeepsie to Albany","overview":"Michael Portillo continues his railroad journey through New York State following his Appleton's Guide. Beginning in the city of Poughkeepsie, he visits a famous all-female university, alma mater of Jane Fonda and Meryl Streep. He discovers the tumultuous history of the Poughkeepsie-Highland Railroad Bridge and follows the train line up to the Catskill Mountains, admiring its picturesque scenery from an altogether different type of line - a zip wire. Back on safe ground, he discovers that the dramatic landscape inspired artists of the Hudson River School. Arriving in New York's state capital, Albany, he samples a drop of Albany Ale before rubbing shoulders with the State Senator.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/8JxTGVzPClzTwpw1gSPKuBhEN97.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d581d6a4bc38b611b260ddb","adult":false,"gender":2,"id":13110,"known_for_department":"Directing","name":"Tom Richardson","original_name":"Tom Richardson","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-08","episode_number":6,"episode_type":"standard","id":1423681,"name":"Schenectady to Rochester","overview":"Michael heads west through New York State. He has a lightbulb moment in Schenectady, when he discovers how Thomas Edison's General Electric Company also leads the way in modern rail technology. In Utica, he investigates Lock 20 of 57 along the early 19th-century Erie Canal - 325 miles of waterway which connected the Great Lakes with the Atlantic Coast via the Hudson River. A yellow brick road beckons Michael to Chittenango, where a Kansas farm girl introduces him to a lion, and a tin man. On a hillside near Palmyra, Michael finds out about a farm boy, Joseph Smith, and his Book of Mormon, from one of the 15 million believers who follow his religion today. Further west in Rochester, Michael discovers the story behind another famous 19th-century name still trading today: George Eastman, who launched mass market photography with his Eastman Kodak company.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/gbl8xv4TjRBSd4AJbv7rORnzp0Z.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d581d6a4bc38b611b260ddb","adult":false,"gender":2,"id":13110,"known_for_department":"Directing","name":"Tom Richardson","original_name":"Tom Richardson","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-09","episode_number":7,"episode_type":"standard","id":1423682,"name":"Buffalo to Niagara Falls","overview":"Michael braves the awesome power and drenching spray of Niagara Falls on the Maid of the Mist to share what artists, daredevils and millions of tourists have billed as one of the most spectacular experiences on the planet. Reaching Buffalo, he lunches on the city's famous Buffalo wings and discovers it was once the centre of the world's grain trade. Touring Silo City, Michael learns about the invention which propelled the port of Buffalo into its dominant position - the grain elevator - and how the railroads sealed the deal. Awe-inspiring engineering is revealed at the 12-acre Colonel Ward water-pumping station, the largest construction ever built on the Great Lakes, and capable of delivering 30 million gallons of water per day to the city of Buffalo.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/ficWaWqJedJLsJ1eXPegpGEhTMz.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d581d6a4bc38b611b260ddb","adult":false,"gender":2,"id":13110,"known_for_department":"Directing","name":"Tom Richardson","original_name":"Tom Richardson","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-10","episode_number":8,"episode_type":"standard","id":1423683,"name":"Philadelphia to Atlantic City","overview":"Michael embarks on a new railroad journey from the city of brotherly love, Philadelphia, south to the first permanent English colonial settlement in North America, Jamestown. He feasts on a gargantuan Philly cheesesteak, then looks to work off the calories with a run past the city's famous landmarks, in homage to one of Philadelphia's most famous sons, Rocky Balboa. All pumped up, he heads to Pennsylvania University to tackle the football team under the instruction of its fearsome coach. In the cradle of American independence, Michael discovers how, in 1776, liberty was proclaimed throughout the land yet millions remained enslaved. Alone in a cell, Michael reflects on the 19th-century Pennsylvania system of incarceration at the Eastern State Penitentiary before heading to the gambling resort of Atlantic City and its famous boardwalk.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/3dln9JK2Ajalxz9gnVh14L084yA.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-11","episode_number":9,"episode_type":"standard","id":1423684,"name":"Lancaster to Gettysburg","overview":"Michael hitches a ride with the Amish in a horse-drawn buggy through rich countryside settled in the 18th century by religiously oppressed Europeans. Charmed by their modest way of life, he watches as they sell their beautiful quilts at auction. In Strasburg, known as Traintown USA, Michael joins the crew of the oldest continuously operated railroad in the United States. After oiling the magnificent engine, he rides on the footplate of the vintage steam locomotive. His last stop on this leg is Gettysburg, the most famous battlefield of the American Civil War, where, in 1863, President Abraham Lincoln made a momentous speech.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/kNhU5D8ZAlPl14N1lUTrraTDMDu.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-12","episode_number":10,"episode_type":"standard","id":1423685,"name":"Wilmington to Havre de Grace","overview":"Michael reaches a milestone on his American journey: the boundary between the northern and southern states, known as the Mason-Dixon line. He discovers the origins of what became for black Americans the border between slavery and freedom, in an 18th-century English dispute over land. On the Wilmington and Western Railroad, Michael meets the passenger train Phoebe Snow, created by the railroads at the turn of the 20th century to reassure passengers that clean burning coal wouldn't make their clothes dirty. Michael uncovers the explosive history of gunpowder production in Delaware, begun by a Frenchman, whose chateau still stands. He then takes a boat trip up the Susquehanna River following the route taken by one of the first English settlers, John Smith.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/aYAziZpnh5UWsFrl2sEk1xHdkXM.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-15","episode_number":11,"episode_type":"standard","id":1423686,"name":"Baltimore to Fort McHenry","overview":"In Baltimore, home of the first railroad in the United States, the Baltimore and Ohio, he discovers how the first American steam engine, the Tom Thumb, owed much to pioneering British technology. He investigates race relations in the troubled city, taking a drive downtown with a former drug dealer, now a teacher. On the city's beautiful east coast, Michael discovers the impressive star-shaped Fort McHenry and learns how the Star-Spangled Banner national anthem was born. Medics at the city's Johns Hopkins Hospital show Michael how their institution has grown from its 19th-century foundation by the railroad magnate into a world-leading centre for healthcare. And at the city's Lexington Market, Michael learns what gives a Maryland crab cake the edge.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/3VxfnFuMWeXdfMTSQRl1OONHhl5.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-16","episode_number":12,"episode_type":"standard","id":1423687,"name":"Washington DC","overview":"Michael arrives in the nation's capital, Washington DC. He admires its fine public buildings, including the largest library in the world, and discovers how the capital was built from scratch after a political compromise between north and south. At the Bureau of Engraving and Printing, Michael meets the man responsible for engraving the portrait of President Abraham Lincoln on the current five-dollar bill and gets his hands on more money than he has ever held in his life. In the offices of The Washington Post, Michael learns about corruption in the corridors of power and how the newspaper toppled a president. He finishes this leg of his journey in the auditorium of the theatre where, in 1865, President Abraham Lincoln was assassinated.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/aYAziZpnh5UWsFrl2sEk1xHdkXM.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-17","episode_number":13,"episode_type":"standard","id":1423688,"name":"Georgetown to Mount Vernon","overview":"On this leg, Michael soaks up some old-school jazz in Washington's U Street neighbourhood, where the big band jazz king, Duke Ellington, was born and began his career. He also grabs a bite at Ben's Chili Bowl, the legendary diner chosen by President Obama for a snack before his inauguration. He follows his guidebook to the United States Naval Observatory, the nation's timekeeper, where he discovers how and why the railroads established four time zones across the continent in 1883. Heading south to Alexandria, Virginia, Michael explores a former slave market and hears how African Americans were bought and sold. He ends this leg in Mount Vernon, the Palladian home of the nation's first president, George Washington, where he gets into a spot of bother at an archaeological dig.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/rbUzPNQ6voyfT9JdojFSQKA9pLD.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-18","episode_number":14,"episode_type":"standard","id":1423689,"name":"Manassas to Richmond","overview":"Michael Portillo arrives in Manassas, scene of two crucial battles during the American Civil War - the first railroad battles in US history. In Fredericksburg, Virginia, he tries his hand at bottling bourbon corn whisky and learns how it became the nation's spirit. In Richmond, a plate of ham and eggs with southern grits sets Michael up for a tour of the Virginia state capitol building, where he learns about the terrible dilemma faced by one of its most famous sons, General Robert E Lee. Charmed by the English heritage of this former colony, Michael puts on his dancing shoes and heads for a cotillion ball, where it seems manners are the name of the game.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/hg2HW03DFqFPP2EWbDPPxEs4MGM.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2016-02-19","episode_number":15,"episode_type":"finale","id":1423690,"name":"Petersburg to Jamestown","overview":"In Petersburg, Virginia, the choir of the First Baptist Church is in fine voice as Michael discovers how, during the 19th century, coded messages were delivered to slaves who hoped to escape via the so-called Underground Railroad. Michael ploughs his own furrow in a field in colonial Williamsburg, a living history park, where he learns from costumed re-enactors what life was like for both master and slave. It's battle stations in Norfolk, home to the United States Atlantic Fleet, where Michael is invited on board the USS Wisconsin to hear about the first duel fought between iron-clad vessels in 1862 and Britain's role in it. Michael reaches the end of this American journey in Jamestown, the first permanent English settlement in North America, where he finds out about the settlers' grim struggle for survival led by Captain John Smith and Pocahontas.","production_code":"","runtime":29,"season_number":1,"show_id":76639,"still_path":"/1i6WXPYpiznFzXGOlzdmBJcSeEV.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]}],"name":"Series 1","overview":"","id":98420,"poster_path":"/4RJ5QbxhTqm5dNl2lQInJNvsKn5.jpg","season_number":1,"vote_average":0},"2":{"_id":"5a6a9cf892514147f700238f","air_date":"2017-01-23","episodes":[{"air_date":"2017-01-23","episode_number":1,"episode_type":"standard","id":1423997,"name":"St Louis, Missouri","overview":"Michael Portillo crosses the Atlantic once more to ride the railroads of North America with his faithful Appleton's Guide to the United States and Canada. Amid breathtaking scenery, he encounters magnificent beasts, joins intrepid explorers and witnesses unique customs on an awesome 1,500-mile journey to recapture the excitement and promise of the 19th-century American Frontier.\n\nIn St Louis, Michael ascends America's monument to the Wild West, the astonishing Gateway Arch, the tallest free-standing monument in the United States, and makes a delightful discovery inside it. And on the banks of the Missouri River, he is invited aboard a magnificent replica of the original keel boat used for a historic expedition.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/8CM0bhCn7AO1BQ6MWORXYihNn2c.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-01-24","episode_number":2,"episode_type":"standard","id":1423998,"name":"St Louis to Jefferson City, Missouri","overview":"Michael continues his American rail journey west from St Louis to Jefferson City, Missouri, following the tracks of European settlers in the 19th century. He begins this leg at the birthplace of a rural icon in Washington, Missouri, where he attempts to craft a corn cob pipe.\n\nIn Hermann, Missouri, Michael tucks in to bratwurst as he discovers the descendants of German settlers in the town continue their traditions today. And in the Missouri state capital, Jefferson City, Michael finds an enormous fortified building that served as the jail for the entire Wild West.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/isNsFTzy6tx23sjMeiFMuX4K1qW.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-01-25","episode_number":3,"episode_type":"standard","id":1423999,"name":"Sedalia to Kansas City, Missouri","overview":"Following in the footsteps of European settlers, Michael Portillo rolls westwards across the United States. With true frontier spirit, he discovers the hidden pleasures of 19th-century railroad workers in Sedalia, known as the Sodom and Gomorrah of the West, and discovers the birthplace of ragtime and its most famous composer, Scott Joplin.\n\nAboard a horse-drawn wagon in Independence, Michael confronts the brutal hardships faced by early pioneers on the wagon trail and discovers a living history museum town where the clock stopped in 1855. He ends this leg in the rail hub of Kansas City, Missouri, where freight trains can be a mile long.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/o7HNtPzEmXBdGDTJnNMEfMcpU2q.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-01-26","episode_number":4,"episode_type":"standard","id":1424000,"name":"Kansas City to St Joseph, Missouri","overview":"On the next leg of his American adventure, Michael Portillo hits cowboy central in the former meat-packing capital of America - Kansas City, Missouri. In Paola, Kansas, Michael auctions livestock to the latter-day John Waynes of the state and then dines out on smoky spare ribs.\n\nIn the West Bottoms district, he explores the city's Irish heritage and discovers the first Irish business opened in America, still family- owned and run by the great granddaughter of the founder. In St Joseph, Missouri, Michael discovers the legendary Pony Express, not a train but a mail service, and investigates the treacherous death of the outlaw Jesse James.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/feMpvKcaSGOCw9yLTSRI4GjX2er.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-01-27","episode_number":5,"episode_type":"standard","id":1424001,"name":"Lawrence to Topeka, Kansas","overview":"Michael Portillo continues his 1,500-mile journey through the American Wild West, armed with his 19th-century Appleton's Guide. In Lawrence, Kansas, Michael enjoys a prairie chicken dance with a student of the Haskell Indian Nations University and learns how Native American Indians were treated in the 19th century. Michael joins the Jayhawks basketball team in the famous Allen Field house stadium with energetic encouragement from their cheerleaders, before travelling through Tornado Alley to Topeka to meet one of the first storm chasers in America. Driving out on the Great Plains, Michael learns about the Tallgrass Prairie and comes face to face with a herd of wild buffalo.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/y9AqXzdMLywhhRZzNeEdXMHeCO3.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-01-30","episode_number":6,"episode_type":"standard","id":1424002,"name":"Dodge City to Lamar, Colorado","overview":"Michael Portillo's first stop aboard the Southwest Chief is Dodge City, Kansas, a famous frontier town of the Old West, where he visits the notorious Long Branch Saloon, scene of many shoot-outs.\n\nHe finds the Dodge City Cowboy Band performing at the city depot and breaks bread with a descendant of a railroad land agent who sold thousands of acres of land to 19th-century European settlers.\n\nNear Lamar, Colorado, Michael visits the scene of a terrible massacre of American Indians, who found themselves in the way of white settlement of the Great Plains.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/sTefPnSAOaDK9qTHur2LcDOSuWP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-01-31","episode_number":7,"episode_type":"standard","id":1424003,"name":"La Junta, Colorado, to Pueblo, New Mexico","overview":"Michael Portillo hits ranching territory in Las Animas County, Colorado, where he follows in the footsteps of 19th-century dudes from the east coast who came to experience life as cowboys. First up - how to use a lasso.\n\nAt Bent's Old Fort, Michael learns about the Mexican-American War of 1848 and finds himself inspecting the troops. He also looks at America's relationship with firearms at a NRA shooting centre in Raton, New Mexico, and discovers how guns won the West.\n\nBack across the state line in Pueblo, Colorado, Michael is drawn to a giant steel mill mentioned in his Appleton's that produces rails a quarter of a mile long, transported on special trains.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/7ZWzWLTun1TDUihLAV7rjx2B06D.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-01","episode_number":8,"episode_type":"standard","id":1424004,"name":"Canon City, Colorado, to Colorado Springs","overview":"Michael Portillo reaches the Rocky Mountains of Colorado at Canon City, from where he heads out into the spectacular gorge of the Arkansas River aboard the historic narrow-gauge Royal Gorge Railroad. Along the way, he learns how controversy over the construction of the railroad caused bullets to fly.\n\nIn Colorado Springs, Michael discovers an unexpected British outpost where he is enlisted to join the cricket team.\n\nAt the foot of Pike's Peak, a choir sings an iconic American hymn, composed at the turn of the 20th century and inspired by the magnificent views to be seen from the summit. Michael heads 14,115 feet above sea level to see it for himself, aboard the Pike's Peak Cog Railway.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/8LccrjKvrc83yFEp9CjSiesgrO7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-02","episode_number":9,"episode_type":"standard","id":1424005,"name":"Santa Fe to Acoma, New Mexico","overview":"Michael Portillo arrives in Santa Fe, the state capital of New Mexico, and once the capital of a Spanish kingdom. He explores the beautiful colonial architecture of the city and is invited to visit a Native American pueblo atop a 367-foot-high sandstone bluff.\n\nMichael eavesdrops on rehearsals for Puccini's Girl of the Golden West at the glorious Santa Fe Opera House, and at the Governor's Palace learns about the author of the biblical epic Ben Hur.\n\nFinally, Michael catches up with two of the famous Harvey Girls at the La Fonda Hotel to hear about Fred Harvey, the railroad caterer from Lancashire who made his fortune in America.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/u4odVOiPDIO4QZXHGKLIabrmOyu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-03","episode_number":10,"episode_type":"standard","id":1424006,"name":"Albuquerque, New Mexico, to the Grand Canyon, Arizona","overview":"Michael Portillo is in Albuquerque, New Mexico, a city situated on the Rio Grande River. Once the headquarters of the Acheson, Topeka and Santa Fe Railroad, Albuquerque has treasures in store for rail fans, including an enormous locomotive weighing over 450 tonnes. It is being restored by volunteers, and Michael lends a hand.\n\nMichael then feels the heat of New Mexico's chilli pepper in a restaurant and learns how to make enchiladas.\n\nMichael joins the Grand Canyon Railway at Williams, Arizona, to reach one of the most spectacular sights on Earth. He learns how the 7-million-year-old gorge of the Colorado River was preserved for the nation.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/dcVN8mZ7BuAJQPF3WYsY74btrV2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2017-02-06","episode_number":11,"episode_type":"standard","id":1424007,"name":"The Twin Cities, St Paul","overview":"Michael Portillo begins a new journey from Minnesota's Twin Cities in the north of the US to Memphis, Tennessee, in the Deep South.\n\nIn this leg, Michael discovers how Minneapolis, part of one metropolitan area with its immediate neighbour, St Paul, harnessed the power of the mighty Mississippi to become a great industrial centre. It is also the artificial limb capital of the world.\n\nIn St Paul, meanwhile, Michael visits the birthplace of F Scott Fitzgerald and meets a jazz age trumpeter and Fitzgerald fan who introduces him to the Jay Gatsby lifestyle.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/wKwqf20TPeqWPVRXZQliRgSsrgR.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-02-07","episode_number":12,"episode_type":"standard","id":1424008,"name":"The Twin Cities, Minneapolis","overview":"Michael Portillo continues his journey from the northern state of Minnesota to the Deep South.\n\nMichael discovers the story of Hiawatha and his lover Minnehaha, an epic poem featuring American Indian characters. He then meets a Dakota Sioux expert on Native American culture to learn about a dark chapter in United States history and how it is marked today.\n\nMichael has to put his diplomatic skills to the test at a Swedish-American lunch, where the centrepiece of the menu is reconstituted dried cod.\n\nAnd there is a taste of the golden age of luxury rail travel as Michael bounces on a bed in a beautifully restored Pullman carriage.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/nMhPx3Fcks3DHA3AEVj8gLX0JJN.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-02-08","episode_number":13,"episode_type":"standard","id":1424009,"name":"Red Wing, Minnesota, to La Crosse, Wisconsin","overview":"Michael Portillo continues his journey from the northern state of Minnesota to the Deep South.\n\nSteered by his Appleton's Guidebook, Michael travels along the Upper Mississippi to Red Wing, Minnesota, and the home of Laura Ingalls Wilder, author of Little House on the Prairie.\n\nJoining the Empire Builder rail service, he travels to Winona, where he finds out how in the 19th century the US Army Corps of Engineers made the Mississippi navigable. The river is maintained today not just for freight, but to host bald eagles and pelicans too.\n\nMichael joins in the dancing at a tribal gathering of the Dakota Sioux, and in La Crosse learns about the Native American origins of a fast-moving, combative sport.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/zu8VAvTe8tJfPcBdTgUREENm6MA.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-02-09","episode_number":14,"episode_type":"standard","id":1424011,"name":"Tomah to Portage, Wisconsin","overview":"Michael Portillo continues his journey from the northern state of Minnesota to the Deep South.\n\nMichael reaches Tomah, Wisconsin, where he helps harvest cranberries, an important crop for the US.\n\nBoarding the Empire Builder rail service once again, he travels to Wisconsin Dells, where an innovative photographer first captured motion.\n\nMichael takes a plunge in the waterpark capital of the world and finds a pleasant surprise in Baraboo - the circus is in town and it travels by train. Guided by a former clown and ringmaster, Michael explores the train's spectacular wagons.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/dwrfDFXystg6EPZMSI7v4qaF2B9.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-02-10","episode_number":15,"episode_type":"standard","id":1424012,"name":"Milwaukee to Racine, Wisconsin","overview":"Michael Portillo continues his journey from the northern state of Minnesota to the Deep South.\n\nMichael is in Milwaukee, located on the shore of Lake Michigan and home of the Harley-Davidson. Michael learns about the history of motorcycles there, the first of which was made in 1903, and hitches a ride on the back of a modern version.\n\nGerman gymnastics is Michael's next challenge as he joins the Ladies' Auxiliary Exercise Class, a legacy of Milwaukee's 19th-century German settler community which is still going strong today.\n\nIn Racine, Michael discovers a man who knew how to sort the wheat from the chaff and made a business out of it.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/ta9A71O6xM7t1zgNUpZX1oGLSBT.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-02-13","episode_number":16,"episode_type":"standard","id":1424010,"name":"Chicago, The Windy City","overview":"Michael Portillo is blown away by the skyscrapers in Illinois's Windy City, where he discovers how modern Chicago's skyline replaced a largely wooden city, destroyed in a great fire shortly before his Appleton's Guide was published. Training with the city's firefighters, Michael learns today's fire department respond to half a million emergency calls a year.\n\nMichael steps up to the plate with the Joliet Slammers, stars of the US national game of baseball, then sings for his supper at a quintessentially American restaurant bearing his name! Downtown at the Moody Church, Michael tracks down a pair of evangelists who toured Britain and the United States by rail at the time of his Guide.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/q44HYNaSon3cvZpWVbU4iOrzcCx.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-02-14","episode_number":17,"episode_type":"standard","id":1424013,"name":"Chicago, US Rail Hub","overview":"Michael Portillo continues his 1,000-mile journey from the northern state of Minnesota to the home of the blues in Memphis, Tennessee. Today, in the nation's rail capital, where tracks pass underground and overground and are elevated into the air, Michael investigates the ultimate marshalling yard. At the ornate Palmer House Hotel, Michael teams up with the head chef to recreate the original chocolate brownie, invented by Bertha Palmer for Chicago's World Exposition in 1893. He discovers the origins of the Sanitary and Ship Canal and uncovers the history of an incredible civil engineering project which raised the city to new heights. Heading deep underground, Michael inspects a modern day scheme on a similarly awesome scale, described by the boss as the largest toilet in the world.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/ApohzMRpO5wucq59SF5Zn8izfEa.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-02-15","episode_number":18,"episode_type":"standard","id":1424015,"name":"Homewood to Champaign, Illinois","overview":"Steered by his Appleton's Guide, Michael Portillo continues his 1,000-mile rail journey south from Chicago through Kankakee to Champaign, Illinois. In full swing on the fairway at the Flossmoor Country Club, Michael discovers how wealthy businessmen from the city flocked to play and how the railroads fostered the growth of suburban life. Beside the Kankakee River, Michael is invited to visit the Frank Lloyd Wright-designed house that changed the face of American architecture. On the platform at Kankakee station, Michael parties with the locals as they celebrate the City of New Orleans rail service, immortalised in song by Arlo Guthrie. He gets his hands on a vintage hooter riding on the Monticello Heritage rail line and in Champaign learns a thing or two at a railroad university.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/1D4t9csXbHNtK4vbZTl7mhWiWRw.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-02-16","episode_number":19,"episode_type":"standard","id":1424014,"name":"Mattoon, Illinois to Columbus, Kentucky","overview":"Armed with his 19th-century Appleton's Guide, Michael Portillo continues his 1,000-mile journey, beginning and ending on the Mississippi River from Minnesota to Tennessee. Riding the mainline of mid-America, Michael stops at rural Mattoon, where he gets a taste of the tough early life which shaped President Abraham Lincoln. Wiping the sweat from his brow, Michael struggles to split one rail compared with Lincoln's estimated 700 a day. Basket in hand, Michael joins the Schwartz family apple harvest in Centralia and learns how to make apple butter. He uncovers industrial unrest in the coal mines of Carbondale then heads to Kentucky and the banks of the Mississippi, where a bloody conflict unfolded which proved decisive in victory for Lincoln's Union.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/AdJwuyNtePpkhk5R6hbCCbUgk6g.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2017-02-17","episode_number":20,"episode_type":"finale","id":1424016,"name":"Memphis, Tennessee","overview":"Armed with his Appleton's Guide, Michael Portillo travels the lower Mississippi aboard a paddle steamer to hear about the life and work of former river boat captain, Samuel Clemens, better known as Mark Twain. In the city of Memphis, Tennessee, Michael visits the historic Elmwood Cemetery, where he uncovers the story of a devastating epidemic, which claimed the lives of thousands. He discovers one of the largest rail freight hubs in the United States and in the home of the blues, meets contemporary artist Cedric Burnside in studio before joining millions of Elvis fans at Graceland. An invitation to a duck palace and the honorary position of Duck Master carry curious responsibilities at the 19th-century Peabody Hotel.","production_code":"","runtime":29,"season_number":2,"show_id":76639,"still_path":"/2493VBHNP1uwnpf2N5fQ9VEQ168.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]}],"name":"Series 2","overview":"","id":98459,"poster_path":"/lZJ7HpM01g2iuBE5WwDR9A3YZTg.jpg","season_number":2,"vote_average":0},"3":{"_id":"5a6a9cfac3a3680e1a001fdc","air_date":"2018-01-22","episodes":[{"air_date":"2018-01-22","episode_number":1,"episode_type":"standard","id":1424018,"name":"Boston","overview":"Armed with his 19th-century Appleton's guidebook to the United States and Canada, Michael Portillo embarks on a 1,100-mile railroad journey from Boston, Massachusetts, across the border to Toronto in theCanadian province of Ontario. Along the way, he encounters revolutionaries and feminists, pilgrims and witches and rides some of the oldest and most breathtaking railroads in the world.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/80WVuuYtjEG4fnDFFGyKZD56thj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-23","episode_number":2,"episode_type":"standard","id":1424019,"name":"Boston to Concord, Massachusetts","overview":"Michael Portillo's 19th-century Appleton's guidebook leads him to the Parker House Hotel, where in his best pinny, he whisks up a Boston cream pie.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/kM0dUry4MXYYabCbHAmXFhS7DJN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-24","episode_number":3,"episode_type":"standard","id":1424020,"name":"Plymouth to Nantucket","overview":"Led by his Appleton's guidebook and tracing the footsteps of the Pilgrim Fathers, Michael Portillo heads for Plymouth, the home town of America. He learns how indigenous tribes of Wamponoag people taught the newly arrived settlers to live off the land, the inspiration for one of the biggest holidays in the American calendar.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/yaY1QI182jcw96LtK4QLMKrnfIx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-25","episode_number":4,"episode_type":"standard","id":1424021,"name":"Providence, Rhode Island, to New London, Connecticut","overview":"Led by his 19th-century Appleton's guidebook, Michael Portillo's railway journey continues through New England. On the banks of the Providence River, he discovers a club that traces its roots and culinarytraditions back to the 1840s. Michael joins in with one of its legendary open-air 'clambakes'.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/9bAFPENEMf7i09CzaU47SOxOk17.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-26","episode_number":5,"episode_type":"standard","id":1424022,"name":"New Haven, Connecticut, to Mount Washington, New Hampshire","overview":"Armed with his Appleton's guide, Michael Portillo's rail voyage goes river deep and mountain high as he continues his journey through Connecticut and heads north through the scenic New England states. In New Haven, a crash course in rowing takes place on a stretch of water where college teams from Yale and Harvard have battled for victory since 1852.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/kM0dUry4MXYYabCbHAmXFhS7DJN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-01-29","episode_number":6,"episode_type":"standard","id":1424023,"name":"Burlington to Plattsburgh","overview":"Michael Portillo continues his American rail journey through New England as he heads for the Canadian border. First stop is Burlington, Vermont, a busy timber port at the time of his Appleton's guide. Michael ventures deep into the forest to learn how sustainable and technological innovations have transformed the state's billion dollar logging industry.\n\nFollowing the old trade route across Lake Champlain, he hears of a pivotal battle during the War of 1812 where a British defeat gave the United States a new confidence on the world stage. In Plattsburg, Michael learns of the surprising origins of a classic Christmas carol.\n\nLead by his guidebook, he travels into the wilderness of the Adirondack Mountains. Here the rich and famous of Appleton's day established great camps to get back to nature, in the lap of luxury. He visits the largest of the camps, reached by boat and even a private funicular railway. In Lake\n\nPlacid, Michael braves the steep curves and speeds of an Olympic bobsleigh run. Last stop is an American fort mistakenly built in Canada!","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/kM0dUry4MXYYabCbHAmXFhS7DJN.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-01-30","episode_number":7,"episode_type":"standard","id":1424024,"name":"Montreal, Quebec","overview":"Following a special 1899 Canadian edition of his Appleton's guide, Michael Portillo has left the United States and crossed the border to embark on the next leg of his rail journey in Canada.\n\nIn the vibrant metropolis of Montreal, he discovers how French and British colonial roots have influenced the city's construction, cuisine and culture. Undaunted by his guidebook's description of the treacherous Lachine Rapids, Michael gets a thorough soaking on a white-knuckle boat ride down the St. Lawrence River.\n\nAt the city's prestigious McGill University, Michael learns of its role as a pioneering medical establishment in the 19th century. He unearths a mausoleum amidst the text books and volunteers as a guinea pig at the university's cutting-edge neurology department. In search of the city's black Canadian heritage, Michael is introduced to the dazzling piano playing of 20th-century jazz legend Oscar Peterson.\n\nHis Montreal tour ends with a visit to Cirque du Soleil HQ for a very special behind-the-scenes tour of an icon of modern French-Canadian culture.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/tsuFZS8s5sm71RplqiYcXeNYKmA.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-01-31","episode_number":8,"episode_type":"standard","id":1424025,"name":"Montreal to Ottawa","overview":"Steered by his Appleton's guidebook Michael Portillo's train journey continues in Canada's Quebec province.\n\nVenturing into the wooded hills of Vaudreuil, Michael explores a Canadian icon, maple syrup, and unearths its sweet secrets. Returning to the rails, he journeys west into Ontario and learns of Scotland's influence on Canadian culture. At Alexandria, a tartan army escorts Michael to the 70th annual Canadian Highland Games, where he dons his kilt and attempts to toss the caber!\n\nIn the capital, Ottawa, Michael visits Canada's parliament and hears how the new nation slowly developed its autonomy after confederation in 1867. Michael visits Ottawa's historic Central Experimental Farm where pioneering discoveries at the time of his guidebook launched a wheat boom that helped Canadian agriculture to dominate the world.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/bd6diVyu1zz1VwDHOXn2ODrm1GK.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-01","episode_number":9,"episode_type":"standard","id":1424026,"name":"Thousand Islands to Oshawa, Ontario","overview":"Using his 1899 Appleton's guide, Michael Portillo's rail odyssey through eastern Canada continues along the Grand Trunk railway, following the route of the St Lawrence River.\n\nAt Brockville, he leaves the tracks for a nautical pilgrimage through the beautiful Thousand Islands. In the port city of Kingston, Ontario, Michael visits Fort Henry and, dressed for the occasion, is entrusted to fire the naval guns that protected the nation's southern border during the 19th century.\n\nTravelling west to Port Hope, he learns of the antics of a celebrated 19th-century high-wire walker known as The Great Farini. And, in the spirit of showmanship, Michael tests his balance with the modern sport of slack lining.\n\nThis leg of the journey ends in Oshawa at the opulent home of the McLaughlin family, who helped build a new economy for Canada when they switched from manufacturing carriages to motor cars.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/uHCtTqX5w1Xpmx9tPF0HvwdDcCK.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-02","episode_number":10,"episode_type":"standard","id":1424027,"name":"Toronto","overview":"Michael Portillo's railway journey across eastern Canada concludes in the nation's largest metropolis, Toronto. He begins his Toronto tour at Union Station. Now busier than the city's international airport, Michael is shown the ambitious engineering works underground to support the growing number of commuters.\n\nFrom the dig down, he boldly goes to the dizzying heights at the CN Tower for an extreme outdoor experience at the top of the structure. Nerves are calmed at the Royal York Hotel, one of a network of luxury hotels built by the railway known as the 'castles of the north'.\n\nCatching the street car, Michael finds out how Toronto made itself a magnet for money after it set up its own stock exchange, but not before he presses the button to open the day's trading.\n\nEnding his time in the city's High Park, he seeks out the origins of a celebrated Canadian song that helped to shape the maple leaf as the country's national symbol.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/sYtDM2teFl5Jq297WdGms3L2YgY.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d57eb804bc38b350327cdac","adult":false,"gender":0,"id":2012095,"known_for_department":"Directing","name":"Cassie Farrell","original_name":"Cassie Farrell","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-05","episode_number":11,"episode_type":"standard","id":1446753,"name":"Reno, Nevada, to Colfax, California","overview":"Led by his late 19th-century Appleton's guidebook, Michael Portillo sets off on a 1,000-mile American adventure to discover how the railroad conquered the wild landscapes of the West and transformed California into America's wealthiest region, one which has\n\nrevolutionised the world.\n\nBeginning in the Silver State of Nevada, Michael takes to the skies over the dramatic Sierra Nevada mountain range. At Lake Tahoe, he hears of the first white explorer, dubbed 'The Pathfinder', who learnt the lay of the foreboding land and paved the way for the first settlers to arrive. Travelling on the historic Virginia and Truckee heritage line, Michael heads for the vast deposits of silver and gold ore that built Virginia City, once dubbed the richest place on earth. At Chollar Mine he explores the short-lived mining boom and meets a pistol packin' preacher when he swings by the Silver Queen saloon.\n\nCrossing the border into the Golden State of California, he ascends the 7,000ft granite cliffs to the Donner Pass where ambitious plans to plough a rail route through the rugged terrain were made a reality by Chinese labourers, at huge human cost. In the spirit of Western horsemanship, Michael ends this leg in Colfax and gets in the saddle for a spot of cowboy dressage.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/qu0yafQcrv2cCWkzYooX01ExqS0.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-06","episode_number":12,"episode_type":"standard","id":1446754,"name":"Sacramento to Napa Valley","overview":"Continuing his epic Californian rail journey, Michael Portillo begins this leg at the very spot that triggered the 1848 gold rush. He finds out how California's mineral treasures and population swell helped fast-track the region's statehood, with significant political consequences for the national slavery battle. Michael pans for gold in the clear waters of the American River, and delights in a titillating spectacle at California's first public theatre.\n\nVenturing underground, he discovers how the streets of Sacramento were raised following the Great Flood of 1862 and visits the newly\n\nconstructed $900 million dam to improve the city's flood defences. It is a first for Michael in the kaleidoscopic sweet factory of an iconic American confectionary brand that can trace its roots back to the 19th century. And, taking a cue from his guidebook, he explores the fruits of the Napa Valley enjoying a gourmet lunch on board the Napa Valley wine train before joining the harvest of the state's distinctive Zinfandel grape.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/kM0dUry4MXYYabCbHAmXFhS7DJN.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-07","episode_number":13,"episode_type":"standard","id":1446755,"name":"San Francisco to Sausalito, California","overview":"Armed with his trusty Appleton's Guide, Michael Portillo's rail journey through California takes him to the commercial metropolis of San Francisco. Riding through the vibrant streets by cable car, Michael finds out how 19th-century engineering overcame the challenge of scaling the city's steep hills and gets behind the scenes with the 144-year-old engines driving the cables.\n\nIn the Presidio neighbourhood, Michael discovers San Francisco's long tradition for fine printing and learns the historic hand-crafted techniques before his treasured guidebook is evaluated by the experts. Hitching a ride on a hippy 'love bus' to the heart of the gay district, Michael traces the roots of the city's LGBTQ scene back to the era of the gold rush and is invited to a fund-raising 'drag brunch'. He stops off at the marina to tuck into a local seafood speciality brought to the city by Italian immigrants. And, heading across the bay to Sausalito, he boards a schooner to hear the story of Matthew Turner, the most prolific ship builder of his time.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/oKoqdE8JpbUraSpfJy4KdjOaTKT.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-09","episode_number":14,"episode_type":"standard","id":1446756,"name":"San Francisco","overview":"Michael Portillo resumes his exhilarating tour of San Francisco to find that diversity has been at the heart of the city since the days of the gold rush, though not always harmoniously so. Following his Appleton's guide, Michael heads to Chinatown to hear of the huge contribution Chinese immigrants made to the economy, working as miners and building the transcontinental railroad. He discovers an entrepreneurial community who overcame discrimination laid down by the law, and finds that fortune favours the brave with iconic Chinese treats created in America!\n\nIntrigued by a reference in his guidebook, Michael goes in search of lavish public baths to unpack a landmark incident in 1897 whereby an African-American sued one of the richest white men in the state. At one of the oldest private athletics clubs in America, Michael gets to grips with the sport of handball, first brought to San Francisco by Irish immigrants in the 1850s. And joining the police's Marine Unit, he heads out into the bay with a force who has been keeping the waters safe since the 1860s.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/wnzXPbtfbX2Qe41A774uyYykLDv.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-10","episode_number":15,"episode_type":"standard","id":1446757,"name":"Berkeley to Yosemite","overview":"Michael Portillo's rail voyage continues through northern California, moving east in search of the state's greatest national treasures. To unearth the region's dangers deep underground, Michael visits the seismology department at UC Berkeley and hears the story of the catastrophic 1906 San Francisco earthquake. Experiencing the country's largest multidirectional shaking table in action, he learns how engineers today strive to prepare for the high risk of an earthquake.\n\nAlighting at Stockton, Michael delves into California's pioneering agricultural technology and buckles up on a caterpillar tractor the likes of which revolutionised farming and construction equipment around the world. And following the advice of his Appleton's, Michael immerses himself in the sublime beauty of Yosemite National Park, learning about the committed 19th-century conservationists who campaigned for federal protection. He gets up close to the magnificent fauna and flora, attempts a rock climb and comes across a 'Buffalo Soldier' patrolling the wilderness.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/A4ypTiJklZwqq5mTcKLF8Tnybxy.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-12","episode_number":16,"episode_type":"standard","id":1446758,"name":"Santa Clara to Santa Cruz","overview":"Michael Portillo's thousand-mile rail journey through California continues south toward Santa Clara in the heart of Silicon Valley and ends in the surf of Santa Cruz. In a high-tech bar, where robots wait on the customers, Michael traces the origins of modern-day search engines and social media to an institution founded by a railroad baron. At tech giant Intel, Michael glimpses the future on a test drive in an autonomous car.\n\nAt San Jose, the biggest city in the valley, Michael visits Japantown to meet members of a far eastern community who settled here peacefully during the 19th century but faced hostility during the mid-20th. He is then beaten over the head and body by youngsters a third of his age as he attempts to learn the martial art of kendo. A ride aboard the Roaring Camp and Big Trees Railroad takes Michael through groves of mammoth trees - the magnificent California Redwoods. Emerging from the forest on a second vintage railroad, Michael hits the beach and like a true beach boy, he takes to the waves - on a surfboard.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/kM0dUry4MXYYabCbHAmXFhS7DJN.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-13","episode_number":17,"episode_type":"standard","id":1446759,"name":"Monterey to Santa Barbara","overview":"Steered by his late-19th-century Appleton's guidebook, Michael Portillo continues his railroad travels through southern California aboard the Coast Starlight service. In the historic port of Monterey, Michael raises the Bear Flag of the one-time Republic of California and above it, the Stars and Stripes. He discovers the city's Spanish and Mexican heritage and traces how the former fishing port described as 'stinking and decrepit' in John Steinbeck's novel Cannery Row has become a beacon for tourists. And how, in place of fish-processing canneries, there now stands a gleaming, state-of-the art aquarium, where Michael is invited to feed the fish.\n\nMichael's next stop is Paso de Robles, where he tours the magnificent Hearst Castle, dream home of the newspaper baron William Randolph Hearst, to hear the tale of its creation. Onward to San Luis Obispo and the hills of Morro Bay and Michael joins avocado farmer Jim Shanley, amid his 4,000 avocado trees to harvest the pears and then learn how to make guacamole. Michael's last stop on this leg is outside Santa Barbara at Rancho Camulos, a former cattle ranch owned by a prominent Hispanic family and the setting for a best-selling romantic novel of the 19th century.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/kM0dUry4MXYYabCbHAmXFhS7DJN.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-14","episode_number":18,"episode_type":"standard","id":1446760,"name":"Los Angeles","overview":"Armed with his Appleton's guide to the United States, Michael Portillo arrives in Los Angeles to delight in the 'city of dreams', from its glorious Union Station to its golden beaches and palm-lined boulevards. Like many a Hollywood hopeful before him, Michael heads for the Warner Brothers studio, founded on Sunset Boulevard at the time of his Appleton's, with dreams of stardom ahead. His role as a fearless all-action hero is assured. For the view from the top he takes the Skyslide from the 70th floor of one of LA's tallest buildings before striding out on the Walk of Fame.\n\nAt the pioneering 19th-century Union Ice company, Michael discovers how Californians have kept their cool. He sees how ice blocks of titanic proportions are made and brings Christmas to LA with a giant snowmaker. Outside the city, Michael heads for San Marino to visit The Huntington, a cultural and research centre with fine libraries, art galleries and more than a dozen botanical gardens. In the cactus garden, Michael discovers more about the founder, nephew of a railroad baron and himself a pioneer of street cars and trolleys. Michael explores the city's latest initiative to break the legendary rush hour gridlock on Los Angeles freeways - a rail link with seven new stations on the LA metro.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/kM0dUry4MXYYabCbHAmXFhS7DJN.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-15","episode_number":19,"episode_type":"standard","id":1446761,"name":"Los Angeles to Laguna Beach","overview":"Michael Portillo strikes oil in the suburbs of Los Angeles, contemplates his navel in the orange groves of Riverside, makes a California Roll and paints a pretty picture in Laguna Beach.\n\nIt is Mexican Independence Day and the locals are celebrating the country's hard-won independence from Spain in the early 19th century. There is dancing, singing and feasting in the streets and Michael is up for joining the party. He learns that one in two of the population of LA is Latino, mainly of Mexican descent, and hears after only a few decades, Mexico lost half its territory and California became part of the United States. Michael learns the secrets of backyard oil drilling in Los Angeles, home to the largest urban oil field in the United States. Nodding donkeys are everywhere - in residential neighbourhoods, parking lots and burger joints.\n\nMichael sports a zesty orange jacket to visit the Citrus Variety Collection and learns the difference between a pummelo and a papeda. Alongside oil, the citrus fruit industry, he discovers, is one of the bedrocks of the state's economy. At Laguna Beach, Michael learns how artists from the east coast travelled west on the Transcontinental Railroad to found a colony of 'plein air' painters attracted by the beautiful coastline and glorious light to paint outside.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/kM0dUry4MXYYabCbHAmXFhS7DJN.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]},{"air_date":"2018-02-16","episode_number":20,"episode_type":"finale","id":1446762,"name":"La Jolla to San Diego","overview":"Michael Portillo is nearing the end of his thousand-mile rail journey from Reno, Nevada, to San Diego in southern California. In this final leg, clad in khaki boiler suit and sporting dark glasses, he joins the US Navy Pacific Fleet, birthplace of the elite flying academy Top Gun. Aboard the Pacific Surfliner, he arrives first in the coastal town of La Jolla, where he takes to the water in a kayak to explore the extraordinary 75-million-year-old caves.\n\nIn San Diego, he picks up the trail of the industrialist and property speculator John D Spreckels, who made the city boom in the 19th century and built a pavilion to house the largest outdoor pipe organ in the world. Michael is offered the chance to play it. Appleton's recommends a trip to a huge structure, completed in 1888, on which San Diegans have depended for water for 130 years - the\n\nSweetwater Dam.","production_code":"","runtime":29,"season_number":3,"show_id":76639,"still_path":"/kM0dUry4MXYYabCbHAmXFhS7DJN.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"5d5827f41684f70015c9f21a","adult":false,"gender":0,"id":2389306,"known_for_department":"Directing","name":"Dave Minchin","original_name":"Dave Minchin","popularity":4.159,"profile_path":null}],"guest_stars":[]}],"name":"Series 3","overview":"","id":98460,"poster_path":"/55ud1GuwPbQQva8SgbmxhJXGZaJ.jpg","season_number":3,"vote_average":0},"4":{"_id":"5c48372fc3a368576a878a2e","air_date":"2020-01-25","episodes":[{"air_date":"2020-01-25","episode_number":1,"episode_type":"standard","id":1681655,"name":"Ninilchik to Wasilla","overview":"Michael Portillo heads for the last frontier of the United States, armed with his 1899 Appleton’s Guidebook to Alaska.\n\nBeginning his journey amid the snow-capped mountains and ice-cold inlets of the Kenai Peninsula, Michael finds the golden onion domes of a Russian Orthodox church, along with traditional Russian food and costume and discovers that, 150 years ago, Alaska was a Russian colony.\n\nIn Seward, Michael feeds a rescued sea otter pup with a fearsome bite and learns how the luxurious pelts of these endearing creatures were once the most valuable in the world. On a boat trip around Seward Harbour, Michael hears from an indigenous former Alaskan state senator how, shortly before his guidebook was published, the Russian Empire sold Alaska to the United States.\n\nHeading north on the Alaska Railroad past lakes and glaciers and through mountain tunnels, Michael learns what it took to build this epic 470-mile line.","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/vVYBKGlmQlEQcmfHN41nZDG2POL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-01","episode_number":2,"episode_type":"standard","id":1681660,"name":"Talkeetna to Juneau","overview":"Armed with his 1899 Appleton’s Guidebook to Alaska, Michael Portillo rides the Alaska Railroad north to explore the remote former goldrush settlement of Talkeetna. Deep in the forest outside town, Michael gets a taste of the pioneering spirit of early 20th-century prospectors and settlers from a modern day 'homesteader' and helps fell a tree to clear land for a log cabin.\n\nFrom Talkeetna, Michael joins intrepid fellow passengers aboard the Hurricane Turn, the last 'flag stop' train in the United States, waving them off as they alight in the middle of bear country to fish, raft and camp. He continues by rail to admire the snow-capped mountains and glaciers and to cross the gorge on the spectacular Hurricane Gulch Bridge.\n\nIn the six-million-acre Denali National Park, which is crowned by the highest peak in the United States, Michael discovers how photographers a hundred years ago captured the beauty of the Alaskan landscape.","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/xQfEmu0j7jsAS0MZ7nZXpQMhVrV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-08","episode_number":3,"episode_type":"standard","id":1681662,"name":"Skagway to Vancouver","overview":"Michael Portillo embarks on a second spectacular rail journey through Alaska into Canada on the White Pass and Yukon railway.\n\nArriving in Skagway by seaplane from railwayless Juneau, Michael heads first for Dyea and the Chilkoot trail, which the first gold prospectors hiked 100 years ago to the Klondike. Among them, he discovers, was author Jack London, whose stories of sled dogs captured the spirit of the gold rush.\n\nIn the puppy pen of a sled dog training camp, a dog musher tells Michael how huskies helped to build Alaska and gives him an insight into how the dogs continue to work and race today.\n\nBoarding the 52-mile railway, built in 1898, which climbs 2,600 feet before dropping to the head of Canada’s Lake Bennett, Michael looks forward to beautiful scenery on a railway laden with history. At the lake, Michael meets an indigenous guide to hear of the role of First Nations people in the stampede for gold.","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/kIWkNa2GV3CYjIZRzfimmpI4uNr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-15","episode_number":4,"episode_type":"standard","id":1681663,"name":"Vancouver Island to Kamloops","overview":"Michael Portillo explores British Columbia, steered by his Appleton’s Guide to Canada, published in 1899. He discovers how two superpowers nearly came to war over a pig and joins the Royal Canadian Navy to firefight on board the frigate HMCS Regina.\n\nStarting on Vancouver Island, Michael explores the rich British heritage and colonial past of the provincial capital of British Columbia, Victoria. He discovers the origins of the immensely powerful fur-trading enterprise, the Hudson’s Bay Company and, in the affluent James Bay area of Victoria, he finds the former home of an early 20th-century artist who documented the art and culture of the indigenous people of the western coast, Emily Carr.\n\nAt Saanichton, Michael helps to carve a 36-foot totem pole in the studio of a present-day First Nations artist. In the wilderness of British Columbia,","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/ovn9Xem6pc7WnRMSygZfb5PNK8B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-22","episode_number":5,"episode_type":"standard","id":1681664,"name":"Kamloops to Calgary","overview":"Clutching his 1899 Appleton’s Guide, Michael Portillo boards one of the world’s most famous trains, the Rocky Mountaineer, to cross the backbone of the North American continent from Kamloops to the spa resort of Banff. This magnificent journey takes him to the highest point of the 19th-century transcontinental Canadian Pacific Railway line at Kicking Horse Pass, past Lake Louise and inside spiral tunnels blasted through the mountains.\n\nAlong the way, Michael hears of the harsh and dangerous conditions endured by the Chinese and European labourers who built the railway. He looks back at the historic driving of the Last Spike, which completed the Canadian Pacific Railway in 1885.\n\nReaching Banff, Michael follows his Appleton’s guide to the luxurious Banff Spring Hotel, built by the railway company. By Sulphur Mountain, he explores an underground hot spring discovered by railway workers in 1883 and learns how it prompted the creation of Canada’s first national park.","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/depgruTaCV6NCtIOILXzBKngMU0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-02-29","episode_number":6,"episode_type":"standard","id":1681665,"name":"Halifax to Prince Edward Island","overview":"Michael Portillo begins a new journey on the tracks of the Ocean line to explore Canada’s maritime provinces en route to Quebec City.\n\nClutching his 1899 Appleton’s Guide to Canada, he begins in the Atlantic port of Halifax, Nova Scotia, where he discovers an 18th-century British hilltop citadel, manned at the time of his guide by the 78th Highland Regiment. Michael joins the men who recreate the roles of those Scottish soldiers today. At the mercy of the young 'sergeant major', Michael learns the drill in kilt and sporran.\n\nMichael follows his Appleton’s to a vast Victorian dry dock, still in use today by shipbuilders for the Royal Canadian Navy and finds out what it takes to build a state-of-the-art Arctic Patrol vessel. He learns of a catastrophic explosion in Halifax harbour in 1917, which killed 2,000 people and left 25,000 homeless. Former residents of an African-Canadian community torn in two by the railway tell Michael of their struggle for redress.","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/1Q8HpYvaDxm3Wn3BbHz4KsECPVR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-07","episode_number":7,"episode_type":"standard","id":1681666,"name":"Springhill Junction to Quebec City","overview":"Clutching his 1899 copy of Appleton’s Guide to Canada, Michael Portillo travels on the Ocean train from Nova Scotia to New Brunswick. Along the way, he investigates the world’s biggest tide at Hopewell Rocks and admires its dramatic rock formations and caves.\n\nMichael apparently defies gravity on a magnetic hill in a 1965 Pontiac Bonneville. North of Moncton in Miramichi, he joins the Elsipogtog First Nation in a pow wow, where he learns about quilting and traditional dress. In Amherst, Michael investigates the history of an ambitious ship railway designed to ferry ships by rail over the isthmus between the Bay of Fundy and the Northumberland Strait. He quarries highly-prized Wallace sandstone for a 150-year-old family firm.","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/j3NhqdUymvLGuDdXz6hZeYKNhz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-14","episode_number":8,"episode_type":"standard","id":1681667,"name":"Sainte-Anne-de-Beaupre to Winnipeg","overview":"Michael Portillo explores the province of Quebec with his 19th-century Appleton’s Guide to Canada. He takes the fabulously scenic Charlevoix train along the north bank of the mighty St Lawrence River to La Malbaie.\n\nFollowing his guidebook to the beautiful basilica at Sainte-Anne-de-Beaupre, Michael discovers the racks of crutches discarded by the healed and meets modern-day visitors in search of miracles.\n\nThe Train de Charlevoix, built to transport pilgrims, now conveys tourists along the north bank of the St Lawrence River to the Murray lakes. Michael tours the fine 19th-century houses, which were once the haunt of the Gatsby generation. Taking to the skies in a seaplane, Michael flies over the Laurentian Mountains to land on an isolated lake, where he fishes for trout for his supper.","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/ovn9Xem6pc7WnRMSygZfb5PNK8B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-21","episode_number":9,"episode_type":"standard","id":1681668,"name":"Portage la Prairie to Saskatoon","overview":"Steered by his 1899 Appleton’s Guide, Michael Portillo strikes west across Manitoba into the province of Saskatchewan. High above the prairie at Riding Mountain, Michael discovers how a middle-class British boy from Hastings transformed himself into an influential indigenous naturalist called Grey Owl.\n\nDeep in the prairie, Michael finds a network of railways that once served the wheat farmers of Saskatchewan and learns how communities grew up around the grain elevators used to load the crop on to rail wagons. The Wheatland Express welcomes a new recruit to the sidings on the afternoon shift.\n\nAt Manitou Beach, Michael reaches the Dead Sea of Canada, a 14-mile lake three times saltier than the ocean. A Yellow Quill First Nations elder tells Michael about the healing properties of the water, and Michael tries it for himself.","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/ovn9Xem6pc7WnRMSygZfb5PNK8B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-03-28","episode_number":10,"episode_type":"standard","id":1681669,"name":"Edmonton to Jasper","overview":"Michael Portillo continues west through the Canadian Prairie on his thousand-mile rail journey from Winnipeg, Manitoba, to Jasper, Alberta. Following his 1899 Appleton’s guide, Michael explores a glossy, glassy, oil-rich Edmonton, second city of Alberta. On the banks of the North Saskatchewan River, he travels three centuries back in time to experience the life of les voyageurs, who travelled huge distances within Canada by foot and canoe to trade fur with indigenous people.\n\nMichael admires Edmonton’s early 20th-century heritage streetcars, preserved by the Radial Railway Society, and seizes the chance to drive one across a spectacular high-level bridge over the North Saskatchewan River.\n\nEdmonton prides itself on its modern light rail system, offering rapid transit to 80 million passengers per year. Michael hears how this growing city plans to keep pace. His journey across Canada’s vast open spaces reaches a dramatic scenic conclusion in the Rocky Mountains.","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":"/ovn9Xem6pc7WnRMSygZfb5PNK8B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-21","episode_number":11,"episode_type":"standard","id":1681670,"name":"Vancouver","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-22","episode_number":12,"episode_type":"standard","id":1681671,"name":"Vancouver Island to San Juan Island","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-23","episode_number":13,"episode_type":"standard","id":1681672,"name":"Port Moody to Kamloops","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-24","episode_number":14,"episode_type":"standard","id":1681673,"name":"Kamloops to Banff","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-25","episode_number":15,"episode_type":"standard","id":1681674,"name":"Calgary","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-28","episode_number":16,"episode_type":"standard","id":1681675,"name":"Winnipeg","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-29","episode_number":17,"episode_type":"standard","id":1681676,"name":"Portage La Prairie to Watrous","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-30","episode_number":18,"episode_type":"standard","id":1681677,"name":"Saskatoon","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-31","episode_number":19,"episode_type":"standard","id":1681678,"name":"Edmonton","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-01","episode_number":20,"episode_type":"finale","id":1681679,"name":"Hinton to Jasper","overview":"","production_code":"","runtime":29,"season_number":4,"show_id":76639,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Series 4","overview":"","id":117442,"poster_path":"/i4i3qKXBr94smiAGOMT3pbqm4QE.jpg","season_number":4,"vote_average":0}}}