{"adult":false,"backdrop_path":"/bnOOTHhelgs4Z5NiJjsxEqktpeN.jpg","created_by":[],"episode_run_time":[45],"first_air_date":"2008-09-22","genres":[{"id":80,"name":"Crime"},{"id":18,"name":"Drama"},{"id":9648,"name":"Mystery"}],"homepage":"https://www.mytvsuper.com/en/programme/thefour0002_124490/The-Four/","id":7682,"in_production":false,"languages":["cn"],"last_air_date":"2008-10-24","last_episode_to_air":{"id":389800,"name":"Episode 25","overview":"Everyone rescued by the FOUR, however, most of them were poisoned.  TIT SAU then found YIN for revenge but was stopped by MO CHING.  MO CHING even asked YIN to get medicine to save the group.  In the Fiesta, KING abducted the EMPEROR.  MO-HEI and ZEOI MING met KWAT when they were on the way.  KWAT killed most of the soldiers easily by using “Fatal Arms”.  Afterwards, KING activated the “Fatal Arms” to attack the FOUR.  They could make it but were injured.  KING fought with them in person.  In order to save MO CHING, YIN was injured but she killed KING by using the Cow Hair Needle.  She even saved CHU and the group but the poison were all transferred to YIN’s body.  MO CHING and YIN could finally have an affectionate conversation.  However, as YIN did not want to MO CHING seeing her festering look later on, she left him a letter and went away.  HUNG wanted to leave Kai Feng.… ...","vote_average":0,"vote_count":0,"air_date":"2008-10-24","episode_number":25,"episode_type":"finale","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null},"name":"The Four","next_episode_to_air":null,"networks":[{"id":48,"logo_path":"/v78f4q6DYdRB8dLj4rQBpqQG8pW.png","name":"TVB Jade","origin_country":"HK"}],"number_of_episodes":25,"number_of_seasons":1,"origin_country":["HK"],"original_language":"cn","original_name":"少年四大名捕","overview":"Using the political decline of Northern Song dynasty as the background, this is the story of the Four Great Constables upholding justice while punishing the wicked.","popularity":10.559,"poster_path":"/gK0vTAYarm1KOTIqj0HDKWkiaUv.jpg","production_companies":[{"id":79261,"logo_path":"/4OKzkasr0IV8CSqejjgRfKw7e0m.png","name":"TVB","origin_country":"HK"}],"production_countries":[{"iso_3166_1":"HK","name":"Hong Kong"}],"seasons":[{"air_date":"2008-09-22","episode_count":25,"id":17854,"name":"Season 1","overview":"","poster_path":"/oypULTIDYGqO0eTia19jdojl4GB.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Cantonese","iso_639_1":"cn","name":"广州话 / 廣州話"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7,"vote_count":2,"season_data":{"1":{"_id":"52578daf760ee36aaa6a1150","air_date":"2008-09-22","episodes":[{"air_date":"2008-09-22","episode_number":1,"episode_type":"standard","id":389776,"name":"Episode 1","overview":"he Head of the Sheriff Bureau, CHU KOT CHING-NGO, wanted to stop hostility between the two famed families in Wulin.  Eventually both of them were perished together.  CHU could only save the son of TIN, MO CHING.  Twenty years has passed.  Sheriff Bureau was dismissed 10 years ago.  As a Minister, CHU was so free from trammels.  CHING has grown up and has learnt everything from CHU’s unparalleled skills.  Although he was so cool and grim, he was keen on fighting for equity.  CHU’s ex-colleague, SHU MO-HEI requested a favor of CHU to send the antique swords to Sword Salute Heights for CHIU.  The team chanced upon the head of Eagle League HO YING and the head of Blue Sky Sect LAM PO-TIN accompanying with his daughter LAM YEUK-FEI; together with the rich man CHAN TAI-CHUNG and ZEOI MING, who pretended to be a fortune teller, while everyone was entering Yunnan.  HO KAM, YING’s adopted son, has been teased by ZEOI MING.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-23","episode_number":2,"episode_type":"standard","id":389777,"name":"Episode 2","overview":"v","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-24","episode_number":3,"episode_type":"standard","id":389778,"name":"Episode 3","overview":"v","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-25","episode_number":4,"episode_type":"standard","id":389779,"name":"Episode 4","overview":"CHU has saved ZEOI MING when he was being tortured in jail.  CHU has even promised to help ZEOI MING for a fair justice but requested him to trace KUK WAN-YEUNG in the jail in Kong Chau.  KUK was the one who knew the location of the map for the National Treasure.  Having noted the location of last map, CHU has requested MO CHING and TIT SAU to cooperate with him finding it.  SONG CHI-YIN, the herb doctor, was in distress while she was searching for herbs from the hill.  Luckily TIT SAU has saved her.  Blue Sky Sect and Flying Tiger Sect were fighting each other while the team reached the map keeper HONG BUN’s home.  YIN has stopped the fight.  Actually she was the doctor of BUN.  Somebody claimed that he was YEUNG.  In fact he was chosen by the warden for the fighting game.  He has asked ZEOI MING to help as he did not want to die from the fighting game.  The team has forced BUN to reveal the location of the map.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-26","episode_number":5,"episode_type":"standard","id":389780,"name":"Episode 5","overview":"LANG HUYT wanted to do something harm to ZEOI MING and YEUNG.  Luckily CHU has arrived.  CHU beat him but could finally stop him.  SIU-TO, SHEK’s daughter has met her enemy and been chased by them.  LANG HUYT saved her then.  CHU found all four treasure maps and has sent three persons to trace the treasure.  By CHING’s wit, he instructed them to dig out a curved knife.  Suddenly Blue Sky Sect contended for it.  During the chaos, SIU-KWAT attacked FEI and snatched the knife.  Luckily CHING has got the clue and found the ancient city hiding the treasure.  Three of them have finally arrived the secret chamber of the treasure but LANG HUYT appeared all of a sudden!  Three of them have rendered the medal to CHU.  As mentioned by CHU, the information about the medal was classified.  ZEOI MING would be killed as he knew the secret unless……  CHU has chased LANG HUYT and wanted to kill him eliminating a public scourge.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-29","episode_number":6,"episode_type":"standard","id":389781,"name":"Episode 6","overview":"The team opposed greatly, especially MO CHING and ZEOI MING, when CHU introduced LANG HUYT as a new member of the Sheriff Bureau.  However, CHU has proved that LANG HUYT did not kill ZEOI MING’s lover.  Having failed in the medal snatching, SHEK had to apologize to KING.  In fact KING wanted to use Dalian League to conquer Wulin.  The FOUR stayed in Sheriff Bureau but they had quarrels frequently.  MO CHING visited DOCTOR LUNG for diagnosis and found out YIN has become LUNG’s disciple.  In the faraway Tin Shek Village, quarrying officials were found missing.  YIN tried to stop MO CHING going there for investigation but failed.  Eventually she decided to go and take care of him.  MO CHING asked ZEOI MING and LANG HUYT staying at Ying Fung Bureau while he and TIT SAU entering Tin Shek Village.  During investigation, the team as well as OFFICIAL SZE-MA found some more officials were missing.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-09-30","episode_number":7,"episode_type":"standard","id":389782,"name":"Episode 7","overview":"Officials were killed.  They found doubtful points after autopsy.  MO CHING did not believe the epiphany of NU WOR.  He thought the disappeared village people were suspicious for kidnapping and killing the officials.  However, FEI and the team found the body of the disappeared people.  FEI has helped the team for investigation.  However, she and TIT SAU got lost in the stone forest.  They got poisoned after inhaling the smoke and fell into unconsciousness.  MO CHING told the head of the village that they wanted to give up investigation and pretended to leave.  But on the other hand, MO CHING has asked ZEOI MING and LANG HUYT to disguise themselves and investigate in the village.  LANG HUYT has met TIN’s wife, a crazy village civilian, while investigation.  She indicated that LANG HUYT was her brother.  LANG HUYT even found out that he had a jade pendant which was similar as TIN’s.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-01","episode_number":8,"episode_type":"standard","id":389783,"name":"Episode 8","overview":"In order to look for TIT SAU and FEI, ZEOI MING has used the crazy TIN.  MO CHING tailed after TSUI and found out she met with NU WOR secretly…… TIT SAU and FEI discovered the kidnapped officials in the cave, meanwhile they found the entrance of the cave was blocked by a big rock.  While the civilians were about to poison the people inside the cave, luckily TIN led ZEOI MING and LANG HUYT to save the people.  MO CHING finally exposed the haunted secret of NU WOR.  In order to stop KING annihilating the village, the FOUR has put on a play of “NU WOR’s epiphany of giving a treasure”.  After this incident, the team has learnt the miserable history of LANG HUYT.  TO deceived SHEK and requested to become NGO’s disciple.  On the other hand, HUNG has helped her best friend SAU-FUN going to Kai Feng.  Because of losing the escorted treasures, LEE has forced FONG’s armed escort house to compensate for it.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-02","episode_number":9,"episode_type":"standard","id":389784,"name":"Episode 9","overview":"Having diagnosed by YIN, YAU-FUN was found suffering from a strange disease.  CHU asked the team to investigate in the village spreading such disease.  They found the village was classified as epidemic village.  The officials only allowed them to solve the crisis within seven days.  Otherwise they would burn the whole village.  ZEOI MING established a fake armed escort house attracting LEE to use their service.  He even asked TUNG to make a concealed cabinet in the trunk that was used to store the treasures; in order to let an inspector hidden inside.  TO has volunteered to be the inspector.  DR. LO has tried very hard to cure the civilians in the village, however, he refused to comment YIN’s suggestions.  MO CHING has infected during investigation.  YIN felt quite helpless about curing MO CHING.  Having tailed after LO, TIT SAU and FEI found out a secret underground clinic where DR.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-03","episode_number":10,"episode_type":"standard","id":389785,"name":"Episode 10","overview":"By LANG HUYT and ZEOI MING’s help, TO could finally be back to Sheriff Bureau safely.  SHEK then withdrew with his team.  CHU has discovered that IRON FIRST had had an iron plate.  He then further investigated the story of TIT SAU by asking of those iron makers.  Afterwards, he found out that TIT SAU was the descendent of IRON JUDGE who has massacred all members of SHING’s family.  CHU has decided to conceal the secret in order not to let MO CHING and TIT SAU knew their profound hatred.  On the other hand, there were serial homicide cases in the town but they could not figure out what the murderous weapon was.  MO CHING has pondered over it and finally inferred what the weapon looked like.  KING fawned on CHIU during his short stay in Kai Feng.  On the other hand, HUNG discovered that SUET has contacted with KING’s follower……  MO CHING has figured out how the weapon was constructed but CHU has deliberately assigned another case to him.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-06","episode_number":11,"episode_type":"standard","id":389786,"name":"Episode 11","overview":"ZEOI MING pretended winning a lot of money in order to induce the murderer.  Having been arrested, the murderer said he in fact was a fisherman.  He committed the crime as he got a box of weapon.  While the Sheriff team accompanied the murderer to his home for the weapons, they were being plotted.  The whole box was snatched by someone.  In fact it was KING sending somebody to snatch it.  HUNG has hinted CHU that SUET might be a hidden traitor.  However, they eventually discovered that…… FEI found out that a team member CHAN KAU came to blows with the junior host of Flying Tiger Sect.  She then kicked him out of Blue Sky Sect.  In order to trigger disputes between the two Sects, SHEK has killed the junior host of the Flying Tiger Sect and imputed to Blue Sky Sect.  SHEK pretended to help Flying Tiger Sect finding the murderer but in fact he wanted to instigate the dispute.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-07","episode_number":12,"episode_type":"standard","id":389787,"name":"Episode 12","overview":"CHU has decided to release the arrested.  Afterwards SHEK intended to recruit TIN but was refused.  HUNG was enraged and left when she found out King of Qi CHIU CHEONG accompanying with a prostitute entering the temple.  She chanced upon the runaway KAU.  In fact KAU was the person who made her father committing suicide ages ago.  ZEOI MING found out the herbs bought by TUNG was fake.  She bought for her family for health strengthening purpose.  Thus ZEOI MING has accompanied TUNG to argue with the shop.  Meanwhile, KWAT has brought a team of people to seek for KAU.  But in fact he wanted to ruin Chick Alley, a territory of Blue Sky Sect.  HUNG has captured KAU for revenge.  On the other hand, CHU arrived on time and revealed the truth.  FEI lead the team fighting with KWAT.  The neighbors also took part in the battle in order to protect their home.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-08","episode_number":13,"episode_type":"standard","id":389788,"name":"Episode 13","overview":"KING and EMPEROR SUNG met two groups fighting with each other and were almost being injured when they dressed down for a leisure tour.  In fact this was a trap arranged by KING.  He wanted to speed up the EMPEROR’s decision to elect a Sect to unify Wulin.  Sheriff Bureau was assigned to look after the safety during the martial arts contest.  TIN, LANG HUYT and MO CHING took the same boat upon departure.  However, the boat was exploded.  The team members were unaccounted.  Fortunately they could all escape from the dangerous situation as MO CHING has discovered the bomb in the first place.  Those survivors were floated to an uninhabited island.  The contest has started but TIN was missing.  FEI represented her father and won by chance.  TIT SAU tried to persuade FEI giving up the contest but was refused by her.  Those survivors in the uninhabited island suspected there were fierce beasts as MASTER CHUN was killed suddenly.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-09","episode_number":14,"episode_type":"standard","id":389789,"name":"Episode 14","overview":"SHEK deliberately killed the head of Flying Tiger Sect during the contest.  It made some sects giving allegiance to Dalian League and quitting the contest.  In the island, those survivors were suddenly poisoned and became paralysis.  The murderer then appeared and injured TIN……  On the other hand, KING announced that SHEK would be the Head of Wulin during the closing ceremony of the contest.  However, TIN has finally come back and challenged SHEK.  At the eleventh hour, TIN was injured and passed away even though he was advantaged.  Having become the Head of Wulin, SHEK flagrantly attacked those government officials who opposed KING.  While FEI proposed to revenge for her father, KWAT has arrived with a team of people.  In fact those team members have given allegiance to Dalian League.  FEI was even expelled from Blue Sky Sect.  TIT SAU was beaten by FEI and passed out when he proposed leaving the Capital with her.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-10","episode_number":15,"episode_type":"standard","id":389790,"name":"Episode 15","overview":"MO CHING and the team suddenly appeared when TIT SAU and FEI were being trapped.  In order to assist TIT SAU, three of them have given up the Sheriff Medal and fought with Dalian League.  NGO arrived at the eleventh hour.  He has saved the team sneaking out from SHEK smartly.  FOOK has got back TIN’s relics from Blue Sky Sect.  TIT SAU found out that the bloodstains were strange from TIN’s clothes and passed to MO CHING’s for NGO’s further investigation in the day after.  MO CHING has used his concealed weapons as he found someone sneaked into his room at night.  But eventually he has injured CHI-YIN mistakenly.  YIN confessed her love to MO CHING when he was dressing the wound for her.  Having investigated, CHU declared that there was nothing suspicious about the clothes, however, TIT SAU felt like the clothes were already exchanged by somebody.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-13","episode_number":16,"episode_type":"standard","id":389791,"name":"Episode 16","overview":"Right after LANG HUYT has escaped from the Palace, CHU, who was tailed after him, tried to persuade him to go back for investigation.  LANG HUYT has refused.  He even hit and injured CHU.  During his escape, LANG HUYT has met an injured accompanist of JIN Empire.  He sent him to CHI YIN’s clinic and left.  In fact the son of the envoy, YUEN NGAN CHUNG, was kidnapped by unknown parties in the mountain.  Having back to the mountain, LANG HUYT has met KWAT who brought a team to chase after him and to kill him.  During the fighting, CHU and MO-HEI rushed in.  In fact CHU has used his life to guarantee that LANG HUYT could find YUEN NGAN CHUNG within 7 days.  TUNG was kidnapped by the labor peddler while she was helping ZEOI MING to buy food.  The quarry was actually operated by KING’s son CHOI TO illegally.  TUNG has discovered that YUEN NGAN CHUNG was also kidnapped by them.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-14","episode_number":17,"episode_type":"standard","id":389793,"name":"Episode 17","overview":"TUNG was fallen and sprained while she was escaping from the quarry.  She then asked CHUNG to escape on his own.  LANG HUYT found out CHUNG when he was tracing alone.  In order to save CHUNG while he was falling from the cliff, LANG HUYT risked his life and was bitten by a viper.  The team has saved the imprisoned quarry worker and discovered that TUNG as well as the other women were raped.  As LANG HUYT has saved CHUNG, the EMPEROR has forgiven his guilt.  TIT SAU has forced FAT confesses that KING’s son CHOI TO was the chief instigator.  He then went to CHOI’s residence for justice.  Luckily CHU has arrived and reconciled.  In order to help TO free from guilty, YIN, KING’s spy, threatened FAT that his family would be in danger by showing him with his wife’s hair pin while she was curing FAT.  FAT has then committed suicide in jail.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-15","episode_number":18,"episode_type":"standard","id":389792,"name":"Episode 18","overview":"KING has bribed some officials releasing his son while he was being exiled.  However, he was told that TO was killed.  KING thought this was a revenge planned by TIT SAU.  While they were at daggers, CHU arrived and stated that he would handle impartially which has stopped KING from going further temporarily.  They found out the lost hair pin of FAT’s wife when they were checking FAT’s relics.  TIT SAU has told them about his doubts about exchange of the cloth with TIN’s blood by a spy.  MO CHING tried to set up a trap to test YIN but eventually proved that YIN had no contact with KING.  When FEI accompanied TIT SAU to drink, they found YUNG torturing his subordinates.  TIT SAU then stopped and taught him a lesson.  On the day after, YUNG was found killed by punch.  KWAT brought a team visiting CHU for justice which was actually a tough job for CHU.  The EMPEROR has stopped CHIU spending extravagantly.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-16","episode_number":19,"episode_type":"standard","id":389794,"name":"Episode 19","overview":"FEI watched over TIT SAU overnight but found him missing while she was awakened.  In the morning, TI FU found his son wearing a cloth with blood falling down in front of their house.  KING has explained and forced the EMPEROR about it.  Eventually TIT SAU was sentenced to death punishment after autumn.  FU was so sorrow and has decided to commit suicide with his daughter.  ZEOI MING’s family has arrived and stopped TI FU.  Moreover, ZEOI MING has convinced TUNG for regeneration.  MO CHING has discovered that some bribed officials were punched to death by a skilled-hand who was good at boxing.  He used the eunuch TUNG KOON, who colluded with KING, as a bait in order to lure the murderer.  YIN has discovered that the concealed weapon which was used by the murderer was homogeneous with the one inside MO CHING’s leg for 20 years while she was curing him.  CHU has chanced upon CHIU and HUNG and learnt that CHIU has become the Master of Tea.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-17","episode_number":20,"episode_type":"standard","id":389795,"name":"Episode 20","overview":"When MO CHING and YIN have re-visited the Master of Hang Hung Temple, MO CHING finally learnt that he was a descendant of SHING’s family.  The eunuch KOON has been assassinated even though he was protected by Dalian League and Sheriff Bureau.  The team has found a bamboo slip which could prove TIT SAU’s innocence beside KOON’s body.  ZEOI MING could then prevent TIT SAU from being executed.  LANG HUYT has traced the murderer successfully.  When the team was going to arrest the murderer, YIN also sent somebody to kill that person.  TIT SAU has found out that the murderer was in fact his kung fu master as well as his elder brother FOK CHING while fighting with him.  Years ago, in order to flee from hunting, CHING could not dare to recognize TIT SAU even though he found him.  MO CHING and TIT SAU interrogated CHU if he knew their history beforehand.  CHU has confessed.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-20","episode_number":21,"episode_type":"standard","id":389796,"name":"Episode 21","overview":"TIT SAU was worrying whether he should arrest CHING.  ZEOI MING visited him and taught him a lesson.  HUNG has discovered that KWAT and CHIU were helping KING to transport sulfur.  She then sent CHU a pigeon mail.  CHU led LANG HUYT and ZEOI MING to investigate.  LANG HUYT and ZEOI MING disguised as porters to investigate the Tea House and found out the evidence of the crime successfully.  Having learnt that HUNG met CHU in secret, CHIU was enraged and put her under house arrest.  When CHIU was discussing with KING about how to deal with the problems, CHU arrived and he has even agreed not to further investigate the smuggling issue provided that they could free HUNG.  CHING brought TIT SAU to their former residence.  He told him that he stayed in the Capital was because he wanted to investigate who would trap TIT SAU.  He even requested TIT SAU to follow him punishing the bad guys privately.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-21","episode_number":22,"episode_type":"standard","id":389797,"name":"Episode 22","overview":"CHU and MO CHING investigated CHING’s body and found out CHING was killed by the Cow Hair Needle dug into the blood vessel.  MO CHING recalled that CHING’s response was the same as PO-TIN before death.  He doubted that two of them were killed by the same person.  KING and SHEK met with CHIU and brought a fortune teller visiting him.  The fortune teller said CHIU might have the possibility to be the EMPEROR.  Some officials have discovered SHEK’s Dalian League smuggling gunpowder and were all killed by KING.  He even brought CHIU to the weapon factory showing off his power.  Having noted that TO was in love with LANG HUYT deeply, SHEK decides to send her to Lingnan for marriage.  He also asked KWAT to Kunlun Mountain learning kung fu.  LANG HUYT has kidnapped the bridal sedan chair.  TO thought that LANG HUYT wanted to runaway with her.  CHU induced SHEK chasing to the City Wall.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-22","episode_number":23,"episode_type":"standard","id":389798,"name":"Episode 23","overview":"All team members in Sheriff’s Bureau worried about MO CHING and searched him from everywhere.  However, CHU did not pay much significance which has enraged the team.  FEI was getting better but meanwhile she was shocked to speechless when she found out she was blind temporarily.  KWAT reported to SHEK that he could not find TO.  SHEK then told him that CHU has captured TO.  While KWAT was persuading SHEK to report it to KING, SHEK refused.  In order to prevent KWAT from notifying KING, SHEK tied him up and sent him to Kunlun Mountain.  CHIU was informed by CHU about the EMPEROR’s intention to investigate rebellion against the state.  He frightened and pushed KING to rebel earlier.  As ZEOI MING has discovered CHU colluding with KING, CHU killed him by his sword.  KING pushed YIN to find out from MO CHING about the production process of “Fatal Arms”; however, YIN brought MO CHING leaving the jail stealthily.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-23","episode_number":24,"episode_type":"standard","id":389799,"name":"Episode 24","overview":"LANG HUYT has realized that CHU was in danger when TO found the dying SHEK in the forest.  SHEK pleaded LANG HUYT for taking care of TO before his death.  Sheriff’s Bureau was dismissed and ZEOI MING had to runaway with his family.  TUNG and FEI were both caught by the officers.  MO CHING and YIN stayed in a village as recluses.  Meanwhile, MO CHING found out that his swaddling clothes during infant’s time actually hidden the production method of making “Fatal Arms”.  Although YIN understood MO CHING’s love, she stole the blueprint.  While MO CHING noted YIN’s betrayal, he then decided to rescue CHU with the team.  YIN was commanded by KING to poison everyone in the jail.  On the other hand, she met CHU and told him about the rebelling plan of KING on the date that the EMPEROR has chosen for a fiesta in honor of deities.  YIN finally poisoned everyone’s meal in the jail.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-10-24","episode_number":25,"episode_type":"finale","id":389800,"name":"Episode 25","overview":"Everyone rescued by the FOUR, however, most of them were poisoned.  TIT SAU then found YIN for revenge but was stopped by MO CHING.  MO CHING even asked YIN to get medicine to save the group.  In the Fiesta, KING abducted the EMPEROR.  MO-HEI and ZEOI MING met KWAT when they were on the way.  KWAT killed most of the soldiers easily by using “Fatal Arms”.  Afterwards, KING activated the “Fatal Arms” to attack the FOUR.  They could make it but were injured.  KING fought with them in person.  In order to save MO CHING, YIN was injured but she killed KING by using the Cow Hair Needle.  She even saved CHU and the group but the poison were all transferred to YIN’s body.  MO CHING and YIN could finally have an affectionate conversation.  However, as YIN did not want to MO CHING seeing her festering look later on, she left him a letter and went away.  HUNG wanted to leave Kai Feng.… ...","production_code":"","runtime":45,"season_number":1,"show_id":7682,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":17854,"poster_path":"/oypULTIDYGqO0eTia19jdojl4GB.jpg","season_number":1,"vote_average":0}}}