{"adult":false,"backdrop_path":"/uiVNZz9qSpNf6iGCznIPpAefijV.jpg","created_by":[],"episode_run_time":[35],"first_air_date":"2018-03-12","genres":[{"id":18,"name":"Drama"}],"homepage":"http://www.imbc.com/broad/tv/drama/tempted/","id":77284,"in_production":false,"languages":["ko"],"last_air_date":"2018-05-01","last_episode_to_air":{"id":1454360,"name":"Goodbye, My First Love","overview":"Due to the swelling in his brain, Si Hyun is still in a coma. Tae Hee decides to postpone her flight to Germany and stays by his side at the hospital. Finally, Si Hyun regains consciousness, and Tae Hee leaves the country without seeing his face. Five years have passed, and Tae Hee now works as an architecture. She complains about a new client of hers who keeps asking whether the terrace she is going to build would be a good place to spot constellations.","vote_average":0,"vote_count":0,"air_date":"2018-05-01","episode_number":32,"episode_type":"finale","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/histpXoAIbGlNmbzCgGhe88fLYe.jpg"},"name":"Tempted","next_episode_to_air":null,"networks":[{"id":97,"logo_path":"/pOSCKaZhndUFYtxHXjQOV6xJi1s.png","name":"MBC","origin_country":"KR"}],"number_of_episodes":32,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"위대한 유혹자","overview":"Love is just a game for a chaebol heir who agrees to a petty bet with his friends to seduce a college student — until he starts to fall for her.","popularity":25.979,"poster_path":"/vev9N5Iiuf51h9Gx0TtLkiP7ZVT.jpg","production_companies":[{"id":36225,"logo_path":"/haNfBy6ZS1a1teY9JXNHHkFhZEj.png","name":"Bon Factory","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2018-03-12","episode_count":32,"id":99645,"name":"Season 1","overview":"","poster_path":"/3DdwMxQyDv1gMtpN7GghVSvaY5e.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.7,"vote_count":32,"season_data":{"1":{"_id":"5a8abd1ec3a368633907cad1","air_date":"2018-03-12","episodes":[{"air_date":"2018-03-12","episode_number":1,"episode_type":"standard","id":1434959,"name":"The Best Revenge","overview":"Soo Ji, Si Hyun, and Se Joo are best friends who have just graduated from high school. Like their crazy personalities, they do not graduate like normal students. They disclose an affair one of the teachers have been having by airing the footages on a big screen during the graduation ceremony. Meanwhile, Soo Ji’s first love, Lee Ki Young, tells her some hurtful words.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/wZOr12rZ9o1C4m2i6uQ77AySKe0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-12","episode_number":2,"episode_type":"standard","id":1434960,"name":"Surprise Engagement Announcement","overview":"After the graduation, Si Hyun and Se Joo decides to go clubbing while Soo Ji is out with Ki Young. At the club, Si Hyun meets a woman and shares a kiss with her. It is later revealed that Si Hyun has kissed his fellow classmate’s mom. Meanwhile, Soo Ji decides to take revenge on Ki Young and targets Park Hye Jeong and Eun Tae Hee.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/2QRaRhDNN90eCG1SRKk3l2lSu5z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-13","episode_number":3,"episode_type":"standard","id":1434961,"name":"I’m on Your Side","overview":"Soo Ji's mother and Si Hyun's father make an official announcement about their engagement. Only then, do Soo Ji, Si Hyun, and Se Joo find out about the adults' relationship. Ki Young, Soo Ji's first love, makes snide remarks about the surprise announcement, and Se Joo stands up for her. Meanwhile, the three musketeers try to find a way to stop their parents from getting married.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/cHw4JaMhUIbrQRZ47DTQ87I3MKC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-13","episode_number":4,"episode_type":"standard","id":1434962,"name":"How Can Anyone Hate Me?","overview":"In order to prove Si Hyun's sincerity towards her, Soo Ji tells him to participate in a game of seduction. Si Hyun agrees to do so without hesitation. Si Hyun tries his best to make Tae Hee like him, but Tae Hee won't budge. Meanwhile, Soo Ji visits her mother's office and pleads her not to get married.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/xlsuQMFB2FxsvFkAC7YdxLpSmkw.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-19","episode_number":5,"episode_type":"standard","id":1454333,"name":"Se Joo’s New Girlfriend","overview":"Si Hyun, Soo Ji, and Se Joo discuss how Si Hyun will seduce Tae Hee. Si Hyun tries to make Tae Hee feel like it is fate by purposely running into her often. In addition, he also tries to win Tae Hee's sympathy. However, Tae Hee does not easily waver. Finally, he gets the chance to eat with her, and they seem to bond. At that moment, Tae Hee tells him she does not want to see his face anymore.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/2wvVxPmY9R1GV921oj4kKVSXa9f.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-19","episode_number":6,"episode_type":"standard","id":1454334,"name":"How Do You Feel?","overview":"Unintentionally, Si Hyun helps Tae Hee out at a nursing home. Tae Hee sees a soft and generous side to him that she never knew about, and her heart sof-tens. On their way back home, she tells him that she will not date him, and Si Hyun asks if she dislikes him that much. Meanwhile, Si Hyun feels a strange emotion toward Tae Hee.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/syFRsbY5Z8x87fS5j8gxt65vpWo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-20","episode_number":7,"episode_type":"standard","id":1454335,"name":"The Broken Dish","overview":"Si Hyun and Tae Hee begin to bond, and Si Hyun tells her that he is afraid of hurting her. Tae Hee begins to have strange feelings toward him. Meanwhile, Soo Ji accidentally breaks a dish that Si Hyun received from the nursing home. Si Hyun gets very upset at her, and Soo Ji is shocked to see him react that way.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/wVu8IWyyRc1xPXE3TIMs0a9muEX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-20","episode_number":8,"episode_type":"standard","id":1454336,"name":"Confession","overview":"Si Hyun tells Soo Ji that he will stop chasing after Tae Hee. Upon hearing this, Soo Ji is frustrated. Meanwhile, Kwon Seok Woo meets Seol Young Won, Tae Hee's mother. They talk about the past and catch up. Amidst all this, Seok Woo's fiancee and Soo Ji's mother, Myung Mi Ri, is suspicious about him.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/ldY9PilmSpxXEjTZdB4n0NBWVbO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Se-joo's Brother","credit_id":"618d358ce93e9500626ee8d0","order":500,"adult":false,"gender":2,"id":3305523,"known_for_department":"Acting","name":"Han Dong-kyu","original_name":"Han Dong-kyu","popularity":1.99,"profile_path":"/5LfXuqGM3awcPsN9YRrvttiV6Uk.jpg"}]},{"air_date":"2018-03-26","episode_number":9,"episode_type":"standard","id":1454337,"name":"Can Someone Forget That They Kissed Someone?","overview":"Not being able to move into her dorm, Si Hyun gets Tae Hee a place to stay. Furthermore, the place happens to be across his. Tae Hee has no idea that the owner of the building is Si Hyun himself. Meanwhile, Soo Ji senses that Si Hyun may not be simply putting on an act in front of Tae Hee.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/abTZRusWOmOAYlIjfBD5LKpTcGG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-26","episode_number":10,"episode_type":"standard","id":1454338,"name":"The Trip","overview":"Soo Ji plans to go on a trip with Si Hyun and Se Joo. On top of that, she invites Kyung Joo and Tae Hee as well. Kyung Joo is exhilarated at the fact that she will be spending the night with Se Joo. However, on the day of the trip, Kyung Joo's mom falls sick, and she is forced to send Tae Hee first. Si Hyun hears about this and goes to pick Tae Hee up.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/oVlo56DRJPBkh3tdXmtfAkmVbx0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-27","episode_number":11,"episode_type":"standard","id":1454339,"name":"Why Do You Keep Pretending to Be Bad?","overview":"During the trip, Si Hyun takes Soo Ji's side and acts coldly toward Tae Hee. Tae Hee is surprised to see him act this way since he has always been warm toward her when they were together. Si Hyun apologizes, and the two reconcile. However, Soo Ji finds her and tells her a lie. She lies that Si Hyun and herself are actually in love with each other and that Si Hyun's only acting this way toward Tae Hee in order to hide it.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/xNVxqFyL0lx1dNyoMPdwAWMqv3D.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-03-27","episode_number":12,"episode_type":"standard","id":1454340,"name":"Why Am I Hearing His Voice?","overview":"After hearing what Soo Ji said, Tae Hee is more and more disappointed at Si Hyun. However, she can't help but think about him. On days when he is not around, she misses him. While talking on the phone with her dad, Tae Hee realizes that although she has confessed her feelings to Si Hyun, he has never replied back. Heartbroken, she decides to end their relationship.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/5xBa0h0P8zFP9YfPLiflwLW1dpr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-02","episode_number":13,"episode_type":"standard","id":1454341,"name":"What Did You Say to Tae Hee?","overview":"Believing that she has been the only one with feelings in their relationship, Tae Hee tells Si Hyun that she wants to end it with him. Si Hyun cannot reply, but he knows that he is falling for her. Broken, Si Hyun gets drunk at a bar, and Soo Ji and Se Joo check up on him. Si Hyun asks Soo Ji what she said to Tae Hee, and she tells him the truth.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/vhbui2uumMkfevDpcY04K1dp5t2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-02","episode_number":14,"episode_type":"standard","id":1454342,"name":"Let’s Get Married Tomorrow","overview":"Si Hyun confesses his feelings toward Tae Hee, and the two spend the night together at the hospital. The next day, Si Hyun finds out that his credit card is blocked, and Tae Hee pays for his hospital bill. Meanwhile, Seok Woo has trou-ble seeing and goes to the doctor, only to find out that he will go blind in the future.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/qscLu182jiv27h9hZmbs2PQHzqF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-03","episode_number":15,"episode_type":"standard","id":1454343,"name":"That Isn’t My Mom, Right?","overview":"Soo Ji tells Si Hyun that his dad is seeing some other woman. He demands to know who she is, but Soo Ji does not tell him exactly who she is. Meanwhile, Se Joo and Soo Ji decide to go to a street bar. There, Soo Ji spots Seok Woo and Young Won on a date, having a drink together.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/A5WABlZbOo9iciFUOL9eqDc4YwM.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-03","episode_number":16,"episode_type":"standard","id":1454344,"name":"Constellations","overview":"Si Hyun finds Tae Hee living in a pile of mess and not having a balanced diet. He tells her that he will come by to take care of her more often and cleans the house. He also shyly asks her to change her passcode to his number, to which she tells him that it is already his number. Meanwhile, Si Hyun visits Seok Woo and promises that he will find out whom he is seeing.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/581COrofTfddWmXND3POSiL7lsW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-09","episode_number":17,"episode_type":"standard","id":1454345,"name":"I Really Want to Sleep with You","overview":"Si Hyun and Tae Hee go on a trip. There, the two drink makgeolli, a Korean al-coholic beverage, together in broad daylight. Si Hyun is hesitant to try it at first, but Tae Hee urges him. They end up drinking too much, miss the last bus, and decide to spend the night at an old inn. However, Si Hyun doesn't want to go in, and Tae Hee cannot understand why. Meanwhile, Soo Ji realizes that Si Hyun is spending the night out with Tae Hee.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/d7cxYoVrRlFENxLQO0ZQSP3esOg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-09","episode_number":18,"episode_type":"standard","id":1454346,"name":"The Break Up","overview":"Si Hyun finds out that Tae Hee knew all along that Seok Woo was not his bio-logical father. She apologizes for waiting for him to tell her the truth instead of mentioning it to him first. However, he tells her that he wants to be alone. Meanwhile, Si Hyun has a talk with Young Won without knowing that she is Tae Hee's mother.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/ldIKp0vd1qkqCKs60rFINzvi4Vy.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-10","episode_number":19,"episode_type":"standard","id":1454347,"name":"Do You Not Like Me Anymore?","overview":"Si Hyun invites Tae Hee to a luxurious place where Soo Ji and Se Joo are waiting. In front of them, Si Hyun acts very coldly toward Tae Hee and even tells her that he is completely different from her. Tae Hee asks him whether he does not like her anymore, and Si Hyun lies. While talking with Soo Ji in private, Si Hyun tells her something she has dreaded to hear.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/faciLTBWWrnKJAt9AvnR0ZnzEf3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-10","episode_number":20,"episode_type":"standard","id":1454348,"name":"Don’t Go","overview":"Soo Ji asks Seok Woo to meet her. She tells her about his secret affair with the potter, Seol Young Won. She then tells him to allow her to marry Si Hyun. Seok Woo is flustered that she knows about Young Won but keeps his calm. Meanwhile, after breaking up with Si Hyun, Soo Ji gets drunk at Se Joo's restaurant. Not knowing whom else to call, Se Joo calls Si Hyun.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/r9ibQqNZePdGIQvxOCkdsZN1iSC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-16","episode_number":21,"episode_type":"standard","id":1454349,"name":"For You and Me","overview":"Si Hyun tells Tae Hee the real reason why he has been acting coldly toward her. He tells her that his mother was the one who committed the hit-and-run and ended up traumatizing her. Tae Hee tells him that it’s not his fault and that they shouldn’t break up because of what has happened. Meanwhile, Si Hyun visits Young Won.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/iv51IX6SlumTmqMNHRflAFGQEum.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-16","episode_number":22,"episode_type":"standard","id":1454350,"name":"I Never Disliked Tae Hee","overview":"Si Hyun tells Seok Woo that he has just met with Young Won. He talks about how unfair it is that his late mother had to suffer because of their affair. At this time, Si Hyun finds out that Soo Ji told Seok Woo that she would like to get married to Si Hyun. Meanwhile, Soo Ji doesn't understand why Si Hyun seemed so depressed and hurt to break up with Tae Hee, and he tells the truth.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/tQ1Gh1Fvn1aNcBZE3JNVlCharhq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-17","episode_number":23,"episode_type":"standard","id":1454351,"name":"You Started This, But I’ll End It","overview":"On her way to comfort Si Hyun, Soo Ji sees Tae Hee and Si Hyun enter his house. She tells Se Joo that she won’t interfere with her mom and Seok Woo’s marriage anymore. Meanwhile, on his way back from seeing Young Won, Seok Woo gets into a car accident. Young Won calls Si Hyun to come pick Seok Woo up. During their talk, Si Hyun finds out that Young Won’s daughter is Tae Hee.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/vL74iRAAPJ7L6N40mRt5nS4bsMk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-17","episode_number":24,"episode_type":"standard","id":1454352,"name":"Please Don’t Turn Away from Me","overview":"Soo Ji tells Tae Hee everything about her mother, Seol Young Won. She tells her that Si Hyun’s father is seeing Young Won and that Si Hyun’s mother also died because of her. Si Hyun angrily asks Soo Ji whether Tae Hee knows the truth, and she says yes. Si Hyun looks for Tae Hee, but she is nowhere to be seen.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/en0TtbyxGBjeT44xfGOwvw1fROr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-23","episode_number":25,"episode_type":"standard","id":1454353,"name":"I Decided to Wait for You","overview":"Tae Hee breaks up with Si Hyun and moves out of his building. Si Hyun wants to grab onto her, but since he knows that he has always been the one to hurt her, he decides to wait. Everywhere he goes, he is reminded of her. Meanwhile, Si Hyun tells his grandmother that he is not Seok Woo's biological son, and she tells him not to mention it to anyone until she says so.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/DPblJVZRsvlmA5BYMlELclPNqF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-23","episode_number":26,"episode_type":"standard","id":1454354,"name":"It’s You Who Hit Me","overview":"Tae Hee meets Si Hyun while visiting Myoungjeong Hospital. While talking about how Si Hyun found out that her mother was the hit-and-run driver, Tae Hee notices that Mi Ri knew her personal information. At the same place, she runs into Mi Ri who gives first aid to a man. Tae Hee experiences flashbacks to the night when she got into the accident and hears Mi Ri's voice.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/uAyXRlVpQr33vCJDL2DKS4btGMS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-24","episode_number":27,"episode_type":"standard","id":1454355,"name":"Soo Ji Won’t Be Able to Handle It","overview":"Si Hyun goes to Mi Ri’s house and confronts her about his late mother’s death. Soo Ji overhears everything but pretends not to know. Meanwhile, Si Hyun’s grandmother shows him proof that he and Seok Woo are biologically related. Si Hyun agrees to go to the States with her and begins to organize his surround-ings.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/qyplncxyx7vJ3Np496qwHb5mjD4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-24","episode_number":28,"episode_type":"standard","id":1454356,"name":"Love and Be Loved","overview":"Tae Hee’s father flies in to visit her. While talking, he tells her that it’s a huge miracle for two people to love each other at the same time. Upon hearing this, she thinks about the joyful times that they have spent together. Meanwhile, Si Hyun asks Tae Hee to spend one day with him, and she agrees to do so.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/8nOA3uEM5ahBBX1u4lLn4RKL12c.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-30","episode_number":29,"episode_type":"standard","id":1454357,"name":"I Want You to Be in Pain","overview":"Out of revenge for Si Hyun, Se Joo brings Tae Hee to their hideout. There, he shows her videos and evidence of how they decided to target her for their own fun. He tells her that although Si Hyun first agreed to do this in order to please Soo Ji, at one point, he started to actually develop feelings for Tae Hee. Mean-while, Si Hyun finds out and tries to explain everything to Tae Hee. However, Tae Hee is not willing to take him back this time.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/BIFN8fctbv0hJaBYN7xzXstA9z.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-04-30","episode_number":30,"episode_type":"standard","id":1454358,"name":"The Truth Is Revealed","overview":"Left with a broken heart, Tae Hee tells her father who has visited Korea that she will return to Germany with him. Without asking any questions, he agrees to bring her back. Meanwhile, Assemblyman Kim Se Cheol has been taken into custody by the prosecution on charges of bribery. Because of this, Mi Ri's company is also being investigated. Soo Ji does not understand why her mother has to always take fault regarding JK's business.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/bjMTgFdXsntecEq6YAremxZdubD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-01","episode_number":31,"episode_type":"standard","id":1454359,"name":"I Had No Idea I Couldn’t Control My Feelings","overview":"While trying to protect Tae Hee from Ki Young, Si Hyun gets hit in the head by a golf cue. He immediately loses consciousness and is hospitalized. Ki Young goes to Soo Ji and threatens her to stay quiet and not do anything about her two best friends. Meanwhile, seeing what has become of Se Joo and Si Hyun, Soo Ji overdoses on her sleeping pills.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/g4WwmKkLEEOV9N8cpkXpW9NojLv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-01","episode_number":32,"episode_type":"finale","id":1454360,"name":"Goodbye, My First Love","overview":"Due to the swelling in his brain, Si Hyun is still in a coma. Tae Hee decides to postpone her flight to Germany and stays by his side at the hospital. Finally, Si Hyun regains consciousness, and Tae Hee leaves the country without seeing his face. Five years have passed, and Tae Hee now works as an architecture. She complains about a new client of hers who keeps asking whether the terrace she is going to build would be a good place to spot constellations.","production_code":"","runtime":35,"season_number":1,"show_id":77284,"still_path":"/histpXoAIbGlNmbzCgGhe88fLYe.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":99645,"poster_path":"/3DdwMxQyDv1gMtpN7GghVSvaY5e.jpg","season_number":1,"vote_average":0}}}