{"adult":false,"backdrop_path":"/6Q8nRY4Hdr4dePwiEEy9ikgqNoQ.jpg","created_by":[],"episode_run_time":[43],"first_air_date":"2000-02-27","genres":[{"id":10764,"name":"Reality"}],"homepage":"http://www.woestijnvis.be/","id":7858,"in_production":false,"languages":["en"],"last_air_date":"2013-10-16","last_episode_to_air":{"id":967008,"name":"Episode 21","overview":"Contestants get a chance to interrogate each other in a lie detector test. Then, in the final quiz the question viewers have been dying to know: Who Is the Mole?","vote_average":0,"vote_count":0,"air_date":"2013-10-16","episode_number":21,"episode_type":"finale","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null},"name":"The Mole","next_episode_to_air":null,"networks":[{"id":118,"logo_path":"/83L2wF8tM76nUQHzOBOBAGlPQVP.png","name":"Seven Network","origin_country":"AU"}],"number_of_episodes":62,"number_of_seasons":6,"origin_country":["AU"],"original_language":"en","original_name":"The Mole","overview":"The Mole has had five seasons of its Australian version, with the latter two taking place overseas in New Caledonia and New Zealand respectively. It is a reality television program with a twist. Not only does it not contain a public vote, but one of the 'contestents' on the show is trying to do everything in his or her power to prevent the others from winning the money on offer. It is up to the real contestents to work out who this person is, and the one who knows the least about their identity, as calculated through a computer quiz, is eliminated from the show. But who is this traitor? Who is the saboteur? Who is the mole?","popularity":1.51,"poster_path":"/pLEjkeO2CgUmrFukRXbj7ZTCXhc.jpg","production_companies":[{"id":46814,"logo_path":"/b3sb5sFRj0EEpMHlNtFBO0fQKSw.png","name":"Seven Network","origin_country":"AU"}],"production_countries":[{"iso_3166_1":"AU","name":"Australia"},{"iso_3166_1":"NC","name":"New Caledonia"},{"iso_3166_1":"NZ","name":"New Zealand"}],"seasons":[{"air_date":"2000-02-27","episode_count":9,"id":18000,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2001-02-21","episode_count":10,"id":18001,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2002-02-20","episode_count":12,"id":18002,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2005-08-25","episode_count":10,"id":18003,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2005-08-25","episode_count":0,"id":18005,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0},{"air_date":"2013-07-02","episode_count":21,"id":18004,"name":"Season 6","overview":"","poster_path":null,"season_number":6,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"Who is the traitor?","type":"Reality","vote_average":8,"vote_count":1,"season_data":{"1":{"_id":"52578e84760ee36aaa6b024c","air_date":"2000-02-27","episodes":[{"air_date":"2000-02-27","episode_number":1,"episode_type":"standard","id":391904,"name":"Episode 1","overview":"","production_code":"","runtime":null,"season_number":1,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-06","episode_number":2,"episode_type":"standard","id":391905,"name":"Episode 2","overview":"","production_code":"","runtime":null,"season_number":1,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-13","episode_number":3,"episode_type":"standard","id":391906,"name":"Episode 3","overview":"In one of the most memorable challenges ever on the series, three contestants go into a maze, given directions by a contestant via walkie-talkie and have to try not to get caught. Beverly directs Alan straight into the attackers and Abby goes well but Ben still manages to get caught. Rocky claims his machine wasn't working and he couldn't hear Jan's instructions, yet he somehow managed to make it to the end in a long time. Everyone suspects someone different. In one of the most controversial eliminations ever, Rocky goes. But later he claims Jan told him she was the Mole and told him that as long as he gave her a percentage of the winnings, he could vote for her etc. But it seems he was wrong. Jan of course denies to this day that she did that thing.","production_code":"","runtime":null,"season_number":1,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-20","episode_number":4,"episode_type":"standard","id":391907,"name":"Episode 4","overview":"With only two men and five women left, the challenges get harder. Linda and Jan build a raft that the other five have to travel on without it going faulty but it doesn't work. And the boat the other five are on mysteriously runs out of fuel. Challenges are failing everywhere, but whose work is it? Beverly and Josephine have done well by not wasting money on a challenge where they could have gained an exemption but unfortunately Josephine leaves. She told Alan she was voting for him but he changed her mind and promised he wasn't the Mole.","production_code":"","runtime":null,"season_number":1,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-03-27","episode_number":5,"episode_type":"standard","id":391908,"name":"Episode 5","overview":"The halfway point has arrived and the series has sorely tested the contestants. Each of them has to try and get to the red flag without being shot by snipers or their teammates. If only one person makes it, they get an exemption. Alan almost shoots Abby for it but he gets the exemption. As the group tries to solve riddles, Abby, Ben & Linda don't do too well. While photographing native species, several problems arise such as Abby taking a picture with the lens cap on.","production_code":"","runtime":null,"season_number":1,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-03","episode_number":6,"episode_type":"standard","id":391909,"name":"Episode 6","overview":"The women fail at a task involving abseiling and Linda has to interrogate the group to find out what they did. If she is successful she gets a free pass. She breaks Abby down and gets the info and the exemption. Abby is acting extremely suspiciously, but who believes she is the Mole? Beverly is eliminated, leaving the four remaining contestants alone with Grant...","production_code":"","runtime":null,"season_number":1,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-10","episode_number":7,"episode_type":"standard","id":391910,"name":"Episode 7","overview":"Linda saves the day when Alan and Jan fail at a sports challenge, Abby almost loses a photography challenge. In a game of roulette, Jan has to die her hair red, Abby has to have acupuncture and Linda is painted nude - something she regrets. Alan gets three tasks which are easy. It seems Jan suspects Alan, Abby suspects Jan, Linda suspects Abby and Alan suspects Jan. And Linda is the one eliminated.","production_code":"","runtime":null,"season_number":1,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-17","episode_number":8,"episode_type":"standard","id":391911,"name":"Episode 8","overview":"Alan and Abby save one challenge when Jan fails it but all three contribute to another challenge. When it looks set that they have won the other, they discover Alan broke a road rule and the challenge is lost. Abby is fixed on Jan as the Mole, while the others blame each other. And finally at Port Arthur Jail the questions are answered. Jan wins $115,000. Abby steps out to look at the Mole - Alan.","production_code":"","runtime":null,"season_number":1,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-04-24","episode_number":9,"episode_type":"finale","id":391912,"name":"The Mole: How You Could Have Known","overview":"Alan was the Mole. How could you have known? This special episode looks in detail at each episode and shows you the clues.","production_code":"","runtime":null,"season_number":1,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":18000,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"52578e84760ee36aaa6b0257","air_date":"2001-02-21","episodes":[{"air_date":"2001-02-21","episode_number":1,"episode_type":"standard","id":391913,"name":"Episode 1","overview":"","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-02-28","episode_number":2,"episode_type":"standard","id":391914,"name":"Episode 2","overview":"","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-07","episode_number":3,"episode_type":"standard","id":391915,"name":"Episode 3","overview":"Angela and Shane make several obvious mistakes that says either \"stupid\" or \"mole\" this episode where Emily is also a chief suspect. Very quiet Brooke misses out on a free pass. Others such as Shane and Michael are very quiet as of yet. John suspects the Mole may be Fiona but he isn't sure and he is eliminated. The eight remaining contestants are getting closer to the cash.","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-14","episode_number":4,"episode_type":"standard","id":391916,"name":"Episode 4","overview":"In a case of 'lost and found' Michael does his best to make the team win but they still fail. Fiona's detective skills are far from perfect but the group still win 2 out of 3. Hal seems to be acting very suspiciously while Brooke is finally beginning to come out of her shell. But it is Angela who is eliminated. She suspected Michael but changed her mind and moved to a female. Was she wrong about changing her mind or did she never know who the Mole was? Suspicions of Angela are obviously not true and some of the group realise they have to rethink their strategies.","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-21","episode_number":5,"episode_type":"standard","id":391917,"name":"Episode 5","overview":"Mal wins a free pass, the group only win one challenge and another lost challenge sees Hal and Shane spend a cold night together in the bush. Emily & Mal give up looking in a challenge which some see as suspicious while Brooke and Michael, paired together, are almost on top of the lost pair and yet don't find them. What's going wrong? Shane suspects Fiona and she suspects him, Emily and Brooke are torn between every one and Michael, Mal and Hal suspect each other. But it is Fiona who is eliminated. As Grant leads her to the door, the other 6 are sad to see her go - they have got to know her well. But they are also relieved at a one in six shot at the money.","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-28","episode_number":6,"episode_type":"standard","id":391918,"name":"Episode 6","overview":"Four men and two women relax after surviving the elimination. Mal, Shane and Michael couldn't be more relaxed - Hal and Emily are worried about their suspicions and the once quiet Brooke is becoming a popular member of the team. In a game of protecting a valuable item from terrorists, Brooke, Emily and Mal all falter and lose the team money. Hal and Michael gain free passes to the next episode but the other four all seem genuinely anxious about going through. Shane who suspects Brooke is eliminated. Is she the Mole? While hints say no she has acted suspiciously but quietly.","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-04-04","episode_number":7,"episode_type":"standard","id":391919,"name":"Episode 7","overview":"Emily suspects Brooke of being the Mole but Brooke seems torn between Michael and Mal. Mal thinks it is Michael but Hal thinks Brooke and Michael thinks Emily or Hal. In a challenge, Michael and Brooke survive but Brooke loses the team money and gets Michael out of the running by getting a free pass for herself. An act of sabotage? Or worries about whether or not she can pass elimination? The entire group fails at the next test and Emily, Hal and Mal ruin another challenge for the group. Emily ends up being eliminated leaving one woman and four men to go to the penultimate episode of Season 2.","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-04-11","episode_number":8,"episode_type":"standard","id":391920,"name":"Episode 8","overview":"All three men act extremely suspiciously in this episode where it seems Brooke could not be the mole. In one of the most famous assignments, a Hitchcock-based Hotel provides the perfect atmosphere for staking out the Mole. Everyone is torn in their suspicions although Michael suspects Brooke and she him. Hal suspects Brooke and Mal suspects Michael but hasn't enough evidence. He is eliminated leaving three people left.","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-04-18","episode_number":9,"episode_type":"standard","id":391921,"name":"Episode 9","overview":"In an energetic round, no-one proves any kind of skill or helpfulness. In the end Hal is revealed as the Loser. Brooke wins $100,000 -which is less than last season's mole. The Mole is revealed - Michael.","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-04-25","episode_number":10,"episode_type":"finale","id":391922,"name":"The Mole: How You Could Have Known II","overview":"","production_code":"","runtime":null,"season_number":2,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":18001,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"52578e84760ee36aaa6b0262","air_date":"2002-02-20","episodes":[{"air_date":"2002-02-20","episode_number":1,"episode_type":"standard","id":391923,"name":"Episode 1","overview":"","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-02-27","episode_number":2,"episode_type":"standard","id":391924,"name":"Episode 2","overview":"","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-11","episode_number":3,"episode_type":"standard","id":391925,"name":"Episode 3","overview":"","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-06","episode_number":4,"episode_type":"standard","id":391926,"name":"The Weakest Link Challenge","overview":"","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-13","episode_number":5,"episode_type":"standard","id":391927,"name":"Episode 4","overview":"Who will win? Who will be the Mole? Everyone thinks they know who it is and relationships are being tested but ultimately Thao leaves. Ann-Marie didn't like her on the outside but she may have liked her more inside.","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-20","episode_number":6,"episode_type":"standard","id":391928,"name":"Episode 5","overview":"Bodybuilder Joe is eliminated this episode after a great performance. Some people suspected he was the Mole. Clearly they were wrong. Suspicions go to Marc and Alaina now as their strategies in a murder mystery fail them. But are Crystal-Rose and David being ignored? Or is it Bob who is the Mole? As the series draws closer to the finale, we'll see...","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-03-27","episode_number":7,"episode_type":"standard","id":391929,"name":"Episode 6","overview":"In this round, Crystal-Rose scores herself a free pass while Alaina and Marc ruin one of the group's challenges. But it is Pete, everyone's favourite, who is eliminated. So who is the Mole? At the halfway mark it seems anyone could be the traitor. But there are clues. Keep looking, Australia! And then Crystal-Rose was offered $20,000 to the group's kitty if she passed up the elimination.","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-03","episode_number":8,"episode_type":"standard","id":391930,"name":"Episode 7","overview":"There are 6 left - Is it Alaina, Crystal-Rose or Bob? or someone else? David almost loses the first challenge for the team, having to repeat his part after breaking a road rule. He only makes it home in 2 seconds to spare. Alaina also doesn't help. Through luck alone, Alaina, Crystal-Rose & Marc photograph four native species which contribute to the group's kitty. Bob and the others only manage to get 2 and one of them is doubtful. However, Crystal-Rose, Bob, Marc & Alaina all don't make it through a series of laser beams in the final challenge. Did they do it deliberately? David risks it all to bring home more points and Ann-Maree runs out of time. It seems anyone could have sabotaged these challenges. That night at the elimination, Bob and Alaina say they would like the other to leave. Both of them suspect Marc. He suspects Bob as does David. Crystal suspects David.","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-10","episode_number":9,"episode_type":"standard","id":391931,"name":"Episode 8","overview":"The first challenge - dropping water bombs onto a target from a paraglider, doesn't go well as only Alaina gets a hit. Bob, who was betting on the success, does better. Alaina, Bob & Ann-Maree have to take pictures to represent different letters of the alphabet (e.g. B=bridge, a Y shaped track in the road). The letters spell out BETRAY but Crystal-Rose and Marc, who have to guess what it is, don't get it right. The three others also have to tell what Crystal and Marc have painted on a sports oval. While Ann-Maree thinks it is a platypus, Alaina convinces her and Bob it is a mole and they lose money. It was, in fact, a platypus. As the contestants voice their suspicions, they fill out the questionnaire. Both Alaina and Marc are certain it is Crystal-Rose and Bob agrees with them but also thinks Alaina is a good suspect. Ann-Maree suspects Bob (whom Marc has ruled out) and Crystal is torn between Alaina and Marc although she suspects Marc more.","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-17","episode_number":10,"episode_type":"standard","id":391932,"name":"Episode 9","overview":"","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-04-24","episode_number":11,"episode_type":"standard","id":391933,"name":"Episode 10","overview":"","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-01","episode_number":12,"episode_type":"finale","id":391934,"name":"The Mole: How You Could Have Known III","overview":"","production_code":"","runtime":null,"season_number":3,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":18002,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"52578e84760ee36aaa6b026d","air_date":"2005-08-25","episodes":[{"air_date":"2005-08-25","episode_number":1,"episode_type":"standard","id":391935,"name":"The Mole Returns","overview":"With 12 new contestants, 11 are genuine and one is The Mole. The game has changed with The Mole winning money if they are succesful in sabotaging a task. The live elimination quickly eliminates Josh.","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-01","episode_number":2,"episode_type":"standard","id":391936,"name":"The Mole 2","overview":"With 10 genuine contestants remaining, The Mole still looms large but is almost revealed by their own mistake.","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-08","episode_number":3,"episode_type":"standard","id":391937,"name":"The Mole 3","overview":"With nine genuine contestants remaining, The Mole still looms large.","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-16","episode_number":4,"episode_type":"standard","id":391938,"name":"The Mole 4","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-23","episode_number":5,"episode_type":"standard","id":391939,"name":"The Mole 5","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-09-30","episode_number":6,"episode_type":"standard","id":391940,"name":"The Mole 6","overview":"","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-07","episode_number":7,"episode_type":"standard","id":391941,"name":"The Mole 7","overview":"With 5 genuine contestants remaining, The Mole still looms large.","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-14","episode_number":8,"episode_type":"standard","id":391942,"name":"The Mole 8","overview":"With 4 genuine contestants remaining, The Mole is getting closer to being revealed and it is hard to stay in the game for the others.","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-21","episode_number":9,"episode_type":"standard","id":391943,"name":"The Mole 9","overview":"With 3 genuine contestants remaining, The Mole still looms large.","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2005-10-28","episode_number":10,"episode_type":"finale","id":391944,"name":"The Mole Revealed","overview":"In the final episode for the year there is 2 genuine contestants remain to battle it out while The Mole is finally revealed.","production_code":"","runtime":null,"season_number":4,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":18003,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"52578e85760ee36aaa6b0283","air_date":"2005-08-25","episodes":[],"name":"Season 5","overview":"","id":18005,"poster_path":null,"season_number":5,"vote_average":0},"6":{"_id":"52578e85760ee36aaa6b0278","air_date":"2013-07-02","episodes":[{"air_date":"2013-07-02","episode_number":1,"episode_type":"standard","id":966992,"name":"Episode 1","overview":"Twelve contestants are plunged into a world of sabotage, suspicion and intrigue as they undertake confronting physical and mental challenges while competing for a potential prize of $250,000. In their first challenge, twelve players who have never met each other before are blindfolded and driven to three separate locations deep in the Stockton Sand Dunes on the NSW mid-North Coast. Little do they realise that every decision affects the overall pot of money. The next day, the contestants literally scale new heights when they must relay across a high wire twenty-stories above ground in a gully in the Blue Mountains.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-03","episode_number":2,"episode_type":"standard","id":966993,"name":"Episode 2","overview":"Tonight we pick up with we're we left off last week - 20 stories high above a gully in the Blue Mountains. Will the Mole fail on purpose? Then, the contestants meet Shura near Mt Victoria in the Blue Mountains and split into two teams for Money Bags. Starting at opposite ends of a track, the teams must carry heavy money bags to meet at a nominated spots. Given 90 minutes, the contestants win nothing if they don't meet up. Later they meet in a maze of military forts at Middle Head in Sydney Harbour for Key To Comfort. They will be sleeping under the stars, but there will be a hunt to find 12 keys hidden amongst the fort.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-04","episode_number":3,"episode_type":"standard","id":966994,"name":"Episode 3","overview":"After a night under the stars, friendships will no doubt be tested and nerves will be frayed - especially when they discover what is in store. After their 'glamping', the 12 contestants face their biggest fear yet. One-by-one, they answer 20 questions about who they think is the Mole. The person with the least amount of correct answers will be eliminated.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-09","episode_number":4,"episode_type":"standard","id":966995,"name":"Episode 4","overview":"The contestants will feel the need for speed as a new week starts. One team will line obscure parts of Sydney Harbour and communicate clues to another team in a speed boat to spot an answer. The remaining contestants must then decipher the code, which has been written at high speed. And a surprise elimination will see our eleven contestant become ten.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-10","episode_number":5,"episode_type":"standard","id":968083,"name":"Episode 5","overview":"Contestants storm Melbourne's Brighton Beach, with its iconic colourful Bathing Boxes for a treasure hunt. Then in an intense game of trust, with allegiances being exposed and destroyed, who is playing for themselves and who is playing for the group?","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-17","episode_number":6,"episode_type":"standard","id":966997,"name":"Episode 6","overview":"Just when the contestants least expect it, a past challenge comes back to haunt them. The fate of the contestants rests with one of their own and that one contestant holds all the power before someone is eliminated.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-17","episode_number":7,"episode_type":"standard","id":966998,"name":"Episode 7","overview":"Just when the contestants least expect it, a past challenge comes back to haunt them. The fate of the contestants rests with one of their own and that one contestant holds all the power before someone is eliminated.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-24","episode_number":8,"episode_type":"standard","id":966999,"name":"Episode 8","overview":"This challenge will leave our contestants feeling sky-high, and maybe a little dizzy, as they're introduced to the ride of their life in Aeroplane at an airfield near Geelong. The contestants meet at the iconic Luna Park in St Kilda where a game of 'Spot The Difference' highlights how important attention to detail is in The Mole. To round off the two weeks in Melbourne the contestants meet Shura at Flemington Racecourse for a Quiz and Termination. With the Melbourne Cup shimmering in front of them, each contestant will be hoping they avoid a red screen as nine contestants become eight.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-07-24","episode_number":9,"episode_type":"standard","id":391945,"name":"Episode 9","overview":"This challenge will leave our contestants feeling sky-high, and maybe a little dizzy, as they're introduced to the ride of their life in Aeroplane at an airfield near Geelong. The contestants meet at the iconic Luna Park in St Kilda where a game of 'Spot The Difference' highlights how important attention to detail is in The Mole. To round off the two weeks in Melbourne the contestants meet Shura at Flemington Racecourse for a Quiz and Termination. With the Melbourne Cup shimmering in front of them, each contestant will be hoping they avoid a red screen as nine contestants become eight.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-07","episode_number":10,"episode_type":"standard","id":967000,"name":"Episode 10","overview":"The eight remaining contestants meet at Sydney's iconic Cronulla beach, with Shura waiting for them, not on the famous stretch of sand, but on an outdoor ice rink for the game Mole on Ice.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-07","episode_number":11,"episode_type":"standard","id":391947,"name":"Episode 11","overview":"The eight remaining contestants meet at Sydney's iconic Cronulla beach, with Shura waiting for them, not on the famous stretch of sand, but on an outdoor ice rink for the game Mole on Ice.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-14","episode_number":12,"episode_type":"standard","id":391946,"name":"Episode 12","overview":"The contestants meet at Sydney's National Art School for a mind-boggling game of Domino Effect. Then just like the dominoes, one contestant will fall in a termination as eight contestants become seven. Then, the contestants meet Shura on the famous stretch of sand on the Gold Coast in Queensland. They will battle it out in 'Mole Lifesaver', inspired by the Gold Coast's iconic surf lifesavers.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-21","episode_number":13,"episode_type":"standard","id":391948,"name":"Episode 13","overview":"The contestants meet at Sydney's National Art School for a mind-boggling game of Domino Effect. Then just like the dominoes, one contestant will fall in a termination as eight contestants become seven. Then, the contestants meet Shura on the famous stretch of sand on the Gold Coast in Queensland. They will battle it out in 'Mole Lifesaver', inspired by the Gold Coast's iconic surf lifesavers.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-08-28","episode_number":14,"episode_type":"standard","id":967001,"name":"Episode 14","overview":"The Gold Coast is full of life's high rollers and the group meets at the Peppers Broadbeach Skyhome for the highstakes gambling game of Let It Ride. Shura will deal a card from the pack, and the contestant can choose to hold it and walk away, or keep on getting Shura to deal cards - but they risk losing it all if a red Mole thumb print card is dealt.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-04","episode_number":15,"episode_type":"standard","id":967002,"name":"Episode 15","overview":"The contestants meet to play the most devastatingly psychological game yet - Silent Auction. Then, they all head to iconic theme park Sea World, where Shura reveals they'll be diving alongside sharks.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-11","episode_number":16,"episode_type":"standard","id":967003,"name":"Episode 16","overview":"The sharks are circling in the Quiz and the Termination, with the exemptions in full play, leaving a small number of contestants to battle it out before seven become six.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-18","episode_number":17,"episode_type":"standard","id":968084,"name":"Episode 17","overview":"Tonight, contestants meet in the Bombo quarry near Kiama for their next challenge - 'Writing With Jeeps'.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-09-25","episode_number":18,"episode_type":"standard","id":967005,"name":"Episode 18","overview":"The contestants meet Shura in the scenic seaside hamlet of Kiama for the game of 'Catapult'. Then a quiz and termination will see six contestants become five.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-02","episode_number":19,"episode_type":"standard","id":967006,"name":"Episode 19","overview":"The five remaining contestants meet Shura at a scenic bush location to play a game called Cash Waterfall.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-09","episode_number":20,"episode_type":"standard","id":967007,"name":"Episode 20","overview":"The final four contestants meet at an oval in Camden, west of Sydney, for the game Hourglass Maze. From the sweaty to the suave and sexy, the four contestants then get dressed to the nines as they walk the red-carpeted stairs of Sydney's Town Hall. The pressure is on, and the penultimate Quiz and Termination will reveal the final three contestants that will go through to the finale.","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-10-16","episode_number":21,"episode_type":"finale","id":967008,"name":"Episode 21","overview":"Contestants get a chance to interrogate each other in a lie detector test. Then, in the final quiz the question viewers have been dying to know: Who Is the Mole?","production_code":"","runtime":null,"season_number":6,"show_id":7858,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"","id":18004,"poster_path":null,"season_number":6,"vote_average":0}}}