{
    "adult": false,
    "backdrop_path": null,
    "created_by": [],
    "episode_run_time": [
        30
    ],
    "first_air_date": "2017-01-05",
    "genres": [
        {
            "id": 10767,
            "name": "Talk"
        }
    ],
    "homepage": "https://www.gaia.com/series/missing-links",
    "id": 78760,
    "in_production": true,
    "languages": [],
    "last_air_date": "2019-05-02",
    "last_episode_to_air": {
        "id": 2689088,
        "name": "Creating Heaven on Earth with Bruce Lipton",
        "overview": "Bruce Lipton and Gregg Braden conclude their discussion on the massive changes our planet and society are undergoing. Science in the 21st century is revealing the power of cooperation and self-empowerment that proves our consciousness creates everything that we experience in life. This means we all have the power to create heaven on Earth. When we acknowledge this, the barriers of separation and programming keeping us locked into the old, unsustainable systems start to break down enabling us to start manifesting from wishes and desires, rather than fear and greed.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2019-05-02",
        "episode_number": 16,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 30,
        "season_number": 3,
        "show_id": 78760,
        "still_path": null
    },
    "name": "Missing Links",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 1101,
            "logo_path": "/kym0UnNZNRxGHdZsFBUQNCCRrcb.png",
            "name": "Gaia",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 42,
    "number_of_seasons": 3,
    "origin_country": [],
    "original_language": "en",
    "original_name": "Missing Links",
    "overview": "Explore the deep truths of our origin, history, destiny and fate, with celebrated author and luminary Gregg Braden.",
    "popularity": 4.252,
    "poster_path": "/Akx8bxgji5jluS4O7E26ghRq6V5.jpg",
    "production_companies": [
        {
            "id": 103212,
            "logo_path": null,
            "name": "Gaia",
            "origin_country": ""
        }
    ],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2017-01-05",
            "episode_count": 20,
            "id": 102422,
            "name": "Season 1",
            "overview": "Connect science and spirituality to reveal a new understanding of humanity’s history, the origins of civilization and the power of our heart’s intelligence.",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 10
        },
        {
            "air_date": "2018-02-08",
            "episode_count": 6,
            "id": 102424,
            "name": "Season 2",
            "overview": "Are we living in a virtual reality? Discover the societal and spiritual implications that arise when we recognize our world as an artificially constructed computer simulation.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2019-01-31",
            "episode_count": 16,
            "id": 178972,
            "name": "Season 3",
            "overview": "Discover the Divine Matrix, how it influences you, and how you can influence it. This could dramatically improve your life, your wellbeing, and the lives of all of those around you.",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    ],
    "spoken_languages": [],
    "status": "Returning Series",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 7.5,
    "vote_count": 2,
    "season_data": {
        "1": {
            "_id": "5ad105c90e0a2631c600196c",
            "air_date": "2017-01-05",
            "episodes": [
                {
                    "air_date": "2017-01-05",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1470388,
                    "name": "Cycles of Time",
                    "overview": "Humanity is set to face a rare convergence of three massive cycles of change. In this inaugural episode, Gregg Braden guides us through the evidence which charts the simultaneous peaking of economic, human conflict and solar cycles. The rise and fall in each of these cycles holds major implications for our civilization. As all three cycles are beginning to peak, a new story about humanity emerges. For us to understand how this story will unfold, we must first take an honest look at who we really are and where we came from.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 10,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-12",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2688808,
                    "name": "Shattering Historical Paradigms",
                    "overview": "Scientists, historians and archeologists are actively engaged in answering the big questions about human origins, our relationship to each other and the world around us. But advances in technology and scientific techniques are uncovering paradigm shattering discoveries which are forcing a crisis in their way of thinking. The models and historical narratives which were once accepted as truth are no longer holding up to the evidence being uncovered. Gregg Braden explores the six perennial questions pertaining to human origins and zeros in on the discoveries which are beginning to overturn what was once held true.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-19",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2688815,
                    "name": "Deep Truths on Our Origin",
                    "overview": "Civilization is far older than we have been led to believe and the wisdom from these ancient cultures may be the guidance we need through these times of extremes. We have been taught that we are all separate from each other and separate from the worlds around us. Now new scientific discoveries are confirming that we are all connected. But it is the discovery of very ancient civilizations which may deliver the shattering blow to accepted narratives on the origin of human civilization.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-01-26",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2688819,
                    "name": "The Anomalous History of Humanity",
                    "overview": "Throughout the fossil and archeological records, evidence of ancient civilizations push the narrative of human origins into a time period that many historians are not comfortable with. And there is no peace to be found within such imposed paradigms, as the discovery of out-of-place artifacts show that we have only gleaned a small portion of human history. These discoveries are not limited to the Earth, as photographs from the moon reveal many more out-of-place artifacts, suggesting an entirely different narrative for civilization than many are prepared to deal with. These findings push notions once relegated to Science Fiction into science fact.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2688824,
                    "name": "Confirming Our Connections",
                    "overview": "For three hundred years, scientists have worked to come to an objective understanding of the natural world and our connection to it. Along the way, some false assumptions were made and these notions became a part of the enforced doctrine. As technology and techniques continue to improve, new results to old experiments are challenging these assumptions. We explore the results of cutting edge experiments which confirm that all things are contained within a field which can be influenced by our emotions and innermost beliefs.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-09",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2688835,
                    "name": "Physics of Our Deepest Connections",
                    "overview": "If we can accept that everything is contained with the Field, then we no longer question if we are all connected. The question now becomes: How deeply are we connected? Two experiments, conducted by prominent scientists, reveal that the arrangement of photons and DNA can be directly influenced by human emotions. These findings seem to defy the conventional laws of physics but give us a means for understanding the mechanisms behind prayer, remote healing and miracles. When we learn to embrace these truths, we can begin to unlock the fullest potential we have available to us.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-16",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2688847,
                    "name": "Quantum Links",
                    "overview": "In the field of quantum mechanics, everything remains as a potential, until observed. It is this act of observation which brings the potential into the realm of the actual. The same holds true at the level of life and community, as the quantum link applies to prayers, remote healings and miracles. The secret is to not affirm the state of things, now, by asking for what you want. Rather is it about entering into sacred places, times and states of mind to fully experience the things you want to be, as if they are already in existence.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-23",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2688857,
                    "name": "Missing Links of Human Evolution",
                    "overview": "Gregg Braden explores the DNA evidence which reveals a new story for human evolution. Though he is lauded for his genius in developing the theory of evolution, Charles Darwin knew that one day his theory would fall. That day may have finally come. Many scientists once believed that they have solved the mystery of where we came from, through Darwin’s theory of evolution. With new evidence refuting this theory, they are beginning to see that there is a deeper explanation for the missing links of human evolution.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-02",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2688862,
                    "name": "Genetic Clues of Human Origin",
                    "overview": "Questioning how and why humankind suddenly appears 200,000 years ago, we open the door to an even deeper mystery. Gregg Braden compares the chromosomes of great apes with human beings and presents us with startling evidence that something happened, long ago, to intentionally produce anatomically modern humans. This is not evolution nor creationism. Rather it is suggestive of a third option: directed mutation. In seeking answers to who directed this genetic manipulation, we can look to the Safir Ytzera, an ancient text which gives us a step-by-step description of the day humankind was created and unlocks a secret message hidden within our own genetic code.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-09",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2688865,
                    "name": "Heart-Brain Harmony",
                    "overview": "Alfred Wallace, a contemporary of Charles Darwin, stated that nature never over-endows a species beyond its needs for existence. But as we will soon see, humanity is indeed genetically over-endowed. The mysterious fusion of human DNA, 200,000 years ago, did more than just produce the first anatomically modern human. It created a being with amazing abilities that are still awaiting to be awakened. Gregg Braden expounds upon the science underlying the untapped human potential, which becomes active when we learn how to help the heart and brain work in harmony.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-16",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2688866,
                    "name": "Awakening the Heart-Brain Union",
                    "overview": "Now that we understand that humankind has been endowed with extraordinary abilities, we can begin to explore how to awaken these hidden potentials within our lives. Gregg Braden shares two ways that you can begin to awaken the heart and brain connection. One technique enables you to connect with your heart to gain crystal clear answers on important questions. Another is a practice which shifts the conversation between the heart and brain to be in a coherent frequency. When they are in harmony with this frequency, you open a doorway to even more mystical abilities, including self-healing.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-23",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 2688867,
                    "name": "Triggering Self-Healing",
                    "overview": "Now we can learn how to apply what we have learned about the heart-brain connection to life itself and uncover the secret to self-healing and extended lifespan. We have been taught that life is a limited quantity, which can set into motion the expectation of imminent illness and death. But you can change your thinking, to see life as always replenishing and rejuvenating itself, and begin living a vital and productive life. Gregg Braden explains how you can achieve heart-brain harmony to unlock the mechanisms which bring you healthy and vibrant longevity.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-30",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 2688868,
                    "name": "Ensuring Humanity's Continuation",
                    "overview": "Throughout history, humankind has endured many cycles of extremes and calamities. Ancient stone records not only tell of these trials, but they advance advice, to future generations, for surviving such trying times. We don’t have to take what the ancients are trying to tell us on faith. Science gives us the proof we need about the necessity of developing mutually beneficial relationships. As Gregg Braden examines Prophecy Rock from the Hopi people, we discover that their advice for mutual aid is confirmed by the science which shows us that cooperation is essential for ensuring humanity’s continuation.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-06",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 2688869,
                    "name": "Globalizing Heart-Brain Harmony",
                    "overview": "In this season finale of Missing Links, we find that we truly have a reason to be optimistic that we will see a peaceful planet within our lifetime. Throughout the series, Gregg Braden has shown us that we are experiencing a rare convergence of cycles of change. Our ancestors understood this and have passed on to us their keys for surviving such times. We have also learned that we are the product of a directed mutation which has endowed us with amazing abilities. When we put it all together, we find that we can make changes within the magnetic fields of our hearts and brains, which in turn, affect the Earth’s magnetic field. In essence, you can learn how to globalize your own heart-brain harmony.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-13",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 2688870,
                    "name": "The New Economy",
                    "overview": "As a continuation of season one, Gregg Braden addresses the changing state of our economy and offers advice on how to thrive, create and innovate in a world that is to come. We are currently experiencing a time of fragility and volatility due to factors ranging from climate change to conflicts. What’s more, is that our model of a centralized economy is no longer working. In order to effectively change this, we must be honest about what we want this world to look like and what it will take to get there.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-20",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 2688871,
                    "name": "Conscious Parenting and Education",
                    "overview": "In order to thrive in our changing world, we need to make a fundamental shift in thinking, which will come through conscious education and parenting. Gregg Braden explains that education is the key to solving every problem mentioned throughout the first season. With advances in technology, we have now the opportunity to share, with the world, all of the truths we have discovered. Along with these advances, conscious parenting can help our children embrace the deepest truths of our world and integrate them in a meaningful and honest way into their lives.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-04-27",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 2688872,
                    "name": "Thriving in the New Normal",
                    "overview": "Gregg Braden lays out four things that we can do to adapt our lifestyles to these changing times and thrive in the world that is to come. With the ever quickening pace of life in the modern world, it can be difficult to not succumb to the temptation of ease and convenience provided by a lifestyle that would eventually prove disastrous for a healthy state of wellbeing. However, there are simple changes we can enact which will enable us to embrace these volatile times and thrive in a new world of our own conscious creating.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-04",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 2688874,
                    "name": "Q&A: Climate Change and DNA",
                    "overview": "Gregg Braden returns to Missing Links to answer many of the questions posed by viewers. In this first Q&A episode he addresses your concerns about climate change and DNA which have defined, and are redefining what it means to be human. From climate engineering to an energetic jump in the sun, there is no denying that our planet is experiencing dramatic changes. All the while, our physical being is adapting to these changes. To best prepare, we must learn to harmonize the heart and brain so that we can thrive in this new world.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-11",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 2688875,
                    "name": "Q&A: Manifesting with Heart-Brain Connection",
                    "overview": "More questions mean more answers from Gregg Braden. This time we explore the intricacies of the heart-brain connection. He helps to clarify how the intelligence of the heart can become a gateway to higher consciousness and explains the science behind it. We also gain clarity in manifestation and self-healing. It has less to do with asking for what you want, and more with experiencing the gratitude of already manifesting your intention. All of this shows us how science and spirituality are becoming deeply connected.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-05-18",
                    "episode_number": 20,
                    "episode_type": "finale",
                    "id": 2688876,
                    "name": "Q&A: Rediscovering Human History",
                    "overview": "Gregg Braden answers your questions concerning the history of humanity, where we come from and where we may be going. Despite the common consensus in scientific communities, evidence shows us that human civilization is far older than previously believed. When we start to build a new narrative from the evidence, rather than force the evidence to fit into the accepted narrative, we see a broader picture of human potential. Who we believe that we are is a story that we have been told, and it is not true – we must rediscover who we really are.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 1,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "Connect science and spirituality to reveal a new understanding of humanity’s history, the origins of civilization and the power of our heart’s intelligence.",
            "id": 102422,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 10
        },
        "2": {
            "_id": "5ad10ed8925141392900261c",
            "air_date": "2018-02-08",
            "episodes": [
                {
                    "air_date": "2018-02-08",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1470406,
                    "name": "Evidence of Our Simulated Reality",
                    "overview": "Is it possible that every moment of our reality is occurring inside a computer? A growing body of scientific evidence suggests we may be living within a massive simulation the size of the universe. Examine concepts of enlightenment and the matrix through the lens of current cultural beliefs and ancient traditions.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-15",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2688877,
                    "name": "Reality as a Reflection of the Inner World",
                    "overview": "If we are living in a simulated reality, who put us here and for what reason? Gregg Braden breaks down the three scenarios that present a possible relationship between our inner world and the external energy field that contains all life.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-02-22",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2688879,
                    "name": "Unlocking the Simulation Code",
                    "overview": "Gregg Braden explores two schools of thought concerning our cosmic simulation. Examine Earth's potential role as an incubator and the esoteric mysteries that may unlock our human potential, shifting us into a reality where thought and emotion are instantly manifested.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-01",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2688881,
                    "name": "Reprogramming the Simulation Code",
                    "overview": "If our universe operates like a giant computer, can we rewrite the programming to alter our experience? Discover how to work with the fractal codes of energy that influence all biology, emotions and relationships by examining indigenous cultures and spiritual traditions.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-08",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2688882,
                    "name": "Newton and Karmic Laws",
                    "overview": "Physics is now proving through quantum entanglement that all life originated from one source, and is therefore forever energetically connected. See how karma, biology and human civilization play a role in this entanglement, as every individual shift in emotion, belief and action is experienced and processed by the collective.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-03-15",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 2688884,
                    "name": "Life on the Other Side of the Simulation",
                    "overview": "In this final episode of Season 2, we explore who or what exists on the other side of our simulated reality. Whether the proverbial heaven or a catastrophic reality, Gregg Braden examines the cycles of humanity to shed light on our creation and purpose, and the tools needed to prepare us for life on the other side.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 2,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "Are we living in a virtual reality? Discover the societal and spiritual implications that arise when we recognize our world as an artificially constructed computer simulation.",
            "id": 102424,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "6014135d3009aa003eb5b6a5",
            "air_date": "2019-01-31",
            "episodes": [
                {
                    "air_date": "2019-01-31",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2688906,
                    "name": "Discovering the Divine Matrix",
                    "overview": "Gregg Braden brings forward the discoveries and controversies surrounding a great universal field of energy which may be the matrix of all matter and influencer of everything that happens. He calls this the Divine Matrix. From remote viewing to quantum entanglement, we see that matter, form and consciousness have always been connected since the moment of the big bang. Our ancient ancestors tried to describe this field and its phenomena, yet modern science is just now beginning to understand that the Divine Matrix exists.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-01-31",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2688921,
                    "name": "Scientific Evidence of a Divine Matrix",
                    "overview": "Once called the Ether, scientists have worked hard to prove that a mysterious field of energy connecting all things does not exist. Ancient texts tell us that everyone is connected through an enigmatic net that bridges time and space with consciousness. Even early scientific experiments concluded that such a matrix exists. Now, results from CERN may finally put this matter to rest. But, if this controversial divine Matrix really exists, what is it, what is it made of and how does it work?",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-01-31",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2688933,
                    "name": "Holographic Nature of the Divine Matrix",
                    "overview": "Imagine that the very building blocks of our universe are dependent upon our observation of creation. Gregg Braden introduces us to the rules of the Divine Matrix, explaining that we live in a participatory universe that is entangled and holographic. By delving into the application of these rules, we can better understand the effects of our interconnectedness, as we connect with the holographic information of our universel, and how it can present as premonitions, intuition and psychic abilities.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-07",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2688943,
                    "name": "Living in a Reflected Reality",
                    "overview": "Gregg Braden reveals that people and events in our lives are reflections of who we are internally. As we dive deeper into the properties of the divine matrix, we delve into the mirror-like nature of our universe. He explains that everything that happens internally is reflected in everything around us. This can be seen in the three mirrors of human relationships and how they play out in our lives. The reflective nature of our reality is not only seen in matters of love, but in the repetition of historical events through cyclical time.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-14",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2688950,
                    "name": "A New Way of Thinking About Time",
                    "overview": "In the quantum realm, where time seems to be meaningless, human emotion begins and creates miraculous effects. Gregg Braden offers new ways of thinking about the mysteries of the universe by removing the constraints of linear time. New science is telling us that time is insignificant and testing of the precognitive ability of the subconscious, through predictive anticipation and premonition, confirms that time is not how we perceive it.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-21",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2688959,
                    "name": "Recalculating the Future",
                    "overview": "Gregg Braden has calculated that we are living in a time where we have the greatest opportunity for the greatest positive change in the whole 5,000 years of recorded history. He explains that our world follows specific cycles, in accordance to nature’s mathematics. Knowing these patterns, we can calculate the rhythmic cycle of time for important historical events and predict potential events in the future. This is our opportunity to intervene in these cycles, in a way that makes lasting positive changes across the world.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-02-28",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2688974,
                    "name": "Using Fractal Time to Heal Your Life",
                    "overview": "Using the principles of fractal time, you can learn how to build a calculator to know when you can expect big events to repeat in your life. Gregg Braden explains that it is important to learn how to recognize these patterns and he walks us through the actual calculations that you can use to predict cycles in your life. It is important to learn how to recognize these patterns, where they begin, where they end and how they play out in your relationships and the unconscious choices you make. You can heal learn to this pattern which will then automatically ripple changes through every area of your life.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-07",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2688988,
                    "name": "Torah Code and The Divine Matrix",
                    "overview": "From the science of the modern world and the wisdom of the ancients comes a time-map that holds details of every major event of the past 3,000 years. Gregg Braden discusses the Torah Code as a manual detailing the quantum possibilities available within the Divine Matrix. He explains that it may not be a tool for predicting what will come, rather it gives us an understating of the cycles of time and the consequences of our choices. If time is a program running under the operating system of the Divine Matrix, then the Torah Code can be thought of as a manual telling us what is happening within the possibilities of that time program.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-14",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2688995,
                    "name": "Language of the Divine Matrix",
                    "overview": "The world around us, from popular media to the people in our lives, influences the way we think and speak, which unlocks our power to create the reality we live in. Gregg Braden explains that we are living in a time unlike any other time in human history as we see people coming together sharing different perspectives of the world. On top of that, the messages conveyed in movies are altering the way we perceive reality. This means we are now able to think in unique and creative ways that humanity has never before encountered. He urges us to harness our power of manifestation by becoming conscious of the language that unlocks the power of the Divine Matrix.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-21",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2689008,
                    "name": "Interacting with the Divine Matrix",
                    "overview": "96% of the universe is missing. The remaining 4% that we experience is created by our thoughts, feelings, and emotions. Gregg Braden delves into the process of how we interact with the quantum possibilities of the Divine Matrix and how they move from the realm of infinite potential and into our reality. He explains that the words we speak and think are fueled by emotion to collapse energy from the quantum field of potentials into the particles of our everyday lives. This is not about control but actively and willingly participating with the Field by becoming conscious of the language that we use.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-03-28",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2689018,
                    "name": "Brain States for Accessing the Divine Matrix",
                    "overview": "New neurological research confirms our conscious and unconscious connection to the field underlying all reality. Gregg Braden discusses the various brain states known to science including the newly discovered states which help us to deeply and consciously connect with the Divine Matrix. These new layers of consciousness were discovered by scientists studying the meditation techniques of Tibetan monks. He shares techniques we can use to access the super-enhanced Gamma brain state by harmonizing the neurons in the heart with the neurons in the brain.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-04",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 2689032,
                    "name": "Manifestation in a Participatory Reality",
                    "overview": "Throughout this season, we have learned the power of our thoughts, feelings and emotions for connecting with the Divine Matrix. What we have been lacking, until now, are the exact techniques for created a participatory relationship with the Field. After discussing various modes of prayer and their effectiveness, Gregg Braden introduces us to a lost form that helps us move beyond the problems we are facing and become a part of the solution. This is something that is practiced by many indigenous cultures and is present within the lost Gospel of Thomas. From this, we gain a new model of creation where consciousness plays an active role in informing us through our own creations.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-11",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 2689058,
                    "name": "A New Human Story Is Emerging",
                    "overview": "A new human story is emerging. For many years, science has perpetuated a belief that life is not significant, that we live on a mundane planet circling an ordinary star. Gregg Braden explains that, indirectly, this notion has bolstered socially-reinforced behaviors of separation, hate and fear. All of this is changing, as science is being updated with new findings that confirm we are all connected through an imperceivable underlying matrix. This gives us a new view of reality where humanity gets a new story. One that begins with a universe that is alive, where life is the rule rather than the rare exception, with a model based on cooperation and abundance rather than scarcity and separation.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-18",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 2689070,
                    "name": "Stepping into a New Paradigm with Bruce Lipton",
                    "overview": "In this very special episode of Missing Links, Gregg Braden and Bruce Lipton come together to share the information they presented when they met with the United Nations. This was an important meeting as they were called upon to discuss the massive changes our planet is facing and assess what we must do about it. As humanity stands upon the edge of a massive paradigm shift, we are being called to tap into the deepest truths of who we are and start applying this knowledge to the world we live in. They share new discoveries that lead the way to a new way of thinking about our bodies, human evolution, and our continued role in the massive changes our planet is facing ecologically, economically and spiritually.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-04-25",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 2689075,
                    "name": "From Chaos to Coherence with Bruce Lipton",
                    "overview": "In this special episode of Missing Links, Bruce Lipton and Gregg Braden come together to bring hope to the upheaval, turmoil, and suffering we are seeing in the world today. What we are experiencing is the structured chaos of unsustainable systems breaking down and giving way for coherence and a new higher order to be built. We must learn to step away from the programming of the old world in order to change our consciousness and become free-creators of the new world. All of this is being validated by the best science of the 21st century supporting notions of cooperation in nature, our energetic connections through the field, and our profound ability to create with consciousness.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-02",
                    "episode_number": 16,
                    "episode_type": "finale",
                    "id": 2689088,
                    "name": "Creating Heaven on Earth with Bruce Lipton",
                    "overview": "Bruce Lipton and Gregg Braden conclude their discussion on the massive changes our planet and society are undergoing. Science in the 21st century is revealing the power of cooperation and self-empowerment that proves our consciousness creates everything that we experience in life. This means we all have the power to create heaven on Earth. When we acknowledge this, the barriers of separation and programming keeping us locked into the old, unsustainable systems start to break down enabling us to start manifesting from wishes and desires, rather than fear and greed.",
                    "production_code": "",
                    "runtime": 30,
                    "season_number": 3,
                    "show_id": 78760,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "Discover the Divine Matrix, how it influences you, and how you can influence it. This could dramatically improve your life, your wellbeing, and the lives of all of those around you.",
            "id": 178972,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        }
    }
}