{"adult":false,"backdrop_path":"/stTddRelld2Pg50i9eS19xXJt3w.jpg","created_by":[],"episode_run_time":[35],"first_air_date":"2018-05-07","genres":[{"id":18,"name":"Drama"},{"id":35,"name":"Comedy"}],"homepage":"http://programs.sbs.co.kr/drama/wokoflove/","id":78797,"in_production":false,"languages":["ko"],"last_air_date":"2018-07-17","last_episode_to_air":{"id":1516641,"name":"The Final Episode","overview":"Everyone returns to work, and Chil Seung assumes his role of CEO of Giant Hotel. Poong moves into Sae Woo’s home to work in Jeong Hae’s kitchen until she approves of him. Everything is looking up as Seol Ja and Geok Jeong also return to Chef Poong’s kitchen.","vote_average":0,"vote_count":0,"air_date":"2018-07-17","episode_number":38,"episode_type":"finale","production_code":"","runtime":29,"season_number":1,"show_id":78797,"still_path":"/bTiAxyyNCWNNg3SfzDPNsIwTd5y.jpg"},"name":"Wok of Love","next_episode_to_air":null,"networks":[{"id":156,"logo_path":"/uHQFPvRTlpgaIFQVN8eKWEnFOll.png","name":"SBS","origin_country":"KR"}],"number_of_episodes":38,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"기름진 멜로","overview":"Chef Seo Poong was once a star chef and worked at the best Chinese restaurant. His popularity faded and he eventually wound up working at a small, failing Chinese restaurant. Meanwhile, Doo Chil-Seong is the owner of a building. He is an ex-gang member and he was in jail for 5 yers.","popularity":18.927,"poster_path":"/dTh81YtdEzacHhnmLw1Tef7cBRl.jpg","production_companies":[{"id":106106,"logo_path":"/fh6WrCiKqtejW1oerdG0FwiXgFA.png","name":"SM Culture & Contents","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2018-05-07","episode_count":38,"id":102489,"name":"Season 1","overview":"Down on his luck and in need of a kitchen, a star chef turns to reforming a shoddy Chinese restaurant staffed by former gangsters.","poster_path":"/xkKFDDiAdBy0A4BO0RHnQQkQdA.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.8,"vote_count":17,"season_data":{"1":{"_id":"5ad33d63c3a3683f03028e9b","air_date":"2018-05-07","episodes":[{"air_date":"2018-05-07","episode_number":1,"episode_type":"standard","id":1471554,"name":"How Many People Get a Divorce?","overview":"Poong, Sae Woo, and Chil Seong all meet at the hair and makeup shop by chance. Chil Seong is getting a haircut, and Poong and Sae Woo are getting ready for their wedding and wedding rehearsal, respectively. Chil Seong sees Sae Woo and is mesmerized by her beauty. Meanwhile, Poong is nervous and upset because his fiancee, Dal Hui, is late.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/7j401kzfInbSW0KEglBu5oIfrW4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-07","episode_number":2,"episode_type":"standard","id":1471555,"name":"Can I Get a Bowl of Jajangmyeon?","overview":"It's the day before Sae Woo's wedding, and she goes to a charity banquet. Even though she's on a diet, she decides to have some Chinese food at the banquet. Much to her dismay, they don't have the one thing she wanted to eat, jajangmyeon. She sees Poong and asks him to make her a bowl. Meanwhile, Chil Seong makes a surprising announcement to his men.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/cF5DVWGIhEZzd6Oc8YnCFOiF0Rx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-08","episode_number":3,"episode_type":"standard","id":1471556,"name":"Come to My Wedding","overview":"Seo Poong gets beat up for disregarding Chil Seong's restaurant, Hungry Frying Pan. Sae Woo is speechless that both Chil Seong and Poong told her not to get married. She gives everyone a wedding invitation and demands that they come to her wedding. Meanwhile, Poong finds out with whom Dal Hui has been having an affair with, and Chil Seong officially closes Hungry Frying Pan.","production_code":"","runtime":28,"season_number":1,"show_id":78797,"still_path":"/ryouRb19LhrUmdNYkskmEOz6H1b.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-08","episode_number":4,"episode_type":"standard","id":1471557,"name":"Let Me Open a Restaurant Here","overview":"It's the day of Sae Woo's wedding, and she goes to pick up her husband-to-be's tuxedo. She gets caught in the crossfire of a fight between Chil Seong and Seung Ryong's men. Poong gets into a fight with Seung Ryong over Dal Hui and quits Finishing Touch. Poong takes his wok and ladle and goes to Hungry Frying Pan to make a deal with Chil Seong. Meanwhile, a shocking turn of events at her wedding leaves Sae Woo stupefied.","production_code":"","runtime":35,"season_number":1,"show_id":78797,"still_path":"/s6eyY24w7X8Og0tIO1yLRRpr4xW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-14","episode_number":5,"episode_type":"standard","id":1490607,"name":"Will You be My Light?","overview":"After taking over Hungry Frying Pan, Poong is depressed, so he goes to a bridge to contemplate his life. While there, he meets a strange woman with a fencing helmet on and a horse by her side. He brings her to Hungry Frying Pan and deems her his first customer. Poong's customer disappears from the restaurant before she eats and appears at Light and Shadow Loans. Meanwhile, Maeng Dal and the crew comes up with a plan to chase Poong out of Hungry Frying Pan.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/xWZIvgK7WyoxF6BYP5wGVAydrhb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-14","episode_number":6,"episode_type":"standard","id":1490608,"name":"Don’t Eat It!","overview":"Sae Woo goes to visit her father in prison. She tries to put on a brave face in front of him. Her father assures her that everything will be alright and that things will return to normal in due time. It's Poong's first day as the owner-chef of Hungry Frying Pan. Their first customer finally comes in, but it's the crazy lady in the neighborhood. Maeng Dal and the crew try to reject her, but Poong refuses to turn her away. Meanwhile, an unexpected customer walks into Hungry Frying Pan.","production_code":"","runtime":33,"season_number":1,"show_id":78797,"still_path":"/uHukRAdHekL8ojk9YVwaxfttbf4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-15","episode_number":7,"episode_type":"standard","id":1490609,"name":"The Chop Off","overview":"Despite the promise he made with Chil Seong, Poong fires the gangsters and decides to hire a different staff for the restaurant. Chae Seol Ja comes to Hungry Frying Pan for a job, but things come to a halt as Chil Seong brings up the contract and tells him he has no authority to hire people. As a result, Hungry Frying Pan holds a battle between Maeng Dal and Seol Ja for the Cutting Part.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/jmbCYY5m7s2n2Q2l4wY5MizErNL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-15","episode_number":8,"episode_type":"standard","id":1490610,"name":"The Fortune Cookie","overview":"Chil Seong calls Sae Woo to come to Hungry Frying Pan. He offers her an unexpected deal and surprises everyone. Poong gets angry and tells Chil Seong and Sae Woo that there is no way he will accept the deal. After finding a fortune cookie at the restaurant, Poong realizes that the woman in the fencing helmet was Sae Woo and runs after her. Meanwhile, Maeng Dal and Seol Ja go to a hotel together.","production_code":"","runtime":33,"season_number":1,"show_id":78797,"still_path":"/gV8zbqhHXxIyjzGdTfNlMXzbJsW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-21","episode_number":9,"episode_type":"standard","id":1490611,"name":"Come to Hungry Frying Pan","overview":"Poong asks Sae Woo to come to the official opening of Hungry Frying Pan. He asks her to be his first customer, and she agrees. She calls Chil Seong and tells him to meet her in front of Hungry Frying Pan. Chil Seong is giddy and prepares to see her. Meanwhile, Poong wonders what he should make for Sae Woo.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/aHs9Xie3sgvvQ6kd3Ey0DyDw60r.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-21","episode_number":10,"episode_type":"standard","id":1490612,"name":"What is This?","overview":"Chil Seong's men find out what Sae Woo and Chil Seong spoke about in the Shin Sa Im Dang room. Poong finds a sonogram on the floor of his bedroom. Sae Woo gets a call from a woman asking for her husband, O Jik. Meanwhile, Chil Seong's men calls him out for dinner to lift his spirits after being rejected by Sae Woo.","production_code":"","runtime":32,"season_number":1,"show_id":78797,"still_path":"/wjjH64IeT4mGPr0RoYFk87Hybb0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-22","episode_number":11,"episode_type":"standard","id":1490613,"name":"Open Your Eyes Properly!","overview":"O Jik’s parents come to Sae Woo’s newlywed home. She is shocked to hear their demand. Poong is confused over Dal Hui's betrayal and the feelings he has developed for Sae Woo. Chil Seong has a hard time getting over his feelings for Sae Woo. Chil Seong and Poong has a war of nerves over Sae Woo while the three of them have drinks.","production_code":"","runtime":31,"season_number":1,"show_id":78797,"still_path":"/m8B1pS8Kg4bnkE9975JbGEKw5Qb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-22","episode_number":12,"episode_type":"standard","id":1490614,"name":"Mom, I’m Home","overview":"After moving out of her place, Sae Woo goes back to her mother's home. She finds out that Seol Ja, Geok Jeong, and her mom all agreed to work at Hungry Frying Pan, so they can afford the rent for the house. Dal Hui comes to the restaurant to talk to Poong. He tells her to leave, and Sae Woo overhears their conversation. Meanwhile, Poong's wrist injury seems worse than he thought.","production_code":"","runtime":32,"season_number":1,"show_id":78797,"still_path":"/9iy1PoD0cG1XomczPNDcY7T6vWd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-28","episode_number":13,"episode_type":"standard","id":1497879,"name":"Let’s Keep The Ring On","overview":"After realizing that he may have developed feelings for Sae Woo, Poong storms out of the restaurant. Chil Seong tells Sae Woo that he no longer has feelings for her and continues to suffer alone. Sae Woo tries to make amends for setting Poong on fire and burning his wok. However, Poong continues to act cold and denies his feelings for her.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/A1RAF3uG2Tnm3zwodl7ANmvyXXk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-28","episode_number":14,"episode_type":"standard","id":1497880,"name":"So, You’re Not Sick?","overview":"On her first official day at Hungry Frying Pan, a mysterious man comes to the restaurant. He tells Sae Woo that Chil Seong is a dangerous man, whom she should be careful of. After meeting the mysterious man, Chil Seong tells Sae Woo about his past criminal record. Meanwhile, Poong and Chil Seong start to become friends.","production_code":"","runtime":31,"season_number":1,"show_id":78797,"still_path":"/rLwQIn0FzBEzhEis2tQUcHIUnoB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-29","episode_number":15,"episode_type":"standard","id":1498398,"name":"It’s a Dream","overview":"Sae Woo and Chil Seong heads to the hospital. Sae Woo is confused after kissing Chil Seong, but she ends up dreaming about Poong while in the emergency room. After finding out that Crooked has something to do with Seung Ryong, Chil Seong tells his men to look into the hotel. Meanwhile, Seol Ja bumps into Chun Su at the sauna.","production_code":"","runtime":29,"season_number":1,"show_id":78797,"still_path":"/piHV9vkhT4IN1QTZdSZrvT5dXzl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-05-29","episode_number":16,"episode_type":"standard","id":1498399,"name":"Hungry Wok","overview":"The restaurant changes its name from “Hungry Frying Pan” to “Hungry Wok” in hopes to start anew. Poong tells the restaurant staff about his plan to help the restaurant come out of its financial deficit. The deeper Poong’s feelings get towards Sae Woo, the more he ends up yelling at her. Meanwhile, Poong goes back to the hotel to get his recipe notebook.","production_code":"","runtime":31,"season_number":1,"show_id":78797,"still_path":"/vLlE7YlQlukLDSjRefzx3eH8qZ0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-04","episode_number":17,"episode_type":"standard","id":1499388,"name":"I Split Up with My Wife","overview":"Poong tells Sae Woo that he and his wife split up. Maeng Dal and Seol Ja come back to the restaurant after having drinks. Upon seeing Poong and Sae Woo together, Maeng Dal tells everyone that Chil Seong is in love with Sae Woo. Chil Seong sneaks out of the hospital to see Sae Woo. Upon seeing him, Sae Woo says something unexpected to him.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/vrPJvwhtS5oUu110xEll1fI0lRZ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-04","episode_number":18,"episode_type":"standard","id":1499389,"name":"Poong’s Recipe Book","overview":"After finding out that Sae Woo has gotten a divorce, Poong can’t hide his happiness. Giant Hotel reveals that they are going to hold their own Whole Shrimp Dim Sum Festival following Poong’s recipe. Chil Seong barges into Giant Hotel to help Poong. Meanwhile, Seol Ja, Geok Jeong, and Jeong Hae are worried about Poong finding out that they are family.","production_code":"","runtime":32,"season_number":1,"show_id":78797,"still_path":"/us4cg6QvOtCl1HmbwN964dhOPfj.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-05","episode_number":19,"episode_type":"standard","id":1499390,"name":"Just in Case","overview":"Poong makes his mind up and tells Sae Woo how he feels. However, it only makes her confused and angry as she doesn't know how to interpret the message she got. Meanwhile, the people at Hungry Wok test a new dish Poong prepared in order to compete against Finishing Touch.","production_code":"","runtime":32,"season_number":1,"show_id":78797,"still_path":"/osELq34HhkgqMAjFBmeQZ3z4Gzk.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-05","episode_number":20,"episode_type":"standard","id":1499391,"name":"Are They Single or Married?","overview":"Sae Woo tells Poong that she wants to continue learning how to use a wok. Chil Seong finds out that both Poong and Sae Woo are divorced. He suffers in silence because he’s torn between love and friendship. Meanwhile, Poong still has trouble finding the right consistency for the dim sum dough, and it’s all hands-on deck at Hungry Wok in preparation for the Whole Shrimp Festival.","production_code":"","runtime":31,"season_number":1,"show_id":78797,"still_path":"/4rxRVMek8kH1AhQlJ7UPy9OIcC3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-11","episode_number":21,"episode_type":"standard","id":1499392,"name":"10,000 Dollars","overview":"Poong gets angry at Sae Woo for kissing him, but inside, he is happy. Chil Seong tells Poong to move in with him until he finds a place to stay. Master Wang tries to scout Seol Ja into working for him at Finishing Touch and offers to pay her 10,000 dollars. Hungry Wok’s first day of the Whole Shrimp festival begins, but Seol Ja is nowhere to be found.","production_code":"","runtime":32,"season_number":1,"show_id":78797,"still_path":"/fpbAfVhDgeaYAHZS9KjdFgH8CcO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-11","episode_number":22,"episode_type":"standard","id":1499393,"name":"The Plates Were Empty","overview":"Poong and Chil Seong go to Giant Hotel to get the knife that Poong left on Seung Ryong’s wall. Jeong Hae asks Sae Woo if she likes Poong. Sae Woo denies it, and Jeong Hae tells her that if she does, Seol Ja, Geok Jeong, and she will all quit Hungry Wok. Meanwhile, Chil Seong finds a wallet in front of the restaurant.","production_code":"","runtime":31,"season_number":1,"show_id":78797,"still_path":"/at8BzASBP2FecIO8T6FYYLejMlm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-25","episode_number":23,"episode_type":"standard","id":1499394,"name":"Finishing Touch Versus Hungry Wok","overview":"Chil Seong figures out that the gum lady is actually his mother and can’t hide his anger. Finishing Touch’s VIP calls Hungry Wok to cancel her reservation after Chun Su offers her a deal she can’t refuse. Poong counters his offer and tells her that he will give her a taste of what the menu will be like. This results in a cook-off between Poong and Chun Su.","production_code":"","runtime":33,"season_number":1,"show_id":78797,"still_path":"/pvjd6jaypErZX6AGcAAItBogqRV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-25","episode_number":24,"episode_type":"standard","id":1499395,"name":"I… Like You","overview":"After winning the heart of the VIP and getting the reservation, Poong can’t hide his happiness. He wants to celebrate but finds that Sae Woo is the only one available. Sae Woo carefully tells Poong what her dream is. Chil Seong tells the people at Hungry Wok that the gum lady is his mother. Meanwhile, Seung Ryong plans to ruin Poong by stealing the VIP back.","production_code":"","runtime":31,"season_number":1,"show_id":78797,"still_path":"/4MB3atgkBjDYnPHSWoD4iaRrE6l.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-26","episode_number":25,"episode_type":"standard","id":1499396,"name":"I Have Something to Tell You","overview":"After Poong confesses his feelings for Sae Woo, they decide to officially see each other. They are excited for the prospect of the new relationship and can’t wait to tell the people around them. However, neither of them can tell the people around them for various reasons. Meanwhile, Bo Ra calls Poong to tell him about Master Wang’s plan.","production_code":"","runtime":31,"season_number":1,"show_id":78797,"still_path":"/76UKf6TesWE8YRn9jRe8Juz4t7r.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-26","episode_number":26,"episode_type":"standard","id":1499397,"name":"No-show","overview":"Chil Seong hears that his father had passed away and decides to make amends with his mother in his own way. On the day of the banquet, Hungry Wok gets a call from the VIP cancelling her reservation. Chil Seong asks Poong to make jajangmyeon and sweet and sour pork, so he can deliver it to someone in the hotel. Meanwhile, Poong invites the hospital director to have drinks at Hungry Wok.","production_code":"","runtime":33,"season_number":1,"show_id":78797,"still_path":"/mOPuaLirabyAhrLHSt6aFKOBMAV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-02","episode_number":27,"episode_type":"standard","id":1499398,"name":"I Beg of You","overview":"Chil Seong is shocked after seeing Poong and Sae Woo kiss. O Jik comes back to Korea, and Sae Woo bumps into him in front of their newlywed home. Sae Woo and O Jik meet at the courthouse to sign the divorce papers when Sae Woo’s mom appears and begs O Jik to reconsider. Meanwhile, things at Finishing Touch don’t look promising as they continue to lose customers to Hungry Wok.","production_code":"","runtime":33,"season_number":1,"show_id":78797,"still_path":"/qHquetLzVMLBJBXe97bxTuMx56N.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-02","episode_number":28,"episode_type":"standard","id":1499399,"name":"Why Did You Want to See Me?","overview":"The protesters decide not to sell the right to protest to Chil Seong after getting threatened by Crooked. Chil Seong looks into Sae Woo’s father, Dan Seung Gi, as a means of getting to Yong Seung Ryong. Jeong Hae continues to make mistakes in the kitchen and angers Poong. He reprimands her without knowing that she’s, in fact, Sae Woo’s mother.","production_code":"","runtime":27,"season_number":1,"show_id":78797,"still_path":"/4tYHK0mx33XXrJzBcbqotpebaND.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-03","episode_number":29,"episode_type":"standard","id":1499400,"name":"Come Back","overview":"Poong is in shock when he finds out that Jeong Hae, Geok Jeong, Seol Ja, and Sae Woo are one family. Sae Woo doesn’t know what to do about her mother hating Poong. Poong meets with Jeong Hae and asks her to return to Hungry Wok as a hall manager. Meanwhile, the customer for the omakase special comes to Hungry Wok for their reservation.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/deXEv8GVetQSezDJF33t2AiKDLU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-03","episode_number":30,"episode_type":"standard","id":1499401,"name":"The Thrill of Secret Relationships","overview":"Seung Ryong offers Poong the position of head chef at Finishing Touch. Chil Seong goes to Giant Hotel to pay the protesters their money and get the protest rights. Sae Woo tries to reconcile with Poong after their fight by talking about the kitchen staff behind their backs. They go to Hungry Wok for a late-night snack and risk getting caught.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/9vA3ZAd7q8AbEYjg2f7l1n97gNg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-09","episode_number":31,"episode_type":"standard","id":1499402,"name":"We'll Have a Truce for Now","overview":"Poong reveals that he knows that Sae Woo, Geok Jeong, Jeong Hae, and Seol Ja are all a family that live in the same house. Seol Ja tries to make Poong and Sae Woo break up, but they both refuse to do so. Meanwhile, Chil Seong sets up a cooking duel with Seung Ryong to take back Finishing Touch, but he has to risk everything he has for the bet.","production_code":"","runtime":31,"season_number":1,"show_id":78797,"still_path":"/hvm78yNPVPS9WlO1hQPsiImDFPA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-09","episode_number":32,"episode_type":"standard","id":1499403,"name":"Please Help Me","overview":"The cooking showdown between Wang Chun Su and Seo Poong is set. However, Poong needs both Seol Ja and Sae Woo as his Cutting Part and Fire Part assistant. Seol Ja tries to keep her promise with Jeong Hae and ignore Poong’s request, but Poong continues to persuade her. Meanwhile, Poong chooses to use lobsters as his ingredient of choice.","production_code":"","runtime":28,"season_number":1,"show_id":78797,"still_path":"/3RGqN1PcuIlXYVx0ufvXyOAihPo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-10","episode_number":33,"episode_type":"standard","id":1516636,"name":"You Don't Have Time","overview":"The cooking showdown starts without Seol Ja. Poong has to prepare 100 portions of food by himself because of this. Meanwhile, some men try to stop Sae Woo and Seol Ja from getting to the cooking showdown at the underground parking lot.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/n2SXbWQLfMW0ftYappZFLUCEEco.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-10","episode_number":34,"episode_type":"standard","id":1516637,"name":"I Told You It Was Hard","overview":"Sae Woo’s father, Dan Seung Gi, finally gets released. Seol Ja and Geok Jeong ask Seung Gi and Jeong Hae for permission to leave the house and work at Finishing Touch. The staff of Hungry Wok all start to work at Finishing Touch, but Sae Woo has a difficult time there. Meanwhile, Seung Gi calls Poong on the phone.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/zSeiAUep163jaZPeQIWH8fMthfJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-16","episode_number":35,"episode_type":"standard","id":1516638,"name":"Go On a Blind Date","overview":"Sae Woo continues to work in the kitchen despite her mother’s opposition. Chil Seong finds out that his mother was in the hospital and goes to visit her. Seung Gi meets with Poong at Giant Hotel and tells Poong to be cautious while pursuing his relationship with Sae Woo. Meanwhile, Chil Seong prepares for the auction of Giant Hotel.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/nsROiiYB2CR9TRQMjeSkxQNfkWG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-16","episode_number":36,"episode_type":"standard","id":1516639,"name":"Send Sae Woo Home","overview":"Poong decides to reform the menu at Finishing Touch. Sam Seon and the rest of the kitchen staff try to fight against Poong’s changes. The kitchen at Finishing Touch is in chaos when the chefs don’t show up as an act of rebellion. Meanwhile, Jeong Hae visits Poong at Finishing Touch and tells him to send Sae Woo home.","production_code":"","runtime":30,"season_number":1,"show_id":78797,"still_path":"/DKhGkHFTIGdh858eeonIvLwo4q.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-17","episode_number":37,"episode_type":"standard","id":1516640,"name":"Jajangmyeon and Sweet and Sour Pork","overview":"Sam Seon shows up to Finishing Touch to get his things to quit. A fight ensues and Poong convinces Sam Seon to come back with the other chefs. He tells Sam Seon of his plans. Chil Seong and his men go to the courthouse for the auction of Giant Hotel. Meanwhile, Poong shows up to Sae Woo’s house drunk.","production_code":"","runtime":31,"season_number":1,"show_id":78797,"still_path":"/mEP0F7k6FtRZoUhWmNPJlbmbBJO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-17","episode_number":38,"episode_type":"finale","id":1516641,"name":"The Final Episode","overview":"Everyone returns to work, and Chil Seung assumes his role of CEO of Giant Hotel. Poong moves into Sae Woo’s home to work in Jeong Hae’s kitchen until she approves of him. Everything is looking up as Seol Ja and Geok Jeong also return to Chef Poong’s kitchen.","production_code":"","runtime":29,"season_number":1,"show_id":78797,"still_path":"/bTiAxyyNCWNNg3SfzDPNsIwTd5y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Down on his luck and in need of a kitchen, a star chef turns to reforming a shoddy Chinese restaurant staffed by former gangsters.","id":102489,"poster_path":"/xkKFDDiAdBy0A4BO0RHnQQkQdA.jpg","season_number":1,"vote_average":0}}}