{"adult":false,"backdrop_path":"/gd88zTZa9j1fvJ72J5zK5AaYU25.jpg","created_by":[{"id":1491139,"credit_id":"55b6fc25c3a368227f001289","name":"Adam DiVello","profile_path":null}],"episode_run_time":[30],"first_air_date":"2008-12-29","genres":[{"id":10764,"name":"Reality"}],"homepage":"https://www.mtv.com/shows/the-city","id":7885,"in_production":false,"languages":["en"],"last_air_date":"2010-07-13","last_episode_to_air":{"id":392136,"name":"Lost In Translation","overview":"When Olivia travels to Japan, Erin tries to permanently replace her with Louise. Plus, Whitney must decide between her loyalty to Kelly and a rival PR firm that wants to represent her.","vote_average":0,"vote_count":0,"air_date":"2010-07-13","episode_number":12,"episode_type":"finale","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null},"name":"The City","next_episode_to_air":null,"networks":[{"id":33,"logo_path":"/w4qtv7xBkSVsbOQdSzjUjlyOuSr.png","name":"MTV","origin_country":"US"}],"number_of_episodes":35,"number_of_seasons":2,"origin_country":["US"],"original_language":"en","original_name":"The City","overview":"The City is an American reality television series that originally aired on MTV from December 29, 2008 until July 13, 2010. Developed as the spin-off of The Hills, the series aired two seasons and focused on the personal and professional lives of several young women residing in New York City, New York.  The series originally focused on Whitney Port, who appeared in its predecessor, as she began employment with Diane von Fürstenberg. It additionally placed emphasis on her workplace rival Olivia Palermo, Port's boyfriend Jay Lyon, his roommate Adam Senn, and her friend Erin Lucas. The latter three were replaced by Port's roommate Roxy Olin and Palermo's enemy Erin Kaplan for the second half of the first season.","popularity":6.26,"poster_path":"/pqeYIa5QcWwM27GOs0x7zlKQPKG.jpg","production_companies":[{"id":11534,"logo_path":null,"name":"MTV Productions","origin_country":""}],"production_countries":[],"seasons":[{"air_date":"2008-12-29","episode_count":23,"id":18020,"name":"Season 1","overview":"","poster_path":"/xMA0xq9Ls08uqRTTCrJREqYTld1.jpg","season_number":1,"vote_average":0},{"air_date":"2010-04-27","episode_count":12,"id":18021,"name":"Season 2","overview":"","poster_path":"/jUDSjZbSce7rbrUVIfxvqWZOpEC.jpg","season_number":2,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Reality","vote_average":6,"vote_count":1,"season_data":{"1":{"_id":"52578ea7760ee36aaa6b19be","air_date":"2008-12-29","episodes":[{"air_date":"2008-12-29","episode_number":1,"episode_type":"standard","id":392103,"name":"If She Can Make It Here...","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-29","episode_number":2,"episode_type":"standard","id":392104,"name":"The Truth Will Reveal Itself","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-05","episode_number":3,"episode_type":"standard","id":392105,"name":"The L Word","overview":"Erin's new boyfriend, Duncan, flies into town from Toronto. They playfully flirt on the couch at Erin's apartment when Whitney walks in. After a brief introduction, Whitney tells them that she will give the two alone time and gets out of their way.\n\nErin and Whitney grab breakfast at The Smith in the East Village while Duncan is asleep. Whitney shares that she is grateful yet apologetic that Erin has let her stay in her apartment. Erin responds that she is happy to open up her home, even though it might be a little crowded with Duncan in town. Whitney also questions her relationship with Jay -- she wants to trust him, but is finding it difficult.\n\nWhitney and Olivia help out with the styling at a Diane von Furstenberg photo shoot. While on the job, Whitney gets a call from Jay about an apartment he wants her to see immediately. She tells Olivia she wants to check out the place, but doesn't want to leave the shoot. Olivia, a native New Yorker, offers to help Whitney apartment hunt later but Whitney decides to leave early and goes to meet up with Jay.\n\nWhitney and Jay check out the apartment in Gramercy Park, only 2 blocks away from Erin's place. They are both pleasantly surprised with the open floor plan and the breathtaking floor-to-ceiling windows. Although Whitney, at first, has some reservations about the high-rise building, Jay reassures her that with a new place they can finally have some alone time.\n\nLater, Whitney is elated to tell Olivia that she got the apartment she saw with Jay. Now feeling like she's on top of the world, Olivia shakes up her spirits with a little unwelcomed advice: you need to be more independent and your own person.\n\nErin and Duncan spend the night out at Brass Monkey. Although a bit hesitant at first, Erin opens up her feelings to Duncan and he warmly reciprocates. She flirtatiously asks him how he can be so perfect, but Duncan responds that he definitely has his secrets.\n\nWhitney moves into her new apartment with Jay and Erin's help. Erin shares that she and Duncan used the L word to each other last night. Although Whitney is ecstatic to hear the news, Jay is perplexed on how two people can fall in love in only two weeks into a relationship.\n\nWhile on a stroll in Central Park, Whitney confides in Erin that she seems to be figuring out everything in this new city -- except for the guys. She tells Erin that she will talk to Jay tonight about their relationship.\n\nMeanwhile at Olivia's apartment, Olivia and her cousin Nevan dish about Whitney. Olivia is bothered that Whitney has moved into the first apartment she saw and also the apartment that Jay found. She is concerned that if anything were to happen between Whitney and Jay, she doesn't want Whitney to have emotional baggage attached to her home. Olivia wishes that Whitney be the more confident New Yorker and ditch the LA girl in her.\n\nWhitney meets up with Jay at Stanton Social in the Lower East Side for dinner. Again, Jay criticizes on Erin and Duncan's relationship about how they are moving too quickly. They both skirt around the issue about their own relationship until Jay outwardly states that he doesn't want to be all about a relationship at this time because he is finally comfortable with where he is. He doesn't want to date other people, but he also doesn't want to put a label on their relationship either. Whitney then boldly gets real and honest and tells him that she doesn't want to invest in someone that doesn't make her a big priority in his life. Even though he can't agree right now, Jay reassures Whitney by telling her that he wants to get to know her better. Whitney nods hesitantly and confused at his remarks, and they continue on with their dinner date.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-12","episode_number":4,"episode_type":"standard","id":392106,"name":"Good Things Come In Threes","overview":"At the Diane von Furstenberg offices, Whitney and Olivia discuss the guest list for their upcoming Wonder Woman Event with DC Comics. Olivia explains that all the \"socials\" (i.e. socialites) will be invited. Then Diane (yes, THE Diane von Furstenberg) shows up and talks to Whitney about styling some outfits for the event and then asks her how things are going for her.\n\nWhitney and Erin have lunch at Caffe Falai in Soho. Whitney tells Erin that she thinks she may need to take a step back in her relationship with Jay.\n\nBack at the DVF offices, the staff has a meeting about preparations for the upcoming Wonder Woman Event. Alixe Boyer, the VP Global Image Director and Whitney's boss, tells the team to convert the whole store for the event. Whitney is assigned to handle the window displays and Olivia's assigned to help Whitney.\n\nDuncan, Erin's long distance boyfriend, is coming to the end of his stay in the city at Erin's apartment. They discuss their relationship and have conflicting views. Duncan talks about moving to NYC and says that he might just need \"a couch\" to sleep on until he finds his own place. While Erin enjoys being with him she also enjoys having her space when he's gone.\n\nAt DVF's Wonder Woman Event, Olivia works the front door and greets guests - many of whom she seems to know rather well. Samantha arrives and goes inside to chat with Whitney. They're introduced to Chris, a cute co-worker of Whitney's who works in a different department. Just as Chris is about to leave, he asks Whitney out to lunch. Whitney seems surprised by his straightforwardness but she agrees.\n\nWhitney goes out to lunch at The Diner with Chris. Whitney tells him that she's still new to the city and only has a few friends, so, Chris offers to take her out so she can make more friends. Meanwhile, back at DVF, Olivia picks up a phone call from Jay - he's looking for Whitney. Olivia tells Jay that Whitney is out to lunch and that's all she knows.\n\nWhen they return from lunch, Chris gives Whitney a hug goodbye and heads to his office. Olivia and another co-worker, Elizabeth, start grilling Whitney about her lunch date. Whitney says that although he's nice, she didn't feel any chemistry. The girls ask Whitney whether she's going to tell Jay. Olivia says that she doesn't need to tell him anything but Whitney decides to anyways because it was just a lunch.\n\nAs Duncan hails a cab to the airport he asks Erin about their relationship hoping to change her mind. Erin still thinks being in a long distance relationship works better and doesn't want him to move to New York just for her because it might put too much pressure on their relationship.\n\nLater, Whitney meets up with Jay for dinner at Los Dados in the Meatpacking District. After a brief catch-up, Whitney talks about her friendly lunch date with Chris. Jay doesn't respond favorably and wonders if this is a ploy to make him jealous. He nonchalantly tells her that she can do whatever she wants. Does he really mean it?\n\nAt Whitney's apartment, Erin and Whitney discuss both of their relationships. Erin thinks she may have a problem because she has only had long distance relationships. Whitney says that Jay gives her too many mixed signals but she definitely has a spark with him that she doesn't have with anyone else.\n\nMeanwhile at Il Bastardo, Jay confides in Alex about his relationship with Whitney. After three months of seeing each other, Jay needs to figure out if this relationship is either going to go somewhere or nowhere. After talking it out with Alex, Jay realizes that he doesn't want to lose Whitney -- she's a keeper!\n\nLater, Jay picks up Whitney at her apartment for their date. While Whitney is still getting ready, Jay asks if they can talk. She says of course he can talk to her about anything. As Jay pulls her in close, he adoringly declares that he wants to take the relationship to \"the next level\" and wants Whitney to be his girlfriend. Whitney giggles and nods in agreement and they then seal the deal with their first kiss as an official couple.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-19","episode_number":5,"episode_type":"standard","id":392107,"name":"Boys Night Out","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-01-26","episode_number":6,"episode_type":"standard","id":392108,"name":"He Never Said He Had A Girlfriend","overview":"Allie visits Whitney at her apartment and asks for advice on how she should deal with the alleged kiss between her boyfriend Adam and Catarina, a girl he met drinking out with the boys. Allie thinks that maybe she should confront Catarina.Whitney reminds her that, if she trusts him, then there's no point in causing trouble. But iIf she has doubts, the person to confront is Catarina.\n\nAt the DVF offices, Whitney invites Olivia to an art gallery opening Jay and Adam are throwing at Collective Hardware. She warns Olivia that there has been a lot of drama within her circle of friends because of the rumored kiss between Adam and Catarina. Olivia, however, doesn't want to get involved and doesn't want to hear any more of the \"high school drama.\"\n\nWhile having lunch at Bergdorf Goodman, Catarina tells Samantha that she's nervous about going to the gallery opening because Allie will be there. No one told Samantha that Adam had a girlfriend until after the fact. She doesn't know what to say to Allie but Samantha says that she needs to tell Allie the truth -- \"girl-to-girl.\"\n\nAt Union Square Wines, Jay and Adam buy beverages for their friend's art show. Adam says that he's smoothed everything over with Allie. Then, Jay directly asks Adam if anything happened with Catarina, to which Adam deflects the answer by shrugging his shoulders.\n\nBack at Whitney's apartment, Whitney and Erin are excited but apprehensive about the art gallery show that night.. With the tension mounting between Adam, Allie and Catarina, there's sure to be drama. Erin says that girls have to look out for each other...especially with guys like Adam.\n\nFinally, the moment arrives. The gang starts trickling into the Lower East Side art gallery. When Samantha and Catarina arrive the tension comes with them. Allie comments on how awkward the situation is to Whitney just before she turns to Catarina and starts a conversation. Catarina tells Allie that she and Adam kissed but that he never mentioned having a girlfriend. Tears stream down Allie's cheeks and she asks Catarina to swear that she's telling the truth. Catarina reassures her and apologizes, saying that she would never wish this on anyone but she wanted Allie to know the truth.\n\nStill in tears, Allie runs to the bathroom with Whitney close behind. Soon after, Adam knocks on the door, they let him in and Whitney leaves them alone. Adam doesn't understand why she's crying. Allie tells him that she spoke to Catarina and she is starting to believe that they kissed. Allie makes a quick exit from the party and Adam follows her to the street, where their discussion escalates. Allie asks Adam how he'd feel if the tables were turned, and Adam admits that it would be horrible. He tries to console her, but Allie pulls away, hails a cab and goes home. Adam heads back to the gallery alone.\n\nThe next day, Olivia and Nevan gossip about the night before. Nevan is quick to remark that he doesn't understand the downtown \"I wear a fedora\" crowd. Olivia agrees and dismisses the drama between Adam and Allie as childish. Nevan then insinuates that he's sure Adam has no shortage of girls so there's sure to be more drama in the future.\n\nMeanwhile, Jay is over at Whitney's apartment and they discuss the rumored kiss. They have differing opinions: Whitney believes Catarina while Jay is loyal to his buddy and roommate Adam. Whitney tells him she hopes that he wouldn't pull anything like that with her. But Jay tells her that she's taking it a bit too far.\n\nLater, Allie meets up with Adam at Merc Bar in Soho. Adam apologizes for putting her in that situation. He feels helpless but swears that Catarina is lying. He tells her that no matter what anyone else says, he would never lie to her. After a long uncomfortable silence, Allie accepts his apology by saying that she can't believe this girl over him.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-02","episode_number":7,"episode_type":"standard","id":392109,"name":"The Truth Hurts","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-09","episode_number":8,"episode_type":"standard","id":392110,"name":"Mingling With The Commoners","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-16","episode_number":9,"episode_type":"standard","id":392111,"name":"Unexpected Roommates","overview":"The ladies celebrate the New Year, as Duncan pays Erin a visit and run into JR. Adam wishes that Jay would move out of their place.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-02-23","episode_number":10,"episode_type":"standard","id":392112,"name":"The Past Catches Up","overview":"The gang takes a trip to Miami. Elsewhere, Whitney and Jay's ex have a run in.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-02","episode_number":11,"episode_type":"standard","id":392113,"name":"Fool Me Twice, Shame On Me","overview":"Whitney rethinks her relationship with Jay, after his ex Danielle pops up once again. Meanwhile, Olivia claims she was responsible for a job done by Whitney at the DVF.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-09","episode_number":12,"episode_type":"standard","id":392114,"name":"I'm Sorry Whit","overview":"By Jay waiting to the last minute to tell Whitney that the band is going on tour, causes a strain on their relationship.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-03-16","episode_number":13,"episode_type":"standard","id":392115,"name":"I Lost Myself in Us","overview":"Whitney questions her life in New York City as she struggles with her break-up and competes with Olivia for new responsibilities at DVF.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-09-29","episode_number":14,"episode_type":"standard","id":392122,"name":"Sleeping With The Frenemy","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-06","episode_number":15,"episode_type":"standard","id":392124,"name":"Working Girls","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-13","episode_number":16,"episode_type":"standard","id":392125,"name":"It's All Who You Know","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-20","episode_number":17,"episode_type":"standard","id":392116,"name":"Meet the Fackelmayers","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-10-27","episode_number":18,"episode_type":"standard","id":392117,"name":"Hit It and Quit It","overview":"","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-03","episode_number":19,"episode_type":"standard","id":392118,"name":"Weekend at Freddie's","overview":"Erin has to pick up the slack when Olivia drops the ball on a big interview assignment for ELLE. Plus, Whitney finds out a shady secret about Freddie from his own brother.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-10","episode_number":20,"episode_type":"standard","id":392123,"name":"Friends and Foe-Workers","overview":"Roxy and Whitney get into an argument while on the job at Miami Fashion Week","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-17","episode_number":21,"episode_type":"standard","id":392121,"name":"Forget About Boys","overview":"Olivia gets praise from Joe at an ELLE photo shoot, but Erin is frustrated about the preferential treatment. Meanwhile, Whitney and Roxy go on a series of disastrous dates, ending in a blowup at a night club.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-11-24","episode_number":22,"episode_type":"standard","id":392119,"name":"If You Want Something Done Right…","overview":"At People's Revolution, Whitney gives Kelly the first look at her design samples. Kelly evaluates the rack of clothes and tells Whitney her next step is to make a look book for her pieces.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-12-01","episode_number":23,"episode_type":"finale","id":392120,"name":"Everything On The Line","overview":"At People's Revolution, Kelly tells Whitney that she sent her look book to Bergdorf Goodman, and Linda Fargo, the senior vice president at Bergdorf, liked what she saw.","production_code":"","runtime":30,"season_number":1,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":18020,"poster_path":"/xMA0xq9Ls08uqRTTCrJREqYTld1.jpg","season_number":1,"vote_average":0},"2":{"_id":"52578ea7760ee36aaa6b19c9","air_date":"2010-04-27","episodes":[{"air_date":"2010-04-27","episode_number":1,"episode_type":"standard","id":392137,"name":"Show 'Em What You Got","overview":"Olivia gets promoted to be the new face of ELLE.com. Meanwhile, Whitney gets a once in lifetime chance to show her line at New York Fashion Week when one of Kelly's designers drops out....","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-04","episode_number":2,"episode_type":"standard","id":392126,"name":"Friends In High Places","overview":"Whitney has no time to rest after her first big fashion show, when Kelly pushes her to market her line. Olivia however, refuses to support Whitney Eve at ELLE Magazine.","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-11","episode_number":3,"episode_type":"standard","id":392127,"name":"Professionally Dangerous","overview":"Roxy has a date-like meeting with Zach. Meanwhile, Whitney and Olivia go head-to-head after Olivia decides to interview her friend for ELLE, instead of covering Whitney's line.","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-18","episode_number":4,"episode_type":"standard","id":392128,"name":"Queen of Diamonds","overview":"Erin and Olivia bump heads on how to dress Fergie for an ELLE cover shoot. Meanwhile, Whitney is torn when a French photographer wants to take the relationship to the next level.","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-05-25","episode_number":5,"episode_type":"standard","id":392129,"name":"The Belle Of Elle","overview":"Roxy's bad judgement at Whitney's Glamour magazine meeting threatens Whitney's reputation. Meanwhile, Olivia plays the role of party socialite with Joe Zee....","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-01","episode_number":6,"episode_type":"standard","id":392130,"name":"Fashion With A Capital F","overview":"Olivia goes against her boss and refuses to wear a designer to their joint party with ELLE while Whitney receives harsh criticism of her line from Joe Zee.","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-08","episode_number":7,"episode_type":"standard","id":392131,"name":"The British Are Coming","overview":"","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-15","episode_number":8,"episode_type":"standard","id":392132,"name":"Work Horses And Show Ponies","overview":"","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"52578ea8760ee36aaa6b1bce","order":500,"adult":false,"gender":1,"id":6194,"known_for_department":"Acting","name":"Claire Danes","original_name":"Claire Danes","popularity":23.829,"profile_path":"/ustSV3r790QyskweHVC2XqDWs7U.jpg"}]},{"air_date":"2010-06-22","episode_number":9,"episode_type":"standard","id":392133,"name":"One Girl's Trash...","overview":"Erin and Olivia get into an argument at work and Whitney pushes her line to fashion trade show buyers and blames Roxy for a failed sale.","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Herself","credit_id":"56c1acb49251410a62002383","order":501,"adult":false,"gender":1,"id":1337227,"known_for_department":"Acting","name":"Kesha","original_name":"Kesha","popularity":3.88,"profile_path":"/BFuhXCSF6JJR0lwplTSPe4OXlk.jpg"}]},{"air_date":"2010-06-29","episode_number":10,"episode_type":"standard","id":392134,"name":"Stage Fight","overview":"Roxy and Whitney's relationship is put to the test and Olivia helps Erin with a segment for the Martha Stewart Show.","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-06","episode_number":11,"episode_type":"standard","id":392135,"name":"Roommate Wanted","overview":"Tension with Whitney leads Roxy to look for her own place, plus Olivia reluctantly styles a celebrity in Whitney Eve.","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-13","episode_number":12,"episode_type":"finale","id":392136,"name":"Lost In Translation","overview":"When Olivia travels to Japan, Erin tries to permanently replace her with Louise. Plus, Whitney must decide between her loyalty to Kelly and a rival PR firm that wants to represent her.","production_code":"","runtime":30,"season_number":2,"show_id":7885,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":18021,"poster_path":"/jUDSjZbSce7rbrUVIfxvqWZOpEC.jpg","season_number":2,"vote_average":0}}}