{"adult":false,"backdrop_path":"/9qnSCgu4JPt50uBPunaw3vrdSCV.jpg","created_by":[{"id":2123062,"credit_id":"5b9187c09251412d2100531c","name":"Alyndra Pandjipoetra","gender":0,"profile_path":null}],"episode_run_time":[533],"first_air_date":"2018-05-31","genres":[{"id":18,"name":"Drama"}],"homepage":"","id":80111,"in_production":false,"languages":["id"],"last_air_date":"2018-07-12","last_episode_to_air":{"id":1565068,"name":"Episode 13","overview":"Reno finally knows who is her biological mother. It makes him in dilemma and runs away from home. Langit and Adisty search Reno in panic. In the search of Reno, Langit and Adisty talk heart to heart about their marriage problem. While Reno with Bumi, Reno finally accept the truth about him and his parents.","vote_average":0,"vote_count":0,"air_date":"2018-07-12","episode_number":13,"episode_type":"finale","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null},"name":"Sunshine","next_episode_to_air":null,"networks":[{"id":2146,"logo_path":"/mmQOH5hoPd9ZieQPr5FFsjAMgD8.png","name":"ViuTV","origin_country":"HK"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["ID"],"original_language":"id","original_name":"Sunshine","overview":"Langit is on the verge of separation with his wife. His son, Reno once asked him about true love. This reminds him of his old stories with four important women who had had special place in his heart. Sweet and bitter romantic memories urge Langit to find out the meaning of true love.","popularity":2.999,"poster_path":"/poEmVY6BbQLZlK76zSFBMVdDMcR.jpg","production_companies":[{"id":96521,"logo_path":"/bIEruVnJ4g5WInPb0zEQF8nJNQt.png","name":"ViuTV","origin_country":""}],"production_countries":[{"iso_3166_1":"ID","name":"Indonesia"}],"seasons":[{"air_date":"2018-05-31","episode_count":13,"id":105003,"name":"Season 1","overview":"Langit, who is going to divorce with his wife, was once asked by his son, Reno, about true love. It reminded him of an old story about his closeness with four women who had filled his life. The memories that open the sweet and bitter journey of Langit's love story, where finally he must find out about the meaning of true love.","poster_path":"/poEmVY6BbQLZlK76zSFBMVdDMcR.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Indonesian","iso_639_1":"id","name":"Bahasa indonesia"}],"status":"Ended","tagline":"","type":"Miniseries","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"5b1dfdc2c3a36808a9006291","air_date":"2018-05-31","episodes":[{"air_date":"2018-05-31","episode_number":1,"episode_type":"standard","id":1504256,"name":"Episode 1","overview":"When his son questioned Langit’s decision to get a divorce with his mother, it triggers all the memories. Langit’s love to Bumi brought him to series of events that lead him to meet Matahari and other personalities that filled a special place in his heart.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":"/z6DR99raXvYibYcJSX82rmvsR3e.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-06","episode_number":2,"episode_type":"standard","id":1565048,"name":"Episode 2","overview":"Langit grows closer with Bumi and promised to wait until she graduates. On the day of her graduation, a man showed up, who turned up to Bumi’s fiancée her father set for her up. Langit was devastated, but Bumi cannot reject her father’s wish. While today, Reno missing her mom more and wish his family will be whole again. Memory then brings Langit back to another moment that changes his next course of life. He saw Bumi’s fiancée cheating her with another woman. Langit is tear apart between telling Bumi and destroy her upcoming wedding or stay quite and let her fulfill her father’s wishes.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":"/eOvQhH731lPuXDUMQ00KUaTFUl0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-07","episode_number":3,"episode_type":"standard","id":1565053,"name":"Episode 3","overview":"Langit regretted that he had ruined Bumi’s wedding just to win his ego. He is sad for destroying Bumi’s heart. In this tough time, Matahari stayed with Langit all the time. Both are getting closer and tell each other everything. At the same time, a perfect man appears in Matahari’s life. Will Langit make a move and state his feelings to Matahari?","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-13","episode_number":4,"episode_type":"standard","id":1565056,"name":"Episode 4","overview":"Doing projects together with Matahari, brought Langit to meet Bintang, a model and actress occupied with her celebrity life. Their meeting was made a big impression to Bintang, as she learned to enjoy life as is, something she hadn’t had for a long time being a celebrity. Bintang fell on to Langit’s different approach and told Matahari about her feelings. But, would Langit feel the same way? While today, Reno trying to make her dream come true with his new friend, Vanessa, by finding a falling star so they can wish their parents are all back together with them.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-14","episode_number":5,"episode_type":"standard","id":1565058,"name":"Episode 5","overview":"Matahari becomes confused with her feelings towards Langit. At the same time, Farid is getting closer to her. Langit felt some jealousy looking at their closeness. While on the other hand, Bintang, lost in her interpretation of love, keeps showering Langit with presents. Until Bintang finally open up to Langit about her true feelings. While Farid, also stated his feelings to Matahari.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-20","episode_number":6,"episode_type":"standard","id":1565060,"name":"Episode 6","overview":"Now that Langit and Bintang are together, he started to think of future seriously. He tried hard to keep up with Bintang’s lifestyle. Langit started getting a job and that makes him less in paying attention to Bintang. They keep facing problems from one to the other. The gap between them just grow bigger and bigger. Will they last?","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-21","episode_number":7,"episode_type":"standard","id":1565061,"name":"Episode 7","overview":"After his break up with Bintang, Langits starts loosing faith on love and struggle. But Matahari appeared again to boost his spirits as always. She made him strong and becoming his support system that never fail him. Until, another woman starts filling his heart again. While in today’s situation, Langit enters a new chapter in his life. His relationship with his wife getting worse because Reno fell ill.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-27","episode_number":8,"episode_type":"standard","id":1565063,"name":"Episode 8","overview":"Langit starts asking his commitments to his marriage and their plan for divorce. In a while, because of Reno’s question Langit starts thinking about Bulan. She is the first person in his life thet ever called him a looser that give up easily. Langit annoyed by Bulan, a waitress in a café that thinks she’s better than him. Both fought a lot, yet Bulan is a mature individual that can read Langit’s mind. She’s even often a step advanced than him.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-06-28","episode_number":9,"episode_type":"standard","id":1565064,"name":"Episode 9","overview":"Langit getting more curious with Bulan. As Langit getting know more about Bulan, Langit gets upset, but at the same time, he gets more interested with Bulan. With all the argument which usually happened between them, it actually makes Langit ask Bulan to be his girlfriend and it makes the situation even more complicated.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-04","episode_number":10,"episode_type":"standard","id":1565065,"name":"Episode 10","overview":"At first, Matahari is happy with the positive changes of Langit’s behavior and try to give a hint to Langit about her feeling to him., but in the other hand, Langit getting more curious with Bulan. As Langit getting know more about Bulan, Langit gets upset, but at the same time he gets more interested with Bulan. With all the argument which usually happened between them,  it’s actually makes Langit ask Bulan to be his girlfriend. That makes the situation even more complicated. Want to know more about the love life of Langit, Matahari, and Bulan? Watch Sunshine, only on VIU.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-05","episode_number":11,"episode_type":"standard","id":1565066,"name":"Episode 11","overview":"Bulan finally accepts Langit proposal. They start to arrange their wedding day. But that wedding makes Matahari heartbroken and left Langit without notice. Bumi suddenly appears and make Bulan jealous. Their marriage is at the edge of the cliff. In the different time, Reno still tries to seek the answer about Matahari and Bulan, until he runs away to his grandma house. Want to know more about the love life of Langit, Matahari, and Bulan? Watch Sunshine, only on VIU.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-11","episode_number":12,"episode_type":"standard","id":1565067,"name":"Episode 12","overview":"Bulan is now pregnant but her pregnancies are in danger and she had to bedrest. Matahari feels that is too late to say about her feeling to Langit and she's hopeless. Meanwhile Reno’s search didn’t get the exact answer, instead, his grandma gives him a riddle which makes Reno more confuse. Want to know more about the end of Langit’s love story? Watch Sunshine, only on VIU.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-07-12","episode_number":13,"episode_type":"finale","id":1565068,"name":"Episode 13","overview":"Reno finally knows who is her biological mother. It makes him in dilemma and runs away from home. Langit and Adisty search Reno in panic. In the search of Reno, Langit and Adisty talk heart to heart about their marriage problem. While Reno with Bumi, Reno finally accept the truth about him and his parents.","production_code":"","runtime":533,"season_number":1,"show_id":80111,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Langit, who is going to divorce with his wife, was once asked by his son, Reno, about true love. It reminded him of an old story about his closeness with four women who had filled his life. The memories that open the sweet and bitter journey of Langit's love story, where finally he must find out about the meaning of true love.","id":105003,"poster_path":"/poEmVY6BbQLZlK76zSFBMVdDMcR.jpg","season_number":1,"vote_average":0}}}