{"adult":false,"backdrop_path":null,"created_by":[{"id":1220449,"credit_id":"5254089419c29579402d9eed","name":"Ramsay Gilderdale","gender":2,"profile_path":null}],"episode_run_time":[30],"first_air_date":"1999-06-27","genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":817,"in_production":false,"languages":["en"],"last_air_date":"2003-04-04","last_episode_to_air":{"id":1148326,"name":"Who Shot Barbara?","overview":"Barbara rows with Ted,accusing him of spending too much time doing DIY for Neil's girlfriend's mother,an old flame of his. She also falls out with Linda and Martin after she baby-sits for them and accidentally sets their kitchen on fire. Neil is unhappy with her when she frightens his girlfriend off and,needless to say,she is not popular with the patients at the surgery or anybody in the street. So...who shot her in the bottom with an air-rifle?","vote_average":0,"vote_count":0,"air_date":"2003-04-04","episode_number":6,"episode_type":"finale","production_code":"","runtime":30,"season_number":4,"show_id":817,"still_path":null},"name":"Barbara","next_episode_to_air":null,"networks":[{"id":9,"logo_path":"/oz9pjTHnBUmlju8OkaTymhKbh6C.png","name":"ITV1","origin_country":"GB"}],"number_of_episodes":29,"number_of_seasons":4,"origin_country":["GB"],"original_language":"en","original_name":"Barbara","overview":"Barbara is a British sitcom starring Gwen Taylor in the title role. A pilot was broadcast in 1995, and three series were then televised from 1999 to 2003. It was made by Central Television, and filmed at their Lenton Lane studios in Nottingham in front of a live studio audience. The majority of location scenes for the series were filmed in various suburbs of Nottingham, including Mapperley and West Bridgford, with other scenes filmed around Nottinghamshire and Derbyshire. Despite winning awards and respectable viewing figures, it was axed by ITV in 2003.","popularity":2.323,"poster_path":"/iDlPpEQl7vMMOIOjqLWUaFe1v5H.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"1999-06-27","episode_count":7,"id":72767,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2000-11-24","episode_count":10,"id":72780,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2002-04-23","episode_count":6,"id":72830,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2003-02-23","episode_count":6,"id":72831,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"567352049251412db10001ec","air_date":"1999-06-27","episodes":[{"air_date":"1995-07-10","episode_number":0,"episode_type":"standard","id":1147813,"name":"Job (Pilot)","overview":"Pushy Barbara is a receptionist at a Leeds doctors' surgery,married to the mild-mannered taxi driver Ted. Barbara's daughter Linda is married to Martin Benson,a chef,who annoys Barbara when he announces that he and his wife and baby are relocating to Wales,causing Barbara to intervene. Note: In the subsequent series Martin's surname was Pond and he was a reporter for a local television show.","production_code":"","runtime":30,"season_number":1,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-06-27","episode_number":1,"episode_type":"standard","id":1147814,"name":"Birthday","overview":"Abrasive doctor's receptionist Barbara is preparing for her sister Jean's birthday when daughter Linda rings to say she is ill. Barbara takes over her job as a market researcher but gets so many complaints she has to take drastic action to prevent Linda from getting the sack. Fellow receptionist Doreen decides that, at fifty-eight, she wants a baby but is put off after a traumatic experience, whilst Barbara's husband Ted is relieved to discover he was not responsible for killing the man next door and Linda's journalist husband Martin's job as an investigative reporter...","production_code":"","runtime":30,"season_number":1,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-07-04","episode_number":2,"episode_type":"standard","id":1147969,"name":"Rivals","overview":"Barbara and Doreen find themselves competing for the attention of handsome young Dr Brown but when he clearly prefers to spend time with pretty computer operator Sandra they gang up on him. Martin,who now has his own TV spot Pondlife,finds himself an unwilling love object due to besotted weather girl Karen's obsession with his thumbs whilst Jean,though humiliated when boyfriend Phil gets into a public fight with a rival lollipop man,relents when he proposes to her. Taxi driver Ted gets his vehicle stolen by a Mr Spock impersonator but picks him out at the identity ...","production_code":"","runtime":30,"season_number":1,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-07-11","episode_number":3,"episode_type":"standard","id":1147970,"name":"Armour","overview":"Having been sacked as a hospital visitor for failing to notice when a patient passed out, Barbara is not in the best of moods, especially as Ted is out clubbing with his new young friends, so she is ready to take on the builders across the road who have been waking her up at unearthly hours. Meanwhile Doreen and her husband are cautioned for dogging, Martin gets stripped and tied to a parking meter on a friend's stag night and Jean's romance with Phil continues to run anything but smoothly.","production_code":"","runtime":30,"season_number":1,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-07-18","episode_number":4,"episode_type":"standard","id":1147971,"name":"Friends","overview":"Ted finds a salmon left in his cab so Barbara cooks it for tea but when the irate owner arrives demanding its return Ted buys another and pushes it through the letter box. Martin uses his TV spot to criticize Barbara after she insults him and Linda snubs her. However when Barbara learns that Linda is expecting she has to swallow her pride and apologize. Doreen's husband gets involved in a neighbourhood war over hose-pipe bans whilst Jean leaves Phil for a muffins entrepreneur.","production_code":"","runtime":30,"season_number":1,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-07-25","episode_number":5,"episode_type":"standard","id":1147972,"name":"Coffee","overview":"Jean returns to Phil but her obsession with his baldness leads Linda and Neil to believe that she is also bald and they try to prove it. A mix-up over an anorak wrongly picked up in the pub leads to Ted being arrested whilst Barbara regrets going for coffee with a lonely patient who falls in love with her. Meanwhile Martin gets stuck with his director's surly son on work experience and dumps the annoying boy by the roadside. However a bizarre coincidence solves both Barbara and Martin's problems.","production_code":"","runtime":30,"season_number":1,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"1999-08-01","episode_number":6,"episode_type":"finale","id":1147973,"name":"Scattering","overview":"Barbara drags the rest of the family to the Yorkshire moors to scatter her mother's ashes but no sooner has she begun the ritual than Linda's waters break. Everybody piles into the car to get her home but,as Martin has changed the locks,the baby is born at Barbara's - with Barbara already planning her grandson's life. Martin rushes to be with his wife,taking lifts from a taxi driver who loses his way and a woman said to be the worst driver in Britain.","production_code":"","runtime":30,"season_number":1,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":72767,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"56740b43c3a3685ede00240a","air_date":"2000-11-24","episodes":[{"air_date":"2000-11-24","episode_number":1,"episode_type":"standard","id":1147974,"name":"Kids","overview":"The new baby is giving Martin sleepless nights and he falls asleep on air,getting him the sack. In frustration he punches an irritating clown at a children's party but is reinstated as all his would-be replacements are terrible. Doreen gets an indecent proposal and Neil is embarrassed by his aggressive,beer-swilling girlfriend whilst Barbara is persuaded by Ted to join him in a parachute jump and literally ends up with one foot in the grave.","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-12-01","episode_number":2,"episode_type":"standard","id":1147975,"name":"Massage","overview":"When Barbara does her back in she does not take kindly to Ted hiring beefy Mrs Gibbs to do her cleaning and goes behind Neil's back to persuade his masseuse ex-girlfriend Kelly to give her a healing rub-down. Neil is not pleased and nor is Mrs Gibbs when Barbara refuses to pay for the aerial shots Mrs Gibbs' son took of the Liversidge house. Martin discovers that he has a stalker,who turns out to be a pensioner, whilst Jean overdoes the medication and sprouts facial hair.","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-12-08","episode_number":3,"episode_type":"standard","id":1147976,"name":"Mum","overview":"Ted's mother Queenie,who is even ruder and more outspoken than Barbara - whom she dislikes - comes to visit and makes it clear she wants to stay but changes her mind after Barbara has accidentally broken her nose, though it makes her more human. Mike,the anchor-man at Martin's TV station moves in with Linda and Martin and makes a pass at Linda,apologizing to Martin on air - which leads to a fight. Ted gives two robbers a lift to the airport without realising who they are - until the police arrive at the house","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-12-15","episode_number":4,"episode_type":"standard","id":1147977,"name":"Christening","overview":"Linda and Martin's baby's christening is not the most smooth running of affairs. Firstly Martin's divorced parents have a violent argument at Barbara's after the father has acquired a new young Thai bride. At the church Ted is shirtless, having been thrown up on by a hung-over Neil, who will repeat the trick in the font and Barbara is suffering from the effects of bad hairdressing. Martin himself only just makes it having got wedged in a child's ride, hiding from an obsessive fan. All it needs is for something to trigger off Phil's musical underpants.","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-12-22","episode_number":5,"episode_type":"standard","id":1147978,"name":"Tyres","overview":"Barbara resigns after being told patients complain of her rudeness but,having gone for interview at another practice with an equally acerbic receptionist,grovels for her old job back - and finds Doreen can also be rude. Ted becomes the Phone a Friend for a colleague on 'Who Wants to be a Millionaire?' but,after having to drive a man whose tyres Barbara has slashed by mistake to Scotland,nods off when the call comes. Martin,trying to emulate the dashing young investigative reporter next door, tries an aggressive approach to his interviews.","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2000-12-24","episode_number":6,"episode_type":"standard","id":1147979,"name":"Fox","overview":"Martin and Linda are not happy when Barbara offers to help mind the baby when Linda returns to work. Barbara is not happy when they tell her but following a domestic accident which she has caused it seems they might have a point. Ted is on his way to the local football ground in costume as their mascot Freddie the Fox when his car breaks down and he is pursued by a hunt whilst Phil's medication has bizarre side effects and Neil's efforts to have afternoon delight with an ex-con's wife are constantly thwarted.","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-23","episode_number":7,"episode_type":"standard","id":1148311,"name":"Sisters","overview":"With Doreen away Jean steps in to help Barbara at the surgery and is a great hit with the patients,organizing sing-songs and games but unfortunately she is so popular she attracts people who are not sick and the waiting room gets so crowded Barbara has to sack her. Cora,Linda's unstable boss,starts to date Neil and becomes so obsessed with his body Linda takes drastic action to split them up whilst Martin pays the price for challenging a group of Germans to a darts match with the losers having to pay a forfeit.","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-03-30","episode_number":8,"episode_type":"standard","id":1148312,"name":"Mate","overview":"Ted makes a new friend in the lonely but pushy and irritating Vernon who shares Ted's interest in metal detection but is constantly visiting the house,staying overnight and even crashing Martin and Linda's dinner party. But when he declares his love for Barbara enough is enough and out he goes. Linda and Martin look after his boss's dog but it runs off - and Vernon adopts it,calling it Barbara. Phil meanwhile has a dispute with an undertaker whose funeral procession he has halted at the school crossing.","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-04-06","episode_number":9,"episode_type":"standard","id":1148313,"name":"Wedding","overview":"Jean is get married to Phil but Barbara is not happy - this time because Ted's old flame Yvonne is back in town and he is spending a lot of time with her. Following a hen night outing where stripper Hercules turns out to be Neil and the departure of Yvonne the great day dawns though Martin and Linda only just make it after attending a grand opening at a supermarket - to which nobody turns up. Jean makes a spectacular entrance though and eventually makes it down the aisle,on a hospital trolley.","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2001-06-24","episode_number":10,"episode_type":"finale","id":1148314,"name":"Sheep","overview":"Ted and Barbara spend a day returning sheep dumped on them to the countryside but for Ted the real nightmare is dreaming that he is in bed with first Jean and then Doreen. Martin is afraid that Linda thinks he is a joke because his 'scoop' stories are so mundane but after he has given the kiss of life to a cocky decorator who has collapsed in the surgery waiting room he is declared a hero whilst Phil keeps doing his back in in the most embarrassing places.","production_code":"","runtime":30,"season_number":2,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":72780,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"56757a7ec3a3681685002da9","air_date":"2002-04-23","episodes":[{"air_date":"2002-04-23","episode_number":1,"episode_type":"standard","id":1148315,"name":"Queenie","overview":"Having been thrown out of yet another care home Queenie becomes an unwelcome guest at Ted and Barbara's house refusing to move out. However an unfortunate accident persuades Queenie that she is not wanted and decides to leave - though another one almost prevents her from going. Ted has a run-in with two transvestites,which spells humiliation for Jean,whilst Neil is unnerved by new girlfriend Isobel,who drops unsubtle hints about their wedding and even exposes him to the scrutiny of his potential in-laws.","production_code":"","runtime":30,"season_number":3,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"Policeman","credit_id":"56757b99c3a368168b002bef","order":500,"adult":false,"gender":2,"id":1551110,"known_for_department":"Acting","name":"Terry Gilligan","original_name":"Terry Gilligan","popularity":0.655,"profile_path":null},{"character":"Isobel","credit_id":"56757be5c3a3681683002d88","order":501,"adult":false,"gender":1,"id":1551112,"known_for_department":"Acting","name":"Helena Calvert","original_name":"Helena Calvert","popularity":0.6,"profile_path":null},{"character":"Mr. Stubbs","credit_id":"56757bf9c3a3681685002dd6","order":502,"adult":false,"gender":2,"id":41960,"known_for_department":"Acting","name":"Bernard Holley","original_name":"Bernard Holley","popularity":2.304,"profile_path":"/vwEkRzDRhgpodXjTVnp1yF4crMw.jpg"},{"character":"Mrs. Stubbs","credit_id":"56757c1092514179d4002e3e","order":503,"adult":false,"gender":0,"id":1238742,"known_for_department":"Acting","name":"Gay Soper","original_name":"Gay Soper","popularity":1.674,"profile_path":"/A1Y9Ho3emSrDyTW62MjlDbrjM91.jpg"},{"character":"Queenie Liversidge","credit_id":"5fee7fa260620a003f3fc03d","order":504,"adult":false,"gender":1,"id":1215202,"known_for_department":"Acting","name":"Jean Alexander","original_name":"Jean Alexander","popularity":1.544,"profile_path":"/sYTuyXRXcyDaSMKDy27szqXY8ny.jpg"}]},{"air_date":"2002-05-07","episode_number":2,"episode_type":"standard","id":1148316,"name":"Flood","overview":"Ted and Barbara put the house up for sale but,after a night of torrential rain,find that,like the rest of the street,they have been flooded out. This is not the best time for the carpet layer to turn up - or the couple viewing the house,though they are very positive despite the water. However after a night of reminiscing on old times Barbara and Ted decide to take the house off the market. Neil meanwhile meets an older woman,who turns out to be very controlling.","production_code":"","runtime":30,"season_number":3,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-11","episode_number":3,"episode_type":"standard","id":1148317,"name":"Valentine","overview":"It's midnight and soon Valentine's Day will dawn but Ted and Martin have both forgotten and a quick visit to the all-night garage yields extremely unsuitable presents for their spouses. Ted tries to make amends by buying a second hand caravan and taking Barbara to the Lake District but the trip ends in disaster, Linda suspects Martin of an affair with co-presenter Wendy though matters are resolved when Wendy gives Martin her true opinion of him - unaware that the cameras are still rolling.","production_code":"","runtime":30,"season_number":3,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-14","episode_number":4,"episode_type":"standard","id":1148318,"name":"Crime","overview":"When the area is hit by a spate of burglaries Barbara joins the Neighbourhood Watch and hosts them at her house but so annoys the chairman Mr Dugdale he expels her from the group. Then the lights go out and Mr Dugdale falls down,losing his false teeth and hearing aid and,whilst groping under the piano for them,finding something rather unpleasant. With Linda away Martin agrees to accompany Neil to a club where he is meeting his date but both the date and her friend are big fans of Martin 's TV spot and ignore Neil.","production_code":"","runtime":30,"season_number":3,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-21","episode_number":5,"episode_type":"standard","id":1148319,"name":"Weekend","overview":"After a trying day at work Barbara and Ted both decide to take early retirement but find themselves under each other's feet and with time on their hands so they decide to return to work,Ted making a mercy dash to help an extremely pregnant woman. Martin and Linda spend a weekend away with a very competitive couple,causing Linda to make up hidden talents for Martin,leading to a disastrous horse ride. Jean and Phil mind baby George in their absence but prove to be incompetent sitters and call for Barbara when they think they have lost the baby.","production_code":"","runtime":30,"season_number":3,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-05-28","episode_number":6,"episode_type":"finale","id":1148320,"name":"Baby","overview":"Linda and Martin have been trying for another baby without success - though Martin is more pleased about this than Linda, but nonetheless agrees to go with her to investigate I.V.F. treatment. Barbara decides it is time for Neil to move out but is not keen for him to be living in his girlfriend's dirty flat and once more starts to interfere. Jean is having trouble with her breast implants and when one of them explodes has to be rushed to hospital in an ice cream van.","production_code":"","runtime":30,"season_number":3,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":72830,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"56757c36c3a3681689002c1b","air_date":"2003-02-23","episodes":[{"air_date":"2003-02-23","episode_number":1,"episode_type":"standard","id":1148321,"name":"Honeymoon","overview":"To celebrate their fortieth wedding anniversary Ted takes Barbara to Scarborough,where they spent their original honeymoon. Unfortunately he also takes her to the run-down B & B where they spent the honeymoon,rather than the luxury hotel for which Barbara was hoping. In revenge she decides to party the night away with a visiting football team but next morning she and Ted end up in hospital when part of the hotel slides down the cliff in subsidence,taking them with it.","production_code":"","runtime":30,"season_number":4,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-02","episode_number":2,"episode_type":"standard","id":1148322,"name":"Neighbours","overview":"Christmas is coming but due to Barbara's abrasive manner the Liversidges are not getting many cards. Then Barbara gets it into her head that cheery new neighbours Angela and Norman are stealing her Christmas tree and poinsettia and her efforts to retrieve them lead to friction with Ted. Martin and Linda turn up as Martin's surfeit of Christmas lights has blown all the fuses in the house and left them in the dark. Thus there are two quarrelling couples spending Christmas under the same roof.","production_code":"","runtime":30,"season_number":4,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-09","episode_number":3,"episode_type":"standard","id":1148323,"name":"Guy Fawkes","overview":"Ted and Barbara go to offer their sympathies to his friend Frank,whose wife Edna has recently died and discover that Ted has taken up taxidermy and had Edna stuffed. They invite Ted to their bonfire night party and he brings Edna but Linda mistakes her for the guy and puts her on the fire. Ted lets off a big firework which destroys the new shed that Linda has bought him along with the purchases that Jean,who has become addicted to online shopping,is hiding in it from Phil.","production_code":"","runtime":30,"season_number":4,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-16","episode_number":4,"episode_type":"standard","id":1148324,"name":"Kirsty","overview":"Barbara and Ted return from holiday,Ted having broken his leg retrieving their luggage from the airport carousel. They find Neil head over heels in love with pizza delivery girl Kirsty,even though she is bossy and - to Barbara's mind - dirty. Martin has been having a run of bad luck and is surprised to meet his ex-girlfriend,who just happens to be Kirsty. Kirsty is still very much in love with Martin and decides that she cannot love another so she dumps Neil - much to Barbara's relief.","production_code":"","runtime":30,"season_number":4,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-28","episode_number":5,"episode_type":"standard","id":1148325,"name":"Cottage","overview":"To celebrate Barbara's sixtieth birthday the family,with Doreen,head off for a country cottage for the weekend,only to find it double-booked and somebody else in residence. At Martin's suggestion they decide to go to a nearby hotel but the van breaks down in the dark in the middle of nowhere. Ted and Martin go for help but,after Martin has fallen into a ditch,get robbed by Bazza and Oz,two locals with whom they hitched a lift. If only Doreen had remembered to tell everybody that she had her mobile phone in her bag all the time.","production_code":"","runtime":30,"season_number":4,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-04","episode_number":6,"episode_type":"finale","id":1148326,"name":"Who Shot Barbara?","overview":"Barbara rows with Ted,accusing him of spending too much time doing DIY for Neil's girlfriend's mother,an old flame of his. She also falls out with Linda and Martin after she baby-sits for them and accidentally sets their kitchen on fire. Neil is unhappy with her when she frightens his girlfriend off and,needless to say,she is not popular with the patients at the surgery or anybody in the street. So...who shot her in the bottom with an air-rifle?","production_code":"","runtime":30,"season_number":4,"show_id":817,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":72831,"poster_path":null,"season_number":4,"vote_average":0}}}