{"adult":false,"backdrop_path":"/3jUPFwHxej9KmXXLGzfoSv7quaZ.jpg","created_by":[],"episode_run_time":[60,43],"first_air_date":"2008-11-07","genres":[{"id":99,"name":"Documentary"},{"id":10764,"name":"Reality"}],"homepage":"http://animal.discovery.com/tv/whale-wars/","id":8183,"in_production":false,"languages":["en"],"last_air_date":"2015-01-02","last_episode_to_air":{"id":1288677,"name":"The Darkest hour","overview":"The Yushin Maru No.3 has just collided with the Bob Barker (for the second time in almost exactly four years, the first time being during Operation Waltzing Matilda on February 6th, 2010). Crew rush below check the damage, which they find is just badly bent steel ribs, but no water entering the hull. As the Steve Irwin and Bob Barker race towards the Nisshin Maru's last known coordinates, the Sea Shepherds send video of the collision to the media. From his undisclosed location, Captain Paul Watson watches what happened on his laptop. He admits that the whalers more becoming more aggressive because they see that their days are numbered and also worried about the case brought against them in the International Court of Justice. Back in the Antarctic, the Nisshin Maru run into a storm to hide from the Sea Shepherds. Captain Peter calls Captain Sid to send the helicopter out, which does find the factory ship turning due east. The Bob Barker turns to intercept and soon finds the Nisshin within three hours. The harpoon ships are also there, but they don't turn to defend their mothership. Instead, the whalers wait until nightfall to engage the Barker. Both small boats (Gemini and Hunter) are lowered into the water and engage two of the harpoon ships (Yushin Maru and Yushin Maru No.3). They first try to cut the steel cables the Yushins are towing to prop foul the Barker, but don't succeed. So they drop prop foulers of their own to buy time. Soon the Nisshin slips away off the Barker's radar and Peter calls for the boats to return to the ship. As Operation Relentless comes to a close, the Sea Shepherds head back to port. On March 31st, 2014, the International Court of Justice (ICJ) ruled that the Japan's Antarctic whale research program (JARPA II) was not for scientific research and that their operations are illegal. After ten years of fighting, the Sea Shepherds celebrate their greatest victory to date. The whalers this season only killed 271 whales, falling 784 short of their total quota of 1,035. Captain Paul Watson was happy with the ICJ's decision and learned that Japan said it would abide by the ruling. But Paul is convinced that the Japanese whalers want their revenge and will do everything they can to keep going down to Antarctica to kill whales. He made clear if the whalers ever return, Sea Shepherd will be there to stop them.\n\nThe following year (2014-2015), Japan sent two of its whaling ships on a non-lethal survey in the Southern Ocean Whale Sanctuary. Sea Shepherd admitted the whalers were planning ahead to return to killing whales. The whalers released a new program called NEWREP-A, which calls for the killing of 333 minke whales (no more fin whales or humpback whales will be killed) every year for the next 12 years (until 2027-2028). In 2015-2016, as Sea Shepherd conducted other campaigns around the world, the whalers did return and killed 333 minke whales (103 male and 230 female, 90% of the females were pregnant). Sea Shepherd announced the construction of a brand-new interceptor vessel they named Ocean Warrior due to be completed by September 2016. Most likely it will be sent to the Antarctic to confront the Japanese whaling fleet for the 2016-2017 whaling season. No announcements have been made if the Steve Irwin, Bob Barker, Brigitte Bardot, or Sam Simon will return to battle the whalers.","vote_average":0,"vote_count":0,"air_date":"2015-01-02","episode_number":3,"episode_type":"finale","production_code":"","runtime":null,"season_number":7,"show_id":8183,"still_path":null},"name":"Whale Wars","next_episode_to_air":null,"networks":[{"id":91,"logo_path":"/m3KrDu1g96YByhH0wp4OvyghgsG.png","name":"Animal Planet","origin_country":"US"}],"number_of_episodes":55,"number_of_seasons":7,"origin_country":["US"],"original_language":"en","original_name":"Whale Wars","overview":"Whale Wars is a weekly American documentary-style reality television series that premiered on November 7, 2008 on the Animal Planet cable channel. The program follows Paul Watson, founder of the Sea Shepherd Conservation Society, as he and the crew aboard their various vessels harass Japanese whalers off the coast of Antarctica. On January 5, 2013, Animal Planet renewed the series for a sixth season.","popularity":14.904,"poster_path":"/a7beVCFewYQIRedMPRUr6RrHiiG.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2009-01-01","episode_count":9,"id":18205,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2008-11-07","episode_count":7,"id":18202,"name":"Season 1","overview":"","poster_path":"/blzO1omp3TTbA9zRiBdATIVdCQo.jpg","season_number":1,"vote_average":0},{"air_date":"2009-06-05","episode_count":11,"id":18203,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2010-06-04","episode_count":15,"id":18204,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0},{"air_date":"2011-06-03","episode_count":10,"id":18206,"name":"Season 4","overview":"","poster_path":null,"season_number":4,"vote_average":0},{"air_date":"2012-06-01","episode_count":8,"id":18207,"name":"Season 5","overview":"","poster_path":null,"season_number":5,"vote_average":0},{"air_date":"2013-12-13","episode_count":1,"id":86290,"name":"Season 6","overview":"A Commander Rises","poster_path":null,"season_number":6,"vote_average":0},{"air_date":"2015-01-02","episode_count":3,"id":86289,"name":"Season 7","overview":"","poster_path":null,"season_number":7,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Canceled","tagline":"","type":"Reality","vote_average":7.333,"vote_count":9,"season_data":{"1":{"_id":"52579024760ee36aaa6c5f13","air_date":"2008-11-07","episodes":[{"air_date":"2008-11-07","episode_number":1,"episode_type":"standard","id":394448,"name":"Needle in a Haystack","overview":"Paul Watson is allegedly shot by the Japanese whaling crew during a confrontation between the whaling factory ship Nisshin Maru and the Sea Shepherd vessel MV Steve Irwin. The episode then flashes back to the maiden launching and departure of the vessel from homeport three months earlier.","production_code":"","runtime":null,"season_number":1,"show_id":8183,"still_path":"/3F5sXxmylTQhvX83XRws6B5F39x.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-14","episode_number":2,"episode_type":"standard","id":394450,"name":"Nothing's Ideal","overview":"After weeks of searching, the Sea Shepherds finally spot a Japanese whaling ship, the harpoon vessel Yushin Maru #2. Captain Paul Watson devises a dangerous plan for two of his crew members to board the vessel and deliver a letter telling them to stop the killing of whales. He hopes to create an international incident, but his plan sparks a safety debate that divides the crew. Two volunteers enlist for the mission — Ben Potts and Giles Lane — and the crew braces for the worst as the men jump over the railing of the enemy ship. They are immediately tied up by the Japanese fishermen, and the Yushin speeds away with the two Shepherds still aboard.","production_code":"","runtime":null,"season_number":1,"show_id":8183,"still_path":"/rnLuRsxxARplJF7ZiEGNDRM4dP2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-21","episode_number":3,"episode_type":"standard","id":394446,"name":"International Incidents R Us","overview":"Without negotiation and confrontation with the MV Steve Irwin, the Yushin Maru № 2 agreed to transfer Pottsy and Giles to a government ship that would then meet with the Steve Irwin at a rendezvous point to return the two members. 1st Mate Peter Brown decides to launch an attack on the Yushin Maru № 2 at dusk. Four crewmembers are sent on the Zodiac inflatable boat Delta to carry out the risky mission. After losing radio contact with them, recon pilot Chris Aultman, who was sent too late to survey the situation, reports that they are heading in the wrong direction and must return as night falls. The lone Delta was feared to be forever lost out in the middle of the dark, frigid, vast Antarctic Ocean. Fortunately, contact was finally made with the Delta, which eventually returns to the MV Steve Irwin over two hours later and behind schedule to retrieve Pottsy and Giles.","production_code":"","runtime":null,"season_number":1,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-11-28","episode_number":4,"episode_type":"standard","id":394451,"name":"We Are Hooligans","overview":"Giles Lane and Ben Potts safely return to the MV Steve Irwin. The crew then discovers that an unknown ship, allegedly spying for the Japanese whaling fleet, has been following them, decides to recon it from behind a tabletop iceberg for any military personnel aboard, and temporarily drives it away after seeing no sign of illegal military activity. The crew later plans to ambush the mystery ship, soon identified as the Fukuyoshi № 68, to prevent information about the Steve Irwin's whereabouts from being given to the rest of the whaling fleet. They plan to do this by boarding the vessel and sabotaging its communication equipment, shutting off any communication with anyone. Before the mission, a hydraulic crane used to launch the motor rafts somehow got damaged, jeopardizing the Sea Shepherd's mission.","production_code":"","runtime":null,"season_number":1,"show_id":8183,"still_path":"/g50eXdfhbXUqTifcR1GYU0TJREJ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-05","episode_number":5,"episode_type":"standard","id":394447,"name":"Doors Slamming and Things Breaking","overview":"The MV Steve Irwin experiences several technical difficulties, including a damaged engine, hydraulic crane, and helicopter. Running on only one engine, the ship must return to port at Melbourne, Australia to make repairs while the whaling continues. Some crewmembers decide to party and leave the operation. Upon arrival, they were welcomely greeted and cheered by the citizens, and by the police. Pottsy and Giles become instant celebrities on homecoming. After recruiting new members, the crew travels without its recon chopper and returns to the Southern Ocean only to find that the suspicious ship is still following them.","production_code":"","runtime":null,"season_number":1,"show_id":8183,"still_path":"/22W2v2bek2Um8cm3ecr5WOy0ti7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-12","episode_number":6,"episode_type":"standard","id":394445,"name":"Ladies First","overview":"After noticing that the suspicious ship Fukuyoshi Maru № 68 has found and followed the MV Steve Irwin again, Watson unsuccessfully attempts to send four female crewmembers to board the vessel to deliver a warrant. This leads to a man's injured thumb and a woman's injured pelvis (Incidents not related). The Steve Irwin detects the Nisshin Maru on radar. At dusk, the entire ship experiences a power outage, leaving it drifting through an iceberg field without operating engines.","production_code":"","runtime":null,"season_number":1,"show_id":8183,"still_path":"/nPUVbC9LU6NJZRBPWcWqJxuDwaA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2008-12-19","episode_number":7,"episode_type":"finale","id":394449,"name":"Boiling Point","overview":"After power was restored to part of the ship, the MV Steve Irwin finally finds, follows, and comes face to face two times with the Japanese whaling factory ship Nisshin Maru, which Watson considers the \"most evil\" vessel in international waters. A pod of whales swims between the two \"warring\" ships, which eventually engage in a ship-to-ship \"battle.\" The captain of the Nisshin Maru warned on a recorded message sent multiple times through a horn that \"If you dare board this vessel, you will be taken into custody.\" Recruited Sea Shepherds are the first to strike, throwing stink bombs with Butyric acid onto the decks of the Nisshin Maru, which dwarfed the Steve Irwin in size, while its crew watches and films the Steve Irwin. The Japanese whalers claim that three of their crewmembers were injured by the stink bombs. When the two ships meet the second time, the Steve Irwin crew strikes first again while the Nisshin Maru crew, in return, threatens to use tear gas grenades and throws flash bombs. Watson fishes a metallic fragment from his vest and claims to have been shot. As Watson concluded that the second leg of the mission was successful, the Sea Shepherds claimed that they have saved about 500 whales. The Steve Irwin returns to Melbourne again before running out of fuel.","production_code":"","runtime":null,"season_number":1,"show_id":8183,"still_path":"/9igAP7ZbM1Ing6I4Y3O4BwkFdN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":18202,"poster_path":"/blzO1omp3TTbA9zRiBdATIVdCQo.jpg","season_number":1,"vote_average":0},"2":{"_id":"52579024760ee36aaa6c5f21","air_date":"2009-06-05","episodes":[{"air_date":"2009-06-05","episode_number":1,"episode_type":"standard","id":394458,"name":"The Sound of Ice","overview":"The series starts with a dramatic encounter with the Japanese Whaling fleet. The episode then flashes back to the maiden launching and departure of the vessel from homeport three months earlier. Paul Watson and the Sea Shepherds head back down to Antarctica for what promises to be their most intense anti-whaling campaign yet. However, no sooner does the ship leave port than the ship's Gyro breaks and they hit a massive storm the size of Australia","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-12","episode_number":2,"episode_type":"standard","id":394459,"name":"The Flexibility of Steel","overview":"A huge weather system moves in and the Steve Irwin is forced to take shelter behind a large iceberg. By morning, they are surrounded by ice so thick they can no longer move. The ice begins to push against the aging ship's fragile hull, denting it inwards.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-19","episode_number":3,"episode_type":"standard","id":394460,"name":"As Bad As Our Bark","overview":"The Sea Shepherd gather intel on the fleet's location, they realize that they are low on fuel. As they weigh whether or not to head back to port, they come across the entire Japanese fleet searching for one of their crewmembers that has fallen overboard.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-06-26","episode_number":4,"episode_type":"standard","id":394461,"name":"Yum Yum, Eat Crow","overview":"The Sea Shepherds have come across the entire Japanese fleet searching for one of their crewmembers that fell overboard. Paul orders his crew to stand down, and they agonize over being so close to their target, yet unable to attack.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-10","episode_number":5,"episode_type":"standard","id":394462,"name":"The Unintimidatables","overview":"The Steve Irwin is quarantined in Hobart and the crew anxiously waits to find out if they have been exposed to Anthrax. Finally they get the all clear and 1st mate Peter Brown wastes no time leaving the ship after having quit the campaign.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-17","episode_number":6,"episode_type":"standard","id":394452,"name":"With a Hook","overview":"Surrounded by the Japanese whaling fleet, the Sea Shepherds ready themselves for their biggest day of battle to date on the campaign. Helicopter pilot Chris flies up and confirms the crew's fears - all of the whaling vessels are equipped with LRAD weapons.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-24","episode_number":7,"episode_type":"standard","id":394453,"name":"The Desire to Fling Things","overview":"Captain Watson is in pursuit of the Nisshin Maru when all three Japanese harpoon ships suddenly appear on out of the fog. The Sea Shepherds are completely outnumbered.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-07-31","episode_number":8,"episode_type":"standard","id":394454,"name":"Bait and Switch","overview":"As the Sea Shepherds prepare for their fourth straight day of engagement with the Japanese whaling fleet, Andy and Simon argue with Dan over the best strategy for attack.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-07","episode_number":9,"episode_type":"standard","id":394455,"name":"Crazy Ivan","overview":"Low on fuel, the small boats head toward the Steve Irwin, but in order to get them on board safely, Paul must employ a dangerous military strategy, \"The Crazy Ivan,\" circling at a high speed to try and create calm water for the little boats to return.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-14","episode_number":10,"episode_type":"standard","id":394456,"name":"The Stuff of Nightmares","overview":"The Sea Shepherds shock turns to fury when the Japanese fleet pulls a dead whale onto Nisshin Maru for slaughter. Paul Watson instructs the crew to prepare for battle.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2009-08-21","episode_number":11,"episode_type":"finale","id":394457,"name":"Overlooking a Forlorn Shore","overview":"Season Finale.The Sea Shepherds continue to attempt to disrupt the whaling fleet's operations. When the Yushin 3 tries to transfer a dead whale to the Nisshin Maru, Captain Watson maneuvers his ship to block the transfer resulting in a full-speed collision.","production_code":"","runtime":null,"season_number":2,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 2","overview":"","id":18203,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"52579024760ee36aaa6c5f2c","air_date":"2010-06-04","episodes":[{"air_date":"2010-08-27","episode_number":0,"episode_type":"standard","id":394477,"name":"Vendetta","overview":"The former captain of the Ady Gil goes for a boarding attempt and one of the Sea Shepherd vessels goes dead in the water.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-04","episode_number":1,"episode_type":"standard","id":394474,"name":"Surrounded by Spies","overview":"The Sea Shepherds embark on another dangerous campaign as whaling season begins in the Antarctic; a donation from former game-show host Bob Barker allows the group to purchase a former Norwegian whaling vessel.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-11","episode_number":2,"episode_type":"standard","id":394468,"name":"Crossing Danger","overview":"A Japanese reconnaissance ship pursues the Steve Irwin; two members of the Andy Gil crew suffer illness and injury; the Bob Barker's engine fails two days into its journey.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-18","episode_number":3,"episode_type":"standard","id":394476,"name":"From Hell's Heart","overview":"The Sea Shepherds have been relentlessly followed by the whaling reconnaissance vessel for two weeks. They find themselves in a full-on engagement on the high seas as Captain Paul Watson orders a massive butyric acid bottle attack on his nemesis.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-06-25","episode_number":4,"episode_type":"standard","id":394469,"name":"Stealth Attack","overview":"The Sea Shepherd's stealth boat, the Ady Gil, launches a sneak attack on the Japanese whaling reconnaissance vessel in an effort to break free of the tail and find the rest of the whaling fleet.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-09","episode_number":5,"episode_type":"standard","id":394475,"name":"The Thrill of the Chase","overview":"After nearly a month of searching, the Sea Shepherds have finally found their ultimate target: the world's only whale factory ship, the Nisshin Maru.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-16","episode_number":6,"episode_type":"standard","id":394472,"name":"Sliced In Two","overview":"At the bottom of the world, a collision has just devastated one of the Sea Shepherds' vessels. The crew on the other vessel stand helpless on their deck, watching in horror as the Japanese vessel barrels through the Sea Shepherds' prized speedboat.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-23","episode_number":7,"episode_type":"standard","id":394473,"name":"Revenge Is Mine","overview":"In the aftermath of the devastating loss of their stealth vessel, the Sea Shepherds have returned to the campaign with renewed passion and intensity. Now the two remaining ships are back on the hunt for the Japanese fleet.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-07-30","episode_number":8,"episode_type":"standard","id":394465,"name":"Ready To Snap","overview":"With low oil and drinking water, and a damaged helicopter, the Sea Shepherds' hunt for the Japanese whaling fleet has been brought to a halt. While on their way back to port, the radar shows two colossal storms that they can't avoid.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-06","episode_number":9,"episode_type":"standard","id":394466,"name":"A Bloody Trail","overview":"As the Sea Shepherds approach the Nisshin Maru, they are suddenly surrounded by four whaling vessels. Suddenly, one of the Japanese vessels moves in dangerously close, and as the deck crew quickly braces themselves, the ships violently collide.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-13","episode_number":10,"episode_type":"standard","id":394467,"name":"Zero Hour","overview":"The Sea Shepherds refuse to be bullied by the Japanese fleet even though they're out numbered. The deckhands repel over the side of the ship to assess the damage from the collision and realize that there is a gash in the steel hull and water is pouring in.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-20","episode_number":11,"episode_type":"standard","id":394471,"name":"Fire in the Sky","overview":"The whalers face new attacks from the Sea Shepherds as they mount an attack with both the Bob Barker and Steve Irwin.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-27","episode_number":12,"episode_type":"standard","id":394464,"name":"Vendetta","overview":"The former captain of the Ady Gil goes for a boarding attempt and one of the Sea Shepherd vessels goes dead in the water.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-08-27","episode_number":13,"episode_type":"standard","id":394463,"name":"To the Ends of the Earth","overview":"The whalers attempt to lose their attackers in an ice field.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2010-09-03","episode_number":14,"episode_type":"finale","id":394470,"name":"From Pirate to Prisoner","overview":"Pete Bethune recounts his experience aboard the Japanese security vessel.","production_code":"","runtime":null,"season_number":3,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":18204,"poster_path":null,"season_number":3,"vote_average":0},"4":{"_id":"52579025760ee36aaa6c5f42","air_date":"2011-06-03","episodes":[{"air_date":"2011-06-03","episode_number":1,"episode_type":"standard","id":394487,"name":"Battle Cry","overview":"The Sea Shepherds depart on their 2010/2011 ant-whaling campaign with a new, fast interceptor vessel. Early on, they find two harpoon ships before the whaling fleet has killed a single whale. Could they be set up for their most successful campaign ever?","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-10","episode_number":2,"episode_type":"standard","id":394488,"name":"No Escape","overview":"After engaging the harpoon ships using the small boat teams, Captain Paul Watson makes the call to abandon the harpoon ships and go in search of the factory vessel. After a few hours of sailing, the tables have turned — two harpoon ships begin tailing Sea Shepherd!","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-17","episode_number":3,"episode_type":"standard","id":394489,"name":"Ghosts in the Machine","overview":"Tailed by a harpoon ship, the Steve Irwin enlists the help of the Sea Shepherds' new, fast interceptor ship in an attempt to break free. Meanwhile, the Bob Barker crew spots a large blip on their radar and believe it could be their ultimate target: the Nisshin Maru.","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-06-24","episode_number":4,"episode_type":"standard","id":394491,"name":"The Devil's Icebox","overview":"When damage happens to one of the small boats, and the Bob Barker is five hours away, the crew realizes that they will have to spend a night at sea. But the crew is wet and freezing already, and early symptoms of hypothermia begin to set in.","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-08","episode_number":5,"episode_type":"standard","id":394490,"name":"Tracking the Enemy","overview":"The Bob Barker desperately searches for their two small boat crews who were lost at sea in the aftermath of a daring mission. Meanwhile, the Gojira locates the whalers' refueling vessel and Locky plays a dangerous game of \"chicken\" with the massive ship.","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-15","episode_number":6,"episode_type":"standard","id":394493,"name":"Race to Save Lives","overview":"New Zealand's Navy contacts the Steve Irwin to respond to an emergency distress signal where five crew members from a Norwegian sailboat have gone missing. Now the Sea Shepherds must risk their lives in a dangerous mission to find the missing mariners.","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-22","episode_number":7,"episode_type":"standard","id":394494,"name":"Enemy In Their Grasps","overview":"As the first leg of their campaign comes to a close, the Sea Shepherds battle physical and mental exhaustion, especially pilot Chris Aultman. Thanks to an anonymous tip, the Steve Irwin finally locates the whalers' factory ship, the Nisshin Maru.","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-07-29","episode_number":8,"episode_type":"standard","id":394492,"name":"Battle Stations","overview":"The Bob Barker and Gojira launch an ambitious assault on the harpoon ship that has been following them and manage to completely disable the whaling vessel. Now free of its tail, the Barker continues searching for their ultimate target, the Nisshin Maru.","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-05","episode_number":9,"episode_type":"standard","id":394496,"name":"The Giant Enemy","overview":"The Sea Shepherds finally locate the factory vessel after months of searching, but it promptly tries to evade the Gojira.","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2011-08-12","episode_number":10,"episode_type":"finale","id":394495,"name":"Delivering the Final Blow","overview":"In the fourth-season finale, Watson claims a major victory after 30 years of fighting, while he and the crew reaffirm their commitment to stopping the whaling fleet.","production_code":"","runtime":null,"season_number":4,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 4","overview":"","id":18206,"poster_path":null,"season_number":4,"vote_average":0},"5":{"_id":"52579025760ee36aaa6c5f4d","air_date":"2012-06-01","episodes":[{"air_date":"2012-06-01","episode_number":1,"episode_type":"standard","id":394497,"name":"Setting the Trap","overview":"In the Season 5 premiere, the Sea Shepherd Conservation Society responds to Japan's 2011 announcement to resume its whaling operations in the Antarctic and the government's promise to beef up the fleet's security.","production_code":"","runtime":null,"season_number":5,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-08","episode_number":2,"episode_type":"standard","id":394498,"name":"Games of Chance","overview":"A plan to intercept the whaling fleet before it reaches the whaling grounds is nearing a critical point. The new helicopter pilot, Gary, spots a ship on the horizon; If it is the whalers' factory ship, this may be Sea Sheparhd's the earliest victory ever.","production_code":"","runtime":null,"season_number":5,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-15","episode_number":3,"episode_type":"standard","id":394499,"name":"Dead in the Water","overview":"The Sea Shepherds' scout vessel, the Brigitte Bardot is damaged by a 30-foot wave, and help is more than 20 hours away.","production_code":"","runtime":null,"season_number":5,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-22","episode_number":4,"episode_type":"standard","id":394500,"name":"Into the Belly of the Beast","overview":"With the Japanese fleet's security vessel looming on the horizon, the captain of the badly damaged Brigitte Bardot orders his crew to evacuate the boat. Meanwhile, in Antarctica, the Bob Barker deploys the small boats team to disable a harpoon ship.","production_code":"","runtime":null,"season_number":5,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-06-29","episode_number":5,"episode_type":"standard","id":394501,"name":"Crossing the Line","overview":"The exhausted crew of the Brigitte Bardot scramble to evacuate the ailing vessel. And Captain Paul Watson goes on the offensive, sending a team to board the heavily armed security vessel: the Shonan Maru.","production_code":"","runtime":null,"season_number":5,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-06","episode_number":6,"episode_type":"standard","id":394502,"name":"Never Say Die","overview":"With three activists aboard the Japanese security vessel, Capt Paul Watson hopes the media frenzy will force the Shonan Maru 2 to back off. Meanwhile, the crew of the Steve Irwin are plunged into their most violent battle yet.","production_code":"","runtime":null,"season_number":5,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-13","episode_number":7,"episode_type":"standard","id":394504,"name":"Counterstrike","overview":"When a massive target is detected on their radar, Sea Shepherd sends out their new helicopter pilot to ID the mystery vessel. But as the helicopter reaches the limits of its fuel range, it abruptly disappears, crashing into radio silence.","production_code":"","runtime":null,"season_number":5,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2012-07-20","episode_number":8,"episode_type":"finale","id":394503,"name":"Target Acquired","overview":"After months of frustration, Sea Shepherd finally find their target - the Nisshin Maru. Now, they must run an eight-mile gauntlet blocked by two harpoon ships aggressively defending their mother ship. The success of the campaign rides on this moment.","production_code":"","runtime":null,"season_number":5,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 5","overview":"","id":18207,"poster_path":null,"season_number":5,"vote_average":0},"6":{"_id":"58cadcf4c3a36828aa00138f","air_date":"2013-12-13","episodes":[{"air_date":"2013-12-13","episode_number":1,"episode_type":"finale","id":1288675,"name":"A Commander Rises","overview":"The Sea Shepherds face a difficult 2013 campaign with the Brigitte Bardot and their helicopter unavailable. The fleet introduces a new ship, the Sam Simon. Former captain of the Steve Irwin, Paul Watson, is forced to step down due to an injunction preventing him from coming within 500 yards of Japanese whaling fleet. All four of the fleet's main ships feature a new captain, with Watson serving as an observer.\n\nThe Steve Irwin remains to coordinate the operation. The Bob Barker is sent to search for the whaling fleet and finally locates the Nisshin Maru near the western edge of the whaling ground. However, they sit helplessly as the Japanese successfully kill and load a whale onto the factory ship. The Sam Simon is sent to search for the bunker ship Sun Laurel and finally locates it along with 2 Japanese whaling ships. They attempt to block the refueling, but fail when the rookie captain pulls away, not willing to risk his crew. After hunting, the Nisshin Maru turns east. Realizing that the factory ship is trying to also refuel, the Sea Shepherds send all their ships to interfere. 30 hours later, the ships prepare for the showdown. The 500-tons Bob Barker blocks the 5000-tons Nisshin Maru by parking right next to the Sun Laurel. The Japanese warns the Bob Barker to move but captain Peter Hammarstedt refuses to comply. The Nisshin Maru then pushes the Bob Barker with their bow, damaging the ship and causing it to list dangerously. After a standoff, the Nisshin Maru backs away while the Sun Laurel abandons the operation. Days later, the whaling fleet leaves for Japan with only 103 kills.","production_code":"","runtime":null,"season_number":6,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 6","overview":"A Commander Rises","id":86290,"poster_path":null,"season_number":6,"vote_average":0},"7":{"_id":"58cadc51c3a3682889001364","air_date":"2015-01-02","episodes":[{"air_date":"2015-01-02","episode_number":1,"episode_type":"standard","id":1288673,"name":"The Devil's Den","overview":"The Sea Shepherds kickoff their 10th anti-whaling campaign in the Antarctic (Operation Relentless). As the long range icebreaker Bob Barker gets underway, Captain Peter Hammarstedt knows that the Japanese whalers most likely will be more aggressive than ever (he reflects on last year's campaign, Operation Zero Tolerance, when on February 20th, 2013, the Nisshin Maru rammed the Bob Barker and nearly capsized it while attempting to refuel from its bunker ship, the Sun Laurel). But this year, the Sea Shepherds are going on this campaign without their founder, Captain Paul Watson (who's back on land in an undisclosed location). So leading this campaign will be Captain Peter Hammarstedt, while Captain Sid Chakravarty commands the Steve Irwin, and commanding the Sam Simon is an American, Adam Meyerson. The Steve Irwin and Bob Barker will be patroling in the Ross Sea (Captain Peter is taking a gamble that the whalers will only be in this area and avoid Australia-Antarctic territorial waters because at the same time the campaign is going on, the International Court of Justice is reviewing an action against the Japanese whalers by the Australian government, challenging the claim that the whalers are doing scientific research), while the Sam Simon during this campaign will remain in a holding pattern 400 miles due north of Ross Sea acting as a refueling vessel. Three days into the whaling season, the Steve Irwin's new helicopter nicknamed \"Sea Wasp\", spots the factory ship Nisshin Maru and one of the three Yushin Maru harpoon ships. Unfortunately, the Nisshin's flensing deck is covered in red and has three minke whales on its deck, meaning four whales are dead. The Bob Barker is only 30 miles away and immediately heads for the factory ship as the helicopter heads back to the Steve Irwin. But in his rush, Captain Peter pushes the Barker's aging engine beyond its limits, and is forced to stop down as the Nisshin gets away. Meanwhile, the Irwin encounters the security ship Shonan Maru No.2 (the same ship that rammed the speedboat Ady Gil four years earlier). The small boats Delta and Humber engage the Shonan by first trying to plug the water cooling vents, but that doesn't work. So they drop prop fouler lines and stop the Shonan, allowing the Irwin to escape.","production_code":"","runtime":null,"season_number":7,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-02","episode_number":2,"episode_type":"standard","id":1288676,"name":"Fight to the Death","overview":"The Steve Irwin manages to escape from the whalers security ship, Shonan Maru No.2, but soon the Shonan tracks the Irwin down and tails it again. Meanwhile, the Sam Simon lies in wait 400 miles due north of the entrance to the Ross Sea. Its primary job to function as a refueling vessel, so unless the Irwin or Barker need to be refueled, the Simon stays where it is. To the southeast, the Bob Barker sits dead in the water after Captain Peter Hammarstedt pushed the engine too hard. Suddenly, a ship appears on the Barker's radar making 15 knots. The bridge crew debates that if this ship is a harpoon ship, it should go faster. But the Nisshin Maru's top speed is about 15 knots, so Captain Peter thinks the Nisshin is coming towards him. The engine is operational again, but Peter orders that they sit and wait in the fog. All of a sudden, the Yushin Maru No.3 appears and starts to tail the Barker. Peter calls Captain Sid Chakravarty on the Irwin and tells him to send the helicopter (\"Sea Wasp\") out. The Sea Wasp spots the Nisshin and the other two Yushins. Soon the Barker catches up with the Nisshin, and soon the Irwin joins them. By February 1st, 2014, the Sea Shepherds have been tailing the Nisshin for one full week. Suddenly, all three harpoon ships get behind the Sea Shepherds, looking like they're getting ready to launch an attack to get them off the Nisshin's tail. Captain Peter states that the Yushins attacking the Sea Shepherds in bad weather is something that he and his comrades have not prepared for. He orders one of the Barker's boats, the Gemini, into the water to cut the steel cables the Yushins are towing. After several failed attempts to cut the cables, the Gemini's crew decides to back off because the weather is too rough. Captain Peter tries to hail the Gemini on the radio, but the boat crew refuses to answer him. The Nisshin soon slips out of both visual and radar range. Suddenly, the Yushin Maru No.3 closes in on the Barker's starboard side and collides with it.","production_code":"","runtime":null,"season_number":7,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2015-01-02","episode_number":3,"episode_type":"finale","id":1288677,"name":"The Darkest hour","overview":"The Yushin Maru No.3 has just collided with the Bob Barker (for the second time in almost exactly four years, the first time being during Operation Waltzing Matilda on February 6th, 2010). Crew rush below check the damage, which they find is just badly bent steel ribs, but no water entering the hull. As the Steve Irwin and Bob Barker race towards the Nisshin Maru's last known coordinates, the Sea Shepherds send video of the collision to the media. From his undisclosed location, Captain Paul Watson watches what happened on his laptop. He admits that the whalers more becoming more aggressive because they see that their days are numbered and also worried about the case brought against them in the International Court of Justice. Back in the Antarctic, the Nisshin Maru run into a storm to hide from the Sea Shepherds. Captain Peter calls Captain Sid to send the helicopter out, which does find the factory ship turning due east. The Bob Barker turns to intercept and soon finds the Nisshin within three hours. The harpoon ships are also there, but they don't turn to defend their mothership. Instead, the whalers wait until nightfall to engage the Barker. Both small boats (Gemini and Hunter) are lowered into the water and engage two of the harpoon ships (Yushin Maru and Yushin Maru No.3). They first try to cut the steel cables the Yushins are towing to prop foul the Barker, but don't succeed. So they drop prop foulers of their own to buy time. Soon the Nisshin slips away off the Barker's radar and Peter calls for the boats to return to the ship. As Operation Relentless comes to a close, the Sea Shepherds head back to port. On March 31st, 2014, the International Court of Justice (ICJ) ruled that the Japan's Antarctic whale research program (JARPA II) was not for scientific research and that their operations are illegal. After ten years of fighting, the Sea Shepherds celebrate their greatest victory to date. The whalers this season only killed 271 whales, falling 784 short of their total quota of 1,035. Captain Paul Watson was happy with the ICJ's decision and learned that Japan said it would abide by the ruling. But Paul is convinced that the Japanese whalers want their revenge and will do everything they can to keep going down to Antarctica to kill whales. He made clear if the whalers ever return, Sea Shepherd will be there to stop them.\n\nThe following year (2014-2015), Japan sent two of its whaling ships on a non-lethal survey in the Southern Ocean Whale Sanctuary. Sea Shepherd admitted the whalers were planning ahead to return to killing whales. The whalers released a new program called NEWREP-A, which calls for the killing of 333 minke whales (no more fin whales or humpback whales will be killed) every year for the next 12 years (until 2027-2028). In 2015-2016, as Sea Shepherd conducted other campaigns around the world, the whalers did return and killed 333 minke whales (103 male and 230 female, 90% of the females were pregnant). Sea Shepherd announced the construction of a brand-new interceptor vessel they named Ocean Warrior due to be completed by September 2016. Most likely it will be sent to the Antarctic to confront the Japanese whaling fleet for the 2016-2017 whaling season. No announcements have been made if the Steve Irwin, Bob Barker, Brigitte Bardot, or Sam Simon will return to battle the whalers.","production_code":"","runtime":null,"season_number":7,"show_id":8183,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 7","overview":"","id":86289,"poster_path":null,"season_number":7,"vote_average":0}}}