{
    "adult": false,
    "backdrop_path": "/1Hrs4irbHqjt9DZm6lhrYmgNKEm.jpg",
    "created_by": [],
    "episode_run_time": [
        45
    ],
    "first_air_date": "2018-09-03",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        },
        {
            "id": 80,
            "name": "Crime"
        }
    ],
    "homepage": "https://www.crimeandinvestigation.co.uk/shows/murdertown",
    "id": 82000,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2023-02-06",
    "last_episode_to_air": {
        "id": 4326647,
        "name": "Birkenhead",
        "overview": "Emilia looks into the killing of Martin Decker, who had been bludgeoned with a hammer. Police would link the murder to a suspect dubbed the NR3 cat killer.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2023-02-06",
        "episode_number": 5,
        "episode_type": "standard",
        "production_code": "",
        "runtime": null,
        "season_number": 5,
        "show_id": 82000,
        "still_path": "/qI69Ifii1RBPkmKpDrqtzMPM0s2.jpg"
    },
    "name": "Murdertown",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 2392,
            "logo_path": "/vitUTPUae38gzMRl8aMVecN0Cme.png",
            "name": "Crime + Investigation",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 40,
    "number_of_seasons": 5,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Murdertown",
    "overview": "Each episode of this true crime docuseries sees Katherine Kelly tell the compelling, step-by-step story of how one extraordinary murder was solved and how it fit a disturbing wider pattern in one particular city.",
    "popularity": 5.243,
    "poster_path": "/pYJnjXARIohVzcsBNPMLsrPlWjV.jpg",
    "production_companies": [
        {
            "id": 121194,
            "logo_path": "/kU0akgE33j22dZforum4Iidxurb.png",
            "name": "Workerbee",
            "origin_country": "GB"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2018-09-03",
            "episode_count": 10,
            "id": 108655,
            "name": "Season 1",
            "overview": "",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2019-09-16",
            "episode_count": 10,
            "id": 134174,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2021-09-27",
            "episode_count": 10,
            "id": 218358,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2022-09-11",
            "episode_count": 5,
            "id": 308500,
            "name": "Season 4",
            "overview": "",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        {
            "air_date": "2023-01-09",
            "episode_count": 5,
            "id": 334551,
            "name": "Season 5",
            "overview": "",
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 7,
    "vote_count": 2,
    "season_data": {
        "1": {
            "_id": "5b89144b0e0a2679ae00abfb",
            "air_date": "2018-09-03",
            "episodes": [
                {
                    "air_date": "2018-09-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1561165,
                    "name": "Hull",
                    "overview": "This episode explores two terrible crimes that left a lasting impression on Hull - and reveals how complex investigations into one case finally led to both mysteries being solved. The story begins with the apparent kidnap and murder of Christopher Laverack, a crime that initially had police stumped. It would remain unsolved for years. We also tell the story of the disappearance of Joanne Nelson, who vanished from the city on Valentine’s Day, 2005. It was a story that had the whole city on edge and led to the biggest search in Humberside Police history, before a breakthrough led police to finding her killer, and the whereabouts of her body.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/1sQ19VafehBQOhnoyWRTxtsdWCt.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-09-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3300224,
                    "name": "Dartford",
                    "overview": "In 1993 a sixteen-year-old girl is found dying by the side of the road. Her killer disappears into the night. Her name is Claire Tiltman, and as police investigate they learn she's a girl with no enemies, and the crime is motiveless. There's no sexual attack, and no robbery. But there is extreme violence.\n\nTwo years later, another attack is committed on a young woman. This time, locals identify the town milkman, Colin Ash Smith. Police investigate, and find a diary with details of crimes he's committed and crimes he plans to do. In his car they find half a school-tie, part of a weapon he used on an earlier crime seven years earlier. He's jailed for two attacks, but not Claire's murder. It takes over twenty years before he's finally brought to trial, following advances in forensics, and found guilty of killing Claire. Jurors hear of how he knew Claire, and even went to her funeral.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/A3rEArYdBvnZ0hiGjX2y9g4zCSu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-09-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3300225,
                    "name": "Dundee",
                    "overview": "In this episode explores how one boy left an entire city living in fear. Aged 15, Robbie Mcintosh walked into a fish & chip shop to announce that a woman had been killed on the iconic Law Hill. Locals were terrified as the news spread. Police revealed the victim had been stabbed dozens of times. But police never imagined that the culprit was a 15 year-old. As cops swooped to arrest him, Mcintosh fled to Glasgow airport, buying a ticket to Canada when he was placed under arrest. Was Mcintosh a local youth who had committed something shocking, or a serial killer in the making, stopped in his tracks? Dundee would find out in 2017, when Mcintosh was allowed out of prison on home leave. He lasted 5 days. Then he took a walk into nearby woods, spotted a female dog walker, and attacked her with a large heavy dumbbell. The woman survived, and police arrested Mcintosh just an hour later. In Dundee, lightning had struck twice terrifyingly, Mcintosh will be eligible for release in 2022.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/hq0NJPOY4mYmfSRIM94bF4bvItL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-09-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3300226,
                    "name": "Barnsley",
                    "overview": "In 2015 a 69-year-old man is found stabbed in his own home. Cops can't understand it. There's no forced entry. And no obvious motive. He has no enemies. At the scene, forensics uncover a receipt from a nearby cashpoint. Cops think it will narrow down the time of death. But they're in for a shock. CCTV at the bank reveals a woman, using the victims card to withdraw cash. Who is she? And how does she relate to the murder? It turns out that her boyfriend, Ian Birley, is a man with a past. He's only been out of prison a year, after serving a life sentence for an almost identical murder. Back in 1995, while living on the streets in the town, Birley had killed an elderly man in his own home, for no real motive. Now lightning had struck twice.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/4iQQ6G7FzIxgYobcGMO4yKVzv7d.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-01",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3300227,
                    "name": "Pontypridd",
                    "overview": "In 2014 a local woman goes missing after a night drinking in the pubs of the town. CCTV finds her walking home, arm in arm with another local drinker. He just happens to be a former butcher. Police soon realise he has put his trade to use, by dismembering his poor victim and hiding her body parts around the town. It's a crime with no obvious motive, and one which shocked the whole community. He was a man with a past – he once set fire to his primary school, and was found by firemen sat in the middle of the blaze paying the piano. It's a dark story – that we're still unpicking. Pontypridd is labelled the murder capital of Wales for the volume of crimes there in recent years.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/zJbCkt3da4eSnL48shx8YR6qjgW.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-08",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3300228,
                    "name": "Tamworth",
                    "overview": "1994 an evil gang kill a woman who manages a building society and tie up her husband, before robbing the building society of large sums of cash. Cops are baffled. But something doesn't quite add up. Despite making a tearful plea for help, the injured husband's story doesn't tally. Cops soon start to suspect that the ‘gang' are a hoax, and that Gordon Wardell has murdered his wife Carol in a bid to get money.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/iMXGKUKNJqCXyjcudEls11AzPd7.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-15",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3300229,
                    "name": "Watford",
                    "overview": "In 2000 a young woman is stabbed to death while walking her dog in a picturesque park in the town. She's a twin, a woman known in her local area. A suspect is seen running semi-naked across the M1 motorway and makes his escape. Cops initially suspect the killer of Rachel Nickel might be responsible...and it takes detectives weeks to identify the real killer is a local man called Leon Amos. They find out his family are known criminals, who have been covering Leon's tracks, and that the killer may have mistakenly carried out an act of retribution on the wrong twin.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/sBKZ0YywPRzGqnadERkzKMFtKVz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-22",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3300230,
                    "name": "Huddersfield",
                    "overview": "In 2014 a sex offender called Robert Hind goes missing from a bail hostel. Cops fear he's absconded to commit crime. The town is scoured. Then cops find CCTV of the man with another ex-con called David Mitchell at the bus station. They find out the two men are friends, who live together at the hostel. Rumour has it they are in a relationship together. They fear the two men have gone to do something terrible. But then they learn that the sex offender hadn't absconded, he's been murdered, by Mitchell, the man with him on CCTV. Mitchell has killed before – murdering his wife in the 90's. Now he's killed paedophile Hind, and dumped him in the canal. It's a canal that contains many dark secrets, as we also see from the story of Tobias Minski, a student in Huddersfield who disappeared and sparked a town-wide search, before his body was found folded up in a suitcase beside the canal.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/vGZeTfCPYkWWGA3YMWxs5hRTBUR.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-10-29",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3300231,
                    "name": "Sunderland",
                    "overview": "Throughout the early 90s young boys would be found dead after sniffing glue and being trapped in derelict buildings which caught fire. But when it kept happening, cops got suspicious. They soon found they were actually being systematically murdered by a man called Steven Grieveson, dubbed the Sunderland strangler in a case which still haunts the town. His is a name few will know, but he's regarded as one of the most dangerous killers in the UK.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/YpECmORSs1v3oB2e3ygAbdDyfS.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-11-05",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 3300232,
                    "name": "Brighton",
                    "overview": "In 2015 a man visits a tarot card reader. Within an hour she's dealt out the death card and he's confessed to a murder. When cops arrive they discover he's been living at home with his victim's body for days. Both men are a part of the spiritualist church - and have fallen out in the biggest way possible. Cops have the grim task of investigating the crime, and proving the death is a murder. This episode taps into a series of crimes with same-sex partners committing murder in the city and living with their victims, and we tell the story of a second crime, with very similar outcomes, that saw a man go on the run for a year.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 82000,
                    "still_path": "/9XwgDPUsmQzzyHdxysS7wv7cqxS.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 108655,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5da61dbaa242320017774d4b",
            "air_date": "2019-09-16",
            "episodes": [
                {
                    "air_date": "2019-09-16",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1953279,
                    "name": "Portsmouth",
                    "overview": "Examining two murders committed in Portsmouth on Dec. 12 of different years by Allan Grimson, and possible links to the disappearance of Simon Parkes.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/8hH1bsQRi55B1ZYVD3k3YRJi48k.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-09-23",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3300676,
                    "name": "Wrexham",
                    "overview": "This episode explores one man's violent rampage through the town of Wrexham, which eventually led to the murder of Nicholas Churton.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/6zdeuZARFCHHSUcEMVni4bE6WnT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-09-30",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3300679,
                    "name": "Middlesbrough",
                    "overview": "In Middlesbrough we look at the story of a man who believed he had committed the perfect murder, and how diligent police work uncovered his identity and his plans for further violent crimes.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/p0fVvUktBqTuDGyBnNUXZFORFUc.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-10-07",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3300680,
                    "name": "Ipswich",
                    "overview": "This episode looks at Ipswich's 'street drinking' community, a population who live on the streets and often engage in anti-social behaviour and low-level violence, but examines a much more sinister story, ending in three brutal murders and a violent attack.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/65ItTTdWWV8i4WH4PJ1utZOevbw.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-10-14",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3300681,
                    "name": "Darlington",
                    "overview": "This is the shocking story of Julie Paterson's tragic murder, and the gruesome details of the attack which shocked the local community and drove her partner to drastic measures.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/tgrlyG46Jv3JCN3hBaGsv9txti3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-10-21",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3300682,
                    "name": "Bristol",
                    "overview": "In Bristol, we hear from the parents of Louise Smith, who woke on Christmas morning 1995 to find their daughter had not returned from a night out the previous evening, as they discuss the events surrounding her disappearance and their desperate need for answers.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/hXL9eNl5mnwvC031A0G7hJGUeZC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-10-28",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3300684,
                    "name": "Greenock",
                    "overview": "When a murder is committed, you hope that the suspect is caught as quickly as possible, but in the case of Elaine Doyle's murder in Greenock, a lack of evidence meant that justice would not be served for several years, until advancements in technology made it possible.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/qqs3a325qbFuDle2hKoe9jF5IZf.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-04",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3300685,
                    "name": "Nuneaton",
                    "overview": "In Nuneaton, we hear from David Freeman, who's younger sister Naomi Smith was tragically murdered on her way to post a letter, as he tells us of the family's quest for answers about who could have done this to her.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/dinWMYWofXhbAE9GV8T01j4J3ta.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-11",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3300686,
                    "name": "Grimsby",
                    "overview": "Devastated father Keith Vincent retells the story of the sequence of events that led to his son Adam living on the streets of Grimsby, and the circumstances which eventually led to his brutal murder at the hands of a notorious drugs gang.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/ci4g3DRQM1TqaNgSwk6ybp6z0ci.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-11-18",
                    "episode_number": 10,
                    "episode_type": "finale",
                    "id": 3300687,
                    "name": "Croydon",
                    "overview": "Airing as a part of domestic violence awareness week - this film tells the dramatic and shocking story of Mario Celaire - a man who viciously assaulted two women he claimed to love.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 82000,
                    "still_path": "/qcFZTzrEceDPlkfbdwxDODrABaN.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 134174,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "6184617ff6596f002a211c84",
            "air_date": "2021-09-27",
            "episodes": [
                {
                    "air_date": "2021-09-27",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3322475,
                    "name": "Milton Keynes",
                    "overview": "Rachel Manning had been to a 1970s-themed fancy dress party and Chicago's nightclub with boyfriend Barri White before going missing in the early hours of 10 December 2000.\n\nThe teenager was found dead in undergrowth at Woburn Golf Club two days later. She had been strangled and her face disfigured with a steering lock, which was located 500m (546 yards) from her body.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-10-04",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3322476,
                    "name": "Wakefield",
                    "overview": "The shocking murder of 51-year-old Wakefield woman Wendy Speakes, at the hands of sadistic killer Christopher Farrow who targeted her as she walked home from work.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-10-11",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3322477,
                    "name": "Wigan",
                    "overview": "The story of Wigan teenager Louise Sellars, who vanished in 1995. The next day, her body was found in a field near her home, leading to a hunt for a killer in Appley Bridge. ",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-10-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3322478,
                    "name": "Wishaw",
                    "overview": "The brutal murder of 17-year-old student Zoe Nelson in North Lanarkshire in 2010 - and the twists and turns of the trial that followed.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-10-25",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3322479,
                    "name": "Bath",
                    "overview": "Melanie Road, 17, was murdered on her way home from a nightclub in Bath in 1984. She had been out with her boyfriend and friends, but Melanie had been sexually assaulted and brutally stabbed 26 times on her way back home. A milkman found her body the following day.\n\nAfter multiple lines of enquiries and arrests, the police weren't able to find the killer, and despite recovering a large amount of DNA evidence at the scene, the case went cold. Over the next 30 years, the police continued to review the case and check the DNA database for any matches but no real breakthrough.\n\nThere were 100s of potential suspects who were checked against the database but not a match. The real breakthrough came in 2014 when the DNA database returned a familial match, leading the police to married father Christopher Hampton. This man had brutally murdered Melanie on the night in 1984 and had been at large for 30 years.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": "/lLOyPGNGYXe4mr0r4fuGWuU5j7w.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-01",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3322480,
                    "name": "Southampton",
                    "overview": "Pennie Davis'body was found with multiple stab wounds in a field where she rode her horse in the village of Beaulieu on 2nd September 2014. The case centered on Mrs. Davis' relationship with Benjamin Carr, 22, the son of her estranged partner, who had \"lasting hate and anger\" towards her.\n\nMrs Davis had reported Carr to police for two sexual assaults, which he denied and the matter was not taken further by police. Animosity resurfaced in 2012, however, when Mrs. Davis found out Carr's father was to re-marry and Davis threatened to disrupt the proceedings by going public with her allegations.\n\nCarr hatched a plan to pay career criminal Justin Robertson £1,500 to 'silence her for good.' Police believe Robertson intended to scare Ms. Davis, but when she challenged him and removed his balaclava, he panicked, realised she could identify him and killed her. Both Carr and Robertson were charged with the murder and found guilty.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-08",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 3322481,
                    "name": "Oxford",
                    "overview": "Vikki Thompson went missing in Ascott-under-Wychwood, Oxfordshire, while walking her dog on 12 August 95. The dog returned home without her, raising the alarm. After a frantic search, she was found alive but badly beaten - she died 6 days later.\n\nMark Weston emerged as the prime suspect, the Police set about building a case, with enough evidence to charge him with the murder. When the case went to trial, Weston was found not guilty by the jury.\n\nA decade after the murder of Vikki Thompson, the double jeopardy law was changed in 2005, allowing a person to be tried for the same crime twice; the Police decided to look at the case again.\n\nWeston's boots were resubmitted for testing and tiny traces of blood were found on the boots. The blood was a match to Vikki Thompson.\n\nIn 2009 Weston was arrested again and faced another trial, and this time he was found guilty. The first time that the double jeopardy legislation was used to secure a conviction.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-15",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4694308,
                    "name": "Leicester",
                    "overview": "Police found 72-year-old Jane Hings's body on Sunday, September 24th, 2017. DNA samples found at the scene found a match for then 25-year-old Craig Keogh, who was subsequently arrested. The police begin to build a case against Keogh and track his movements on the dates in question.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-22",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4694310,
                    "name": "Lichfield",
                    "overview": "In July 1999, the remains of Wendy Upton were found in nearby woods; she was identified using dental records. Upton had been reported as missing nine months previously.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-11-29",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 4694312,
                    "name": "Whitby",
                    "overview": "In April 2012, Dawn and George Kibble visited the flat of Dawn's sister Julie Davison, concerned for her wellbeing after repeated phone calls went unanswered. On arrival, they found Julie's lifeless body on the blood-stained floor of her kitchen. She'd been attacked, stabbed multiple times, and left for dead.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 3,
                    "show_id": 82000,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 218358,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "6320a111392712007b226f33",
            "air_date": "2022-09-11",
            "episodes": [
                {
                    "air_date": "2022-09-11",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3952484,
                    "name": "Rotherham",
                    "overview": "With first-hand testimony from family members, police officers, witnesses and reporters, Murdertown shines a light on some of Britain’s darkest murder locations, examining the crimes that rocked these communities and the impact they have had on the people living there.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 82000,
                    "still_path": "/9lW7eRmlwnnjEDI1T2SrTN9XAKF.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-09-18",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3975055,
                    "name": "Swanley",
                    "overview": "In May 1996, the murder of Stephen Cameron hit national headlines as one of the first examples in the UK of a road rage killing.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 82000,
                    "still_path": "/c0rPNqM6tui9jTH1AumN6eTOZLt.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-09-25",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3975057,
                    "name": "Glasgow",
                    "overview": "In April 2015, 24-year-old student Karen Buckley went missing whilst on a night out with friends in the West End of Glasgow. Emilia visits the location where Karen was last seen and learns about the investigation that tried to find her.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 82000,
                    "still_path": "/gUxByFR9zAk10h0nLhyVnQuBV6q.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-02",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4270401,
                    "name": "Peterborough",
                    "overview": "In 1979, a young woman went missing, having last been seen in the city centre. The police assumed Sally Ann McGrath had simply run away, and it took nearly eight months for her body to be found. The investigation into her murder took even longer.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 82000,
                    "still_path": "/j0CVzKvzkrJz693hbZgE6unGMMz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-10-09",
                    "episode_number": 5,
                    "episode_type": "finale",
                    "id": 4270402,
                    "name": "Mablethorpe",
                    "overview": "Joan and John Stirland, a couple in their fifties living on the Lincolnshire coast, were found murdered in 2004.  The investigation into the deaths eventually led to the downfall of one of Nottinghamshire's most feared underworld figures.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 4,
                    "show_id": 82000,
                    "still_path": "/qxVsjYzgIVu9G98H27AGcX2x7oT.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "",
            "id": 308500,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        },
        "5": {
            "_id": "6421ec0023be4600c0f66b82",
            "air_date": "2023-01-09",
            "episodes": [
                {
                    "air_date": "2023-01-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4326641,
                    "name": "Blackburn",
                    "overview": "Emilia investigates Evie Adams' murder in 2019. The victim's boyfriend, who was already being investigated over two separate deaths, quickly came under suspicion.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 82000,
                    "still_path": "/3MTzqOJR5OsyWLzrWZQwXJqK9Bu.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-01-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4326642,
                    "name": "Preston",
                    "overview": "Emilia uncovers details surrounding the brutal murder of Rosie Darbyshire. Witnesses and CCTV were key to solving the case that shocked the local community.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 82000,
                    "still_path": "/7Sxqa0Y8H2in5OWGLzUVrHBMMmC.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-01-23",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4326643,
                    "name": "Chatham",
                    "overview": "Emilia uncovers details surrounding Joshua Stimpson's murder of ex-girlfriend Molly McLaren, a case which shook the victim's family and community to its core.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 82000,
                    "still_path": "/vUdYcXUonGelK2XFm1Drr7IdScq.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-01-30",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4326645,
                    "name": "Beenham",
                    "overview": "Emilia examines three murders which shook Beenham in the 1960s. One of the murders went unsolved for 40 years, until detectives vowed to finally seek justice.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 82000,
                    "still_path": "/8gWQynwaRnIFsLQsAYBlPmRFRHI.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-02-06",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4326647,
                    "name": "Birkenhead",
                    "overview": "Emilia looks into the killing of Martin Decker, who had been bludgeoned with a hammer. Police would link the murder to a suspect dubbed the NR3 cat killer.",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 82000,
                    "still_path": "/qI69Ifii1RBPkmKpDrqtzMPM0s2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "",
            "id": 334551,
            "poster_path": null,
            "season_number": 5,
            "vote_average": 0
        }
    }
}