{"adult":false,"backdrop_path":"/6C5m9nzCTB0ijS9PjYus0eTYpct.jpg","created_by":[{"id":1794443,"credit_id":"62d3d283ccb15f0054b8a369","name":"Kim Soon-ok","gender":1,"profile_path":"/xJ5eBmFZYnhveCfCgJW86CzTLjC.jpg"},{"id":2756655,"credit_id":"5f478363813cb600348d0de6","name":"Park Young-soo","gender":0,"profile_path":null}],"episode_run_time":[35],"first_air_date":"2018-11-21","genres":[{"id":18,"name":"Drama"},{"id":10759,"name":"Action & Adventure"},{"id":9648,"name":"Mystery"}],"homepage":"https://programs.sbs.co.kr/drama/thelastempress","id":84107,"in_production":false,"languages":["ko"],"last_air_date":"2019-02-21","last_episode_to_air":{"id":1707927,"name":"The Fall of the Imperial Family","overview":"With the Emperor dead, the Empress Dowager rushes to make her escape from the palace. As she is about to leave, Kang Hee confronts her. Unaware of the police and media waiting outside the door, they dig their graves as their dispute reveals each of their crimes. The police arrest them and take them away. Later, Sunny completes her quest in bringing down the palace and the people in it, by declaring the abolition of the monarchy.","vote_average":0,"vote_count":0,"air_date":"2019-02-21","episode_number":52,"episode_type":"finale","production_code":"","runtime":27,"season_number":1,"show_id":84107,"still_path":"/jq2IBunxD21f5YZ7GsAGUl64guX.jpg"},"name":"The Last Empress","next_episode_to_air":null,"networks":[{"id":156,"logo_path":"/uHQFPvRTlpgaIFQVN8eKWEnFOll.png","name":"SBS","origin_country":"KR"},{"id":6712,"logo_path":"/zKNiqFOaHmjhVEA4pUqEWvrhTPO.png","name":"1001TV","origin_country":"IQ"}],"number_of_episodes":52,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"황후의 품격","overview":"In an alternate-reality South Korea, where a constitutional monarchical system prevails, Oh Sunny, a musical actress, becomes the empress of the country. Thus begins a dispute for power in the royal palace. Nothing is what it seems, and Oh Sunny is ready to fight until the end to uncover a mysterious homicide within the royal palace, fighting to protect those she loves the most and obtain happiness.","popularity":15.67,"poster_path":"/kWJw89ce4gxGREKxaFSiQmETWQN.jpg","production_companies":[{"id":111327,"logo_path":"/55PM6L3EsJTFHDNpxFviYi0k5ev.png","name":"SM Life Design Group","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2018-11-21","episode_count":52,"id":112731,"name":"Season 1","overview":"In a modern-day monarchical Korea, a bright musical actress enters an unforgiving world of sinister secrets when she marries the emperor.","poster_path":"/boqVcljblUnwf9tygrEVzsEXQbP.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7,"vote_count":16,"season_data":{"1":{"_id":"5bee6b8f9251415ccc01034b","air_date":"2018-11-21","episodes":[{"air_date":"2018-11-21","episode_number":1,"episode_type":"standard","id":1621356,"name":"A Luncheon with the Emperor","overview":"In the present, mysterious skeletal remains are found on Ehwa Palace grounds with a necklace worth 2.2 million dollars thought to be a gift of the Emperor to the Empress. Jumping back one year earlier, at a luncheon with selected people, the Emperor meets Oh Sunny for the second time. In the blink of an eye, the event turns into a hostage situation where the Emperor and the people almost lose their lives.","production_code":"","runtime":33,"season_number":1,"show_id":84107,"still_path":"/c8851xxPBbjOvkgJleWruYRmhoD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-21","episode_number":2,"episode_type":"standard","id":1624410,"name":"The Emperor’s Day Off","overview":"After saving the Emperor's life, Sunny safely returns home. The assailant is apprehended, and the Emperor and the Empress Dowager learn that he is the brother of Kang Joon Sung, an Imperial guard who went missing seven years ago. Mysteriously, the assailant dies of a heart attack during the interrogation. Meanwhile, Yu Ra tells her mother that she wants nothing to do with her and her family.","production_code":"","runtime":27,"season_number":1,"show_id":84107,"still_path":"/u8xW1FRLOerOBk2LV3Q4LWVzgkE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-22","episode_number":3,"episode_type":"standard","id":1624411,"name":"A Hit-and-Run","overview":"The Emperor hits and kills Wang Shik's mother with his car. With Wang Shik just behind him, the Emperor loads her body and escapes. Yu Ra convinces him to trust her and tells him to dump the body. She then helps him create an alibi. Meanwhile, the Emperor orders Mr. Ma to destroy any evidence of him being in Bichido.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/b7UGEktnoe2NTyx4Ku1Pk6nyB4w.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-22","episode_number":4,"episode_type":"standard","id":1624412,"name":"The Yellow Truck","overview":"Yu Ra confesses to the hit-and-run accident and tries to stage her death, but the Emperor and his guards rescue her just in time. In the aftermath of securing his alibi, Sunny stands in the spotlight of the media. Despite the nuisance, the Emperor tries to deter the hit-and-run topic and surprises Sunny with a date. Meanwhile, Wang Shik seeks support for evidence he had secured at the accident site.","production_code":"","runtime":31,"season_number":1,"show_id":84107,"still_path":"/n5pTP1L3Hlr8i9NrPm4SRAjbwQl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-28","episode_number":5,"episode_type":"standard","id":1624413,"name":"The Empress Dowager Underestimates Ms. Min","overview":"As the Imperial Family gathers to celebrate the Grand Empress Dowager's World Peace Award, Oh Sunny appears on behalf of the Empress Dowager's request to put on a show. But really, she's there to be introduced as the Emperor's significant other. Wang Shik suffers a devastating fall but is rescued by a villager before the Emperor's men can finish their job. Meanwhile, the Empress Dowager threatens Ms. Min to stay away from the Emperor.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/tz0ruSIdAnjOvcYBxwk6gpNL1hu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-28","episode_number":6,"episode_type":"standard","id":1624414,"name":"The Emperor Starts to Court Oh Sunny","overview":"With substantial evidence of the hit-and-run accident in her hands, the Empress Dowager reclaims her power over the Emperor and blackmails him to marry Oh Sunny. Cornered and not wanting Ms. Min to go to prison, the Emperor starts to court Oh Sunny. Meanwhile, Na Wang Shik determines to become an Imperial guard and asks the old man who saved him, to train him.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/xqdpg46eFm3goD8eiVAku3f2uUW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-29","episode_number":7,"episode_type":"standard","id":1624415,"name":"Wedding Preparations","overview":"Transformed and well-trained, Na Wang Shik, who is now Chun Woo Bin, gets one step closer to fulfilling his revenge. The Emperor hires him as an Imperial Guard. Preparations for the wedding of the century begin, and the two families undergo customary traditions in style. Meanwhile, the Empress Dowager banishes Min Yu Ra from the palace.","production_code":"","runtime":31,"season_number":1,"show_id":84107,"still_path":"/wpYJtce3eD89ZMtcXPMw4xAqyyn.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-11-29","episode_number":8,"episode_type":"standard","id":1624416,"name":"The Wedding","overview":"As the nation watches the extravagant wedding, the elevated platform Sunny stands on breaks and sets on fire. Just as the situation gets dire, the new Imperial guard, Woo Bin, saves her. Meanwhile, the Empress Dowager thinks of a way to get rid of Yu Ra who is now the chief assistant of the palace.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/eoANHRYtM0V4meQlkzoqn6jhkeF.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-05","episode_number":9,"episode_type":"standard","id":1637873,"name":"Tell Me It’s Not True","overview":"Without knowing Yu Ra's devious ways, Wang Shik contacts her to meet face to face. When he approaches her, he gets a glimpse of Ma Pil and decides to abort for Yu Ra's sake. Later, his vigilance teaches him of Yu Ra's involvement in his mother's murder.","production_code":"","runtime":31,"season_number":1,"show_id":84107,"still_path":"/xUFnhkqqkvo7ATNjwf3NZBltlWY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-05","episode_number":10,"episode_type":"standard","id":1637874,"name":"Wang Shik’s Rage","overview":"After finding out the people involved, Wang Shik returns to Bichido and swears to kill Pil Joo, the Emperor, and Yu Ra. He also tries to abandon Dong Shik, Yo Ra's son, but doesn't have the heart to do it. Angrier than ever, Wang Shik challenges the Emperor to a sparring match and impresses the Emperor.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/3hL26lYLCmQ9tbKl0FJKN1IbAX6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-06","episode_number":11,"episode_type":"standard","id":1637875,"name":"Betrayal in the Palace","overview":"The Grand Empress Dowager overhears Yu Ra and the Emperor talking and learns of their secret. She forbids their love and demands Yu Ra to leave the palace. Later, the Empress tries her best to please the Emperor but following Yu Ra's suggestion only angers him. Meanwhile, Wang Shik starts to get closer to the Emperor.","production_code":"","runtime":31,"season_number":1,"show_id":84107,"still_path":"/6Ag06UcoWoADwPNY48A9h4oQbSN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-06","episode_number":12,"episode_type":"standard","id":1637876,"name":"Pil Joo Finds Wang Shik","overview":"Knowing how the Empress must feel, the Grand Empress Dowager spends the day with her and invites her father to the palace. Pil Joo searches through Woo Bin's quarters and finds out that he is Wang Shik. When he goes after Wang Shik, he tells him the truth behind his mother's death.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/cxdpj2LmHiGmUnm9GFgzoILSAEd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-12","episode_number":13,"episode_type":"standard","id":1637877,"name":"The Empress Finds Out About the Emperor and Yu Ra","overview":"When the Empress sees the Emperor and Ms. Min together kissing on a cruise ship, she realizes she had been a fool but decides to hear him out. The Empress Dowager tracks down the Prince and asks him to come back to the palace, but the Prince slips away and finds refuge at Ddobong's Fried Chicken, Oh Sunny's father's restaurant. Meanwhile, Woo Bin feels for the Empress and offers his support.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/sWnnZqW7BMdwDEyhgivmcPiwmxP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-12","episode_number":14,"episode_type":"standard","id":1637878,"name":"The Prince is in Town","overview":"After talking to the Prince over the phone in after seven years, the Emperor starts to worry. Knowing that the presence of the Prince is a direct threat to his position, the Emperor confronts the Empress Dowager. Meanwhile, with newly found strength and courage, the Empress takes it into her own hands and strips Yu Ra of her title and incarcerates her.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/p3o6omNH192u2pI0cqMfxLgSbo5.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-13","episode_number":15,"episode_type":"standard","id":1637879,"name":"Wang Shik Betrays the Empress","overview":"While trying to catch the Emperor in the act, the Empress gets entangled in a predicament of her own, putting her loyalty to the Emperor in question. Wang Shik betrays her, and with the Emperor's command, he pushes her off a cliff into a river. Meanwhile, Oh Sunny's father gets caught illegally gambling by the authorities again.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/lHJIWfbAZ9SRl7nVeR3bJKyyjRP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-13","episode_number":16,"episode_type":"standard","id":1637880,"name":"The Grand Empress Dowager’s Downfall","overview":"Trying to uncover the truth behind the death of late Empress So Hyun, Sunny discovers that Ari is the Emperor's daughter and Kang Hee, the nanny, is her mother. Wang Shik plays both sides and vows to the Empress Dowager to assist her in her ways. Meanwhile, the Grand Empress Dowager learns of the Emperor's immoral ways and tries to put a stop to the Imperial Family's corruption.","production_code":"","runtime":31,"season_number":1,"show_id":84107,"still_path":"/pNPgeEax2IQ3EiVa0gM1YHyQOal.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-19","episode_number":17,"episode_type":"standard","id":1637881,"name":"Who Killed the Grand Empress Dowager?","overview":"The Grand Empress Dowager is found dead, and an investigation of her murder begins. The police question each member of the Imperial Family, but none of them confess to the crime. Meanwhile, while clutching on to an envelope given by the Grand Empress Dowager, Ms. Hong tells Sunny of her last words.","production_code":"","runtime":31,"season_number":1,"show_id":84107,"still_path":"/rQhBee7zPFoJcVvkujMElWg5ayr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-19","episode_number":18,"episode_type":"standard","id":1637882,"name":"The Empress is Arrested for Murder","overview":"Ms. Hong takes the envelope given by the Grand Empress Dowager containing evidence of the Imperial Family's corruption to the Prime Minister, but it never reaches him. The autopsy of the Grand Empress Dowager reveals poison was the cause of death, the same toxin found in the food the Empress had given her, and as a consequence, the police arrest the Empress for the murder. Meanwhile, the Imperial Family turns their back on Sunny.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/5U5HxFXnHHNmXOqN4j8hvgH4FL0.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-20","episode_number":19,"episode_type":"standard","id":1637883,"name":"Baek Ho Enlightens the Empress","overview":"Trying to clear her name, the Empress returns to the palace to retrieve a recording device she had hidden in the Emperor's chamber. She barely escapes the Emperor and slips away with the help of Wang Shik and Baek Ho. Later, Baek Ho takes her to his secret operation headquarters and reveals to her of the Emperor's coverup of murder.","production_code":"","runtime":33,"season_number":1,"show_id":84107,"still_path":"/5fRkaSkTVhBLQ3PjWXkFT9MUV7n.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-20","episode_number":20,"episode_type":"standard","id":1637884,"name":"Ms. Hong’s Confession","overview":"Without knowing the authorities were tapping the phones, the Empress makes a call to her family and gets caught. But before she makes it into the police station, Ms. Hong confesses to the murder. Later, the Empress broadcasts to the nation a recording of the Emperor and Yu Ra talking about his illegitimate child, damaging the Emperor's image.","production_code":"","runtime":27,"season_number":1,"show_id":84107,"still_path":"/h5LMFx2ew7uWZoiL1TBzmF62miG.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-26","episode_number":21,"episode_type":"standard","id":1637885,"name":"The Empress Returns to the Palace","overview":"While the Emperor tries to restore his name to the people, Sunny appears boldly before him and forgives him publicly and asks to start again. Reluctantly, without an option, the Emperor and Empress are once again together. To rectify the issue of the Emperor's illegitimate child, the Imperial Family accepts Ari as a princess. Meanwhile, the Emperor promotes Wang Shik as the Chief Guard and asks him to court the Empress.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/uvdCTEF3AARzfEFPH3wRxVkvAUs.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-26","episode_number":22,"episode_type":"standard","id":1637886,"name":"The Empress Goes Live","overview":"Prince Yoon gives Baek Ho the late Empress So Hyun's diary to help uncover the truth. The Empress starts to broadcast a live show and causes an uproar within the palace. Meanwhile, Wang Shik saves the Empress from an attacker and takes a severe blow to the head.","production_code":"","runtime":31,"season_number":1,"show_id":84107,"still_path":"/rO17bZuH3ewp0ebkLx8XIXUniAD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-27","episode_number":23,"episode_type":"standard","id":1637887,"name":"Wang Shik Saves His Brother","overview":"When Woo Bin arrives at the hospital, Baek Ho tells the Empress that Woo Bin is Wang Shik and that his true identity must stay a secret. Luckily, a contact within the hospital assists in hiding Woo Bin’s true identity. Meanwhile, Yu Ra finds Dong Shik and secretly tries to send him away.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/8pJJO46TXeyMigkwzgyNkPRCHxd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2018-12-27","episode_number":24,"episode_type":"standard","id":1637888,"name":"Yu Ra’s Demise","overview":"Wang Shik learns from So Jin that a court lady had tried the food made by the Empress for the Grand Empress Dowager before her death and is now missing. With this new information, Wang Shik and the Empress start to dig deeper into the Grand Empress Dowager's murder. Meanwhile, an anonymous person sends the Emperor information regarding Yu Ra 's connection with Wang Shik.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/nD1TAeaNhRyUR3RrDgdXdyb13ZA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-02","episode_number":25,"episode_type":"standard","id":1688275,"name":"The Prince Returns","overview":"When the Emperor tells the Empress Dowager that he had taken care of Yu Ra without her consent, she smiles and embraces him. She then tells him of her decision to dethrone the Crowned Prince. At the Imperial Auditor's meeting, a new law is passed to keep the option of an empress regnant. Meanwhile, the Prince gives the Empress the diary of the late Empress So Hyun.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/e1hRxYRB4O1sMEr0Nmz79MtWm7w.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-02","episode_number":26,"episode_type":"standard","id":1688276,"name":"Where Is My Mother’s Corpse?","overview":"Wang Shik begins to taunt the Emperor and Yu Ra and lets them know that he is alive and looking for his mother's corpse. The Empress discovers that the diary of the late Empress So Hyun is a map that leads to the Empress Dowager's garden. Meanwhile, an awardee of the Imperial Family scholarship enlightens the Empress Dowager of the similarities in Vincent Lee's novel to the late Empress So Hyun's death.","production_code":"","runtime":30,"season_number":1,"show_id":84107,"still_path":"/1AWGaClESj6PRFhHtiyTeufrS4y.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-03","episode_number":27,"episode_type":"standard","id":1688277,"name":"Yu Ra’s Cry for Mercy","overview":"The Emperor brings back Yu Ra and forces her to make false statements accusing the Empress Dowager of murdering the Grand Empress Dowager. Sunny also confronts the Empress Dowager with Cheong Dan, the court lady who disappeared after stating she had eaten the poisoned food. Meanwhile, the Empress Dowager denies all accusations, and Woo Bin asks Yu Ra again where she hid Wang Shik's mother's body.","production_code":"","runtime":32,"season_number":1,"show_id":84107,"still_path":"/k1qG4W8Gu09eSjblWJhUnAWRwh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-03","episode_number":28,"episode_type":"standard","id":1688278,"name":"Wang Shik Mourns at His Mother’s Side","overview":"Wang Shik calls the Emperor again threatening to know where his mother's body is, and Woo Bin persuades the Emperor to make a deal with Yu Ra. Woo Bin releases Yu Ra from the hospital and finally learns of where his mother rests. Meanwhile, the Empress does a live broadcast in an attempt to clear her name of the Grand Empress Dowager's murder, but it ends up backfiring on her.","production_code":"","runtime":28,"season_number":1,"show_id":84107,"still_path":"/dNoJH5K2WOzVnMDdRHI4w1UF7Zo.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-09","episode_number":29,"episode_type":"standard","id":1688279,"name":"The Emperor’s Jealousy","overview":"Wang Shik recovers his mother's body and gives her a proper goodbye. He promises her that he will punish those who are responsible for her death. Sunny stays close by and consoles Wang Shik, and through the empathy, their relationship grows deeper. Meanwhile, the Emperor grows jealous of their relationship and tries to win the Empress back.","production_code":"","runtime":38,"season_number":1,"show_id":84107,"still_path":"/73gDHLwhKvnoPMTQ1PhV6KZvnZP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-09","episode_number":30,"episode_type":"standard","id":1688280,"name":"An Antique Clock","overview":"Prince Yoon charges into the Emperor's chamber and yells in disgust of the incident that took Sunny's mother's life to save the Emperor. After learning this fact, the Empress Dowager shows no guilt or remorse of what she had done, but to the Emperor, it hits his soft spot. Meanwhile, the Empress Dowager orders Sunny to host the Imperial Family's bazaar.","production_code":"","runtime":23,"season_number":1,"show_id":84107,"still_path":"/9HuWX0HVdwLvfoesEKe6YkT3KAx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-10","episode_number":31,"episode_type":"standard","id":1688281,"name":"The Scandal","overview":"The Empress recovers from the Empress Dowager's attempt to kill her, but it leaves her family outraged and wanting revenge. Sunny learns that Prince Yoon is helping to reveal Empress So Hyun's death, and Prince Yoon gives the hospital director a chance to come clean about what happened to Sunny's mother 10-years ago. Meanwhile, the Empress Dowager continues to manipulate Sunny's fate.","production_code":"","runtime":33,"season_number":1,"show_id":84107,"still_path":"/jd6i7SbNfV6XR9FECskD9CfDoRW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-10","episode_number":32,"episode_type":"standard","id":1688282,"name":"Prince Yoon Lights the Powder Keg","overview":"The hospital director kills himself to stop the truth from coming out, Prince Yoon publishes the second part of his novel depicting the death of Empress So Hyun, and Sunny finds out that the blood meant for her mother went to the Emperor. Meanwhile, Princess So Jin saves Woo Bin from the Empress Dowager's wrath.","production_code":"","runtime":27,"season_number":1,"show_id":84107,"still_path":"/uaMlQCw2HiXg9C2fuqxOy3V0KA3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-17","episode_number":33,"episode_type":"standard","id":1688283,"name":"Peanut Butter Cookies","overview":"Chief Chun proclaims his desire for the Empress in front of the Emperor, but the Empress rebukes his words for his sake. The Empress Dowager swaps cookies made by the Empress with ones with peanuts hoping to condemn the Empress's worth as a mother figure. But her recklessness for Princess Ari's well-being infuriates Kang Hee to get her to tell the Emperor the truth about the late Empress So Hyun. Meanwhile, Chief Chun locks up Ms. Choi.","production_code":"","runtime":33,"season_number":1,"show_id":84107,"still_path":"/60UBrjFggKcrYZYG4WfdUdNVawS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-17","episode_number":34,"episode_type":"standard","id":1688284,"name":"Yu Ra’s Escape","overview":"After calling the Empress Dowager, Chief Joo helps Yu Ra escape from Sunil Mental Hospital. Yu Ra promises the Empress Dowager to give her Na Wang Shik and informs her of his little brother. Meanwhile, the Emperor forces the Empress Dowager to apologize to the Empress with incriminating evidence.","production_code":"","runtime":27,"season_number":1,"show_id":84107,"still_path":"/y8dokYf9N3xwxeE1vuIbsA9wGwd.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-23","episode_number":35,"episode_type":"standard","id":1688285,"name":"The Emperor Abandons the Empress","overview":"As the Emperor reads from Vincent Lee's book, the Empress Dowager screams for him to stop. Soon after, Chief Byun enters the room and demands to know the truth behind her daughter's death. The Crown Prince also emerges and confesses he is Vincent Lee and that the narrative of the book is true. Later, the Emperor abandons the Empress Dowager as his mother and swears to protect Sunny until the very end.","production_code":"","runtime":35,"season_number":1,"show_id":84107,"still_path":"/1YM139jgT92uoYZLIjk0Bg5TjXb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-23","episode_number":36,"episode_type":"standard","id":1688286,"name":"Yu Ra Teams Up with the Empress Dowager","overview":"Yu Ra intends to keep her promise to the Empress Dowager and fetches Dong Shik to the palace hoping to lure in Wang Shik. The Emperor finishes reading Vincent Lee's book and tracks down Prince Yoon to find out more of what he knows. Later, he succumbs to the Empress's words and heads off to the Empress Dowager's garden.","production_code":"","runtime":26,"season_number":1,"show_id":84107,"still_path":"/gj51vyn6G5VzSxKsDPyClK0TJ1B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-24","episode_number":37,"episode_type":"standard","id":1688287,"name":"Princess Ari is Promised to Become the Empress Regnant","overview":"Princess Ari jumps up and down in joy after being told by Kang Hee that she will be the empress regnant very soon. Princess Ari keeps her joy in secret but ends up narrating to the Empress that the Chungeum Island painting by the Grand Empress Dowager was bequeathed to the Empress Dowager and not to her. Meanwhile, the Emperor visits Sunny's house and causes a commotion.","production_code":"","runtime":34,"season_number":1,"show_id":84107,"still_path":"/hKxHej3axW2vuAJWmgy5Aahev1B.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-24","episode_number":38,"episode_type":"standard","id":1688288,"name":"Woo Bin Runs Away With the Empress","overview":"The Empress Dowager orders Woo Bin to run away with the Empress in the middle of the night. Woo Bin tells the Empress of this, but she decides to play along with the Empress Dowager's scheme. After everything plays out, the Empress Dowager ends up being the one to answer to the media.","production_code":"","runtime":27,"season_number":1,"show_id":84107,"still_path":"/dlLteG3VlnpcI397dlhcdmBnDGx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-30","episode_number":39,"episode_type":"standard","id":1688289,"name":"The Empress Regains Control of the Palace","overview":"When the Emperor is about to pull the trigger, Woo Bin promises to bring him Wang Shik. The Empress blackmails the Empress Dowager and regains command of the palace workers, and later, she uses her authority to fire Yu Ra as the Empress Dowager's court lady and places her under her control. Meanwhile, the Emperor continues to court the Empress.","production_code":"","runtime":32,"season_number":1,"show_id":84107,"still_path":"/8ymZoiUuqY5k8dFyVYnNHaP517T.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-30","episode_number":40,"episode_type":"standard","id":1688290,"name":"The Prime Minister Loses His Edge","overview":"To ensure the promise of Princess Ari becoming the empress regnant, Kang Hee gives her recorded testimony of seeing Emperor Lee Hyuk of killing Empress So Hyun to the Prime Minister. However, the Empress gets hard evidence of the two's intimate relationship and intervenes her plot. Meanwhile, the Empress accepts the Emperor's proposal and gets him to tell her what she wants.","production_code":"","runtime":29,"season_number":1,"show_id":84107,"still_path":"/1Cl5DMEIGd7fBaH8wmgY8E0HgSV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-31","episode_number":41,"episode_type":"standard","id":1688291,"name":"Gifts From the Emperor","overview":"Woo Bin reveals his true identity to Yu Ra, but he doesn't kill her. He takes her to Kang Joo Seung to help him remember the past. The Emperor, who is now free from his duties, continues to court the Empress. However, his gifts to her family as reconcilement turn for the worst. Later, desperate to claim her right to power, Kang Hee visits the Prime Minister's wife at the hospital and reveals his infidelity.","production_code":"","runtime":34,"season_number":1,"show_id":84107,"still_path":"/qB255AXQZJxU4KCDT29nQE9JySK.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-31","episode_number":42,"episode_type":"standard","id":1688292,"name":"Joo Seung Starts to Remember","overview":"Joo Seung remembers the day he was supposed to meet Yu Ra and explains it to her in detail. Princess So Jin asks Woo Bin desperately to get back together, and later, begs the Empress Dowager to make him hers. Meanwhile, former Chief Guard Joo reveals himself to the Emperor with information regarding the real Na Wang Shik's whereabouts.","production_code":"","runtime":26,"season_number":1,"show_id":84107,"still_path":"/agEdH0M2hvRAw9l6DfgOoQHvlE9.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-07","episode_number":43,"episode_type":"standard","id":1688293,"name":"An Investigation of Prince Yoon’s Attacker","overview":"All the evidence found in the investigation of Prince Yoon's attacker points to the Emperor. However, the Empress suspects it was Kang Hee. But with Princess Ari as her alibi, she can't prove it. She resorts to using Yu Ra to find out more about Kang Hee by reviving Joo Seung's memory. Meanwhile, the Empress Dowager reviews the video evidence captured on Prince Yoon's phone and hides it in her safe.","production_code":"","runtime":34,"season_number":1,"show_id":84107,"still_path":"/j3YoL9dBwt4msESLRV30xTSFua7.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-07","episode_number":44,"episode_type":"standard","id":1688294,"name":"A Trap for Kang Hee","overview":"The Empress and the Emperor set up a trap for Kang Hee. With so much on the line, Kang Hee takes the bait. When she couldn't look any guiltier of being Prince Yoon's attacker and of knowing something about the death of Empress So Hyun, the Empress Dowager comes to cover for her. Later, the Empress Dowager shows the Emperor proof that Woo Bin, the Empress, Prince Yoon, and even Baek Ho, are making a fool of him.","production_code":"","runtime":26,"season_number":1,"show_id":84107,"still_path":"/xMvTptgkUfFy7S9gOyJbISpOMZY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-13","episode_number":45,"episode_type":"standard","id":1688295,"name":"Wang Shik Starts His Revenge","overview":"To save Dong Shik and the rest of the imperial guards' lives, Wang Shik withdraws his gun and submits to the Emperor's wishes. However, when taken away by the Emperor's guards, they release him in return for his good deeds. Later, Wang Shik catches the Emperor off guard and gives him a little taste of what he had done to his mother. Meanwhile, the Empress Dowager instates Princess Ari as the Crown Princess.","production_code":"","runtime":32,"season_number":1,"show_id":84107,"still_path":"/oK2DRV0zFedJfWAa7rDy2pWNG8V.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-13","episode_number":46,"episode_type":"standard","id":1688296,"name":"The Emperor Returns to the Palace","overview":"The Empress Dowager is shocked to hear of the Emperor's return unscathed. When she talks to him, she tells him to divorce the Empress immediately, but the Emperor tells her he'll resolve the problem his way. Later, the Empress Dowager calls in Mr. Pyo and orders him to stop Empress Eun at all costs from entering the palace. Meanwhile, Kang Hee discovers from Joo Seung that Yu Ra was with him at the mental hospital.","production_code":"","runtime":28,"season_number":1,"show_id":84107,"still_path":"/zwJ7uziqt0sNmXQ5MGzWjQ5E3xY.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-14","episode_number":47,"episode_type":"standard","id":1688297,"name":"Michelle Arrives at the Palace","overview":"Michelle, the former empress under Emperor Lee Jeong's rule 30 years ago, arrives at the palace to appoint the legal proxy for the Crown Princess, stunning everyone. Making things even more shocking is her aid, Na Wang Shik, who will also be making a special audit regarding the death of the Grand Empress Dowager and Empress So Hyun. Later, the Empress Dowager orders Ms. Choi to bring her Sa Goon Ja, the old lady living on Chungeum Island.","production_code":"","runtime":33,"season_number":1,"show_id":84107,"still_path":"/jAnXd1sQb0lAiugNvGqTxReEyg4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-14","episode_number":48,"episode_type":"standard","id":1688298,"name":"Sunny Is Appointed as the Crown Prince","overview":"The Emperor regrets getting mad at the Empress and begs her not to leave him as she sleeps. Michelle announces Empress Oh Sunny to be the Crown Princess' proxy and tells her about the conversation about her she had with the Grand Empress Dowager before her passing. Later, Sunny tries to match the hairpin she receives from Michelle with the one used in the Grand Empress Dowager's murder, knowing that the only other one, was owned by the Empress Dowager.","production_code":"","runtime":27,"season_number":1,"show_id":84107,"still_path":"/o4lUAATPKc9qOjyBrc8SvelZEnh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-20","episode_number":49,"episode_type":"standard","id":1707924,"name":"Michelle Reinstates Hyuk As the Emperor","overview":"The Emperor and Prince Yoon catch Kang Hee red-handed admitting to killing Joo Seung, but she reveals that it was the Empress Dowager's decree. Prince Yoon surprises the Empress Dowager in her chamber and accuses her of trying to kill him. Then he and the Emperor play Joo Seung's recorded testimony that coaxes her to admit to the poppy farm on Chungeum Island. Meanwhile, Sunny asks Michelle to reinstate Hyuk as the emperor before she leaves the palace.","production_code":"","runtime":32,"season_number":1,"show_id":84107,"still_path":"/mrnSK31aXlkl3RcM8uFMvWRk2EI.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-20","episode_number":50,"episode_type":"standard","id":1707925,"name":"The Emperor’s 10-Year Anniversary Celebration","overview":"Knowing that Sunny planned to reveal everything during his 10-year-anniversary as the emperor, he asks her for her forgiveness one last time before he locks her up. On the day of the celebration, Yu Ra helps Sunny escape. Sunny makes it to the venue just in time, and when she stands in front of the crowd, she tells everyone of the unthinkable heinous crimes the Imperial Family had committed. Meanwhile, Mr. Pyo and his henchmen run down Wang Shik, causing him to crash head-on with a wall.","production_code":"","runtime":29,"season_number":1,"show_id":84107,"still_path":"/Aolgh9DKy3d0RtyO4NQREHLAsZ2.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-21","episode_number":51,"episode_type":"standard","id":1707926,"name":"The Emperor’s Vengeance","overview":"Sunny recuperates from the blast with Hyuk at her side. When she wakes, he tells her that it was Na Wang Shik who was behind the attack. Later, at a press conference held at the palace, the Empress Dowager affirms Na Wang Shik as the attacker, and when questioned about the Empress's accusations, she pins it all on the Emperor. Shattered by his mother's words, Hyuk dresses up as Na Wang Shik and carries on with his vengeance to destroy the palace. Meanwhile, someone buries Wang Shik next to his mother's grave.","production_code":"","runtime":34,"season_number":1,"show_id":84107,"still_path":"/kLMm5ts4ILnJItg97db2toLSBlP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-21","episode_number":52,"episode_type":"finale","id":1707927,"name":"The Fall of the Imperial Family","overview":"With the Emperor dead, the Empress Dowager rushes to make her escape from the palace. As she is about to leave, Kang Hee confronts her. Unaware of the police and media waiting outside the door, they dig their graves as their dispute reveals each of their crimes. The police arrest them and take them away. Later, Sunny completes her quest in bringing down the palace and the people in it, by declaring the abolition of the monarchy.","production_code":"","runtime":27,"season_number":1,"show_id":84107,"still_path":"/jq2IBunxD21f5YZ7GsAGUl64guX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"In a modern-day monarchical Korea, a bright musical actress enters an unforgiving world of sinister secrets when she marries the emperor.","id":112731,"poster_path":"/boqVcljblUnwf9tygrEVzsEXQbP.jpg","season_number":1,"vote_average":0}}}