{
    "adult": false,
    "backdrop_path": "/fPFcBkg6MrcUmedwFjxQKDBI2eP.jpg",
    "created_by": [],
    "episode_run_time": [
        60
    ],
    "first_air_date": "2016-03-20",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "https://www.bbc.co.uk/programmes/b092l8ms",
    "id": 84488,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2017-09-21",
    "last_episode_to_air": {
        "id": 1629889,
        "name": "Hyena People of Ethiopia",
        "overview": "Hyenas are loathed and feared by many people. Wildlife cameraman Gordon Buchanan journeys across Ethiopia to find out how the people here can live so close to these powerful carnivores. Ethiopia has more hyenas than anywhere else in the world, and Gordon wants to find out why.\n\nHe starts his journey in the capital, Addis Ababa. Even here on the outskirts of this massive city, spotted hyenas prowl looking for food. Local hyena expert Girum Henok takes Gordon on foot to see hyenas at night in a small patch of forest. Weighing up to 90 kilos and capable of killing lions in packs, hyenas are one of Africa's most impressive carnivores. Girum tells Gordon that hyenas are tolerated here because people believe hyenas ward off the devil.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2017-09-21",
        "episode_number": 3,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 60,
        "season_number": 2,
        "show_id": 84488,
        "still_path": null
    },
    "name": "Tribes, Predators, and Me",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 332,
            "logo_path": "/7HVPn1p2w1nC5oRKBehXVHpss7e.png",
            "name": "BBC Two",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 6,
    "number_of_seasons": 2,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Tribes, Predators, and Me",
    "overview": "Wildlife cameraman Gordon Buchanan travels to the remotest regions on three continents to join three tribal families, learning their unique traditional survival skills and how they live alongside the world’s most iconic and dangerous animals.",
    "popularity": 1.791,
    "poster_path": "/r0h3thyRNYK0bi6Sg8hkWvMZOIh.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2016-03-20",
            "episode_count": 3,
            "id": 113432,
            "name": "Season 1",
            "overview": "Gordon Buchanan learns the wildlife secrets of tribes living with dangerous animals.",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2017-09-07",
            "episode_count": 3,
            "id": 113452,
            "name": "Season 2",
            "overview": "Gordon Buchanan joins three tribes to see how they live close to fierce predators.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 8.7,
    "vote_count": 3,
    "season_data": {
        "1": {
            "_id": "5bfed0b992514169ad0446bc",
            "air_date": "2016-03-20",
            "episodes": [
                {
                    "air_date": "2016-03-20",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1629802,
                    "name": "Anaconda People of the Amazon",
                    "overview": "Gordon joins a Waorani tribal family in Ecuador's Amazon jungle as they search for giant anacondas.\n\nThe tribe know this remote rainforest and its spectacular wildlife better than anyone else. They teach Gordon their secrets for surviving here, using blow pipes and sharpened sticks to hunt monkeys and wild pigs.\n\nBut his greatest challenge is to help them catch and release a massive anaconda, an animal of spiritual importance that could hold the key to their future.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 84488,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-03-27",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1629885,
                    "name": "Lion People of the Kalahari",
                    "overview": "Gordon joins a group of Bushmen in Botswana's Kalahari Desert to learn how to survive on foot among wild lions.\n\nThe Ju/'hoansi Bushmen teach Gordon their ancient survival secrets, how to make fire, find honey and gather water from desert plants. He sees them hunt with poisoned arrows and track predatory lions. These big cats are a terrifying presence, but can Gordon be brave enough to help his tribal family approach them on foot to retrieve meat to feed the tribe?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 84488,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-04-03",
                    "episode_number": 3,
                    "episode_type": "finale",
                    "id": 1629886,
                    "name": "Crocodile People of New Guinea",
                    "overview": "Crocodiles are an animal we fear, and with good reason - they kill hundreds of people each year. Gordon Buchanan journeys up Papua New Guinea's remote Sepik River to meet the remarkable tribes who have learnt to live with these terrifying reptiles.\n\nCrocodile hunters invite Gordon to join them catching adult crocodiles with their bare hands, and Gordon meets a tribe who believe a giant crocodile protects them from their human enemies. Does Gordon trust the tribe enough to swim in the giant crocodile's lake?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 84488,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "Gordon Buchanan learns the wildlife secrets of tribes living with dangerous animals.",
            "id": 113432,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5bff126f0e0a262cfb04b4df",
            "air_date": "2017-09-07",
            "episodes": [
                {
                    "air_date": "2017-09-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1629887,
                    "name": "Shark People of the Pacific",
                    "overview": "Gordon Buchanan joins a tribal family on a remote Pacific island to see if it is possible to live close to sharks. Sharks are an animal most people find terrifying, but the men of Owarigi island in the Solomon Islands freedive to catch fish and encounter dangerous sharks almost every day, sometimes at night. Can the islanders teach Gordon to swim and share the ocean with sharks in this tropical paradise?\n\nThe island rarely receives visitors and Gordon's arrival is greeted by a seemingly hostile ceremonial reception. He is soon welcomed by his mentors, cousins Moses and Sosimo, who teach him how to freedive and shoot a spear gun. Gordon sees sharks underwater here and learns that these predators are shy and attracted to fish not people. He then discovers something he didn't expect - the people of this small island are dependent on the ocean to survive, but fish and sharks are in worrying decline here. Commercial fishing and the shark-finning trade have arrived in this remote island, putting the islanders' future at risk. Gordon learns about the island's complex relationship with sharks and their ancient fishing techniques. Then he joins Moses and Sosimo on a spectacular shark dive on a protected reef teeming with fish and sharks. Before Gordon leaves, he witnesses the island's chiefs deciding to protect part of their reefs to preserve fish and sharks. A remarkable and moving insight into the underwater world of a unique and threatened island culture impacted by the outside world.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 84488,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Series Director",
                            "department": "Directing",
                            "credit_id": "64c6716ccadb6b01066d7e86",
                            "adult": false,
                            "gender": 1,
                            "id": 4188140,
                            "known_for_department": "Directing",
                            "name": "Rachael Kinley",
                            "original_name": "Rachael Kinley",
                            "popularity": 0.011,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1629888,
                    "name": "Eagle People of Mongolia",
                    "overview": "For thousands of years, Kazakh people of western Mongolia have formed a hunting partnership with golden eagles to help them catch furs to stay warm in the freezing winters. Wildlife cameraman Gordon Buchanan joins a family of nomads to learn about golden eagles from these experts and help them train a young eagle to hunt. Gordon has a few painful lessons learning how to train and fly his young eagle. An eagle's training starts when it is less than a year old. Kazakhs always hunt with females as they are larger and fiercer than males. Gordon works with a young eagle to prepare it for its first hunt - will they be able to learn to trust and work with each other? And will he be able to get to grips with flying her, taking into account the wind and terrain, without getting hurt in the process? Gordon spends days with his young eagle to build her trust - even letting her sleep in his tent. But it is not just the eagle he has to bond with - he has got to get to grips with carrying an eagle on horseback, as well as mucking in with daily chores. Eventually Gordon faces some of the area's top hunters in a 'lure drag' tournament. Gordon's young eagle is not a successful hunter yet, but she shows promise. Then Gordon's mentor Sailau releases his older eagle back to the wild to breed. This older eagle has been Sailau's hunting partner for eight years and it is a touching moment as he says goodbye to his companion. It is a poignant act that illustrates the respect and love these remarkable people have for an iconic predator that has been persecuted across the world.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 84488,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [
                        {
                            "job": "Series Director",
                            "department": "Directing",
                            "credit_id": "64c6716ccadb6b01066d7e86",
                            "adult": false,
                            "gender": 1,
                            "id": 4188140,
                            "known_for_department": "Directing",
                            "name": "Rachael Kinley",
                            "original_name": "Rachael Kinley",
                            "popularity": 0.011,
                            "profile_path": null
                        }
                    ],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-09-21",
                    "episode_number": 3,
                    "episode_type": "finale",
                    "id": 1629889,
                    "name": "Hyena People of Ethiopia",
                    "overview": "Hyenas are loathed and feared by many people. Wildlife cameraman Gordon Buchanan journeys across Ethiopia to find out how the people here can live so close to these powerful carnivores. Ethiopia has more hyenas than anywhere else in the world, and Gordon wants to find out why.\n\nHe starts his journey in the capital, Addis Ababa. Even here on the outskirts of this massive city, spotted hyenas prowl looking for food. Local hyena expert Girum Henok takes Gordon on foot to see hyenas at night in a small patch of forest. Weighing up to 90 kilos and capable of killing lions in packs, hyenas are one of Africa's most impressive carnivores. Girum tells Gordon that hyenas are tolerated here because people believe hyenas ward off the devil.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 84488,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "Gordon Buchanan joins three tribes to see how they live close to fierce predators.",
            "id": 113452,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        }
    }
}