{
    "adult": false,
    "backdrop_path": "/gWc9p0tsnGqiPxyXrZ2wLXZe90Y.jpg",
    "created_by": [],
    "episode_run_time": [
        60
    ],
    "first_air_date": "2016-01-26",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "https://www.bbc.co.uk/programmes/b08fpbkd",
    "id": 84482,
    "in_production": false,
    "languages": [
        "en"
    ],
    "last_air_date": "2020-05-28",
    "last_episode_to_air": {
        "id": 2250590,
        "name": "Episode 4",
        "overview": "",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2020-05-28",
        "episode_number": 4,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 60,
        "season_number": 4,
        "show_id": 84482,
        "still_path": null
    },
    "name": "The Real Marigold Hotel",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 4,
            "logo_path": "/uJjcCg3O4DMEjM0xtno9OWFciRP.png",
            "name": "BBC One",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 15,
    "number_of_seasons": 4,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "The Real Marigold Hotel",
    "overview": "A group of famous faces travel to India to see if retiring in India would be better than retiring in England.",
    "popularity": 8.99,
    "poster_path": "/2tJdxPxHsA21RaZY4BJYk0t9dqp.jpg",
    "production_companies": [
        {
            "id": 61485,
            "logo_path": "/zmJQMYKn6VdC1YUxK76u54TImIP.png",
            "name": "Twofour",
            "origin_country": "GB"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2016-01-26",
            "episode_count": 3,
            "id": 113425,
            "name": "Season 1",
            "overview": "A group of celebrities see if they can have a better retirement in India than in the UK.",
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2017-02-15",
            "episode_count": 4,
            "id": 113447,
            "name": "Season 2",
            "overview": "A group of celebrities see if they can have a better retirement in India than in the UK.",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2018-08-01",
            "episode_count": 4,
            "id": 113448,
            "name": "Season 3",
            "overview": "A group of celebrities see if they can have a better retirement in India than in the UK.",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2020-04-30",
            "episode_count": 4,
            "id": 149651,
            "name": "Season 4",
            "overview": "A group of celebrities see if they can have a better retirement in India than in the UK.",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Ended",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 8,
    "vote_count": 1,
    "season_data": {
        "1": {
            "_id": "5bfeca7ec3a368637004db1b",
            "air_date": "2016-01-26",
            "episodes": [
                {
                    "air_date": "2016-01-26",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1629796,
                    "name": "Episode 1",
                    "overview": "In the first episode the group arrives at their new home in Jaipur - a private mansion known as a haveli in the heart of the old city - and are initially unsettled by the realities of living in India: hectic roads, animals in the street, chickens killed to order and poor toilet facilities. The heat and hard work makes them consider whether they can do this alone or need to take advantage of the cheap staff costs to settle here.\n\nJaipur is full of hundreds of years of history, best seen in its impressive buildings, so the group head out to visit the jewel in Jaipur’s crown, the 500 year old Amer Fort. Their guide also offers to show them his local home where they begin to understand the gulf between rich and poor and the impact of the caste system. They are also invited to take tea with Jaipur’s royal family at the opulent Rambagh Palace, where they mix with high society in the finest surroundings.\n\nChef Rosemary is finding it hard to unwind from her normal hectic life, so tries meditation for the first time and is surprised by the results. Meanwhile, dancer Wayne makes the most of his wish to explore his spiritual side by attending the daily morning prayers and visiting the beautiful Galti Ji temple, which is home to a troop of mischievous monkeys.\n\nTo end their first week the cast throw a party to meet their new neighbours, with special performances, as they begin to feel more at home on the other side of the world.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-02",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1629860,
                    "name": "Episode 2",
                    "overview": "The group start to settle into normal life in India, with Wayne and Bobby taking a trip to the barbers for a cut-throat shave, and Miriam and Patti making a visit to the local laundry woman to see how things are done Indian-style.\n\nJan, who has a keen interest in astrology, attends a psychic guru and is astounded at his profound observations on her life. The group really take to yoga, learn some Hindi and take advantage of the cheap and impressive medical care. After undergoing some tests, both Miriam and Rosemary hear some news they didn't want to hear but needed to know.\n\nTheir first big night out is to the swanky Paladio, popular with local ex-pats, where Wayne finds out about attitudes to gay people in India and Jan discovers how easy it would be for her as a single woman to move out here.\n\nTo round their second week off, the group test out long-distance travel by taking a 150-mile trip to the jewel in India's crown, the Taj Mahal. Miriam, Rosemary and Wayne make the most of travelling by train, an unforgettable experience, while Roy, Patti and Jan take the chauffeur-driven car option.\n\nThe Taj Mahal, the world's most impressive monument to love, makes the group reflective and its sheer beauty brings Miriam to tears.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2016-02-09",
                    "episode_number": 3,
                    "episode_type": "finale",
                    "id": 1629861,
                    "name": "Episode 3",
                    "overview": "The group take part in laughing yoga, with hilarious results. Then go in search of a cultural fix, finding it in the heart of Jaipur's largest slum which has been home to acrobats, magicians and puppeteers for centuries.\n\nThey visit Varanasi, a hugely popular destination and one of the holiest Hindu cities in India. Hindus visit to be purified by the waters of the Ganges and to cremate their dead in the hope they have the best chance of reaching nirvana.\n\nSettling into local life, they attend Ganesh Chaturti festival, one of the highlights of the Hindu calendar and a riot of colour and noise, packed with people, floats and elephants.\n\nBobby and Jan lead the group in a hunt for property. Bobby is keen to find somewhere to buy, while Jan falls in love with the idea of renting an apartment in a haveli amongst a local family.\n\nWith one week left of their Indian adventure, what conclusions will they reach about the realities of retiring to the other side of the world?",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 1,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "A group of celebrities see if they can have a better retirement in India than in the UK.",
            "id": 113425,
            "poster_path": null,
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "5bfefe94c3a36869ae04d10f",
            "air_date": "2017-02-15",
            "episodes": [
                {
                    "air_date": "2017-02-15",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1629862,
                    "name": "Episode 1",
                    "overview": "Entertainer Lionel Blair, wildlife presenter Bill Oddie, actress Amanda Barrie, snooker champion Dennis Taylor, TV personality Rustie Lee, TV doctor Miriam Stoppard, Three Degrees singer Sheila Ferguson and Just Good Friends actor Paul Nicholas arrive at their new home, a 16th-century mansion in Old Kochi.\n\nSheila is keen to make sure she gets what she wants out of the experience, but Lionel finds dealing with the realities of living in India unsettling - the animals in the street, the more basic way of life and the piles of rubbish that can distract from the beauty. Paul, Bill and Dennis rise to the challenge with humour and classic one-liners, and Rustie and Miriam seem charmed by their first days here. The group then head off to visit the world-famous backwaters, hundreds of miles of waterways that criss-cross through the villages and jungles, on traditional houseboats.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-02-22",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1629863,
                    "name": "Episode 2",
                    "overview": "The gang continue to settle into Indian life and, for Amanda Barrie's birthday, attend some local theatre performances.\n\nUnfortunately, a yoga session triggers Amanda's vertigo, but Kochi has one of the most advanced hospitals in the country.\n\nLionel Blair, who has also had health issues over the years, investigates Ayurveda, an alternative medicine, while Bill Oddie takes a wildlife trip into the jungle and reveals how exploring the natural world has helped with his mental health problems.\n\nFinally, everyone sets off to visit one of India's most spectacular temples - but the journey involves a 13-hour overnight train and a very hairy taxi ride.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-08",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1629864,
                    "name": "Episode 3",
                    "overview": "Amanda and Rustie visit a local hair salon and meet a bride-to-be getting styled for her big day. The bride invites them to her wedding, so the whole group go to buy traditional clothes, with hilarious consequences.\n\nThe group attend the Hindu ceremony in their Indian finery despite some wardrobe malfunctions on the way. They are blown away by the spectacle and the importance of family in an Indian marriage union and are touched by how welcome they are made to feel.\n\nAfter the emotion of the wedding, Sheila reflects on her own love life, revealing that since the sudden death of her partner she has been single for eight years. She announces that she is ready to start dating again and realises the only thing that would definitely convince her to make a big move to living in India would be a man.\n\nMiriam and Lionel, who are both Jewish, discover Old Kochi has a surprising connection to their heritage in an area called Jew Town. A visit to the synagogue makes Miriam reflect on the huge impact her own marriage had on her family when she chose to marry outside of the Jewish faith. As a result, her father declared she was dead to him and refused to speak to her for many years. Their tour guide invites them to his home, where Miriam discovers his own painful story of love has striking similarities to hers.\n\nBill takes half the group along to one of the biggest festivals in Kerala, Puli Kali, which celebrates the tiger. He ends up volunteering to take part, which means stripping off and having his belly shaved and painted as a tiger, before dancing down the streets amongst a throng of thousands. It is an experience that cements his love for India.\n\nAn invitation to one of the premier members-only clubs in Kerala, the Yacht Club, gives the group a chance to meet up with successful locals and ends in the offer of a dinner date for Sheila.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2017-03-15",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 1629866,
                    "name": "Episode 4",
                    "overview": "Half of the group visit the dramatic hill stations of the Nilgiri mountains, but the drive involves a treacherous climb that has them on the edge of their seats. Dennis and Paul complete the journey by steam train, arriving in Ooty, the town where snooker was invented.\n\nBill takes Rustie and Miriam on a wildlife walk in the tea plantations. They are all glad of the cooler climate after the humidity of Old Kochi.\n\nSheila, Amanda and Lionel attend a Hindu ancestor ceremony, held to remember departed loved ones. Sheila then goes on a flat hunt with her daughter, who is visiting from Dubai, while the others look at a new phenomenon in India - retirement villages.\n\nWith the end of their trip approaching, the group hold a final party to thank everyone they have met during their stay.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 2,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "A group of celebrities see if they can have a better retirement in India than in the UK.",
            "id": 113447,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "5bfefea40e0a262cfb04a371",
            "air_date": "2018-08-01",
            "episodes": [
                {
                    "air_date": "2018-08-01",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1629867,
                    "name": "Episode 1",
                    "overview": "Selina Scott, Susan George, Stephanie Beacham, Ian and Janette Tough (aka the Krankies), Syd Little, Peter Dean, Bob Champion and Stanley Johnson arrive at their new home in Udaipur.\n\nFirst-time curry eater Bob struggles to adjust to the Indian diet, and the Krankies find dealing with the realities of living in India unsettling - the animals in the street, the more basic way of life and the piles of rubbish that can distract from the beauty.\n\nVeteran of India Stanley embraces his first few days, swimming alongside the locals and throwing himself into the challenge with good humour, alongside Syd, who enjoys immersing himself into the local way of life, including his first ever yoga class. While enjoying her first trip to India, Selina is used to living on her own so finds the group-living arrangements quite a test.\n\nWith the group not yet united in their opinion on the place, they head off to see another part of Rajasthan. Some of them head to Jodphur, where Bob gets back in the saddle as he visits one of India's oldest polo clubs, and they also visit the world-famous Mehrangarh Fort, which astounds Selina and Stanley with its history, beauty and grandeur.\n\nMeanwhile, Stephanie, Syd and Peter embrace India's spiritual side as they visit one of the oldest ashrams in the region. Sceptical at first, Syd is soon won round by the calm aura of the place and the sense of peace he's finding in India. Stephanie, Peter and Syd immerse themselves in the ashram community and find the magic of India is having an effect on all of them, which culminates when they witness the ancient ritual of firewalking.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-08",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1629868,
                    "name": "Episode 2",
                    "overview": "It's the second week in India, and the senior citizens have settled into their new home and are embracing life in Udaipur. Having found their feet with group living, they go in search of their favourite pastimes.\n\nSyd, Bob and the Krankies head to the local park, and realise the benefits of living in a warm country as they get stuck into exercising outdoors, and Stanley, Peter and Selina decide to tackle the language and try their hand at Hindi.\n\nThe group receive a grand invitation from the maharanah and are invited to mingle with Udaipur's high society at the City Palace, where entertainer Janette Krankie wastes no time in showing off her dancing skills.\n\nCricket lover Stanley makes a friend at the local cricket club and proves that age is no barrier to being at the crease, as he gets in his whites and has a crack against the local team. Music fan Syd searches for his own passion and discovers a love for the sitar, with his first lesson proving an unexpected challenge. Meanwhile, Peter goes in search of a lady friend and tries his hand at dating, and the Krankies are ready to escape the city, and go on a rural adventure of their own, enjoying the surrounding countryside.\n\nThe group end the week with a trip to the northern state of the Punjab to visit one of India's most spectacular and holiest cities. As they travel to the magnificent Golden Temple in Amritsar, Stanley goes back in time as he revisits somewhere he last went to in his student days. As the senior citizens join in in some of the traditions of the Sikh faith, they discover the sense of giving and strength of community at the heart of Sikhism and are once again moved by the magic of India.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 1629869,
                    "name": "Episode 3",
                    "overview": "The group are now settled into life in Udaipur and are ready to explore further afield. Country lovers Bob, Susan and Selina want to see more of rural Rajasthan and head into the hills to go horse riding and camping, but it is not quite the glamping trip they imagined.\n\nOver the campfire they open up about the difficult times in their lives, Bob's battle with cancer and Susan's loss of her husband.\n\nMeanwhile, in Udaipur, Syd and Ian continue their Indian cookery lessons, Stanley the adventurer relives his youth on the back of a motorcycle, and Stephanie explores her inner self through meditation.\n\nThe group end the week with a trip to the neighbouring state of Gujarat for one of India's biggest annual festivals, Navratri, but to get there involves a 12-hour journey on a sleeper train. After attempting to learn a Gujarati folk dance, they get kitted out in traditional costumes and join thousands of worshippers for a night of celebrations for the powerful Hindu warrior goddess Durga. Susan, Selina and Stephanie get caught up in the intoxicating atmosphere, dancing with abandon into the early hours.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2018-08-22",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 1629870,
                    "name": "Episode 4",
                    "overview": "After a month of testing the waters to see whether they could live a life of retirement in India, the group's stay is coming to an end. It is their final week of living at the Udaipur haveli.\n\nThe senior citizens make the most of their last week together, with some enjoying the last of what the local city has to offer while others are setting off on ventures further afield.\n\nSusan, Syd and the Krankies go on one last adventure as they visit the pilgrimage town of Pushkar, where loved ones are remembered and relationships are celebrated. Syd and Susan are both moved by the spirituality of the holy city and share special memories together.\n\nCloser to home, Bob - still in search of some relief for his back problems - delves into the world of natural medicine, and his first Ayurvedic treatment comes as rather a surprise. Stephanie continues her spiritual journey in India and takes Susan to see a palmist and astrologer, where they\n\ndiscover good things are on the horizon.\n\nKeen to go out with a bang, Stanley organises a final cricket match between the senior citizens and their new local friends. Getting into the spirit of India's most famous sport, they don on their cricket whites and take to the crease - some for the first time in their lives! Captaining the group is Stanley, who rallies the troops as they get stuck in and take on the locals.\n\nThe month comes to an end with a final party and a musical rendition from Syd. The group reflect on the friendships formed, and lessons learnt, at the end of a wonderful month in Rajasthan.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 3,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "A group of celebrities see if they can have a better retirement in India than in the UK.",
            "id": 113448,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "5eac075901e4d1001f1d421c",
            "air_date": "2020-04-30",
            "episodes": [
                {
                    "air_date": "2020-04-30",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2250585,
                    "name": "Episode 1",
                    "overview": "Britt Ekland, Duncan Bannatyne, Dame Zandra Rhodes, Paul Chuckle, Henry Blofeld, John Altman, Susie Blake and Barbara Dickson arrive in Puducherry and settle into their new home.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2250586,
                    "name": "Episode 2",
                    "overview": "The group travel to India’s largest golden temple to explore Hinduism before taking a night train to Madurai to experience the sights and sounds of the Chitterai festival.",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2250589,
                    "name": "Episode 3",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-28",
                    "episode_number": 4,
                    "episode_type": "finale",
                    "id": 2250590,
                    "name": "Episode 4",
                    "overview": "",
                    "production_code": "",
                    "runtime": 60,
                    "season_number": 4,
                    "show_id": 84482,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "A group of celebrities see if they can have a better retirement in India than in the UK.",
            "id": 149651,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        }
    }
}