{"adult":false,"backdrop_path":"/aW1MSx1PD8KKB5X2t4yDvehBlCM.jpg","created_by":[{"id":3157386,"credit_id":"62626159168ea315582ecea9","name":"Kim Yi-young","gender":1,"profile_path":null}],"episode_run_time":[],"first_air_date":"2019-02-11","genres":[{"id":18,"name":"Drama"},{"id":10759,"name":"Action & Adventure"}],"homepage":"https://programs.sbs.co.kr/drama/haechi/","id":86094,"in_production":false,"languages":["ko"],"last_air_date":"2019-04-30","last_episode_to_air":{"id":1776575,"name":"King Yeongjo and the Public Conversation","overview":"King Yeongjo decides to have a public hearing and listen to the difficulties of the people. He promises to reduce tax by half. The nobles are angry that landlords will be compensating for the remaining amount. The dispute is to be settled by a vote.","vote_average":0,"vote_count":0,"air_date":"2019-04-30","episode_number":48,"episode_type":"finale","production_code":"","runtime":27,"season_number":1,"show_id":86094,"still_path":"/iL9tkgl3mtzdhXCbtgVGMfyYDdN.jpg"},"name":"Haechi","next_episode_to_air":null,"networks":[{"id":156,"logo_path":"/uHQFPvRTlpgaIFQVN8eKWEnFOll.png","name":"SBS","origin_country":"KR"}],"number_of_episodes":48,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"해치","overview":"Set during the Joseon Dynasty period, the series follows three people from different walks of life who came together to help Prince Lee Geum claim the throne and reform the Saheonbu.","popularity":27.061,"poster_path":"/1LvhwPDL4atqt3SuLDi1kfDtjdG.jpg","production_companies":[{"id":56797,"logo_path":"/ulyFYl4Spqpr6pZYtX0f9WLUzHt.png","name":"Kim Jong-hak Production","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2019-02-11","episode_count":48,"id":117334,"name":"Season 1","overview":"","poster_path":"/2w0ghJUDs3kQSjuDQfacS8i1Frx.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.2,"vote_count":10,"season_data":{"1":{"_id":"5c46d6689251410e2450b3d5","air_date":"2019-02-11","episodes":[{"air_date":"2019-02-11","episode_number":1,"episode_type":"standard","id":1680342,"name":"The Lowly Prince","overview":"Prince Yeoning is a prince discriminated against because of his mother's peasant background. He returns to Hanyang to support Prince Yeonryeong take the throne against the tyrannic Prince Milpoong, who would do anything to take power. The Saheonbu is determined to uncover Prince Milpoong's crimes and bring justice to the kingdom. The power struggle between the Patriarchs and Disciples is just beginning.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/el33UuQIlI9VCIwnpSMWC5BBKKi.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-11","episode_number":2,"episode_type":"standard","id":1680343,"name":"The Death Ledger","overview":"The King decides to reinstate Prince Milpoong's great-grandmother from her disgrace and restore relations with Milpoong. This brings Milpoong one step closer to the throne. Meanwhile, Prince Yeoning is being chased by Park Moon Soo for allegedly substituting for the state exam. Could Prince Milpoong be behind this scheming? The Saheonbu and Yeo Ji intend to find Milpoong's Death Records and find the opportunity when he goes on a hunt.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/2OmcvIUIrrbijMyPCSyHUE7lGaL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-12","episode_number":3,"episode_type":"standard","id":1680344,"name":"Yeo Ji Meets Prince Yeoning","overview":"The relation between Prince Yeoning and Tae Pyeong remains a mystery. The inspectors of Saheonbu are determined to investigate the murder of Yeo Ok and prove that Prince Milpoong is guilty. Meanwhile, Yeo Ji steals a box from Prince Milpoong supposedly containing valuable evidence. Prince Yeonryeong does not want to use illegal force to stop Milpoong from coming to power.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/uoYDmT4CAB7Nw1aJrUZC3nOWkD4.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-12","episode_number":4,"episode_type":"standard","id":1680345,"name":"Welcome Back, Prince Yeoning!","overview":"Moon Soo finds out that the Roh Tae Pyeong he was chasing after was Prince Yeoning. Prince Yeoning decides to spread a rumor about Prince Milpoong and his evil deeds. The rumor eventually reaches the king and the royal court, and the king orders investigators to submit a detailed report. Yeo Ji realizes that she had acquired decisive evidence for where the body of Tae Pyeong is buried.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/8rbagbqmo2JQhN6oyZ4EGmKeEB6.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-18","episode_number":5,"episode_type":"standard","id":1707839,"name":"Prince Mil Poong, You’re Under Arrest!","overview":"Prince Yeoning decides to testify at the Supreme Court of Saheonbu. He confesses that he substituted for Tae Pyeong at the state exam and asks to be exiled for this crime. The officials, however, do not want to believe his accusations of Prince Milpoong. The Head of Saheonbu decides to arrest Prince Milpoong, and everything seems to go as planned.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/4q6EiNbqmj5FWsujs9dO9qHl7tp.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-18","episode_number":6,"episode_type":"standard","id":1707841,"name":"King Sukjong’s Secret","overview":"Yeo Ji, Prince Yeoning, and the crew at Saheonbu celebrate with wine and by playing games. Prince Yeonryeong tries to stop his older brother from leaving for Tamna, but Prince Yeoning is not shaken. The Disciples spread a rumor about Prince Yeoning and try to discredit his testimony at the Supreme Court. The Patriarchs ask Prince Yeoning to withdraw his testimony at court so they can bring Prince Milpoong back out.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/yUNa4gXOUkaqlHLwShHjIjze8pm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-19","episode_number":7,"episode_type":"standard","id":1707842,"name":"I Can’t Do This","overview":"King Sukjong calls the Chief Inspector and orders him to help him make Prince Yeoning king. Meanwhile, the Patriarchs have decided to support Prince Yeonryeong. The Minister of Personnel persuades Prince Yeoning to withdraw his testimony and indict Jeong Seok for instigating false testimony. Prince Yeoning feels hopeless about the whole situation and has to testify again.","production_code":"","runtime":28,"season_number":1,"show_id":86094,"still_path":"/lHh9vQfWvaWvohQ3voYAFYzaLwS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-19","episode_number":8,"episode_type":"standard","id":1707843,"name":"Your Majesty!","overview":"King Sukjong tells Prince Yeonryeong about his decision to make Prince Yeoning king. Prince Milpoong is sent away to Qing by the king for his crimes. Just as things start to get hopeless, somebody sends Prince Yeoning information containing Prince Milpoong's secrets and the location of his Deat Records. Meanwhile, Han Jeong Seok is killed in prison, and Prince Milpoong also kills Prince Yeonryeong.","production_code":"","runtime":32,"season_number":1,"show_id":86094,"still_path":"/ssnfyKcHenIN6RjUWd7gA8sbs0u.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-25","episode_number":9,"episode_type":"standard","id":1707844,"name":"Gyeongjong Era","overview":"The Crown Prince has become king but does not win respect because of a lack of an heir. He is powerless at court. Meanwhile, Prince Yeoning meets the Minister of Personnel to tell him that Prince Milpoong probably killed Prince Yeonryeong, but the Minister is only interested in solidifying political power. The Patriarchs scheme with prisoners and let them escape, but Prince Yeoning sees through it.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/qWIffJ9KufQgD9yfH7pm2gpY2P3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-25","episode_number":10,"episode_type":"standard","id":1707845,"name":"Prince Mil Poong is Back","overview":"Yeo Ji and her colleagues think Prince Yeoning has betrayed them. They were kicked out of Saheonbu and are now trying to make ends meet. It's finally Moon Soo day of the exam, and a suspicious man tries to help him get a good seat. As the king is without an heir, the queen starts looking for a possible stepson. Delegates from the Ming dynasty visit Joseon, and everyone is surprised to see Prince Milpoong back, backed by the Chinese. He is intent on winning the throne.","production_code":"","runtime":29,"season_number":1,"show_id":86094,"still_path":"/4JSlBlU6tUwEpFBrzKUZH97aYsu.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-26","episode_number":11,"episode_type":"standard","id":1707846,"name":"Prince Yeoning’s Plan","overview":"Yeo Ji and her colleagues find out that Prince Yeoning had been supporting them all along. It's finally the day the exam results are announced, and Moon Soo fails to find his name on the list. He is certain that there is corruption going on surrounding the state exam. Inspector Yoon Hyeok knows about the corruptions but can't find a way to investigate them. This changes when he meets Park Moon Soo.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/uufvfnHlqH1Qc3yqSCkxcUD4xCU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-02-26","episode_number":12,"episode_type":"standard","id":1707847,"name":"The Civil Service Exam","overview":"Prince Milpoong is hosting the delegate from Qing Dynasty and takes him out for hunting. Prince Yeoning appears out of nowhere and interferes with Milpoong's plan. Minister of Personnel and the Patriarchs are in a situation where they have to choose between Prince Yeoning and Prince Milpoong. Prince Yeoning's plan is to create a division within the Patriarchs and make himself king.","production_code":"","runtime":29,"season_number":1,"show_id":86094,"still_path":"/3jddD3WMco5cEQKUsKOcSE70R6t.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-04","episode_number":13,"episode_type":"standard","id":1707848,"name":"Corruptions Behind the Civil Service Exam","overview":"Prince Yeoning returns to his former colleagues Park Moon Soo and Yeo Ji and tells them he was behind the investigation on exam corruption. Prince Yeoning is now determined to become king. But the Minister of Personnel meets with the king and tries to persuade him otherwise. Meanwhile, the Patriarchs manipulate public opinion so the exam corruption case won't attract too much attention. And the Saganwon is out to stop the king from putting pressure on the Patriarchs.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/95WaPzo7t9O482DKoLxmDF3uUsR.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-04","episode_number":14,"episode_type":"standard","id":1707849,"name":"Prince Yeoning for King","overview":"Moon Soo and his colleagues respond to the Saganwon by rallying the Confucian scholars to protest the corruption going on among the Patriarchs. Prince Milpoong is aware of the tables turning and decides to take action with his Death Records. To check the Minister of Personnel's hegemony over the Patriarchs, the Prime Minister goes to the king and requests that Prince Yeoning be appointed as the heir to the throne. Meanwhile, Prince Yeoning and Yeo Ji are being pursued by a group of assassins.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/t7V0MfIm6c1FiM82QmRtBRlDsCL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-05","episode_number":15,"episode_type":"standard","id":1707850,"name":"A Chaotic Night","overview":"Chang Joong and Yi Gyeom meet the king to recommend Prince Yeoning as the Crown Prince. Meanwhile, Moon Soo and his colleagues notice that Yeo Ji isn't back after she left to talk to the students. It turns out the assassins sent to kill Prince Yeoning were ordered by Prince Milpoong and not Min Jin Heon. The widowed Queen recommends Prince Yeoning, and the king, after some doubt, orders Prince Yeoning be made Crown Prince.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/w0MbMe2asH5pmr7x3gqLHyvAdLS.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-05","episode_number":16,"episode_type":"standard","id":1707851,"name":"It’s Crown Prince Now","overview":"Yeo Ji is found severely injured in a barn. Her colleagues bring her back home and call the doctor to treat her. The king's royal guards arrive to announce that Prince Yeoning has been made Crown Prince. Dal Moon, who once worked for Jin Heon, is inspired by Prince Yeoning and now works for him. Prince Yeoning is worried about Yeo Jin, and he has a hard time hiding his feelings for her. The new exam results are out, and Park Moon Soo finally passes.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/fd7drWLifPx4aix0wTJUnDICzdN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-11","episode_number":17,"episode_type":"standard","id":1707852,"name":"I’m an Inspector Now","overview":"The Qing is rumored to dealing in the human trafficking of girls from Joseon. Yeo Ji is recruited as an undercover investigator on the case. Prince Yeoning is unhappy at Yeo Ji being constantly in danger. Meanwhile, Moon Soo, as a new member of Saheonbu, is trying to endure all the hard training. The palace officials show that they don't acknowledge the Crown Prince by not showing up at the Prince's first-morning lecture.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/hfu5g8tWOWGwziKvnwQfWqrqd6P.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-11","episode_number":18,"episode_type":"standard","id":1707853,"name":"It’s Not the Qing!","overview":"Dal Moon's men are investigating the human trafficking case by Qing. The new courtesan house emerges as their target as someone from Qing owns it. A murder occurs of a nobleman, and Min Jin Heon and the Saheonbu are both investigating it. Yeo Ji finds out the courtesan house is where the deals take place for selling and buying girls. Prince Yeoning senses danger and goes after Yeo Ji.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/jSotSZrhOv6z2gQu8qWjas3b7qX.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-12","episode_number":19,"episode_type":"standard","id":1707854,"name":"The Crown Prince Is Under Arrest","overview":"Ji Pyeong is murdered, and Prince Yeoning is witnessed to be the murderer and it arrested by Saheonbu. He is investigated by Saheonbu but is not willing to speak the truth. Meanwhile, behind the murder cases are what is known as master-murderers and the murderer of Ji Pyeong turns out to be a little girl wearing a tattoo. Moon Soo and Yeo Ji investigate what's behind the murder cases.","production_code":"","runtime":28,"season_number":1,"show_id":86094,"still_path":"/2WeBrPGrHkNEVhcprDu3eW816DD.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-12","episode_number":20,"episode_type":"standard","id":1707855,"name":"A Little Girl’s Story","overview":"Saheonbu threatens to resign all its members unless the right to investigate the murder case involving Prince Yeoning is given to them. The king calls Prince Yeoning and asks him to tell him everything he knows about the recent incidents. When he does, the king is deeply moved and decides to give Prince Yeoning three days to prove himself innocent. The investigation of the murders leads to human trafficking deals with Qing and to the courtesan house.","production_code":"","runtime":33,"season_number":1,"show_id":86094,"still_path":"/iB8nGK6BjBPijEgT3KZPss8QyDr.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-18","episode_number":21,"episode_type":"standard","id":1707856,"name":"The Crown Prince is Arrested","overview":"The girl belonging to the master murdering group was arrested, and Prince Yeoning is accused of supporting the group. The Patriarchs are putting pressure on the king to have the Crown Prince dethroned. Moon Soo and his colleagues try to stop the Saheonbu from investigating and beating the master murderers but fail. The heads of both parties meet to discuss future matters, and Min Jin Heon is adamant that the nobility runs the kingdom.","production_code":"","runtime":28,"season_number":1,"show_id":86094,"still_path":"/q644pWZTwKAUxYrEpLF0rZwpYJl.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-18","episode_number":22,"episode_type":"standard","id":1707857,"name":"The People","overview":"The nobility demands the king to dethrone the Crown Prince, but the king is clear that this will not be granted. Prince Yeoning does his part by attending a banquet and making a speech on behalf of the peasants, speaking for their rights. The nobility is outraged about the palace standing against them, but the commoners risk their lives to show support for the Crown Prince. Yeo Ji tells Prince Yeoning she wants to become a court lady to protect him.","production_code":"","runtime":33,"season_number":1,"show_id":86094,"still_path":"/az1uprE7FtByokhhPuDZlg1GSaQ.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-19","episode_number":23,"episode_type":"standard","id":1707858,"name":"A Husband’s Death","overview":"Patrolmen find something suspicious while doing their routine patrol. The people praise Prince Yeoning for standing up for them, and the blame naturally falls on the Saheonbu. A cover-up murder case is revealed when Moon Soo is inspecting the neighborhood. Behind the hired murder is Section Chief of Personnel. The king and Prince Yeoning decide to use this as an opportunity for reform.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/rBj99b3lLeGt11j1cgIkyFgXVUU.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-19","episode_number":24,"episode_type":"standard","id":1707859,"name":"Prince Mil Poong’s Backfire","overview":"Section Chief of Personnel Ik Soo was caught while receiving bribes and ordered the patrolman to be killed when he tried to report the incident. The table is about to turn in favor of the Disciples when Prince Milpoong steps in with a cunning plan. Moon visits Prince Milpoong and is asked by Yoon Yeong to help Prince Milpoong take the throne. Prince Milpoong fabricates a petition signed with Prince Yeoning's name.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/2GOjBExLeYV4Q2b7hWuYDZDUUwm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-25","episode_number":25,"episode_type":"standard","id":1707860,"name":"Re-Evaluation","overview":"As Yoon Hyuk takes office, he orders the officials of the three agencies to all be re-evaluated. Meanwhile, the fake appeal for vicarious governing has wreaked havoc in the palace, and the king is suspecting the Crown Prince of treason. Dal Moon, who used to work for the Crown Prince, is moved by his past feelings for Yoon Yeong and starts to work in her favor.","production_code":"","runtime":28,"season_number":1,"show_id":86094,"still_path":"/ncalzVWOcFCPir7oQkt3vG8k0pV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-25","episode_number":26,"episode_type":"standard","id":1707861,"name":"The Crown Prince’s Repentance Ritual","overview":"The King is convinced that the Crown Prince should take his place, just as the appeal requested. However, the Crown Prince realizes that he's been framed and decides to prostrate before the King and ask for reconsideration. Prince Milpoong has a further plan that will bring down the Crown Prince, and he's waiting for the right time to implement it. The Disciples ask Queen Dowager to persuade the King not to blame the Crown Prince.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/q1yqSgpHQ7xI4JUrR566yNcwJwm.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-26","episode_number":27,"episode_type":"standard","id":1707862,"name":"The Betrayer","overview":"The special judiciary agency is opened to investigate the Crown Prince's involvement in treacherous plottings. Wi Byeong Joo was being interrogated but is released and takes charge of the treason case. Dal Moon is now working for Prince Milpoong. He spreads rumors in the city, saying that the Crown Prince isn't the late king's son. Moon Soo and his colleagues find evidence related to Byeong Joo's coverup of Jeong Seok's murder.","production_code":"","runtime":28,"season_number":1,"show_id":86094,"still_path":"/d0RfhaHpmvN3QyJMrIYyJnxtTuE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-03-26","episode_number":28,"episode_type":"standard","id":1707863,"name":"The Crown Prince Did Nothing Wrong","overview":"Byeong Joo set up a treason case, accusing the son and grandson of two Disciples officials of plotting against the king. The Crown Prince visits Jin Heon privately and asks him to side with him for the time being instead of supporting Prince Milpoong. The Crown Prince notices that the posts that were put up around the city contain a secret message from Dal Moon. The king decides to question the alleged rebels themselves, but Jin Heon intervenes.","production_code":"","runtime":32,"season_number":1,"show_id":86094,"still_path":"/z8V8PJsBE3rfEsMgdCzYGehz7XW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-01","episode_number":29,"episode_type":"standard","id":1745855,"name":"The Crown Prince is Saved","overview":"Prince Yeoning persuades Min Jin Heon to side with him for the moment and stops the special judiciary agency. Meanwhile, Dal Moon turns out to have been secretly supporting the Crown Prince by trying to extract information from Prince Milpoong. The Crown Prince visits Prince Milpoong to help Dal Moon get the decisive information. Moon Soo finds evidence for Byeong Joo's murder of Jeong Seok and decides to do a night inspection.","production_code":"","runtime":32,"season_number":1,"show_id":86094,"still_path":"/2mHQLmlT3pXRFFvdgCHAV1ZdAae.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-01","episode_number":30,"episode_type":"standard","id":1745856,"name":"Arrest Prince Mil Poong!","overview":"Moon Soo and inspectors of Saheonbu arrest Executive Inspector Byeong Joo on charges of murder of Jeong Seok. The king is thinking about what he has done to the Crown Prince and decides to meet with him. Ji Gwang and his men are about to flee to Hamgyeongdo when they are attacked by Saheonbu inspectors. Dal Moon gets the decisive evidence from Prince Mil Poong, and the Crown Prince is after him.","production_code":"","runtime":29,"season_number":1,"show_id":86094,"still_path":"/3WluaUX757LdmJ9NQwqmtxwujWv.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-02","episode_number":31,"episode_type":"standard","id":1745857,"name":"The End to the Treason Case","overview":"Prince Milpoong murders a guard in the court palace, and the guards issue an emergency. The Crown Prince swears to make Prince Milpoong pay for his crimes. Dal Moon tells Yoon Yeong that he had to deceive Prince Milpoong to save her and help the Crown Prince. Byeong Joo is arrested but refuses to admit his crimes and instead says Moon Soo would have done the same thing. The king announces that the treason case was fabricated.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/bxn4E9sVcXt8z8mspJk4ZddSMHN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-02","episode_number":32,"episode_type":"standard","id":1745858,"name":"The Royal Infirmary","overview":"Ja Dong is told that there appeared a blood stain in the medical center. Dal Moon tells the Crown Prince that Prince Milpoong looked strange the day he was taken away. The king is suddenly coughing up blood and falls very sick. He decides to appoint the Crown Prince as his deputy to discuss the matters of the kingdom. It soon turns out that Prince Milpoong may be connected to the bloodstain and the king's failing health.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/jPk8ALdfrdBgDcJVfLBmBLdqkQV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-08","episode_number":33,"episode_type":"standard","id":1753551,"name":"Prince Mil Poong’s Poison","overview":"King Gyeongjong suddenly falls ill, and there are suspicions that Prince Milpoong sneaked into the Royal Infirmary. The Crown Prince stops the royal doctors from giving medicine to the King in case it was poisoned. But his position as Crown Prince is endangered as he comes under suspicion of trying to take the throne. Private doctors are called to the palace to examine the King.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/8AP05sKzrsl44ZtNhXL5cnUSBMa.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-08","episode_number":34,"episode_type":"standard","id":1753552,"name":"King Gyeongjong’s Death","overview":"Moon Soo finds Prince Milpoong in his place of exile and gets him to reveal his plans. He had left a blood mark in the Royal Infirmary so that the Crown Prince would stop the medicine from being given to the King. The poison turns out to have been imported from Qing and is known to have no antidote. The Crown Prince does everything he can, but the King dies.","production_code":"","runtime":29,"season_number":1,"show_id":86094,"still_path":"/14Eq8UG1tvEr829svGSpfEvZwtO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-09","episode_number":35,"episode_type":"standard","id":1753553,"name":"The Rights to Become a King","overview":"King Gyeongjong dies of poisoning, and a rumor spreads that the Crown Prince let him die intentionally. The Chief Justice blames the Crown Prince and objects to his enthronement. The Crown Prince himself questions himself in self-doubt. But with his former teacher's support, the Crown Prince goes to meet Queen Dowager and take control.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/1e2pAMeljaqWzPPXeWfcMAWAmuL.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-09","episode_number":36,"episode_type":"standard","id":1753554,"name":"The 21st King of Joseon","overview":"The Crown Prince is enthroned with the backing of Queen Dowager. But Lee Geum is surprised to hear that his closest allies decided to resign and leave the palace. The deal was sealed so that the Patriarchs could support the king. Meanwhile, Wi Byeong Joo escapes from his place of exile, and an epidemic begins to spread.","production_code":"","runtime":29,"season_number":1,"show_id":86094,"still_path":"/ljqpddDCAehaDg3TjOSi7NF4XNB.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-15","episode_number":37,"episode_type":"standard","id":1761369,"name":"The Plague","overview":"An unidentified plague starts spreading from the southern provinces, and the capital city is soon affected. The commoners start to blame the king who supposedly killed his brother and took the throne. Prince Milpoong and Wi Byeong Joo escaped from their exile place and followed Lee Yin Jwa as he prepares for a revolt. Also, Queen Dowager falls ill from the plague.","production_code":"","runtime":33,"season_number":1,"show_id":86094,"still_path":"/yYKX079w06ZWjISWxyVDCLQsTH8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-15","episode_number":38,"episode_type":"standard","id":1761370,"name":"His Majesty Makes Way","overview":"Rumors are spreading that the King will abandon the palace and his people and escape from the plague. The number of plague patients is climbing. Dal Moon and his men discover that the wells could have been poisoned systematically. Prince Milpoong is suspected to be behind all this. As the commoners start to go wild, the King shows up to console them.","production_code":"","runtime":27,"season_number":1,"show_id":86094,"still_path":"/fLZl1kg2yl8Pp3W1pX6eT3PvYXV.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-16","episode_number":39,"episode_type":"standard","id":1761371,"name":"Curing the Plague","overview":"The king visits the patients at Hwarinseo and consoles them. The riot is prevented. Moon Soo is pursuing Byeong Joo and finds out that he contacted a guard of the Cheongju armory. The king orders a prescription based on the past Cheongju epidemic, and the patients begin to recover. Queen Dowager also recovers from the disease.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/3EYzhZYfIIpCP2Z7uc91l0a2Dnz.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-16","episode_number":40,"episode_type":"standard","id":1761372,"name":"The Rebellions","overview":"Yin Jwa and his men are planning on a revolt, and Byeong Joo is helping him. It turns out that their spies are also within the palace walls. The king takes notice and prepares the royal guards to search for the spies. The head of the police bureau is arrested, and the rebels are forced to postpone their plans.","production_code":"","runtime":27,"season_number":1,"show_id":86094,"still_path":"/kPKBWtvJPb9vbSpn7kM4qiMWzPT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-22","episode_number":41,"episode_type":"standard","id":1767481,"name":"It's a War","overview":"The King's palace finds out that Cheongju Castle has fallen. Prince Milpoong and the rebels convince the people of the provinces that he will bring about a new world. Moon Soo and his men volunteer to fight in the battle to guard the capital. The King orders his soldiers to go to the battle and feels guilty for not fighting with them.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/ryPW4gYeQ4y3LFuNFE5JAmhfLZh.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-22","episode_number":42,"episode_type":"standard","id":1767482,"name":"King Does What a King Does","overview":"The King tries to persuade the Chairman to share the palace positions with the Namin in order to weaken the rebels' motivation. The palace doesn't have enough troops, so they have to decide where to place them. Hearing that the rebels are coming for the capital, high government officials are the first to flee. The royal troops decide to ambush the rebels.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/vQtm06C8VRyjscFDA5rouhZnv0o.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-23","episode_number":43,"episode_type":"standard","id":1767483,"name":"The Ambush Attack at Anseong","overview":"The rebels are ambushed by the government troops and are defeated. Prince Milpoong and Yin Jwa, however, manage to getaway. The Chairman agrees with the King to share government positions with the suppressed Namins, which conciliates the Namins associated with the rebels. The government troops return in triumph, and the King congratulates them.","production_code":"","runtime":30,"season_number":1,"show_id":86094,"still_path":"/1YtPMKV6b3q9BgeaWw9Uhf6y0L8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-23","episode_number":44,"episode_type":"standard","id":1767484,"name":"The Final Victory","overview":"All of the rebels' bases have fallen, and only a few hundred men are remaining. Lee Yin Jwa plans to escape by handing Prince Milpoong over to the royal troops. Meanwhile, Wi Byeong Joo is captured and is punished by law. Yoon Yeong tells Dal Moon where the two escapees are, and Dal Moon asks the King for her safety. Lee Yin Jwa is finally brought before the King.","production_code":"","runtime":31,"season_number":1,"show_id":86094,"still_path":"/frkL35evOagtqbhhWhruGMN9ocx.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-29","episode_number":45,"episode_type":"standard","id":1776572,"name":"Yeongjo’s Reform","overview":"Lee Yin Jwa is arrested and brought before the King. Prince Milpoong, however, is still on the run. The King begins to appoint members of the Namin Party to office as he had promised during the revolt. Both the Patriarchs and Disciples begin to protest against the appointment.","production_code":"","runtime":34,"season_number":1,"show_id":86094,"still_path":"/rBqel9ZXrZKVZtw2xsQ2zzFfdFO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-29","episode_number":46,"episode_type":"standard","id":1776573,"name":"The King Versus the Officials","overview":"The senior officials gather Saheonbu soldiers to arrest Lee Yin Jwa’s father-in-law and his family. They protest against the King’s appointment of Namins. Yoon Yeong tries to help Prince Milpoong get away safely to Qing Dynasty but is killed in an accident. Min Jin Heon supports the King’s reform.","production_code":"","runtime":26,"season_number":1,"show_id":86094,"still_path":"/fZLdRhe3hN5bte0z5wmD0ciAFKE.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-30","episode_number":47,"episode_type":"standard","id":1776574,"name":"Prince Mil Poong's Final Cry","overview":"King Yeongjo decides to abolish the section chief of personnel. The senior officials are furious. Prince Milpoong walks into the palace himself and kills himself. Inspectors at Saheonbu support the King’s decision. Lee Yin Jwa and Wi Byeong Joo are executed.","production_code":"","runtime":33,"season_number":1,"show_id":86094,"still_path":"/39WEQt2NaKJ3qqni2vGx1UeJg9U.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-04-30","episode_number":48,"episode_type":"finale","id":1776575,"name":"King Yeongjo and the Public Conversation","overview":"King Yeongjo decides to have a public hearing and listen to the difficulties of the people. He promises to reduce tax by half. The nobles are angry that landlords will be compensating for the remaining amount. The dispute is to be settled by a vote.","production_code":"","runtime":27,"season_number":1,"show_id":86094,"still_path":"/iL9tkgl3mtzdhXCbtgVGMfyYDdN.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":117334,"poster_path":"/2w0ghJUDs3kQSjuDQfacS8i1Frx.jpg","season_number":1,"vote_average":0}}}