{
    "adult": false,
    "backdrop_path": "/u96fx1QW4JxfJU7pXAmhZjtBihU.jpg",
    "created_by": [],
    "episode_run_time": [
        60
    ],
    "first_air_date": "2019-05-01",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        },
        {
            "id": 80,
            "name": "Crime"
        }
    ],
    "homepage": "https://www.bbc.co.uk/programmes/m0004p7f",
    "id": 89138,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2024-03-31",
    "last_episode_to_air": {
        "id": 5191883,
        "name": "Confessions of a Killer",
        "overview": "A man rings 999 to say he has killed his flatmate and forensics officers search for clues that could prove or disprove the suspect's pleas of self-defence.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2024-03-31",
        "episode_number": 4,
        "episode_type": "standard",
        "production_code": "",
        "runtime": 59,
        "season_number": 4,
        "show_id": 89138,
        "still_path": "/fxVBhAOIjE0pOQjiTGHWczeYZkq.jpg"
    },
    "name": "Forensics: The Real CSI",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 332,
            "logo_path": "/7HVPn1p2w1nC5oRKBehXVHpss7e.png",
            "name": "BBC Two",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 18,
    "number_of_seasons": 4,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Forensics: The Real CSI",
    "overview": "Multiple cameras follow serious crime investigations in real time, revealing the crucial role cutting-edge forensic science now plays in bringing criminals to justice.",
    "popularity": 5.89,
    "poster_path": "/agUwQ8Md4EHxLY3slJe7TjfN6Er.jpg",
    "production_companies": [],
    "production_countries": [
        {
            "iso_3166_1": "GB",
            "name": "United Kingdom"
        }
    ],
    "seasons": [
        {
            "air_date": "2019-05-01",
            "episode_count": 3,
            "id": 123774,
            "name": "Season 1",
            "overview": "",
            "poster_path": "/iZ4iuprwJtOD0iSnNTN7YNn0O0r.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        {
            "air_date": "2021-02-09",
            "episode_count": 7,
            "id": 180994,
            "name": "Season 2",
            "overview": "",
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        {
            "air_date": "2023-05-16",
            "episode_count": 4,
            "id": 341258,
            "name": "Season 3",
            "overview": "",
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        {
            "air_date": "2024-03-10",
            "episode_count": 4,
            "id": 381520,
            "name": "Season 4",
            "overview": "",
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Documentary",
    "vote_average": 7.6,
    "vote_count": 17,
    "season_data": {
        "1": {
            "_id": "5cd09519c3a3683697dc138b",
            "air_date": "2019-05-01",
            "episodes": [
                {
                    "air_date": "2019-05-01",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 1782972,
                    "name": "The Harvest",
                    "overview": "The forensics team must identify a gunman from evidence left at a shooting scene and determine the cause of death of a body found under suspicious circumstances.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 1,
                    "show_id": 89138,
                    "still_path": "/nTspminldtwQCQSYxCvh99cIaN3.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-08",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 1788109,
                    "name": "Mixed Profiles",
                    "overview": "At the crack of dawn in residential Newcastle, a man is violently assaulted and stabbed in his home by two unknown assailants. The suspects flee the scene and it is the job of rookie CSI Nicola Stark to examine the crime scene and surrounding area to find the clues that could lead her to identify the attackers.  In Sunderland, a woman reports being raped by two unknown men in a block of flats. Intimate samples are immediately taken as these provide the best chance of identifying the unknown suspects and bringing them to justice. But with two different, and as yet unknown people’s DNA present in the samples, identifying individual DNA profiles for comparison with the national DNA database is no simple matter.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 1,
                    "show_id": 89138,
                    "still_path": "/xtEZKDS8EmN7wJ6XwhCzlTW3OWN.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-05-15",
                    "episode_number": 3,
                    "episode_type": "finale",
                    "id": 1792237,
                    "name": "Every Contact Leaves a Trace",
                    "overview": "In central Newcastle, a teenage girl has been raped by a stranger in a local park. It is the job of Northumbria Police's head of forensics Kirsty Potter and senior investigating officer Shelley Hudson to find the unknown suspect and put him behind bars as quickly as possible. With every hour that passes the chances of obtaining forensic evidence reduce and intimate forensic samples from the teenager who has been raped are fast-tracked to a specialist lab in order to try and identify the suspect. A scour of local CCTV identifies a man wearing the same distinctive jacket as the teenager described.\n\nAlongside the traditional forensic search for body fluids, DNA and fibres, the police also deploy the rapidly evolving skills of their digital forensic team. Criminals may think they can withhold passwords and delete incriminating search histories from their computers, tablets and smart phones, but it won’t give head of digital media Jerry Hewitt and his team too much difficulty.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 1,
                    "show_id": 89138,
                    "still_path": "/43brxth3h25Eb4I6NnHu3O3I93V.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "",
            "id": 123774,
            "poster_path": "/iZ4iuprwJtOD0iSnNTN7YNn0O0r.jpg",
            "season_number": 1,
            "vote_average": 0
        },
        "2": {
            "_id": "6025e804d05a03003cb5e9ab",
            "air_date": "2021-02-09",
            "episodes": [
                {
                    "air_date": "2021-02-09",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2724323,
                    "name": "An Admission Of Murder",
                    "overview": "On a Monday afternoon in an affluent Birmingham suburb, a husband rings 999 to say he has killed his wife. The man is covered in blood when he is arrested outside his home but when he is brought to police custody and interviewed, he initially claims not to remember anything. Both houses are sealed off and it’s the job of crime scene coordinator Jo Ward to lead the search for forensic clues that could prove or disprove the suspect’s account. Forensic scientist Phil Field goes to the scene to carry out Blood Pattern Analysis to help map out the sequence of events surrounding the attacks. The investigation takes a significant turn when digital forensics experts manage to crack the suspect’s mobile and an insight into his motive is revealed.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 2,
                    "show_id": 89138,
                    "still_path": "/hIFBUKIjZc664lWBgT09pPeSJle.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-02-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2724324,
                    "name": "Stabbed in the Park",
                    "overview": "When a 15-year-old teenager is fatally stabbed in a park in Coventry, the forensic team must identify the murderers through evidence left behind at the crime scene.\n\nBut with the murder weapon nowhere to be found, the investigation relies on two key pieces of evidence: a mobile phone found a short distance from the body and the victim’s blood-soaked jacket. Through fingerprint enhancement, DNA testing and a pioneering partnership between academic researchers and the forensic team, West Midlands Police utilise a wide range of expertise in an effort to identify the killers.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 2,
                    "show_id": 89138,
                    "still_path": "/wxi7BRDoEQXdENuxmzlvomva28F.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-02-23",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2724325,
                    "name": "Murder at the Party",
                    "overview": "A 34-year-old man is fatally stabbed as he visits a group of friends who are socialising in one of the bedrooms of a multi-occupancy property in Birmingham. With vital evidence compromised during the attempts by paramedics to save his life, detectives use CCTV and financial transactions to track their suspect and apprehend him just before he boards an international flight out of the country. The forensic team employ a mixture of traditional and digital methods to try to determine whether or not the witnesses are telling the truth.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 2,
                    "show_id": 89138,
                    "still_path": "/1RIit4RGHonG3RANvBfKcLah7jH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-07-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3073933,
                    "name": "Fatal Weapon Unknown",
                    "overview": "Police respond to a call from a residential area of Dudley, where a woman reports that a house is being smashed up and a group are beating someone up outside it.\n\nWhen the forensic team from West Midlands Police arrive shortly afterwards, the attackers have fled. They find the body of a young man and a complex crime scene with evidence that a series of violent incidents have taken place over several hundred yards. Soon afterwards, a second man, brought to hospital from the crime scene, is declared dead.\n\nWhen strange puncture wounds are discovered on the bodies of both victims, a detailed forensic investigation is mounted to piece together a full picture of how and why the men were killed, what the murder weapon was, and who is responsible.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 2,
                    "show_id": 89138,
                    "still_path": "/dg4Dh7E6ngL1Fi3agLQhAJ1eqRP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-07-13",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3073934,
                    "name": "Indecent Exposure",
                    "overview": "Forensic scene investigator Drew Birtles is deployed to lead the search for evidence after a woman in her 50s phones 999 to allege that an engineer who visited her home by appointment to fit a smart meter has indecently exposed himself.\n\nFacing a case that is difficult to prove, Drew sets to work using forensic light sources and DNA evidence to build a picture of what went on in the woman’s house.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 2,
                    "show_id": 89138,
                    "still_path": "/ajSv9ksQUnehkll0CIGLbq4e6zq.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-07-20",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3085722,
                    "name": "Standard of Evidence",
                    "overview": "As the victim of a violent knife attack fights for his life in hospital, Crime Scene Coordinator Jo Ward is dispatched to his home in Birmingham to lead the forensic investigation into identifying his attacker.\n\nThe victim is unable to tell police what happened because he has been put in a medically induced coma, and the investigation becomes more challenging when no witnesses are prepared to give a statement to the police. Jo and her team work to gather vital evidence that could help police quickly identify and arrest the attacker.",
                    "production_code": "",
                    "runtime": 57,
                    "season_number": 2,
                    "show_id": 89138,
                    "still_path": "/7SQSiZUKlSQwoOUoYeAIOsaptdm.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-12-06",
                    "episode_number": 7,
                    "episode_type": "finale",
                    "id": 3379271,
                    "name": "Killer in the Car Park",
                    "overview": "West Midlands Police need forensics to identify the killer of two men found dead in a car.\n\nPolice respond to a call of a shooting in a carpark. As dusk sets in, crime-scene coordinator Simon Flanaghan attends to find a car set back from the road, with multiple bullet holes and two men dead inside.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 2,
                    "show_id": 89138,
                    "still_path": "/zoAAo4fGaZAic4xtqGWMLsuDRHZ.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "",
            "id": 180994,
            "poster_path": null,
            "season_number": 2,
            "vote_average": 0
        },
        "3": {
            "_id": "6464f1cd028420017006826f",
            "air_date": "2023-05-16",
            "episodes": [
                {
                    "air_date": "2023-05-16",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4449746,
                    "name": "To Catch a Rapist",
                    "overview": "A young woman arrives at a police station to report that she has been raped. She was attacked by a stranger at a derelict house in the early hours of the morning. The victim agrees to undergo a forensic examination at a Sexual Assault Referral Centre (SARC) to recover potentially critical evidence that could help identify her unknown attacker. A hunt for the unknown attacker ensues. Using a doorbell recording and CCTV footage, the police begin the hunt to bring the perpetrator to justice.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 3,
                    "show_id": 89138,
                    "still_path": "/vJE9zjtdWzvl7Xcv12teihCbbxv.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-05-23",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4449747,
                    "name": "Gold Heist",
                    "overview": "At midday on a busy high street in Birmingham, a group of armed robbers drive a truck into a jewellery shop, stealing £300,000 worth of gold. They escape in less than 60 seconds. Forensic scene investigator Drew Birtles is dispatched to the jewellery shop to recover any forensic clues which could help identify the robbers. The investigation becomes more challenging when no real forensic evidence is found at the crime scene and the robbers switch cars - leaving the trail to go cold. Suspects are identified, and investigators hope that forensic evidence from the cars could provide the vital information needed to help solve the case and bring down the thieves.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 3,
                    "show_id": 89138,
                    "still_path": "/7VALyyvSFLRzJ56m9aPCxfSrOEH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-05-30",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4449748,
                    "name": "Playing With Fire",
                    "overview": "As firefighters attempt to get a major fire at a Birmingham factory under control, fire investigator Luke Beckett is deployed to investigate before vital evidence is destroyed by the blaze. With no natural sources of ignition, Luke thinks that the fire may have been started deliberately, and a police investigation is launched. Although no forensic leads are found in the wreckage, in a stroke of luck, the factory’s CCTV room is left intact after the fire. Luke and the police have to work together to investigate whether this was a deliberate act, a reckless act of arson or something else altogether.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 3,
                    "show_id": 89138,
                    "still_path": "/8o8Phcum2lg5xtwjR2SLUBNMvdL.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-06-06",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4449749,
                    "name": "Tracking a Paedophile",
                    "overview": "A parent rings 999 to report that their 12-year-old daughter has been approached by a man on social media and has been raped by him several times. West Midlands Police quickly identify and arrest the suspect and bring him into custody. As the victim was too scared to tell anyone at first, there is limited physical forensic evidence. The investigation therefore has to rely heavily on digital forensics, and the police attempt to hack into the suspect's phones.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 3,
                    "show_id": 89138,
                    "still_path": "/9EbdD7nYf0PRtKWu2k8rc3QUmjl.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 341258,
            "poster_path": null,
            "season_number": 3,
            "vote_average": 0
        },
        "4": {
            "_id": "65e03593391b9c0163820127",
            "air_date": "2024-03-10",
            "episodes": [
                {
                    "air_date": "2024-03-10",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 5181118,
                    "name": "Body in the Freezer",
                    "overview": "After a decomposed body is found in a freezer at a waste disposal site, West Midlands Police must identify who it is, and track down the person who concealed it.",
                    "production_code": "",
                    "runtime": 58,
                    "season_number": 4,
                    "show_id": 89138,
                    "still_path": "/v6hGoObZReEApb19ppRT2Y1yMvi.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-17",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 5191881,
                    "name": "Time of Death",
                    "overview": "When 32-year-old Marlene Doyle, reported missing by her mother, is found murdered in a Coventry flat, police turn to forensic evidence to identify her killer.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 4,
                    "show_id": 89138,
                    "still_path": "/hmzZZgVIYSXm2WmlQVztqh2GmQ4.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-24",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 5191882,
                    "name": "Untraceable Guns",
                    "overview": "West Midlands Police work with ballistics experts to find out whether a man with a haul of rifles in his bedroom has used a 3D printer to make potentially deadly weapons.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 4,
                    "show_id": 89138,
                    "still_path": "/8jCXPQQC3uYUkQeLkPws3iPuD5I.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-03-31",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 5191883,
                    "name": "Confessions of a Killer",
                    "overview": "A man rings 999 to say he has killed his flatmate and forensics officers search for clues that could prove or disprove the suspect's pleas of self-defence.",
                    "production_code": "",
                    "runtime": 59,
                    "season_number": 4,
                    "show_id": 89138,
                    "still_path": "/fxVBhAOIjE0pOQjiTGHWczeYZkq.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "",
            "id": 381520,
            "poster_path": null,
            "season_number": 4,
            "vote_average": 0
        }
    }
}