{"adult":false,"backdrop_path":"/3WlsYQ9gnsHUcr29KlvoY4k5SEx.jpg","created_by":[{"id":1437678,"credit_id":"5cdcd9689251416b5bd1f8a7","name":"Fajar Nugros","gender":2,"profile_path":"/7UsRhlAPQ4C5S1icnq7Jl6wi5W6.jpg"},{"id":2275941,"credit_id":"5cdcd981c3a36831a3c2cd26","name":"Yogie Supra","gender":0,"profile_path":null}],"episode_run_time":[50],"first_air_date":"2019-05-15","genres":[{"id":18,"name":"Drama"}],"homepage":"http://www.viu.com","id":89469,"in_production":false,"languages":["id"],"last_air_date":"2019-05-22","last_episode_to_air":{"id":1796218,"name":"Episode 13","overview":"In the year 2024, life is brand new. Nothing is the same. Senja is preparing a wedding, but sadness lingers in the corner of her eye as Abi is nowhere to be found. As per their promise to each other, Senja and Abi never send each other news. Senja keeps writing letters that she never sends. Will Abi and Senja reunite after all?","vote_average":0,"vote_count":0,"air_date":"2019-05-22","episode_number":13,"episode_type":"finale","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null},"name":"Rewrite","next_episode_to_air":null,"networks":[{"id":2980,"logo_path":"/yEv7NZDYYxWak9cytEKzjO4Te1L.png","name":"Viu","origin_country":"TH"}],"number_of_episodes":13,"number_of_seasons":1,"origin_country":["ID"],"original_language":"id","original_name":"Rewrite","overview":"Abi left on their wedding day, Senja hoped they could return to the time before they ever knew each other.","popularity":3.332,"poster_path":"/z0NUa1y1tjRP2K97d4g5f4wYNyi.jpg","production_companies":[{"id":101886,"logo_path":null,"name":"Viu Original Film","origin_country":""}],"production_countries":[{"iso_3166_1":"ID","name":"Indonesia"}],"seasons":[{"air_date":"2019-05-15","episode_count":13,"id":124357,"name":"Season 1","overview":"","poster_path":"/z0NUa1y1tjRP2K97d4g5f4wYNyi.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Indonesian","iso_639_1":"id","name":"Bahasa indonesia"}],"status":"Ended","tagline":"","type":"Miniseries","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"5cdcd752c3a36836f6c7575b","air_date":"2019-05-15","episodes":[{"air_date":"2019-05-15","episode_number":1,"episode_type":"standard","id":1791975,"name":"Episode 1","overview":"Nearing his wedding day, Senja questioned his decision to marry Abi. Abi also secretly felt that doubt, he also doubted whether he could still make it happy Senja, after Senja lost Kania, his best friend, after his ramen business failed. And whether Abi can still be happy, after his dream of becoming a musician he must forget. All those doubts made their marriage null and void, Abi didn't come on her wedding day. Twilight was disappointed, he hoped, he didn't even know abi. In front of Abi, he threw away his ring and begged the Universe, hoping that time could repeat again and all his destiny he could change.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-15","episode_number":2,"episode_type":"standard","id":1791987,"name":"Episode 2","overview":"What if the universe granted Senja’s wish? The next morning, Senja wakes up... in 2019! Right before she met Abi, when everything was perfect in her world. Her best friend Kania is still alive. It is opening day at their ramen house. Senja is amazed and delighted, although everyone else is bewildered. Senja tries to change the course of the future that day, which also happens to be the very day she once met Abi. Try as she might to avoid him, Senja still finds herself in front of Abi before long. But is he Abi from the future or from the present? And will he make her fall in love all over again?","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-15","episode_number":3,"episode_type":"standard","id":1791988,"name":"Episode 3","overview":"Abi wakes up and finds himself back in 2019. His parents are still together, and he's still on good terms with Reno, his best friend and co-owner of Senja and Kania's ramen house. Abi is back in a time when he used to be enthusiastic about going after his dream to become a musician. However, he wonders what has happened to Senja. Was she sent back 5 years too? Abi decides to attend  the opening of the ramen house at Reno’s invitation. He looks to Senja, but she doesn't recognize him. Abi is still certain that Senja has come back from the future, just like him.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-15","episode_number":4,"episode_type":"standard","id":1791989,"name":"Episode 4","overview":"After Abi and Senja meet at their special place, Senja asks Abi not to interfere in her life. If fate has given them a second chance then they should use it. Senja wants to focus on the ramen house and on keeping Kania healthy and safe. She doesn’t want to see her best friend wear herself out - she couldn't bear to lose her a second time. For his part, Abi tries to mend his parents’ relationship. This leads to Abi’s mother introducing Abi to Vika, a drop dead gorgeous Instaceleb who offers to help him with his music career. Meanwhile, Senja grows closer to Reno, who in his previous lifetime had no chance of being with her.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-15","episode_number":5,"episode_type":"standard","id":1791990,"name":"Episode 5","overview":"Destiny keeps throwing Abi and Senja back together. For some reason, the two can’t stop thinking about each other. Abi can’t stand the fact that Reno is trying to get close to Senja, while Senja is jealous of Abi and Vika’s relationship. As the two continue to dodge each other, it's clear their love still lingers. Abi and Reno’s relationship also begins to sour as Reno becomes more blatant in his attempts to win over Senja.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-15","episode_number":6,"episode_type":"standard","id":1791991,"name":"Episode 6","overview":"Senja, Kania, Reno, Chef Miyaki and Burhan all go on a team vacation. Reno uses the opportunity to get closer to Senja, but her mind seems to be elsewhere. Senja can't get Abi out of her head. Meanwhile, Abi starts to realize that Vika leads a completely different lifestyle to his. Although she can help him to achieve fame, Abi feels this is not the kind of future he had in mind. He is someone who makes music with his whole heart. It all reminds him of Senja, who always understood and supported his passion. Meanwhile, exhausted from the trip, Kania suddenly passes out from exhaustion. Senja is beside herself with fear.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-15","episode_number":7,"episode_type":"standard","id":1791992,"name":"Episode 7","overview":"Kania is admitted to hospital. This devastates Senja, who has tried desperately to make Kania adopt a healthier lifestyle. Reno grows suspicious of Abi, who clearly has feelings for Senja. Senja and Abi become close once again after Kania’s incident, as Abi understand what she is going through as nobody else can. Abi starts to see Vika less, preferring to spend more time with Senja. He realizes that maybe falling in love is as inevitable as destiny itself.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-22","episode_number":8,"episode_type":"standard","id":1796213,"name":"Episode 8","overview":"Senja notices Kania getting healthier, so she takes her out for more work-out sessions and encourages Kania to eat well again. Meanwhile, Abi finds it more and more difficult to mend the rift in his parents’ relationship. Just as Senja grows certain of being able to change the destiny of the people around her, she meets an old woman she knows will die that day. Despite Senja's best efforts to change the course of destiny, the old lady dies anyway. Senja is distraught.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-22","episode_number":9,"episode_type":"standard","id":1796214,"name":"Episode 9","overview":"Senja discovers the truth about the strained relationship between Abi’s parents. She tries to help Abi deal with this. For his part, Abi supports Senja and reassures her that Kania will be fine. Reno begins to realize that he’s stuck in the middle. Just then, Kania puts things together and figures out that Senja has been hiding something from her. Kania demands to know the truth.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-22","episode_number":10,"episode_type":"standard","id":1796215,"name":"Episode 10","overview":"Kania believes that Senja is from the future and asks Senja not to worry about her, but to focus on the ramen house, so that Kania’s dream doesn’t die even if she does. Senja and Abi’s relationship improves as Senja finds out the things that Abi used to hide. Senja and Abi fall in love with each other again, as Abi’s parents reconcile. Reno also seems to be okay with Senja being with Abi as he begins to receive attention from someone else. Are Senja and Abi in fact meant to end up together at the end?","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-22","episode_number":11,"episode_type":"standard","id":1796216,"name":"Episode 11","overview":"The ramen house stands a big chance of attracting a new investor. Senja also gets a chance to resume her delayed dream to become a painter. She begins to get excited for life again. However, Abi seems to postpone his own dream of becoming a musician as he keeps assisting Senja. Suddenly Abi receives a good opportunity to start working on his music, but it means that he will have to leave Senja as he travels around Europe for 5 years.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-22","episode_number":12,"episode_type":"standard","id":1796217,"name":"Episode 12","overview":"Senja asks that Abi take the golden opportunity, because she believes that Abi must live according to his passion. They choose to part ways and lead different lives, letting the universe work on their destiny without their control. They believe that if it’s meant to be, they will see each other again.","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-05-22","episode_number":13,"episode_type":"finale","id":1796218,"name":"Episode 13","overview":"In the year 2024, life is brand new. Nothing is the same. Senja is preparing a wedding, but sadness lingers in the corner of her eye as Abi is nowhere to be found. As per their promise to each other, Senja and Abi never send each other news. Senja keeps writing letters that she never sends. Will Abi and Senja reunite after all?","production_code":"","runtime":50,"season_number":1,"show_id":89469,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":124357,"poster_path":"/z0NUa1y1tjRP2K97d4g5f4wYNyi.jpg","season_number":1,"vote_average":0}}}