{"adult":false,"backdrop_path":"/wkrRyGF2v3dolvSvBq7GO5bAN2y.jpg","created_by":[],"episode_run_time":[],"first_air_date":"2019-01-07","genres":[{"id":99,"name":"Documentary"}],"homepage":"https://www.bbc.co.uk/programmes/b0c0x283","id":89518,"in_production":false,"languages":[],"last_air_date":"2019-01-11","last_episode_to_air":{"id":1792920,"name":"Skagway to Carcross","overview":"Michael Portillo embarks on a second spectacular rail journey through Alaska to Canada, the White Pass and Yukon railway, ending in the Canadian town of Carcross. Arriving in Skagway by seaplane from railwayless Juneau, Michael heads first for Dyea and the Chilkoot trail, which the first gold prospectors hiked a hundred years ago to the Klondike. Among them, he discovers, was author Jack London, whose stories of sled dogs captured the spirit of the gold rush. In the puppy pen of a sled dog training camp, a dog musher tells Michael how huskies helped to build Alaska and gives him a taste of how the dogs continue to work and race today. Boarding the 52-mile railway, built in 1898, which climbs 2,600 feet before dropping to the head of Canada's Lake Bennett, Michael looks forward to beautiful scenery on a railway laden with history. At the lake, Michael meets an indigenous guide to hear of the role of First Nations people in the stampede for gold. In Carcross, Michael explores the art of the First Nations and helps to carve a totem pole. Then he is invited to shake his tail feathers in a 'grouse' dance.","vote_average":0,"vote_count":0,"air_date":"2019-01-11","episode_number":5,"episode_type":"finale","production_code":"","runtime":null,"season_number":1,"show_id":89518,"still_path":"/nEwpzNXFCMusjgFCWfv41AMVp8h.jpg"},"name":"Great Alaskan Railroad Journeys","next_episode_to_air":null,"networks":[{"id":332,"logo_path":"/6kl5tMuct7u3ej5myL4c9QQVSW1.png","name":"BBC Two","origin_country":"GB"}],"number_of_episodes":5,"number_of_seasons":1,"origin_country":[],"original_language":"en","original_name":"Great Alaskan Railroad Journeys","overview":"Michael Portillo heads for the Last Frontier of the United States armed with his 1899 Appleton's Guide-Book to Alaska.","popularity":12.449,"poster_path":"/ngs9HDJF6VvW8wJnnKpkO2yfZAo.jpg","production_companies":[],"production_countries":[],"seasons":[{"air_date":"2019-01-07","episode_count":5,"id":124423,"name":"Season 1","overview":"","poster_path":"/2QZLMWx5KfYDc1doxTKKiV8s673.jpg","season_number":1,"vote_average":0}],"spoken_languages":[],"status":"Ended","tagline":"","type":"Scripted","vote_average":0,"vote_count":0,"season_data":{"1":{"_id":"5cdfa440c3a3684b551e25b4","air_date":"2019-01-07","episodes":[{"air_date":"2019-01-07","episode_number":1,"episode_type":"standard","id":1792915,"name":"Ninilchik to Spencer Whistlestop","overview":"Michael Portillo heads for the Last Frontier of the United States armed with his 1899 Appleton's Guide-Book to Alaska. In Seward, Michael feeds a rescued sea otter pup with a fearsome bite and learns how the luxurious pelts of these endearing creatures were once the most valuable in the world.","production_code":"","runtime":null,"season_number":1,"show_id":89518,"still_path":"/9ebzzvzKv3jQres4VUCNtR2ZNez.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-08","episode_number":2,"episode_type":"standard","id":1792916,"name":"Anchorage to Wasilla","overview":"Steered by his Appleton's Guidebook to Alaska, Michael Portillo is in Anchorage preparing to join the US Arctic Warriors for parachute training at joint forces base Elmendorf-Richardson. The historic role of the military in Alaska since its purchase from Russia in 1867 underlines to him the strategic importance of the 49th state in two World Wars and how that continues today. A magical encounter with the cabbage fairies in Palmer teaches Michael a thing or two about growing vegetables close to the Arctic Circle. 19 hours of daylight and a quarter of an inch of new soil every year leads to 127-pound cabbages and the sweetest tomatoes he has ever tasted. Child's play, according to six-year-old gardener Daisy. In an underground sod house built from driftwood and whalebone, Michael hears how the language and traditions of indigenous people in Alaska were suppressed by the United States. After a plate of smoked and dried fish with his indigenous host, he heads for the gym at the Alaska Native Heritage Centre, where athletes train to compete in extraordinary sports at the annual World Eskimo-Indian Olympics. Michael's chosen event is the Eskimo stick pull. Keeping the Alaska Railroad running is not for the faint-hearted. Michael joins the maintenance team on a 30-foot snow-spreader, which keeps the tracks clear in winter.","production_code":"","runtime":null,"season_number":1,"show_id":89518,"still_path":"/11XkL0Pu8n9SDU3vUOymPjY0vKC.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-09","episode_number":3,"episode_type":"standard","id":1792917,"name":"Talkeetna to Denali","overview":"Armed with his 1899 Appleton's Guidebook to Alaska, Michael Portillo rides the Alaska Railroad north to explore the remote former goldrush settlement of Talkeetna. Deep in the forest outside town, Michael gets a taste of the pioneering spirit of early 20th-century prospectors and settlers from a modern day 'homesteader' and helps fell a tree to clear land for a log cabin. From Talkeetna, Michael joins intrepid fellow passengers aboard the Hurricane Turn, the last 'flag stop' train in the United States, waving them off as they alight in the middle of bear country to fish, raft and camp. He continues by rail to admire the snow-capped mountains and glaciers and to cross the gorge on the spectacular Hurricane Gulch Bridge Michael ends this leg of his Alaskan adventure in the Denali National Park, six million acres of wilderness crowned by the highest peak in the United States, Denali, where he discovers how photographers captured the beauty of the Alaskan landscape a hundred years ago.","production_code":"","runtime":null,"season_number":1,"show_id":89518,"still_path":"/jX7PPDNVuRSQuJEAbdOcyoQRfJ8.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-10","episode_number":4,"episode_type":"standard","id":1792918,"name":"Fairbanks to Juneau","overview":"Clutching his 1899 Appleton's Guidebook to Alaska, Michael Portillo reaches the State's remote interior and the end of the Alaska Railroad. Less than 200 miles from the Arctic Circle, at Fairbanks, he discovers how gold prospectors liberated the precious metal from the soil. At Poker Flat, Michael reaches for the skies with the scientists who study the Northern Lights. Volunteers on the Tanana Valley Railroad offer him the chance to light the boiler of their 1899 Porter locomotive - a first for Britain's premier rail fan. In Alaska's railwayless state capital, Juneau, Michael researches the life of the remarkable author of his Appleton's, Eliza Scidmore, before heading to the railhead for his next Alaskan journey. He discovers her role in encouraging tourists to visit Alaska and finds out how salmon propelled the region to statehood.","production_code":"","runtime":null,"season_number":1,"show_id":89518,"still_path":"/ddD4Nrrf3skl4AZ77GXRjXmArdO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-01-11","episode_number":5,"episode_type":"finale","id":1792920,"name":"Skagway to Carcross","overview":"Michael Portillo embarks on a second spectacular rail journey through Alaska to Canada, the White Pass and Yukon railway, ending in the Canadian town of Carcross. Arriving in Skagway by seaplane from railwayless Juneau, Michael heads first for Dyea and the Chilkoot trail, which the first gold prospectors hiked a hundred years ago to the Klondike. Among them, he discovers, was author Jack London, whose stories of sled dogs captured the spirit of the gold rush. In the puppy pen of a sled dog training camp, a dog musher tells Michael how huskies helped to build Alaska and gives him a taste of how the dogs continue to work and race today. Boarding the 52-mile railway, built in 1898, which climbs 2,600 feet before dropping to the head of Canada's Lake Bennett, Michael looks forward to beautiful scenery on a railway laden with history. At the lake, Michael meets an indigenous guide to hear of the role of First Nations people in the stampede for gold. In Carcross, Michael explores the art of the First Nations and helps to carve a totem pole. Then he is invited to shake his tail feathers in a 'grouse' dance.","production_code":"","runtime":null,"season_number":1,"show_id":89518,"still_path":"/nEwpzNXFCMusjgFCWfv41AMVp8h.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":124423,"poster_path":"/2QZLMWx5KfYDc1doxTKKiV8s673.jpg","season_number":1,"vote_average":0}}}