{"adult":false,"backdrop_path":"/zZQ4Vh9VE1ukU2v3lK6Q0j8hp13.jpg","created_by":[],"episode_run_time":[70],"first_air_date":"2019-07-22","genres":[{"id":18,"name":"Drama"},{"id":35,"name":"Comedy"}],"homepage":"https://tv.jtbc.joins.com/ateighteen","id":90407,"in_production":false,"languages":["ko"],"last_air_date":"2019-09-10","last_episode_to_air":{"id":1903740,"name":"This Goodbye Isn't Forever","overview":"Hwi Young admits to everything he has done wrong and leaves the school. Jun Woo takes part in an art competition with the enthusiastic support of Soo Bin and tries his best to achieve his dream. After the competition, Jun Woo wants to surprise his mom by visiting her. When he arrives at her workplace, Jun Woo finds out that she has been going through a tough situation which leaves him with a difficult choice to make.","vote_average":0,"vote_count":0,"air_date":"2019-09-10","episode_number":16,"episode_type":"finale","production_code":"","runtime":66,"season_number":1,"show_id":90407,"still_path":null},"name":"At Eighteen","next_episode_to_air":null,"networks":[{"id":885,"logo_path":"/44I4aVlasm8Blb8WPGXTkMYuZJF.png","name":"JTBC","origin_country":"KR"}],"number_of_episodes":16,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"열여덟의 순간","overview":"Coming-of-age drama about 18-year-olds, taking a realistic look into the moments of their lives, moments that all of us might have experienced at one time or another. Ong Seong Woo plays Choi Jun Woo, for whom loneliness has become a habit. Though Choi Jun Woo appears to lack empathy at first glance, it’s just that he has always been alone and isn’t practiced in expressing his emotions. Underneath his withdrawn exterior is a goofy and cute young man. “At Eigteen” is about the events that unfold when Jun Woo transfers schools and is thrown into a new environment.","popularity":16.284,"poster_path":"/AbEoQOZO6xnXg52Ehrd8aXchpLF.jpg","production_companies":[{"id":86981,"logo_path":"/8FwCT7KohE031xFLBeRMZlbuzSr.png","name":"SLL","origin_country":"KR"},{"id":15975,"logo_path":"/ewSxMJt8IeFHSOqfyKn1scZoOur.png","name":"KEYEAST","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2019-07-22","episode_count":16,"id":126063,"name":"Season 1","overview":"","poster_path":"/o1hE6n13mBeDeMcYX2cs8K3D9tB.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":6.308,"vote_count":13,"season_data":{"1":{"_id":"5d077333c3a36820b91ea1df","air_date":"2019-07-22","episodes":[{"air_date":"2019-07-22","episode_number":1,"episode_type":"standard","id":1822602,"name":"The Nameless Kid, Choi Jun Woo","overview":"Choi Jun Woo is a new transfer student at Cheon Bong High School. He has no interest in school life, because of some trauma he experienced at his previous school. On Jun Woo’s first day at school, the class president, Hwi Young, greets Jun Woo like a gentleman. However, things take a turn for the worse when Jun Woo becomes involved in an unfortunate incident.","production_code":"","runtime":67,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-07-23","episode_number":2,"episode_type":"standard","id":1841928,"name":"A Moment I Want to Run Away","overview":"Jun Woo becomes the prime suspect of a theft. Everyone seems to think it was his doing, because he of his reputation from his previous school. A part of him wants to run away from this, but another part of him is angry at himself for not facing the false accusations directly. Hwi Young keeps pushing Jun Woo into a corner while Soo Bin reaches out as if she were telling him to stay.","production_code":"","runtime":64,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-07-29","episode_number":3,"episode_type":"standard","id":1860174,"name":"It Always Rains on a Sad Day","overview":"Jun Woo decides not to move away and returns to school. Hwi Young tries to find a way to get Jun Woo expelled. Mr. Oh announces that the performance assessment for English is a free-talking test and even though the students don’t like the idea at first, they get excited about choosing partners. Even though Jun Woo promises his mom that he won’t get into any more trouble, he finds himself in another predicament.","production_code":"","runtime":67,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-07-30","episode_number":4,"episode_type":"standard","id":1860175,"name":"Happiness and Sadness Come and Go Instantly","overview":"Jun Woo and Soo Bin become partners for the English test, and they grow closer as they prepare for it. Hwi Young is annoyed by this because Soo Bin has been distancing herself from him recently. Meanwhile, Jung Hoo comes to deliver a letter to Jun Woo’s teacher. It explains how Jun Woo took the blame for something Jung Hoo did. Jun Woo’s life seems to finally be going well until tragedy strikes once again.","production_code":"","runtime":66,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-05","episode_number":5,"episode_type":"standard","id":1860176,"name":"After that Long and Sad Day","overview":"After Jun Woo tells Mr. Oh what he heard at the funeral about Ki Tae, Mr. Oh visits Geon Hyuk to see if it’s true. Hwi Young grows worried that people might think he was connected to Jung Hoo’s death and tries to blame everything on Ki Tae. Meanwhile, Soo Bin thinks that she might not have passed the level test for Mr. Son’s math class after all and decides to quit.","production_code":"","runtime":67,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-06","episode_number":6,"episode_type":"standard","id":1860177,"name":"The Timing of Action and Reaction","overview":"As Jun Woo struggles to show his feelings to Soo Bin, he worries about how she seemed determined to run away from home. Hwi Young ends up showing his true colors to Jun Woo once more. Meanwhile, Mr. Oh starts having doubts about Hwi Young’s seemingly perfect character.","production_code":"","runtime":64,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-12","episode_number":7,"episode_type":"standard","id":1860178,"name":"Romeo and Juliet","overview":"Soo Bin’s mom isn’t pleased when she finds out that the boy who carried Soo Bin to the nurse’s office is a kid who was forced to transfer. Jun Woo overhears Soo Bin’s mom telling Soo Bin to stay away from him. Meanwhile, Hwi Young’s mistake puts him in danger of losing the first place spot to Sang Hoon.","production_code":"","runtime":61,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-13","episode_number":8,"episode_type":"standard","id":1860179,"name":"The Moment of Your First Love","overview":"Mr. Oh decides to invite the parents and hold an open class, thinking it is a good opportunity to prove that he is capable. After the open class, Jun Woo works up his courage to finally ask Soo Bin out on a date. Meanwhile, Sang Hoon, who feels that he is being robbed of his first place spot, takes matters into his own hands. Hwi Young witnesses the lengths his parents will go to and feels sad and ashamed.","production_code":"","runtime":61,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-19","episode_number":9,"episode_type":"standard","id":1895089,"name":"I'm Sorry","overview":"As Jun Woo blames himself for Soo Bin’s sudden attitude change towards him, Soo Bin is confused about whether to believe Hwi Young’s message or not. Hwi Young watches Soo Bin suffering but can’t bring himself to tell her the truth. Meanwhile, as the new class vice-president, Jun Woo plans a special event for the school trip with the other kids in class.","production_code":"","runtime":67,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-20","episode_number":10,"episode_type":"standard","id":1895090,"name":"The Night That Will Never Return","overview":"Hwi Young blames himself for hurting Soo Bin. Jun Woo is more saddened by the fact that Soo Bin couldn’t trust him than Hwi Young’s lie about him. Jun Woo tells Soo Bin that he needs some time to gather his thoughts. As the 11th graders go on their school trip, Jun Woo unexpectedly goes on stage for the talent show.","production_code":"","runtime":58,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-26","episode_number":11,"episode_type":"standard","id":1903735,"name":"The Emotions That I Got to Know Through You","overview":"After Soo Bin and Jun Woo find out about how they feel for each other, they become special to each other. However, Hwi Young feels upset about it and asks his mom to take Soo Bin out of the private tutoring team. Instead of Soo Bin, Hwi Young’s dad invites Sang Hoon as the new member to provoke his son.","production_code":"","runtime":61,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-08-27","episode_number":12,"episode_type":"standard","id":1903736,"name":"Being More Mature Than Adults at the Age of 18","overview":"Jun Woo's mom is thrilled to hear that Soo Bin is Jun Woo's first girlfriend and congratulates them both. However, Jun Woo isn't too excited to learn about his mom's part-time job. An anonymous post regarding Hwi Young's outstanding grades come up on Cheonbong High School's online bulletin board. Rumors spread throughout the school and become an issue with the teachers as well as the parents. Meanwhile, Soo Bin's father tries to hand divorce papers to Soo Bin's mother.","production_code":"","runtime":64,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-02","episode_number":13,"episode_type":"standard","id":1903737,"name":"I Should Still Like You","overview":"Soo Bin’s mom’s harsh reaction to finding out that Jun Woo and Soo Bin are dating really hurts Jun Woo’s feelings. However, he tries to console Soo Bin who must’ve been hurt even more and tells her that they should hang in there and keep trying hard in school. Meanwhile, Hwi Young finds out that his grades were fabricated by his parents. He does badly on his final exam on purpose and calls his mom.","production_code":"","runtime":67,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-03","episode_number":14,"episode_type":"standard","id":1903738,"name":"Happy Birthday to You","overview":"Jun Woo goes back to see his dad once more and tells him what he wanted to say all along. Soo Bin, who knows how heartbroken Jun Woo must be, writes him a letter. Jun Woo feels encouraged by her kind words and begins to pursue his dreams. Meanwhile, the Office of Education launches an investigation on Hwi Young’s fabricated test scores. After admitting to all allegations, Hwi Young disappears.","production_code":"","runtime":63,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-09","episode_number":15,"episode_type":"standard","id":1903739,"name":"Ways to Embrace Your Scar","overview":"Jun Woo has the best birthday of his life, thanks to Soo Bin. With Soo Bin’s heartfelt support, Jun Woo works hard to achieve his dreams, despite being busier than ever. Finding out about Hwi Young’s wrongdoings toward Jun Woo, Soo Bin feels sorry for not knowing and guilty for not being able to help. Meanwhile, Jun Woo feels mixed emotions as Hwi Young breaks down in front of his eyes.","production_code":"","runtime":65,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2019-09-10","episode_number":16,"episode_type":"finale","id":1903740,"name":"This Goodbye Isn't Forever","overview":"Hwi Young admits to everything he has done wrong and leaves the school. Jun Woo takes part in an art competition with the enthusiastic support of Soo Bin and tries his best to achieve his dream. After the competition, Jun Woo wants to surprise his mom by visiting her. When he arrives at her workplace, Jun Woo finds out that she has been going through a tough situation which leaves him with a difficult choice to make.","production_code":"","runtime":66,"season_number":1,"show_id":90407,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":126063,"poster_path":"/o1hE6n13mBeDeMcYX2cs8K3D9tB.jpg","season_number":1,"vote_average":0}}}