{
    "adult": false,
    "backdrop_path": "/1A34h90hHRxJsv4jO9xtgB1PANr.jpg",
    "created_by": [],
    "episode_run_time": [
        28
    ],
    "first_air_date": "2019-12-15",
    "genres": [
        {
            "id": 99,
            "name": "Documentary"
        }
    ],
    "homepage": "https://www.bbc.co.uk/programmes/m000cdzb",
    "id": 96779,
    "in_production": false,
    "languages": [
        "en"
    ],
    "last_air_date": "2019-12-20",
    "last_episode_to_air": {
        "id": 2026739,
        "name": "Sensing",
        "overview": "Professor Ben Garrod explores how some snakes can see using heat, how crocodiles feel through their jaws and how some animals use electricity to navigate their world - and it is all only possible because of remarkable adaptations to their skin.Whether animals live on land, in the sea, or in subterranean communities, skin is critical in allowing them to sense the world around them, be it to find food, navigate harsh environments or avoid danger. Even the toughest of animals, crocodilians, have a surprisingly sensitive side when it comes to the specialised skin sensors they use to detect the tiniest of ripples in the water. Deadly pit vipers use heat sensors to ambush the small rodents they feed on. Professor Ben Garrod puts them to the test with an experiment to see if they will strike a cold or warm ping-pong ball. He also uncovers how the less-than-attractive leaf-nosed bat puts its facial skin to good use as an acoustic lens to echolocate around its dense forest habitat.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2019-12-20",
        "episode_number": 6,
        "episode_type": "finale",
        "production_code": "",
        "runtime": 28,
        "season_number": 1,
        "show_id": 96779,
        "still_path": null
    },
    "name": "Secrets of Skin",
    "next_episode_to_air": null,
    "networks": [
        {
            "id": 100,
            "logo_path": "/AgsOSxGvfxIonhPgrfkWCmsOKfA.png",
            "name": "BBC Four",
            "origin_country": "GB"
        }
    ],
    "number_of_episodes": 6,
    "number_of_seasons": 1,
    "origin_country": [
        "GB"
    ],
    "original_language": "en",
    "original_name": "Secrets of Skin",
    "overview": "Featuring groundbreaking new science, experiments and leading scientists from a variety of disciplines, the series unravels the natural history of the body's largest organ.",
    "popularity": 3.335,
    "poster_path": "/ohGWWvnMwTnowElV4WdVthfsHwq.jpg",
    "production_companies": [],
    "production_countries": [],
    "seasons": [
        {
            "air_date": "2019-12-15",
            "episode_count": 6,
            "id": 138910,
            "name": "Season 1",
            "overview": "Featuring groundbreaking new science, experiments and leading scientists from a variety of disciplines, the series unravels the natural history of the body's largest organ.",
            "poster_path": "/ohGWWvnMwTnowElV4WdVthfsHwq.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Ended",
    "tagline": "",
    "type": "Scripted",
    "vote_average": 0,
    "vote_count": 0,
    "season_data": {
        "1": {
            "_id": "5e009d5dd1a89300198c4350",
            "air_date": "2019-12-15",
            "episodes": [
                {
                    "air_date": "2019-12-15",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2026733,
                    "name": "Adaptability",
                    "overview": "In this episode, Professor Ben Garrod reveals groundbreaking new science and amazing specialist insight as he discovers how human skin is an ecosystem in its own right, playing host to demodex mites that might redefine our understanding of human ancestry. He explores the new science that could pave the way for re-engineering human skin on amputations to make it more robust. And he reveals how keratin, a protein that is a key component of skin and that makes up our hair and nails, has been taken to the extreme by some animals, including pangolins and horses. Skin is the body’s largest organ, and all vertebrates share the same basic blueprint. Adaptations in the three main layers, the epidermis, the dermis and the subcutaneous fat, have allowed vertebrates to thrive in virtually every habitat on earth.",
                    "production_code": "",
                    "runtime": 28,
                    "season_number": 1,
                    "show_id": 96779,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-16",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2026734,
                    "name": "Moving",
                    "overview": "What makes sharks built for speed? How do snakes move without limbs? How do sugar gliders fly without feathers? The answer all lies in their skin. Professor Ben Garrod uncovers the secrets of how skin has evolved to enable animals to solve some of the most remarkable challenges on earth. To do this, Ben heads to the specialist flight centre at the Royal Veterinary College to analyse the way a sugar glider uses its skin flaps to stay aloft. He goes diving with sharks at the Blue Planet Aquarium and discovers that, far from being smooth, sharkskin is incredibly rough. It is covered with thousands of tiny teeth that make a shark hydrodynamic. Ben also finds out how the keratinised scales on snakes' bellies are the perfect configuration to allow them to move over virtually any surface they encounter. Amongst many other wonders of how skin has had an impact on nature.",
                    "production_code": "",
                    "runtime": 28,
                    "season_number": 1,
                    "show_id": 96779,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2026735,
                    "name": "Protection",
                    "overview": "How does a giraffe stay cool? What are different porcupine quills teaching us about medicine? What makes some people more likely to be bitten by mosquitoes than others? All the answers and more lie in the secrets of how skin protects us from a hostile world. When it comes to protecting our delicate insides, skin is like an external suit of armour. Animals have adapted ways of protecting themselves from everything a hostile planet has to throw at them. Hippos produce their own sunscreen to protect themselves against the dangers of UV rays from the sun. Only recently discovered by science, is the truth behind a giraffe’s spots, a network of blood vessels that they use to cool themselves down in the blazing heat of the African savannah. Professor Ben Garrod discovers how. He tests the limitations of human skin by plunging himself into a deep freezer to demonstrate how human skin just isn’t well insulated enough to cope with extreme cold. He discovers how human skin is an entire ecosystem for bugs and bacteria as he comes face to face with what is growing on his skin. And he gets bitten by mosquitoes and stable flies as he learns that disease-carrying insects have evolved to pierce everything from human skin to horse hide.",
                    "production_code": "",
                    "runtime": 28,
                    "season_number": 1,
                    "show_id": 96779,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-18",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2026737,
                    "name": "Communication",
                    "overview": "Why are male mandrill faces (big bold primates from West Africa) red and blue? How are birds' feathers so colourful? What do ringtail lemurs do to talk to one another? Their skin holds the key. As Professor Ben Garrod explores how animals communicate with one another, he uncovers a myriad more wonderful ways.Skin has evolved in some remarkable ways to enable animals to communicate with each other, from vibrant displays of colour to skin pouches to amplify sound. Ben shows how animals have evolved to use skin to make themselves heard loud and clear. Birds are notable for their use of coloured feathers to attract mates, show status and as displays of aggression. But, as Ben discovers, long before birds evolved their unrivalled use of colour, it is now believed that their ancestors, the dinosaurs, could well have been using colour to communicate. Ben also uncovers how one species of fish communicates using electricity, and a common British bird has been secretly communicating for years, without us ever knowing.",
                    "production_code": "",
                    "runtime": 28,
                    "season_number": 1,
                    "show_id": 96779,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-19",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2026738,
                    "name": "Defence",
                    "overview": "What is the most toxic animal on earth? How are porcupine quills helping us in medicine? Why is a rhino armour plated, and it is not to protect them from lions? Professor Ben Garrod discovers the complex ways, from camouflage to deadly toxins, in which the skin helps defend animals against threats of all kinds. From the barbed quills of the North American porcupine to the battering ram of a rhino’s horn, the skin has developed an impressive armoury of weapons and warnings to keep predators at bay. With experiments and specialist factual insight, Professor Ben Garrod reveals the toughest and most resilient of animals defend themselves through their skin. One of the most iconic warnings in nature is that of the rattlesnake. Ben takes a teaching sample of a rattlesnake’s tail to the University of Bristol to test just how fast it can vibrate. He uncovers how poison-dart frogs produce their toxins, and how cuttlefish are the masters of disguise when it comes to hiding in plain sight.",
                    "production_code": "",
                    "runtime": 28,
                    "season_number": 1,
                    "show_id": 96779,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2019-12-20",
                    "episode_number": 6,
                    "episode_type": "finale",
                    "id": 2026739,
                    "name": "Sensing",
                    "overview": "Professor Ben Garrod explores how some snakes can see using heat, how crocodiles feel through their jaws and how some animals use electricity to navigate their world - and it is all only possible because of remarkable adaptations to their skin.Whether animals live on land, in the sea, or in subterranean communities, skin is critical in allowing them to sense the world around them, be it to find food, navigate harsh environments or avoid danger. Even the toughest of animals, crocodilians, have a surprisingly sensitive side when it comes to the specialised skin sensors they use to detect the tiniest of ripples in the water. Deadly pit vipers use heat sensors to ambush the small rodents they feed on. Professor Ben Garrod puts them to the test with an experiment to see if they will strike a cold or warm ping-pong ball. He also uncovers how the less-than-attractive leaf-nosed bat puts its facial skin to good use as an acoustic lens to echolocate around its dense forest habitat.",
                    "production_code": "",
                    "runtime": 28,
                    "season_number": 1,
                    "show_id": 96779,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "Featuring groundbreaking new science, experiments and leading scientists from a variety of disciplines, the series unravels the natural history of the body's largest organ.",
            "id": 138910,
            "poster_path": "/ohGWWvnMwTnowElV4WdVthfsHwq.jpg",
            "season_number": 1,
            "vote_average": 0
        }
    }
}