{
    "adult": false,
    "backdrop_path": "/AvP61xO5RmBid6384PutKnbePsI.jpg",
    "created_by": [],
    "episode_run_time": [
        42
    ],
    "first_air_date": "2020-02-03",
    "genres": [
        {
            "id": 10764,
            "name": "Reality"
        }
    ],
    "homepage": "https://www.bravotv.com/below-deck-sailing-yacht",
    "id": 97872,
    "in_production": true,
    "languages": [
        "en"
    ],
    "last_air_date": "2024-10-28",
    "last_episode_to_air": {
        "id": 5657265,
        "name": "Bean Counter",
        "overview": "After a tense night out, a bucket of chicken really turns things around; Dr. Tiffany Moon and husband Daniel come aboard with their friends, hoping for a five-star experience; Keith and Danni struggle to get in sync.",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2024-11-04",
        "episode_number": 5,
        "episode_type": "standard",
        "production_code": "",
        "runtime": 43,
        "season_number": 5,
        "show_id": 97872,
        "still_path": "/vZzrNIjpo3MAJswa9U7Z9GWUKdh.jpg"
    },
    "name": "Below Deck Sailing Yacht",
    "next_episode_to_air": {
        "id": 5716633,
        "name": "Loose Lips Sink Trysts",
        "overview": "",
        "vote_average": 0,
        "vote_count": 0,
        "air_date": "2024-11-11",
        "episode_number": 6,
        "episode_type": "standard",
        "production_code": "",
        "runtime": null,
        "season_number": 5,
        "show_id": 97872,
        "still_path": null
    },
    "networks": [
        {
            "id": 74,
            "logo_path": "/wX5HsfS47u6UUCSpYXqaQ1x2qdu.png",
            "name": "Bravo",
            "origin_country": "US"
        }
    ],
    "number_of_episodes": 80,
    "number_of_seasons": 5,
    "origin_country": [
        "US"
    ],
    "original_language": "en",
    "original_name": "Below Deck Sailing Yacht",
    "overview": "Capt. Glenn Shephard and his crew set sail in a luxury sailing yacht to explore the crystal-clear blue waters of the Ionian Sea. The physicality of working on a sailing yacht brings new challenges to these young, attractive and adventurous yachties who are ready to work hard and play harder.",
    "popularity": 69.531,
    "poster_path": "/xRYK5NhY15uKaJ4a97xmWyHxSCi.jpg",
    "production_companies": [
        {
            "id": 24804,
            "logo_path": "/b0jSX7D7Ju2bpjxk3hxmtCZTR5j.png",
            "name": "51 Minds Entertainment",
            "origin_country": "US"
        }
    ],
    "production_countries": [
        {
            "iso_3166_1": "US",
            "name": "United States of America"
        }
    ],
    "seasons": [
        {
            "air_date": "2020-02-03",
            "episode_count": 18,
            "id": 140880,
            "name": "Season 1",
            "overview": "The superyacht Parsifal III sets sail with a colorful new crew as they navigate high winds, hookups and more at sea in this spinoff of the hit franchise.",
            "poster_path": "/nRoHyVdPfxpm8QkgEKxXMfCfF7.jpg",
            "season_number": 1,
            "vote_average": 8.4
        },
        {
            "air_date": "2021-03-01",
            "episode_count": 18,
            "id": 178061,
            "name": "Season 2",
            "overview": "This season, when the chief stew and chef discover they’re on different pages, mistrust and miscommunication makes for an extremely volatile working relationship that impacts everyone on board. As department heads undermine each other’s authority, arguments trickle down the chains of command as tension reaches an all-time high between the interior and exterior teams. With new safety protocols in place, the crew must stay on the yacht in between charters, blurring the lines professionally and personally, leading to a boat-load of nauti-yachties.",
            "poster_path": "/A5msMIC76zqKO8uooijFrlUckk3.jpg",
            "season_number": 2,
            "vote_average": 9
        },
        {
            "air_date": "2022-02-21",
            "episode_count": 18,
            "id": 241365,
            "name": "Season 3",
            "overview": "",
            "poster_path": "/xRYK5NhY15uKaJ4a97xmWyHxSCi.jpg",
            "season_number": 3,
            "vote_average": 8.3
        },
        {
            "air_date": "2023-04-10",
            "episode_count": 19,
            "id": 332682,
            "name": "Season 4",
            "overview": "",
            "poster_path": "/nWxjKBtjUJRSQI57VZH9otvQuYu.jpg",
            "season_number": 4,
            "vote_average": 9
        },
        {
            "air_date": "2024-10-07",
            "episode_count": 9,
            "id": 418886,
            "name": "Season 5",
            "overview": "",
            "poster_path": "/v7JuE5wg04wvnMEjL3a81N3AXYF.jpg",
            "season_number": 5,
            "vote_average": 0
        }
    ],
    "spoken_languages": [
        {
            "english_name": "English",
            "iso_639_1": "en",
            "name": "English"
        }
    ],
    "status": "Returning Series",
    "tagline": "",
    "type": "Reality",
    "vote_average": 6.6,
    "vote_count": 12,
    "season_data": {
        "1": {
            "_id": "5e1df55da6c10400118416c5",
            "air_date": "2020-02-03",
            "episodes": [
                {
                    "air_date": "2020-02-03",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2049255,
                    "name": "Holy Ship! We're Sailing",
                    "overview": "Welcome to Below Deck Sailing Yacht, where the winds are stronger, the stakes are higher, and the job is tougher than ever. This season, the crew boards Parsifal III, a 180-foot long luxury sailing yacht. The existing crew includes Captain Glenn Shephard and yachtie couple Paget Berry and Ciara Duggan, who are joined for the charter season by Chef Adam Glick (Below Deck Mediterranean), Jenna MacGillivray, Byron Hissey, Madison Stalker, Georgia Grobler, and Parker McCown. For the first time ever, Paget and Ciara find themselves working in the same department. And with the boat in total disarray, tensions between the old and new crew begin to simmer as they hustle to get ready for their first charter of the season.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/dmxxAVkW3uagGSSzioNKnL8n9Wo.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-10",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2159551,
                    "name": "My Big Fat Bleak Wedding",
                    "overview": "The first charter of the season is underway, and Chief Stew Jenna is already feeling the pressure as she is tasked with planning an impromptu wedding for two drunk guests. First Mate Paget is trying to keep his cool and patience with his new deck team, including Ciara, his girlfriend of four years. Parker, an inexperienced deckhand, struggles to adjust to the posh world of yachting. Meanwhile, Captain Glenn attempts a risky maneuver while climbing the mast to fix a broken sail.  During the first night out, two yachties have a steamy interaction that quickly makes their professional relationship personal.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/lbEyfDpi1HXTpgJ5ktWOhta4Zej.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-17",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2167694,
                    "name": "Rosé-Fueled Regrets",
                    "overview": "After a wild, wine-fueled, night out, Jenna wades through a sea of regrets and braces for the awkward interactions that follow.  A group of high-maintenance, vegan guests board Parsifal, and Adam struggles to live up to their meatless and milkless expectations. Georgia gets attitude from Chef Adam and seeks solace in her budding friendship with Madison and burgeoning flirtation with Paget. And Paget worries about how to be both Ciara’s boss and her boyfriend as tensions between them escalate making them question if the charter season will get the best of them.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/dsoNDjJvl8BnO5g3BhMuw9MnVsY.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-02-24",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2173403,
                    "name": "Baby on Board",
                    "overview": "Stews brace and dishes break as the last breakfast of charter is served on full tilt. To make matter worse, the deck team gets into choppy waters during a rough docking. Parker feels the strain of being on charter and his immaturity begins to show. On their night out, Paget continues to bond with the crew, particularly Georgia. Jenna comes down on Georgia’s laundry system and sends her away in tears. Then, Parsifal welcomes its youngest guest to date – a newborn. And baby talk permeates the yacht as Adam and Jenna’s relationship blossoms.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/19ZRNNHSqd7QmutPHWoW952Lps1.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-02",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2179441,
                    "name": "Shmexual Shmension",
                    "overview": "Parsifal sails into strong winds with a baby on board as Glenn stumbles into awkward conversation with a flirtatious primary. Adam and Jenna’s relationship heats up which stokes the fires between the Jenna and her interior team. Madison gets frustrated when Jenna sends her to do a beach picnic setup with little notice, and Georgia piles laundry on Madison’s workload. Ciara and Parker get in a spat about deck duties, and Paget tries to mediate while the guests wait nearby. But everything comes to a head when Ciara discovers that the boat is crashing into the dock!",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/8FAckL3AHP056Y1ZIKbXx3ggWfl.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-09",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2185551,
                    "name": "Oof! I Did It Again",
                    "overview": "Paget’s patience runs out when he’s left to pick up the slack after Parsifal crashes into the dock. A new charter of men from Long Island set sail in all of their champagne-sabering, chest-bumping glory, and the crew scrambles to meet their loud and incessant demands. Adam goes into beast mode while trying to cook for the bros, but he gets comfortable with Jenna, who wants more from their relationship. The guests cruise beach bars for chicks but end up taking a dive in the drink. Madison must decide how to handle a charter guest that crosses the line. And Parker and Madison facilitate an out-of-control yacht party.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/meIdjTUkuWARutBPsnR62s44rIF.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-16",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2188640,
                    "name": "Oooof There It Is",
                    "overview": "After witnessing the guests have an out-of-control party, Captain Glenn stands his ground and sets limits on this testosterone-filled charter. Madison and Georgia are on different pages as they try to find their own ways to navigate Jenna’s demands. Adam critiques Parker’s cabin etiquette, which sends Parker over the edge. Paget and Georgia take a swim together, and Ciara catches them in a compromising position. Jenna and Adam can’t agree on the speed of their relationship, and it results in a heated disagreement on the dock.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/g4BmmsmqXorRbyQ5r1bZ7n64N1I.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-23",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2188644,
                    "name": "No Bra, No Shoes, Bad Service",
                    "overview": "Adam and Jenna can’t see eye-to-eye on where their relationship stands, and their epic fight on the flybridges is a buzzkill for the rest of the crew. Ciara tries to manage Parker, but he resents her bossiness. When the two come to blows, Captain Glenn takes notice, and calls the deck team for a meeting. Despite feeling overwhelmed with work, Madison finds time to fall harder for Parker. In the wake of their first fight, Adam and Jenna find themselves on shaky ground. Parker botches a beach stakeout, and Madison and Ciara blunder the picnic setup and suffer Jenna’s wrath.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/mfBg6PShuSG40OOM5mUZppYVbaI.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-03-30",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2188646,
                    "name": "Parker's Big Adventure",
                    "overview": "Jenna and Adam pick up the pieces of Madison and Ciara’s botched beach picnic while Georgia steps up to surprise the guests. Jenna discovers why Madison is so exhausted all the time. Parker tries to prove himself by executing a mission for the guests, while Ciara steps aside to let him make his own mistakes. After Jenna reaches a breaking point with Madison, she talks to Glenn about how to best proceed with or without her.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/1CCV6AjYFu0DYdMT04paxpD1nRH.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-06",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2213981,
                    "name": "Big Deck Energy",
                    "overview": "Captain Glenn and Jenna have a tough meeting with Madison. The crew bonds on their day off and Georgia, Ciara, and Paget get a little too close as a proposition is made. Parker reconnects with his ex, Kaiti, and invites her to visit Corfu. After a blissful day together, Adam and Jenna’s “shmexual shmension” finally comes to fruition. But the afterglow doesn’t last long as Adam’s jealousy erupts after Jenna and Georgia discover they have something in common.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/9PdIhHjEmzSSnrfFazAaK6inesf.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-13",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2215156,
                    "name": "May the Breast Man Win",
                    "overview": "After Adam has a jealous outburst, Jenna asks Georgia to be her buffer. Madison keeps her head down and works hard to earn back Jenna’s trust. The Playboy guests get creative with seashells during a photo shoot on the beach. Tensions remain high between Paget and Ciara. And Parker has difficulty with a beach picnic setup that sends him into an epic downward spiral. Captain Glenn intervenes, but it may be too late.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/9n2xR85bZCKoB91jsoHuOKsGjRV.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-20",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 2225805,
                    "name": "New Chris on the Block",
                    "overview": "Glenn makes changes aboard Parsifal that send the deck team into a frenzy. Madison grows closer with Georgia and lashes out at Adam for sleeping with Jenna in the master guest cabin. When Jenna catches wind, she reminds Madison who’s in charge. A group of social media influencer guests shake Jenna’s confidence. And a relationship is on the line as an argument breaks out during dinner.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/bkKMY2EFC2QoqEM3fWQmMOY1sd7.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-04-27",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 2237705,
                    "name": "Awkward",
                    "overview": "Jenna’s jealousy mounts as the charter guests continue to shamelessly flirt with Adam. Paget and Ciara can’t get on the same page, but Paget and Georgia are perfectly in tune. Adam makes a big romantic gesture for Jenna that backfires. And a shocking marriage proposal puts a relationship to the test.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/a1YSCCSyAbyByuakXuNe4OYOtNV.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-04",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 2244800,
                    "name": "The Birds",
                    "overview": "A murder of crows in the mast stirs up seafaring superstitions that put the crew on edge and the boat on its side. Madison and Georgia friendship is pushed to the brink. While Paget and Chris begin a very British bromance, Adam keeps Jenna at a distance. Georgia attempts to get her mind off of Paget, but it’s not enough. Everyone’s issues are put in perspective when a group of hilariously heartwarming charter guests board to celebrate the life of a dear friend.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/qgG4mCuakB2EXFJgQLYXGDsZaa6.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-11",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 2267185,
                    "name": "You Snooze, You Lose",
                    "overview": "Jenna and Adam try to move forward in their strained relationship. When Jenna joins Adam for a nap on her break, Madison and Ciara pick up the slack in service, and Glenn takes notice. Chris gets injured handling a heavy water toy, and then Paget hurts himself as well, leaving Ciara to carry extra weight as the deck team limps toward the homestretch. After witnessing the lag in service this charter, Captain Glenn calls Jenna in for a meeting that may have lasting consequences.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/dxkEuAwgxd9B59vFZ8wq8c8PmCa.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-18",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 2271774,
                    "name": "Dope!",
                    "overview": "Captain Glenn confronts Jenna about her relationship with Adam. A doctor visits and delivers bad news that could end one crew member’s career. With drama swirling in all departments, Captain Glenn is further shocked to learn that someone may have brought illegal drugs onto the boat. A tough decision and an impending drug search threaten to bring the charter season screeching to an early end.",
                    "production_code": "",
                    "runtime": 42,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/hYhXlVD8fjQu9OOE5dZhCsNhykz.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-05-25",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 2278504,
                    "name": "Regatta Go!",
                    "overview": "On the season finale, an uncomfortable drug search on Parsifal III casts a dark cloud over the final charter and sends the crew into panic mode. The crew scrambles to pull together a sailing regatta, but still wonder if they’ll get a tip. Tensions in the interior department finally boil over, as a heated confrontation erupts. Georgia has feelings she needs to get off her chest, even if it means possibly altering some relationships forever. Captain Glenn takes the crew out one final time to celebrate Ciara’s birthday and reminisce about the season. The crew says some final and emotional good-byes.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/t6lk13VhI5RWRFufWtGHofbp0M1.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2020-06-01",
                    "episode_number": 18,
                    "episode_type": "finale",
                    "id": 2293387,
                    "name": "Reunion",
                    "overview": "Georgia, Paget and Ciara finally clear the air about their flirtation; Ciara opens up about Georgia's betrayal; Parker reflects on his lack of experience; Jenna and Adam discuss the ups and downs of their romance; Madison and Jenna go head to head.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 1,
                    "show_id": 97872,
                    "still_path": "/frAb9v3V0MRjMQU6t17N6Rom5yG.jpg",
                    "vote_average": 1,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 1",
            "overview": "The superyacht Parsifal III sets sail with a colorful new crew as they navigate high winds, hookups and more at sea in this spinoff of the hit franchise.",
            "id": 140880,
            "poster_path": "/nRoHyVdPfxpm8QkgEKxXMfCfF7.jpg",
            "season_number": 1,
            "vote_average": 8.4
        },
        "2": {
            "_id": "600c44d12a210c00419ad3fa",
            "air_date": "2021-03-01",
            "episodes": [
                {
                    "air_date": "2021-03-01",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 2671562,
                    "name": "Running on Fumes",
                    "overview": "The first charter gets rocky when the guests get in a drunken personal fight; the next morning, the guests' excitement to sail puts Daisy and Natasha at odds over serving breakfast on heel; Jean-Luc realizes he may have lost two guests at sea.",
                    "production_code": "",
                    "runtime": 54,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/8drW7VP3bU3QMyHJvWhDD8YYsFE.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-03-08",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 2741618,
                    "name": "Nookie Mistake",
                    "overview": "Deckhand Jean-Luc tries to rebound after losing two guests, but his inability to sleep in his undersized bunk interferes with his work and his attitude. When the dust settles, the crew gives the guests a lot to mullet over as they pull together a rip-roarin’ 80s rock party. A confrontation about pita bread between Chef Natasha and Chief Stew Daisy doesn’t add up. Captain Glenn pushes the boat hard during a lively sail as primary charter guest Nikki’s father blesses the group with favorable winds. The crew goes absolutely wild during their first night off, and First Mate Gary makes a drunken decision that could have dire consequences for the deck team.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/hc3X7yQ1l44pfINFpO8HPYqMrgl.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-03-15",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 2769123,
                    "name": "Smoldering Secrets",
                    "overview": "The hungover crew of the Parsifal tries to piece together what they did the night before; Dani does some sleuthing while Gary and Sydney downplay their hookup; Daisy's frustration with the deck team ratchets up.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/7WQO3AVGNo5usAKzasmWN1QW7ar.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-03-22",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 2803029,
                    "name": "Barrie'd Alive",
                    "overview": "The Parsifal crew is on edge waiting for important test results; when night falls, they play a naughty game of Truth or Dare; when Sydney notices that flirtations between Alli and Gary are heating up, she takes matters into her own hands.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/s8JYTvM8YCwdPchLBAm2n92Bj2f.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-03-29",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 2803030,
                    "name": "Hollandaze and Bustiers",
                    "overview": "Natasha finds it nearly impossible to keep the galley afloat; Gary can't get any one-on-one time with Alli with Sydney hovering nearby; a beach picnic turns into a fiasco; the deck team puts on a drag show that has the guests raving.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/gVDjh4YSL0ZU7fyJJnGQkQ4FdL0.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-04-05",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 2853302,
                    "name": "Throuple Trouble",
                    "overview": "Feeling a lack of support, Daisy remains at odds with Gary and Natasha; Daisy jumps through hoops to plan an extravagant proposal for Barrie and Scott; flirtations between Dani and Jean-Luc continue to build; plates fly during a lunch service.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/1uZGDuTDeQxhv5cItdqjE6qIQlA.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-04-12",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 2853303,
                    "name": "The Scorning After",
                    "overview": "Sydney goes all-in on Gary; Alli is pushed to her breaking point; a rowdy group of returning guests spells trouble; Dani and Jean-Luc get more intimate during the the night shift, and Sydney notices Jean-Luc's work is suffering as a result.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/37ES0cBrAcbhFSEqCu86hW346WZ.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-04-19",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 2877287,
                    "name": "Cake Shock",
                    "overview": "Natasha is frustrated with Daisy's constructive criticism; Gary and Colin play blackjack croupiers for the guests; Sydney gets frustrated as Gary puts the hot pursuit on Alli.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/1iREkvopNdtxFAJ9beMeX82REst.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-04-26",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 2896171,
                    "name": "Panic on a Track",
                    "overview": "The deck team springs into action when a surge of wind pushes Parsifal towards the dock; Dani has a panic attack while under sail; Colin receives heartbreaking news from home; Alli feels the pressure to address Sydney’s dirty laundry.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/36e43bDWKnt43aTGDC63ZOHabWl.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-03",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 2906422,
                    "name": "Knotty Knotty",
                    "overview": "The interior pulls off a murder mystery dinner; an anchor tangle threatens to hold up the guests’ departure; Gary and Alli openly express their affections; Jean-Luc and Gary argue about work; Dani and Alli take matters into their own hands.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/luQCXC4WQDW5IxNFTzhKky9gSgq.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-10",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 2923539,
                    "name": "Crash Boom Bang!",
                    "overview": "The crew is excited to enjoy a much-need day off together, but things get touchy when the couples’ PDA goes on full display. Amidst the lovers vs non-lovers quarrel, Sydney drops bombs that re-ignite Daisy and Gary’s interior vs exterior feud. While at the dock, high winds blow Parsifal straight into the dock. Glenn and the deck team scramble to bring the boat to safety, and Gary comes to the rescue in a big way. Just as the crew thinks they have things under control they smash into the dock a second time!",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/okW6vdhDfdZeiwFCTpSLaEGbiCG.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-17",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 2943258,
                    "name": "Total Ship Show",
                    "overview": "Glenn reels in the aftermath of the boat crash. After assessing the damage, the crew does their best to get the boat - and their mindset - into charter-ready condition… but a high-maintenance group of female guests only sends the crew further into a spiral. A thunderstorm threatens the guests' first dinner, and Natasha only adds to the chaos when she suddenly decides to remove courses from the dinner menu, leaving the guests hungry for more. When Jean-Luc reveals to Dani that he may have given her an STD, things really get turbulent.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/7ewcFkSJjCg0UJu56y9tJSRmcmV.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-24",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 2974462,
                    "name": "Nip N Slide",
                    "overview": "The cat fight continues as the guests gut each other over lunch. Later that night, Daisy pulls together a mermaid-themed dinner while Jean-Luc dons glittery leggings and serves himself up as dessert. Alli makes a difficult decision that leaves Gary reeling. Sydney is tasked with writing a song about women’s empowerment, and Colin offers to orchestrate. Things get awkward when the primary overhears Alli complaining about her mom and informs Glenn of the indiscretion. At a perilous beach picnic, the rosé runs dry, and as the Parsifal crew begins to crack, Glenn’s frustration boils over.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/QhpLck0TZECIsq5jVRUs9D47zr.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-05-31",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 2982678,
                    "name": "No Shirt, No Clue, Big Problems",
                    "overview": "Tired of his crew making simple mistakes, Captain Glenn keeps an unwavering eye on them. A Women’s Empowerment Dinner takes a strange turn when the women involved can’t stop tearing each other down. Sydney and Colin bring the mood back up when they perform an original song for the guests. An evening sail catches Natasha off guard, and she never quite catches back up. Dani and JL get serious about where their relationship is heading but questions still linger. Gary takes a swing and whiffs on an attempt to get Alli back and then doubles down on more bad decisions.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/yaLV0sSRqzVJjrcKaFVxhGNM5g0.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-06-07",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 3004203,
                    "name": "Sexual Heeling",
                    "overview": "An awkward jacuzzi party ends in a screaming match that Daisy tries but fails to mediate. Jean-Luc plans a romantic date for Dani. And when Captain Glenn announces that a last-minute charter is coming aboard, the Parsifal crew goes into a tailspin.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/35BYZijzrBIJgaVkBfiRdWnpRDz.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-06-14",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 3011775,
                    "name": "Last Call for Parsifal!",
                    "overview": "A charter group of super-yachties arrives, and the Parsifal crew is anxious about being judged by their peers. But as the guests get boozed up, the Parsifal crew contemplates getting down, and Captain Glenn keeps a worried eye on his party-hardy team. After the charter, the final night out takes place at a picturesque castle, where Daisy reveals a secret that sets fireworks off in all directions. Back on the boat, the crew forgoes fighting for festivities, as Gary turns the hot tub into a wet and wild bubble bash. Most of the crew says their good-byes, but Natasha, Gary, Alli, and Sydney stay aboard to help Glenn with an ocean crossing. The drama doesn’t stop even though the season is over.",
                    "production_code": "",
                    "runtime": 54,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/iV9kdY5P3s0CwyUC4oBf8cjKWkZ.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-06-21",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 3011776,
                    "name": "Reunion (1)",
                    "overview": "Daisy confronts Gary about his behavior; Natasha and Daisy still can't agree on the amount of pitas served; Glenn answers uncomfortable questions about the biggest crash in \"Below Deck\" history; Andy asks Dani the question everyone wants to know.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/mCI1dBQ0iahemrh7a3lhawXvAuW.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2021-06-22",
                    "episode_number": 18,
                    "episode_type": "finale",
                    "id": 3025921,
                    "name": "Reunion (2)",
                    "overview": "Andy Cohen welcomes the cast of Below Deck Sailing Yacht for part two of the reunion show, where they answer some difficult questions.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 2,
                    "show_id": 97872,
                    "still_path": "/nf8XLkOj8cRXmJ0yXRelYRzsqtX.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 2",
            "overview": "This season, when the chief stew and chef discover they’re on different pages, mistrust and miscommunication makes for an extremely volatile working relationship that impacts everyone on board. As department heads undermine each other’s authority, arguments trickle down the chains of command as tension reaches an all-time high between the interior and exterior teams. With new safety protocols in place, the crew must stay on the yacht in between charters, blurring the lines professionally and personally, leading to a boat-load of nauti-yachties.",
            "id": 178061,
            "poster_path": "/A5msMIC76zqKO8uooijFrlUckk3.jpg",
            "season_number": 2,
            "vote_average": 9
        },
        "3": {
            "_id": "61efe516cedac4011b891d2c",
            "air_date": "2022-02-21",
            "episodes": [
                {
                    "air_date": "2022-02-21",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 3467276,
                    "name": "Tom Foolery",
                    "overview": "Captain Glenn is back on board Parsifal III, sailing the Balearic Island of Menorca with some familiar faces -- Daisy, Gary, and Colin; new to the team, Chef Marcos knows he has to make this season memorable for the guests.",
                    "production_code": "",
                    "runtime": 54,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/eYzoLLjGDkiUkm4YTSZJHuKcug4.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-02-28",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 3467277,
                    "name": "Age-Old Problems",
                    "overview": "Parsifal III's new crew figures out how to work together to execute a successful first charter. Marcos works tirelessly to satiate the massive appetites of the charter guests. Gabriela aims to prove she deserves the second stew title while Ashley works her own angle to convince Daisy she’s the better pick. A sail that is sold to Daisy as mild ends up including a dramatic heel, which leaves glasses broken and her fuming. To make up for the embarrassment of the first night, Tom tries to prove to his new team that he is good at his job but he struggles along the way. The first crew night out leads to conflict between Tom and Ashley after Ashley dismisses Tom’s advances because of his age.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/fszxAmwsGGXP0cOgLG6NxDOvz6x.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-07",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 3467278,
                    "name": "Omelette You Finish But…",
                    "overview": "After a wild night off, a hungover Parsifal III crew puts the pieces of the night back together as they prepare for the second charter of the season. Tensions come to a head in the interior department when Gabriela and Ashley can’t agree on who’s in charge, forcing Daisy to step in. Tom finds it increasingly difficult to find his footing on deck and with Ashley. When a group of returning charter guests board the ship, their high demands and quick temper leave chef Marcos and Daisy feeling lost at sea.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/tItmNtQ7GH4L84NJBdnlbvvIoqE.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-14",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 3593516,
                    "name": "Oopsie Daisy",
                    "overview": "Demanding charter guests continue to keep the crew on their toes. Eager to please, chef Marcos injures himself while trying to prepare dinner. A startled crew rallies behind Marcos as he forges ahead in hopes of preparing the best, yet most bizarre dinner of his career. Meanwhile, Captain Glenn confronts the primary about a costly damage to the yacht before the charter guests make a swift departure and leave behind a shocking tip. After another boozy hot tub night, Parsifal III’s resident playboy Gary ends his night in an unexpected and steamy way.",
                    "production_code": "",
                    "runtime": 54,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/vEUdaOzaywadom67KjSmTw4ysjC.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-21",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 3603743,
                    "name": "Loose Lips Sink Ships",
                    "overview": "While the sexual chemistry heats up on the boat, Ashley and Gabriela continue to be icy towards one another. From the galley, Marcos takes note of the competition unfolding between the junior stews and alerts Daisy, making for an unhappy chief stew. On deck, all seems to be going well, until Tom gets some devastating news from home. His distraction has a ripple effect, resulting in the most perilous situation Parsifal III has ever found itself in.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/fgu6DGmXOLU3t3sSYk1gx9LZfuM.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-03-28",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 3623914,
                    "name": "Yacht on the Rocks",
                    "overview": "Parsifal III hits aground under Tom's watch, sending the boat into total chaos; the crew pulls it together for the guests' departure, but Tom's actions put Glenn and the deck team in a difficult situation.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/gh7GyhCfi4XBYvICh73TGDIpMZy.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-04-04",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 3630667,
                    "name": "Strip for the Tip",
                    "overview": "Tom continues to spiral over his mistakes while juggling devastating news from back home. Capt. Glenn contemplates whether he can trust Tom. The Parsifal III crew pull together a “talentless” talent show for the energetic charter guests. In the galley, Gabriela and Marcos have a miscommunication during dinner service that causes tension to bubble up between them. Friction between Gary and Daisy intensifies after Kelsie is caught covering Gabriela’s duties on the final day of charter.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/iQevSPLiKM0Ixt1KLcw9FStmNES.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-04-11",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 3656408,
                    "name": "Big Fender Energy",
                    "overview": "The conflict between Gary and Daisy further escalates following their disagreement about their departments. Between the massive new fenders and being a man down, it takes the whole crew to manage a chaotic docking. Ashley finds herself in both physical and emotional pain after witnessing Gabriela and Gary in bed together, but she isn’t the only one frustrated with the second stew. After a tense dinner, Gabriela’s relationships with her fellow crew members spiral out of control leaving her questioning whether or not she can continue the season. With a new charter comes new problems when an exhausted Gary is injured while trying to manage all the exterior duties without a second deckhand.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/lEFodQCgedgM8UcgQuftKLY1Alz.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-04-18",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 3669620,
                    "name": "Tensions High, Patience Low",
                    "overview": "Tensions rise on the boat for both the interior and deck crew. Gary’s finger gets stuck in the main saloon doors causing so much pain that his patience with Kelsie is obsolete. Still one man down, Kelsie tries to keep her head above water with the new 12-hour graveyard shift. On the interior, Gabriela works hard to amend her relationship with the crew but feels isolated from the team. Ashley confides in Daisy about Gabriela’s attitude, forcing Daisy to have a private conversation with Gabriela.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/haxulLP1vaWyFulqvXyKtsFpNj1.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-04-25",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 3679418,
                    "name": "Villa Today, Gone Tomorrow",
                    "overview": "After getting vulnerable with Daisy about how low she’s been feeling aboard Parsifal III, Gabriela wants to try to turn things around on the upcoming crew day off. Coming off another successful charter and in true celebratory fashion, Ashley goes full steam ahead in her pursuit for Gary. The next morning, however, a hungover Gary claims he can’t remember what happened. The crew head to a luxury villa to unwind, reset and figure out what really happened between Gary and Ashley. Everyone is riding high until Marcos and Gabriela bump heads yet again, instantly turning a day in paradise into one of drama and torture.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/u2Lxqp0YVIgAdq2wDhZaqxByi67.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-05-09",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 3694964,
                    "name": "Paging Dr. Nipples",
                    "overview": "Gary jumps to the rescue as an empty neighboring boat drags into another boat nearby; Marcos shines again as he caters to the demanding guests with ease, but his crew worries that he's burning himself out.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/fFsvSQ5eCFgsBTr6IXodPDk7VEa.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-05-16",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 3701520,
                    "name": "New Girl Aboard",
                    "overview": "Daisy is brought to her breaking point as the demanding guests continue to challenge the Parsifal III crew with their incessant requests. The arrival of a new stew puts smiles on everyone’s faces except for Ashley’s as she’s quick to claim Gary as her territory. When sparks fly between Gary and new stew Scarlett, Ashley shifts her focus to work, determined to finally get the coveted second second stew position.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/9OIte3RkhlYSogs7rOkr525zujV.jpg",
                    "vote_average": 8,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-05-23",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 3723051,
                    "name": "Budding Boatmance",
                    "overview": "After campaigning for a promotion, Ashley is sorely disappointed to be given the title “Junior Stew,” making her and Scarlett equals. With returning charter guests, can Daisy lead her junior stews to success? Gary is back to his flirtatious ways as he distracts Scarlett to the ire of both Ashley and Daisy. Marcos has to navigate a myriad of dietary restrictions while planning a 10-course meal. After a charter full of no wind, Glenn is determined to impress the guests with a sailing race to secure that ever-elusive big tip.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/33Wuu0DDjY10tXPGUBs7URYWzX8.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-05-30",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 3738870,
                    "name": "Smashley",
                    "overview": "After ending another charter on a high note, the crew are raring to go for a night on the town. Ashley swears she’ll stay out of Gary’s and Scarlett’s boatmance while Scarlett continues to walk a fine line between balancing her feelings for Gary and keeping her interior team happy. As charter number eight approaches, Glenn informs the crew they will be stuck at anchor for the next several days due to bad weather, leaving the crew to feel the pressure to bring their A game. Marcos feels it the most as he’s tasked with a molecular gastronomy meal while just receiving bad news from home.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/hR30TcOCnpoojpqG34hnHBdvMAW.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-06-06",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 3753136,
                    "name": "Salty Seamen",
                    "overview": "Chef Marcos attempts to power through another stellar dinner while dealing with some devastating news. The weather conditions intensify forcing the deck crew to attempt to avoid another running-aground scenario. To keep themselves entertained at anchor, the guests challenge the crew to a relay race to determine who’s the most worthy of their inaugural Seaman’s Cup Trophy. With the charter coming to a close, the crew hope their hands-on approach with the guests give them a tip to remember.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/5xEKbzgmiOXepWcobNQq9aS4FOI.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-06-13",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 3764517,
                    "name": "Parsifal's First Wedding",
                    "overview": "Reeling from the news that Parsifal III has a last-minute charter with the hardest preference sheet of the season, the crew try to enjoy their night off. A wild night leads to massive hangovers the next day as Chef Marcos struggles to create a savory but safe menu for the guests based on a complex list of dietary restrictions, plus a three-tiered gluten free wedding cake. Ashley sets her sights on proving to Daisy that she’s ready to be promoted. Scarlett tries to determine if Gary has long-term potential after the charter ends. Pulling off a wedding is the crews biggest challenge yet as they pull out all the stops to end the season strong.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/u2kE62gVwN82Bk2Eh6GvRlDEGXK.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-06-20",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 3781213,
                    "name": "All Roads Lead to Gaisy",
                    "overview": "As the guests return from the wedding ceremony, the crew tries to cap off a great season with the perfect reception dinner. While Marcos strives to wow the guests with his best meal yet, time is running out and he still has to add the finishing touches on the wedding cake. Daisy puts Ashley in charge of the final dinner service to see if she’s finally ready for a promotion. Gary and Scarlett try to savor what little time they have left. Once the guests depart, the crew tries to enjoy one last night together as Gary looks for the perfect stew to end his season with.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/lWnvjEuNLENBHteoESNGTnoeyLI.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2022-06-27",
                    "episode_number": 18,
                    "episode_type": "finale",
                    "id": 3797932,
                    "name": "Reunion",
                    "overview": "The cast comes together to look back at events from the season.",
                    "production_code": "",
                    "runtime": 65,
                    "season_number": 3,
                    "show_id": 97872,
                    "still_path": "/9iXym9ZOVdVVP1QHj6mefoRGsIP.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 3",
            "overview": "",
            "id": 241365,
            "poster_path": "/xRYK5NhY15uKaJ4a97xmWyHxSCi.jpg",
            "season_number": 3,
            "vote_average": 8.3
        },
        "4": {
            "_id": "6412f91be18e3f0816c55e60",
            "air_date": "2023-04-10",
            "episodes": [
                {
                    "air_date": "2023-04-10",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 4301233,
                    "name": "ParsiFAIL",
                    "overview": "Back on board Parsifal III in Sardinia, Italy, Capt. Glenn is poised for his smoothest sail yet -- until he isn't; Daisy comes back ready to prove she knows what she's doing as a chief stew; chief engineer Colin is determined to avoid a boat romance.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/anpghZO4fXLESotNW5duMRjS93A.jpg",
                    "vote_average": 9,
                    "vote_count": 1,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-04-17",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 4349109,
                    "name": "Worst Vacation Ever",
                    "overview": "Capt. Glenn is hopeful Colin's plan to fix the engine works; Chef Ileisha has problems at dinner; the guest blame Daisy for the lack of service.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/hamAQxMrOQqQlWtFfSrCDTO2Trm.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-04-24",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 4354096,
                    "name": "The King Is Back",
                    "overview": "Capt. Glenn finally wakes up to some good news; the entire crew is invited to join the guests for dinner and Chef Ileisha has to change her menu last minute.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/8q9sMOGx8VuNEbdQPkRrId2hxLU.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-05-01",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 4354097,
                    "name": "Lazy Daisy",
                    "overview": "Capt. Glenn insists a stew go on all excursions; Daisy is frustrated after learning she's a stew down while the deck team goofed off on the eFoils; chef Ileisha's perfectionism is thrown off when she faces her greatest fear in the galley.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/aA3sweEKBfLB3gjOyRvBPCPNNAp.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-05-08",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 4360343,
                    "name": "Hate Me Tender",
                    "overview": "Capt. Glenn Shephard and his crew set sail in a luxury sailing yacht to explore the crystal-clear blue waters of the Ionian Sea.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/yFTq0WnCNt2AcV1CQuslURZUMHA.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-05-15",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 4377898,
                    "name": "Clash & Burn",
                    "overview": "In an effort to turn the charter around, Capt. Glenn takes the guests on a sail; Lucy makes a mistake to a charter guest's garment; chef Ileisha continues to leave the guests waiting too long between courses; Capt. Glenn gives her honest feedback.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/3kSNGQOcK9ALo5ejOFimwLMFI1c.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-05-22",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 4444862,
                    "name": "Smoke On The Water",
                    "overview": "Another engine issue emerges, forcing Capt. Glenn to keep the returning guests entertained; Daisy and Colin make up after their fight as their relationship grows stronger; Daisy confronts Gary about Mads and claims he's playing his usual games.",
                    "production_code": "",
                    "runtime": 45,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/qKW2gZm9cBmICUMI0fu5TB2MYqO.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-05-29",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 4456879,
                    "name": "Cheers to Boobies",
                    "overview": "After Chase confides in Gary about Alex's lackluster work ethic, Chase's trust is broken when Gary tells Alex about their conversation.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/7iOVRXpZDxzESTfXWPVnARJ6g0I.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-06-05",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 4456881,
                    "name": "Love Boat",
                    "overview": "Glenn dresses up for the guests' theme night; he hopes his participation helps correct a jewelry theft hiccup and is on top of his crew to make sure the women have the best trip of their lives.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/vWmJHyNdIHAvo1t8hfVUu9iRzD4.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-06-12",
                    "episode_number": 10,
                    "episode_type": "standard",
                    "id": 4456883,
                    "name": "Loose Lips Sink Friendships",
                    "overview": "The crew has the day off, and even Capt. Glenn recharges by enjoying Parsifal III all to himself and riding the eFoil; Colin saves the day clearing the clogged toilets, but he gets jammed up when his honest opinion strikes a chord.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/elfQm8M7UfM95K3Ph1rsEdIffuj.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-06-12",
                    "episode_number": 11,
                    "episode_type": "standard",
                    "id": 4456884,
                    "name": "Burnt Hands and Broken Hearts",
                    "overview": "Caught in an uncomfortable situation, Daisy doesn't know where she stands with Colin after keeping a massive secret from him; determined to prove Colin wrong, chef Ileisha picks herself up just to be knocked back down.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/gUaJC18tIdt1MQHidkudvxNogG2.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-06-19",
                    "episode_number": 12,
                    "episode_type": "standard",
                    "id": 4501246,
                    "name": "Let Them Eat Cake",
                    "overview": "Capt. Glenn notices the standards are slipping on Parsifal lll, as the crew is exhausted with the mid-season blues; distraught that Colin and Gary aren't speaking, Daisy takes initiative and forces them to hash out their problems.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/guBxHnNPY6WckWWhYXFNZejhJ8B.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-06-19",
                    "episode_number": 13,
                    "episode_type": "standard",
                    "id": 4501248,
                    "name": "T-Bone With Stakes",
                    "overview": "Capt. Glenn notices the crew is slipping on service when a guest is injured and interior doesn't hear the walkie call; after Alex and Mads confess their feelings from the start, Mads is torn between Alex and Gary.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/4oxzfdBVrMcHXKrICndbwoUyMxX.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-06-26",
                    "episode_number": 14,
                    "episode_type": "standard",
                    "id": 4501249,
                    "name": "Hurricane Bonnie",
                    "overview": "Capt. Glenn reprimands the crew as recent slip-ups are directly affecting communication and morale; Daisy breaks down when she's proven wrong about the walkies not working; chef Ileisha is determined to prove she can complete a 10-course dinner.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/p5z4eZG4zDXN2xdS3jtv8ZCp6Vl.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-06-26",
                    "episode_number": 15,
                    "episode_type": "standard",
                    "id": 4501251,
                    "name": "She Loves Me Not",
                    "overview": "Capt. Glenn is proud of the crew for knocking out a pride charter, but has to deliver bad news; after Gary learns about Mads' three-way kiss, he starts flirting more with Daisy, leading Colin to voice his concerns; Colin throws a gossip grenade.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/bYt6SWGww8LRUFauhKGljCaL4Dz.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-07-10",
                    "episode_number": 16,
                    "episode_type": "standard",
                    "id": 4536787,
                    "name": "Boat Load of Throuples",
                    "overview": "Capt. Glenn threatens to kick one of the throuple charter guests off during a drunken guest fight; Mads receives a wake-up call that prompts her to dismiss Gary's apology attempt.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/w1c1yglzVzRR5k11IC8FX3WxsPI.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-07-10",
                    "episode_number": 17,
                    "episode_type": "standard",
                    "id": 4536788,
                    "name": "Man Buns It Has Been Fun",
                    "overview": "Proud of his team's accomplishments during the final sail, Capt. Glenn believes his tough love made them all stronger; the crew celebrates its final night out, and Daisy and Colin try to soak up every moment of it.",
                    "production_code": "",
                    "runtime": 44,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/6sUOQlJSEJiC8xrhchBwBJPJFI.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-07-17",
                    "episode_number": 18,
                    "episode_type": "standard",
                    "id": 4536794,
                    "name": "Reunion (1)",
                    "overview": "The cast members of \"Below Deck Sailing Yacht\" Season 4 come together to talk about the events of the season.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/iLLb5293Fg6gwovK7BLo9EzWx4G.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2023-07-18",
                    "episode_number": 19,
                    "episode_type": "standard",
                    "id": 4570131,
                    "name": "Reunion (2)",
                    "overview": "Shocking secrets are revealed as part two of the season 4 reunion concludes.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 4,
                    "show_id": 97872,
                    "still_path": "/3F2qRFJw24wFXu6Dv9jISfkYYSH.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 4",
            "overview": "",
            "id": 332682,
            "poster_path": "/nWxjKBtjUJRSQI57VZH9otvQuYu.jpg",
            "season_number": 4,
            "vote_average": 9
        },
        "5": {
            "_id": "66e892d3d7bcca524db1477a",
            "air_date": "2024-10-07",
            "episodes": [
                {
                    "air_date": "2024-10-07",
                    "episode_number": 1,
                    "episode_type": "standard",
                    "id": 5603775,
                    "name": "Ibiza, Baby!",
                    "overview": "Gary and Daisy try to work through resentments; new crew members get feisty and flirty; Chef Cloyce can't keep up with guests' individual requests.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 97872,
                    "still_path": "/pKND2fdsSvkmgqoI0yZFBYHU0ju.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-10-14",
                    "episode_number": 2,
                    "episode_type": "standard",
                    "id": 5657261,
                    "name": "Tender Bender",
                    "overview": "Gary crashes the tender and worries about how much damage he's caused; Danni and Keith continue to flirt on the boat; chef Cloyce surprises everyone with an unexpected rap; Gary and Daisy's friendship is still rocky despite trying to clear the air.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 97872,
                    "still_path": "/sQoROe3nCwbrfkNcL3pP5S7AaTa.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-10-21",
                    "episode_number": 3,
                    "episode_type": "standard",
                    "id": 5657263,
                    "name": "Let the Bottles Hit the Floor",
                    "overview": "An argument about splitting the bill puts Chef Cloyce on the outs until he bonds with the boys and finds his place in the crew; the deck team struggles during a tender lesson; a severe sail causes bottles of liquor to crash all over the boat.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 97872,
                    "still_path": "/pJBuIH1s0iqjW2dDeI7pOurUQi6.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-10-28",
                    "episode_number": 4,
                    "episode_type": "standard",
                    "id": 5657264,
                    "name": "Mer-made a Big Mis-cake",
                    "overview": "Daisy summons a mermaid from the sea to give the primary a magical 60th birthday, but a disastrous cake mishap puts the entire evening in jeopardy; the stews argue over a cocktail training exercise gone wrong; Emma unloads on them during a night out.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 97872,
                    "still_path": "/8cXOgJZf0oLJMVbxRAkLWqvqonS.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-11-04",
                    "episode_number": 5,
                    "episode_type": "standard",
                    "id": 5657265,
                    "name": "Bean Counter",
                    "overview": "After a tense night out, a bucket of chicken really turns things around; Dr. Tiffany Moon and husband Daniel come aboard with their friends, hoping for a five-star experience; Keith and Danni struggle to get in sync.",
                    "production_code": "",
                    "runtime": 43,
                    "season_number": 5,
                    "show_id": 97872,
                    "still_path": "/vZzrNIjpo3MAJswa9U7Z9GWUKdh.jpg",
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-11-11",
                    "episode_number": 6,
                    "episode_type": "standard",
                    "id": 5716633,
                    "name": "Loose Lips Sink Trysts",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 97872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-11-18",
                    "episode_number": 7,
                    "episode_type": "standard",
                    "id": 5716634,
                    "name": "My Super Sideways Sixteen",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 97872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-11-25",
                    "episode_number": 8,
                    "episode_type": "standard",
                    "id": 5737626,
                    "name": "Episode 8",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 97872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                },
                {
                    "air_date": "2024-12-02",
                    "episode_number": 9,
                    "episode_type": "standard",
                    "id": 5737627,
                    "name": "Out, Damned Spot",
                    "overview": "",
                    "production_code": "",
                    "runtime": null,
                    "season_number": 5,
                    "show_id": 97872,
                    "still_path": null,
                    "vote_average": 0,
                    "vote_count": 0,
                    "crew": [],
                    "guest_stars": []
                }
            ],
            "name": "Season 5",
            "overview": "",
            "id": 418886,
            "poster_path": "/v7JuE5wg04wvnMEjL3a81N3AXYF.jpg",
            "season_number": 5,
            "vote_average": 0
        }
    }
}