{"adult":false,"backdrop_path":"/40Q6bTumMp5SAGuGnuu2lcGvbHE.jpg","created_by":[{"id":1946150,"credit_id":"62d6ea7a8a0e9b0054a55286","name":"Eugene Ishikawa","gender":0,"profile_path":null}],"episode_run_time":[21],"first_air_date":"2002-08-23","genres":[{"id":16,"name":"Animation"},{"id":10759,"name":"Action & Adventure"},{"id":10765,"name":"Sci-Fi & Fantasy"}],"homepage":"","id":982,"in_production":false,"languages":["ja"],"last_air_date":"2003-12-12","last_episode_to_air":{"id":52190,"name":"Mortal Combat (3)","overview":"Powerlinx Optimus and Galvatron begin their final battle inside Unicron. The battle is soon interupted, as Unicron revives from their hatred for each other! Because the Autobots and the Decepticons hate each other from the war, his power continues to grow, and he comes back to life to fill the world with his evil and torment. The others are awaiting Optimus's safe return from his mission, but Hot Shot must make a command: attack the revived Unicron, or wait for their leader to come back. He decides to mobilize the troops for one last attack on Unicron. Optimus and Galvatron continue fighting to the death, but honor each other as equal Transformer Warriors. But Unicron is starting to break apart! In his last resort attack, Unicron opens up a large black hole within his body. Galvatron wants to let go, but Optimus wants to save him. Galvatron sacrifices his life and he says just as his life ends, the Autobots have won the war, and Unicron can not return from the loss of evil in the unive","vote_average":0,"vote_count":0,"air_date":"2003-12-12","episode_number":52,"episode_type":"finale","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/72OlAY1kVugcsMJ2H5payyc3MZK.jpg"},"name":"Transformers: Armada","next_episode_to_air":null,"networks":[{"id":98,"logo_path":"/1oTje9uOhRcuLSAc8ERn0cnG51i.png","name":"TV Tokyo","origin_country":"JP"}],"number_of_episodes":52,"number_of_seasons":1,"origin_country":["JP"],"original_language":"ja","original_name":"超ロボット生命体トランスフォーマー マイクロン伝説","overview":"Transformers: Armada, known in Japan as Chō Robot Seimeitai Transformers: Micron Densetsu, is a Transformers animated series, comic series and toy line which ran from 2002–2003. It was originally scheduled for 2001, however was delayed until early-2002. As the first series co-produced between the American toy company, Hasbro, and their Japanese counterpart, Takara, Armada begins a new continuity/universe for Transformers, with no ties to any of the previous series, including the immediately prior Transformers: Robots in Disguise in 2001. It would go on to birth a sequel in the form of Transformers: Energon.","popularity":21.735,"poster_path":"/tjbBjYfXyISFZMbpNQBNoiKwJp2.jpg","production_companies":[{"id":30125,"logo_path":"/idI9yjIWXWgLLdWqUbBpWzmTW9t.png","name":"Actas","origin_country":"JP"},{"id":53504,"logo_path":null,"name":"NAS","origin_country":"JP"}],"production_countries":[{"iso_3166_1":"JP","name":"Japan"}],"seasons":[{"air_date":"2002-08-23","episode_count":52,"id":2802,"name":"Season 1","overview":"","poster_path":"/iWWgMoQ1EJdaJDC8plXHqaNV4eQ.jpg","season_number":1,"vote_average":5}],"spoken_languages":[{"english_name":"Japanese","iso_639_1":"ja","name":"日本語"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":7.833,"vote_count":18,"season_data":{"1":{"_id":"5254107f19c2957940337f0b","air_date":"2002-08-23","episodes":[{"air_date":"2002-08-23","episode_number":1,"episode_type":"standard","id":52141,"name":"First Encounter (1)","overview":"The episode opens in space, with our narrator explaining the history of the race called \"\"Transformers\"\" in brief. After a short intro, the masculine narrator says that the race settled, a planet that was eventually called Cybertron. A war broke out between the Autobots and Decepticons, over a race of what are called \"\"Smart Tools\"\", Mini-Cons. The war escalated to a stalemate, and both the Autobots and Decepticons both finally agreed that the war was too costly, and sent all the Mini-Cons away in a large Green Vessel, very reminscent of the Ark from Generation 1.\n\nThis \"\"Ark\"\" travelled through space for a great deal of time, and landed on a primatvie planet after a damaging collision with its moon. The Mini-Cons laid dormant in this \"\"ship\"\" for over a million years, until today, where our story begins.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-08-23","episode_number":2,"episode_type":"standard","id":52142,"name":"Metamorphasis (2)","overview":"The two bullies remain trapped in the cave as Optimus and Megatron duke it out for possession of the Mini-Con that the children have collected. They run, only to be cut off by two more robots who appear just as Megatron did. Those two robots are then surprised by two more... both with Autobot symbols emblazoned on them. The children manage to escape, and Megatron is distracted long enough for Optimus to lay a blow on Megatron that knocks him the ground.\n\nThe Decepticons retreat from battle, to a crashed ship portion on the moon. Another Decepticon, who is introduced as Cyclonus, is assigned to finding the ancient Mini-Con starship that crashed on the moon. The children hide in a cave, where they come to realize the robots are after their new friend. After a brief discussion, they follow the Mini-Con deeper into the cave, where they are closed into the working remnants of the Mini-con spaceship.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":5,"vote_count":1,"crew":[],"guest_stars":[]},{"air_date":"2002-08-23","episode_number":3,"episode_type":"standard","id":52143,"name":"Base (3)","overview":"The children spot Leader-1 on Megatron's shoulder as he transforms and powerlinks to Megatron's cannon. After a super powered blast misses Optimus, the children realize that is the whole point of this battle... for possession of the Mini-Cons to increase the Decepticon's power. A landslide caused by the Decepticon's blasts distracts the Autobots for a few moments as they save the children from the rocks. Not all of the Autobots are held at bay, as Optimus throws Starscream out of his way and grapples with Megatron. They fight while the other Autobots find Mini-Cons of their own to powerlink with, gaining additional firepower which they use to drive off the Decepticons. Cyclonus manages to capture one of the remaining Mini-Con panels from the children's discovery, and reports back to Megatron as the Decepticons retreat","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-21","episode_number":4,"episode_type":"standard","id":52144,"name":"Comrade","overview":"The Autobots pick up a signal from a Mini-Con, but cant focus enough on the signal to get an exact fix. Alexis and Sureshock manage to help and get an exact location, and the group moves out for an area called Big Canyon. Red Alert warns the children that they shouldnt leave without suiting up, and each of them are 'teleported' on padded armor suits with Autobot symbols on their backs.\n\nThe 'bots transform, and head for a room in which they \"\"warp\"\" to Big Canyon, an area about 100 miles away. Upon arriving, the group splits up what ends up being 4 teams, Carlos and Red Alert, Alexis and Hot Shot, the Mini-Cons and Optimus Prime and Rad gets left behind in the bustle.\n\nOn the moon, Megatron, Demolishor and Starscream discuss their goals, and on Earth again Alexis returns for Rad, while the other groups continue their search.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-09-27","episode_number":5,"episode_type":"standard","id":52145,"name":"Soldier","overview":"Hot Shot and Red Alert don't quite get along. Hot Shot is a young warrior and Red Alert is a veteran chief science officer. There is obvious tension between them in the opening scene.\n\nThe Autobots discover a Mini-Con in the South Pole. However, the (in-fighting) Decepticons arrive shortly after.\n\nWhile Optimus is disabled due to the cold, the reckless Hot Shot denies any problems he has with Red Alert. He drives away as Red Alert stays with Prime.\n\nThe only Mini-Con-less 'bot so far, Starscream, is desperate to find a Mini-Con, as his teammates have an advantage over him. Finally, he locates one... Until Hot Shot, with Carlos as his cargo, shows up. He blasts him away as they fall into a pit. Thanks to Jolt, however, there are no injuries. Once Hot Shot gets back up, he discovers he's surrounded by the rest of the Decepticon forces. Demolishor and Cyclonus begin insulting Starscream, as Hot Shot escapes.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/7xQdrzNuu2zS6pwUrmlGmtTCJn2.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"630d5874f5483600847d2410","adult":false,"gender":2,"id":1433645,"known_for_department":"Directing","name":"Shigeki Awai","original_name":"Shigeki Awai","popularity":2.786,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"630d5a7e0398ab007a2a6be9","adult":false,"gender":0,"id":1945635,"known_for_department":"Writing","name":"Shōji Tonoike","original_name":"Shōji Tonoike","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2002-10-04","episode_number":6,"episode_type":"standard","id":52146,"name":"Jungle","overview":"The episode opens with Starscream, Demolisher, and Cyclonus fighting the Autobots. Starscream tries to pull off a daring maneuver but ends up endangering all the Decepticons. The Autobots disappear, showing us that it was all a training simulation.\n\nMegatron isn't pleased, and the belittling of Starscream, the only Decepticon without a Mini-Con, begins. Megatron also refers to Starscream as the second-in-command for the first time in the series.\n\nA signal is heard and the Decepticons race to Earth - a new Mini-Con has been detected!\n\nOn Earth, the Autobots are being their usual selves when Rad, Carlos, and Alexis walk in ready for their 'camping trip' with the Autobots - pretty much whatever adventure they go on next! The Mini-Con alert activates, revealing the position of a new Mini-Con is in a jungle/forest type of landscape. The Autobots, with their human friends, head out!","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-11","episode_number":7,"episode_type":"standard","id":52147,"name":"Carnival","overview":"The Science Fair has come to town, and while the festivities commence we find the Autobots and children at the Autobot base. While Red Alert and Optimus begin repairs on some equipment, Hot Shot takes a small break with Rad and Carlos to show off his wrench twirling skills, learned from a Western he saw on the human television. They really enjoy his show, but when Optimus berates Hot Shot and tells him to get back to work, the two are left alone. Being bored, they decide to leave their cleaning efforts at the base behind and head for the carnival!\n\nBefore leaving, Carlos and Rad are confronted by Alexis and Sureshock, and while she works on finding another Mini-Con, the two leave with Grindor and Highwire for the science fair. Meanwhile, the Decepticons are seen fixing up their own base with similiar repairs to that of the Autobots.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/5wo9fLLsnAYktyD5tdFG9X9S9SW.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"620bbc2ec15b55001b843ec6","adult":false,"gender":2,"id":1088112,"known_for_department":"Writing","name":"Ryo Motohira","original_name":"Ryo Motohira","popularity":2.188,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"630d5c29724de1007b735370","adult":false,"gender":0,"id":1010061,"known_for_department":"Visual Effects","name":"Osamu Kamijo","original_name":"Osamu Kamijo","popularity":1.96,"profile_path":null}],"guest_stars":[]},{"air_date":"2002-10-18","episode_number":8,"episode_type":"standard","id":52148,"name":"Palace","overview":"A Tribeswoman legend contains truth about a Mini-Con found in the Sahara desert many years ago, and a race has begun to find it. Cyclonus stands guard in the desert, and accidentally fires on Cyclonus as he comes in to report his lack of success... and when he takes off we find the Autobots in their base leaving from the activation of the Mini-Con alert.\n\nAfter a brief explanation that the 'bots should listen to the children because of their knowledge of desert areas, Demolishor fires on their position. The Autobots and Mini-Cons cant transform to vehicle mode (no traction in the sand), and when Hot Shot gets cocky and stands up to attack the camouflaged Decepticon, he fires, and Prime only manages to save him by a short second delay. The children find Demolishor as they sneak around from the side, but when Demolishor continues to fire, he loosens the sand in his area and the dune begins to sink into the sand.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-10-25","episode_number":9,"episode_type":"standard","id":52149,"name":"Confrontation","overview":"Billy and Fred argue about the Transformers, and their origin, when they spot Rad, Carlos and Alexa riding off in the distance. They speed off to catch up, but stop short of finding them as the children enter a forest.\n\nCyclonus manages to find the children on what appears to be a survelance run, and corners Rad against a tree. He manages to drive Cyclonus off briefly with a shot from Laserbeak, but Cyclonus finds the two bullies and grabs them, taking them hostage. He yells back to Rad that he will trade the kids for the Autobot's Mini-Cons. Rad sends Laserbeak to follow them, and the children report back to the base.\n\nThe Autobots agree they have to save Billy and Fred, and when Red Alert locks onto Cyclonus's coordinates where the Autobots warp out to his position. They find themselves in a deserted town, were Demolishor, Cyclonus and Starscream are in hiding. Billy and Fred are held captive in an abandoned warehouse, where Leader-1 keeps guard over them.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-01","episode_number":10,"episode_type":"standard","id":52150,"name":"Underground","overview":"At the Underground base, Hot Shot and Red Alert dig out more of the tunnels below the base as the Mini-Con symbol comes in. The next Mini-Con will be found in a city, so the Autobots warp off to the location in search of their next possible ally. They reach the city and split up, but find out that the Mini-Con is likely underground. They all meet up at the entrance to the city subway system, and drive in to take a closer look.\n\nAfter a short drive into the subway, the group sees a pair of lights off in the distance and the children worry that a train is coming! Quickly Hot Shot and Red Alert get off the tracks, but Prime is too large and cannont make it off the tracks in time. The train rails forward, and just in time Optimus manages to drive backwards into a side track. The group splits up, and Hot Shot drives through a terminal in his search, Red Alert follows a train, and Prime find s a circular switch area for the subway.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-15","episode_number":11,"episode_type":"standard","id":52151,"name":"Ruin","overview":"The Autobots are hard at work at installing some jet-looking devices onto the sides of Optimus Prime's trailer when Carlos comes running in, frantic about something. He mutters something about a girl, and whether or not it's time.\n\nApparently a hologram of a young girl has come across the screen at Autobot headquarters, requesting assistance. The Autobots ignore it because they've found a Mini-Con signal in the sea and soon take off for action, Carlos hoping that it will lead them to the girl.\n\nOnce at the bottom of the sea, Hot Shot goes off to do some recon and discovers a sunken city further below the sea. The Autobots make their way down when they're attacked by the Decepticons.\n\nOptimus Prime has Hot Shot and Red Alert distract them while he and Smokescreen make their way to an entrance in the city. Prime's oxygen bubble around his trailer cab begins to break from Megatron's blast, and the kids begin to get flooded from inside Optimus Prime.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-22","episode_number":12,"episode_type":"standard","id":52152,"name":"Prehistory","overview":"Rad stands alone in contemplation of the destruction of the sunken city that was found out in the last episode... while Megatron in his base tries to activate the second of the Air Defense team Mini-Cons to no avail. When the scene shifts back to the Autobot base, the children and Autobots discuss Cybertronian history.\n\nOptimus explains that in times long past, the Autobots and Decepticons fought to control Cybertron, and the Autobots managed to spring into action to stop them. The two sides fought to a stalemate, until the Mini-Cons mysteriously arrived. The Decepticons used their power to enhance themselves and attack, and it was only by teaming up with several other Mini-Cons to defend themselves and the planet where they even able to keep the odds even. The remainder of his conversation followed the explanations in the early episodes of the series, with the Mini-Cons being sent off planet and ending up on Earth after crash-landing there.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-11-29","episode_number":13,"episode_type":"standard","id":52153,"name":"Swoop","overview":"The episode starts with Cyclonus and Blackout searching an area of mountains and forest for the Autobot's base, with Megatron and the other Decepticons communicating with him from their moonbase. After he finds a signal, the group prepares for an attack.\n\nCarlos, Alexis and Rad stand outside the Autobot base with Fred and Billy, showing them the base when the alarm sounds. The children leave Billy and Fred and run off for the Command Center... and the two take off on their own to search the base.\n\nOptimus and the children review a map of the base when Optimus says that a warp gate has opened within a tunnel... and on-screen they watch Megatron and the other Decepticons warp in! Optimus has Red Alert activate Hot Shot's Internal Defense System when Carlos finally realizes that Billy and Fred are not with them. We then find the two lost within the base as the Decepticons walk by. They continually mispronounce the Decepticon's names and run for cover as the defenses activate.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/bZ8U2Vy0pP6SeXH6iHXHDMIYnk.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"630d56c23d7454007a28b86a","adult":false,"gender":0,"id":3681779,"known_for_department":"Directing","name":"Masayuki Motsumoto","original_name":"Masayuki Motsumoto","popularity":0.6,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"630d58663d745400828166ff","adult":false,"gender":0,"id":1454437,"known_for_department":"Writing","name":"Isao Shizuya","original_name":"Isao Shizuya","popularity":0.716,"profile_path":null}],"guest_stars":[]},{"air_date":"2002-12-13","episode_number":14,"episode_type":"standard","id":52154,"name":"Overmatch","overview":"A lone cloaked figure sits on top of a rocky spire in the moonlight while Starscream blasts overhead and Demolishor scrambles across the rugged landscape below. Starscream transforms and tries to grasp onto a nearby rocky spire, and Cyclonus finds a green glow in a cavern above him. While he climbs up to what appears to be a Mini-Con position however, Hot Shot appears, and calls up on the Air Defense team to form the Star Sabre. Using its power, he confronts Starscream while Smokescreen climbs up after the Mini-Con.\n\nHot Shot disables Starscream with a slash of the Star Sabre and tosses him off the spire, and then leaps after him, slicing Starscream's sword in two. Cyclonus attacks Smokescreen, who has reached the Mini-Con panel, only to be hit by the remnants of Starscream's sword. Megatron watches from below, scowling about the Star Sabre beating him again. He urges Demolishor into battle with Hot Shot and Optimus Prime tackles Megatron from above.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-12-20","episode_number":15,"episode_type":"standard","id":52155,"name":"Gale","overview":"A blast hits down on a busy highway, and a purple motorcycle rushes out of it and into traffic....\n\nHot Shot trains in the Autobot base, and remembers the fight with Scavenger in the previous ep. Rad, Carlos, Billy and Fred watch on as he trains, until a Mini-Con alert comes in and the group assembles in the Control Room. The signal is coming from a highway tunnel, and the group (including Billy and Fred) head out to the scene.\n\nDemolishor, Blackout and Cyclonus watch over a tunnel in the road as the Autobots drive up. Nearby, the same purple motorcycle pulls over, being ridden by a black driver. The driver jumps the side and onto a path to the side of the road. Meanwhile below, Scavenger digs for the Mini-Con panel and Megatron gets word from Cyclonus that the Autobots are on their way.\n\nAbove, Cyclonus knocks out a tractor and it starts a traffic jam. The jam forces the Autobots to stop, but Hot Shot powerlinks with Jolt to take off over the congestion.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2002-12-27","episode_number":16,"episode_type":"standard","id":52156,"name":"Credulous","overview":"Hot Shot and Sideways guard a canyon from the Decepticons, with Optimus and Smokescreen in a backup firing position. Hot Shot rushes the 'Cons position, and manages to make Starscream retreat while the other Decepticons wonder where Scavenger is. The Decepticons manage to run off, but a rush by Hot Shot and Sideways surrounds them. Back at the base, Red Alert, Alexis and Rad monitor the situation.\n\nWhile the Decepticons are surrounded, Sideways find the Mini-Con and Hot Shot activates a new mode, Hyperdrive. He rushes the other Decepticons while Megatron and Sideways wrestle for the new Mini-Con panel. The two Autobots manage to grab onto Megatron when he activates his teleporter, and the group are teleported off. Scavenger was indeed at the scene, looking on as the group warps out. Megatron and the group warp into the moon, and Megatron tries to activate the Mini-Con panel... to no avail.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-10","episode_number":17,"episode_type":"standard","id":52157,"name":"Conspiracy","overview":"The Autobots are being repaired by their Mini-Cons while the children watch on. After losing the Star Sabre to the Decpeticons, they have begun losing battles left and right. When Billy and Fred make note of that, the other children scold them, and the Autobots moral continues to drop.\n\nThe Decepticons rally at their moonbase, and gloat over the consistant gain of new Mini-Cons (of which the Street Speed Team, the remaining Destruction Team, Swindle and what appears to be Rollbar are shown) due to the Star Sabre. When Starscream gets overconfident and cocky against Demolishor, Scavenger comments on his lack of respect. Demolishor asks Scavenger to share with him some strategic info on how to defeat Starscream, but he would have nothing of it... and when the other Decepticons are asked about the matter, they dont want to take sides in a conflict amoungst the group.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-17","episode_number":18,"episode_type":"standard","id":52158,"name":"Trust","overview":"Carlos, Rad, and Alexis are in the kitchen area of the base, presumably eating breakfast. Carlos asks what is up with Hot Shot lately, as he has not been hanging out with them much at all. Rad tells him that Hot Shot has been training hard with Scavenger all week. The kids run off to see how the training is going...\n\nThe kids run into a large warehouse like area of the base. A loud snoring sound... what could that be they ask? Scavenger is lying atop a few of the large crates, snoring, sound asleep. Hot Shot is seen between two crates, presumably lounging has well.\n\nHot Shot is now practicing several karate style moves, while Scavenger still snoozes, nodding halfway in agreement. Carlos questions Scavenger's allegiance... cut to Red Alert and Smokescreen doing some repairs inside of several circuit panels. Red Alert and Smokescreen are discussing Scavenger as well, questioning many of the same things Carlos is questioning, which Carlos is overhearing the whole time.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Key Animation","department":"Visual Effects","credit_id":"6370fa046bdec3009be18ffa","adult":false,"gender":0,"id":3757958,"known_for_department":"Visual Effects","name":"Makoto Ito","original_name":"Makoto Ito","popularity":1.166,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-01-22","episode_number":19,"episode_type":"standard","id":2208312,"name":"Vacation","overview":"Rad, Carlos, Billy and Fred take Smokescreen, Red Alert and the Mini-cons to a vacation site. But they forget to invite Alexis to this tour, and she is offended with them very much.\n\nThe boys and robots have a good time on the bank of a mountain river. They play in a water with their new little friend whose name is Shawn. But soon the river floodes on account of the heavy shower. The landslide begins and buries Red Alert together with Carlos and Shawn. Smokescreen does his best to dig them out. Optimus Prime, Scavenger and Hot Shot rush to his help through the warp gate. They succeed in saving Red Alert and the boys.\n\nAll the company returns to the A-Base. Well, their vacation turned out to be anything that but restful! But Alexis isn't angry with her friends already. She is very glad to see them all again. Afterward Kelly a reporter and her cameraman try to review footage of the Autobots but got damage thanks to Laserbeak.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-23","episode_number":20,"episode_type":"standard","id":52159,"name":"Reinforcement","overview":"The episode starts with confrontation from the start.... Megatron is wielding the Starsabre, with his troops backing him up. Demolishor is hastily digging, searching for the Mini-Con to be found. Red Alert sneaks off behind the Decepticon defense, hoping to use his grappling hook to grab the Mini-Con from Demolishor. Before he can, though, Cyclonus blasts Red Alert, causing him to misfire and Demolishor grabs the Mini-Con!\n\nJust as soon as Demolishor grabs the panel, a blast shoots from a nearby ridge. It hits Demolishor, and he drops the Mini-Con just as the Decepticons retreat via warp. The unknown assailant leaps from hiding and transforms mid-air, grabs the Minicon, and lands on the ledge above. Optimus announces this new Autobot is Blurr, a reinforcement called in by Scavenger, who trained him. The Mini-Con is Incinerator, Blurr's Mini-Con.\n\nBack at the base, Blurr is introduced to the kids, who question him, but are blown off none the less by the new recruit.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-24","episode_number":21,"episode_type":"standard","id":52160,"name":"Decisive Battle","overview":"A meteor approaches the moon... and Megatron is ready for it. He calls upon the Skyboom shield and raises it in defiance against the huge rock. As the rock hits the shield he forces the shield against it, defending himself and his nearby Decepticon warriors. After the rock hits the shield it isnt long before the Decepticon warlord is triumphant... and is confident in the fact that it is time to stage one final battle against the Autobots. He shares this news with his warriors, but Sideways protests, saying that maybe they arent ready. Of course, Megatron takes offense to this and continues with his plans anyway.\n\nBack at the Autobot base, Hot Shot and Blurr are training by running an obsticle course of steel beams and Mini-Cons throwing debris. Blurr manages to reach the end of the course first, and Hot Shot protests... Until Smokescreen enters the room and tries the course himself, and he also smokes Hot Shot to the flag at the end.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-27","episode_number":22,"episode_type":"standard","id":52161,"name":"Vow","overview":"This episode ends where the previous ends... with a review of the battle between Megatron and Optimus. The Skyboom shield saves both Optimus and Sparkplug from certain demise by Megatron.\n\nBack at the Autobot base, Rad, Alexis and Carlos are blocked from entry by Blurr and Hot Shot. They tell the children that Optimus has ordered that the children remain away from the base until the Autobots have figured out an attack plan to stop the Decepticons... for their own safety.\n\nOn the moon, Megatron is going through fighting drills with the Decepticon Captured Mini-Cons. He powerlinks with many of them, and switches into Full Blast Mode against a hologram of Optimus Prime. His training goes well, until Sideways blasts him, stating he should watch out for other Autobot fire on the real battlefield.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-28","episode_number":23,"episode_type":"standard","id":52162,"name":"Rebellion","overview":"The episodes starts with Sideways making a log entry on the moon. He discusses how the Decepticons are losing the battle for the Mini-Cons, or even keep their valued Mini-Cons in their possession.\n\nBack at Decepticon base, Sideways sits slumped in the corner as Megatron and his crew returns from a mission. He claims his leg has been damaged... to which a small fight breaks out over the moral of the team. Starscream asks Megatron where the group is headed when the two head into a locked room... and Megatron punishes Starscream for their loss in the previous battle. He attacks the Decepticon warrior, and nearly destroys him, until Demolishor and Sideways blast their way into the room and stop the beating. Starscream manages to survive the punishment, and leaves the base.\n\nDemolishor and Sideways follow Starscream out onto the moon's surface, and when Starscream blasts off to spend some time alone, Sideways asks Demolishor why he is still loyal to someone as deranged as Megatron.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-29","episode_number":24,"episode_type":"standard","id":52163,"name":"Chase","overview":"Red Alert has left the children to patrol nearby the base, while the kids argue about not being able to go out with him. They speak about a new shield used to protect the base, so attacks on the base itself by the Decepticons are unlikely.\n\nOptimus Prime and the other Autobots fight Megatron and the Decepticons on a plain while Alexis searches via Laserbeak. Carlos says that Sideways has disappeared from the battlefield, and Rad starts talking to Alexis about the security of her link with Laserbeak. Her computer seems to have allowed someone to hack into the Autobot System, and has implanted a virus in her system. The nasty virus begins attacking her computer, wiping it clean... and then attacking the rest of the Autobot Mainframe. Alexis has some serious problems with trying to shutdown her computer, and while she and the Mini-Cons work, an image of a robot appears on the Main viewer.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"job":"Key Animation","department":"Visual Effects","credit_id":"6370fa046bdec3009be18ffa","adult":false,"gender":0,"id":3757958,"known_for_department":"Visual Effects","name":"Makoto Ito","original_name":"Makoto Ito","popularity":1.166,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-01-30","episode_number":25,"episode_type":"standard","id":52164,"name":"Tactician","overview":"The episode starts off with the space shuttle exploring space near an asteroid field... where it has a 'unique' experience. A bright light seemingly flies out of nowhere, and scans the shuttle, only to appear as a near replica of the shuttle a moment later. Back at the base, the kids were talking about this, unsure of what to make of it.\n\nOn the moon, in the Decepticon base, we see a figure land and walk through the base... down a hallway toward a storage room. The figure appears cloaked, and it is difficult to tell who, or what it is.... only a ripple in space seems to show it's presence. It opens the door to the room, and talks to the Mini-Cons who are being held (in the dark) within. The Mini-Cons (including the Air Defense team, the Air Military team and also Inferno) all look up to the hidden figure, who chooses Inferno for his personal Mini-Con, and takes the robot with him on his way out of the room.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-01-31","episode_number":26,"episode_type":"standard","id":52165,"name":"Link Up","overview":"A fierce battle has left Optimus Prime in need of repairs, and Red Alert has him docked in the repair bay awaiting repairs. The medic tells the children that his hope is that the Autobot Vice Commander can take off some of the heat until Optimus is back on his feet... and when Hot Shot comments on Jetfire's sense of humor, the children laugh.\n\nAt the Decepticon's Moon Base, Demolishor insults Thrust's previous battle plan, and how they lost. It seems that all the Decepticons have an issue with the prior battle, but do not take it to heart, all that is... except Demolishor. Thrust convinces Megatron that his next plan will not fail as a meteor shower helps him emphasize his point.\n\nBack at the Autobot command center, Smokescreen and the other troops talk about the last battle, and how Thrust's presence made all the difference in that skirmish.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/hAwTBIt8fRpyXoHkx1LVyfTSaiJ.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"630d58663d745400828166ff","adult":false,"gender":0,"id":1454437,"known_for_department":"Writing","name":"Isao Shizuya","original_name":"Isao Shizuya","popularity":0.716,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"630d5c29724de1007b735370","adult":false,"gender":0,"id":1010061,"known_for_department":"Visual Effects","name":"Osamu Kamijo","original_name":"Osamu Kamijo","popularity":1.96,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-03-01","episode_number":27,"episode_type":"standard","id":52166,"name":"Detection","overview":"Within the Autobot base on Earth, Jetfire and Smokescreen are in the midst of several arm wrestling contests. While the bots test their might, the kids and Hot Shot look on. Jetfire comes away with the final victory. As Alexis reflects on the lightened mood since Jetfire has arrived, Jetfire cracks a few cocky jokes amongst the group.\n\nAt the Decepticon moon base, Thrust confronts Megatron and the rest of the Decepticons about the recent lack of teamwork. Megatron grows angry at Thrust, and threatens a slash with the Star Sabre before being stopped by the revelation of Thrust's newest plans... to acquire the Skyboom shield and add even more Decepticon reinforcements. Thrust then speaks of another issue at hand... and walks over and faces Sideways.\n\nIn space, a large battleship, shadowed against the stars passes in front of a planet.\n\nBack to the Autobot base on Earth, Red Alert is giving instructions on tech repairs and upgrades to the rest of the Autobots.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-08","episode_number":28,"episode_type":"standard","id":52167,"name":"Awakening","overview":"The episode begins by returning to the battle on the beach of the previous week. As battle is being engaged, Tidal Wave storms across the battlefield, knocking away all in it's path. Tidal Wave slides across the beach and into the ocean, where upon Thrust's command, he begins to fire on the Autobots, pinning them on the beach in defense.\n\nInside the Autobot base, Red Alert and the kids watch has Tidal Wave unleashes on the Autobots.\n\nSmokescreen attempts to get a crane cannon shot off, but is blasted by Starscream. Jetfire gives chase, transforming and flying into the sky. Hot Shot and Blurr have formed a plan of their own, and powerlink with their Mini-Cons, racing across the beach, avoiding the fire of the Decepticons has Smokescreen gives cover fire. Hot Shot and Blurr dissappear into the waters beneath Tidal Wave, while Red Alert theorizes they are going for an attack on Tidal Wave's blindside, underneath him.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-15","episode_number":29,"episode_type":"standard","id":52168,"name":"Desperate","overview":"Desperate opens to the Autobot's has they are pinned down under heavy fire from the Decepticons and an advancing Tidal Wave. Flashback to last episode - Carlos is stalking over the flashback, mentioning the new Mini-Con, and the Requiem Blaster weapon that Sideways mentioned last episode.\n\nInside the base, the kids and the street team are trying to convince Skyblast to join them in helping the Autobots. Skyblast fires off several shots at the group, prompting Perceptor to combine and approach Skyblast, causing him to hide behind Rad.\n\nBack to the beach battlefield, Tidal Wave is still advancing on the Autobots. Hot Shot attempts to stop or atleast stall him with the Skyboom shield. While Tidal Wave is focusing on the Sky Boom shield and Hot Shot, Jet Convoy flies in, kicking Tidal Wave in the throat and knocking him to the ground. Jet Convoy then flies into the sky and above the clouds.. where he is met by Thrust and the Air Military team.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-22","episode_number":30,"episode_type":"standard","id":52169,"name":"Runaway","overview":"The battle fought recently has brought forth the Requiem Blaster, and the accompanying Mini-Con team, but some of the Mini-Cons in this battle do not want to fight.\n\nOn the moon, Mini-Cons work on Megatron and Tidal Wave while the other Decepticons look on. Thrust visits him in the throne room, and promises he will not fail in their most recent plan.\n\nBack at the Autobot base, Alexis comments on how the Autobots are now fighting over the use of the Requiem Blaster. Jetfire and Hot Shot convince many of the other Autobots that they should use the blaster to defeat the Decepticons. Meanwhile, Rad, Billy and Fred walk with the new Mini-Con team, speaking of running away. Rad comments on how the Mini-Cons don't want to be used in this battle, and the children are helping them escape both the Autobots and Decepticons. Carlos and Alexis wait outside with their bikes, and the group leaves together.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-03-29","episode_number":31,"episode_type":"standard","id":52170,"name":"Past (1)","overview":"Hot Shot begins having a flashback. We see Hot Shot trying to save Wheeljack's life. Amidst the fire we see Wheeljack telling Hot Shot to not leave him. But Hot Shot says he'll be back with help. When Hot Shot tries to get back through to help Wheeljack he was punched out by another Autobot.\n\nSideswipe arrives and reports in to commander Blurr. Blurr, seeing Sideswipe and hearing â€˜Commander Blurr' can't remember him. Hot Shot is angry with all this flashback business. Sideswipe is still trying to get Blurr to remember him. He tells the kids and other Bots present that Blurr was aiming a rifle the ropes he was tied up in. But Sideswipe is obsessed with getting Blurr to remember. Blurr keeps trying to get away from Sideswipe which to no avail fails. We see a flashback to Cybertron where Blurr is aiming and preparing to fire at the ropes. But Sideswipe bugs Blurr to the point where he is almost left there","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-05","episode_number":32,"episode_type":"standard","id":52171,"name":"Past (2)","overview":"The show starts off with a flashback showing us that Megatron comes to Wheeljack's rescue. Wheeljack shoots Hot Shot as an act of revenge. He cloaks and leaves. Hot Shot asks, \"\"Why Wheeljack, Why\"\".\n\nAt the Autobot Base, Hot Shot is in the repair room. Sideswipe enters the room, and explains that he carried Hot Shot back to the base after the Decepticon left. Changing rooms, we see Blurr talking with Optimus. He says whoever did that to Hot Shot was not skilled in firing at close range. Optimus is shocked by what Blurr said. Back to the repair room, where Hot Shot disbeleives that Wheeljack is a Decepticon.\n\nHot Shot has the vision of Wheeljack and his past. He was going to get help during the inferno, but he didn't go in to rescue Wheeljack. Back to a different room, Optimus says that he took Hot Shot into his group because of what happened with Wheeljack. Prime said that Hot Shot has to face his past head-on.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-12","episode_number":33,"episode_type":"standard","id":52172,"name":"Sacrifice","overview":"The Autobots and The Decepticons battle in a forest, which is part of Thrust's plan.  His plan is to get the Requiem Blaster from Optimus, but they have to draw the Autobots out of their hiding spot in order to get it.  But Thrust and the other Decepticons didn't know that the three MiniCons that make the Requiem Blaster is in the Autobot Base, where Smokescreen is guarding them.  As the children look at the screen, the camera seems to be going crazy, caused by...Sideways.\n\nHolding the Star Saber, Starscream tries to get Optimus out, but Optimus and Jetfire powerlinks into Jet Convoy mode.  Starscream yells for Cyclonus and Shockwave (or Tidal Wave) as backup, but he later knows that the Decepticons abandoned him.\n\nThe Children later know that the Decepticons are invading the Autobot base again, this time...To get the Requiem Blaster.  They knocked down the door that leads to the room where Smokescreen and the three Mini-Cons are in.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-19","episode_number":34,"episode_type":"standard","id":52173,"name":"Regeneration","overview":"The episode starts when the Autobots, the children, and the Mini-Cons are watching Red Alert repairing Smokescreen's body.  They worry if he will live again...\n\nLater, Starscream entered the Decepticon Base, and made Thrust guilty because he closed the warp gate.  Megatron stopped Starscream into attacking Thrust.  At the energy vat (energy recovering machine) Demolisher tells Starscream to give him the Star Saber.  But Starscream refused.  When he began drawing the sword from his shoulder, Demolisher changed his mind with fear.\n\nAfter hearing Megatron and Thrust chit-chatting about didn't believing Starscream would survive, and insulting him, Starscream charged after Megatron.  He swung his Star Saber at him, but missed.  The other Decepticons heard the noise of the top-half of Megatron's throne fall on the ground.  Looking at Starscream as a traitor, they attacked him, but with Starscreams Null Laser Cannon and the Star Saber, he defeated all except for Thrust and Megatron.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-04-26","episode_number":35,"episode_type":"standard","id":52174,"name":"Rescue","overview":"In the Decepticon Base's Warp Room, Demolisher curses Starscream while he cleans a mess, only for Starscream to startle him. Before the two can truely settle their differences, however, Starscream mentions to Demolishor that he hopes that he doesnt mind a little company... and opens the Warp Gate for the Autobots to arrive! Optimus Prime, Perceptor, Jetfire, Hot Shot Sideswipe, Scavenger and Smokescreen / Hoist now stand behind Starscream, and Demolishor makes a run for it to warn Megatron of an enemy invasion. The problem with that? Hot Shot blocking his path, and then Starscream using the Star Sabre to attack him. With what appears to be his last bit of energy, Demolishor hits a red button, which activates a warning siren.\n\nMegatron Cyclonus, Thrust and Tidal Wave and Wheeljack stand in the Decepticon Throne Room, and hear the klaxon. The Decepticon forces head out to face the Autobots, and Optimus orders Starscream to go with Perceptor and free the Mini-Cons in the base.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-03","episode_number":36,"episode_type":"standard","id":52175,"name":"Mars","overview":"Starscream takes out his aggression in a rock field, slicing through rock after rock in an effort to relieve his anger while the children look on from a nearby bluff.  Starscream knows that he is wasting his time amongst the Autobots, and has to get to Megatron soon.\n\nLater, Starscream sits on a rock, flanked by his Mini-Con partners, Swindle and the Air Defense Team.  Alexis visits and tries to comfort him, but is shunned as he walks off.  She worries that he will do something drasticâ€¦\n\nOn the moon, Megatron also takes out his anger on some nearby rocksâ€¦ blasting several formations with the Requiem Blaster.  Demolishor, Cyclonus and Wheeljack gossip about the situation, until Thrust shows up on the scene and demands that they continue building the spaceship that the Mini-Cons were working in the previous ep.\n\nWhen the three leave to go work on the ship, however, Thrust hears a familiar voice coming from the nearby trash piles.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-05-10","episode_number":37,"episode_type":"standard","id":52176,"name":"Crack","overview":"In an unknown location, Thrust listens to Sideways about the combined power of the Star Saber, Skyboom shield, and Requiem Blaster.\n\nOn Earth, most of the Autobots are on Starscream's case about his work ethic and not being a regular team player. He re-iterates he joined them to defeat Megatron. Optimus Prime tells Hotshot to first understand their differences with Starscream then procede from there.\n\nThe kids throw Starscream a surprise party as thanks for his souvenir Mars rock. They give him a hand-made polishing shammy, and he's humbled by their appreciation as he's never recieved a gift before.\n\nLater outside, Thrust approaches Starscream and tells him to return to the lunar base with the Skyboom shield so they can conspire against Megatron (which is just a ruse). Starscream doesn't bite but the Autobots treat him like a (re-)traitor. Their accusations cause him to conclude the alliance as a failed experiment.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/8qhiv2VBkxxMCVcLTthHUga6qp8.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"630d58663d745400828166ff","adult":false,"gender":0,"id":1454437,"known_for_department":"Writing","name":"Isao Shizuya","original_name":"Isao Shizuya","popularity":0.716,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"630d5874f5483600847d2410","adult":false,"gender":2,"id":1433645,"known_for_department":"Directing","name":"Shigeki Awai","original_name":"Shigeki Awai","popularity":2.786,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-10-03","episode_number":38,"episode_type":"standard","id":52177,"name":"Threaten","overview":"Starscream brings Megatron the Skyboom Shield and Star Saber, completing the 3 Mini-Con powers (with the Requiem Blaster). Thrust proposes the Hydra Cannon (as Sideways put it).\n\nFred convinces the other kids to skip school to see an approaching comet that has the human population abuzz. Prime hasn't lost hope in Starscream since he is a Transformer and can still do the right thing.\n\nThe Decepticons leave the moon in their completed spaceship and test the Hydra cannon on the comet, blowing it up.    Megatron then tells Starscream to target the Earth!","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-10","episode_number":39,"episode_type":"standard","id":52178,"name":"Crisis","overview":"The Decepticons continue to move the Hydra cannon into range of the Autobot base on Earth, and Optimus Prime and Jetfire mobilise to stop them. Before departing, Prime attempts to give Hot Shot the Matrix of Leadership, but Hot Shot does not feel he is worthy.\n\nAs the Hydra cannon powers up, Optimus and Jetfire attack the Decepticon ship in their combined form, and disengage as the individual Decepticons strike back. The battle lasts long enough for the cannon to be recharged, and Thrust hits the firing control - but Optimus leaps in front of the blast, and uses the power of the Matrix to nullify it. In the process, however, he sacrifices his own life, and as the Decepticons retreat into space, his body disintegrates into space dust, leaving only the Sparkplug and the Matrix.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/2oIAYe2tfMbX8y4qqHSpMWh65Yg.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"620bbbf61bf876001bd964b4","adult":false,"gender":2,"id":1028312,"known_for_department":"Directing","name":"Hidehito Ueda","original_name":"Hidehito Ueda","popularity":2.588,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"620bbc2ec15b55001b843ec6","adult":false,"gender":2,"id":1088112,"known_for_department":"Writing","name":"Ryo Motohira","original_name":"Ryo Motohira","popularity":2.188,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-10-17","episode_number":40,"episode_type":"standard","id":52179,"name":"Remorse","overview":"In their Spaceship, the Decepticons congratulate themselves on defeating Optimus Prime, They then decide to go straight to Cybertron where Megatron says he will become the ruler of the planet.   In the Autobot Base, all the Autobots except Jetfire are carrying on building their spaceship, but Hot Shot decides that it's a waste of time, so he goes off wandering around the base, he stops at the Warp Room, where he waits for Jetfire to return, when he does Hot Shot tells him to take him into space, but Jetfire refuses. The Other Autobots appear behind him and Hot Shot explains to them what he wants to do, Scavenger comes forward and pull him forward and Warps to the abandoned highway where Scavenger first fought Hot Shot, Jolt follows them, Scavenger starts fighting Hot Shot, while the children and Autobots watch from the base, Hot Shot Transforms and Jolt combines with him and they fly to the other side of the hole in the highway. Meanwhile the kid notice the Autbots have all gone.   Bac","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-24","episode_number":41,"episode_type":"standard","id":52180,"name":"Depart","overview":"The Autobots are preparing to return to Cybertron and will have to leave the kids behind. Feeling loyal to both his home and the Transformers, Rad tells his parents about the Autobots.\n\nHis mother reacts coldly, but his father later confides about his own dreams of space exploration when he was Rad's age. Although he doesn't believe his story, he tells his son to follow his dream and to promise to return home someday.\n\nAll the Mini-Cons volunteer for the return mission to Cybertron and the kids have decided to join, but Commander Hot Shot doesn't allow the humans to come, for their own safety. Perceptor leads the other Mini-Cons to stage a protest until the Autobots give in.\n\nAll the kids board the ship and Alexis tells Rad she's sending her parents an email, but she really alerts his father at the Cosmo Scope research center! The Axalon surfaces from the river and blasts off. It's detected at the research center where Rad's father considers the authenticity of Rad's story.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-31","episode_number":42,"episode_type":"standard","id":52181,"name":"Miracle","overview":"Aboard the Axalon, the Autobots bid farewell to Earth, their 2nd home, and the memory of Optimus Prime. Smokescreen has a new name \"\"Hoist\"\" to fit his new reformatting.\n\nThe Mini-Cons broadcast a signal to some \"\"friends\"\". Hundreds of glowing, space-travelling Mini-Cons show up to battle the enemy. With the Street Action Team's help, the kids remember their journey through cyberspace and identify the enemy as Unicron!\n\nBlurr pilots the ship through an asteroid field and the Decepticon ship attacks. The Autobots and Decepticons head outside to fight, while the Mini-Cons hurry to battlestations.    Out in space, Megatron is taking out the Autobots (and some Decepticons) with the requiem blaster.\n\nSparkplug heads out with the Matrix, and Perceptor summons the glowing space Mini-Cons with the Mini-Con music. The light beams converge in the Matrix and power Sparkplug to knock down Megatron.    The glowing energy then takes on form, resurrecting Optimus Prime, who blasts Megatron away.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-07","episode_number":43,"episode_type":"standard","id":52182,"name":"Puppet","overview":"The Decepticons notice that Megatron is acting a little crazy. The Autobots and humans salute Optimus Prime's return outside the Axalon, surrounded by the mysterious space Mini-Cons' light beams.\n\nA black hole suddenly appears and pulls Red Alert and Hotshot to a distant planet, where the Decepticons follow.    Nemesis Prime, a black clone of Optimus Prime, attacks them all and seems indestructible with his static reforming power, leaving everyone injured.\n\nThe Mini-Con lights lead the Axalon to the planet where 5 of the mysterious Mini-Cons reformat the injured with a powerful light beam.\n\nOptimus Prime appears, powerlinks with Overload, and teams with Megatron (now called Galvatron) to blast away Nemesis Prime as a static form of Sideways.\n\nThe planet begins to self destruct and Galvatron disables the Axalon, before leaving to conquer Cybertron.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/wTAKh4QOeYFOwDXIN5KbAsZVuQq.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"620bbc2ec15b55001b843ec6","adult":false,"gender":2,"id":1088112,"known_for_department":"Writing","name":"Ryo Motohira","original_name":"Ryo Motohira","popularity":2.188,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"630d56c23d7454007a28b86a","adult":false,"gender":0,"id":3681779,"known_for_department":"Directing","name":"Masayuki Motsumoto","original_name":"Masayuki Motsumoto","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-11-14","episode_number":44,"episode_type":"standard","id":52183,"name":"Uprising","overview":"The Decepticons have returned and conquered Cybertron. The Autobots repair the Axalon and return to Cybertron where the Mini-Cons freak as they spot the black hole nearby and head out into space, followed by Carlos.\n\nThe Street Action team warns Optimus Prime of Unicron's impending doom. Sideways briefly appears in space, angry at the Mini-Cons for spoiling his surprise.\n\nThe Autobots land on Cybertron and are ambushed by the Decepticons. Prime powerlinks with Overload, and the surviving resistence ralleys up against the Decepticons.  Prime goes 1 on 1 with Galvatron and tells him to join forces to fight Unicron, but Galvatron thinks it's just a false ploy.\n\nThe blackhole's gravity begins to tear up Cybertron's surface and pulls in the Decepticon ships. The Mini-Cons form a shield that both overpowers the force field/black hole and sends rays to protect the Transformers below on Cybertron.\n\nLater on the Axalon, Grindor warns that Unicron will destroy space.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-11-21","episode_number":45,"episode_type":"standard","id":52140,"name":"Dash","overview":"Hot Shot attempts to convince Galvatron to join forces with the Autobots, until they discover the true intentions of one of Galvatron's most trusted soldiers...","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/tZfIezE526APXyO75yrivORiwEG.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"630d58663d745400828166ff","adult":false,"gender":0,"id":1454437,"known_for_department":"Writing","name":"Isao Shizuya","original_name":"Isao Shizuya","popularity":0.716,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"630d5dd60398ab0082a0d0f4","adult":false,"gender":2,"id":1524348,"known_for_department":"Directing","name":"Tomio Yamauchi","original_name":"Tomio Yamauchi","popularity":1.094,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-11-28","episode_number":46,"episode_type":"standard","id":52184,"name":"Drift","overview":"Thrust has stolen the Requiem Blaster and Skyboom shield, and escaped into underground tunnels, with Starscream, Hot Shot and Wheeljack on his trail. Galvatron has the Decepticon forces after Thrust too, but Demolishor reports that they've lost him.\n\nAs Hot Shot and Wheeljack venture down a passage Hot Shot discovers, the Autobots are working their way across the planet, getting the other Autobot forces to withdraw. Hoist and Scavenger have to deal with a particularly obstinate group leader, who thinks retreating renders all the sacrifices made meaningless.\n\nCarlos finds Rad taking a shower on the Autobot ship. The two boys look down on the planet, and Rad wonders if their meeting the Mini-Cons was just coincidence. Rad says that somehow, somewhere, he thinks he met High Wire before...\n\nA Decepticon reports the Autobots' pulling back to Galvatron, but is ordered to put every last bit of power into finding Thrust.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-12-05","episode_number":47,"episode_type":"standard","id":52185,"name":"Portent","overview":"Optimus Prime allows the kids (Rad, Carlos and Alexis) and their Mini-Cons to go with Hot Shot and Wheeljack underground Cybertron in pursuit of Thrust.\n\nThe Autobots wish to focus on Unicron so they pull their troops from Decepticon battlefronts. Galvatron considers an alliance.\n\nStarscream follows Thrust through an underground warp gate to Sideswipe's lair in some large technorganic chamber somewhere. Starscream refuses to join with them, so Sideways summons a swarm of bot-spiders.\n\nHot Shot and Wheeljack's team shows up and the kids and Perceptor try to awaken the Skyboom Shield and Requiem Blaster's Mini-Cons to liberate them from Thrust, but to no avail. Hot Shot and Wheeljack \"\"link up\"\" and spin away the technorganic defenses.\n\nSideways and Thrust flee to a glowing core and Starscream joins Hot Shot's coalition in their pursuit, but the organic defenses are too much and they must escape. Alexis runs back for her necklace and Starscream goes back to get her and Sureshock.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-12-08","episode_number":48,"episode_type":"standard","id":52186,"name":"Cramp","overview":"Starscream prepares to do whatever it takes to convince Galvatron the threat of Unicron is real.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/u73bKf8fQXA0IuA0yUrNWwZbfO2.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"620bbbf61bf876001bd964b4","adult":false,"gender":2,"id":1028312,"known_for_department":"Directing","name":"Hidehito Ueda","original_name":"Hidehito Ueda","popularity":2.588,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"620bbc2ec15b55001b843ec6","adult":false,"gender":2,"id":1088112,"known_for_department":"Writing","name":"Ryo Motohira","original_name":"Ryo Motohira","popularity":2.188,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-12-09","episode_number":49,"episode_type":"standard","id":52187,"name":"Alliance","overview":"Galvatron decides to join forces with the Autobots. He shows no tolerance for dissent among Decepticons on the subject, and praises the fallen Starscream.\n\nInside Unicron's core chamber, Thrust and Sideways fuse the 3rd Mini-Con weapon, the Star Saber, into the ground, awakening Unicron and blowing off the rest of the moon's surface to reveal his full planet mode.\n\nIts gravity pull on Cybertron increases, drawing shards of debris up into Unicron's maw. The Autobots and Decepticons evacuate Cybertron in their space ships, protected by the glowing space Mini-Cons. The Autobots, humans, and Mini-Cons from the Axalon board Galvatron's ship. After a brief face-to-face pause, Optimus Prime and Galvatron share an historic handshake \"\"to Unity\"\", joined by Perceptor representing the Mini-Cons.\n\nUnlikely Autobot-Decepticon pairs share further handshakes including Hotshot & Demolishor, Cyclonus & Sideswipe, and Tidal Wave & Jetfire.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/k9Ua2nWPGquPzoQ4gicPHlDkqpL.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"630d56c23d7454007a28b86a","adult":false,"gender":0,"id":3681779,"known_for_department":"Directing","name":"Masayuki Motsumoto","original_name":"Masayuki Motsumoto","popularity":0.6,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"630d58663d745400828166ff","adult":false,"gender":0,"id":1454437,"known_for_department":"Writing","name":"Isao Shizuya","original_name":"Isao Shizuya","popularity":0.716,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-12-10","episode_number":50,"episode_type":"standard","id":52188,"name":"Union (1)","overview":"The combined Autobot-Decepticon fleet is in full attack on robot mode Unicron, but cannot penetrate his hull. Thrust hopes to replace Sideways as Unicron's top advisor, but Sideways isn't worried.\n\nOn the Transformers' command ship, Demolishor heads the tactical meeting but has not yet discovered a weakness in Unicron's armor.  Unicron turns his attention from the fleet and blasts Cybertron, much to everyone's shock. Hotshot & Wheeljack lead an assault team of jet fighters against Unicron. Wheeljack targets Thrust on the surface, and Unicron defends him, drawing his attention from Cybertron.\n\nDemolishor discovers a weak spot in Unicron: his neck! Galvatron orders the assult team to this new target and the rest of the fleet fires on Unicron's head for distraction. Unicron ignores the fleet and Thrust begins to second guess his betrayal of the Transformers, but then concludes it was the best way to power.","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/uJHRhG1mJjt3UDCibo152QkyxZi.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Writer","department":"Writing","credit_id":"630d5a7e0398ab007a2a6be9","adult":false,"gender":0,"id":1945635,"known_for_department":"Writing","name":"Shōji Tonoike","original_name":"Shōji Tonoike","popularity":0.6,"profile_path":null},{"job":"Director","department":"Directing","credit_id":"630d5b58caa508007fddb468","adult":false,"gender":0,"id":2002151,"known_for_department":"Creator","name":"Ken'ichi Ishikura","original_name":"Ken'ichi Ishikura","popularity":0.6,"profile_path":null}],"guest_stars":[]},{"air_date":"2003-12-11","episode_number":51,"episode_type":"standard","id":52189,"name":"Origin (2)","overview":"Inside Unicron's core chamber, Optimus Prime and Galvatron notice the 3 Mini-Con weapons are linked to Unicron, wrapped under organic tendrils. Sideways exits Unicron's heart and he adopts the planet's voice as he tells his origin. Sideways is a shell of Unicron and he's been on Cybertron for eons, observing (and encouraging) the Transformers' war. Able to absorb their negative energy from fighting and hatred, Sideways powered Unicron enough to grow into the planet, now strong enough for total domination!\n\nOutside, the Armada is suffering losses, but then Sideswipe successfully blows up a hole in Unicron's neck. The jet fighters enter, dodging internal planetary defenses.\n\nMeanwhile, Galvatron and Prime are captured by the organic tendrils, which bond to Galvatron, putting him in suspended animation. With the matrix inside him, Prime is able to","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-12-12","episode_number":52,"episode_type":"finale","id":52190,"name":"Mortal Combat (3)","overview":"Powerlinx Optimus and Galvatron begin their final battle inside Unicron. The battle is soon interupted, as Unicron revives from their hatred for each other! Because the Autobots and the Decepticons hate each other from the war, his power continues to grow, and he comes back to life to fill the world with his evil and torment. The others are awaiting Optimus's safe return from his mission, but Hot Shot must make a command: attack the revived Unicron, or wait for their leader to come back. He decides to mobilize the troops for one last attack on Unicron. Optimus and Galvatron continue fighting to the death, but honor each other as equal Transformer Warriors. But Unicron is starting to break apart! In his last resort attack, Unicron opens up a large black hole within his body. Galvatron wants to let go, but Optimus wants to save him. Galvatron sacrifices his life and he says just as his life ends, the Autobots have won the war, and Unicron can not return from the loss of evil in the unive","production_code":"","runtime":21,"season_number":1,"show_id":982,"still_path":"/72OlAY1kVugcsMJ2H5payyc3MZK.jpg","vote_average":0,"vote_count":0,"crew":[{"job":"Director","department":"Directing","credit_id":"620bbbf61bf876001bd964b4","adult":false,"gender":2,"id":1028312,"known_for_department":"Directing","name":"Hidehito Ueda","original_name":"Hidehito Ueda","popularity":2.588,"profile_path":null},{"job":"Writer","department":"Writing","credit_id":"620bbc2ec15b55001b843ec6","adult":false,"gender":2,"id":1088112,"known_for_department":"Writing","name":"Ryo Motohira","original_name":"Ryo Motohira","popularity":2.188,"profile_path":null},{"job":"Assistant Director","department":"Directing","credit_id":"630cce9b63536a007d475bd1","adult":false,"gender":0,"id":2234455,"known_for_department":"Directing","name":"Mitsuru Kawasaki","original_name":"Mitsuru Kawasaki","popularity":0.98,"profile_path":null},{"job":"Animation Director","department":"Visual Effects","credit_id":"630ccea963536a0077b7a27f","adult":false,"gender":0,"id":3653406,"known_for_department":"Visual Effects","name":"Munetaka Abe","original_name":"Munetaka Abe","popularity":0.648,"profile_path":null}],"guest_stars":[]}],"name":"Season 1","overview":"","id":2802,"poster_path":"/iWWgMoQ1EJdaJDC8plXHqaNV4eQ.jpg","season_number":1,"vote_average":5}}}