{"adult":false,"backdrop_path":null,"created_by":[],"episode_run_time":[60],"first_air_date":"2003-09-02","genres":[{"id":35,"name":"Comedy"}],"homepage":"","id":993,"in_production":false,"languages":["en"],"last_air_date":"2013-03-05","last_episode_to_air":{"id":52710,"name":"The Reveal","overview":"Chase goes on a spiritual journey to track down his own fugitive.","vote_average":0,"vote_count":0,"air_date":"2013-03-05","episode_number":10,"episode_type":"finale","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null},"name":"The Joe Schmo Show","next_episode_to_air":null,"networks":[{"id":55,"logo_path":"/82MKSH7iM5LAGXFb0PDOclTWn5u.png","name":"Spike","origin_country":"US"}],"number_of_episodes":27,"number_of_seasons":3,"origin_country":["US"],"original_language":"en","original_name":"The Joe Schmo Show","overview":"The Joe Schmo Show is a reality television hoax show created by Paul Wernick and Rhett Reese. The series is broadcast in the U.S. on the cable network Spike. The show's premise is that a target person or persons are led to believe that they are contestants on a reality television show; in reality, all of the other participants in the purported show – including the host – are actors, and their actions and the outcome of the purported show are all scripted in an attempt to elicit comedic reactions from the targets. The show's first season, The Joe Schmo Show, aired in 2003, and its second season, Joe Schmo 2, aired in 2004. The first season's hoax was conducted as a typical reality competition show while the second hoax was a Bachelor-like dating series.\n\nOn December 10, 2012, Spike announced it was bringing The Joe Schmo Show back for a third season, which premiered on January 8, 2013.\n\nThe only constant presence in all three Joe Schmo seasons has been voice actor Ralph Garman, who has served as the \"emcee\" for all three editions.","popularity":37.216,"poster_path":"/9HlyXDr9twLGEBDCceTKCiTmx6S.jpg","production_companies":[{"id":59145,"logo_path":null,"name":"Stone Stanley Entertainment","origin_country":"US"}],"production_countries":[],"seasons":[{"air_date":"2003-10-28","episode_count":1,"id":2832,"name":"Specials","overview":"","poster_path":null,"season_number":0,"vote_average":0},{"air_date":"2003-09-02","episode_count":8,"id":2830,"name":"Season 1","overview":"","poster_path":null,"season_number":1,"vote_average":0},{"air_date":"2004-06-15","episode_count":9,"id":2831,"name":"Season 2","overview":"","poster_path":null,"season_number":2,"vote_average":0},{"air_date":"2013-01-08","episode_count":10,"id":2833,"name":"Season 3","overview":"","poster_path":null,"season_number":3,"vote_average":0}],"spoken_languages":[{"english_name":"English","iso_639_1":"en","name":"English"}],"status":"Ended","tagline":"","type":"Scripted","vote_average":8.1,"vote_count":9,"season_data":{"1":{"_id":"5254112819c295794033f515","air_date":"2003-09-02","episodes":[{"air_date":"2003-09-02","episode_number":1,"episode_type":"standard","id":52712,"name":"Episode 1","overview":"Viewers meet Matt Kennedy Gould, the unknowing mark on a phony reality program called Lap of Luxury. He meets the various other players of the show, who, unbeknownst to him, are all secretly actors and actresses working from a script. Things get started right away with the first \"Pampering Competition,\" a game in which everyone dresses up in each other's undergarments. The game is rigged so that Matt will lose and he is forced wear Kip's for the rest of the day.","production_code":"","runtime":60,"season_number":1,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-09-02","episode_number":2,"episode_type":"standard","id":52713,"name":"Episode 2","overview":"The Hutch perfectly plays his role as the asshole, irritating everyone, but winning \"immunity\" in a game called \"Hands on a High-Priced Hooker.\" Matt forms an alliance with Gina, the schemer, but doesn't know what to do when he's caught in a setup in which the other players find her secret notebook where she's been writing mean things about them. In the first ridiculous \"Riches to Rags\" eviction ceremony, Gina is booted from the game and Matt ends up all too happy with it, after he deduces that she cast her vote for him.","production_code":"","runtime":60,"season_number":1,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5254112919c295794033f5c9","order":500,"adult":false,"gender":1,"id":41091,"known_for_department":"Acting","name":"Kristen Wiig","original_name":"Kristen Wiig","popularity":31.716,"profile_path":"/p4QYkJ7EboyhzQcexH86SgCOki7.jpg"}]},{"air_date":"2003-09-09","episode_number":3,"episode_type":"standard","id":52714,"name":"Episode 3","overview":"Kip takes the opportunity to share some of the photos he's collected in his creature comfort item - his photo album. Molly is relieved when she learns that her suspicions that Matt has caught on to the fakeness of the show are misplaced. A \"Pampering Competition\" features the supposed dirty laundry of the various cast members and makes them dress up in funny outfits. The guys lose this competition, allowing Hutch to pull a prank in which he replaces the photos in Kip's album with ones of his own ass. At dinner, Ralph gives all the players autographed headshots of themselves. Later, everyone says nice things to each other in the hot-tub.","production_code":"","runtime":60,"season_number":1,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5254112919c295794033f5c9","order":500,"adult":false,"gender":1,"id":41091,"known_for_department":"Acting","name":"Kristen Wiig","original_name":"Kristen Wiig","popularity":31.716,"profile_path":"/p4QYkJ7EboyhzQcexH86SgCOki7.jpg"}]},{"air_date":"2003-09-16","episode_number":4,"episode_type":"standard","id":52715,"name":"Episode 4","overview":"Ashleigh reveals to Matt that she has a secret crush on Ralph, the host and also that she thinks that Molly may not be as innocent as she seems. Matt is not impressed and begins scheming to try and vote her off the show. The Immunity Challenge showcases the various castmembers displaying special talents, such as Kip doing bad magic and Matt beatboxing. Hutch \"wins\" this competition, judged by Ralph and Survivor 2's Jerri Manthey, by performing a moving rendition of \"America the Beautiful.\" Emotions run high at the \"Riches to Rags\" eviction ceremony. Matt's plan does not go as he had hoped and it is Earl who is evicted from the show. Matt takes his ejection hard, along with the rest of the cast and everyone involved with the project is left wondering if it's right to continue it.","production_code":"","runtime":60,"season_number":1,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5254112919c295794033f5c9","order":500,"adult":false,"gender":1,"id":41091,"known_for_department":"Acting","name":"Kristen Wiig","original_name":"Kristen Wiig","popularity":31.716,"profile_path":"/p4QYkJ7EboyhzQcexH86SgCOki7.jpg"}]},{"air_date":"2003-09-23","episode_number":5,"episode_type":"standard","id":52716,"name":"Episode 5","overview":"The game continues, despite the tension caused by the previous week's evention of Earl. Matt is shocked to learn of an apparent one-night stand between Dr. Pat and Hutch. The immunity competition causes real trauma for Dr. Pat - she's knocked down and hurt by Matt in a sumo uniform and has to be taken to the hospital. Matt later gives her his prize for winning the sumo competition before the start of the immunity game, Master Debater, which Matt wins. The \"Riches to Rags\" ceremony features a special offer - a $25,000 reward if she will leave the game voluntarily.","production_code":"","runtime":60,"season_number":1,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-09-30","episode_number":6,"episode_type":"standard","id":52717,"name":"Episode 6","overview":"The drama between Molly and Ashleigh continues when Ralph pulls aside Molly for a private conference. The Pampering Competition forces Ralph to dress up in a bee custome, something with which he is not at all happy about. Matt and Molly are paired up in the competition and lose and they face the penalty, being handcuffed to each other for the rest of the day. Molly's fake boyfriend comes by to play the guitar for and sing a song, but goes ballistic when he sees her chained to Matt and wearing a bikini. Ralph makes an \"executive decision\" to remove the handcuffs and then the two of them go off for a little private time, while Matt laments that the show is \"starting to f'in drive him crazy.\" Ashleigh wins an immunity challenge that's Matt's worst nightmare - models covered with chocolate, which he finds gross. Her immunity turns out not to matter because at \"Riches to Rags,\" the Hutch is tossed out of the game for making threats towards Kip, but not before grabbing his collector's plate out of Ralph's hands and thrusting it into the fireplace.","production_code":"","runtime":60,"season_number":1,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2003-10-07","episode_number":7,"episode_type":"standard","id":52718,"name":"Episode 7","overview":"The Hutch returns to the show, along with a legal-sounding document aimed at Matt, who had spent some time at law-school. With his return, Ralph announces that it's \"Double Trouble Day\" - two people will win immunity, but two will be sent packing. Matt balks at a gross food challenge that would supposedly require him to eat dog feces - leading to a meeting with a Spike TV executive. The over-the-top executive convinces Matt to get Molly and Ashleigh to kiss, so that they can all win the prize for the competition - a 42 inch television. Later, both Matt and Hutch win immunity in a rigged Lord of the Manor Immunity Showdown which didn't go quite as planned. At the \"Riches to Rags\" ceremony, Molly and Kip are ejected and Ashleigh gets another opportunity to whine about Molly's supposed flirting, when Ralph lets her keep her ceremonial collector's plate and then the two of them kiss.","production_code":"","runtime":60,"season_number":1,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[{"character":"","credit_id":"5254112919c295794033f5c9","order":500,"adult":false,"gender":1,"id":41091,"known_for_department":"Acting","name":"Kristen Wiig","original_name":"Kristen Wiig","popularity":31.716,"profile_path":"/p4QYkJ7EboyhzQcexH86SgCOki7.jpg"}]},{"air_date":"2003-10-14","episode_number":8,"episode_type":"finale","id":52719,"name":"Episode 8","overview":"At the top of the episode, host Ralph reveals a surprise Sudden Death eviction. Matt goes through the motions of plotting to vote out his friend Brian, but in the Sudden Death ceremony, with Ralph wearing the immunity robe, Matt, Brian and Hutch all vote out Ashleigh. After an appropriately snotty speech, she leaves and then the entire cast returns, as the final ceremony will be coming shortly, to determine the winner of $100,000. A final dinner causes a minor panic in Brian and Hutch when Matt reveals that he thought that maybe the fake network executive from the previous episode could be an actor. At the final ceremony, Brian, Hutch and Matt answer questions posed to them by the evicted cast and then a vote is held to determine the \"winner of $100,000.\" Five out of six votes are revaled, but the sixth is left a mystery, to be shown in the season finale.","production_code":"","runtime":60,"season_number":1,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"","id":2830,"poster_path":null,"season_number":1,"vote_average":0},"2":{"_id":"5254112819c295794033f525","air_date":"2004-06-15","episodes":[{"air_date":"2004-06-15","episode_number":1,"episode_type":"standard","id":52720,"name":"On With the Schmo","overview":"The second season premiere introduces the new Joe Schmo and Jane Schmo - Tim and Ingrid. They quickly meet their new castmates, but several of them are quickly tossed in a parody of how \"ethnic\" people are usually the first tossed from such shows. A gift-giving ceremony allows all of the suitors to give a gift to Austin and Piper, the \"bachelor\" and \"bachelorette\" of the show. Austin and Piper then, in turn, give their own gifts. A game called \"Lap Dance for Love\" gives Ingrid and Tim the first hint that they're not on any boring reality show. The first-ever Falcon Twist reveals that a girl will be eliminated and that the suitors are supposedly also all playing for a potential $100,000 - something they can never tell to either Piper or Austin. Rita, the drunk, is evicted in the first Pearl Necklace ceremony, as Austin tells her that he's looking for someone a little more serious. However, all eyes are on Ingrid when she starts asking two of the actors if they had rehearsed their speeches to Austin, saying that it's like she's on \"The Truman Show.\"","production_code":"","runtime":60,"season_number":2,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5254112a19c295794033f693","adult":false,"gender":2,"id":126423,"known_for_department":"Writing","name":"Andrew Green","original_name":"Andrew Green","popularity":1.176,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5254112a19c295794033f675","order":501,"adult":false,"gender":1,"id":1221601,"known_for_department":"Acting","name":"Jessica Makinson","original_name":"Jessica Makinson","popularity":2.996,"profile_path":null}]},{"air_date":"2004-06-22","episode_number":2,"episode_type":"standard","id":52721,"name":"A Bottle of Red, a Bottle of White","overview":"After the events of the previous week, the show's staff has to decide whether to keep Ingrid on the show. They move forward and have Ambrosia, the \"bitch,\" voice her opinion on Ingrid's \"paranoia.\" Ingrid promises to tone it down, but says that a part of her will still be suspicious. Bryce tries his \"hypnotism\" on Tim and T.J., then acts hurt when they make fun of him. The Falcon Twist reveals that there will be competitions throughout the program for exotic vacations. The first is \"awarded\" to Ambrosia in a game called Strike a Pose. Later, the suitors are all taken to a supposed vineyard, giving Ernie a chance to show off his knowledge. The suitors are paired together to crush grapes - Austin shows favoritism to Cammy, while Piper spends time with Tim. Bryce expresses his irritation at Ingrid's being with Tim, while Eleanor has a major breakdown over what she feels is Austin's unfairness. Ernie is eliminated in the first Flame of Love eviction ceremony; and Ingrid appears to whisper something into Tim's ear.","production_code":"","runtime":60,"season_number":2,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5254112a19c295794033f693","adult":false,"gender":2,"id":126423,"known_for_department":"Writing","name":"Andrew Green","original_name":"Andrew Green","popularity":1.176,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5254112a19c295794033f675","order":501,"adult":false,"gender":1,"id":1221601,"known_for_department":"Acting","name":"Jessica Makinson","original_name":"Jessica Makinson","popularity":2.996,"profile_path":null}]},{"air_date":"2004-06-28","episode_number":3,"episode_type":"standard","id":52722,"name":"The Crisis","overview":"During the staff meeting, the cast and crew discuss Ingrid's growing doubts. Eleanor loses her locket from Austin, and Tim concocts a plan to \"find\" it. As Ambrosia turns up the bitch dial, Bryce gets creepier when his frog, Everett, is returned to him. The group plays a game loaded with sexual-innunendo called Taste My Treats. After a mistake by Derek, Tim wins by feeding Piper a taco. The two go on a restaurant date, in which Piper gets to know the \"real Tim\" and the two share an off-camera kiss. Gerald (the producers actually) organizes a surprise birthday party for Tim, who is celebrating his 29th birthday. When Cammy tells Ingrid aside and tells her about a sex video she was supposed on, Ingrid's doubts come to a head. As we get a montage of the various doubts, included never-before revealed information, the producers seem to conclude that they're screwed. The Pearl Necklace Eviction Ceremony is left in a cliffhanger.","production_code":"","runtime":60,"season_number":2,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5254112a19c295794033f693","adult":false,"gender":2,"id":126423,"known_for_department":"Writing","name":"Andrew Green","original_name":"Andrew Green","popularity":1.176,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5254112a19c295794033f675","order":501,"adult":false,"gender":1,"id":1221601,"known_for_department":"Acting","name":"Jessica Makinson","original_name":"Jessica Makinson","popularity":2.996,"profile_path":null}]},{"air_date":"2004-07-05","episode_number":4,"episode_type":"standard","id":52723,"name":"Guess Who's Coming to Dinner","overview":"Following the cliffhanger of the previous episode, the Pearl Necklace eviction ceremony comes an end. Ingrid is given a Pearl Necklace and Ambrosia is tossed. Derek then \"slips\" and tells Omarosa to take her walk down the Last Chance for Love Trail of Tears and then gives a litany of every fake thing about the program that Ingrid has noted. She is invited to take a script and come on the show as an actress for $100,000 --- an offer which she accepts. In the Falcon Twist, Piper and Austin are asked to choose the door and then from the door comes Amanda, the new Jane Schmo. The Schmos play a game ported from the \"original British version of Last Chance for Love\" in which Gerald wins a Green Valley Spa trip and some private time with Piper. Piper's \"Mother\" and \"Father\" come on the show, which the Father as a real hard-line jerk. The male suitors are asked to do crazy things at dinner, and those that don't will have personal secrets revealed about them. Later, they are all hooked up to a lie-detector test, with Piper's parents giving him immunity from eviction because they feel that he would be the least likely to take advantage of their daughter. Bryce's wick is left unlit and he takes his walk down the Trail of Tears, but not before getting one last hug from Piper.","production_code":"","runtime":60,"season_number":2,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5254112a19c295794033f693","adult":false,"gender":2,"id":126423,"known_for_department":"Writing","name":"Andrew Green","original_name":"Andrew Green","popularity":1.176,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5254112a19c295794033f675","order":501,"adult":false,"gender":1,"id":1221601,"known_for_department":"Acting","name":"Jessica Makinson","original_name":"Jessica Makinson","popularity":2.996,"profile_path":null}]},{"air_date":"2004-07-12","episode_number":5,"episode_type":"standard","id":52724,"name":"Porked and Beans","overview":"The suitors are told to choose who they believe among them is least compatible with Austin and with Piper. Gerald is chosen least compatible with Piper and Eleanor is chosen least compatible with Austin. That means they each get some alone time with the respective bachelor and bachelorette - that is, until \"tragedy\" strikes. A Falcon Twist is interrupted for the \"news\" that Ingrid's grandfather died. As such, weepy Eleanor loses her alone-time to Ingrid. The suitors all take part in a game called Love is a Battlefield in which they must perform better than models at outrageous tasks for trips. Tim gets the dirty-talk of his life from Cammy, but it isn't enough to beat the apparently X-Rated performance of the models. Piper's supposed parents return, except now they're playing the roles of Austin's parents. The girls are given tasks to perform and all complete them except Cammy. Her Porked and Beans soft-core video is played, but Austin tosses Ingrid, saying that she had lied to him about her grandfather.","production_code":"","runtime":60,"season_number":2,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5254112a19c295794033f693","adult":false,"gender":2,"id":126423,"known_for_department":"Writing","name":"Andrew Green","original_name":"Andrew Green","popularity":1.176,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5254112a19c295794033f675","order":501,"adult":false,"gender":1,"id":1221601,"known_for_department":"Acting","name":"Jessica Makinson","original_name":"Jessica Makinson","popularity":2.996,"profile_path":null}]},{"air_date":"2004-07-19","episode_number":6,"episode_type":"standard","id":52725,"name":"Requiem for a Frog","overview":"Austin realizes that he made a mistake in evicting Ingrid from the show when he learns that he was indeed speaking with the wrong grandfather on the phone. Ingrid is returned to the show in the new \"Circle of Life\" ceremony. Bryce sends another message from the sky - asking if everyone saw his last banner. It's revealed that Austin and Piper were a couple not long before the show started. After playing a game with dolls of Austin and Piper, Tim and Amanda win a double-date with not-so-happy couple. Eleanor goes super-weepy after she finds out that Austin used a coupon from her coupon book - for a foot massage from Cammy! Drama erupts during the double-date and Tim and Amanda must convince both Piper and Austin to continue with the show. Everett, Bryce's frog, is taken away from Cammy and moved to the same trailer as Montecore the falcon. One of the producers reveals that Montecore decided that Everett would be a good snack and Cammy mourns the loss of the frog, but Tim doesn't want any part of it. There's another Pearl Necklace ceremony because Ingrid returned to the show and this time Eleanor rejects Austin's offer of a Pearl Necklace, forcing a sham ceremony where the outcome is already known.","production_code":"","runtime":60,"season_number":2,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5254112a19c295794033f693","adult":false,"gender":2,"id":126423,"known_for_department":"Writing","name":"Andrew Green","original_name":"Andrew Green","popularity":1.176,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5254112a19c295794033f675","order":501,"adult":false,"gender":1,"id":1221601,"known_for_department":"Acting","name":"Jessica Makinson","original_name":"Jessica Makinson","popularity":2.996,"profile_path":null}]},{"air_date":"2004-07-26","episode_number":7,"episode_type":"standard","id":52726,"name":"Cruiser","overview":"Bryce sends his final message by plane - LOOK BEHIND U and then returns to the show. Derek explains for the benefit of our Schmos that since Austin got to return Ingrid to the show, they felt it would only be fair to let Piper return Bryce. Cammy's Porked and Beans food-fetish video is played for all to see, now with special extended footage that the girls didn't get to see before. The suitors play a game called Professions of Love in which they must express their love for Austin (Romeo) or Piper (Juliet) in the best way they know how. T.J. and Cammy are selected for one-on-one dates, but then the twist comes that they're not so private after all. Throughout the dates, the other suitors say things to them by microphone and they must repeat whatever is said to them during their date. Later, Gerald reveals to Bryce what everyone had been skirting around the entire episode: that his prized frog, Everett is dead. Bryce predictably goes ballistic and lets out his anger on T.J., before finally shifting it to the falcon, Montecore. Later, Tim catches them all out of character, but the situation seems to be smoothed over. Later, Austin is given the power to eliminate of the guys in a special Pearl Necklace ceremony and chooses our very own Joe Schmo: Tim.","production_code":"","runtime":60,"season_number":2,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5254112a19c295794033f693","adult":false,"gender":2,"id":126423,"known_for_department":"Writing","name":"Andrew Green","original_name":"Andrew Green","popularity":1.176,"profile_path":null}],"guest_stars":[]},{"air_date":"2004-08-02","episode_number":8,"episode_type":"standard","id":52727,"name":"T.J. Needs T.P.","overview":"Tim, staying a nearby hotel, is told by Derek that he has been asked back on the show due to another male suitor committing a rules violation. When he returns, it's revealed that Bryce could not control his anger against the falcon Montecore and it was found dead. He is taken away from the mansion, but not before a sad protest that he did not kill the falcon and was only interested in a game of water. The suitors play another sexually charged game called Bound by Love and then take dance lessons all chained together. T.J. experiences major diarrhea and when he goes for a change of underwear, Gerald finds that T.J. has hidden his aquasocks. Without these, he's been left with sponge-bathing for the past four days. The two participate in a dance-off and the girls agree that Gerald gave the better performance and that T.J. will go home in that night's Double Trouble eviction ceremony. At the ceremony, Austin evicts Cammy, saying that he's sorry. Piper decides to evict Gerald and Gerald protests with T.J., but Derek says that their \"dance-off\" was not an official function. Derek then reveals a special Falcon Twist (sans Montecore, although all are supposed to pretend the bird's still there): that Austin and Piper are considering rekindling their romance.","production_code":"","runtime":60,"season_number":2,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5254112a19c295794033f693","adult":false,"gender":2,"id":126423,"known_for_department":"Writing","name":"Andrew Green","original_name":"Andrew Green","popularity":1.176,"profile_path":null}],"guest_stars":[]},{"air_date":"2004-08-10","episode_number":9,"episode_type":"finale","id":52728,"name":"Finale","overview":"After a brief recap of past show events, viewers witness the finale of Joe Schmo 2. Everyone remaining is given some final time to make their case with Austin and Piper before the next elimination and Ingrid tries to make her case by presenting Austin with a resume complete with cover letter. Tim and Amanda are tricked when they're placed in limos thinking they're heading home, but it turns out that Austin and Piper are inside. Both must do some fast explaining to Austin and Piper after a Falcon Twist reveals that they had also been playing for money. Later, they dress up as their own cousins to find out what Austin and Piper really think of them, but hoax is revealed during a game of badminton. Things come to a head in the Last Chance for Love \"promise ceremony\" when the big deception is finally revealed.","production_code":"","runtime":60,"season_number":2,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[{"department":"Writing","job":"Writer","credit_id":"5254112a19c295794033f693","adult":false,"gender":2,"id":126423,"known_for_department":"Writing","name":"Andrew Green","original_name":"Andrew Green","popularity":1.176,"profile_path":null}],"guest_stars":[{"character":"","credit_id":"5254112919c295794033f5c9","order":500,"adult":false,"gender":1,"id":41091,"known_for_department":"Acting","name":"Kristen Wiig","original_name":"Kristen Wiig","popularity":31.716,"profile_path":"/p4QYkJ7EboyhzQcexH86SgCOki7.jpg"}]}],"name":"Season 2","overview":"","id":2831,"poster_path":null,"season_number":2,"vote_average":0},"3":{"_id":"5254112819c295794033f541","air_date":"2013-01-08","episodes":[{"air_date":"2013-01-08","episode_number":1,"episode_type":"standard","id":52730,"name":"The Bounty Begins","overview":"In the Season 3 premiere, Chase believes he's signed on for a reality show that puts him in a competition to become a bounty hunter, but his \"opponents\" are actually improv actors portraying stereotypes.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-08","episode_number":2,"episode_type":"standard","id":52731,"name":"A Date With Lady Justice","overview":"Chase's loyalty is tested after an alarming revelation, while Lorenzo Lamas gets onto the banana hammock business.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-15","episode_number":3,"episode_type":"standard","id":52732,"name":"Schmo in the Wild","overview":"Chase gets bloodied and sent to the hospital after a challenge goes awry.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-22","episode_number":4,"episode_type":"standard","id":52733,"name":"Say Hey to Ray Ray","overview":"Chase steps up to assist Lavernius when he decides to reveal his secret to the group. Later, Chase's resolve is tested via snakes, drugs and female breasts; and he witnesses an alarming eviction ceremony.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-01-29","episode_number":5,"episode_type":"standard","id":52734,"name":"Bring Your Convict to Work Day","overview":"Chase is chained to a prison inmate, and the show is put in jeopardy when the convict makes a run for it.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-05","episode_number":6,"episode_type":"standard","id":52735,"name":"An Actor Among Us!","overview":"The produces scramble to keep the show from falling apart after Chase begins suspecting a set-up.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-12","episode_number":7,"episode_type":"standard","id":52737,"name":"Is That a Gun in Your Pocket?","overview":"Chase is shocked when Skylar hears a message from her dead husband; Wanda gives a lesson in frisking.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-19","episode_number":8,"episode_type":"standard","id":52736,"name":"Fear No Evil","overview":"The cast must face their deepest fears; Chase helps Jake make a new commercial.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-02-26","episode_number":9,"episode_type":"standard","id":52738,"name":"The Rise of the Lamas","overview":"A previously evicted competitor returns; Chase conquers a deep fear.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2013-03-05","episode_number":10,"episode_type":"finale","id":52710,"name":"The Reveal","overview":"Chase goes on a spiritual journey to track down his own fugitive.","production_code":"","runtime":60,"season_number":3,"show_id":993,"still_path":null,"vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 3","overview":"","id":2833,"poster_path":null,"season_number":3,"vote_average":0}}}