{"adult":false,"backdrop_path":"/rCBP0nQtDQjiIuJmEd6C8rCtL6p.jpg","created_by":[{"id":1794442,"credit_id":"5e9df5b5e22d28001b62f9b6","name":"Choi Young-hoon","gender":0,"profile_path":null}],"episode_run_time":[65],"first_air_date":"2020-04-27","genres":[{"id":35,"name":"Comedy"},{"id":10759,"name":"Action & Adventure"}],"homepage":"https://programs.sbs.co.kr/drama/goodcasting/","id":99497,"in_production":false,"languages":["ko"],"last_air_date":"2020-06-16","last_episode_to_air":{"id":2311191,"name":"Finally Catching Michael / Six Months Later","overview":"Chan Mi saves Mi Soon and Ye Eun from Wang Kai. Meanwhile, Secretary Byun arrives in Jeju and chases Michael down. He succeeds in taking the chip away from Michael but ends up getting hurt. The operation comes to a close and six months go by. Chan Mi finds herself face to face with Seok Ho and her team once again.","vote_average":0,"vote_count":0,"air_date":"2020-06-16","episode_number":16,"episode_type":"finale","production_code":"","runtime":68,"season_number":1,"show_id":99497,"still_path":"/XJOOXa44iPkamoFK9c6UIH0YwP.jpg"},"name":"Good Casting","next_episode_to_air":null,"networks":[{"id":156,"logo_path":"/uHQFPvRTlpgaIFQVN8eKWEnFOll.png","name":"SBS","origin_country":"KR"},{"id":6712,"logo_path":"/zKNiqFOaHmjhVEA4pUqEWvrhTPO.png","name":"1001TV","origin_country":"IQ"}],"number_of_episodes":16,"number_of_seasons":1,"origin_country":["KR"],"original_language":"ko","original_name":"굿캐스팅","overview":"Baek Chan-Mi was a legendary black agent for the NIS, but, due to her excessive work, her subordinate died and she missed catching her intended target. Baek Chan-Mi was punished for that botched case and she now works in a cyber security team for the NIS. Baek Chan-Mi is then selected to go undercover on a case involving intellectual property theft at Korea's largest company.","popularity":6.707,"poster_path":"/i1jApjWNTCERcUq3tXRjYYjOn2X.jpg","production_companies":[{"id":129258,"logo_path":null,"name":"Box Media","origin_country":""},{"id":38369,"logo_path":"/uHQFPvRTlpgaIFQVN8eKWEnFOll.png","name":"Seoul Broadcasting System","origin_country":"KR"},{"id":83914,"logo_path":"/nFcR2kd7vl5O3TITQs6x39BNo6Y.png","name":"Studio S","origin_country":"KR"}],"production_countries":[{"iso_3166_1":"KR","name":"South Korea"}],"seasons":[{"air_date":"2020-04-27","episode_count":16,"id":143489,"name":"Season 1","overview":"Baek Chan Mi is a legendary agent for the National Intelligence Service. However, due to an excessive operation, one of her subordinates passes away. After this incident, she takes back all hope of returning to the field when she gets an order to go undercover. She begins working as a secretary for Ilkwang Hitech under the name, Baek Jang Mi. She is joined by a single mother, Im Ye Eun, who has the beauty of a girl group member, and Hwang Mi Soon, a housewife of 18 years whose family believes her to be an insurance salesperson. These three women begin to work together. Meanwhile, Ilkwang Hitech’s CEO, Yoon Seok Ho, knew Chan Mi as his tutor and had a crush on her. He can’t help but think that his new secretary, who looks exactly like his first love but has a different name and age, is a bit suspicious.","poster_path":"/BcFzqlcLd8LYhILjlTttxEZquh.jpg","season_number":1,"vote_average":0}],"spoken_languages":[{"english_name":"Korean","iso_639_1":"ko","name":"한국어/조선말"}],"status":"Ended","tagline":"Exciting, entertaining, exhilarating—a refreshing action comedy!","type":"Scripted","vote_average":6.9,"vote_count":9,"season_data":{"1":{"_id":"5e4a20219b861600116326fc","air_date":"2020-04-27","episodes":[{"air_date":"2020-04-27","episode_number":1,"episode_type":"standard","id":2165389,"name":"The New Team / Three Years Ago","overview":"Part 1: A gang of industrial spies led by a man named Michael Lee kills off an entire team of National Intelligence Service Agents. Dong Gwan Su becomes the new leader of Industry Security Team 3 and must put together a group of agents. However, his choices are limited and with the deputy head’s orders, he has to take an eccentric agent on board. Part 2: The story of how Chan Mi ended up taking the blame for losing Michael Lee and going to prison is revealed. Three years ago, in full swing of the operation to catch Michael, Ye Eun gives birth to her baby alone. Both Chan Mi and Mi Soon suffer a blow when they lose a teammate. Now the three women must come together to catch Michael once and for all.","production_code":"","runtime":64,"season_number":1,"show_id":99497,"still_path":"/zWxlx4bA9UCQcTYr1lZteika1oq.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-04-28","episode_number":2,"episode_type":"standard","id":2242412,"name":"Job Interviews and First Day of Work / Obstacles at Every Turn","overview":"Part 1: Chan Mi, Mi Soon, and Ye Eun get their new assignments. However, before they can approach their targets, they must infiltrate Il Kwang Hitech by getting hired as employees. Meanwhile, Ye Eun struggles to adjust to working in the field. Worried about her daughter, she keeps making mistakes at work. Part 2: Ye Eun must talk to her celebrity target, Woo Won, and convince him to renew his contract with Il Kwang Hitech, but she messes up tremendously. Meanwhile, Chan Mi goes into CEO Yoon Seok Ho’s office and Mi Soon sneaks into Il Kwang’s research center to install a camera. However, they both end up getting stuck in place.","production_code":"","runtime":63,"season_number":1,"show_id":99497,"still_path":"/2JIML6rja6E95SzJOFzDYghFnHW.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-04","episode_number":3,"episode_type":"standard","id":2242413,"name":"Getting Out Undetected / A Glimpse into the Dark Connections","overview":"Part 1: Chan Mi and Mi Soon must escape from the CEO and Head of Research’s office before they get caught. Chan Mi manages to get out, but she realizes she forgot to bring the flash drive. When she goes back in, Seok Ho spots her and strikes up a conversation. Meanwhile, Ye Eun and Chan Mi go into the research center to rescue Mi Soon. Part 2: The team finally escape from their first mission, but Chief Tak Sang Gi has suspicions about Seok Ho’s new secretary and starts digging. Meanwhile, Woo Won’s manager gets a call to deliver the package that was smuggled out of Il Kwang’s research center. As Chan Mi and Seok Ho eat lunch together in the corporate cafeteria, Sang Gi approaches them.","production_code":"","runtime":63,"season_number":1,"show_id":99497,"still_path":"/zOzvXo3G8w4YO9BYKPFgdeL2Ss3.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-05","episode_number":4,"episode_type":"standard","id":2242414,"name":"Visiting a Celebrity and Going to a Club / Code Blue","overview":"Part 1: As Ye Eun goes to Woo Won’s house to convince him to renew his modeling contract with Il Kwang Hitech, Chan Mi and Mi Soon track down Tak Sang Gi to a club. Things don’t go as planned, as always. Meanwhile, Woo Won’s manager Cheol Woong runs off after planting an important item in Woo Won’s place. Part 2: While trying to hack into Woo Won’s home security system, Ye Eun sees a suspicious shadow lurking around. Before they know it, they’re both tied up in the trunk of a car. Ye Eun uses her tracking device to signal a Code Blue and the rest of the team rush to save her. Will the team be able to get out of this safe and sound?","production_code":"","runtime":62,"season_number":1,"show_id":99497,"still_path":"/oDF7LIz5ZtdKKBd5w58uX6TD4NH.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-11","episode_number":5,"episode_type":"standard","id":2267045,"name":"High Speed Chase / Tracking Down The Chip","overview":"Part 1: Gwan Su gets shot while the team goes to save Ye Eun, but thankfully he is okay. Meanwhile, Chan Mi chases down Tak Sang Gi’s secretary, Koo Tae Rim, on a motorcycle. Mi Soon and Ye Eun follow along in the van and arrest Secretary Koo. With the information they get from interrogating her, the team heads to the airport. Part 2: The team gets on a flight heading to Taiwan in chase of Pi Cheol Woong, Woo Won’s former manager who stole a chip containing information from Il Kwang Hitech. Chan Mi disguises herself as a pregnant passenger while Mi Soon goes in as a flight attendant. Meanwhile, Ye Eun must cater to the whims of Woo Won, who is pickier than ever.","production_code":"","runtime":64,"season_number":1,"show_id":99497,"still_path":"/jXnzZwCr3qmGuz3qx5SWnqamiva.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-12","episode_number":6,"episode_type":"standard","id":2267046,"name":"Flying Back / Defusing The Bomb","overview":"Part 1: The team flies back to Korea with Pi Cheol Woong in handcuffs. They put on an act to scare him into telling them about his orders. The team prepares to lure and capture Wang Kai when he comes to Korea to pick up the package. Meanwhile, Ye Eun must look after Woo Won, who experiences a severe allergic reaction on the plane. Part 2: The team prepares for their show down with Wang Kai’s men and gets Pi Cheol Woong to cooperate. Meanwhile, Ok Cheol takes charge of the operation under Director Myeong’s orders and he is eager to do a better job than Tak Sang Gi. The operation begins, but right from the start, Chan Mi, Ye Eun, and Mi Soon walk into an unexpected dangerous situation.","production_code":"","runtime":61,"season_number":1,"show_id":99497,"still_path":"/49w9G7Es6vZnrH3QuSYuVg06VyT.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-18","episode_number":7,"episode_type":"standard","id":2275724,"name":"A Possible Leak / Back In The Lab","overview":"Part 1: The team manages to get out alive from the explosion, but their key suspect dies. Pi Cheol Woong ends up in the hospital after the traumatic incident, leaving the team without any good leads. While getting an earful about the operation going south from Chief Seo, Gwan Su states that he suspects someone is leaking information from inside the NIS. Part 2: Gwan Su and Mu Hyeok get a new lead on Michael’s whereabouts and call the rest of the team to a hotel. Chan Mi does not respond to the call but ends up running into Mi Soon at the hotel. However, Ok Cheol gets a text message from Michael, letting him know that the NIS is on to him. Mi Soon goes back into Il Kwang’s lab to get Michael’s contact information.","production_code":"","runtime":64,"season_number":1,"show_id":99497,"still_path":"/riRGtkmAVGMaxGqxhTNzBYEzimt.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-19","episode_number":8,"episode_type":"standard","id":2275725,"name":"Being Followed / Coming Face To Face","overview":"Part 1: Michael’s phone number leads back to an unexpected person and Ok Cheol uses his computer to reverse hack Ye Eun’s laptop. Now that Michael’s people know that Chan Mi and the team are from the NIS, Chan Mi starts to notice that she is being followed by mysterious men. Meanwhile, she must drive Seok Ho to an unofficial business trip. Part 2: Chan Mi and Seok Ho go to his father’s grave together and Chan Mi realizes that Chairman Yoon’s death must have something to do with Michael as well. Meanwhile, Ye Eun gets called to Woo Won’s house to cook for him and she gets fed up with his antics. Both Chan Mi and Ye Eun come face to face with the mysterious men who are tailing them.","production_code":"","runtime":65,"season_number":1,"show_id":99497,"still_path":"/bdpJGm0MJWdBfPjRsMn6Ve7kqAA.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-25","episode_number":9,"episode_type":"standard","id":2283418,"name":"Threats and Secrets / An Offer from the Enemy","overview":"Part 1: Ye Eun gets asked to report to a mysterious someone about the team’s activities while Chan Mi realizes that the man following her is also an agent at the NIS. Meanwhile, Tak Sang Gi contacts Director Myeong and threatens to tell the world his secrets unless he receives a large sum of money. Later on, someone breaks into Pi Cheol Woong’s hospital room. Part 2: Seok Ho and Chief Secretary Byun plan to steal Director Myeong’s hidden ledgers. Meanwhile, Chan Mi’s suspicions on Chief Seo grows as she realizes that he sent the agent to follow her to Busan. The team is about to get disbanded after Pi Cheol Woong’s death and Chan Mi suggests to her teammates that they trust an unlikely figure.","production_code":"","runtime":66,"season_number":1,"show_id":99497,"still_path":"/z2qmMtEFGbP6tpD3x3x4J49zHIg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-05-26","episode_number":10,"episode_type":"standard","id":2283419,"name":"Finding a Way In / Breaking and Entering","overview":"Part 1: The NIS begins to take away the team’s equipment and access to the network. Without the support of the NIS, the team decides to find a way into Director Myeong’s office to find the secret ledger. Meanwhile, Chan Mi follows Seok Ho on an inspection tour of a construction site where she runs into an unexpected obstacle. Part 2: Seok Ho’s suspicion that his new secretary is actually the same person as his old tutor continues to grow as they spend more time together alone. However, Seok Ho’s ex-wife pays another visit and lets Chan Mi know that she has figured out Chan Mi’s real identity. Meanwhile, the team begins the operation to break into Director Myeong’s office.","production_code":"","runtime":64,"season_number":1,"show_id":99497,"still_path":"/6NovR8sbGKlQjlUQPIvKiTPWvgO.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-01","episode_number":11,"episode_type":"standard","id":2292173,"name":"Luring in Chief Seo / Identity Revealed","overview":"Part 1: The team succeeds in stealing Director Myeong's ledger. They use Ye Eun and the ledger to lure Chief Seo. Even after he is caught, Chief Seo seems to have no intention of giving up easily. He brazenly demands that Chan Mi bring evidence to incriminate him. Meanwhile, Mi Soon has trouble at home and Ye Eun reads something shocking in an old report. Part 2: Seok Ho finally confronts Chan Mi about her identity. Seok Ho is upset that Chan Mi lied to him while Chan Mi still can’t really tell him that it was for an undercover mission. However, Chief Secretary Byun discovers her identity. Chan Mi is fired from her job at Il Kwang and on top of that, Ye Eun asks her about Min Seok's death.","production_code":"","runtime":64,"season_number":1,"show_id":99497,"still_path":"/3x9JVAiplWf1Uh3Lmt9NoG4fIyb.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-02","episode_number":12,"episode_type":"standard","id":2292174,"name":"Chan Mi Gets Shot / Critical Condition","overview":"Part 1: Chan Mi goes off to meet Tak Sang Gi on her own where Michael suddenly appears and kills Tak Sang Gi. Ye Eun and the team quickly trace Chan Mi's car and arrive on the scene. However, Chan Mi ends up getting shot. Meanwhile, Seok Ho finds out that Chan Mi is in the hospital and rushes over. Part 2: While stuck in the interrogation room, Chief Seo tries to use his connections to get himself out of trouble, but to no avail. Director Myeong orders Ok Cheol to take Chief Seo out. Meanwhile, Mi Soon goes to her daughter’s school to find out that she hasn’t been a good enough mom. Then, she gets a phone call about Chan Mi’s condition.","production_code":"","runtime":66,"season_number":1,"show_id":99497,"still_path":"/gO2usAxtYUvs7Oya7BZkZjlIClf.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-08","episode_number":13,"episode_type":"standard","id":2294869,"name":"Chan Mi Goes Back to Work / Working Together","overview":"Chan Mi checks herself out of the hospital despite everyone's best efforts to stop her. Meanwhile, Woo Won hears about Ye Eun getting fired over his contract annulment and goes to Il Kwang to help her. Later on, Seok Ho and Secretary Byun get in trouble while tailing Director Myeong. When Chan Mi comes to the rescue, Seok Ho suggests that they start working together.","production_code":"","runtime":69,"season_number":1,"show_id":99497,"still_path":"/yt3bhl3PPVj4fie3RGrc4l7kfcg.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-09","episode_number":14,"episode_type":"standard","id":2294870,"name":"Director Myeong Gets Arrested / Teaching The Bullies A Lesson","overview":"Chan Mi and the team finally arrest Director Myeong, but they lose Chief Seo in the process. Meanwhile, Mi Soon goes to her daughter's school to talk to the bullies' mothers. However, when they refuse to admit that their kids were in the wrong, Chan Mi and Ye Eun step up to help put a stop to the bullying. The team also figures out who Michael is.","production_code":"","runtime":68,"season_number":1,"show_id":99497,"still_path":"/jfMGYI8blPTY6ObzMPWnGarnQ2g.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-15","episode_number":15,"episode_type":"standard","id":2294871,"name":"Michael’s Identity Is Revealed / Heading To Jeju Island","overview":"Michael turns out to be Ok Cheol, the head of research at Il Kwang's Research Center. The team follows Ok Cheol and Wang Kai to Jeju Island to stop their next transaction. Meanwhile, Seok Ho finds himself at risk of losing his position as the CEO of Il Kwang Hitech and voluntarily goes to the prosecution for questioning.'","production_code":"","runtime":67,"season_number":1,"show_id":99497,"still_path":"/zbi0luZbqwGUwfNytZ1BpAx8oab.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]},{"air_date":"2020-06-16","episode_number":16,"episode_type":"finale","id":2311191,"name":"Finally Catching Michael / Six Months Later","overview":"Chan Mi saves Mi Soon and Ye Eun from Wang Kai. Meanwhile, Secretary Byun arrives in Jeju and chases Michael down. He succeeds in taking the chip away from Michael but ends up getting hurt. The operation comes to a close and six months go by. Chan Mi finds herself face to face with Seok Ho and her team once again.","production_code":"","runtime":68,"season_number":1,"show_id":99497,"still_path":"/XJOOXa44iPkamoFK9c6UIH0YwP.jpg","vote_average":0,"vote_count":0,"crew":[],"guest_stars":[]}],"name":"Season 1","overview":"Baek Chan Mi is a legendary agent for the National Intelligence Service. However, due to an excessive operation, one of her subordinates passes away. After this incident, she takes back all hope of returning to the field when she gets an order to go undercover. She begins working as a secretary for Ilkwang Hitech under the name, Baek Jang Mi. She is joined by a single mother, Im Ye Eun, who has the beauty of a girl group member, and Hwang Mi Soon, a housewife of 18 years whose family believes her to be an insurance salesperson. These three women begin to work together. Meanwhile, Ilkwang Hitech’s CEO, Yoon Seok Ho, knew Chan Mi as his tutor and had a crush on her. He can’t help but think that his new secretary, who looks exactly like his first love but has a different name and age, is a bit suspicious.","id":143489,"poster_path":"/BcFzqlcLd8LYhILjlTttxEZquh.jpg","season_number":1,"vote_average":0}}}